[
  {
    "text": "Here are my top two option strategies for small accounts. If you have a small trading account, you are at a perilous point in your trading career because it is very difficult to create logical, risk-reward relationships with such constrained capital. So the goal of this video is to walk you through the exact two strategies that I would use and did use when I did the small stack segment a long time ago that tested a 5,000 account. The goal at the end of the video is for you to have two more tools to add to your toolkit so that you can hopefully find different approaches other than the vertical spreads that are slowly losing you money and not making you enough for them to make sense. What's up everybody? Eric here. Welcome back to all the outliers. Shout out to the Patreon family. Let's get straight into the top two option strategies for small accounts. Okay, first let's talk about the scenario that we're in because it's not good. Small accounts in my world are anything below 150,000, 200,000. That doesn't really matter. You might see that number be like, oh okay, that's giant number. It's not the point. The point is that anything really below portfolio margin, there are different things that apply to you, but the smaller your account is on this spectrum, the more constrained you are. That's why you are compromised at the starting point because you are unable to put on enough",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=0"
    }
  },
  {
    "text": "the point. The point is that anything really below portfolio margin, there are different things that apply to you, but the smaller your account is on this spectrum, the more constrained you are. That's why you are compromised at the starting point because you are unable to put on enough trades in order to diversify your risk, you're constrained in terms of the products you can even trade. The list goes on and on. Not to mention what you see here, if you have a small account, you're probably new to trading. That means that your skill set isn't there yet. You're still learning that. Then probably your expectations are broken because just about all of us that are new to trading have really bad expectations. No shit, that's interesting. So all of these things together create a pretty tenuous starting point for most traders. So I would offer to you a quick exercise to help us base our expectations. If we have a 5,500 account, which is the average US brokerage account, and you make a 30 return on your money, that's only 1,650. This does not seem like a giant return. It's only 1,600, but a 30 return literally is outperforming my compound annual growth rate from 2007. That's not to say that that's any significant benchmark, but I've spent a lot of time doing this stuff and I have just over a 20 compound annual growth rate. So what I'm trying to highlight here is even with",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:35",
      "start_timestamp_seconds": 95.76666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=95"
    }
  },
  {
    "text": "literally is outperforming my compound annual growth rate from 2007. That's not to say that that's any significant benchmark, but I've spent a lot of time doing this stuff and I have just over a 20 compound annual growth rate. So what I'm trying to highlight here is even with an outstanding return, the money, the raw dollar is not that appealing. Yet if you look at what I would consider to be a very reasonable return for an account, 10, it's only 550. Nobody cares about that, unfortunately. So why do I think your primary objectives here should be preservation of capital, skill set development, and data collection? It's because even if you get this crazy good return, it's not a lot of money. So in order to get this crazy good return, you're probably going to take on quite a bit of risk, and again, it's not worth the payout. So for small accounts, the number one thing you need to do is save money. That is without a doubt your top priority. Now in the actions of trading, these in my opinion are great goals for you to have. Reservation of capital, skill set development, data collection. So let's take a look at some context here. If you have a small account and you suffer, let's say 40 drawdown, you now need to make 66.7 return in order to get back to break even. So these kinds of drawdowns can be catastrophic. And to further make this",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:03:11",
      "start_timestamp_seconds": 191.53333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=191"
    }
  },
  {
    "text": "So let's take a look at some context here. If you have a small account and you suffer, let's say 40 drawdown, you now need to make 66.7 return in order to get back to break even. So these kinds of drawdowns can be catastrophic. And to further make this point, if you take a look at portfolio one here, it returns 7.35 compound annual growth rate with an ending balance of 142,000, 550. And if we take a look at the average return, it's only 7.4. But if you take a look at portfolio three, it has a better average return of 8.6, but a compound annual growth rate 6.8, and the ending value is only 139. So in portfolio one, even though you have a worse average return because you didn't have this drawdown, you made more money. And to drive this home just a little bit more, if you have the same exact portfolio performance between portfolio one and portfolio two, the only difference is this right here. Portfolio two in year three lost 5, and portfolio one made just 2. Notice the difference between the performance here. So what I want you to take away from here is that you can win in trading via three things. Create better returns that's very difficult, but doable up to a certain degree, avoiding drawdowns. Those two things combined are actually a really efficacious way to make a lot of money trading. So it's not just about making better",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:04:47",
      "start_timestamp_seconds": 287.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=287"
    }
  },
  {
    "text": "here is that you can win in trading via three things. Create better returns that's very difficult, but doable up to a certain degree, avoiding drawdowns. Those two things combined are actually a really efficacious way to make a lot of money trading. So it's not just about making better returns, but avoiding drawdowns. So all of that to set the table, let's talk about these two strategies. The first one is the coverage strangle. There should be no surprise to anybody at all. You can say that again, pal. The second is a ratio diagonal. So what I want to walk you through now is kind of a comparison of these two strategies so that you understand how they may or may not fit into your toolkit. So the coverage strangle and ratio diagonal, I have videos and entire playlists around both of these. I'll throw them in the notes below, but quick refresh. The structure for the coverage strangle is that it's going to be a cash secured put that you cycle until you are assigned at which point you will deploy a ratio covered call plus additional cash secured puts. So really this uncaps upside potential here, and then this helps us manage our bases by essentially dollar cost averaging in. Now the ratio diagonal, a little bit different. It's going to be either a long call plus a short call or a long put plus a short put. There's some specific details that I typically deploy",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:06:23",
      "start_timestamp_seconds": 383.06666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=383"
    }
  },
  {
    "text": "and then this helps us manage our bases by essentially dollar cost averaging in. Now the ratio diagonal, a little bit different. It's going to be either a long call plus a short call or a long put plus a short put. There's some specific details that I typically deploy for these strategies, which again, you can check out in the standalone videos, but you'll notice right out of the gate, these are structured quite a bit differently, and that's for a reason. For something like the coverage strangle, I use it to build a core position. So I like to trade things like index ETFs, sector ETFs, and even for a small account, you can find products that make sense for trading something like the coverage strangle, which I'll actually go into at the end of the video. When we look at something like the ratio diagonal, again, a little bit different here. In this case, we're looking at something that allows us to trade directionally, either bullish or bearish. So coverage strangle, building a core position that we might hold for a long period of time, also for neutral market conditions, ratio diagonal, we want to be directional here. What are the benefits of these different strategies? Well, the coverage strangle is super forgiving because if you're wrong on your cash secure put and you're assigned, you're assigned an asset, and if we're trading something like an index or sector ETF for a strong stock, that's not the",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:07:58",
      "start_timestamp_seconds": 478.83333333333337,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=478"
    }
  },
  {
    "text": "here. What are the benefits of these different strategies? Well, the coverage strangle is super forgiving because if you're wrong on your cash secure put and you're assigned, you're assigned an asset, and if we're trading something like an index or sector ETF for a strong stock, that's not the worst case. You could just hold on to that position. Plenty of people hold on to trades for really long periods of time, but that gives you plenty of time to be right, and it offers inherent diversification depending on what you're choosing to trade, which is great. When we look at something though like the ratio diagonal, it's very capital efficient. You expose yourself to leverage return potential, and these are defined risk right out of the gate. So you can immediately understand what your risk profile is on entry, and it's pretty efficient. Whereas if we look at something like the coverage strangle, it's a little bit different because in here, they're very expensive. If you're looking to cash secure position, you have to put aside quite a bit of money in order to do that. So they also can work very slowly. Let's say you're assigned on something and it continues to plummet down, you could choose to have some sort of stop loss in place there if you want to be able to redeploy your capital, or you might be holding something underwater for some time. Again, depending on how you set it up, it can",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:09:34",
      "start_timestamp_seconds": 574.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=574"
    }
  },
  {
    "text": "something and it continues to plummet down, you could choose to have some sort of stop loss in place there if you want to be able to redeploy your capital, or you might be holding something underwater for some time. Again, depending on how you set it up, it can take a little bit of time for the strategy to work out for you. Now, if we look at something like the ratio diagonal, a little bit different, these you have to be right in the correct amount of time. So there's two things that are happening. You have to pick a direction successfully in the correct amount of time while time decay is working against you. That's actually why we do things like go deep in the money, go further than three months out in time because that limits our theta decay exposure, but it's still working against you. So when we think about the allocation for these two different strategies, what does that look like? Well, for me, for the coverage string, let's up to 100. I would be happy to put 100 of my portfolio small account into an index ETF or a sector ETF and let it go. Just see how it does longer term. Now, for the ratio diagonal, it's a little bit different because these are speculative. They offer as great growth potential, but you have to be good at picking direction. So until you identify whether or not that's you, in this case,",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:11:10",
      "start_timestamp_seconds": 670.3666666666668,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=670"
    }
  },
  {
    "text": "it go. Just see how it does longer term. Now, for the ratio diagonal, it's a little bit different because these are speculative. They offer as great growth potential, but you have to be good at picking direction. So until you identify whether or not that's you, in this case, I would be a little bit more comfortable only allocating up to 75 of the portfolio, which again, that's still a ton to allocate. But if you're in a really small account, sometimes that's what you are stuck doing. So one choice here is to use a standard scan. I like to pick individual stocks that are within the SP 500 for the coverage strangle. They're just bigger companies and I really prefer them to be typically strong performers. So normally what I'll do is I'll look at a sector rotation strategy where I will see the top performing sectors for the past three months and look for individual tickers within those sectors that meet some basic criteria. In this case, looking within all of the SP 500 for stocks that are under 50 bucks, you'll see that there's two that emerged at the end of my view. And I'm looking for things that have EPS growth, revenue growth that are within the SP 500. And again, I'm going to look to see which sectors are the strongest performing. And if we take a look at a quick chart, you'll see that Wells Fargo actually looks pretty good here. So",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:12:46",
      "start_timestamp_seconds": 766.1333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=766"
    }
  },
  {
    "text": "looking for things that have EPS growth, revenue growth that are within the SP 500. And again, I'm going to look to see which sectors are the strongest performing. And if we take a look at a quick chart, you'll see that Wells Fargo actually looks pretty good here. So that would be something that I could do. Now, if you look at this and you say, well, if I traded a cash secured put and that would take 4,000 of my dollars and that's essentially my whole portfolio and one trade, again, that's the tradeoff of a small account. You have to determine if you're okay centralizing that much into an individual stock or you could do the next specs, next best thing. You could take that previous scan and open it up to non SP 500 products or you could look at ETFs. The reason why I like ETFs is because they definitely offer way more exposure to diversify risk so that you're not so centralized in an individual product. And you can find cheap ones. You have to go through and find things that have options, which is a little bit of a trick. You could do that in whatever platform. But in this case, what I did is I just scanned for ETFs that essentially traded for less than 50 bucks that are trading within the top 20 of the category and they were ranked in the top 20 of the category. So you can find",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:14:21",
      "start_timestamp_seconds": 861.9000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=861"
    }
  },
  {
    "text": "that in whatever platform. But in this case, what I did is I just scanned for ETFs that essentially traded for less than 50 bucks that are trading within the top 20 of the category and they were ranked in the top 20 of the category. So you can find things like this in scan through and look for things that fit into your account size. This is one of the problems of small accounts is that you have to do this. You have to scan for things and it's a bit more work to find things that make sense. The spiders ETFs are some of my favorites for smaller accounts. This is where you can grab something like XLF, which is the entire financial sector and it's only 30 bucks. So this is a great candidate for the coverage triangle. Same thing, you're going to get used to seeing some of the same names. Will Swargo Ford, like there's a bunch of individual companies that definitely still fall within this range. And the great part about the ratio diagonal, however, is that you really don't have to fight this struggle. You gain efficiency. You're not going to be able to trade everything, but a lot of products are quite approachable for even very small accounts with that. But you have to be good at getting direction cracked. So if you have any questions, comments, concerns, as always, let me know if this video is helpful. Consider liking it, sharing",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:15:57",
      "start_timestamp_seconds": 957.6666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=957"
    }
  },
  {
    "text": "to trade everything, but a lot of products are quite approachable for even very small accounts with that. But you have to be good at getting direction cracked. So if you have any questions, comments, concerns, as always, let me know if this video is helpful. Consider liking it, sharing it, leaving a comment below so that we can emerge from the YouTube algorithm and help other people find decent information other than the stereotypical make a gajillion dollars on your hundred dollar account every seven days, which typically results in just people losing all their money because they're set up for failure by some really predatory all YouTubers who suck. So let's not do that. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "mguT9A4DuBY",
      "title": "The BEST 2 Option Strategies for SMALL Accounts",
      "url": "https://www.youtube.com/watch?v=mguT9A4DuBY",
      "upload_date": "",
      "duration": 710.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:17:33",
      "start_timestamp_seconds": 1053.4333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mguT9A4DuBY&t=1053"
    }
  }
]