[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you I will stop Okay, well, there are no fucking close captions. Here we go. So this broke, but which there is a fucking bar that I can control where is that? I don't know if you saw it'll probably talk about it again. So that specific section that it was discussing is that the news finally broke on actual large news station that's game stop had started to be talking about investing in Bitcoin, right? So you can see that right now it's framed as sources and it's still in the process of figuring out if it's going to then there is the picture with sailor. So there was a ton of conjecture about if this was going to happen, but the fact that this moved from being just a picture to now actually hitting news print on Friday, this is a big part of that move. So if we go to X and we check out where Cohen, I don't remember the exact day that he posted that. So I'll tell you right now. Every time I just type in Cohen, there's like a million of them. I'm always surprised that I have to like go out of my way to type Ryan Cohen. It's actually kind of frustrated. Is this the right one? I think this is the right one. Is that correct? 444?",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 44,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=0"
    }
  },
  {
    "text": "time I just type in Cohen, there's like a million of them. I'm always surprised that I have to like go out of my way to type Ryan Cohen. It's actually kind of frustrated. Is this the right one? I think this is the right one. Is that correct? 444? He was kind of light in terms of followers for him. Anyways, he posted this. So now one of the things that Cohen does that we can clearly tell is he is cryptic, but he's also very intentional because he knows what his audience does. He knows that his audience, meaning the people that are going to see this are immediately going to start dissecting it and trying to figure out if there's some sort of hitting message, message meaning and so on and so forth. So this picture is interesting. Now he's also posted pictures with other people that may or may not have had anything materialized. A lot of people pointed out the picture that he took with icon. So he obviously takes pictures, right? So that that is what it is. But I do think that the timing of this is slightly interesting. And I do think that he absolutely has to know how much a lot of the stockholders of GameStop want it to be involved in cryptocurrency. I personally don't really share that position genuinely. I don't see anything inherently wrong with it, but to give you my actual opinion and I'm highlighting that this",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 44,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.85454545454546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=97"
    }
  },
  {
    "text": "that he absolutely has to know how much a lot of the stockholders of GameStop want it to be involved in cryptocurrency. I personally don't really share that position genuinely. I don't see anything inherently wrong with it, but to give you my actual opinion and I'm highlighting that this is an opinion. Most of what I will talk to you about is going to be way more objective, fast-paced, facts-based conversation. But the opinion in this case is I think that money should go into the company to make the company more successful as whatever they're trying to make it out to be. Meaning if they're going to pivot it more into this card grading services, who knows there could be a world where maybe there's some sort of exchange offering from GameStop for cryptocurrency. I think that would be a massive leap. I don't personally see it happening, but it could be, right? These are things that could be. So when I'm looking at the company though, I am, I don't want to say frustrated because it's not exactly frustration, but I am kind of like what the fuck is the plan? We've had that cash for a while now. It's over six months, essentially, that we've been sitting on billions in cash. And again, not saying that anything has to be completely, you know, not everything has to be completely quick or ironed out or anything like that. But we've been sitting on the cash for a",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 44,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.70909090909092,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=195"
    }
  },
  {
    "text": "while now. It's over six months, essentially, that we've been sitting on billions in cash. And again, not saying that anything has to be completely, you know, not everything has to be completely quick or ironed out or anything like that. But we've been sitting on the cash for a while. That cash is not doing much for us. And I know a lot of people are really happy to look at the interest, earn on the cash. The interest earn on the cash doesn't really matter. It really doesn't matter. That's that they're not a bank. They're not going to, they're not going to make a living that way. They need to do something with the money to drive revenue. So I think from that lens, everybody and specifically, again, being very clear of myself, very specifically is like, what are we doing with this money? I know there's a plan for it because again, he's a smart dude. He's around a lot of smart dudes. And he is somebody that I know is not just moving haphazardly. So I know there's a plan, but it's still obscure to shareholders. So this kind of thing is also very interesting to me because he knows all of this. He knows that all of the shareholders know that the stock had gone through a couple at the markets. And he knows that a lot of the shareholders know that there is a bunch of cash sitting there. He also knows that",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 44,
      "start_timestamp": "00:04:53",
      "start_timestamp_seconds": 293.56363636363636,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=293"
    }
  },
  {
    "text": "to me because he knows all of this. He knows that all of the shareholders know that the stock had gone through a couple at the markets. And he knows that a lot of the shareholders know that there is a bunch of cash sitting there. He also knows that the shareholders have no idea what the plan is for the cash. So when he starts throwing little things like this out there, it could be that he's trying to just give you something to go off of. But this idea, and I've seen this before, like Luke said the same thing, Luke is saying the same thing I've heard before where Luke is saying most people see GME becoming a birchhar, half the way type company, the card grading, Teddy investing in Bitcoin, or all moves GME investors probably like. And I agree that the investors like it, they need to because realistically right now for GameStop any movement is better than the current course for the company. Again, like let's just let's decouple the fact of like what GameStop is, what it represents to people and all of those elements. And like let's just look at it as a company as a company. It has to innovate itself. It has to just like every other company out there has to innovate itself. So I think the fact that GameStop is starting to innovate is massive. The fact that they're getting involved in card grading was huge. I think",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 44,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.41818181818184,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=391"
    }
  },
  {
    "text": "a company as a company. It has to innovate itself. It has to just like every other company out there has to innovate itself. So I think the fact that GameStop is starting to innovate is massive. The fact that they're getting involved in card grading was huge. I think that's a great first step and it's something that has to happen. Now the path for something like GameStop to become a birchshire, half the way is so obscure. And it's very different like the it's completely different than what birchshire half the way does. Does that mean that GameStop couldn't do it? I think they could potentially, but that's just a completely different thing. And if that's the direction that they were going to go, the pivot would probably look a lot different than it has so far in my opinion. I don't see how this current structure would lend to that objective very well, but it also could just be a future dated pivot. I think in the near term, the most important thing for GameStop is revenue and sales and keeping the lights on because they're doing a good job going through some cost cutting measures. They're getting rid of their unprofitable stores, which is also very important. So they're definitely conducting this pivot, which is so, so, so needed. Now the thing that we all continue to look at is what is the next move? And one of the things I was thinking about is that",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 44,
      "start_timestamp": "00:08:09",
      "start_timestamp_seconds": 489.2727272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=489"
    }
  },
  {
    "text": "getting rid of their unprofitable stores, which is also very important. So they're definitely conducting this pivot, which is so, so, so needed. Now the thing that we all continue to look at is what is the next move? And one of the things I was thinking about is that just like I understand and acknowledge that it's very clear from a lot of the GameStop base, meaning the shareholders really do want to see Bitcoin on the balance sheet. They want to see it. And again, I've already mentioned I don't personally feel that way about it, but I do wonder if he rightfully has some element of trying to take care of the shareholders in some small ways simply because the only reason why this company still exists is because of the shareholders. So there might be an element where he's like, you know, this is something that they really would like. They've talked about it voraciously all over the place. We can add a little bit of Bitcoin to the balance sheet. Like, and I don't think that would hurt anything. Now if they start turning into like a Bitcoin holding company again, that's just a completely different direction, which is not to say that it couldn't happen or it couldn't be profitable. It could be, which is completely different than what they're doing now. And based on the moves that they're making, if they were to make that shift, the way that they're going about it",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 44,
      "start_timestamp": "00:09:47",
      "start_timestamp_seconds": 587.1272727272727,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=587"
    }
  },
  {
    "text": "different direction, which is not to say that it couldn't happen or it couldn't be profitable. It could be, which is completely different than what they're doing now. And based on the moves that they're making, if they were to make that shift, the way that they're going about it right now, it doesn't really seem to make sense to me. So I think the addition of Bitcoin wouldn't be bad at all. I think it would be completely fine. And I think that as long as it's not putting a ton of money into it, but I think it's way more of, in my opinion, like a gesture as compared to something that is like, oh, yeah, this is a really good move for GameStop. Because again, right now, GameStop is a brick and mortar company. It does have obviously an online footprint, but it's a brick and mortar company. So it needs to do things in order to still survive as such. And the cool part is just because it's a brick and mortar company, it doesn't mean that things look bleak for it. Go drive around. You'll see tons of brick and mortar companies. They're there. They do a lot of different things that other places can't do. Think of if you want to go get a couch, most people don't just buy couch offline. They go to a store and go sit in the couch. There can be all different kinds of pivots that even from",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 44,
      "start_timestamp": "00:11:24",
      "start_timestamp_seconds": 684.9818181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=684"
    }
  },
  {
    "text": "do a lot of different things that other places can't do. Think of if you want to go get a couch, most people don't just buy couch offline. They go to a store and go sit in the couch. There can be all different kinds of pivots that even from a gaming perspective, GameStop can break into things that require a physical presence or are better enjoyed through a physical presence. But it's still too early to tell. Now I did think in its last earnings release that they might give some ideas. And they didn't. They essentially reiterated the message that they're looking at stuff, which is great. But it wasn't like this laundry list of potentials that they're looking at, things that they like, how they're view in the company's future, what they envision it. Which again, it's just a different management style. But a lot of places aren't quite as reserved with respect to at least talking about vision. And what they think something could be because that's not really guaranteeing anything and it's not starting down a specific path. It's just talking about visioning, which is still I think very useful. So overall, really interesting happenings this week. And obviously the market started to react to a lot of this news that we saw where there are now starting to be sources talking about the involvement in Bitcoin, which is very, very interesting. And again, this is through what CMBC report. So I don't know if",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 44,
      "start_timestamp": "00:13:02",
      "start_timestamp_seconds": 782.8363636363637,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=782"
    }
  },
  {
    "text": "this week. And obviously the market started to react to a lot of this news that we saw where there are now starting to be sources talking about the involvement in Bitcoin, which is very, very interesting. And again, this is through what CMBC report. So I don't know if they talked about where they got this information from or who the entity is that talked about it. But this says according to CMBC, which cited people familiar with the matter, right? So everything that I look at here, it's just kind of this broad, nebulous thing of like some people said some shit. We don't know who. That says is considering investing in Bitcoin and other cryptos, the shift would make the company more like micro strategy, which I don't even want to get into that. That's the last thing that I think games stop should do personally is go down the path of fucking micro strategy. But I digress, which relies on Bitcoin purchases, a core of its business strategy that might represent a more promising future for GameStop as sales of physical copies of games, Dwindle, which this is completely true, right? Physical sales of games definitely go down, but that doesn't mean that they can't get involved through the broader gaming sphere. It also doesn't mean that they can't get more involved in the PC side of things, right? Like there's a million different perspective directions that GameStop can go. So when you read stuff like",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 44,
      "start_timestamp": "00:14:40",
      "start_timestamp_seconds": 880.6909090909093,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=880"
    }
  },
  {
    "text": "go down, but that doesn't mean that they can't get involved through the broader gaming sphere. It also doesn't mean that they can't get more involved in the PC side of things, right? Like there's a million different perspective directions that GameStop can go. So when you read stuff like this, I just encourage you to not perceive this as GameStop is physical copies of games and therefore they're screwed because physical copies of games are slowing down slash essentially going away. There's so much more potential to the business in the industry than that. So just don't over read into this shit. There's still gamers. I was playing a video game earlier today. Still booming, but it's just shifting. And this goes back to that same message I continue to beat the drum of that they have to shift. They have to pivot. If they don't do that, then they will struggle, but they are starting to do that, which is very promising. Let's see. GameStop buying Bitcoin is a hail marry from a company with no viable business plans as Peter Schiff. Now here's the thing. Peter Schiff, as you all know, he's a personality. So the way he phrases things is very purposeful. It's designed to drive engagement and stuff like that. So again, you kind of have to take it with a grain of salt. But what he's talking about, again, looking at it from an objective perspective, he's not fully wrong. Like as it sits",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 44,
      "start_timestamp": "00:16:18",
      "start_timestamp_seconds": 978.5454545454546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=978"
    }
  },
  {
    "text": "he phrases things is very purposeful. It's designed to drive engagement and stuff like that. So again, you kind of have to take it with a grain of salt. But what he's talking about, again, looking at it from an objective perspective, he's not fully wrong. Like as it sits today, right now, with what we know about GameStop, it is not a viable business plan long term. Right? It's not. And I don't think there's anything controversial or negative in saying that that's not fud. It's saying that we can see it, right? We can see it in their earnings. But just because that Peter Schiff and the rest of us right now don't directly see what the business plan is. It doesn't mean that there's not one there. It could mean that there are pieces moving in the background that we're trying to protect, that we don't want additional injects coming in from information leaking, making whatever is going on behind the curtains more difficult to execute. It's essentially a leap of faith. It's a leap of faith in the management of the company until they start talking about it. That's exactly what it is. If you do not trust Ryan Cohen, then there's no reason to invest in GameStop. I happen to trust him. I think that he's trying to pivot something. And I think that he is pretty strategic in the way that he thinks and he goes about things. So my guess is there's a",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 44,
      "start_timestamp": "00:17:56",
      "start_timestamp_seconds": 1076.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1076"
    }
  },
  {
    "text": "not trust Ryan Cohen, then there's no reason to invest in GameStop. I happen to trust him. I think that he's trying to pivot something. And I think that he is pretty strategic in the way that he thinks and he goes about things. So my guess is there's a really good chance. We will hear something about it. It'll obviously be when things are further along or in a position where he's more ready to speak about it. May not here is I don't disagree with Peter Schiff that right now as it sits today, there isn't a viable business plan for GameStop. As it sits today, GameStop is in a very tenuous spot. But I also don't think that GameStop as it sits today is planning to just execute as it sits today. My entire speculation here is that GameStop is continuing to innovate and will continue to innovate. That's a big part of why you race cash is to open that potential. So this is where a lot of this movement came through at the end of the week. And that movement was really interesting because it had been in a very well-defined downward channel. But unfortunately, it's already starting to rally back down towards those lows. So this essentially to redraw some of these lines that you would have seen before, this represents the bottom of this volume node, essentially that it's sitting on. Now we can see that in this area here, there still was",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 44,
      "start_timestamp": "00:19:34",
      "start_timestamp_seconds": 1174.2545454545455,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1174"
    }
  },
  {
    "text": "it's already starting to rally back down towards those lows. So this essentially to redraw some of these lines that you would have seen before, this represents the bottom of this volume node, essentially that it's sitting on. Now we can see that in this area here, there still was not like a stream of transactions, not much. So even down here, there was not a ton of transactions. So what that means is we can see and speculate how people are likely to react at these different levels. But right now in the near term, I still have to argue that it favors the downside. That catalyst that came out was very news driven. There doesn't signal a fundamental change in the company. And until there's more information out about that, it doesn't necessarily seem like we're going to see a big continuation of this uptrend because it's not really based on anything in the near term. This down move looks to be based on institutional unwinding for whatever reasons we want to say. This looks like institutional expansion. And again, is whatever, whatever it might be, whatever the reason might be. But now from here, it's a wait and see. Now I still think without some sort of really strong catalyst, I think the existing price flow is more likely to mirror what we've been seeing. So I'm going to pop the door for Thoroughville quick. All right. I want to pivot over to the DD library. But",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 44,
      "start_timestamp": "00:21:12",
      "start_timestamp_seconds": 1272.109090909091,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1272"
    }
  },
  {
    "text": "and see. Now I still think without some sort of really strong catalyst, I think the existing price flow is more likely to mirror what we've been seeing. So I'm going to pop the door for Thoroughville quick. All right. I want to pivot over to the DD library. But before I'll do that, I want to see if there's anything that you guys have going on. Shoesbox says, can I show you my charts on GameStop? How can I send them to you? If you want, you can send them to me via email. But I mean, not to be crass or anything, but I'm looking at the same, like I can see the charts. So there isn't anything in there. I don't think that is like magic. Personally, if you want to send them to me, I'm happy to look at them, but there really isn't much that I can do with them. The charts are kind of what they are, the prices, whatever the price is, which is this. So interesting. The one thing I still like is that it is holding these volume nodes so much better. So that still leads me to believe that the accepted floor price for it is much higher than it had been previously. Shoesbox says, okay, I just want you to see a different angle. Yeah, you can send them to me again. Yeah, I'm happy to. I don't think that there's much of the way that I look at",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 44,
      "start_timestamp": "00:22:49",
      "start_timestamp_seconds": 1369.9636363636364,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1369"
    }
  },
  {
    "text": "accepted floor price for it is much higher than it had been previously. Shoesbox says, okay, I just want you to see a different angle. Yeah, you can send them to me again. Yeah, I'm happy to. I don't think that there's much of the way that I look at charts is it is what it is. It doesn't matter what kind of stuff we put on the chart. What matters is what price is showing us, right? And we can draw these different things to help us visualize what may or may not happen, but just as I had drawn before, right, this potentially serving as resistance will what happened if I can gap down right through it didn't care at all that that was resistance or support. So the way that I use charts is literally to visualize supply and demand and to give me some ideas on where things might go. So yeah, happy to take a look, but yeah, I think I've looked at thousands of charts and I'm probably a bit set in the way that I use them. I know some people are like really, really interested in different configurations and trying to draw different stuff on there, but yeah. All right. Hey, Joseph, what up? Joseph says, love the lesson on the Greeks yesterday. Yeah, that's awesome. I'm glad that that was useful. The Greeks in options trading are like the thing you have to have to know how to use the Greeks",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 44,
      "start_timestamp": "00:24:27",
      "start_timestamp_seconds": 1467.8181818181818,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1467"
    }
  },
  {
    "text": "different stuff on there, but yeah. All right. Hey, Joseph, what up? Joseph says, love the lesson on the Greeks yesterday. Yeah, that's awesome. I'm glad that that was useful. The Greeks in options trading are like the thing you have to have to know how to use the Greeks in options trading. So I love that. I thought it was useful. Michael says, where do you get the volume or order flow on the left? Is that order book volume? No, it's just volume profile. I need to make, I'll make a video on it. I literally get that question so often. Give me one sec. I'm just taking a note on it. I'll do so for those that don't know every Thursday now, I do like an outlier. I'm trading tip video, which is supposed to be like a five to six minute video that's five to six minute video that's like super fast. You can just kind of take away some information because most of my videos are much longer than that and way more nuanced and in depth. So it's to offer an olive branch so that not everything has to be super heavy and intense. So I'll add that which is volume profile set up on fingers. So I just added that. I'll take a look at it. Michael says, have you looked at XRT retail ETF and factored in how that ties in? Definitely. So I've spent a while analyzing XRT from a couple",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 44,
      "start_timestamp": "00:26:05",
      "start_timestamp_seconds": 1565.6727272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1565"
    }
  },
  {
    "text": "So I'll add that which is volume profile set up on fingers. So I just added that. I'll take a look at it. Michael says, have you looked at XRT retail ETF and factored in how that ties in? Definitely. So I've spent a while analyzing XRT from a couple of different lenses. That's actually how we started the stream today. But when we're looking at that here, this is essentially the primary way that I've analyzed that is through my conversations with Newton. Now the thing that I've noticed is with the various expansion of FTDs and volume changes is that I still don't think it's predictive from what I can tell. So when we look at FTDs, when we look at volume changes, we can see some stuff going on. That's objectionably true. We can absolutely see some stuff going on. But in terms of the predictive capability, it's not there from what I can see. So what I've done is I take what Newton has been collating and I created a copy of this entire sheet so that I can kind of trim it down into stuff that I can actually do data analysis on so that I can take a look and say, okay, on a legit basis here, do I see some sort of commonality when FTDs hit X level? And I've looked at just about every permutation. I've looked at FTDs at specific levels. I've looked at the delta of the FTDs. I looked",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 44,
      "start_timestamp": "00:27:43",
      "start_timestamp_seconds": 1663.527272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1663"
    }
  },
  {
    "text": "I can take a look and say, okay, on a legit basis here, do I see some sort of commonality when FTDs hit X level? And I've looked at just about every permutation. I've looked at FTDs at specific levels. I've looked at the delta of the FTDs. I looked at both of those conditions. And then I'll look at the price movements for follow on periods after that. So yeah, I've pretty much looked at everything I can from that perspective, not just XRT, pretty much any other basket that holds GameStop. And then I've also looked at it from the perspective of swaps and swaps so far are even less predictive, unfortunately. So yeah. I think that a lot of the movement that we see a lot of people tend to believe that it's from the cat and the cat like cracking one of these codes and seeing something underneath the surface that everybody else has missed. But I honestly just don't share that sentiment. The dude is smart, but he's honestly not smarter than everybody that's looked at this collectively and not been able to come up with anything. I just don't believe that. I think the main thing is he was in a position that it blended opportunity, luck and skill all at once, which is very frequently how true success happens for people. It's observed time and time again. If you look at the advent of companies like Microsoft and you listen to Bill Gates'",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 44,
      "start_timestamp": "00:29:21",
      "start_timestamp_seconds": 1761.3818181818185,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1761"
    }
  },
  {
    "text": "main thing is he was in a position that it blended opportunity, luck and skill all at once, which is very frequently how true success happens for people. It's observed time and time again. If you look at the advent of companies like Microsoft and you listen to Bill Gates' origin story, a big reason why Bill Gates was the one that was super successful. He had all the requisite skills obviously. But when he was a kid and also in college, he had access to a computer system that other people didn't have at the time. So it started helping him move at a pace that other people literally just didn't have access to. That's not to diminish the work that Bill Gates put into Microsoft. I always will remind just about everybody that if you are successful, a non-trivial portion of your success is due to luck that doesn't diminish the work that goes into place to position you to be able to capture luck when it comes up. Because that's the other thing. When people here luck, they immediately think like, oh, they didn't do anything. They just got lucky. And that's not it at all. Many of people have looks at things that would be considered luck if they were in a place to take advantage of it, but a lot of times they're not. So I look at my life, I look at literally every, a great book on this is called Outliers. And it's",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 44,
      "start_timestamp": "00:30:59",
      "start_timestamp_seconds": 1859.2363636363639,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1859"
    }
  },
  {
    "text": "of people have looks at things that would be considered luck if they were in a place to take advantage of it, but a lot of times they're not. So I look at my life, I look at literally every, a great book on this is called Outliers. And it's exactly what you think that a lot of the success that we see from people, it comes from a tremendous amount of hard work, coupled with a non-trivial dose of fucking luck on top of it. But when I use that term, a lot of people get defensive because they think that luck diminishes the work that goes into things and that's not it at all. I consider myself very lucky. But the interesting thing about luck is the harder you work and the more skills you get, the more lucky you get. Well, we're that in it. A big part of it is positioning yourself to be able to actually capture luck when it's there. So this is very, very much what I think a lot of what we see from the cat. Like we've been analyzing this kind of data for some time now with some element of predictability, but it's not really statistically significant. So there are elements in this that I actually think are way easier from a predictive capacity standpoint. And I've already told you guys all of them because it's really fucking simple expansion of volume. I can tell you with 100 certainty before",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 44,
      "start_timestamp": "00:32:37",
      "start_timestamp_seconds": 1957.0909090909092,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=1957"
    }
  },
  {
    "text": "predictability, but it's not really statistically significant. So there are elements in this that I actually think are way easier from a predictive capacity standpoint. And I've already told you guys all of them because it's really fucking simple expansion of volume. I can tell you with 100 certainty before every single big run game, game stop, GME has ever had volume has every single time expanded before the run every single time 100 of the instances. The tricky part is sometimes the volume will run and then the stock won't. So you won't only use no what it is, but if we looked through when we went through roaring kiddie's trades and we went through that series where we literally analyzed every single one of his trades, I could tell you one thing. He didn't fucking know the timing either. We can see it in the positions and the way that they were managed and they were held. He didn't know the timing either. And that's okay. You don't have to know the timing. That's the cool part about this. A lot of people when I say that they feel like I just killed Sandra Clause and to me it's the opposite. It should be insanely encouraging the fact that there isn't some sort of secret manipulatable formula to know what's going to happen before it's happens and only the person that knows that is able to use it to make money. The fact that I don't believe that",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 44,
      "start_timestamp": "00:34:14",
      "start_timestamp_seconds": 2054.9454545454546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2054"
    }
  },
  {
    "text": "it's the opposite. It should be insanely encouraging the fact that there isn't some sort of secret manipulatable formula to know what's going to happen before it's happens and only the person that knows that is able to use it to make money. The fact that I don't believe that to be the case based on the breadth of evidence that I've seen so far, that's a good thing because that means other people can do the same shit too. But a lot of people, you know, they don't necessarily love that. Let me get caught up on the chat. Juice box says what's your email. It's Eric at outliertrading.io. All right. Cool. I think we're good. Let's get into the DD library. What do we at 536? We got a little time. Sort these bad boys by date. And I think we did all these. I think we did this. Damn. I realized that I noted like where we left off, but the size of this is different than what it was. Let's see. I don't remember this one. Okay. Okay. So this one is just kind of like a short comic about a handful of events. There wasn't anything into that really jumped out at me. Creating cards. Okay. These are fucking crazy. Hey. How many Dave? I don't know. It's so incredible to me that people literally have taken the time to make these. It's the like how artistic I find the people to be with like",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 44,
      "start_timestamp": "00:35:52",
      "start_timestamp_seconds": 2152.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2152"
    }
  },
  {
    "text": "anything into that really jumped out at me. Creating cards. Okay. These are fucking crazy. Hey. How many Dave? I don't know. It's so incredible to me that people literally have taken the time to make these. It's the like how artistic I find the people to be with like how much effort and work they'll put in the building stuff like this is very, very cool. That pop open a window. A little bit warm with the. With the marina wool shirt on. I like this. So they have like different. Different series on. Oh, this is actually kind of cool to see some of the people. Oh, damn. There's only two. Damn it. Let's hope that there's going to be more. Uncle Bruce. Mo money. I don't know those guys. Those must have been more OGs. What the fuck is this? I don't know. All right. Let's get into it. I'll zoom this in. I think it'll work. I don't know how easy it is for you guys to see all like kind of skim over it and then try to. Give it a low down. The history of the story so far. The interactions between DTCC or DTC Fintra SEC. They're citing a bunch of the other DD that we've seen so far. House of cards and a short sellers. They're talking about the basics of entering position. See, this is another thing that I do notice in a lot of the DD that we look at.",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 44,
      "start_timestamp": "00:37:30",
      "start_timestamp_seconds": 2250.6545454545458,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2250"
    }
  },
  {
    "text": "DTC Fintra SEC. They're citing a bunch of the other DD that we've seen so far. House of cards and a short sellers. They're talking about the basics of entering position. See, this is another thing that I do notice in a lot of the DD that we look at. A lot of it is duplicative. And that's a little saddening to me because one of the cool things that the scientific community does. Is like where one person leaves their research off. Then generally when you conduct research on the same topic, you kind of build on it and go further. Right. You don't like continually cover the same stuff. You can cover way more ground. So if you're actually reading research papers like on SSRN, you'll see that a lot. In the beginning, they'll cite the current state of the topic that's being researched based on all the existing research, what they found. And then at the end of all that, what they do is they say, this now, based on all of that other stuff, this is what we're going to look at in this paper. And this is what we think is different compared to everything else that I just cited. And I know that that's a little more regimented and probably not going to happen. But for those, if there's anybody that work on due diligence for GameStop, it's something to consider. Like if I were to write a GameStop due diligence piece, essentially what",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 44,
      "start_timestamp": "00:39:08",
      "start_timestamp_seconds": 2348.509090909091,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2348"
    }
  },
  {
    "text": "else that I just cited. And I know that that's a little more regimented and probably not going to happen. But for those, if there's anybody that work on due diligence for GameStop, it's something to consider. Like if I were to write a GameStop due diligence piece, essentially what I would do is I would do what we've been doing. I would spend the amount of time that we've spent researching and reading all of the existing research. And then I would start creating wherever I would try to jump off from that point and offer a novel inclusion. I don't have a novel inclusion. Then there's no point really in me doing the research. So I think if that kind of attempt would be made even in earnest, man, I could just imagine how far the research could potentially go. But as we look at more and more of these, I just, obviously we're seeing a lot of the same stuff, which is okay. It's different people trying to find their take on it. But it's one of the artifacts of having disaggregated research. And if there is even some sort of attempt at minor aggregation, you can really like move things forward way, way, way more efficiently. So they're doing a good job citing some of the existing stuff, which is good so far. So we'll see how far they take it. Okay. So they're just talking about other company comparisons. This shows you the different institutional",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 44,
      "start_timestamp": "00:40:46",
      "start_timestamp_seconds": 2446.363636363637,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2446"
    }
  },
  {
    "text": "really like move things forward way, way, way more efficiently. So they're doing a good job citing some of the existing stuff, which is good so far. So we'll see how far they take it. Okay. So they're just talking about other company comparisons. This shows you the different institutional ownership for different stocks based on the timeframe of writing, which I forgot when this is from I'm assuming 21. The company or company keeps by looking investment data primarily owned by some of the same firms would be reasonable assume that the real competition is in the investment firms themselves. That assumption is wrong. Okay. So essentially they're comparing the institutional hotorship of different names or different companies of the same names. So they're surprised that there's scared owners, which is interesting. Okay. So I'm just going to read this section to you. So from what I'm seeing here so far, this looks like they're trying to make sense of these different entities holding the same names and trying to figure out why they would do that. Which is actually pretty simple, but I'm curious what they're what their conclusion is and where they're going to go with this. So they're saying let's say I invest in company money ink. They're competing for investor money with Cartman who owns fat money down the street is Kenny money castle. Kenny is short speech impediment steals some of our customers on the edge of our little town really nice big fat",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 44,
      "start_timestamp": "00:42:24",
      "start_timestamp_seconds": 2544.218181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2544"
    }
  },
  {
    "text": "So they're saying let's say I invest in company money ink. They're competing for investor money with Cartman who owns fat money down the street is Kenny money castle. Kenny is short speech impediment steals some of our customers on the edge of our little town really nice big fat juicy company called hanky poo want to invest in. I really like to buy the stock so I buy 20 of the company until Cartman about it and he agrees with my assessment by 20 as well. Unfortunately Kenny got downwind and buys up another 20 as much as I don't like Kenny he does have a nose for investment opportunities hanky poo is now 60 institutional ownership. Mine with our ownership gives us a lot of control over what kind of stuff goes on in the company. Yes. The rest of the town loves it. They seem to think that it can scoop up 20 of retail. Okay. So now they're just showing the different distribution of stock ownerships. Yeah. They have a bit of a fundamental misunderstanding of this. Yeah. So essentially yeah. So essentially they're trying to show essentially that some of the same entities own a lot of these other entities that then own and hold the same thing and then they're exhibiting control over it which I don't actually disagree with the broader point there. Okay. Some of the large black parts in the graph are investment corporations which are not publicly offered and thus",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 44,
      "start_timestamp": "00:44:02",
      "start_timestamp_seconds": 2642.0727272727277,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2642"
    }
  },
  {
    "text": "lot of these other entities that then own and hold the same thing and then they're exhibiting control over it which I don't actually disagree with the broader point there. Okay. Some of the large black parts in the graph are investment corporations which are not publicly offered and thus do not report who owns their voting stock. In this section I investigate fidelity one of the largest asset managers. And make a case for why the black is justified not only for fidelity I touch on the private ownership again in section three. These large black sections that have some gray in them likely small insider ownership with sprinkles of white from member corporations. But are otherwise justified as a black hole that is mega corp. Okay. So you're out with the ultimate so what is of these different chops that they're taking. When all the major investing corporations are really just one investment corporation in that one of the investment corporations on the majority of others of voting stock of all the companies who really decides what choices are favorite companies make. I don't disagree with them but the problem is it starts to go a little too far down the deep state route and there's a lot of artifacts we can see on the open market of who makes the decisions and what those decisions lead to the incentive for a company is to grow it's to compete for market cap and market share. So a lot",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 44,
      "start_timestamp": "00:45:39",
      "start_timestamp_seconds": 2739.927272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2739"
    }
  },
  {
    "text": "far down the deep state route and there's a lot of artifacts we can see on the open market of who makes the decisions and what those decisions lead to the incentive for a company is to grow it's to compete for market cap and market share. So a lot of these holdings that these different elements have. It's not like they're just in the back telling company do this do that and then the like the incentive for the company is clear which is to grow. So far I'm wondering what the tie in here to game stop is because a big reason why you see this kind of ownership is because there's efficiencies that are gained by doing this think of Berkshire Hathaway. This is essentially Berkshire Hathaway equivalent where you have one company that starts to scoop up controlling holdings in other names and under the same umbrella and that holding company actually has some key benefits associated with it so yeah let's continue. Black rock is citadel. They are two sides of the same megacorp coin one controls the longs one controls the shorts together they. Control the entire market. I mean they do control a lot of the market I agree with that I think it's a little much to say they control the entire market but I get their point and I actually don't disagree that they do control and overwhelming majority of the market. Okay. So it's a clear financial link impossible shared",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 44,
      "start_timestamp": "00:47:17",
      "start_timestamp_seconds": 2837.7818181818184,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2837"
    }
  },
  {
    "text": "lot of the market I agree with that I think it's a little much to say they control the entire market but I get their point and I actually don't disagree that they do control and overwhelming majority of the market. Okay. So it's a clear financial link impossible shared responsibility for naked shorting between B of A and citadel and honestly even if there's not a shared responsibility it also wouldn't surprise me if there's even just gentlemen's and general ladies agreements on what that could what that balance could be like. Because the other reality is here even if there's not controlling shares of the different entities there can be cases where you just you you have a friend over at this other place you're in a similar industry and you just trying to help your friend out so I think that it's not even limited to instances just where we see. Direct ownership but even just relationships I think can lead to some of this. All right. look like. Okay. There is only one company in the world, mega corpse, citadeles, black rock, black rock, citadel, citadeles, scam. When March calls fiscal responsibility between the institutional longs and shorts, we on GameStop. Interesting. I liked this piece for a few main reasons. The primaries I liked, the relationships that they're drawing between the different institutions and then postulating the potential impact of this. I don't really think this meaningfully elucidates much about the broader picture from what",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 44,
      "start_timestamp": "00:48:55",
      "start_timestamp_seconds": 2935.6363636363635,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=2935"
    }
  },
  {
    "text": "and shorts, we on GameStop. Interesting. I liked this piece for a few main reasons. The primaries I liked, the relationships that they're drawing between the different institutions and then postulating the potential impact of this. I don't really think this meaningfully elucidates much about the broader picture from what I can tell because whether there's one company in the world and we want to say it's black rock, instead of del combined or if we want to say that there's not one company but there's a handful of really big companies and they're all friends with one another. The effect is pretty damn similar. So I think the broader point here is acknowledging the fact that and we know this that large companies have a lot of control. That's the punch line and I think that that's completely fine. So interesting. All right. I'm going to get my dinner order off before I get the old throat punch. All right. Let me know what we should take a look at next. My game, like I have time for probably one more. So I'm thinking we can take a peek at another one of the DDs and then your boy will pivot over to dinner time. All right. Interesting. Next. Where was the this one? I think it was this one, right? Yeah. The next one is this one. The sun never sets unsitted. Let us get it. A Fasi says thoughts on all them increasing their stake in recent",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 44,
      "start_timestamp": "00:50:33",
      "start_timestamp_seconds": 3033.4909090909096,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3033"
    }
  },
  {
    "text": "will pivot over to dinner time. All right. Interesting. Next. Where was the this one? I think it was this one, right? Yeah. The next one is this one. The sun never sets unsitted. Let us get it. A Fasi says thoughts on all them increasing their stake in recent filings. Good bad both. I think this is a delicate answer because I know that there's a lot of mixed opinions and whatnot on what these different institutions and entities want and I think a lot of it has to go back to the idea of whether or not we think that the shorts have closed which I've not seen really any decisive evidence one way or the other. But I think I think institutional ownership of a stock is actually really important to its survival because the purpose, like let's go back to basics, the purpose of a company offering shares is to take in money to raise capital. And then what you choose to do with that capital you raised is obviously your decisions. Whether you want to invest in the business acquire a new business but you need capital to do these things and that's the point of giving up partial ownership of your company is to be able to do these things. So I think looking at institutional ownership always is like this bad thing. Again, I think it takes the general movement here too far and the reality is institutions manage a lot of money",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 44,
      "start_timestamp": "00:52:11",
      "start_timestamp_seconds": 3131.3454545454547,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3131"
    }
  },
  {
    "text": "of giving up partial ownership of your company is to be able to do these things. So I think looking at institutional ownership always is like this bad thing. Again, I think it takes the general movement here too far and the reality is institutions manage a lot of money and their involvement in a company a lot of times is actually good. So when I see institutions buying something like GameStop to me that means I'm bullish. I like that because institutions aren't in the business of getting into things that they think are going to fail unless they're getting into something with the purpose of trying to make it fail. But that's not really the case in GameStop because we know the CEO is we know who the team is there. So we know that that's not what they're trying to do. And it's also important to remember that the number of instances where institutions are getting involved in a company with the intent of trying to make them fail, they're very impactful when it happens but it's a minority of cases. I'm not saying it doesn't happen. It happens and it happens more than it should not excusing it. But I'm trying to avoid the common analysis shortfall that people have in that scenario and then we overestimate the frequency of it and then we start to again always look at it as this is what's essentially always happening. And it's not like institutions make probably way",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 44,
      "start_timestamp": "00:53:49",
      "start_timestamp_seconds": 3229.2000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3229"
    }
  },
  {
    "text": "excusing it. But I'm trying to avoid the common analysis shortfall that people have in that scenario and then we overestimate the frequency of it and then we start to again always look at it as this is what's essentially always happening. And it's not like institutions make probably way more money on companies going up than going down. Now there are some places that specialize in companies going down but still even if you net it all out, the most money to be made that exists in the market is by playing the expansion of the economy and the expansion of productivity and overall income of these companies. So I think that there are instances where an opportunity might present itself to institutions to essentially seller box which is complete bullshit. I do not like that at all. I think it's absolutely fucked up but I don't think those opportunities are necessarily all over the place 24 seven and the only reason why institutions are trying to get involved. I think the majority of the case institutions are getting involved because they're trying to make money and they looking, they're looking for things that might provide a decent return on their capital. So yeah, I don't view it as a bad thing. I really don't. Now I would view it as a bad thing if you start to see the leadership start to get swapped out. That would be very bad, very, very bad. So for example, let's just",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 44,
      "start_timestamp": "00:55:27",
      "start_timestamp_seconds": 3327.054545454546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3327"
    }
  },
  {
    "text": "on their capital. So yeah, I don't view it as a bad thing. I really don't. Now I would view it as a bad thing if you start to see the leadership start to get swapped out. That would be very bad, very, very bad. So for example, let's just play the scenario where some of these other institutions take a controlling staking game stop and they essentially conduct a hostile takeover and they start swapping out existing leadership. That's terrible. But that's not happened and obviously Cohen has positioned himself so far to be pretty resilient to that scenario. So yeah, all that being the case, I'm thinking it's bad at all. The way I look at it is we'll take the fucking money and invest it, right? We being game stop and hopefully game stop is doing smart stuff with the money. So I like it. Okay, so this says became bothered by a question a few months ago. Jamie Saga started with a major fight on the landscape between Citadel and other and Superstank is here now because of team other getting Ryan Cohen on the board at game stop. Then retail landed on the scene now apes. But this one question always bothers me. What did Citadel do to piss everyone off? Why would they want to give Citadel the most epic beat down in financial history? Let me go to the back for it. Citadel was moving to monopolize security transactions at the exchange level",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 44,
      "start_timestamp": "00:57:04",
      "start_timestamp_seconds": 3424.909090909091,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3424"
    }
  },
  {
    "text": "apes. But this one question always bothers me. What did Citadel do to piss everyone off? Why would they want to give Citadel the most epic beat down in financial history? Let me go to the back for it. Citadel was moving to monopolize security transactions at the exchange level market makers have the most control over transactions at exchanges. What does this mean? I don't know what that means. Market makers have in most control over transactions. You have to know what they mean by that. Citadel is the largest market maker. Citadel is more power than the exchanges do. Offer more products, more ways to purchase them and more venues than the exchanges. Citadel has even started its own exchange in 20 growing rapidly. Market maker competition is deterred from directly competing with Citadel. They have too much influence and competitors are incentivized to coordinate with Citadel and not compete. No more market makers have decreased in major exchanges while Citadel's market share is growing. There's a lot to this. Just to talk about some of it, then we'll flip through it. Having more power than the exchanges, it's again another misunderstanding of what it is. It doesn't really matter if Citadel has more power. The exchanges essentially do what the exchanges do. And Citadel, as they're talking about launching its own exchange, which definitely was growing rapidly at the time that they were writing this, there's still all these other exchanges. It's not necessarily direct weighing gain,",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 44,
      "start_timestamp": "00:58:42",
      "start_timestamp_seconds": 3522.763636363637,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3522"
    }
  },
  {
    "text": "really matter if Citadel has more power. The exchanges essentially do what the exchanges do. And Citadel, as they're talking about launching its own exchange, which definitely was growing rapidly at the time that they were writing this, there's still all these other exchanges. It's not necessarily direct weighing gain, like they're making it out to be, because there's structural authority that different entities and places might have, even if they quote unquote, don't have more power. A lot of nuance in that one. Now market makers, they absolutely are deterred from directly competing with Citadel, but it doesn't mean that they don't. There are market-making firms now that do compete with Citadel. And it's because, just like any other place, there are rooms around the margins for other places to get started. Now, I still think Citadel is probably just overwhelmingly dominant, but this doesn't necessarily mean that there are no other market makers out there attempting to challenge Citadel. But a lot of it is just kind of getting in where you fit in, and the reality is a lot of these places will not have the same resource availability as something like Citadel does. And that's just kind of a function of how big Citadel is. So yeah, and I don't disagree that Citadel is trying to assert its dominance over everything that it could. It incentivize to do so. So I agree with that idea as well. So this is talking about all the different things",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 44,
      "start_timestamp": "01:00:20",
      "start_timestamp_seconds": 3620.618181818182,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3620"
    }
  },
  {
    "text": "kind of a function of how big Citadel is. So yeah, and I don't disagree that Citadel is trying to assert its dominance over everything that it could. It incentivize to do so. So I agree with that idea as well. So this is talking about all the different things that they do. They're talking about the role of market makers. And another thing is, I mean, the other element that really slows down the direct competition between market makers is payment for orderflow. Another function of how this sits. One of the most important part about that graphic is Nicene Asdeck and Sebo volumes include the transactions with Citadel Virtue. Yes. Market making very risky. Yes. New market maker would need significant advantages to compete against Citadel, Susquehanna, in Virtue. This is again another fundamental misunderstanding of business. So when a new business comes online or let's just say any arena, your goal typically is not to directly compete with the incumbent. It's next impossible to do that in just about anything. Your goal as a new business is to find an unserviced or underserved area of a market to service them and to gain a foothold that you then can slowly expand or quickly expand depending on how aggressive you are in the business model to then compete. So this here, a market maker would need significant advantages to compete against Citadel, Susquehanna, Virtue. Of course, absolutely. That's not the fucking game. That's not what a new market",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 44,
      "start_timestamp": "01:01:58",
      "start_timestamp_seconds": 3718.4727272727278,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3718"
    }
  },
  {
    "text": "then can slowly expand or quickly expand depending on how aggressive you are in the business model to then compete. So this here, a market maker would need significant advantages to compete against Citadel, Susquehanna, Virtue. Of course, absolutely. That's not the fucking game. That's not what a new market making firm is attempting to do. They're attempting to make money on the margins, get in where they fit in while they can, and then to figure out how to position themselves to grow. Now with stuff like this, very difficult, very difficult to do. And it's because of a lot of structural awkward that exists. Let's just keep it a buck. So, yeah, I think the sentiment they're sharing is a fundamental misunderstanding of business, but the message that they're sharing is not wrong. That places like Citadel, Susquehanna, Virtue are exceedingly well positioned. Completely agree. What about the competition? What about virtue G1 market makers? Other countries that you said it was a competitive field? Yeah. Okay. Okay. Okay. So it's just talking about the relationship between Citadel and Virtue. If you still believe that being a market maker is competitive in that, exchanges are not commoditized in that virtue in Citadel or this, or taking the same positions for non-clusive reasons. I have bad news. Nine months when MEMX was opened, Citadel and Virtue opened their own exchange. Mm-hmm. Yeah. Yeah. So I mean, I think a couple things again here, like being a market maker is",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 44,
      "start_timestamp": "01:03:36",
      "start_timestamp_seconds": 3816.327272727273,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3816"
    }
  },
  {
    "text": "that virtue in Citadel or this, or taking the same positions for non-clusive reasons. I have bad news. Nine months when MEMX was opened, Citadel and Virtue opened their own exchange. Mm-hmm. Yeah. Yeah. So I mean, I think a couple things again here, like being a market maker is competitive, but that doesn't mean that there's not alignment on the back end of deployment or implementation. And exchanges being commoditized, that we know is true. And a big reason why we know that's true is again, look at payment for order flow. As a retail trader, when you submit your orders, your broker bundles a bunch of this order flow and then literally market makers bid to pay to get the order flow bundle so that then they can execute the order flow. They're essentially paying to do their job. What does that tell you? It tells you that their margins are insanely good. And this is for a lot of different reasons because retail traders are typically uninformed transactors. And that is the ideal case for a market maker to transact in because they can make way more money, way more than just the bit as spread. When market makers are executing informed order flow, they have to be way more cautious. They still make money, but in general, they have to be way more conservative and how much they can make. With retail order flow, that is the panacea, that is like the cure off for all",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 44,
      "start_timestamp": "01:05:14",
      "start_timestamp_seconds": 3914.1818181818185,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=3914"
    }
  },
  {
    "text": "market makers are executing informed order flow, they have to be way more cautious. They still make money, but in general, they have to be way more conservative and how much they can make. With retail order flow, that is the panacea, that is like the cure off for all of their problems if all they could do is take retail order flow that's uninformed all over the place, that's perfect for them. So yeah, definitely commoditized. No doubt. Okay, another interesting piece. The word is that leave us. The sun never sets part two. Let's add that leave off sun never sets part two. Beautiful. Very interesting. All right, so recap for what we learned. We learned about the relationships between BlackRock and the ownership and how a lot of these different companies that have ties and relationships with one another own a lot of the same companies. We learned about the relationship between Citadel and the positioning of Citadel compared to other entities in the same field and essentially the overwhelming competitive advantage that Citadel has in the space. So all in all, I actually really like those two pieces. I think that these are good, good research pieces. I think so far, we're kind of getting a lot of like refreshers of stuff that we've seen before, but I don't think there's anything wrong with that because a lot of the different things that we see at least have some slightly different edges or angles to them,",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 44,
      "start_timestamp": "01:06:52",
      "start_timestamp_seconds": 4012.0363636363636,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=4012"
    }
  },
  {
    "text": "pieces. I think so far, we're kind of getting a lot of like refreshers of stuff that we've seen before, but I don't think there's anything wrong with that because a lot of the different things that we see at least have some slightly different edges or angles to them, which I do enjoy. I think that it's good to see slightly different perspectives, even if it is on very similar content. So I like to, any questions or anything that you all would like to hit before we wrap up for the evening? Anything we should take a look at? Joseph says a ton of stuff. Business spring solutions to problems that arise high level, but maybe over simplified. I don't disagree with that. I think that that's generally the, I agree with you. I think in in an overarching sense, like that is the point of business is to solution. Potential problems are not even necessarily problems, but even things that are inefficiencies, I would call it, and to provide different solutions for that and monetize them. So I think that that's a completely fair characterization. You don't have to be sorry, and that's completely cool. Sweet. All right, gang. Well, that wraps us up for tonight. As always, if there's anything we should take a look at, let me know. Be an outlier, be an ape. See y'all later.",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 44,
      "start_timestamp": "01:08:29",
      "start_timestamp_seconds": 4109.890909090909,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=4109"
    }
  },
  {
    "text": "right, gang. Well, that wraps us up for tonight. As always, if there's anything we should take a look at, let me know. Be an outlier, be an ape. See y'all later.",
    "metadata": {
      "video_id": "MJofIJZRODo",
      "title": "GME Top Theories Analysis Pt15 | GameStop Analysis Ep33",
      "url": "https://www.youtube.com/watch?v=MJofIJZRODo",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 44,
      "start_timestamp": "01:10:07",
      "start_timestamp_seconds": 4207.745454545455,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MJofIJZRODo&t=4207"
    }
  }
]