[
  {
    "text": "The reality of trading options, I've been in the markets for 18 years now and one of the largest issues new traders have is actually picking a goal that's reasonable. The reason why it's so damaging is not because picking a crazy goal and missing it. It's because traders often will pick a crazy goal and then realize they have to take an insane amount of risk to get there and it's all completely unproven for them. They don't have to skill set. If you go through a place like the options subreddit, you can see things like do most obstastrators see 1,000 returns regularly, which obviously is absolutely insane. Even something more modest, I got a DM about this pretty regularly where people say, hey, can I make 1 a day or even 1 per week? 1 per week sounds pretty reasonable, but if you look at the return, it's like 69 annual lives. Sure, you might be able to hit that a couple of years if you have a solid year, but you will do that consistently is literally world record breaking. So having some context on what we're trying to do in the reality of the game we're playing, really important to prevent taking too much risk in pursuit of a very silly return. Be an outlier, tell it.",
    "metadata": {
      "video_id": "MMsqJa2wM-M",
      "title": "realistic returns for options traders",
      "url": "https://www.youtube.com/watch?v=MMsqJa2wM-M",
      "upload_date": "2025-05-03T16:00:26Z",
      "duration": "PT1M14S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, direct Q&A, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MMsqJa2wM-M&t=0"
    }
  }
]