[
  {
    "text": "What's up, everyone? Today is all about GameStop. I want to run through a little more in depth. Some of the activity that we're seeing, although it is generally quiet on the Western front, this is a good time to collect different baseline information for the product. So that's what I want to do here because a lot of the conversations that I've had recently about GameStop since we had this pop back in like the middle of May was very centered on kind of really busy markets, right? Like take a look at these volume bars. It's just a lot going on there. So we're in this little bit of a decline phase, right? And you can see a few things that I find interesting straight from a chart perspective. When I look at the way price was behaving before we had the previous squeeze, we can see that volume was real, real quiet. We saw a little bit of volume expand around earnings as per usual. Then we have this massive explosion in volume. And that's just been coming down real, real steadily. Let me get me out of the way so you can see right down here. So the very first thing that comes to my mind is closely monitoring the volume and the way that the volume moves. So what I like to do down here is to just kind of set, let me grab this little line for you guys like price level. So I",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 20,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=0"
    }
  },
  {
    "text": "So the very first thing that comes to my mind is closely monitoring the volume and the way that the volume moves. So what I like to do down here is to just kind of set, let me grab this little line for you guys like price level. So I try to set these different levels like that so that I could see, all right, this has been the kind of more recent regime high for volume. And we are definitely trailing down below that at this point, which is again, to be expected, it's relatively quiet. But this becomes informative with how this volume average line and how the volume bars themselves start to behave because I want to keep a really close eye if we start to see a meaningful expansion in volume because that's exactly what happened back here. When we had this first kind of slight turn day on three May, we started to see on the second before we had the bigger day on the third, again, contextually large expansion in volume. The reason why I say contextual is because when you look at this bar, you look at this bar and you're like, yo, that ain't nothing. But in this case, it is something. And the reason for that is because these bars expanded because of earnings. There is a clear event you can look at and say we are higher over here for that reason. This makes sense. There's more people transacting in",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 20,
      "start_timestamp": "00:00:59",
      "start_timestamp_seconds": 59.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=59"
    }
  },
  {
    "text": "that ain't nothing. But in this case, it is something. And the reason for that is because these bars expanded because of earnings. There is a clear event you can look at and say we are higher over here for that reason. This makes sense. There's more people transacting in the product around earnings. Okay, got it. Very, very normal. Now it gets a little different though because we have this random higher day here. And then all of a sudden, there's this day, the second, it's essentially a completely green bar, meaning the overwhelming amount of volume that you saw on this day was by volume. Interesting, I think. And then that's before we started seeing the rest of this move coming to fruition. So while some people might be slightly dismayed about the volume contracting down how it is and that kind of stuff, which I get, but I would also look at it on the bright side where now you kind of a really clean slate to identify triggers and to identify interesting buying activity and the underlying, if there is any, that's something I think about. Now a couple of people have asked me about my positions in GameStop. I always try to remind you guys that what I do really shouldn't matter. And I'm always happy to talk about it. But the reason why I preface that is I know a lot of people ask that question to try to benchmark what they think they",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 20,
      "start_timestamp": "00:02:15",
      "start_timestamp_seconds": 135.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=135"
    }
  },
  {
    "text": "positions in GameStop. I always try to remind you guys that what I do really shouldn't matter. And I'm always happy to talk about it. But the reason why I preface that is I know a lot of people ask that question to try to benchmark what they think they should be doing for their own stuff. And the only person that can answer that is you, whatever you think makes sense for you, please do that. It's nobody else's decision other than your own. But I'm always again happy to talk about. So right now I still have shares of GameStop, but I've scaled out meaningfully. I do not have a big position on at this point. And I also have some short calls against them still to try to collect some premium against the shares. And essentially I started this campaign back here and here. It's scaling out of the product as it starts moving in the opposite direction. I began scaling in the shares a few different periods throughout this entire time frame, but this more relative period is kind of in here. And the basis on the shares that I was getting in at was around 22, which was overall really good basis. But the thing about the way that I operate as a trader is I'm very reluctant to let winning trades turn into losing trades. So when I see turn days like this, I start scaling out. And then when I see us falling",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 20,
      "start_timestamp": "00:03:28",
      "start_timestamp_seconds": 208.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=208"
    }
  },
  {
    "text": "22, which was overall really good basis. But the thing about the way that I operate as a trader is I'm very reluctant to let winning trades turn into losing trades. So when I see turn days like this, I start scaling out. And then when I see us falling below points of control, I start scaling out. The reason I'm scaling out is to take money out of the trade. I've made money. I want to keep the money in my pocket so that I can do more with the money going forward. Again, this is my world is a trader. I know a lot of you have a different approach, which I have tremendous respect for, which is to hold all and to D. R. S. your shares, which is totally cool. This is just a different way that I think about playing it. Now, I've already told you guys I will always maintain some level exposure and game stop just because being part of the story is cool. It literally that's that is the depth that goes into that. So what I'm highlighting is there's a part of me that is participating in the underlying literally to support you guys. But then the other part of me, the broader part of the position is a trader. And my job is to trade. So that's what I'm doing in here. Now, for the shares that I do have on, I still have a couple different alerts set to",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 20,
      "start_timestamp": "00:04:30",
      "start_timestamp_seconds": 270.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=270"
    }
  },
  {
    "text": "support you guys. But then the other part of me, the broader part of the position is a trader. And my job is to trade. So that's what I'm doing in here. Now, for the shares that I do have on, I still have a couple different alerts set to scale me out. But even if I essentially get to full scale out of my speculative shares, the position that I'm going to maintain just to participate will essentially remain. So that's where that is. I'm running the short calls because the premiums on them are still good, although they've contracted a lot. That's actually been one of the things I've been trading in game stop is a lot of relative volatility positions. And then also variance risk premium in here has been really good. But you have to be very careful the way you trade those kinds of things in a product like this because of how it can move. You literally can get your face ripped off in just a few seconds. So that is not something for the faint of heart. You have to have a pretty solid management plan for that. So anyways, this is a recap on what I'm doing in here. Now, in terms of my expectations, again, I'm a trader. I spend very little time making trades off of something I expect to happen before I see it starting to happen. So what that means is, for example, I think game stop is",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 20,
      "start_timestamp": "00:05:27",
      "start_timestamp_seconds": 327.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=327"
    }
  },
  {
    "text": "recap on what I'm doing in here. Now, in terms of my expectations, again, I'm a trader. I spend very little time making trades off of something I expect to happen before I see it starting to happen. So what that means is, for example, I think game stop is going to go up. Do I think it's going to go up tomorrow next week, five weeks from now? I genuinely don't know. Now, does that mean because I think it's going to go up that I'm going to start dog piling money into the product? No, that's not how I trade. And it's because I need it to start showing me that it wants to go in the correct direction because otherwise, it's very easy to get wrapped up in periods like this in periods like this where something kind of goes sideways a little bit, trends down. And then again, from a trader's perspective, there is a massive opportunity cost to tying up a bunch of capital and something that's not really doing a whole lot for a long period of time. It's a difficult way to make money again in my business. So what I'm primarily looking for here is it to start showing some different price behavior. This still just looks like consolidation to me. We saw a bit of an update today. It's up. Well, okay, I lied to you. It's not up, I guess technically it's up. Come on, man. So it looks like",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 20,
      "start_timestamp": "00:06:25",
      "start_timestamp_seconds": 385.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=385"
    }
  },
  {
    "text": "for here is it to start showing some different price behavior. This still just looks like consolidation to me. We saw a bit of an update today. It's up. Well, okay, I lied to you. It's not up, I guess technically it's up. Come on, man. So it looks like it closed at 2395. It's down like a quarter point. But after hours, it was jostling around just a little bit higher. I thought maybe we'd get that back. But no, it's up just a little bit on the day. So where did it open today? 2359. And then it closed at 2395. So it's up ever so slightly on the day. So I view this as a consolidation period. It's been exceedingly range bound between 23. And if you exclude these two pop-up days with like the broader data set here, it's really like 27. But if you include those, it's like 28, almost 29, maybe 28 and a half that I would consider this range. So like 23 to 28 is where it's hanging around in right now. And that's okay. As long as it continues basing here, because the other thing that I still am keeping a really close eye on is this. So right now, let me zoom this in a little bit more. So it's a little easier to see. One of the things when I'm looking for something even if it's slowly trending up is standard standard price behavior, higher highs, higher lows. So",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 20,
      "start_timestamp": "00:07:29",
      "start_timestamp_seconds": 449.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=449"
    }
  },
  {
    "text": "really close eye on is this. So right now, let me zoom this in a little bit more. So it's a little easier to see. One of the things when I'm looking for something even if it's slowly trending up is standard standard price behavior, higher highs, higher lows. So when I see something post, I call this a term low. You know, it's I'm excluding the data before this. This is kind of like after these really big candles all settle down. And the product seems to kind of be settling in a little bit. This is like the term low here, which is the first of July. From there, we post a low and I'm using the body of the candle, not the wick. I care about the body because that expresses some level of conviction in my opinion. The candles can be really extreme. And then things can snap back really quick. So I pay attention to the wicks to be clear. But in this case, I'm worried about the body where it actually was closed out at, which was 2333 is where it closed here. So then I want to make sure that this is not falling below that. If this starts going below 2333, which we're close, we're real close to that. We're like 50 cents away. But I care about that because from here, we made this low. We had a little bit of a pivot here. We had a higher low, right, which",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 20,
      "start_timestamp": "00:08:40",
      "start_timestamp_seconds": 520.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=520"
    }
  },
  {
    "text": "falling below that. If this starts going below 2333, which we're close, we're real close to that. We're like 50 cents away. But I care about that because from here, we made this low. We had a little bit of a pivot here. We had a higher low, right, which is kind of like this range here before it broke down below it. And now we're covering back down here. None of this ultimately matters, realistically speaking. But it tells me the behavior of people participating in the underlying and what they're doing. And I do care about that. So if we're able to kind of even kind of turn here a little bit and get back into this consolidation range closer to the point of control, that would be fantastic. I'd love to see that. If not, it's not something I'm adding money to until it starts doing that. And it's just because I can't park a bunch of money in there waiting for it. And that's that's the tricky part with GameStop is you never know when it's going to go. But I also find that it doesn't typically just go out of the blue. Again, even this move here up to 65. And I think pre-market it was up to like 80. It didn't just go from 995 to 80. It went from 995 here. It hit a high of 1288. Then here it hit a high of 1745. And so you had 1, 2, 3, 4,",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 20,
      "start_timestamp": "00:09:34",
      "start_timestamp_seconds": 574.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=574"
    }
  },
  {
    "text": "move here up to 65. And I think pre-market it was up to like 80. It didn't just go from 995 to 80. It went from 995 here. It hit a high of 1288. Then here it hit a high of 1745. And so you had 1, 2, 3, 4, 5, 6, 7 days before we had the first launch here. And then a second launch after that. And it's the same thing here, right? So you still have 1, 2, 3, 4. I think I counted that twice. There's 4, 5, 6, 7, 8, 9, 10 days of price movement before it starts to pop up here, came back down, pop back up. All I'm saying here is that I have no problem not bottom-taking it, right? In this case, when I started building my position here, I didn't care that I was building here and not here. That's okay for me. Again, I'm trying to catch the majority of moves and avoid parking money and something until it starts really exhibiting some behavior in a strong direction. Now, from a company's perspective, I really think GameStop is positioned pretty well. And I chuckle at that because I look at the other examples for GameStop, things like Blockbuster and what they did and Xerox and what they did. And like these other kinds of companies that failed to adapt. But they have pretty good leadership that I think is really well in touch. I think Cohen is really smart,",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 20,
      "start_timestamp": "00:10:35",
      "start_timestamp_seconds": 635.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=635"
    }
  },
  {
    "text": "at the other examples for GameStop, things like Blockbuster and what they did and Xerox and what they did. And like these other kinds of companies that failed to adapt. But they have pretty good leadership that I think is really well in touch. I think Cohen is really smart, dude. They made a really wise at the money offering that I know is a little frustrating for people in terms of Moas and a squeeze. But position the company really, really well without massive dilution. So now they have a ton of cash and they have a really cool roadway ahead of them to now innovate. And they have the money to do that, which is very cool in my opinion. So even as a company, like I genuinely do not think that this is anything that people should just overlook. That's one of the most frustrating things I have with folks is when they're like, oh, it's just a meme stock. It's like I get how people have been trained to think that. But you have to be a little bit more of a thinker around those kinds of concepts in my opinion and these kind of products because they seem to have really interesting potential at this point. So now let's take a look at the options chain. Today we saw moderate volume. Again, lower on the call side than typical in terms of what's exciting. We're generally seeing stuff that's over 200,000 calls traded in a",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 20,
      "start_timestamp": "00:11:53",
      "start_timestamp_seconds": 713.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=713"
    }
  },
  {
    "text": "because they seem to have really interesting potential at this point. So now let's take a look at the options chain. Today we saw moderate volume. Again, lower on the call side than typical in terms of what's exciting. We're generally seeing stuff that's over 200,000 calls traded in a day. Now it's 132,772. But the put side is very light. This is an interesting ratio actually today. Whereas only 38,000 puts to 132 calls. If we take a look at OI, I see 729K calls against 400K puts. So this is getting closer to being 2 to 1, which again, that's a more bullish positioning for the options than I see in this is compared to what I see now. Although this is still very bullish. This is why it's important to develop a relationship with products because a lot of times people could see this and be like, wow, 729 to 409, it's going up. But if you don't have the context of what this number has been historically and you don't realize that this relationship is actually low on a comparative basis in terms of call skewed to the put side. Now it's still a bullish in arrangement, right? There's a lot of people speculating to the upside here and they continue to do so. What I'm seeing though is more and more of this build out in 16 August. That's specifically what I want to highlight for you guys. I'm not seeing a lot of people",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 20,
      "start_timestamp": "00:12:53",
      "start_timestamp_seconds": 773.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=773"
    }
  },
  {
    "text": "arrangement, right? There's a lot of people speculating to the upside here and they continue to do so. What I'm seeing though is more and more of this build out in 16 August. That's specifically what I want to highlight for you guys. I'm not seeing a lot of people moving these positions out to 2 August. There's some but not a lot. So if we take a look at a bunch of this volume for today, there was a ton on the, what is it? The 25s for this week and next week. My speculation is that some of these are closing positions and moving out to 2 August. That's my guess. We'll know tomorrow. It's a pure guess at this point. But what I see at these 25s is 13,770 OI with essentially 11,000 volume today. It was negative 88 over yesterday. So people started closing positions out yesterday. My guess is more of this 13,000 will be closed out tomorrow. And a lot of these, my guess is that if we go out into next week, will be reopened here. Right. And actually, this was already partially confirmed because the open interest on these is only 7930 and the volume is 91 away. So immediately, there's adding volume to this. So this number will be net positive tomorrow with people moving out to essentially 2 August. But that's essentially where I'm seeing that happen. The vast majority of the remaining activity that I'm seeing is moving us",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 20,
      "start_timestamp": "00:14:04",
      "start_timestamp_seconds": 844.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=844"
    }
  },
  {
    "text": "and the volume is 91 away. So immediately, there's adding volume to this. So this number will be net positive tomorrow with people moving out to essentially 2 August. But that's essentially where I'm seeing that happen. The vast majority of the remaining activity that I'm seeing is moving us further out into this 16 August. So if we take a look at this front expiration, there's 178 K calls. Next expiration is 64. Next after that is only 23. And then out in 16, it's 197. So what this further expiration for the first time in a long time actually overwhelms the front explorations. And this is just telling me that more and more of the interesting behavior, more likely than not, is going to start looking at 16 August during the op-ex. And you can also see this just take a look at the open interest skew here, 197 to 107. This is much closer to 2 to 1 than when we look across the broader relationship here. So overall, it looks like that's where most people are starting to kind of position themselves out into. Now the other thing I want to look at quick is just the order flow as it's been coming in. I'm limiting this by 50 lots or higher just to find some of the bigger trades. We have the 26 July, 35 calls, 1100 of those for three cents. That's an interesting trade to me. So somebody bought those. And I'd love",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 20,
      "start_timestamp": "00:15:18",
      "start_timestamp_seconds": 918.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=918"
    }
  },
  {
    "text": "the order flow as it's been coming in. I'm limiting this by 50 lots or higher just to find some of the bigger trades. We have the 26 July, 35 calls, 1100 of those for three cents. That's an interesting trade to me. So somebody bought those. And I'd love to know why it's not a big trade. So I don't really care about it quite that much. But I'm still curious about it because I mean, you got a day left. So this is hard for me to make heads or tails on whether or not this is just somebody coming out with a crazy yolo. I wouldn't put it past somebody. Or if this is some sort of institutional hedging, it's hard. It's really hard for me to see. But I find that trade generally interesting. Now same thing with these 22 puts, there's 837 of them, but 19 cents like the problem is a lot of these are just smaller value. There are some decent value trades like the two log 20 calls, 310 of those at 350. But most of the volume that we're seeing today is just lower premium amounts. And this really doubles down on what we've been seeing lately in GameStop. I'm grabbing unusual whale so that we could take a look at today's activity specifically. And we can see what the premiums work. I haven't looked at this yet. And this is interesting. There's some activity here. So this was today at",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 20,
      "start_timestamp": "00:16:34",
      "start_timestamp_seconds": 994.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=994"
    }
  },
  {
    "text": "on what we've been seeing lately in GameStop. I'm grabbing unusual whale so that we could take a look at today's activity specifically. And we can see what the premiums work. I haven't looked at this yet. And this is interesting. There's some activity here. So this was today at 0710 at the ask 500 of the 20 calls out in September. Interesting. That's a 200,000 position. So we're starting to get some position showing up that are breaking, you know, over 100,000 in premiums. They're all purchased calls, but they're across different time frames. So I see the 20s here in two aug. I see 16, Jan 26 kind of really far out. This is a smaller position, but just super far out in time. Then 23, this is interesting too. I'm surprised that none of these are for the primary expiration. I have to be honest with you. So when I look at this, I would expect more of them to be in the 16 aug. Let me put it side by side like that. Maybe easier to see. This is the primary expiration. And I don't actually see a lot of activity going on there, which does surprise me. Let me take a look real quick at that cycle. Color me shocked. I'm surprised. I'm very surprised. I would have expected some larger trades happening there. This is very interesting to me. So there's definitely people building side. I mean, 200,000 again, I know it can be",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 20,
      "start_timestamp": "00:17:36",
      "start_timestamp_seconds": 1056.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=1056"
    }
  },
  {
    "text": "surprise me. Let me take a look real quick at that cycle. Color me shocked. I'm surprised. I'm very surprised. I would have expected some larger trades happening there. This is very interesting to me. So there's definitely people building side. I mean, 200,000 again, I know it can be kind of numbing when we're so used to seeing somebody like roaring kitty who's dropping these just wildly size position. So it can kind of skew your perception of reality. But buying 200,000 in calls is not insignificant. Especially they're essentially the ones building out the strike. So if we go to six September, which is just a weird, weird expiration. It's almost like tasty trade-esque, like 45 days out. Maybe there's somebody out there yellowing from tasty trade. That would be hilarious. And it was those 20s, right? No, the, am I wrong? The 20s? Yeah, the 20s. They're essentially the entire volume for these. There's 46 other people. But this one trade is the overwhelming majority of this position. And that's interesting to me. I don't know why you picked this one. I really don't know why you picked this one. Because again, like if I were to look at this, let's just add a curiosity. Let's compare. Let's go to the 20th September. Let's check out those 20s. And these are 75 cents wide, 530 to 605. These are 1.70, essentially. Like just way more liquid, way more liquid. That's nuts to me. I don't know why",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 20,
      "start_timestamp": "00:18:47",
      "start_timestamp_seconds": 1127.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=1127"
    }
  },
  {
    "text": "look at this, let's just add a curiosity. Let's compare. Let's go to the 20th September. Let's check out those 20s. And these are 75 cents wide, 530 to 605. These are 1.70, essentially. Like just way more liquid, way more liquid. That's nuts to me. I don't know why you would pick this. It's just what I'm highlighting here is for putting on a larger position, this is so liquid. In comparison to something just one week after it at the same strike, if you like, or even something further in the money. These are a 1.40. But these are just just relatively so liquid. And they were the only person playing in there. There was just there's not a lot of activity activity activity happening out here in six set. Actually, let's take one last look here at I just want to see what's out there. Nothing. Like there's just so little happening out in this expiration. Yeah, this, I mean, this dude is out there by himself. Interesting trade. We'll have to see. Well, as always, that's what I'm seeing right now. If there's anything else you want me to look over, feel free to send it in. I love seeing the emails and seeing what I can talk about our answer for you guys. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 20,
      "start_timestamp": "00:20:11",
      "start_timestamp_seconds": 1211.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=1211"
    }
  },
  {
    "text": "in. I love seeing the emails and seeing what I can talk about our answer for you guys. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "MpkbcFWS9pk",
      "title": "GME Strategy Session: Analyzing the Stock and Options Chain",
      "url": "https://www.youtube.com/watch?v=MpkbcFWS9pk",
      "upload_date": "",
      "duration": 1300.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 20,
      "start_timestamp": "00:21:32",
      "start_timestamp_seconds": 1292.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MpkbcFWS9pk&t=1292"
    }
  }
]