[
  {
    "text": "Delta is not a good approximation for probability of being in the money under two conditions. And I'm going to show you. First, let's take a look at spy. If we go out 39 days, we go to a 30 delta option right here. The 30 delta would tell you about a 30 probability of being in the money at expiration. And if we go over and we look at the actual calculated probability, which is different, it shows this 28.14. So it's pretty dang close, right off by 2.2 cares. Well, let's now go out further. Let's go to 16 Jan, which is 249 days out. Let's go to that same 30 delta, 29 delta close enough. This would tell us 29 probability of being in the money at expiration. And this one instead has 25. So what just happened? We're in one of the most liquid underlines that exist. And what you just learned is that if you go further out in time, the relationship starts to break down more. Now again, this is still close enough because it's super liquid, not very volatile, which is the next key component. Let's take a look at Tesla. If we do the same exercise, let's first do the 39 DTE. And we do the 30 delta. You'll notice 30 delta, 30 chance being in the money at expiration. This is instead 23.7. That's a pretty big difference. This is actually bigger difference than what you saw in spy going further",
    "metadata": {
      "video_id": "mRnYJOmu_BM",
      "title": "Delta as Probability",
      "url": "https://www.youtube.com/watch?v=mRnYJOmu_BM",
      "upload_date": "2025-06-03T22:15:06Z",
      "duration": "PT2M7S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 2,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mRnYJOmu_BM&t=0"
    }
  },
  {
    "text": "do the same exercise, let's first do the 39 DTE. And we do the 30 delta. You'll notice 30 delta, 30 chance being in the money at expiration. This is instead 23.7. That's a pretty big difference. This is actually bigger difference than what you saw in spy going further out in time. So pay attention. Let's go to 16 Jan, 26. Let's go to 30 delta again, 29, 31, same same. Just go somewhere in here. And you'll notice that the probability of being in the money is now about 15. About half. What's happening? There are two things that skew using delta is the probability. Volatility is one. Second is duration. This is why it is typically still good practice to just use this separate calculation. There is a separate calculation for it. I have a video that goes through that. I'll throw it in the notes. But as always, if you any questions, let me know. Be an all-air sealer.",
    "metadata": {
      "video_id": "mRnYJOmu_BM",
      "title": "Delta as Probability",
      "url": "https://www.youtube.com/watch?v=mRnYJOmu_BM",
      "upload_date": "2025-06-03T22:15:06Z",
      "duration": "PT2M7S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 2,
      "start_timestamp": "00:01:11",
      "start_timestamp_seconds": 71.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=mRnYJOmu_BM&t=71"
    }
  }
]