[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you the the the the I I I I I I I I think cream is very close to where I probably would take it. Jordan says find the right fit options are not always it. That is good advice. I definitely think that that's something a lot of people skip over. So I'm glad that you mentioned that one as well. Then I think about the most important concept for an options trader. The very first thing because I get people that ask me all the time. A lot of my friends will ask me things like, Eric, how do I do what you do? Can you teach me what you do? As much as I would love to say yes to those kinds of people, I know the reality of things. We're going to talk about what the reality of things actually is. In order to do this whole thing, we need to again go back to what the point of the session today is. The point of the session today is to give us an orientation on this world of trading and to give us a starting point to have a conversation. So let's do that. What I'm going to do is go on to theta gang and options and we're literally just going to pull through. We're going to see I literally typed in the word start",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "world of trading and to give us a starting point to have a conversation. So let's do that. What I'm going to do is go on to theta gang and options and we're literally just going to pull through. We're going to see I literally typed in the word start and I'm just seeing what advice people give other people when they're looking to start trading options. I haven't looked at this yet. I just grabbed a bunch from right before we started. So let's see. I'm going to let Thor out because I just got home. I'm going to get like a doggy door for him or some shit. So let's see. This person says where to start for beginners. It looks like they're looking to get this person as two years ago. First comment here, bit advanced. That's fair. There's specific about selling options. Theta gang makes sense. It's fun. I like it. Understand what you're doing. Understanding the basics is important. Start off paper trading. That's good advice. Starting off paper trading. Trying to sell a call. Sell a put. Singular. Do it again. Something not too expensive. For plays. So this. This feedback as I just eyeball over it. I think this is way too tactical of a starting point for somebody that says I'm interested in getting started with investing. I think this is way too tactical. And we'll talk about why that is. Let's click another one. This one says this is also Theta",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "eyeball over it. I think this is way too tactical of a starting point for somebody that says I'm interested in getting started with investing. I think this is way too tactical. And we'll talk about why that is. Let's click another one. This one says this is also Theta gang. We'll just poke through this new here. Haven't found any introductory material pins. Basics about options. They're looking to familiarize themselves with trading. This person says read this book. I don't know what this is, but I'm not clicking it. Tasty trade option alpha. Great beginner material. Mike in his wayport series. I like that. Nadenberg's option pricing volatility must have for any serious trader. I don't like what I don't like this. And it's not because I don't like Nadenberg. I actually like Nadenberg. My guess is this person simply recommending it just to recommend it because they've heard other people recommend it and they think that you are supposed to recommend it. Otherwise, you're not really an option trader. I again, I like options pricing and volatility. It's a good book, but I don't inherently think that you have to have it. I think if you are a serious trader like looking to do this professionally, you definitely should read it. But I think for somebody like in this circumstance, it might not be a great starting point for them. I like the concept about be careful with Reddit advice that is really, really solid of what",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "a serious trader like looking to do this professionally, you definitely should read it. But I think for somebody like in this circumstance, it might not be a great starting point for them. I like the concept about be careful with Reddit advice that is really, really solid of what YouTube gurus, anyone touting secret catch all strategy. They're full of shit that is fantastic advice. I love these, I love these here. And the reason why I love these here is because this is giving slightly higher meta level advice, which is actually think the better starting point. That's the effective foundation for a new options trader. It is nothing to do with options. It has everything to do with understanding this broader scope of the landscape we play in. And we'll talk more about that in a second. One of the things I will say I have changed my mind on is the courses thing. I still have not taken one. I've taken free ones through MIT open courseware and places like that. But one of my friends, Benjamin, from the Benjamin YouTube channel, he and I keep in touch. And I always told him that the courses are kind of bullshit. And he expressed a few courses that he's taken that he's actually gotten significant value out of. So my opinion on it is changing to the degree that I can absolutely see value in a good course emphasis on good course. I think the overwhelming majority",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "are kind of bullshit. And he expressed a few courses that he's taken that he's actually gotten significant value out of. So my opinion on it is changing to the degree that I can absolutely see value in a good course emphasis on good course. I think the overwhelming majority of courses that exist are straight trash. And I think that for anybody that's a new options trader, you don't need to pay for a course. You don't really get a good course through MIT open courseware for free. So there's a little more nuance in my opinion. I learn through reading. And I mean, if you think about it, a good course is effectively interactive reading. Like that's what it should be. But the reality is most of the stuff I've ever come across has been hot trash. But when I was talking to Benjamin about it, I understood his perspective and I can adopt that as part of my paradigm now. But there's no reason to pay, especially if you're a brand new options trader, there's no reason to pay for a course. You literally can go take free stuff online through really reputable institutions via open courseware and just get a good start there. So I actually like that. All right, let's click through a couple more. This one says is 1,000 enough. This is a terrible answer. This is also a terrible answer. These are bad answers. The reason why these are bad answers is literally",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "and just get a good start there. So I actually like that. All right, let's click through a couple more. This one says is 1,000 enough. This is a terrible answer. This is also a terrible answer. These are bad answers. The reason why these are bad answers is literally the way that they're saying to start trading calls and puts literally the way that they frame that tells me they're not ready. The fact that you would say these words in this way immediately tells me that you are very new. And you probably should take a little more time to learn with respect to is 1,000 enough is whatever, right? You can start with 0 in paper trade. So I don't really care about the dollar amount. I do still think that the more money you can start with provided that you have a good foundation, the safer you actually can be because your portfolio isn't inherently in a compromised position. But starting with more money is risky because a lot of people start before they're ready and blow up their money. So by starting with a smaller amount of money, you really manage your maximum drawout potential. So it's kind of pick your poison in that sense. I actually think starting with more capital, but after a longer period, paper trading is probably slightly more efficacious than this. Couple more. 50,000 savings start trading options safely. I don't want to use all 50 for options, which strategy",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "So it's kind of pick your poison in that sense. I actually think starting with more capital, but after a longer period, paper trading is probably slightly more efficacious than this. Couple more. 50,000 savings start trading options safely. I don't want to use all 50 for options, which strategy is better for safe trades. Again, by the phrasing of this, this person needs the paper trade. They're not even ready to start trading for a quote unquote, safe trade. So I want to target average to return 2 return on risk monthly. That's actually a good caveat. I like that they said 2 return on risk because that's actually way more achievable, especially for a new trader, 2 return on your risk is not crazy for a new trader to be returning 2 on the portfolio every month. It's still doable, but for a new trader, it's probably not going to happen. But for return on risk, it's much more doable. But let's see, there is no such thing as safe options. I actually disagree with that. I think there absolutely are. Getting 2 is very, very unachievable in my opinion. If it was all hedge fund managers would be doing it. These are the worst comparisons on earth. So this is again, somebody that knows a little bit, but really is missing a lot. The concept of if it was all hedge fund managers would be doing it is kind of silly. And it's just because I agree",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "be doing it. These are the worst comparisons on earth. So this is again, somebody that knows a little bit, but really is missing a lot. The concept of if it was all hedge fund managers would be doing it is kind of silly. And it's just because I agree with their broader point of returning 2 and safely, depending on what safely means, they don't really go along with one another. However, they're talking about 2 compounded month over month. And the compounding calculation, I actually like that. But the issue is they're applying a lot of like bullshit interpolation. This is one thing I've learned from just interacting online is everybody is lazy as an interactor. They lazily express their ideas strictly from their own paradigm without taking any time to consider what the other people might read. And then when we're reading other people's stuff, we then lazily interpolate it in our own paradigm without taking the time to understand where the other person is coming from. Why do I say that here? This says, safely, this person is now drawing safely equals risk free. They didn't say without risk. They said safely. They're two different things. But this person's just kind of like reading what they want. The other thing that they're reading is 2 compounded on the portfolio. The point is, this is the exact kind of advice. This is the common shit people are going to see when they're trying to figure out where",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "But this person's just kind of like reading what they want. The other thing that they're reading is 2 compounded on the portfolio. The point is, this is the exact kind of advice. This is the common shit people are going to see when they're trying to figure out where to start. This is, if you could start over what you would, what would you do different buying option sold them? I don't hate that. That one's okay. Allocation, 5 of my account on any single trade. I don't like that advice. Work on trading completely divorced from emotion as a priority from day one. I like the idea. I don't like the way that they frame it. These still aren't really what matters for a new option straighter in my opinion. This is about specific risk management protocols for a specific strategy. There's nothing inherently wrong with this, but it's very specific. The idea of being completely divorced from emotion is bullshit. You cannot be. So this immediately is giving somebody a task that is quite literally unachievable. You cannot be completely divorced from emotion. What your job is as a trader, and this is something we spend a lot of time in the military working on, is managing emotions. That's not suppressing. That's not ignoring. That's not pretending it doesn't exist. That's not divorcing from them. It's understanding them. And then when they come, managing them, mitigating them, that's a completely different thing. The reason why this is",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "lot of time in the military working on, is managing emotions. That's not suppressing. That's not ignoring. That's not pretending it doesn't exist. That's not divorcing from them. It's understanding them. And then when they come, managing them, mitigating them, that's a completely different thing. The reason why this is the wrong scenario is because let's say you actually follow this advice, and then you got emotional during a trade. You notice some sort of emotionality. Then you sit there and you start saying to yourself, things like, well, fuck, I can't get rid of this emotion. I'm supposed to be a robot. I'm supposed to be completely divorced from this emotion. How am I going to do this? I can't seem to grasp how to just get rid of my emotions. And fun fact, you fucking can't. That's why it's bad advice. The rest of this, let's see, where to start. This looks fine. I don't know. They're just giving them like good, good direction, like that. 20-year-old starting with 1,000, let's see. Listen to everyone on here that says, start with long-term stocks. Open a paper-training account and use that to learn options. That's pretty fucking solid. Be honest. When you say fuck all that, good advice. I'm going to trade options anyway. That's fucking accurate. Start by selling options, not buying them. I don't love that. Learn basic credit and put spreads. Call credit spreads, iron condors. Don't get greedy. 4 return per week would be great.",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "honest. When you say fuck all that, good advice. I'm going to trade options anyway. That's fucking accurate. Start by selling options, not buying them. I don't love that. Learn basic credit and put spreads. Call credit spreads, iron condors. Don't get greedy. 4 return per week would be great. What the fuck? We've gone off the rails. We've gone entirely off the rails. Research as much as you can. Watch as many tutorials as you can. I think that's generally okay. I actually don't hate this first one. The reason why I like this first one a lot is because it takes some of the pressure. It takes some of the weight off. I noticed that a lot, especially with coaching clients and stuff like that, where people feel like they're far behind. Then they're trying to do stuff quickly to get caught back up. That's a terrible mentality to approach the world of trading from, which we're actually going to talk a little bit more about mentality. To summarize all of what we looked at, this is what people are receiving from other people when they're asking the question of effectively, how should I start? How should I start trading? What should I do? What should I do to start with? Again, it's a mixed bag, but I would say on balance, it's not really great here. The reason is because a lot of these kinds of people that are giving this advice, they are the group that",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "start trading? What should I do? What should I do to start with? Again, it's a mixed bag, but I would say on balance, it's not really great here. The reason is because a lot of these kinds of people that are giving this advice, they are the group that typically are at a point where they should be focusing more on learning themselves versus trying to instruct and teach other people. Again, that's not always the case. You can give really good advice and guidance even as somebody that's bringing new to something. What happens is you get these really skewed contexts from people baked into their responses and something like this start by selling options. That is so skewed. That is so skewed. I think that's, don't even start by even worrying about options as somebody already directly pointed out in the chat, which I do agree with. If you're at that point in the stages, start thinking about stuff like profit mechanisms. Before you even concern yourself with what option strategy, whether I buy or sell, it's a little too off kilter for the beginning because again, you have to remember by even starting this, we're skipping some really, really important stuff which we're going to talk about. The first thing here is let's talk about the landscape of trading. The landscape of financial markets in general, let's say, is that they're highly complex, super competitive. When I refer to the concept of open here, what I",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "some really, really important stuff which we're going to talk about. The first thing here is let's talk about the landscape of trading. The landscape of financial markets in general, let's say, is that they're highly complex, super competitive. When I refer to the concept of open here, what I mean is that it is just you walking off and being a money manager. That's what you are. When you trade your own account, when you invest or trade, you're a money manager. Now you're not managing other people's money, but you're managing your own money. You're now a money manager, which is always interesting to me because if I am sick, I definitely do my best to do my own research. But then I typically try to find somebody that is more knowledgeable than I am to then figure out what's actually wrong with me and maybe what I should be doing. It's the same thing that happened with my hernated disc. I literally flew out to Florida across the fucking country to go see somebody that I respected and think is a better information source on that injury. So the openness becomes a lot of people's downfalls because there really isn't a lot of structure out there. So it is something to pay attention to and it's something that you should really, really guard against. So what I mean by that is it's guarding against the impulse to just start doing shit by taking the time to take",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "there really isn't a lot of structure out there. So it is something to pay attention to and it's something that you should really, really guard against. So what I mean by that is it's guarding against the impulse to just start doing shit by taking the time to take a step back and thinking through what you're trying to do and then building at least a rudimentary plan on how to get there is going to work a lot better. But I want to linger on this point of the stock market landscape a little bit more and specifically this one. So if we look across the different entities and markets and stuff, there's a lot of them. And this isn't even close to a comprehensive list. This is literally just to give an idea of what's out there. And one of the most important things to draw from as you look at this list of different participants and what the participants might be doing. That's where you are, by the way, in the little retail trader space here. And you can see how much money these other institutions put into doing to literally playing in the same landscape that we do. This is what happens when you go to the Olympics. What countries typically win the Olympics? It's kind of the fucking same ones. And if you look at the countries that tend to win the Olympics, they tend to be countries that have pretty good resourcing. So",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "that we do. This is what happens when you go to the Olympics. What countries typically win the Olympics? It's kind of the fucking same ones. And if you look at the countries that tend to win the Olympics, they tend to be countries that have pretty good resourcing. So when you have these other countries that don't inherently have the same resourcing that are dealing with a smaller population trying to put out their best and be as competitive as they can be, it's much more challenging. But they're competing in the same landscape as these other entities that can spend tons of money on their Olympic programs. The analogy there is designed to try and give you a little bit of context about like we are the third world countries that are just eating rice because it's accessible. And we're running the de-Cathalon against other countries that have near unlimited resources. Just about. Give or take. So you start from a disadvantaged position and it's really, really important to know and accept that. So now let's take a look at the starting point for traders. Most traders come into the market desperate because they want to make money. They're hopeful that they might make money. They're misguided in what they've heard their friends say about that one stock that they bought in a doubled in two days. They don't know what they don't know. So they're ignorant. Like we all are when we start something new. And most",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "They're hopeful that they might make money. They're misguided in what they've heard their friends say about that one stock that they bought in a doubled in two days. They don't know what they don't know. So they're ignorant. Like we all are when we start something new. And most of us are impatient. It's like that example you saw in that how to start. Look at just 4 per week. Don't be greedy. Don't be greedy. Greedy is bad. But target something more humble. Like a 4 weekly return compounded. And the polarity of that is it's a 669 return. That's what that humble return of 4 per week is. So again, we're starting this from the exact wrong spot. So let's take a break right now. And let's think about what we've covered so far from the broad landscape. We know that markets are complex. They're competitive. And it's not the fast, easy money that you thought it was going to be. We know that our starting point tends to be skewed from a bunch of different factors. So now the question becomes what is a good starting point? What is a good place to start? And this is again about options trading. But in this level of the conversation, there's not a lot to talk about with respect to options. It really isn't. Because we are focusing on the foundation. What actually will create a sustainable thing? When I approach these conversations about trading, you have to",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "is again about options trading. But in this level of the conversation, there's not a lot to talk about with respect to options. It really isn't. Because we are focusing on the foundation. What actually will create a sustainable thing? When I approach these conversations about trading, you have to remember, I have seen hundreds of people come and go, hundreds, I mean, thousands even. I don't pay attention quite that close to thousands, but definitely hundreds that I've actually followed along with either known directly or slightly and directly. And I've seen them come and go. And it's because of a lot of these other factors are all misplaced. The very first thing I think is a good starting point for an aspiring options trader is to talk about these expectations. What do you think is going to happen? For that person that says that they want to start trading safely. What does that mean? Maybe it's possible. Maybe it's not. But we need to understand the expectations. As we go through outlining our expectations as a new trader, it's going to add a lot of clarity around what we're doing, what, I mean, really what we hope to do. So here is what I typically tell people with respect to how to set good expectations. One to two years greater than zero. This equals rock star. Literally nobody likes hearing that because it is about as unsexy as it can get. Don't lose money. And you'd think like,",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "do. So here is what I typically tell people with respect to how to set good expectations. One to two years greater than zero. This equals rock star. Literally nobody likes hearing that because it is about as unsexy as it can get. Don't lose money. And you'd think like, man, two years, what the fuck? I'm going to sit here and just try to not lose money for two years. Yeah. Definitely. And I always go back to the landscape. You are competing in the adult arena. There's no kiddie starting place. There is no training wheels. You are out there in the open with everybody else. So again, going back to the Olympics conversation. You as a brand new trader, just going out there trying to trade and get this really big return is literally the same as maybe a high school athlete attempting to compete directly in the Olympics and winning. Some might be able to. There are physical phenomena like that every once in a great while. I'm not really sure how many high school people compete at like a high level and do well. I'm not that familiar with the Olympics, but I would imagine it would be infrequent. However, when we're first starting options trading, the reason why your expectations should be greater than zero is because this is not your focus in terms of how much money you're making. If money you're making is a new option, trade or literally doesn't matter yet.",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "it would be infrequent. However, when we're first starting options trading, the reason why your expectations should be greater than zero is because this is not your focus in terms of how much money you're making. If money you're making is a new option, trade or literally doesn't matter yet. It doesn't. It sounds crazy to say it, but it doesn't. The reason why it doesn't is because you have other things you have to focus on. So let's talk about some of these other things that you have to focus on such as. Let's just think about and throw them in the chat as well to help me brainstorm some of these. What is a new options trader? What are some of the things you have to learn? Let's just spit them. What are some of the things you have to learn as an options trader? There's a bunch I can think of, but let's see what you have. It can be really anything. Just think of the lens from a brand new options trader. What are some of the things that you have to pick up the Greeks? That's correct. If you already saw on the other one, we need to pick up return potential because that new person got advice from somebody that's like, just don't be greedy and do 4 per week, which is a 669 annual return. That's not fucking realistic. He says flow of the markets. So kind of market structure. Well, everything froze.",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "we need to pick up return potential because that new person got advice from somebody that's like, just don't be greedy and do 4 per week, which is a 669 annual return. That's not fucking realistic. He says flow of the markets. So kind of market structure. Well, everything froze. Market structure and operations. H says how they work and when to use different strategies, profit mechanisms, so kind of different strategies. Lauren says profit mechanisms, hems. Lauren Titty, what up? Says risk management. Prem is exactly going the next direction I was thinking, which is just analysis, not even necessarily just options, but that's exactly correct. How to read an options chain. How to do other basic analysis. So again, think of what we're saying right now. We're saying a new trader has to do and this is a short list. This is a summary list of things. This is a short list of shit that an options trader needs to learn. Let's just pick one to zoom in just for funzies. Let's pick the reason one. How to read an options chain. I just didn't video on that. I'll throw a link into the notes for you guys. The reason why reading an options chain is funny because it's also timely is because one of the like reading an options chain was a 16 minute video that I made, a 17 video that is designed to cut out all of the ancillary stuff and to give you a",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "The reason why reading an options chain is funny because it's also timely is because one of the like reading an options chain was a 16 minute video that I made, a 17 video that is designed to cut out all of the ancillary stuff and to give you a to Z everything to at least have a starting understanding. It's a 17 minute video for context. The reason why I'm harping on that is because most content style videos like instructional and stuff like that are like eight minutes. But that's me cutting stuff out trying to make it digestible. So in order to read an options chain, you have to understand what a bit is, what an offer is. You have to know what a strike is. You have to know what an expiration is. You have to know what a midpoint is. You have to know what size is with respect to what's offered. You have to know what a premium is and how to read a premium. So if we're talking about something zooming into something like how to read a premium, this is now where we get into multipliers. You also need to be able to read things like Delta. And I'm not talking at a mastery level. This is like a rudimentary understanding level. Delta gamma, theta, Vega. So as you click into something like Delta, for example, we now understand that there's in the money out of the money at the money. This",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "to read things like Delta. And I'm not talking at a mastery level. This is like a rudimentary understanding level. Delta gamma, theta, Vega. So as you click into something like Delta, for example, we now understand that there's in the money out of the money at the money. This is a completely foreign concept that you have to learn. And it's also inverse for calls and puts. We also know that Delta has a different behavior over time. Because if we plot a time series, I guess Delta can't be negative time series for Delta and let's use Delta level here. And then we have time and let's start with T zero to T100. And this is Delta for an at the money option or let's do a out of the money option, like maybe 5 out of the money, either way. Well, what ends up happening is as we get closer to expiration, Delta, you'll notice actually decays. Oh shit, I don't know shit about charm. Guess what? You now just got introduced to another Greek, to a second order Greek charm. What I'm showing you is that this is one single fucking talk track from one single component of one single stage that a new trader has to learn. All of this just stem from how to read a fucking options chain. And you're now swimming around in the world trying to figure out what the fuck is charm. What in insane series of tasks that a",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "component of one single stage that a new trader has to learn. All of this just stem from how to read a fucking options chain. And you're now swimming around in the world trying to figure out what the fuck is charm. What in insane series of tasks that a new trader has to complete. So going back to this landscape analysis, just think about how much a new options trader needs to do yet. We're so focused on how much money we're going to make where it doesn't, it literally doesn't fucking matter. You have to get all of this other stuff down first before you're even remotely concerned with how much money you might make because you need to learn the tools of what you're doing. A great example for this is if you are a jujitsu practitioner and you go as a brand new white belt one week into training and then you decide I'm going to go compete, which is very cool. By the way, it's a great, it genuinely is a great decision. But when you go to compete, your, your target is to submit everybody to win all of your matches through via submission. Again, guess what probably ain't happening even remotely that if somebody that's new to jujitsu asks me like, Hey, Eric, you recommend going to a competition early. Why is that? It's for the experience and it's to get it out of the way to get your first competition jitters out",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "Again, guess what probably ain't happening even remotely that if somebody that's new to jujitsu asks me like, Hey, Eric, you recommend going to a competition early. Why is that? It's for the experience and it's to get it out of the way to get your first competition jitters out of the way doing it as a white belt. There's no expectations of you. It's a really safe place to go get that first one done. You get rid of all the pregame jitters. You have an idea of what the process looks like. So that is you continue competing over time. It's not like this big thing that now you're nervous about even though you might be good, you have to get over the nerves. You just knock that out right out of the gate. The reality of that white belt going to that jujitsu competition and subbing anybody, let alone everybody is about zero. So a new trader having a healthy focus early on is absolutely vital to their long-term success. Because what's uncomfortable to face for all new traders is that the results of your initial trades literally don't matter. They straight up don't matter. The results of your first few years of trading really don't matter because you are laying the groundwork for something that's way more important. You're laying the groundwork on how to be organized, how to develop a process. If somebody asks me what is the defining factor for whether or not somebody",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "of your first few years of trading really don't matter because you are laying the groundwork for something that's way more important. You're laying the groundwork on how to be organized, how to develop a process. If somebody asks me what is the defining factor for whether or not somebody is able to be successful as an option trader, it is literally these two. Pull down to this. The ability to iterate into optimize. That is what entirely boils down your successes and option trader. There is nothing else that becomes more important than this. Because if you are capable of successfully iterating, that means you can receive feedback from some sort of activity as a trader, you can integrate that into your planning. You can then run your next iteration with that new integration. You can then get the next series of feedback and you can continue this cycle of iteration. Because here is what happens when people say like, oh, you need to master how to trade an opening range breakout. Sure, that could be a viable strategy. That doesn't matter. Literally doesn't matter. Because your ability to just shoot from the hip and run an opening range breakout approach without running into problems is about zero as a new trader. Here is what happens during this process here. We have an action. There is going to be an outcome. There should be an analysis. And then this is where optimization slash iteration is. This cycle is effectively",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "breakout approach without running into problems is about zero as a new trader. Here is what happens during this process here. We have an action. There is going to be an outcome. There should be an analysis. And then this is where optimization slash iteration is. This cycle is effectively what allows you to figure shit out as a trader. So if you have an action where you oversize the trade, undersize the trade, whatever it is, if you have a good process and you can ingest that outcome and objectively identify what the fuck happened, then you can make logical refinements that eventually will literally walk you onto target eventually. It's not about being able to trade like a robot. What ends up happening is if you can adopt this process driven mindset, you inherently stop caring about the outcome of any one individual trade. You now are already innately managing your emotions because you're not hyper focused on the outcome. You care more about your application of a process. So in my opinion, the most important thing for a new trader to keep in mind for laying a healthy foundation is setting good expectations. If you can set good expectations, it's literally what leads to the rest of this cycle. That eventually is what we expect to lead to the ultimate success of the trader. But the funny thing is if traders actually adopted this kind of thing, the entertaining part to me is all of the questions",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "good expectations, it's literally what leads to the rest of this cycle. That eventually is what we expect to lead to the ultimate success of the trader. But the funny thing is if traders actually adopted this kind of thing, the entertaining part to me is all of the questions start to shed. Meaning should I buy options or should I sell options? Should I go 60 days out? Should I go 40 days out? All of those questions start to go away. If you conduct an action, observe the outcome, analyze it and then iterate off of what you've learned from that cycle. Does that mean you have to do it with real money? No. Everybody here already knows that I am an evangelist for paper trading. And it's because I think it literally is the optimal way to learn most of this stuff. But this, to me, is the actual foundation for successfully being able to learn to trade options. Notice how very little of this has really anything to do with options. And it's because it doesn't matter yet. If you're trying to build a successful approach, you get into the details of options, how to integrate them later. But in order to be able to even healthily be able to do that and to get something out of it that's usable for you, this is where we start. We start by managing our expectations and developing a focus. I have a post. I'll show it to",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "them later. But in order to be able to even healthily be able to do that and to get something out of it that's usable for you, this is where we start. We start by managing our expectations and developing a focus. I have a post. I'll show it to you on Reddit. And it's a similar post style thing to what I have on my website. Get rid of all that stuff. So on my website, the very first thing under there is a options trading guide here. Kind of optimized for mobile view. So it looks kind of silly here. But it's literally a step by step list of things in order that I think makes sense in order to build a successful relationship with trading option. And then I have another that's actually even more in depth that includes things like sub-topics like what to focus on in different time frames. So here, this is that structure phase. And this is just a proposed structure. This isn't the structure. This isn't the right way to do it again. It's really going to be up to you. But what I'm showing you is the importance of this segment here. Your ability to focus your efforts, especially that's a new issue today that didn't exist when I was trading is you guys now deal with information overload, which I'm not even suggesting is like some sort of easy problem to deal with, especially if you're highly analytical or trying",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "here. Your ability to focus your efforts, especially that's a new issue today that didn't exist when I was trading is you guys now deal with information overload, which I'm not even suggesting is like some sort of easy problem to deal with, especially if you're highly analytical or trying to figure out the quote unquote best thing to do. This is actually like a really frustrating problem to try to deal with without a doubt. Like I truly, truly believe that. So I don't envy the difficulty that's baked into this because it is absolutely challenging. That being said, it is absolutely manageable and it is something that you can work your way through. So I'm going to take a pause on all of that and I just want to have a conversation with you guys. And I want to understand, especially for the newer traders on where are you right now in your options trading career, meaning do you feel like you're starting to get it? Are you brand new? And then the second question I want to know is what are you working on right now? My goal by asking this is literally to spend another 15 minutes with you guys talking about your specific scenario and trying to give you some direct feedback on based on where you're at and what you're trying to work on. If what you're working on may or may not make sense in some different ways to think about what you're",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "minutes with you guys talking about your specific scenario and trying to give you some direct feedback on based on where you're at and what you're trying to work on. If what you're working on may or may not make sense in some different ways to think about what you're working on. So now we have an open chat style conversation that is the intent for the rest of the stream. Ayo, Cryptado, thank you so much for the dinner supply. We haven't figured out what we're doing for dinner yet. So if you guys have any recommendations, let me know. I don't really know what I'm feeling. I'll have to have to manifest. I'll have to think on it, figure out what I literally have no idea what I would want for dinner. We'll see. So for those, especially for those newer traders, I definitely want to know what you're trying to work on right now so that literally we can talk about it. And hopefully see if we can have some breakthroughs. That's what I would love to do. Let me get caught up. The point to the says, Charm, what the fuck is that? That's a great question. It's a fantastic question. So if we take a look at our handy, bandy, man, this PowerPoint thing is getting kind of crazy. Good Lord, this. So Charm, as you can tell, is a second order Greek. Essentially, we refer to it as Delta decay. It's the rate of",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "question. It's a fantastic question. So if we take a look at our handy, bandy, man, this PowerPoint thing is getting kind of crazy. Good Lord, this. So Charm, as you can tell, is a second order Greek. Essentially, we refer to it as Delta decay. It's the rate of change of Delta due to the passage of time. If I were to think about some of the more important second order Greeks, really it's these three. Gamma, Charm, and Vanna. Volga can matter if you're trading a lot of like really big vol, but these three is what I would spend time focusing on. And then like third order Greeks, they're good to know, but you really don't have to worry about them quite that much color. I do think matters. But yeah, I mean, I, I, I, there's even more than this believe it or not, but these are the ones that I, I use the most and of these that I use the most really row is I barely use row. But Delta, Theta Vega, Gamma, Charm, Vanna. Don't care about Vera, Veda, Volga, and Vama. All of those count color speed, Altima, and Zama. So anyways, Charm effectively Delta decay. I wanted to think about it. Damn, this, this is kind of crazy. So what I've, what I've started doing is moving out of Critta and I'm starting to move more into this slide deck because I think it's kind of fun to have like a",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "Charm effectively Delta decay. I wanted to think about it. Damn, this, this is kind of crazy. So what I've, what I've started doing is moving out of Critta and I'm starting to move more into this slide deck because I think it's kind of fun to have like a million slides in here about pretty much anything that we're going to use. So that's the goal. H says getting practice in adding options to my buy and hold portfolio. Lots of practicing selling calls to get a hold of short premium strategies, moving to short strangles, been using a small percent for long calls, trying to optimize credit received on the short trades versus the risk and learning to get better at managing feels like I do too much when I should do nothing and not enough when I should act. That's a fascinating, that's a fascinating analysis. There's a couple of things that I think of. The first question I would have for you, H, is what is the goal of adding options to your buy and hold portfolio? As you know, I am a really big fan of beginning with the end in mind. So by clearly defining what we're trying to achieve through in this case, adding options to the buy and hold portfolio, we can actually gain a lot of clarity around what we're trying to do. Because I think there's quite a lot to pull away from there. So I'm happy to, happy to",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "defining what we're trying to achieve through in this case, adding options to the buy and hold portfolio, we can actually gain a lot of clarity around what we're trying to do. Because I think there's quite a lot to pull away from there. So I'm happy to, happy to dive into that a little bit with you. But that's my first question for you, is how do options even fit into your broader trading approach? What are you trying to do there? Your response matters because let's say, for example, you're trying to use options for leverage or let's say that you're trying to use options to reduce risk or you're trying to use options to amplify an existing buy and hold position. There's like a million things that you could conceivably do. I was literally talking with a friend earlier today about a position that they have. And they're holding shares of a stock that they really like. And they ended up selling a string of calls over the last few weeks. And it's like, they're all pretty deep in the money now. And I was asking how many calls did you sell against the shares? And they said, well, they're all covered because they were learning about a covered call. And then I asked, I was like, oh, interesting. I was like, so are you trying to get rid of your shares? And they said, no, I don't want to get rid of my shares. So then",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "said, well, they're all covered because they were learning about a covered call. And then I asked, I was like, oh, interesting. I was like, so are you trying to get rid of your shares? And they said, no, I don't want to get rid of my shares. So then I'm sitting there thinking to myself, that's kind of backwards. Why would you sell calls on all the shares if you're trying to keep your shares? And that it's like that kind of lapse simply from not starting from first principles, which is again, defining what we're trying to do. So H says the goal is to reduce drawdown slash generate income on top of my holdings. The income being to size up and eventually leverage the position via timing, rotating in and out of options and equity. Okay, that makes sense. So then when we think about reducing drawdown in generating income, those two things are slightly counter opposing. So then the next question for you is which one of those matters more. And then by going through this kind of exercise, you can very clearly literally dial in exactly what makes the most sense. And you hear me talking about trading and you hear me talk about this idea of getting backed into a trade. It's effectively this because let's say let's go through the trade process up here. It's a great example that's somewhere in here. Don't worry. I don't know where it is, but it's somewhere",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "talking about trading and you hear me talk about this idea of getting backed into a trade. It's effectively this because let's say let's go through the trade process up here. It's a great example that's somewhere in here. Don't worry. I don't know where it is, but it's somewhere in here. So notice how I start by just looking at the portfolio. The reason why this matters is let's think about the different strategies that I trade. Most of you are familiar with most of them. So I'm not going to list them all out. But I effectively have stuff to trade most directions. So Thor is literally just sitting outside my door. That's hilarious. Um, Mel just sent me a picture of him. So the way that we know though is that I have something that I use for pretty much all different market conditions, right? So bullish bearish volatility. Yada yada. Okay. So let's start with this portfolio fit idea. Let's use literally what the portfolio looked like earlier this week. It's a fantastic example because it's very current. So I had recently gotten back from traveling last week, I think. I don't remember. I think it was last week. And before I go to travel, I typically have a generally blank slate, not blank slate in that all my trades come off, but I pretty much just keep my core stuff on. So then when I got back from traveling, my imperative when I looked at",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "was last week. And before I go to travel, I typically have a generally blank slate, not blank slate in that all my trades come off, but I pretty much just keep my core stuff on. So then when I got back from traveling, my imperative when I looked at the portfolio was I need risk. Okay. That doesn't help me much, but it does tell me that I need to use some money. So then the next thing I need to figure out is what do I think about the broad market? What is my current broad market assumption? And based on this, I essentially need to overlay all of those other details. So for example, this really starts from this stage here where we're thinking about how something will fit into the portfolio based on the broad market assumption. So here, essentially, I would say before you begin the scanning process in this stage, we need to assess market. I guess it's really not even assessed. It's just to analyze. So this would be analyze the market, create a hypothesis, then we would begin the scanning process and ask, how does this trade fit with the portfolio? I like that. So after I looked at the portfolio and I say, I need risk, I conduct that market analysis. And as I'm looking at the market, I'm saying, well, short term price up, short term price is going up, longer term, there's a lot of pressure. So I don't",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "like that. So after I looked at the portfolio and I say, I need risk, I conduct that market analysis. And as I'm looking at the market, I'm saying, well, short term price up, short term price is going up, longer term, there's a lot of pressure. So I don't really have an opinion, but I favor the downside right now. So what does that tell me? Well, as I look at the overall portfolio, I'm long beta weighted delta's to spy. So I'm overall long, but that kind of contradicts my longer term idea here. So then what I start doing is I start looking for other kinds of things that fit the broader portfolio based on this idea. So by clearly defining up front, not by going out looking at the markets, I do that anyways, but by literally starting the process from a point of what does the portfolio need based on my current overall market assessment and the current portfolio construction, I can naturally back myself into different things. So like, for example, am I going to go out there and sell puts on spy? No, I know that. Am I going to go out there and start selling short puts or long calls on any of the mag seven? No. And it's because I'm already exposed to them via SSO T triple cues, which is the bulk of the portfolio that I'm sharing with you guys right now, the model coverage triangle portfolio. So that",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "and start selling short puts or long calls on any of the mag seven? No. And it's because I'm already exposed to them via SSO T triple cues, which is the bulk of the portfolio that I'm sharing with you guys right now, the model coverage triangle portfolio. So that risk is already there. So I already know I need to look in other places. So when you clearly define these things, it literally naturally starts limiting some of your selection criteria. It makes the problem so much easier to solve. So that's the purpose of that definition phase. So for H, that's literally what I think is next is going through and running that from A to Z. And then once you get to the bottom of that, you can then figure out what kind of positions make the most sense. So H says, I want to keep the shares build a position is comfortable trading in and out. I guess the income generation. But to have dry powder and you see like, you notice how you use a phrase, I guess, it means it's not defined. And that's the exact kind of thing. This is exactly the kind of thing that I work through in the coaching calls is to try and make sure that everything that we're doing is aligned with the broader objective. And then we dial in and drill in deep on how to figure like how to actually execute. But that process of figuring",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "of thing that I work through in the coaching calls is to try and make sure that everything that we're doing is aligned with the broader objective. And then we dial in and drill in deep on how to figure like how to actually execute. But that process of figuring out how to execute really becomes very simple. Once you have everything pretty clearly defined. So going back to H's example, understanding if I care more about generating income or reducing risk. Because what I would tell you is that short calls are a terrible way to reduce risk. It's a really common misconception. People say like, oh, sell calls to reduce the risk on the portfolio. And it's not wrong in the sense that it can help. But it's not like this. It's really not the primary purpose of what that is. So let's take a look at a company. Let's take a look at Nvidia. And let's go back in time. Let's go back to the 14th of April. And let's take a look at this scenario operationalized. We're going to go to 14 Feb. And let's say that we wanted to buy shares. And we'll track them in here for the sake of this example. Oh, this one's good. This really doesn't have anything. So let's say we have whatever size portfolio. Let's say that you have 100,000 portfolio that's our go to. I need to clear all the formatting so that I don't have to redo",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "in here for the sake of this example. Oh, this one's good. This really doesn't have anything. So let's say we have whatever size portfolio. Let's say that you have 100,000 portfolio that's our go to. I need to clear all the formatting so that I don't have to redo this for everything. Okay, or I still need to do that. Why? Just clear the formatting, bro. This percentage is whatever. Okay. 4,000 right now Nvidia is trading at 136. 61. And let's say that we just want to essentially consume the portfolio here. So we'll get 732 shares. Obviously, you can't, well, you can have partials, but you shouldn't. Partials are a complete, a complete bullshit thing. So you have your 732 shares. It means we can sell up to seven calls. So let's do kind of standard protocol. We go out 35 days. We go to like a 30 delta here, 153s. So we're going to have the 153 strike. The premium on those is 442. Notice what I'm doing here, by the way, for this entire exercise. I'm literally doing it in Google Sheets. I don't have to pay for trade on here at all. I look at it to get the pricing, but literally don't have to pay for trade on here at all. Just a note. So here we have a seven lot. That's seven lot. Obviously, cover 700 of these shares. So let's see how much money we take in. 3094. Okay. So now",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "at it to get the pricing, but literally don't have to pay for trade on here at all. Just a note. So here we have a seven lot. That's seven lot. Obviously, cover 700 of these shares. So let's see how much money we take in. 3094. Okay. So now let's just take a look at what this overall looks like. 732, 732. Analyze this. And then we're saying that we're going to be short. Seven of these. Here. And I always forget I have to change one of these. I just don't remember which one. Think this one. And today, yeah, beautiful. And let's get rid of these extra prices. Get rid of the noise. So what do you notice here? If we buy at spot price right here at 136. 61 and we use the short calls. And you've heard that if you do that with short calls, you get a bit of a hedge to the downside, which again is not fully wrong. But how far to the downside does this actually help you? Well, you can literally just effectively take this off from whatever your basis is. And that's when you're going to start to be in trouble. So if you take a look at where your break even is here, that like 132, 36 ish, right? So literally all we're doing is taking our cost basis less the overall premium received. So our cost basis is 136. We know that we're going to get protection",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "in trouble. So if you take a look at where your break even is here, that like 132, 36 ish, right? So literally all we're doing is taking our cost basis less the overall premium received. So our cost basis is 136. We know that we're going to get protection in this case down to 132. Protection being we would make money off of the short calls enough. So let's see what kind of downside move we can absorb. 3.4 down move. That's your downside protection. This is why short calls are not good for downside protection. For a retail trader to even give a shit about hedging a 3.4 downside move is completely folly. So this is not to talk out against short calls, short calls and covered calls and ratio covered calls are great. But again, this goes back to setting good expectations and clearly defining what the fuck we're trying to do. And the use case for short calls in this in this context. It does absolutely scrub a little bit of downside, but it scrubs so little downside that it effectively doesn't even register that it's scrubbing downside. It doesn't fucking matter because the time that you need this protection is not when the stock is down 3.4. It's when it's down 15 fucking percent. So let's take a look at what happens as we go forward. And we'll just go to like March 25th, because I like that number. And the stock is now at",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "you need this protection is not when the stock is down 3.4. It's when it's down 15 fucking percent. So let's take a look at what happens as we go forward. And we'll just go to like March 25th, because I like that number. And the stock is now at 120. So what's happened here? Well, pretty simple. Right now, you are enjoying. 12,000 loss. You did get to keep this premium. You're still down 9 grand. Sick bro, fucking awesome, right? So if we look at this as a percentage, you're still down pretty big. And again, if we just compare the difference between these, you'll find this as the variance between those. So that's kind of the funny thing about this idea of short calls is some sort of downside hedge. They're really not there. The reason why people do that is because they want to make them out to be again, it's Goldilocks analysis. People want to be able to say things like, oh, well, I get to hold a stock that I like and I get to sell something and collect money for it and it hedges me to the downside. It sounds sick, but kind of again, not really representative of reality. Reese says not on topic, but have you ever overcome not taking losses personally? I've had a remind myself it should hurt a little. I mean, honestly, it doesn't hurt. It really doesn't hurt. I don't care. The concept of wins and losses",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "of again, not really representative of reality. Reese says not on topic, but have you ever overcome not taking losses personally? I've had a remind myself it should hurt a little. I mean, honestly, it doesn't hurt. It really doesn't hurt. I don't care. The concept of wins and losses for somebody like me as a trader is it is all about the system. I can literally guarantee you what would make me very upset with myself is if I made a bunch of money on something that I executed poorly. I genuinely would be upset. That would frustrate me because that shouldn't happen. But the broader world of taking trades any type of way. And when I say that, I literally mean winning trades, losing trades, like genuinely agnostic between them, like it doesn't really matter to me. What matters to me entirely is the execution. If the execution is good, then I'm okay with it. But if the execution is poor, then I am entirely not okay with it. That's ultimately what matters to me. And the way that you get there is you just literally train yourself on limiting your reactions to both winning and losing trades. You even the keel of the ship. You have a winning trade. You look at it and you immediately focus on that that I execute how I should have here. And you go to your trade log and you fill it in. Doesn't matter what the numbers are. You care",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "You even the keel of the ship. You have a winning trade. You look at it and you immediately focus on that that I execute how I should have here. And you go to your trade log and you fill it in. Doesn't matter what the numbers are. You care about the execution side of the trade. If you apply that to both winning and losing trades, then you'll naturally start to mute that response a bit. But there really shouldn't be a massive emotional response in either direction, wins or losses. It typically means that we're off base. Lauren says I lost one K of five K last month almost built it back but very chaotic like a cow trying to ice skate. Well, Lauren, I think you're also in that scenario where you're still probably just bouncing around and not like my guess is if I asked you if you have a written trading plan and a developed trading log. Again, I don't know you can crack me if I'm wrong, but my guess is you would say no, that would be my guess. And the reason is because that kind of draw down doesn't necessarily that doesn't happen that naturally it's not like a terrible draw down like you're fine. But that kind of draw down with otherwise where you likely are at shouldn't necessarily be that frequent unless it was some sort of risk that you knowingly took knowingly accepted and then chose to still say,",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "happen that naturally it's not like a terrible draw down like you're fine. But that kind of draw down with otherwise where you likely are at shouldn't necessarily be that frequent unless it was some sort of risk that you knowingly took knowingly accepted and then chose to still say, okay, like this is a big risk or whatever, but I'm comfortable with it and I'm going to take it anyways for whatever reason like that's a bit of a different scenario on a comparative basis. But the way that we simplify that learning process is by stop worrying about how much money you stand to make on any one individual trade because it literally doesn't matter. And by entirely focusing on the process your approach as a trader, if you do that that will naturally lead to you starting to size down your trades because you don't need to put on a big trade because of the 5,000 account it literally doesn't matter. Lauren says I have a log, but it's written in a notebook. I'm basically a boomer. That's good. And I'm actually glad that you like that's still better than nothing. But unfortunately that isn't really going to serve the purpose that you need it to because the whole point of having a log is to be able to conduct like data analysis. If you go back to one of the recent points in that little slide show that I made for you guys objectivity is very",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "to serve the purpose that you need it to because the whole point of having a log is to be able to conduct like data analysis. If you go back to one of the recent points in that little slide show that I made for you guys objectivity is very important. This is our ability to look at things as they are not how we think they are how we think we remember how they were, but it's to literally remember them as they are. And that's very difficult to do for most traders like we really don't have that solid of a memory and our memory is highly highly skew prone so skew prone. So putting it in a notebook honestly is good. I'm actually happy to hear that you're doing that, but it's still really not enough. And it's specifically for that reason you kind of need to have a slightly better. A slightly better way to log your stuff so that you can actually conduct that kind of analysis because otherwise you're just putting yourself in a compromised position where you're kind of guessing and hoping that whatever it is that you're doing. Is working and it's very difficult to pivot. The again that feedback loop that I described to you like that is life that feedback loop is ultimately what matters like entirely so that's really what I would tell you with respect to that the paper log is good because it's a log but it's",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "very difficult to pivot. The again that feedback loop that I described to you like that is life that feedback loop is ultimately what matters like entirely so that's really what I would tell you with respect to that the paper log is good because it's a log but it's not good enough. So it would be better off taking that process that you're doing and at least taking it one step further. Now you can maintain the paper log if you like if you prefer writing it down, but then I would still have a transcribing process to get it into the like a Google sheet or an Excel sheet so that then you can actually make decisions. Reese says over corrected I'm worried I don't care too much. Yeah, so back to your example it the thing that I would focus on and evaluate my performance about is not the outcome. So I actually don't think that there's any reason to care or not to care about the outcome of an individual trade. I think that there's a really important function to care a lot about the way that you execute that. That's what matters in my opinion. Just says I wonder if would hate that he lost seven of time in aggregate at bats. I don't know shit about baseball. I literally know nothing but. Seems hard the way that they trying to swing them bats at that fast as moving ball. That's about all I got",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "Just says I wonder if would hate that he lost seven of time in aggregate at bats. I don't know shit about baseball. I literally know nothing but. Seems hard the way that they trying to swing them bats at that fast as moving ball. That's about all I got for you guys there. Okay, so real quick before we wrap I want to show you at least let me duplicate this I haven't built the the next slide yet, but I want to talk to you about what the next one roughly is going to cover and I want to get some of your. Some of your opinions so this one is going to be about approach and my vision for this one is to talk to you about things like how to actually make money as a trader. How to build an options portfolio how to manage risk so the next step in this is actually building the building blocks and the approach that we intend to do. And then we'll talk about the actual execution of those things and then we'll talk about how to continually iterate so that we can ingest new information about what we're doing and optimize. So I want to make sure you walk away with is that as an option trader you are in a very competitive space that's complex you are the captain of your own ship. So I want to have to align yourself internally to avoid these very common",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "doing and optimize. So I want to make sure you walk away with is that as an option trader you are in a very competitive space that's complex you are the captain of your own ship. So I want to have to align yourself internally to avoid these very common starting points for traders moderate your expectations. So now what to focus on and when and again if you have no idea you can go to my website there's that options trading guide and then after that you can go to again things like MIT open courseware and grab a grab a course on their options trading you can grab options as a strategic investment. So before you do anything else you should do one of those three things and for those that are like I like to learn this way or I'm more of a practical learner you're not you're not going to magically be a practical learner in the option space is just not how it works you have to understand some of the concepts of it first. So before you do anything else that education has to come here and then you start working on the rest of your requirements as a trader organization this is the basis for iteration tracking and analysis that process that we talked about is how you ingest everything and then always remembering that you absolutely have to be able to objectively analyze what you're doing otherwise this feedback loop becomes completely",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  },
  {
    "text": "of your requirements as a trader organization this is the basis for iteration tracking and analysis that process that we talked about is how you ingest everything and then always remembering that you absolutely have to be able to objectively analyze what you're doing otherwise this feedback loop becomes completely meaningless. So that's what I got that's what's in store for next Friday tomorrow we have the GME live stream and then on Sunday we have the pro trading prep live stream so I hope you guys enjoy your weekend i'll see you all around on the stream being out there see you later.",
    "metadata": {
      "video_id": "MyDkYjuogQ0",
      "title": "Orientation - Outlier Options Trading Foundations | Options Trading for Beginners",
      "url": "https://www.youtube.com/watch?v=MyDkYjuogQ0",
      "upload_date": "",
      "duration": 4757.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=MyDkYjuogQ0&t=0"
    }
  }
]