[
  {
    "text": "What up, outliers. Today is all about GME and we have a hilarious series of new documents on the bed bath and beyond case that have come out recently that are we're going to take a look at mostly tomorrow during the live stream. Today, I just want to do a gloss over of some of the things that have come across so far. And then I want to take a look at GameStop, the stock because it was expiration. And as you know, we have to pour one out for the homies because there was hundreds of thousands of options that expired worthless today. So we got to pay our tribute to the fallen soldiers there. So that's the game playing for say is just looking at some GameStop stuff. So quick update in general on the daily video schema is I'm actually going to go back to picking like one or two specific things that I want to talk about versus like the broad market update because I'm also doing a daily live stream. So the game plan is during the live stream is when I'll do kind of like the market updates stuff. So in the meantime, the video that I release each day other than Saturdays will be about something specific like this GameStop. So here we go. This one was hilarious. This is obviously a deposition of Cohen. So he's the one that's currently answering questions. So you can see like the top part here",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "the video that I release each day other than Saturdays will be about something specific like this GameStop. So here we go. This one was hilarious. This is obviously a deposition of Cohen. So he's the one that's currently answering questions. So you can see like the top part here starting from number eight. They're talking about the consultants and we know that Cohen doesn't have a super favorable opinion of them. And especially in this, like how it all went down. So this is the part I really want to highlight on starting from 13. It says or BCG, right? This is the question. Sure, consultants. I know that you, you are critical of those. But what I'm saying is that you never felt ever while you were invested that they did any of these things. Correct? And here's Cohen's answer for just the g. up moment. The company was losing hundreds of millions of dollars. I don't know what they did or didn't do. They did a remarkable job of driving the company off of a cliff. They get a naplus for that. It's awesome. It's such an awesome response. And as you guys know, I am just an idiot online. I'm not an attorney. I don't know anything about any of this stuff. But from my just deductive reasoning, this is actually a pretty smart answer because one of the issues they have with this case is that Cohen didn't pay the consultants because he didn't feel",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "an idiot online. I'm not an attorney. I don't know anything about any of this stuff. But from my just deductive reasoning, this is actually a pretty smart answer because one of the issues they have with this case is that Cohen didn't pay the consultants because he didn't feel like they did the job. So by answering like this, he's essentially saying that regardless of contractually what they agreed that they would do or not do, the result was bad. So I actually think this is a really smart response, also just a hilarious framing of the response. And yeah, overall, I thought that that was a pretty interesting component to this. From my understanding, I think it was like with BCG specifically, they had like a 30 million unpaid bill of some sort. I'm not saying that they didn't pay them at all. I don't know those details. I just know that I came across that at some point that they had an unsettled account there. And so this is just a hilarious response. The other thing that I thought was interesting was this question or kind of comment from Ruff Willow. And it says, how did this guy pass the bar exam? So Mr. Freen says, no, no, no, if you want to ask him his opinion, you now have him under oath giving his testimony. If you want to show him something and ask him whether he agrees with it, he'll tell you whether or not",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "guy pass the bar exam? So Mr. Freen says, no, no, no, if you want to ask him his opinion, you now have him under oath giving his testimony. If you want to show him something and ask him whether he agrees with it, he'll tell you whether or not he agrees with it. And then you'll have his testimony, Mr. Jaffrey says, okay, thank you for the advice. So these are obviously the again, don't know, guessing two attorneys. It looks like Farina is with Cohen and Jaffrey is on the other side. Now what I do think is important to point out, again, like I understand why people might think this, but you have to know it's fun to poke fun. I love poking fun, trolling a little bit having a bit of a jast and just throwing around some insults. It's a good time. Bans are is great. However, it is also important to make sure we understand like this actually doesn't apply here at all. So this guy is asking really smart questions in the way that he's doing it. So my guess is that person that posted this saying how they passed their bar exam is essentially saying that like Mr. Farina was explaining to Jaffrey essentially how to do things, but from my understanding, during the depositions, one of the tactics attorneys will use is that they'll have a document that essentially has some sort of transcription or information. And then they'll ask the",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "is essentially saying that like Mr. Farina was explaining to Jaffrey essentially how to do things, but from my understanding, during the depositions, one of the tactics attorneys will use is that they'll have a document that essentially has some sort of transcription or information. And then they'll ask the person about what's on the document without showing them. And then essentially what they're trying to do is get a contradiction. They'll say like what did you do last Tuesday? And the person will say what they think they did last Tuesday and they'll say, oh, interesting because in this email over here, it says you did this last Tuesday. What does that mean? Right? So they're trying to create problems. That's why depositions go the way they go. It's why you'll see attorneys ask questions 16 million times. That's the same question. They just try to rephrase it slightly. In the whole goal there, it's just attrition. These are long sessions where they're beating you over the head with these questions, just trying to find small holes in kinks that they can pull out. The other thing is that they want to make sure that they're getting to a point with their responses so that when if and when it goes to trial, they already know your answer because they've essentially boxed you into an answer going through the deposition process. So if they say what did you do last Tuesday, you'll say I went to the beach and",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "point with their responses so that when if and when it goes to trial, they already know your answer because they've essentially boxed you into an answer going through the deposition process. So if they say what did you do last Tuesday, you'll say I went to the beach and then they'll say what else did you do? Oh, I had lunch. What did you have for lunch? I had toast. What else did you have for lunch? Turkey sandwich, right? Like they're literally going to get to that detail so that during the actual trial as they're going through their story, trying to frame out how they can, they already know all your answers. And then if you bulk on it while you're going through the trial itself, then you look dumb because then they'll say, oh, interesting because during your sworn testimony, you said this, now you're saying this. Can you explain that? Put some in a bad spot. So I just want to point that out because again, like I'm down for the jokes, love this. It's a hilarious question or like it's a hilarious comment, right? But for those that actually take this seriously thinking like, wow, this is so dumb. How dumb are these lawyers? They're not. They're fucking smart. Unfortunately, super smart. And the people that are involved in these kind of cases, like about as high profile as they can get. So you're going to have the quintessential big law firm attorneys with",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "wow, this is so dumb. How dumb are these lawyers? They're not. They're fucking smart. Unfortunately, super smart. And the people that are involved in these kind of cases, like about as high profile as they can get. So you're going to have the quintessential big law firm attorneys with tons of experience that make millions of dollars doing this stuff. You're not going to have kind of the run of the mail me trying to play lawyer like these are smart people. So it's just important to know that it's again, better to banter. I like that better myself. But it is important to know and actually like analyze the playing field for what it is. These are not stupid people. So anyways, just a couple of things that I saw here at a pre-limm for those that are interested. This is the website and the case number that you could look up. So this one here specifically exhibit 41, which is Doc 130 attachment five. This is actually the deposition. It's like 77 pages. Like I said, I haven't gone through it all. We'll go through it more in depth together during the live session tomorrow. But this is essentially the latest documentation that's been added on the 14th of August. So the whole thing is continuing to move along. It looks like it started back on 23 aug in 22. So yeah, this is the website. The case you can look up to find it if you're",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "is essentially the latest documentation that's been added on the 14th of August. So the whole thing is continuing to move along. It looks like it started back on 23 aug in 22. So yeah, this is the website. The case you can look up to find it if you're so interested. All right, let's turn it over to here. Take a look at GameStop. What do we see in here? Well, we're seeing sideways. And that's essentially the long and short from at actual price perspective volume is still super, super light. Volume today was 3.6 million. Against the 28 average of 7.28 million. We contracted volume over yesterday, which is 5.3. Today's 3.6. So volume is just super low here. We're not seeing a lot of movement. This kind of further bolsters this whole consolidation thesis. Now one thing that's worth pointing out that I think is favorable for GameStop is small caps is starting to grab a little bit of a leg here. So that just adds a general wind at the back of small cap stocks when the broader index itself is progressing in a positive direction. So that part is actually in my opinion pretty good to see. So looking at GameStop options, those specifically, we had a ton, we had a ton, expire today. So if we take a look at the 16-og and we look at the out of the monies, there is 346,359. So pull one out for the homies. I'm going",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "good to see. So looking at GameStop options, those specifically, we had a ton, we had a ton, expire today. So if we take a look at the 16-og and we look at the out of the monies, there is 346,359. So pull one out for the homies. I'm going to pour it in my mouth so it's not on my carpet. But there was a pretty big decline in the overall options chain today. Now one of the things that I like to look for in days like this though is did we start a big bout of volume in the next expiration cycle. So if we take a look at the volume today, we can see all these blue squares popping up. That's 23-og. So this is the next expiration cycle, but you notice these are actually very small sizes. So today, from the call side, there's probably 150, almost probably a little more than that out of the money, 150,000 out of the money calls that expired worthless. And now, as far as replacements in 23-og, the biggest offering, biggest volume today was 5,273. So this is just a pretty big slowdown. So when we take a look at 23-og, you'll see that it's getting built out over yesterday. And my guess is on Monday at the open, this will get built up more from people moving positions out from yesterday into today. And then from today into next week, after expiration here, but there was just",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "look at 23-og, you'll see that it's getting built out over yesterday. And my guess is on Monday at the open, this will get built up more from people moving positions out from yesterday into today. And then from today into next week, after expiration here, but there was just a ton of options that got nothing. So the 23s, there was 12,000 of those essentially with 614 added over yesterday. There was 9900 traded today. Again, my overwhelming guess is that for these larger explorations, when you see like 9900 traded today, 4700 traded today, to me, that's probably people trying to scalp any existing value out of these that they can to save some of it. So that's what I see on the call side. Now, when I look at our implied volatility, super low, I mean, it's just super low. It's not even above 100 anywhere. And I still see this six-sep expiration, super light, 84 IV, as compared to, I mean, and this has earnings as compared to 13-sep, which is 92. And then the primary expiration after that is 89. That's still surprising to me. And I'm expecting that to change. I'm expecting this IV to expand. And the reason why I pointed out is for me that it's a tradable event. It's something that I will trade because my opinion is that this wall is going to expand. And it's because there's earnings there. And it's very rare that you'll find an earnings expiration",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  },
  {
    "text": "to expand. And the reason why I pointed out is for me that it's a tradable event. It's something that I will trade because my opinion is that this wall is going to expand. And it's because there's earnings there. And it's very rare that you'll find an earnings expiration cycle that is like that much, almost 10 points lower from the next expiration cycle. It's just very anomalous. So it's something that I will probably look to trade. So that's what we got for today. As always, if there's any questions, anything you want me to take a look at, let you boy know, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "n2eS41ckh5A",
      "title": "GME Option Expiration and BBBY Case",
      "url": "https://www.youtube.com/watch?v=n2eS41ckh5A",
      "upload_date": "",
      "duration": 701.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=n2eS41ckh5A&t=0"
    }
  }
]