[
  {
    "text": "Today I want to talk about how you can create a zero DTE SPX option strategy that actually makes money. We're going to look at a couple examples up front of two sides of the same coin, very different experiences. And then we're going to go through some data and at the end of the video, I want to walk you through some very specific tips and tricks. So what's up everybody? Welcome back to all the L.I.R. shout out to the Patreon family. Thank you guys for the support you make content like this possible. And if what I do helps you in any way, consider signing up. It helps me out a bunch link in the notes below. Ah, yes. Two sides of the same exact zero DTE coin on the left hand side. We have 18 year old meets zero DTE spy puts. And in a single day, they grew their account, 124.3. That looks pretty good to me. Then we have, well, the other side zero DTE lotto trades gone wrong. Not sure how I'm going to recover from this. And for this person over it looks like I've no idea what the time frame for is for this. It's obviously not within a day. It says all time and they're down 82,200 dollars and a nickel, which is essentially 100 of their account. All right. All right. Two very different experiences. What's going on here? Well, I'm going to give you some quick excerpts from",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "is for this. It's obviously not within a day. It says all time and they're down 82,200 dollars and a nickel, which is essentially 100 of their account. All right. All right. Two very different experiences. What's going on here? Well, I'm going to give you some quick excerpts from a recent video I did that really dives deep into the world of zero DTE options. And if you want to check that video out, I'll throw a link to that in the notes below. It's really good context. This video is going to dive way more into actually analyzing individual strategies. So slight different scope. But what I want to show you three things quickly left hand side, this essentially just means zero DTE volume is increasing exponentially. This here shows you the average P and L profitability of zero DTE's small traders, meaning mostly retail. And essentially there was a period where we were doing well. That starts kind of in December of 21, definitely through 2022. And then since then it's turned negative. There's net and gross. That means gross is obviously the upfront returns. And then net is once we induce friction, commission, slippage zone and so forth. All I'm highlighting here is that slippage is a big deal cost is a big deal. Then down here we have a quick summary of the profitability of zero DTE trades. And essentially it says we document that retail traders consistently lose money, especially after transaction costs, which",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "so forth. All I'm highlighting here is that slippage is a big deal cost is a big deal. Then down here we have a quick summary of the profitability of zero DTE trades. And essentially it says we document that retail traders consistently lose money, especially after transaction costs, which is what I just showed you up here. While they correctly incorporate the overall level of expensiveness of zero DTE options and their decision to buy or sell, they fail to outperform the hefty spreads. What people don't realize is that it's actually very expensive for us to trade these. And it's because you are confused by the zero dollar commissions you think you see up front when really you're paying for all of that on the back end, which again, the zero DTE option video that I have goes through that in detail. So what I want to walk through now though is actually a strategy comparison. So I am affiliated with my friends over at Options Omega because I think that they really give a decent platform for somebody that doesn't want to manage their own data to take a look at options. They didn't sponsor this video outright. I'm literally just doing it because I like to tinker with their tool from once in a while. However, I do have a discount code for it. If you want to sign up, there's a link in the notes below for that as well. But to make this a",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "outright. I'm literally just doing it because I like to tinker with their tool from once in a while. However, I do have a discount code for it. If you want to sign up, there's a link in the notes below for that as well. But to make this a little more easily consumable as compared to showing you a bunch of these individual kind of screenshots, I'm going to show you kind of some synopsis data that I threw into a Google sheet. So what we're looking at is a 100,000 perspective portfolio. We're doing one lots in SPX and we're doing short. There shouldn't be strangle actually. This should be straddle. That's the wrong word. We're doing short straddles. So 50 delta call 50 delta put and this top analysis is looking from one Jan 2021 to 19 aug 2023. However, we have a second analysis that has even better results than this one. And I want to talk to you about why that is. But first, let's take a look at our initial results. So the, well, that just got rid of everything. I didn't look at nothing. Did it? Yes, it did. So the very top line you see here is the entry time. These are all zero DTE and we have profit loss management. This is where we're expecting to manage the trade and then we have different trade metrics over here. Now, the very top line here is simply expiration. This means we're not",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "line you see here is the entry time. These are all zero DTE and we have profit loss management. This is where we're expecting to manage the trade and then we have different trade metrics over here. Now, the very top line here is simply expiration. This means we're not applying any profit or loss management. We're putting on the trade, letting it expire. The PNL of that is negative 46,000 again from 2021 to 2023. The compound annual growth rate negative 21. You kind of get through the rest of the detail on yourself. But a couple of things that we really want to key into obviously PNL, Kagger drawdown, win rate is less important, which you'll kind of find out in a little bit. But we definitely like average PNL. So not doing anything clearly was not successful over this timeframe. Okay. Then I started isolating looking at the profit side or the loss side or a combination thereof. We managed at 25 50 and 75 max profit. These are your results. And you'll notice that the only profitable outcome here was managing profits at 25 again that's leaving losses to their own devices, letting them run wherever they're going to be. This is an important note that will carry over as we move into the next segment of data, which is now looking at the loss side. So in these next couple scenarios, we're leaving the profits to their own, meaning we're not managing those, but we",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "they're going to be. This is an important note that will carry over as we move into the next segment of data, which is now looking at the loss side. So in these next couple scenarios, we're leaving the profits to their own, meaning we're not managing those, but we were managing at 25, 50 and 75 max profit. And you can see here that if we're managing losses at 25 max loss, that that actually was the best overall PNL for this scenario up top here. And we saw a 14 caguar in 18.9 draw down max a 34 or I'm sorry, 37.8 win rate. So overall pretty insignificant win rate. And this means we're taking a lot of small losing trades. So the average PNL, although it's positive, it's not super impressive here, but the average wins are given room to run. The losses are managed pretty carefully. Then I want to show you this next bucket, 25 managed at profit, 25 managed at loss. Essentially, what I did to test this is I just took the best of both scenarios. I said, OK, 25 max profit did the best on the profit side, 25 max loss did the best on loss side. How does this do? And arguably this looks pretty good compared to the rest, although our PNL is slightly less as well as our caguar, our max draw down is much less. This serves as a jump point for other analysis, which I'll get into",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "the best on loss side. How does this do? And arguably this looks pretty good compared to the rest, although our PNL is slightly less as well as our caguar, our max draw down is much less. This serves as a jump point for other analysis, which I'll get into in just a little bit on how we can think about this information. But before that, if any of this shocks you, let me know in the comments below because there's actually a couple of things here that did surprise me genuinely. And one of which is I was surprised that letting the profits run more actually hurt us so bad. Which it's also important to take into account the market conditions that we were seeing in 2021 to 2023, but still nonetheless, volatility is kind of an important input here. And as you could tell, I'm obviously doing this video shirtless. So my zero DTE trades are forcing me to start an only fans page, which that's not going well either. So I have to figure out my next thing. Maybe the Wendy's dumpster with all the other Wall Street bets to generates is on my to do list. However, the main point here is this overall didn't perform as well as I thought it would. I really thought that this would have worked better as a typical strategy here. And the last thing I want to show you in this bucket is this, which is just managing it",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "However, the main point here is this overall didn't perform as well as I thought it would. I really thought that this would have worked better as a typical strategy here. And the last thing I want to show you in this bucket is this, which is just managing it one hour. So I just picked a random timeframe as compared to any sort of percent PNL. And that did not do super well. So there's a bunch of reasons why this is the case. And there's actually some really interesting further analysis that I'm going to overlay on this. If you guys are interested, if the video gets enough likes, then I will happily continue to build this out with more and more data, specifically using the options Omega stuff, because you guys can replicate that. You got me. But some of this aligns neatly with my own data set, but I like also integrating some of these random stuff that I actually don't use on my data set like our management. But there was nothing too noteworthy here. Now what I want to take a look at though is kind of this next bucket instead of going from one Jan 2021 to 19, August 2023. This looks at 13 May 2022 to 19, August 2023. What's the difference here? This is actually when daily explorations and SPX were launched. Well, actually technically it was the 11th of May, but I did the 13th just to give it a",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "one Jan 2021 to 19, August 2023. This looks at 13 May 2022 to 19, August 2023. What's the difference here? This is actually when daily explorations and SPX were launched. Well, actually technically it was the 11th of May, but I did the 13th just to give it a couple days for the liquidity to find itself. And notice how much better the performance of nearly all of these buckets are, even though some of these have lower PNLs, look at the max draw downs in comparison. If I take a look at the same exact top line trade here where we just put on the short straddle and let it go and do nothing in that scenario, we're not only positive, but our max draw down is only 17.6. So the draw downs here are much less part of this is because of the time frame. The market in 2022, the tail half was pretty strong. It stopped going through its overall aggressive adjustment phase, but the other thing is we now have a lot of occurrences. Whereas in this case, before every single day there was an expiration, we were tailored to a smaller data set relative to the time span we were in. So a couple other things I want to highlight here quickly, managing the loss in all of these scenarios is clearly important. The best compound annual growth rates you see in all of these different scenarios comes with loss management. Now in the",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  },
  {
    "text": "to the time span we were in. So a couple other things I want to highlight here quickly, managing the loss in all of these scenarios is clearly important. The best compound annual growth rates you see in all of these different scenarios comes with loss management. Now in the future, I will show you a much better way to manage losses than using a stop. The problem with using stops and stuff like this is the market moves around. And a lot of times you actually get kicked out of a trade that otherwise comes back into profit and that's not good. So we want to talk about things like iron flies next if you're interested in trading these with a smaller account so that we can avoid using stops where we can, but that will be in the next video. So if you have any questions, comments, concerns, throw them in the comments below, let me know what you thought. If this kind of information is helpful for you and if it is, we can talk about some other things to do in the future. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "NCZNV1K2Tcw",
      "title": "0DTE SPX Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=NCZNV1K2Tcw",
      "upload_date": "",
      "duration": 672.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NCZNV1K2Tcw&t=0"
    }
  }
]