[
  {
    "text": "What's up everybody? Eric here. Welcome back to all the outliers. We got David Hunter back for another edition of the outlier podcast and we're actually just talking for like 15 minutes about the markets and the economy. There's no shortage of interesting things going on. But first welcome back to David. Great to have you. Yeah, hi, Eric. Thanks for having me back. Yeah, of course. So I mean, I figure we just pick up literally what we were just talking about kind of the recent market behavior today. You were talking about the sell off that we saw today and kind of how that juxtaposes against the the term lows over the last week or so. Just wondering what are you making of the continuation of the pullback? Do you think that there's a lot of velocity behind this or are we slowing down? Yeah, I'm guessing I mean yesterday looked pretty good and I made a call last Friday that was possible. Look pretty good possibility that we had made the lows Friday morning. And the follow through this week kind of said that was that was right on the weakness today and particularly how it ended the day. And those looks like you might have a very short term head and shoulder top and could go down to 4200. So we'll find that out. I think probably tomorrow, Monday, whether we, whether we sell off or whether we turn around and head back up. But that's",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 50,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=0"
    }
  },
  {
    "text": "the day. And those looks like you might have a very short term head and shoulder top and could go down to 4200. So we'll find that out. I think probably tomorrow, Monday, whether we, whether we sell off or whether we turn around and head back up. But that's all it is really question whether you got to go a little lower in this pullback or whether the pullback lows were seen last Friday. And that I think went this pullback runs its course if it haven't already. I think we're off to the new highs and from there, I think we keep on going. So, you know, I still have that meltbook forecast for this fall. I still think you're looking at six to 7000 on the SEP 20,000 NASDAQ. 48,000 on the Dow. So my upside is not changed. It's really just short term. You know, are we done with the pullback or are we going to see more. And what's interesting in this pullback of up till now has been a 5 pullback in the SEP really turned sentiment around. A lot of people and I it's I kind of suspected that as we saw the rally. Yeah, a lot of people jump on the bullish bandwagon. Once we got up above 4300 and had a 4600. You know, a lot of those people that fought the rally all the way up from last October, start talking more bullish. But my sense was they didn't have",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 50,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.69600000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=98"
    }
  },
  {
    "text": "rally. Yeah, a lot of people jump on the bullish bandwagon. Once we got up above 4300 and had a 4600. You know, a lot of those people that fought the rally all the way up from last October, start talking more bullish. But my sense was they didn't have any conviction behind that bullishness. And that's been born out in this pullback. A lot of them gave up the bullish view as soon as you had the tape turns out. So, I think as we saw all, you know, last fall into right up until now. I think an awful lot of people view that any rally is a bear market rally. And now they feel that bear market rallies run its course. And then we're heading back towards whether we'll go back to the lows of October, whether we'll go part way back there. I think I think there's still a lot of skepticism about this market. And that's healthy. I mean, that's that's a wall of worry that I talk about. You need the fuel comes from people remaining skeptical people fighting this thing. You don't want to see this bullish conviction. So we certainly aren't seeing bullish conviction. The pullbacks kind of that pause that refreshes. And I think it's just a really a question of whether we go back to 4200 or whether we saw the lows last Friday. Yeah, it's interesting. And so thinking about the last time we spoke, you know, about your",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 50,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.39200000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=197"
    }
  },
  {
    "text": "bullish conviction. The pullbacks kind of that pause that refreshes. And I think it's just a really a question of whether we go back to 4200 or whether we saw the lows last Friday. Yeah, it's interesting. And so thinking about the last time we spoke, you know, about your kind of market hypothesis here. Thinking still about that large market run up in the fall. Last time we spoke, I think we talked a bit about just the Fed and the Fed's role specifically in terms of their approach towards interest rates. Right. Like if there was some sort of hint of a contraction in their target rate that that probably would fuel a big run. What's like the primary catalyst that you see for the primary run up that you're talking about here. I was looking at the Fed probabilities for the next FOMC meeting, which is for the 20th of September. And right now it's showing like 80 80 and a half percent probability of no change in the federal target rate, federal fund rate, and then a 19 and a half percent probability of a hike. I'm curious like what are the primary catalyst that you see because it looks like the Fed at least best case scenario right now would be looking at another pause come September. So what other catalyst you looking at. Yeah, that's interesting. So first with the Fed and of course, Paul speaking tomorrow. So we're going to probably get a",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 50,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.088,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=296"
    }
  },
  {
    "text": "see because it looks like the Fed at least best case scenario right now would be looking at another pause come September. So what other catalyst you looking at. Yeah, that's interesting. So first with the Fed and of course, Paul speaking tomorrow. So we're going to probably get a better handle on what Fed's going to do in September. My guess is he's steady as she goes tomorrow. You'll talk kind of a balanced policy say we feel like we're making good progress on inflation. We're not there yet, but we're making progress and we also are worrying about, you know, we have to balance that risk off against that inflation risk off against the risk that we've gone, you know, that we go too far and tip this thing into into recession. So with you know, you're getting some certainly some indications this week that retail is struggling at the consumer starting to pull back. And I think the Fed's very aware of that you get all kinds of conversation out there about the Fed or about the banking system, tightening credit conditions and you're seeing lending slow down. Obviously, we have mortgage rates up to seven and a half percent and that's going to slow housing no matter what. So so they are aware that they have to be, you know, that they have to be careful not to go too far and tip things into recession or or you know get things going on the downside",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 50,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.78400000000005,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=394"
    }
  },
  {
    "text": "a half percent and that's going to slow housing no matter what. So so they are aware that they have to be, you know, that they have to be careful not to go too far and tip things into recession or or you know get things going on the downside too fast. On the other hand, they don't want to declare a mission accomplished because inflation is not yet there. And interesting in the last few weeks, you were getting the sense the street was starting to gravitate towards maybe inflation is going to pick up again, you know, because some of the commodity prices have have moved up and there were some signs that you could. I'm not in that camp. I think we're going to you know, I think inflation is trending down. It doesn't mean every month is going to be a down tick, but I think I think you're going to see inflation can continue to move down and ultimately into deflation in the bus next year, but. One thing that I think the Fed may find they don't realize it yet, but I think it's going to help help their policy or help them kind of pause is that I think oil is rolling over if oil prices are rolling over if gasoline prices are rolling over in both I looked at both and they look like they are. I think you could see WTI crew head back towards the low 60s, which has been",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 50,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=493"
    }
  },
  {
    "text": "of pause is that I think oil is rolling over if oil prices are rolling over if gasoline prices are rolling over in both I looked at both and they look like they are. I think you could see WTI crew head back towards the low 60s, which has been my call all along. And so I think we win and I think gasoline is going to head south. So if we get both of those moving down, you can see in the chart that they're rolling the crews rolling over there. If it has back down into the 60s, that's very much helpful to the whole inflation expectation story. So I'm thinking that's that's likely and will offset, you know, whatever people are worrying about in terms of other commodity prices that might rally a bit here. I'm thinking the Fed is probably either done or we'll do another quarter in September and say, okay, this called a day for a while. Don't mean they can't come back. It's still something I say is that if we get the market rallying up to 6, 7,000, Paul is going to probably come back in and say, hey, we got to take conditions. This is run away, you know, excess of risk taking, et cetera. So, but for the time being, if you get, let's say we get a pause here, they don't hike in September. Things look good for October, November in terms of them being done. That's a huge",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 50,
      "start_timestamp": "00:09:52",
      "start_timestamp_seconds": 592.176,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=592"
    }
  },
  {
    "text": "take conditions. This is run away, you know, excess of risk taking, et cetera. So, but for the time being, if you get, let's say we get a pause here, they don't hike in September. Things look good for October, November in terms of them being done. That's a huge win that the back of the market because that's to me, that is the biggest story out there is if I'm going to say it's permanent, but if the street starts thinking it's permanent that the tightening cycle is over. That's all you need to get a big rally going and on top of that, I'm sorry. Now on top of that, I expect a week dollar. You know, it's been strong this week, but I think it's going to roll over. And I think interest rates are peaking here so they will be rolling over, interest rates being bond rates. So if you get those three things, fed, fed tightening over, or at least the sentiment that it's over, and you get dollar down sharply and rates down, I think those are the kind of things that can propel a big rally. And then, you know, and then FOMO kicks in and you just keep going. What do you make of this? So these were the probabilities I was talking to you about for the September meeting and when you were talking about November, I peaked over there at a curiosity, this surprises me that they're talking about 47.5",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 50,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.8720000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=690"
    }
  },
  {
    "text": "kicks in and you just keep going. What do you make of this? So these were the probabilities I was talking to you about for the September meeting and when you were talking about November, I peaked over there at a curiosity, this surprises me that they're talking about 47.5 probability it looks like of a 25 basis point hike is essentially price. Yes, is priced in November, but they're looking at a pause here in September. So do you think the feds is trying to see how we react here and then, but otherwise they're right now potentially expecting to have like a 50 50 chance of having a hike again in November. Now keep in mind, these are street expectations of fed may have a totally different view of things. I think that if you were to survey and they're not all in the same page, but if you were to survey the bulk of the fed members, I think you would hear. We're going to stay at these levels for a while. It's not so much we're going to hike a lot more, you know, but we're not going to come down. So I think you're beginning here some noises out of some harper. I think today in an interview, it sounded like he was starting to talk about the possibility of a cut sometime next year, you know, in the first half of next year, he didn't define it as such, but it was he was",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 50,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.5680000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=789"
    }
  },
  {
    "text": "here some noises out of some harper. I think today in an interview, it sounded like he was starting to talk about the possibility of a cut sometime next year, you know, in the first half of next year, he didn't define it as such, but it was he was giving you reason why if if you got, you know, if you got inflation down into the two that you could actually have make the case cuts are coming. So, so I, I actually have somebody else. I don't think it was harder, but, but I think in the back of the fed's mind is possibility that, but I think generally the fed believes we're going to, you know, we're going to remain at these levels for another year. We're not it's not that we're hiking, but we're not going to be cutting either. The street on the other hand probably is looking for a cut next year, but maybe a series of cuts because I think they're more, they're more bearish on the economy than maybe the fed is. And so that's there. In terms of November, I think that's probably the street still not willing to think that I think that's a little bit of what I was saying about street thinking that inflation is going to pick up again. That maybe we are at that focal, you know, the kind of that turning point, the inflection point where inflation's gone as low as it's going to go",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 50,
      "start_timestamp": "00:14:48",
      "start_timestamp_seconds": 888.264,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=888"
    }
  },
  {
    "text": "I think that's a little bit of what I was saying about street thinking that inflation is going to pick up again. That maybe we are at that focal, you know, the kind of that turning point, the inflection point where inflation's gone as low as it's going to go for a while and then we get a number of months going the other way. That's not my view, but I think there is a street view out there of that. So, so I think they're kind of guarded about being able to say the pause in September is long lasting. They're worried that they might go back the other way. So it's it's a little bit like where we were in June, you know, they they paused in June, heikden, July, paused in August, pause in September, heikden, November, you know, I think they're not willing to think the fed is totally done. I am, I mean, I don't as I've said before to you, I'm not sure really matters if we're close to done or whether we're done with the hikes. I'm more I'm more driven by bond rates and I think bond rates are done going up. I think we are at an inflection point on interest rates up bond, you know, 10 and 30 rates. I expect I still expect that to an 1,5 10 year probably by the end of this year. One of the things you brought up that I was curious about is",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 50,
      "start_timestamp": "00:16:26",
      "start_timestamp_seconds": 986.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=986"
    }
  },
  {
    "text": "I think we are at an inflection point on interest rates up bond, you know, 10 and 30 rates. I expect I still expect that to an 1,5 10 year probably by the end of this year. One of the things you brought up that I was curious about is just throwing the 30 or treasury index, yeah, yeah, yeah, but one of the things that I keep a pretty close eye on are those kind of the futures probabilities to your point from the street and then also the fed dot plot. I've actually I'm a stats guy so like I like looking at data and just seeing you know where relationships over time is the dot plot something that you follow and find any meaningful efficacy in because I have found two observable trends with the dot plot looking back over essentially last 50 years, but not a lot of like positively correlated predictions coming from them. Some curious thoughts. Yeah, I don't put a lot of stock in the dot plot. I think I think the fed has proven itself through all the years I've watched them through so many cycles. The fed is always late to to tighten and late to ease. So it's a state state to long on both sides. And as a result, we get boom bus. And so I just don't think you know there it's it's economists in a in a committee and obviously the dot plot is kind of the",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 50,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.656,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1085"
    }
  },
  {
    "text": "to tighten and late to ease. So it's a state state to long on both sides. And as a result, we get boom bus. And so I just don't think you know there it's it's economists in a in a committee and obviously the dot plot is kind of the summary of all of them. It's a consensus forecast from from a group of academic economists basically. So it shouldn't surprise anybody that they're they're not going to be predictive. They're going to be followers. So and one of my big criticism was the fed over the last couple of years is that they're mostly non if not all non market people, you know, policy, or lead, you know, he was a private market guy. And then they're going to be a private marketer and then they're going to be a private marketer and then they're going to be a private marketer. And so they don't have that market experience. And I believe that the market is the leader most of the time. Now sometimes market can go off on a run and it turns out to be a false run. But more often than not the stock market, the bond marketer going to lead the Fed. They're going to be leading indicators and the feds, feds of follower. So by definition, the feds going to be kind of late to the to the recognition. And so the thing of late kind of to the to the party for the",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 50,
      "start_timestamp": "00:19:44",
      "start_timestamp_seconds": 1184.352,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1184"
    }
  },
  {
    "text": "bond marketer going to lead the Fed. They're going to be leading indicators and the feds, feds of follower. So by definition, the feds going to be kind of late to the to the recognition. And so the thing of late kind of to the to the party for the Fed, what do you make of the balance sheet and kind of their their unwind it started kind of in what April 23 is when it actually started contracting a bit. But what would you make of that? Do you think that the velocity is the correct pace? Do you think that it'll have the impact that they're intending? I am, I am more or less a monitorist. I mean, I put myself in that category. I think money is all important. More so than interest rates. And so, you know, the fact that they've pulled almost a trillion dollars out of the off the balance sheet, you know, pulled out of the system. I mean, I'd normally be saying that's what we don't see a 20,000 pull out of we've never seen it before that to that tune. So normally I'd be bearish, but then you have to put it in context and realize right. So what you're seeing this was 5 trillion added to that. So what they've done is taken 20 of that that huge number out. And, you know, again, I think what we're seeing as we're seeing the economy stay resilient. As we're seeing, you",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 50,
      "start_timestamp": "00:21:23",
      "start_timestamp_seconds": 1283.048,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1283"
    }
  },
  {
    "text": "it in context and realize right. So what you're seeing this was 5 trillion added to that. So what they've done is taken 20 of that that huge number out. And, you know, again, I think what we're seeing as we're seeing the economy stay resilient. As we're seeing, you know, so I think it surprised most economists and most of the street that the economy's hung in there as long as it has surprised me. I think it really, if you look at it in hindsight, what it's telling you is, and some of this high tide, I actually said some of this prior. There's so much money that got put in unprecedented amounts of both money and fiscal stimulus. So fiscal monetary stimulus got put in in 2020 and 21. That's still sloshing around out there and that's what's allowed them to be as tight as they've been and not having impact the way it would have. So it's why I still think there's time for a meltup. It's why I am not worried about the tightening they've done in the last year. You know, people couldn't understand why I remained, you know, why I kept this meltup in there. And I had one of the most bearish forecast call for a global bus coming. But it's because there is an awful lot of liquidity and investors, particularly institutional investors, were so position bearish. I said before we get to that must or before we get to that",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 50,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.7440000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1381"
    }
  },
  {
    "text": "in there. And I had one of the most bearish forecast call for a global bus coming. But it's because there is an awful lot of liquidity and investors, particularly institutional investors, were so position bearish. I said before we get to that must or before we get to that downside story, there's a big reaction back the other way and that's what we're seeing. I mean, since last October, and it's just not over yet. And I feel comfortable saying there's still plenty of liquidity out there. It's not. And you know, unfortunately, I think a lot of particularly retail investors have kind of come to the conclusion that you can that you need fed stimulus to drive markets. So when the feds tightening, it's like, how can the market go up? And I go, the market's not, you know, there were times where the market through, you know, the last many decades had had no monetary stimulus. And had big bull markets, you know, it's there's money in the system that gets redeployed into stocks at times. And can drive the market. It's not the fed, the fed's not buying the stocks to move the market up. We don't need new money all the time to drive a bull market. And, but we do have a lot of money in the system, thanks to what happened in the pandemic. And I think that's, that's why you're going to get this. What seems incredible, you know, a 2000 or",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 50,
      "start_timestamp": "00:24:40",
      "start_timestamp_seconds": 1480.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1480"
    }
  },
  {
    "text": "don't need new money all the time to drive a bull market. And, but we do have a lot of money in the system, thanks to what happened in the pandemic. And I think that's, that's why you're going to get this. What seems incredible, you know, a 2000 or 2500 point rally in the SP in less than six months. Right. And your catalyst for the turnover after we see that kind of rapid ascension. Does that remain the same or is that evolved? I was saying, you know, my timeframe hasn't changed, but it also can change. In other words, I don't have a precise time because, you know, it may sound disingenuous say this, but the market will tell us when it's going to roll over. I can't tell you that. Now, I can tell you what I think in general terms that I think the meltup is going to be steep and fast. So it's going to happen in, you know, a matter of months, not a matter of years. The bus is going to come. I think in 2024, I don't know whether it starts immediately early in 2024 or stretches, you know, we stretch this thing out for a few more months beyond that. I don't think that's important. The point is that you've got what I think is going to be the biggest financial crisis. If not in history, certainly in post-war war two era coming next year. And we're going to have",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 50,
      "start_timestamp": "00:26:19",
      "start_timestamp_seconds": 1579.1360000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1579"
    }
  },
  {
    "text": "this thing out for a few more months beyond that. I don't think that's important. The point is that you've got what I think is going to be the biggest financial crisis. If not in history, certainly in post-war war two era coming next year. And we're going to have a downturn that's perhaps the biggest in the post-war war two era. So, so the thing the thing the people have to remember is it's not all driven by the Fed either. It's a global bust. And if you look around the world, China's obviously in a place they haven't been in decades, you know, they're they're slowing down fast and they don't have easy answers because they, their last 20 years were driven by massive debt and liquidity. So, you know, they can't just turn that pump on again because they got those same issues out there of huge excesses if we just add those excesses, we create more more excesses. So they're wrestling with how do we fix this and their real estate sector is really getting hurt. And it is vulnerable here. So, China's China is a lot weaker than we are right now. Gerps weaker than we are right now. Canada's got problems Australia's a house of cards. So, so it's not just the US. We can look at the US and say, well, we're, you know, people out there talking about no, you know, soft landing, no landing. Well, you know, I don't think we're",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 50,
      "start_timestamp": "00:27:57",
      "start_timestamp_seconds": 1677.832,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1677"
    }
  },
  {
    "text": "we are right now. Canada's got problems Australia's a house of cards. So, so it's not just the US. We can look at the US and say, well, we're, you know, people out there talking about no, you know, soft landing, no landing. Well, you know, I don't think we're going to be immune to a landing when you look around the world and see how much trouble is everywhere. And again, I'm not saying it's imminent. I think it's next year. But I don't, you know, I don't know exactly when it starts. Do you, how do you view the cycle going like do you think the US starts the decline and then the other countries follow or do you kind of envision a broader external contraction that then the US becomes sympathetic to and collapses with. Yeah, honestly, don't know I have said over for several years, I think I've said that I think there's a decent likelihood that it could start overseas. Certainly the financial crisis will be centered, I think elsewhere. In other words, I think our banks took such a hit in 08, no 9, I and had the race capital and, you know, we, we got religion over here in terms of regulation. Our banks are better capitalized in most of the world today, whereas the opposite was true in 2008. So I think the real vulnerable banks are more centered in Europe, maybe China, I don't, you know, it's closed systems. It's hard",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 50,
      "start_timestamp": "00:29:36",
      "start_timestamp_seconds": 1776.528,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1776"
    }
  },
  {
    "text": "we got religion over here in terms of regulation. Our banks are better capitalized in most of the world today, whereas the opposite was true in 2008. So I think the real vulnerable banks are more centered in Europe, maybe China, I don't, you know, it's closed systems. It's hard to know exactly what will happen there. China, Australia, Canada, those banks are in, you know, have have greater risks than our banks. Now our big banks, we have plenty of risk in our, you know, the regional banks, we saw last March. There's plenty of problems here, I don't mean to say we're in great shape. The office building commercial, commercial real estate situation is one issue and, you know, the rapid rise of rates has kind of created some balance sheet problems for lots of banks. Our big banks, though, however, where we do have better capitalized more conservative really run banks now than, you know, 20 years ago, 15 years ago. They still have big counterparty risks though with overseas banks and, you know, it's, it's not a closed system. So I'm not by any means assuming that we're going to skate through this. You know, we could lose a big bank here there. And certainly, Rachel banks, but I do think the bigger financial crisis events are going to probably be overseas as to who, you know, what triggers it. You never know what catalyst exactly could be a bank. And we saw how quick things",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 50,
      "start_timestamp": "00:31:15",
      "start_timestamp_seconds": 1875.2240000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1875"
    }
  },
  {
    "text": "could lose a big bank here there. And certainly, Rachel banks, but I do think the bigger financial crisis events are going to probably be overseas as to who, you know, what triggers it. You never know what catalyst exactly could be a bank. And we saw how quick things can change in March. You know, you heard on a Friday and by Monday, you knew, you know, Silicon Valley was a big bank. Silicon Valley was in trouble and the Republic was, you know, in trouble. And so it can happen very fast. You make it some, you know, some murmurs of it a few days early and then it hits. But I do think, you know, it could come from a lot of different places. One of the things you mentioned in that was just a little bit about the kind of housing. And I've been generally baffled by what I've seen in like the home builders ETF, XHB, compared to what I see in terms of like demand for housing right now. So like the number of homes sold across the US, according to the red fin is down like 16 year over year. I was thinking maybe they're seeing some sort of broader demand. That's why builders are staying busy. But with rates still as high as it is, I just, I don't understand enough about their production cycle. I was assuming it's a little bit longer runs. So they're expecting once rates fall there to",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 50,
      "start_timestamp": "00:32:53",
      "start_timestamp_seconds": 1973.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=1973"
    }
  },
  {
    "text": "maybe they're seeing some sort of broader demand. That's why builders are staying busy. But with rates still as high as it is, I just, I don't understand enough about their production cycle. I was assuming it's a little bit longer runs. So they're expecting once rates fall there to be maybe a surplus of demand that they're trying to meet. I can't make heads or tails of it. I'm curious if you have an opinion on why home builders seem to be busy against a otherwise pretty damn weak housing market, at least for the residential side. Yeah, for sure. It's, I think it's pretty simple actually. If you're, if you're in a home that you, you know, purchased, you know, in the last five, 10 years or 20 year, whenever. You're sitting in a particular less 10 years, you're sitting on a, you know, three or four percent mortgage rate, if not lower. And you're sitting there and saying, I'm not, I'm not selling my house to buy another house because, you know, right away my mortgage rate doubles or more. And, and, you know, I'm not going to be able to get what I want to get. So, so the supply of houses on the market is being very much constrained by the mortgage rate, right, by the big rise rates, you know, the same thing that happened to the banks where you had a 500 base point rise in rates, happened the mortgage rates. And so",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 50,
      "start_timestamp": "00:34:32",
      "start_timestamp_seconds": 2072.616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2072"
    }
  },
  {
    "text": "So, so the supply of houses on the market is being very much constrained by the mortgage rate, right, by the big rise rates, you know, the same thing that happened to the banks where you had a 500 base point rise in rates, happened the mortgage rates. And so it's shut off the secondary market for, you know, there are obviously there are some homes and they are turning over. But as you've heard, I'm sure we hear. You know, there's multiple buyers for these homes, you go, you go to buy a house and there's, you know, three or four bidders and they bid over asking price and, you know, people are, you know, clamoring again, house and every time they lose out, because there were three other people out, bit them. So, so secondary homes, you know, I just say there's 17 drop in homes, you know, secondary homes. Yeah, yeah. However, the home builders are subsidizing the mortgage rates. So they're often incentives. They're saying you can, if you, if you buy a home, we'll give you a 5 mortgage or we'll give you a 4 and 3 quarter percent mortgage. And there it's coming out of their profit margin, obviously, because they have to, you know, they have to fund it. You know, by, you know, getting money either through the banks or through floating them on, whatever. So they're, they're basically rather than doing market rates, they're doing, you know, a much below market",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 50,
      "start_timestamp": "00:36:11",
      "start_timestamp_seconds": 2171.312,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2171"
    }
  },
  {
    "text": "of their profit margin, obviously, because they have to, you know, they have to fund it. You know, by, you know, getting money either through the banks or through floating them on, whatever. So they're, they're basically rather than doing market rates, they're doing, you know, a much below market rate. So all these people that are lined up to buy homes are saying, I'm not in, you know, I'm not going to go into the secondary market for a home because, you know, I can't find what I want. It's overpriced. It's, you know, every time I go to bid on one, there's three other people bidding on that same house. So they're, they're able to go to these home builders. And I don't know how, how common this is, but I think in the big national home builders is pretty common and, and get financing deals that are attractive. And, and say, and, and keep in mind, there's a lot of people that are fearful. This happens every mountain cycle that this never going to end that you're never going to see how the crisis below this again. So you better buy now because they're only going to go up. So all those people that are, let's say first time home buyers that are scared to death that they're not going to be able to buy a house before the house if they don't do it now are jumping at the chance to get a 5 mortgage rate",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 50,
      "start_timestamp": "00:37:50",
      "start_timestamp_seconds": 2270.0080000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2270"
    }
  },
  {
    "text": "go up. So all those people that are, let's say first time home buyers that are scared to death that they're not going to be able to buy a house before the house if they don't do it now are jumping at the chance to get a 5 mortgage rate on a brand new house. And they're not so worried that maybe they're paying top dollar for that house, you know, the house that might have sold for 150,000 dollars less three years ago, they're just glad to get in and be able to afford the mortgage payment even even if it's high. Interesting. So it really is favoring the new home, but a new home seller, you know, the home builders. And, and what you're going to find, I think in the bust is that the secondary markets all of a sudden, going to open up because you're going to force selling by some people, you know, whether before closure or people have waited so long and I said, you know, I lost my job. I can't, can't hold on to this house or, or, you know, any number. You know, any number of reasons, you're going to see that supply expand. You're also going to see, you know, all those people that, you know, went into the B and B business, if they are being be business, you know, if you're not seeing the kind of rental market, you did see before, it may not be worth hold",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 50,
      "start_timestamp": "00:39:28",
      "start_timestamp_seconds": 2368.704,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2368"
    }
  },
  {
    "text": "that supply expand. You're also going to see, you know, all those people that, you know, went into the B and B business, if they are being be business, you know, if you're not seeing the kind of rental market, you did see before, it may not be worth hold onto those things. So you can see that supply come back out or some of it. So I think I have no doubt we're going to have a down cycle. All those people think that's going away. And I've been to us too long and seeing too many cycles. It always happens. It just doesn't happen right away. And, you know, it happens typically when everybody gives up on it happening. I think that's where we're at now. So, so I'm pretty sure in the bust, you're going to see a down market. I'm predicting potentially 30 drop in home prices and during the bust. So, you know, what do I know? It doesn't mean it's going to be 30. But I think the potential is there for that kind of, you know, there's a lot of air and home prices right now because, right. How's our less affordable than ever in history, I think right now, you know, affordability index shows them, you know, totally out of reach with so many people. I just don't think that's sustainable. I've been speaking of affordability. Another thing I wanted to get your take on was just consumer spending right now. I've",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 50,
      "start_timestamp": "00:41:07",
      "start_timestamp_seconds": 2467.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2467"
    }
  },
  {
    "text": "ever in history, I think right now, you know, affordability index shows them, you know, totally out of reach with so many people. I just don't think that's sustainable. I've been speaking of affordability. Another thing I wanted to get your take on was just consumer spending right now. I've been tracking that pretty rarely along with, you know, CPI, PPI stuff like that. But the consumer spending has seemed more resilient than I would have expected. I don't know if that's tied to the job market because job market metrics came out today for jobless claims and they actually came in at like 230 compared to 240 expected. So I don't know maybe that's what we're seeing. But like, what do you make of just the consumer spending habits right now and how does that play out throughout your cycle prediction? Yeah, I think what we're seeing is I haven't have not, not economy. So, you know, again, it goes back to that, that whole thing of we had on awful lot of fiscal stimulus during 2021, 2021, you know, checks handed out to everybody, et cetera. I think that savings is being drawn down and is getting to the point where a lot of that excess stimulus is gone from the consumer savings standpoint. And you're seeing that in some of the signs are you seeing, you know, credit card balances moving up, you're seeing the link, when he's moving up. So I think there's a half not",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 50,
      "start_timestamp": "00:42:46",
      "start_timestamp_seconds": 2566.096,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2566"
    }
  },
  {
    "text": "the point where a lot of that excess stimulus is gone from the consumer savings standpoint. And you're seeing that in some of the signs are you seeing, you know, credit card balances moving up, you're seeing the link, when he's moving up. So I think there's a half not part of the economy that those people are even having to use the same kind of money. Even having to use a credit card for necessities. And, and yet you still have all this wealth effect out there. I saw some statistic where it's something like 40 or 50 of homeowners have no mortgage because, you know, there may be boomers or whatever held on their houses. And so, so you've got a lot of people with a lot of equity. It's it's weird for me to be talking about, you know, biggest financial crisis in history, huge downturn next year. When you've got that kind of stuff, but I think it can happen, it can, it can reverse in a hurry. So you've got you've got to have part of the economy, or have part of the consumer, not just the wealthy, but, you know, people have plenty of equity in their homes that may have a good pension or 401k with plenty of assets in there. And those people don't mind spending, you know, they're saying, hey, I got plenty of buffer. I can, I can spend a little bit more than my income or what have you.",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 50,
      "start_timestamp": "00:44:24",
      "start_timestamp_seconds": 2664.7920000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2664"
    }
  },
  {
    "text": "equity in their homes that may have a good pension or 401k with plenty of assets in there. And those people don't mind spending, you know, they're saying, hey, I got plenty of buffer. I can, I can spend a little bit more than my income or what have you. So I think that half of the economy is fine and it's just not willing to quit. The other half is trying to get by and they're saying, at the end of the, at the end of the month, I don't have enough money to afford groceries. I barely, you know, I'm not able to pay my utilities every month, you know, I'm paying them in in piecemeal or whatever. There's there's a, you know, I think there's a chunk of the economy or chunk of the consumer that is strapped completely. And then you've got somewhere in that middle, people are just crazy enough to say, I'm going to have a thousand dollar car payment, but I want that car today, you know, and I want to let you drive. You know, it's it's shop till you drop for some people and they don't necessarily have the financial common sense to know that they're not going to be holding onto that car very long. You know, something that happened next year, it's probably going to tell them they can't, they can't make their payment. So, so I, I think we're kind of a mixed economy. And, you know, as",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 50,
      "start_timestamp": "00:46:03",
      "start_timestamp_seconds": 2763.4880000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2763"
    }
  },
  {
    "text": "sense to know that they're not going to be holding onto that car very long. You know, something that happened next year, it's probably going to tell them they can't, they can't make their payment. So, so I, I think we're kind of a mixed economy. And, you know, as I tried to explain when I, when I talk about a melt up and then I talk about a bust, what people don't miss in there is that it gravitates. The melt up is about the market. So it's really melt up in bear are the two equivalents. The bus is, you know, an economy that's in, you know, an economy that's moving up in a bus, which is, you know, a bad economy are the comparison. So it's not really melt up into a bust melt up into a bear. But if you understand what I'm saying, the bus refers to economy not the market, but people kind of use the bus to talk about the market. So, but so people don't realize that there's something in between before we get to the bust, we're going to be in negative economic territory. We're going to be in recession before the bust. The bust is when the recession gets worse and the financial crisis kicks in and all of a sudden you got banks failing and you got, you know, a lot of involuntary debt liquidation. So there is a period and it could start before the end of the",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 50,
      "start_timestamp": "00:47:42",
      "start_timestamp_seconds": 2862.1839999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2862"
    }
  },
  {
    "text": "the bust. The bust is when the recession gets worse and the financial crisis kicks in and all of a sudden you got banks failing and you got, you know, a lot of involuntary debt liquidation. So there is a period and it could start before the end of the year that we're in negative GDP territory. It'll late this year or early next, but we're not immediately going into, you know, deep dive. Got it. And one of the follow ups I have there, just considering the broader perspective, when we get to this bust phase, what, like what is the duration of that look like to you? Like what is the quality of it? Obviously not looking for, you know, any sort of like rough or hard timeline assessments, but I'm curious, like how that actually plays out like a broad cycle perspective. Yeah, I'm still thinking we're going to have the bust dominate 2024. So whether it starts in January, February, March, April, I'm not sure, but I think the bulk of 2024 is going to be a negative economy and a negative financial environment. Very negative. I think it's fast. So I've said before I view the bust, my description of the bust is something that's can feel like a depression. But at the speed of a recession. So recessions usually 12 to 18 months. And that's kind of what I think this will be. But I think the financial crisis kicking in where you've got",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 50,
      "start_timestamp": "00:49:20",
      "start_timestamp_seconds": 2960.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=2960"
    }
  },
  {
    "text": "the bust, my description of the bust is something that's can feel like a depression. But at the speed of a recession. So recessions usually 12 to 18 months. And that's kind of what I think this will be. But I think the financial crisis kicking in where you've got major banks dominoing across the world in failure is what the bust is about. It's the, it's when, when you start wondering, I mean, you know, go back to 2008, 9. There were periods in there where you just didn't know where we are. How long is this going to be where are we were, we're seeing our biggest and best banks and other financial institutions, you know, at risk of going belly up. And obviously, layman went belly up and AIG could have gone belly up and even GE came close. So so that's, you know, as I say, 2008, 9. And then, you know, the next step is, came very close to a bust. What I think 2024 is, is that next step where, where in the fall of 20, in the fall of 2008, the Fed acted fast, the government acted fast and they, they stepped in and unfroze the commercial paper market, which was a day away from shutting GE. They hadn't acted fast. We probably would have seen a bust in 2008, 9. This time around, I think, because the excesses are that much greater leverages that much greater. And there's some reluctance to do",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 50,
      "start_timestamp": "00:50:59",
      "start_timestamp_seconds": 3059.576,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3059"
    }
  },
  {
    "text": "and unfroze the commercial paper market, which was a day away from shutting GE. They hadn't acted fast. We probably would have seen a bust in 2008, 9. This time around, I think, because the excesses are that much greater leverages that much greater. And there's some reluctance to do the same thing again, you know, as you know, right. And you know, that's when Powell's mantra, we're not going to do that again. We're not going to do QE again. We're not going to. So they're going to point, they're going to be slow to do the things they're going to have to do to save the system. And it's in that time that they hesitate. The things can can break if they had the mindset. In 2008 that they have today, we would have seen a bust in 2008. And yet, look at the difference in the leverage today. I mean, we are at, you know, we're at 300 trillion debt across the globe. We're at a 9 trillion Fed balance sheet when, when in the fall of 2008, we were at 875 billion. And the leverage is just massive, massively different. And leverage is what can move things much faster on both the upside when it's good on the downside when things are bad. And that's, that's what I think people don't yet crash. Is how you can see things just go wild. How did that happen so fast? You know, well. One of the things we",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 50,
      "start_timestamp": "00:52:38",
      "start_timestamp_seconds": 3158.2720000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3158"
    }
  },
  {
    "text": "things much faster on both the upside when it's good on the downside when things are bad. And that's, that's what I think people don't yet crash. Is how you can see things just go wild. How did that happen so fast? You know, well. One of the things we talked about last time as well was metals, the way that you saw them moving. And I know that we're coming up on time here. So I don't want your, your metal spans coming to beat me up every time I forget to talk about metals. They let me know. So I refuse to forget. Yeah. I think, I think we're such a great inflection point. Yeah, if you go back to 2001, you know, gold was at, where was gold, gold was at 800. Yeah. And here we ran, we ran up, you can see it ran up to 1900. We have spent all of the time since 2011 when it was at 1900. We have spent in this kind of consolidation sideways to up consolidation. You know, went through a big sell off and in 2016, early 2016 began from I think 1060, if I remember right. And, and began that run up. We are, you know, it's funny because people are really kind of very down on gold and go, it's never going anywhere gold. And then you look at this chart and you go, my God, we're not that far off all time highs, right? I",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 50,
      "start_timestamp": "00:54:16",
      "start_timestamp_seconds": 3256.9680000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3256"
    }
  },
  {
    "text": "and began that run up. We are, you know, it's funny because people are really kind of very down on gold and go, it's never going anywhere gold. And then you look at this chart and you go, my God, we're not that far off all time highs, right? I mean, we're in 1950, wherever we are. And we're, we're 19, 20, 30, we're not far off all time highs. We get above 2100. It's clear sailing never had a resist, never, no resistance above that. And that's why I think once you break out, we're going to be a 3000 in a hurry. So my belief is the next six to eight months, we'll see 3000 on gold. And the next month or so month or two, we should be a new highs and then a big run from there. So, so my pre bus call is 3000 on gold that's been my target for a long time and it remains my target. And I see nothing here that's disturbing. I hear all kinds of people talking lower, you know, I could be wrong and maybe we're going down, but everything points to, I think, in fact, I think we, we are turning as we speak, you know, I think we turned this week. And, you know, we get down basically to 1900 again. And I think we are going to start that run to make new highs within the month within, you know, within the next month. And",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 50,
      "start_timestamp": "00:55:55",
      "start_timestamp_seconds": 3355.664,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3355"
    }
  },
  {
    "text": "we, we are turning as we speak, you know, I think we turned this week. And, you know, we get down basically to 1900 again. And I think we are going to start that run to make new highs within the month within, you know, within the next month. And once we break out, you know, you probably do a little retest back at that high. And then you just start running. As I've said, I think, gold probably peaks after the, you know, the peak, the peak in the SP or the peak in the equity market will probably occur prior to the peak in the metals, you know, metals can go for me. They're starting later, they can go for a longer. But I think I think both are pre busts. So the peak in the metal probably is sometime first or second quarter next year. And like I said, we can be in recession while the metals are still running. The bust may not hit until middle of next year. So the bust, the bust is a 2024 story. And we'll be on our way to the bust in negative economic territory, maybe right from the get go in 2024. But that doesn't mean the bust hits right away. So you have time for this thing. And maybe it'll happen faster. Maybe we'll be at 3000 gold before the end of the year. I don't know that, but I think common sense says, you know, it's likely",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 50,
      "start_timestamp": "00:57:34",
      "start_timestamp_seconds": 3454.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3454"
    }
  },
  {
    "text": "go in 2024. But that doesn't mean the bust hits right away. So you have time for this thing. And maybe it'll happen faster. Maybe we'll be at 3000 gold before the end of the year. I don't know that, but I think common sense says, you know, it's likely to take longer than that. So, you know, first quarter, second quarter next year. Silver. Same, same story really quick. Can I ask you a quick question on gold before we pivot to silver? What do you make of like these kind of three attempts at that high level and gold? Does that mean anything? I don't follow gold anywhere near as closely to you. So I'm actually like generally curious how you view that kind of it seems resistance, but I'm not sure what to call it. Yeah, I mean, it's a triple top. You could argue it's a triple top. It's also a triple effort. You know, obviously, first time up was a new high. I went to 2100 above that 19 10 15 20 area back in 2011. So made new high there. And it's made three attempts. There are two more attempts to break through that area and failed at that level each time. I think most technicians would probably tell you that, you know, third times a charm. You tried to break out above that 2100 once. Yeah, you made the high and whenever that was you went to break above it again the second",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 50,
      "start_timestamp": "00:59:13",
      "start_timestamp_seconds": 3553.056,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3553"
    }
  },
  {
    "text": "area and failed at that level each time. I think most technicians would probably tell you that, you know, third times a charm. You tried to break out above that 2100 once. Yeah, you made the high and whenever that was you went to break above it again the second time. And then or over the next time and then again, a second time. So I think the next time third is the charm that what you do is each time you weaken that resistance a bit. And I think you're going to push through it next time and then just keep going. So I view that as bullish. It's interesting to because just from like a typical technical perspective from like trading, I kind of view exactly what you're seeing as well, because I also see this was like a pretty big extension it touched it ran away. This one it touched it hung out. And then now there's actually a lot of congestion building in this level, which tends to me would lead me to believe that people are starting to get more comfortable with that price. But I appreciate it. Like said, I know you tried gold pretty closely. So I was curious how to take a look at that. And by the way, the sentiment with this sell off from 2100 down in 19 or so couple of 100 sell off in the last, you know, number of months has really created people are have given",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 50,
      "start_timestamp": "01:00:51",
      "start_timestamp_seconds": 3651.752,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3651"
    }
  },
  {
    "text": "pretty closely. So I was curious how to take a look at that. And by the way, the sentiment with this sell off from 2100 down in 19 or so couple of 100 sell off in the last, you know, number of months has really created people are have given up on gold. There's so many people that I run across that say gold will never do anything for you. So it's amazing to me when you look at that chart and you realize you're not far from all time highs and that, you know, the pattern you see there is not something that you would think would would have discouraged people so much. That's what I see is very discourage investors that just have no hope they just think gold is a dead investment. I've waited too long for it. And I mean, silver is worse, but, but you know, in both sentiment is at the levels that normally precedes a big run. Silver is very high. Super flat here. Yeah, silver is it's it's that many will get out of its way you look at that great run similar to gold from the early 2000s up to 2011. And you know, it's been from then this long period of consolidation and you sit there and you kind of have to, you know, you just scratch your head and go, how come. But I'm a I'm a huge believer that what you've got is a huge consolidation, a huge",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 50,
      "start_timestamp": "01:02:30",
      "start_timestamp_seconds": 3750.4480000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3750"
    }
  },
  {
    "text": "And you know, it's been from then this long period of consolidation and you sit there and you kind of have to, you know, you just scratch your head and go, how come. But I'm a I'm a huge believer that what you've got is a huge consolidation, a huge base from which to build. And I think you've got my target is still 60 per bus. So same time horizon as gold. And I it's, you know, you got to you got to get through more resistance and silver. Obviously, there's, you know, you're a lot farther away from the old high. Up around a coast 50, 48. This looks like yeah, like 40 it almost looks like a hit 50 on the nose. Yeah, so you've got to still work through all that there, but I, I think that long consolidation, one of those people are out already. You know, they took lawsuits and left. And if you know, I mean, they've been smaller bounces, but the moves during the consolidation, when it goes, it goes in kind of vertical fashion. The most recent one was back in 2020 after, you know, it sold off in the early 2020 and that March 2020 sell off, but it had a huge run from there into August. And that's what I see here is again, I think this thing can really go vertical within, you know, within the next six months. So I think it started. I think, you know,",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 50,
      "start_timestamp": "01:04:09",
      "start_timestamp_seconds": 3849.1440000000002,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3849"
    }
  },
  {
    "text": "2020 and that March 2020 sell off, but it had a huge run from there into August. And that's what I see here is again, I think this thing can really go vertical within, you know, within the next six months. So I think it started. I think, you know, I think you've, you basically in the very way over on the right side, you can see kind of a double bottom there. A little bit of a W, we just hit our low this week. And I think from there we, we move up, you know, you got to get up above 31st. Then I think, you know, above 35, you're running to probably back to the old highs. And then I think you break out. So it's a big, it's a big call. It's a, you know, it's an aggressive move from here. But that's what I see. I just think silver, a sentiment is rock bottom. Right. Yeah. And again, what drives it? Yeah, what drives it is more than anything else is a dollar. You're going to have rates coming down. That'll be bullish for both cold and silver. And you can have the dollar. And then I throw in that third thing, which is you all the sudden, I think what's hurt the metals a lot is they, they really hurt more than anything else by the Fed. In tightening mode, when you all of a sudden, when the street all of a sudden decides",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 50,
      "start_timestamp": "01:05:47",
      "start_timestamp_seconds": 3947.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=3947"
    }
  },
  {
    "text": "then I throw in that third thing, which is you all the sudden, I think what's hurt the metals a lot is they, they really hurt more than anything else by the Fed. In tightening mode, when you all of a sudden, when the street all of a sudden decides tightening is done, whether the Fed thinks it's done or not. If the street decides it's done, you're going to see several months where you're going to see the markets all markets all all these things run. That's, I think I just don't think people realize how much of an impact that tightening has had. Taking that away becomes a huge window. You're back. It'll be interesting to to kind of see things that I think retail traders tend to view as not inversely correlated, but in general, you know, people tend to expect the market to go up and then, you know, metals to go down and vice versa as people are by tech, what do you want not. So it'll actually be really fascinating to see all of them moving in the same direction, essentially, you know, if if your prediction plays out as you see it does. Yeah, it's interesting. I said this week we're at inflection points on so many things. So I think interest rates are an inflection point. And I'm calling for big down. Yeah, obviously 250 on the 10 year, maybe by the end of the year, that's a big move. And nobody",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 50,
      "start_timestamp": "01:07:26",
      "start_timestamp_seconds": 4046.536,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4046"
    }
  },
  {
    "text": "Yeah, it's interesting. I said this week we're at inflection points on so many things. So I think interest rates are an inflection point. And I'm calling for big down. Yeah, obviously 250 on the 10 year, maybe by the end of the year, that's a big move. And nobody else is looking for anything like that. In fact, most are looking up, not down. You know, 30 year, I think, can get to time frame. And again, those are those are just during the meltup phase. During the bust phase, I'm calling for 10 year to go to zero or negative. So, so in other words, from here, you can see higher rates, you can see much lower rates over the course of the next year. So that's a big inflection point rates. If I'm right, big inflection point in the dollar. If I'm right, even though it's. I think the dollar is very close to a roll over and you know, dollars at 104, essentially, I think are close to it. And I think it can get down to 80. That's a big 24 point drop before the bus to or, you know, early in the bus, maybe they'll keep going. And then you got equities and you got metals, you know, at major turning points here, you know, whether it's right here or in the next week or two. It just seems like everything's coming together. And the thing that I think kind of brings it all",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 50,
      "start_timestamp": "01:09:05",
      "start_timestamp_seconds": 4145.232,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4145"
    }
  },
  {
    "text": "they'll keep going. And then you got equities and you got metals, you know, at major turning points here, you know, whether it's right here or in the next week or two. It just seems like everything's coming together. And the thing that I think kind of brings it all to that point is the Fed. And yet people, you know, people ask me all the time. If the Fed heights in September, does that change your view? I go, no, I'm not worried about whether they're absolutely done. I think the narrative that will be coming in this fall will be that the Fed tightening cycle is ending. Not necessarily ended, but ending. And that enough would be kind of the fuel that you see. Yeah, again, if you think the Fed cycle, you know, the tightening cycle, which started, you know, year and a half ago or a year and a few months ago. If you think it's over, usually Fed cycles, Fed tightening cycles, once they end, they're over for several years, right. So that means you got wind that you're back for several years. Now, my view is that they'll probably come back in maybe as soon as a few months later and say, oh my god, the market's up at 6000. We got this tight. So I'm not saying it's over. But if the street believes it's over for a few months, who might argue that or who is anybody to argue that if the",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 50,
      "start_timestamp": "01:10:43",
      "start_timestamp_seconds": 4243.928,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4243"
    }
  },
  {
    "text": "soon as a few months later and say, oh my god, the market's up at 6000. We got this tight. So I'm not saying it's over. But if the street believes it's over for a few months, who might argue that or who is anybody to argue that if the Fed even thinks it's over. You know, then that's what will be the narrative for that period. It will change back to a different narrative that has to come back in. And then it's time to get barren. Well, as always, I know we're up at time here, but it is, it's fascinating. It's fascinating to look at the markets and the economy through your lens. So thank you for taking the time, right, to share your experience with us. What you're looking at the relationships that you see. And I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 50,
      "start_timestamp": "01:12:22",
      "start_timestamp_seconds": 4342.624,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4342"
    }
  },
  {
    "text": "I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to say, I'm going to implement at home for Wave to be able to do this content. I'm going to say, I'm going to say, I'm going to get something going on in the charging zone. So I want to remind you, I'm going to build up here in But I'm going to bring, say, a switch, and then in here, you can deploy this crush, re inserts this I don't have to worry that too much here And I'm, you know, as I say, it's a high conviction call for me. But I see what's, what I think I see, you know, this next several months can be a period for the history books. Well, I'll tell you what, for the options traders out there, that just delights me because as soon as you start the volatility, that's that's bread and butter right there. Yeah, let me caution because I, you know, as I say on Twitter, I'm a strategist and I forecast that I don't provide",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 50,
      "start_timestamp": "01:14:01",
      "start_timestamp_seconds": 4441.320000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4441"
    }
  },
  {
    "text": "you what, for the options traders out there, that just delights me because as soon as you start the volatility, that's that's bread and butter right there. Yeah, let me caution because I, you know, as I say on Twitter, I'm a strategist and I forecast that I don't provide advice. I don't recommend. The people that have the hardest time with me are the short term traders where I am my history is I'm, you know, I'm earlier, I'm, you know, things get stretched out. So the people that probably hate me the most are option traders because I can talk like it's coming imminently. And then it takes longer and I just chuck that up to the market for in charge on me. So I just question if you have a lot of options, guys, following this, give yourself plenty of time with no options because, you know, three months may not be how fast it happens. No, no, it takes longer. And one of the things that I always talk to specifically options traders about are just any trader is, you know, the idea, at least in my opinion, it isn't as a retail trader. It's not, it's not to pinpoint any sort of pivot. It's to ride the broader wave and take 68 points out of it, right? Like there's tons of money to be made in there, which is directly to your point. I find the people that get frustrated at you are honestly just",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 50,
      "start_timestamp": "01:15:40",
      "start_timestamp_seconds": 4540.0160000000005,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4540"
    }
  },
  {
    "text": "it's not to pinpoint any sort of pivot. It's to ride the broader wave and take 68 points out of it, right? Like there's tons of money to be made in there, which is directly to your point. I find the people that get frustrated at you are honestly just lazy and they want somebody to hand them. Paradeable information that's completely accurate and they don't have to think, which unfortunately or fortunately, depending on how you look at it, is not how the markets work. Yeah, and if it, and if not lazy, at least, um, naive and probably in a, in a market they shouldn't be in, meaning y'all to play an option. I mean, they're looking at as easy money and you know more than I do the option, they're not easy money better, you better know your stuff because it, it takes the money from the best of us in that business. I mean, you know, it's, it's too easy to be a gambler in the stock market because you see, you see the potential. What you're, what you're missing is the risk. The risk is bigger than the potential and you better understand the risk before you go in. Yeah, what, what I tell people is if you trade options compared to equities and equities, you got to get one thing correct direction and options, you got to get three things correct direction timeframe volatility. So you've just added a ton of complexity to that",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 50,
      "start_timestamp": "01:17:18",
      "start_timestamp_seconds": 4638.7119999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4638"
    }
  },
  {
    "text": "before you go in. Yeah, what, what I tell people is if you trade options compared to equities and equities, you got to get one thing correct direction and options, you got to get three things correct direction timeframe volatility. So you've just added a ton of complexity to that same assumption. Yeah, I would say 90 of people play an option shouldn't be there. That's, you know, based on what I see in, in the tweets and stuff. I see I just think so many people are over their heads, you know, and then, and then they can't look in the mirror and blame themselves. They got to look for some, some scapegoat. You know, it's got to be somebody else. It's causing them to lose their money. Of course, that's the best thing is never your fault. Right? Right. So also David. Yeah, thanks for having me. I will just mention I do have the investment letter that I put out quarterly. People can if they have interest in it, they can direct message me on Twitter and I'll provide them details. I don't, you know, I'll talk about that Twitter. So just these are the only places I really have a chance to at least let people know I do have a. Yeah, I'm sure. Awesome. Yeah. So then, you know, if anybody listening, if you want to check it out, make sure you look in the video description below. I'll have a link to his. Twitter,",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 50,
      "start_timestamp": "01:18:57",
      "start_timestamp_seconds": 4737.408,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4737"
    }
  },
  {
    "text": "I really have a chance to at least let people know I do have a. Yeah, I'm sure. Awesome. Yeah. So then, you know, if anybody listening, if you want to check it out, make sure you look in the video description below. I'll have a link to his. Twitter, his DMs are open. So you can, you know, connect with them there. And then, yeah, until next time, David, absolute pleasure. Thanks for hanging out for a bit. Yeah, thanks Eric. It was fun. Thank you.",
    "metadata": {
      "video_id": "Nfuui1cwi1w",
      "title": "Market Inflection Point with David Hunter | The Outlier Pod Ep48",
      "url": "https://www.youtube.com/watch?v=Nfuui1cwi1w",
      "upload_date": "",
      "duration": 3514.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 50,
      "start_timestamp": "01:20:36",
      "start_timestamp_seconds": 4836.104,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Nfuui1cwi1w&t=4836"
    }
  }
]