[
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 14,
    "text": "What's up, allies? Time for a market update. Today we'll go over the market as a whole pretty quick. Then we'll take a look at Broadcom, a couple other stocks. And at the end, I want to answer a question that somebody hit me up on Twitter or X or whatever the platform is known as. We'll go with X because I want to support Daddy Elon. And it was about some deep in the money puts in GameStop. And I think the conversation in GameStop is useful for non-GameStop traders to talk about those put. So we'll get to those towards the end. Now, from a broad market perspective, definitely tech led the dance today. She was hit a high of 539. Spy still trending sideways. And I do believe internal to spy. We're seeing a not insignificant amount of rotation. So what I mean by that is we can see energy is really opening up to the downside. I was actually shorting this specifically from the break up perspective from the downside. This has been unrelenting. Financials are still starting on this downside trend. We can see the different term moving averages. 1020 are actually starting to roll over, which is not good. Industrials rolling over, which is not great. So we can see across the board, other than discretionary, which continues to just do literally whatever it wants. We can see health care down utilities down real estate down. That means if we have a decent amount",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=0"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 14,
    "text": "over, which is not good. Industrials rolling over, which is not great. So we can see across the board, other than discretionary, which continues to just do literally whatever it wants. We can see health care down utilities down real estate down. That means if we have a decent amount of sectors within the SP 500 rolling over, even though the SP 500 can be holding on. And the reason for that is because it's propped up by a smaller number of names in comm services, which is doing well along with a couple of other pickers that happen to be doing well at the point. But if we look across the overall breadth, it's not good. We lost another five percent. Oh, you guys can see this top line up here. There's a little ticker bar that you can add now. There's a couple things that I use up there like advanced decline, advanced decline spread for the New York Stock Exchange for the SP 500. And then one of the things I track up there is the percentage of stocks within the SP 500 that are above a 50 day moving average. And right now, that's down like another five points to 43. So that's continuing to roll over. These are all early warning signals. This is why when people get caught to the downside. And again, I'm not forecasting or expecting some sort of big downside move. My job is to understand what's happening right now is",
    "start_timestamp_seconds": 67.82,
    "start_timestamp": "00:01:07",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=67"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 14,
    "text": "another five points to 43. So that's continuing to roll over. These are all early warning signals. This is why when people get caught to the downside. And again, I'm not forecasting or expecting some sort of big downside move. My job is to understand what's happening right now is best as I possibly can. And this is the comical part when people get caught to the downside. And I was like, well, that came out of nowhere. How did it happen? This is how it starts. Now that doesn't mean that we're going down. Could level off and then start accumulating to the upside. Again, you have to trade what's happening right now, but right now there are warning signs that underlying conditions are changing and you should be aware of that. That doesn't mean you have to take everything off and not put on a trade and wait for the down tick because it might never come off and it doesn't. But it also can. So that's why we have to pay attention to this stuff. And then the equal weighted SP 500 was down a little bit today. So that was down a little over a quarter point. So again, that's showing you the divergence between the SP 500 being propped up by a smaller number of names against the SP 500 equal weighted, which is looking at it as a whole. Very interesting overall market movements today. Now from a general news perspective, there was a",
    "start_timestamp_seconds": 132.14,
    "start_timestamp": "00:02:12",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=132"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 14,
    "text": "point. So again, that's showing you the divergence between the SP 500 being propped up by a smaller number of names against the SP 500 equal weighted, which is looking at it as a whole. Very interesting overall market movements today. Now from a general news perspective, there was a couple things. I wasn't paying super, super close attention today. There's a couple things in here that stuck out to me. And then for those that don't know, actually, I recently did a video for bar chart about some options trading tips. If you've not seen it, I encourage you to check it out and leave a comment to show up and show out for the outliers, show some love over there. It's like five tips for options trading. Just general stuff. A lot of you will know most of it, but I actually think there might be a couple things in there that might be net new news. So there's a ton of conversation going on around the AI theme, which makes sense. I totally understand that. And this is interesting. I didn't know this actually. Canada's finance minister resigns as unpopular Trudeau faces biggest test of his political career. I've been seeing a lot of clips of Trudeau getting, I don't want to call it slammed. That's a little dramatic, but definitely not seemingly to be in a in a great position during the the points that he's making and the counterpoints being made. But fun fact, I'm",
    "start_timestamp_seconds": 190.62,
    "start_timestamp": "00:03:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=190"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 14,
    "text": "career. I've been seeing a lot of clips of Trudeau getting, I don't want to call it slammed. That's a little dramatic, but definitely not seemingly to be in a in a great position during the the points that he's making and the counterpoints being made. But fun fact, I'm going to go visit the Canadians out there. If any of your Canadian, I'm coming to your place soon. We're going to go to Calgary so that we can go to and then go up to like Jasper. Just go do that whole Rocky Mountain range thing there. But we'll go see what's up. Maybe we'll run into the finance prime minister. Let's see this next one. You used to require passenger vehicles to sound alarms. If rear passengers don't fasten your seat belts, that's terribly annoying. This is all just kind of speculative stuff. I don't think we have to dive too far into that. Let's take a look at the just a couple of their broad market metrics that I like to look at, which are advanced decliners, more declining. Again, today 58 49. We still are seeing decliners expand, which we don't necessarily want to see. Yeah, so these are also growing a little bit. That's also not great. Stocks around their moving averages. Let's take a look at the sectors themselves. IT definitely uptick on percentage above a five day, five days. So this is good. This is stabilization. Normally, what we want to see is",
    "start_timestamp_seconds": 252.46,
    "start_timestamp": "00:04:12",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=252"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 14,
    "text": "so these are also growing a little bit. That's also not great. Stocks around their moving averages. Let's take a look at the sectors themselves. IT definitely uptick on percentage above a five day, five days. So this is good. This is stabilization. Normally, what we want to see is the relationship and how these are trending. Take a look at materials, for example, 32 are above a 200 day, then 36 are above the 150. Let's just pretend that this trend continued going. That means that something is generally in some sort of recovery or ascent across the indexes as a whole, but or the sector as a whole. But that's not really so much the case for any of these. Most of this stuff is actually rolling over. Even IT, you can see it's 51. That's half of the sector is below short term moving averages, which is again, tending to be stuff rolling over. And then comm services was the main leader here, but take a look at this. 50 of them were above their 20 day, but 32 are above the five. So literally, all of that summarizes into it does look like there's a bit of underlying rotation going on. And it's something that I like to keep an eye on. Now, let's take a look. We'll take a look at GameStop in one second. I want to take a look at AVGEO first really quick is take a look at this parabolic move. It",
    "start_timestamp_seconds": 308.7,
    "start_timestamp": "00:05:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=308"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 14,
    "text": "of underlying rotation going on. And it's something that I like to keep an eye on. Now, let's take a look. We'll take a look at GameStop in one second. I want to take a look at AVGEO first really quick is take a look at this parabolic move. It had earnings on the 12th after the market. And it had a massive gap up on the 13th and another gap up here. This is a big stock. This is a really big stock to have this kind of move. It had a really solid earnings. It was expected at a 1.13 came into 1.42 big gap up. This is the kind of thing that we try to pay attention to for post earnings announcement drift. So for the way that I typically would trade that on this gap, this becomes bottom end stop, which is might be something that's on right now to try to follow along with this thing. And then the stop gets moved up to here because there's no reason, especially on these really big parabolic moves a lot of times they will roll right back over. And that doesn't mean that they're coming all the way back down, but it typically shows an opportunity to take profits, re-enter in a consolidation. But this also could pull Tesla on us. And Tesla just said see you later nerds and it's not come back. Well, I guess it did come back a little bit in here. But",
    "start_timestamp_seconds": 390.86,
    "start_timestamp": "00:06:30",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=390"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 14,
    "text": "way back down, but it typically shows an opportunity to take profits, re-enter in a consolidation. But this also could pull Tesla on us. And Tesla just said see you later nerds and it's not come back. Well, I guess it did come back a little bit in here. But since here see you later nerds not come back. Okay. So let's take a look on X. There was somebody that tagged me on this. Who was it? Give props for Joseph, GME, Copa Kai. Drop that and then I'll let you know that I'm doing a video. I'll throw the video below this. So what this is showing is this person saying being seeing a lot of volume on the 125, 16, Jan 26th put strike, but today some unusual movement in the 125, the 25s. And so the question then back ends like why are there these pretty big trades going on on these really deep in the money put. So let's talk about it. Now there's a few things that we can glean from options. The first thing that we have to keep in mind is pretty simple. And that's there are a lot of parties doing a lot of different things. So if we go out here to the 16 Jan 26th, if we go to the 125s, we can see that there's 4300 puts here. And that's a lot of them, especially if you look at the comparable OIs for across the chain and whatnot",
    "start_timestamp_seconds": 456.38,
    "start_timestamp": "00:07:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=456"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 14,
    "text": "a lot of different things. So if we go out here to the 16 Jan 26th, if we go to the 125s, we can see that there's 4300 puts here. And that's a lot of them, especially if you look at the comparable OIs for across the chain and whatnot that might beg the question, what's why are people doing this way out here? And let's talk about this trade first before we go to the 2025 example. One of the things that will actively happen is what we call delta trading. And that's when we try, it's what I do for my ratio call diagonals, ratio put diagonals. We go further out in time and we go really deep in the money. You go further out in time because you pay overall more theta, but you have way less per day theta to K. So if we take a look at this, these are losing about two cents a day in theta. And then if we go to something like these 67s, you'll, and we take a look at the theta, these are losing three, four, five, these are losing way more theta. So that's one of the reasons why we might go that far on time. We want to decrease our theta, but we want to play delta because this essentially will have a delta of one. Don't pay attention to this delta. It's all skewed because of the volatility in the underlying. You can kind of follow",
    "start_timestamp_seconds": 526.46,
    "start_timestamp": "00:08:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=526"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 14,
    "text": "why we might go that far on time. We want to decrease our theta, but we want to play delta because this essentially will have a delta of one. Don't pay attention to this delta. It's all skewed because of the volatility in the underlying. You can kind of follow the theme here, right? So 27 delta, 31, 33, 35, 37, 38, goes all the way up to 42 before it breaks. And here is one it would keep going up from 42. So this isn't actually lower delta's here than this. That's just skewed from volatility. So these essentially would be a delta of one, not perfectly one because these still have plenty of extrinsic value on them, but pretty close to a delta of one. So that's the first thing playing delta. The second thing is standard arbitrage opportunities. So a lot of times you'll notice that if you go deeper and deeper in the money, what do you notice about the bid-ask spread? If we take a look at these 29 puts, the bid-ask spread is 50 cents. If we take a look at these 50s, the bid-ask spread is almost two dollars. If we go even deeper, this bid-ask spread is over three dollars. So or I'm sorry, over two dollars. So what's going on here? There's a liquidity gap. So there will also be different entities, high frequency traders, algos that are looking for pricing discrepancies based on where they can get a fill. And",
    "start_timestamp_seconds": 592.06,
    "start_timestamp": "00:09:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=592"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 14,
    "text": "deeper, this bid-ask spread is over three dollars. So or I'm sorry, over two dollars. So what's going on here? There's a liquidity gap. So there will also be different entities, high frequency traders, algos that are looking for pricing discrepancies based on where they can get a fill. And they're speculating. This isn't necessarily a directional speculation, but more on arbitraging out a mispricing of an option. And that doesn't surprise me because this is a really, really small overall series of trades. The volume today in these 125s and 2025 at the 125 is 104. The net change alive was seven over prior, meaning seven were added today. So it's 144 total. So this could be some sort of entity that is finding mispricings in these options, which is very common, especially notice how weird the delta's get. They're all over the place. They're all out of whack because volatility's out of whack. The volatility on these right now is out of five 90s. So when things are at streams like this, they become more prone for those kind of price discovery moves. Now, the final thing that this could be is part of a much bigger portfolio or bigger trade theme. Just because there's one individual strike that's being transacted in one individual expiration doesn't inherently mean that that's the only thing that that person is looking at. So if we take a look at the size of the trades for these puts, which are right here,",
    "start_timestamp_seconds": 643.82,
    "start_timestamp": "00:10:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=643"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 14,
    "text": "or bigger trade theme. Just because there's one individual strike that's being transacted in one individual expiration doesn't inherently mean that that's the only thing that that person is looking at. So if we take a look at the size of the trades for these puts, which are right here, we can see this. I would wager. This is the same entity getting in at a couple different points in time. I'm just guessing. I don't know, but that's what it seems like to me. And the first trade went out for 620k. The second one went out for 381k. So these are not small. This is not going to be a standard retail trader. This is probably going to be part of a much bigger book that's being traded. And it could be hedging activity because of some short game stop position that they're trying to take risk off. Coming out not this far in time for that hedge would be very sus to me. It wouldn't make a lot of sense beyond the fact that you're not paying a lot of extrinsic value. This is essentially all intrinsic value. So that could be the case. Or it could be something that just compliments a broader portfolio rarely do options traders. Look at each individual options trade trade and kind of analyze it in a vacuum. We don't really care about that. We care about it in context. But what I really care about is if I have options",
    "start_timestamp_seconds": 719.66,
    "start_timestamp": "00:11:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=719"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 14,
    "text": "be something that just compliments a broader portfolio rarely do options traders. Look at each individual options trade trade and kind of analyze it in a vacuum. We don't really care about that. We care about it in context. But what I really care about is if I have options in this stock, this stock, this stock, this stock, this stock, what is my overall net delta across everything? What is my overall gamma? What's my overall theta? What's my vulga? Like I care about those things because all of those options are going to move in different ways. And you have to pay attention to the total risk that you have out in how. So lift notes version. I'm no fucking idea who this is or what it is. There's nothing in this that's like shocking to me. This is pretty common for these really deep in the money options. There's going to be trades that come through like this. You can see that there is 268 that were added on the 105. So it's like that doesn't totally surprise me to see these changing the way that they are. But it is always fun to talk about how markets behave and why these kinds of things can be going on. So those are a few reasons. It could be somebody speculating. It could be somebody hedging. It could be high-frogacy trading. That's taking advantage of mispricings. It could be part of a bigger trade, some sort of pairs",
    "start_timestamp_seconds": 780.46,
    "start_timestamp": "00:13:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=780"
  },
  {
    "video_id": "NFyBJ03Mq0E",
    "title": "NFyBJ03Mq0E",
    "url": "https://www.youtube.com/watch?v=NFyBJ03Mq0E",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 14,
    "text": "markets behave and why these kinds of things can be going on. So those are a few reasons. It could be somebody speculating. It could be somebody hedging. It could be high-frogacy trading. That's taking advantage of mispricings. It could be part of a bigger trade, some sort of pairs trade between these. Lots of lots of different things. So markets are dynamic. Lots of reasons for people to do what they want. As always, hit me up with what you're looking at, what you want me to take a look at. I love talking about the stuff that's interesting to you guys. Be an outlier. I'll see you later.",
    "start_timestamp_seconds": 843.66,
    "start_timestamp": "00:14:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=NFyBJ03Mq0E&t=843"
  }
]