[
  {
    "text": "I went through all of GameStop's options transactions for this entire month. I told you guys I do this option stuff and I got a couple questions asking about some other exploration cycles and strikes based on the video I did yesterday and I'm always here to look into some details. So yesterday's video was really analyzing whether or not I thought Rory and Kitty was buying calls. I noticed that version is at least so far. I'm not seeing it and that's not to say that he couldn't be doing it, but it would be completely different than what he's done before. What that means is based on the updates he was sharing on his portfolio previously leading up to the 10th of June, I essentially looked at his strike price around his size of a position and I analyzed the transaction history. So I can get a sense of size, latency, frequency, all those kinds of things. It kind of creates like a bit of a fingerprint on an individual trader's behavior especially when you're trading something at size. It's a little easier to detect. So a lot of the things we're seeing so far don't really live up to that standard and so far as most of the transactions, the block transactions we're seeing are still pretty small and I'm not seeing the same behavior as I did before. So the goal of this video is to provide an update on GameStop options because as you guessed,",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=0"
    }
  },
  {
    "text": "up to that standard and so far as most of the transactions, the block transactions we're seeing are still pretty small and I'm not seeing the same behavior as I did before. So the goal of this video is to provide an update on GameStop options because as you guessed, more happened today specifically with respect to volatility and a ton of call volume for this upcoming expiration in just a few days, which I do find really interesting. To me, it seems like a lot of people are burning money here, but we'll take a look and hopefully they're not. Hopefully they get paid out, but my goal here is not to spread hyperfudge. It is to share information. Leave it up to you to decide. So before we get to these two questions, I'll get them out of the way just for now. And let's take a look. 25th of June, we saw a pretty big pop in volatility and I actually keyed into that pretty quickly because it was very different and especially the way that the volatility moved throughout the expiration cycles. Then we fast forward to today and we see a huge drop in volatility. That is already strange to me. Again, when I see volatility moving by near 50 points, I'm curious what's driving that. Even in something that's very volatile, there's typically some sort of news that would lead to this kind of change in volatility. The other thing that I find really",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:36",
      "start_timestamp_seconds": 96.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=96"
    }
  },
  {
    "text": "That is already strange to me. Again, when I see volatility moving by near 50 points, I'm curious what's driving that. Even in something that's very volatile, there's typically some sort of news that would lead to this kind of change in volatility. The other thing that I find really novel here is how the midterm volatility didn't move quite as much as the near term that doesn't fall out of line with what you might see. If you're expecting a lot of volatility in the short term for the short term, the front expirations to move around more, not exactly shocking, but the way that this all popped up and then kind of came down, but stayed a little elevated towards the middle is interesting to me. Now let's kind of get to more of the specific details though. The first thing I want to do is take a look at the volume because this is the genesis of today's video. This is three days in a row where the call volume is over 220, this is the lowest it's been over the past three days, but it's still over 220,000 volume on calls across all strikes and expirations and the puts are still pretty static in the fifties. Now if we click in a little bit, see where this is happening of this total 226K, 130 of it is in this expiration in just a few days here today is the 26th of June. Then if we go",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=192"
    }
  },
  {
    "text": "and the puts are still pretty static in the fifties. Now if we click in a little bit, see where this is happening of this total 226K, 130 of it is in this expiration in just a few days here today is the 26th of June. Then if we go out to the 5th of July, there's still a bit way more callsque, but much slower transactions and as a typical learning point is you guys like to as you guys might know, I like to integrate different learning points more general to options outside of just game stop in this and this is a good opportunity for that. Specifically, you'll find that there's typically going to be way more volume and open interest and the standard expirations. And it's because you kind of need enough players for increased liquidity. So people naturally drift to these places for that as compared to the weeklies. That doesn't mean you won't see anything in the weeklies you very frequently will, but you'll typically see more in these standard expiration. The other thing you'll find is that when we look inside of these standard expirations, you'll typically find on round numbers more open interest. So at these 20s, there's 8971. At the 19 and a half, there's five. At the 20 and a half, there's 13. Does that mean that the 20s are just so much better than the 19 and a half, so 20 and a half's not really. It's just that",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:04:48",
      "start_timestamp_seconds": 288.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=288"
    }
  },
  {
    "text": "interest. So at these 20s, there's 8971. At the 19 and a half, there's five. At the 20 and a half, there's 13. Does that mean that the 20s are just so much better than the 19 and a half, so 20 and a half's not really. It's just that there's more people that want to transact at these round numbers. It's literally human nature. So if you click through this, the 21s only have 75, the 22s, 23, and then let's see what happens when we get to 25. This one now has 16,207. An observable pattern. And it's actually again, kind of subconscious tradable information that you can bake into how you're picking things because these big blocks of transactions can either serve as overall supporter resistance for price, depending on what behavior the market makers have to exhibit as those positions move. So that all aside, coming back down to here, we now know the vast majority is going on in 28 June. If we go out to 12 July, again, still big calls to you, but very, very low volume and the 19 July, very, very big callscue in terms of volume, but not as busy. The vast majority of activity right now is hands down in this front expiration. And I bring this to your attention because while there is activity going on out in the 19 July's, when I see these questions, that's one of the first things that come to mind to make",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:06:24",
      "start_timestamp_seconds": 384.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=384"
    }
  },
  {
    "text": "The vast majority of activity right now is hands down in this front expiration. And I bring this to your attention because while there is activity going on out in the 19 July's, when I see these questions, that's one of the first things that come to mind to make sure that we're on the same page is when we say things like a lot of volume in high OI. On a relative basis, it's just not so much what we're seeing. Now, that doesn't mean for that individual cycle that there's not a lot going on, but as compared to where we are seeing most of the activity, it's very, very clearly here. 130,000 out of the 226,000 for today occurred literally in a few day expiration cycle. That's that. Now, let's take a look at the notable positions for today in terms of transactions. We did see a little more size coming in. The vast majority of this size is at the super far out of the monies. So there's a 1306 lot that came out for the 28 June's at the 128's. And then at the same, there's a 1000 lot that came through. And these were actually pretty close together about 10 minutes apart. So this isn't outside the room of possibility for it to be a single party, but we don't know. And it doesn't necessarily matter because again, as I try to remind you guys, even though like 1306 might seem like some sort",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:08:00",
      "start_timestamp_seconds": 480.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=480"
    }
  },
  {
    "text": "actually pretty close together about 10 minutes apart. So this isn't outside the room of possibility for it to be a single party, but we don't know. And it doesn't necessarily matter because again, as I try to remind you guys, even though like 1306 might seem like some sort of really big position, it's actually not. So I'm doing the math right now here for you guys so that we can see it's a 2,600 position. So and for those that don't know how I'm doing the math, I'm literally just taking 1306 points 0 to times 100 or you could do 1306 times two, whatever makes it happy. Which now that I look at that pretty easy math, still need to calculate it or not that smart. Anyways, there's just these aren't big positions, right? And these are the biggest that we saw. Now there are some sizeable positions on a relative basis to this that are happening out here in the 19 July 25's. But this still on a overall basis is not, it's not that large of a position. So in this case, we would take 335 multiply that by 415, you get 139,000. And I know that that might sound like a lot of money, but for something like, it's really not for something like this. And especially for options positions that's still on the smaller side. But this one's kind of interesting to be honest, this 26 July that you see here at the",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:09:36",
      "start_timestamp_seconds": 576.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=576"
    }
  },
  {
    "text": "know that that might sound like a lot of money, but for something like, it's really not for something like this. And especially for options positions that's still on the smaller side. But this one's kind of interesting to be honest, this 26 July that you see here at the 24 and a half at 250. The reason why that one's interesting to me is just because it's a 24 and a half. You'll notice again, most of these are generally round strikes. And the reason why these 128s are so busy is because they're so far out of the money. They're the furthest you can go right now. And that's why these are seeing activity as compared to like a 125 or a 130. Most of these will expire worthless is what it will boil down to. So unless we get a giant move, I want to be super clear about that. If we get a big move, then they absolutely could show some money. But if we take a look at the entire options chain here, they've already decayed as compared to what I showed you yesterday. They've lost their one delta. Gamma is still zero. And now they're mid at 1.5. So they're still experiencing two, two cents of theta decay. So essentially, these will just hover around nothing. They're worth fractions of a penny at this point. I think a lot of people are just piling into these because if for whatever reason, there was some",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:11:12",
      "start_timestamp_seconds": 672.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=672"
    }
  },
  {
    "text": "they're mid at 1.5. So they're still experiencing two, two cents of theta decay. So essentially, these will just hover around nothing. They're worth fractions of a penny at this point. I think a lot of people are just piling into these because if for whatever reason, there was some sort of big move, then this would benefit. But and I also think a lot of people might be unfortunately just piling in on big East theory. And that's not to disparage the theory at all. I still think it's a fascinating theory that I'm exploring more myself. But this is a really tough way to make money trading by kind of catching a glimpse of a theory and then piling a bunch of money into super far out of the money calls, fingers cross hoping something works. Again, I really hope it works for whoever goes for those positions. I want to see people succeed in this. And it's also why I try to talk about this stuff in this way to give people other ideas on how you can structure similar positions that might not make the same crazy percent return if you get a big move. But you'll make more as a gross dollar amount. And I'll link that same video I've referred to you guys before a few times. Buying call options smarter, specifically using GME as a vector. I'll throw that in the notes that you can check out if you would like. Now last",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:12:48",
      "start_timestamp_seconds": 768.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=768"
    }
  },
  {
    "text": "you'll make more as a gross dollar amount. And I'll link that same video I've referred to you guys before a few times. Buying call options smarter, specifically using GME as a vector. I'll throw that in the notes that you can check out if you would like. Now last thing I want to show you is kind of this. This is like a really high level summary of what I'm seeing in terms of call long call activity for the month. So what I did was look at each kind of primary expiration that we have coming up. And I want to see a few things specifically. I wanted to see what is the trend of transactions and is there any really big positions being built because there's some conjecture that there was. And if we look out to the 19 July expiration, which is this one here, we do see some interesting positions coming on, but still nothing even remotely large. And to be clear, this is volume. This is not open interest. This is volume using some of the larger trades. So we have. And this is aggregating. These aren't individual transactions. So this is looking over each trading day so far this month except for today. I don't have the data yet for today. And I'm looking at aggregating at each individual strike. For that expiration, what is the total volume that we saw transact at that point for the month? And there's just not that",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:14:24",
      "start_timestamp_seconds": 864.0000000000001,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=864"
    }
  },
  {
    "text": "each trading day so far this month except for today. I don't have the data yet for today. And I'm looking at aggregating at each individual strike. For that expiration, what is the total volume that we saw transact at that point for the month? And there's just not that much going on here. The most interesting things are these super far out of the money, 128s. And I don't really view those as super informed in trades. These look way more like lottoes to me. These 30s are a bit more interesting to me, but it's still lower volume on a relative basis. So if we come out here to the 30s, we can see that there's a big position here, 25,700 essentially, oh, I against 18,500 volume today. So there's definitely a lot of transactions happening here. But my guess is this will be a mix of opening and closing because this is some people that are trying to collect whatever money they can get out of this position before it essentially decays into nothing because if you look at the theta decay, it's 14 cents, these are now worth 17 cents. So if you wait a day, these are going to be worth very, very little as we get closer and closer to expiration. Again, all options have to make a choice. They're either going to be in the money with intrinsic value out of the money with no intrinsic value and at expiration, extrinsic value is",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:16:00",
      "start_timestamp_seconds": 960.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=960"
    }
  },
  {
    "text": "these are going to be worth very, very little as we get closer and closer to expiration. Again, all options have to make a choice. They're either going to be in the money with intrinsic value out of the money with no intrinsic value and at expiration, extrinsic value is gone for all of them. And we're coming up on time here. So so far, that's what I'm seeing. Now to go back and address these kind of specifically, I don't see these. And for the I can't, I don't even know what this is, KVB, they were saying that they were watching as they were dashing out the door. The reason why I was honing in on the 20s yesterday is because people had specific questions about that one kind of like you, right, with this one looking at the July 19th, but I don't actually see a ton of activity out here, at least so far for the 19th of July. That doesn't mean that there's none, but there's not a lot. And then for this question, they were looking at the 30 in 19th July, which is the more busy expiration for sure out in 19 July, but it's still not that busy. So if we go out here, 19 July, pop out here to the 30s, there's 21,600 OI against 6400 volume today. So this isn't dead by any means, but this also still is not a hyperactive position just yet. And this is actually a",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:17:36",
      "start_timestamp_seconds": 1056.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=1056"
    }
  },
  {
    "text": "but it's still not that busy. So if we go out here, 19 July, pop out here to the 30s, there's 21,600 OI against 6400 volume today. So this isn't dead by any means, but this also still is not a hyperactive position just yet. And this is actually a decent trade in my opinion. It's still a little too far in time for the way that I would structure these, but out of 36 delta, these will gain decently, especially because they will capture a lot of gamma if we get a move in our favor, which in this case, would be to the upside. So there definitely is some speculation going on here, but again, based on the overall buying activity that I've seen at these levels. And for here, if we take a look at the 30s, let me see, kill this. And I just want to show you like the average sizes that we're seeing for that expiration specifically. And then we need to clear these and we need to go out here. Here you go. So you can see the size of these trades. They're not big. The largest trade so far was 772, which is not small, but that's also not a very big trade. Another thing is when I look at the price that some of these come through, it is clear that at least in my opinion, the majority of these look like their purchases. So that is more bullish in nature,",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:19:12",
      "start_timestamp_seconds": 1152.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=1152"
    }
  },
  {
    "text": "is not small, but that's also not a very big trade. Another thing is when I look at the price that some of these come through, it is clear that at least in my opinion, the majority of these look like their purchases. So that is more bullish in nature, but there's just not a ton of size going on here yet. So that's what I'm seeing so far. As you know, I am paying pretty close attention to this. I'm happy to take a look at anything that you guys would like me to. If you have any questions, let me know. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "ngil69-Hg0U",
      "title": "GME Options Update: IS Roaring Kitty Buying Calls?",
      "url": "https://www.youtube.com/watch?v=ngil69-Hg0U",
      "upload_date": "",
      "duration": 964.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:20:48",
      "start_timestamp_seconds": 1248.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ngil69-Hg0U&t=1248"
    }
  }
]