[
  {
    "text": "We got an easy one for you today. What does it mean to be long a call option or really long any option? In this context, long simply means you bought it. This kind of can be tricky for new traders because you can be long an option but short the market. What's an example of that? Well, if you bought a put, long bought, the put, however the disposition of that trade is bearish, meaning short the market. So there's long in short with respect to the transaction, whether you bought or sold. And then there's long short with respect to your disposition towards the product, whether we think it's going to go up or going to go down, being out on the other side.",
    "metadata": {
      "video_id": "NkE5eMnb7rE",
      "title": "“Long” Options #optionstrading #trading #stockmarket",
      "url": "https://www.youtube.com/watch?v=NkE5eMnb7rE",
      "upload_date": "2024-05-15T01:27:12Z",
      "duration": "PT43S",
      "channel_name": "",
      "description": "📨 Subscribe to the Outlier Insights Newsletter. https://esinvests.substack.com/\n💡 Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n📈 Join the Outlier Patreon for exclusive content: weekly workshops, templates, trade reviews, & more. https://www.patreon.com/erik_esinvests\n📻 Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\nℹ️ Free Compound Interest Calculator: https://www.esinvests.com/resources\n🔎Learn About Erik. https://www.esinvests.com\n\n▬ EVENTS  ▬▬▬▬▬▬▬▬▬▬▬▬\n►Weekly Monday Night YouTube Live - 5pm PT\n►Weekly Outlier Pro Patreon Workshops - Discord\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off ORATS Options Trading Platform, Backtesting, & More: https://orats.com/esinvests\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek\n\n▬ VIDEO DETAILS ▬▬▬▬▬▬▬▬▬\n#trading #stockmarket #optionstrading\n\n\n\n▬ DISCLAIMER ▬▬▬▬▬▬▬▬▬\nThe content presented is for informational purposes only and should not be considered as financial advice. esInvests, its affiliates, and employees are not responsible for any investment decisions made based on the information presented in these videos. All investment and trading activities involve risk, and viewers should carefully consider their financial situation, investment goals, and risk tolerance before making any investment decisions.\n\nAny opinions, news, research, analyses, or other information contained in these videos are provided as general market commentary and do not constitute investment advice. esInvests does not guarantee the accuracy, completeness, or reliability of any information presented in these videos and is not liable for any losses or damages arising from the use of or reliance on this information. Viewers are encouraged to seek professional financial advice from a licensed investment advisor before making any investment decisions.\n\nBy accessing and watching these videos, viewers acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NkE5eMnb7rE&t=0"
    }
  }
]