[
  {
    "text": "you you you you s , center day So I see we got coffee house test confirmed. We are alive and well. We got catch me on who is here. Second Marcus trader Jonathan. We got generational capital. That's what we're all pursuing here. So let's get to see Willie Derslup, day swag, sedric that Lauren is good. And as you all know, there's a bunch of familiar names to me at this point. And that's probably means there's a bunch of familiar names for you too. So hopefully you're making some friends along the way. We also got Mr. off Putin here hanging out. Beautiful. All right. So you already know before we get too far into the weeds here, we do have to grab my little GME live stream map and see if there's any updates. We need to make to this. So if you've already let me know where you're from, you don't have to let me know. But if you've not let me know where you're from, let me know. Right now it looks like from a US perspective, we really need to get some people in the central north. I don't know if that's what sent. I don't know, is this called the west? I guess it's the west. What is this? What do you call this? Not the, I don't like the Midwest. I think the Midwest is stupid. So there's like, this is actually, I've never really analyzed the map this way. Because",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 112,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=0"
    }
  },
  {
    "text": "sent. I don't know, is this called the west? I guess it's the west. What is this? What do you call this? Not the, I don't like the Midwest. I think the Midwest is stupid. So there's like, this is actually, I've never really analyzed the map this way. Because this is what like the center of the US, if I were to eyeball a line, is this right? Where's like the midline of the US? Because I know that we would call this the Midwest, but I don't really get why. Because this is just like the west, and then there's the east, northeast makes sense, southeast makes sense, southwest makes sense, northwest makes sense. But this is kind of like the middle of the US. That's the mountain west. Huh. I don't know if I get on with that. If you were to eyeball a midline through the US, where would it be? Because to me, I'm thinking it's something like here, through Minnesota, because technically, Maine really skews us over to this side a lot. So this would be like the center of the US, is what? Like Eastern Kansas slash Missouri, something like that. Jimmy says, not many people live in Idaho, Montana, Wyoming, Dakota's number, yeah, definitely. That's why we need to get representation here, because we have to fill these in. We're very close. We're very, very close. Jimmy says, I'm in Denver, Colorado. It's considered the west. If you go to Kansas, or",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 112,
      "start_timestamp": "00:04:25",
      "start_timestamp_seconds": 265.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=265"
    }
  },
  {
    "text": "not many people live in Idaho, Montana, Wyoming, Dakota's number, yeah, definitely. That's why we need to get representation here, because we have to fill these in. We're very close. We're very, very close. Jimmy says, I'm in Denver, Colorado. It's considered the west. If you go to Kansas, or more east, would be considered the Midwest. God, that's fucking, you've completely, you got my mind in a blender. Yeah, I'm in a blender. I would consider Colorado the west, because that's actually we're looking at moving here, outside of Colorado Springs. So we might be, well, for us, it would be moving east, because we're down here, but I still think that that's west. This is where I started was in New York. Sposed car says north central. Yeah, that's what, that's what this feels like to me. It's like north central US, but I don't think that that's what we call it. I don't know. All right, so let me see if there's any that we needed to add. It looks like we need to add Roseville, California. And this is for via, via label. I was going to say via low bow, because that's, I don't know where my mind would go at that. Roseville, so just outside of Sacramento. I think we have Washington representation already. So we're good with Washington. Fort Worth, I'm almost positive we have. Yep, so there's Dallas Fort Worth. We'll call that good. We do have, that good. We do have",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 112,
      "start_timestamp": "00:05:35",
      "start_timestamp_seconds": 335.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=335"
    }
  },
  {
    "text": "where my mind would go at that. Roseville, so just outside of Sacramento. I think we have Washington representation already. So we're good with Washington. Fort Worth, I'm almost positive we have. Yep, so there's Dallas Fort Worth. We'll call that good. We do have, that good. We do have a Mexican, wait, do we have a Mexican? Yeah, so we do have a Mexican. We need a Cuban. We do have one South American, which is good. Yep. And then we need an African. We need a Middle Eastern for sure. Russian, I don't even know if they can get on this, but if they can, that would be good. I would like a New Zealander. Honestly, if we can get in person from Iceland, Greenland, my, if there's a way for one of you to find somebody from Madagascar to get onto one of these livestreams so I can fill in that dot, that would be magic, I think. I think that would be absolutely magical to have somebody from Madagascar. Because I don't know if I've ever literally met anybody. I mean, I think that, is there even like cities or anything there? Yeah, it looks like there's cities, there's roads and everything. It shows you how much I know. I don't know anything about Madagascar. Yeah, it looks like Madagascar. All right, we'll get started in just a second as we finish going around Madagascar. I had a boss when I was in the Marine Corps,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 112,
      "start_timestamp": "00:06:47",
      "start_timestamp_seconds": 407.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=407"
    }
  },
  {
    "text": "there's cities, there's roads and everything. It shows you how much I know. I don't know anything about Madagascar. Yeah, it looks like Madagascar. All right, we'll get started in just a second as we finish going around Madagascar. I had a boss when I was in the Marine Corps, he wanted to go to Madagascar when we were in Australia. That was like one of his game plans, but he never had a chance to make it over there. We'll do like a little street view real quick and see, all right, what's going on here? That, I mean, that looks like civilization over there, don't it? Yeah, let's check this out. Ooh, yeah, yeah, I feel like they have it. This feels like they have internet. If not, I mean, you get a star link now. Daddy Elon takes care of that for everybody. Yeah, this looks, this looks like they would have internet. It's not like completely out in the middle of nowhere. All right, and let's grab like some random as spot Madagascar really quick. We really guys want to go north or south Madagascar. I want to see if I can find something that's like out in the middle of nowhere. I think that would be really cool. Wiggly says who needs civilization when you have empty land to sit in? Yeah, northeast. Got it. Let's do northeast. Let's click this. This looks good. Oh, this reminds me of like Costa Rica. This is like",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 112,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=485"
    }
  },
  {
    "text": "out in the middle of nowhere. I think that would be really cool. Wiggly says who needs civilization when you have empty land to sit in? Yeah, northeast. Got it. Let's do northeast. Let's click this. This looks good. Oh, this reminds me of like Costa Rica. This is like straight up rainforest action. That's not what I expected. From there, oh, let's check out the coast really fast. Is there anything that's close to this coast that we can click? Come on, Google. Here we go. A new Google would keep it real for us. Who knew? Not at all what I expected. Not even remotely what I expected. That's fascinating. I genuinely thought that that was going to be like a sandy beach. I did not expect that at all. Wow, that's so cool. Okay, so yeah, we definitely need someone to get us a representative from Madagascar. It feels like that that's got to happen. Okay, so I think we're caught up on the updates here though. Yeah, Costa Rica is sick. Completely, completely agree. Jimmy says I honestly pictured all of Madagascar as a jungle. I think that that's like a really fair cop, right? Like I think because this looks very deserty. And then this you could tell is like super tropical up here. So yeah, that's absolutely fascinating. Eric, it sounds like you visited. Have you been to the Pacific or Caribbean side of the country? Both. Yeah, I've been to both. I essentially",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 112,
      "start_timestamp": "00:09:15",
      "start_timestamp_seconds": 555.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=555"
    }
  },
  {
    "text": "I think because this looks very deserty. And then this you could tell is like super tropical up here. So yeah, that's absolutely fascinating. Eric, it sounds like you visited. Have you been to the Pacific or Caribbean side of the country? Both. Yeah, I've been to both. I essentially I've been I've been super fortunate. I've been a lot, a lot of places at this point in my life. But one of my favorite hobbies is actually scuba diving. So pretty much everything that's in this area I've hit. Like I've been out here to the Galapagos. Yeah, I've been through yeah, pretty much most of the Caribbean I've been I haven't been to Cuba because the I was still on active duty for most of the time and Cuba was still, you know, communist not not a lot of go there for military people, especially with like if you have a clearance, they don't let you. But pretty much everybody else everywhere else in the in the Caribbean have been. All right, so now pivot over quick recap where where are we at? We've now left Madagascar and we have now teleported to the end of January of 2021 and we've gone through how many trades have we done so far? I haven't even counted how many is this. 31 trades. Well, 31 position updates, I should say it's definitely more trades than this. And day swag says I'd love to buy a house one day in Jamaica",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 112,
      "start_timestamp": "00:10:50",
      "start_timestamp_seconds": 650.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=650"
    }
  },
  {
    "text": "2021 and we've gone through how many trades have we done so far? I haven't even counted how many is this. 31 trades. Well, 31 position updates, I should say it's definitely more trades than this. And day swag says I'd love to buy a house one day in Jamaica so I can be with my family. I've been to Jamaica and I have to be honest, I didn't have a great time. Jamaicans in general that I met were awesome. The part that I didn't really like is they kept stealing shit from us. That got a little old every time that we would try to I like snorkeling and scuba diving. So every time we would try to find a spot on the beach to be able to go in and like snorkel, we would try to put our stuff somewhere and that the shit was gone like almost every time that got super frustrating. So I just wish they didn't have to take my shit when I went in the water because most of the places that I've been in the Caribbean, it's kind of like the exact opposite where it is much. It's like there was a place when I was in green Cayman. No, Cayman Brake, the smaller Cayman Island, I had to go get a buddy from the airport there and we were figuring out because like they didn't have like Uber or Lyft at the time. So we're like figuring out how we",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 112,
      "start_timestamp": "00:11:57",
      "start_timestamp_seconds": 717.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=717"
    }
  },
  {
    "text": "a place when I was in green Cayman. No, Cayman Brake, the smaller Cayman Island, I had to go get a buddy from the airport there and we were figuring out because like they didn't have like Uber or Lyft at the time. So we're like figuring out how we were going to get over there. Literally we were sitting at a bar not drinking. We were grabbing lunch because it was like midday. Literally the bar tender was just like, oh, just take my car. Literally that's like that's what it was like on Cayman Brake and at first that sounds crazy, right? It's like take your fucking car like who would who would offer that. But then you also realize that there is literally nowhere to go Cayman Brake is tiny. We rode around it on a bicycle. So they have like a very home style feeling there. And when I was in Jamaica, it wasn't quite like that. The other place that I had that kind of experience was the Dominican Republic. They because the other thing is when I travel to these places, I do not do the resort thing. I'm very active. So I like to rent a car everywhere I go. I like to drive everywhere around where I go. And in the DR, they I had to give them money so that they didn't take take my wallet. And then in Mexico, they do that too, but in Mexico, they do that to",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 112,
      "start_timestamp": "00:13:03",
      "start_timestamp_seconds": 783.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=783"
    }
  },
  {
    "text": "to rent a car everywhere I go. I like to drive everywhere around where I go. And in the DR, they I had to give them money so that they didn't take take my wallet. And then in Mexico, they do that too, but in Mexico, they do that to everybody. So yeah, there's a couple places that are like that that are a little more exploitive, I would say. But I mean, the other thing is, I don't know, some people, especially from America, we feel some type of way if you get extorted like that. But for a lot of these other places, it's just like, it's annoying. Nobody likes it. But it's just kind of like how a fucking goes, right? So like if you have to pay a, like I had to pay the Mexican cops like 80 bucks. And it like is what it is, right? You just fucking pay them the 80 bucks and then you just keep going with your day. And the funny part about that too was when I met up with the dive boat, like the people I was diving with, that's when I was driving from, I was driving up to La Paz. So it was like way up out there. And it was so funny because we were coming up to a stop sign and the funniest story. And then we'll get into growing kitty I promise. But we were coming up to a stop sign. And we",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 112,
      "start_timestamp": "00:14:06",
      "start_timestamp_seconds": 846.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=846"
    }
  },
  {
    "text": "up to La Paz. So it was like way up out there. And it was so funny because we were coming up to a stop sign and the funniest story. And then we'll get into growing kitty I promise. But we were coming up to a stop sign. And we were out in the middle again, like towards La Paz, not quite there yet. So like there was nobody else there. We were straight up the only white people. And I don't blend in with Mexicans. There are some lighter hair Mexicans, but everything about me doesn't say, you know, this guy's from here. Obviously. So we're coming up to the stop sign. I literally can see a cop sitting on the other side of the stop sign. And I look over to my passenger and I'm like, yo, nobody is stopping at the stop sign. And I have this conversation. I see a cop at the other side of the stop sign. This is going to feel weird, but I am going to come to a complete stop at the stop sign because I can see the cop right there watching this stop sign. Sure as fucking shit. I come to a complete dead stop. Do the count two seconds thing. I start pulling off. They pull us over and I don't speak Spanish well, but I can understand it. Okay. And he was he literally told me that I didn't stop at the stop sign. And I literally",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 112,
      "start_timestamp": "00:14:55",
      "start_timestamp_seconds": 895.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=895"
    }
  },
  {
    "text": "come to a complete dead stop. Do the count two seconds thing. I start pulling off. They pull us over and I don't speak Spanish well, but I can understand it. Okay. And he was he literally told me that I didn't stop at the stop sign. And I literally just started laughing because he knew I stopped. I knew I stopped, but I also knew what was going on. I knew what time it was. And I literally just asked him, I was like, want to play still like, how much is this going to be for me to not stop at the stop sign? And he's he was funny about it. He was just like, he's like, oh, he's like, you know, we just we just need to go get lunch. And I was just like, okay, I was like, you guys getting drinks with your lunch or is this just like a normal lunch? And he was like, he's like 200 bucks will do. And I was just like 200 bucks. I was like, no, what the fuck are you smoking? And I open up my wallet. I never keep all the money when I travel like in that will billfold. I squirrel most of it away. And I was just like, dog, I have 60 bucks. Well, that work. And he's like, if you if I had a password with me, he's like, if she is, she has another 20, we'll call it good. So we",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 112,
      "start_timestamp": "00:16:04",
      "start_timestamp_seconds": 964.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=964"
    }
  },
  {
    "text": "in that will billfold. I squirrel most of it away. And I was just like, dog, I have 60 bucks. Well, that work. And he's like, if you if I had a password with me, he's like, if she is, she has another 20, we'll call it good. So we had a fucking pay these dudes 80 bucks. And then, you know, we kept driving. But the same token they had no tolls. So I guess you just kind of count that as a toll. It was so fucking funny. So yeah, learn a bunch of lessons there. Because in the DR, they try to take my driver's license. So I actually take an old driver's license. So that and I put that on the top because what they try to do to extort you is they'll say, they'll take your driver's license. They won't give it back to you. And then they'll say, bring me like follow me to the to the police station. That's what they try to do. They try to bring you to the police station. So it. I found it works really well. If you have essentially an old license or something that you don't care if they take and then you just drive to the fucking hotel because they won't fuck with you at the hotels because the hotels will stand up for you. Because they obviously are trying to get tourism and industry going there, which stuff like bribery really nukes because it's",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 112,
      "start_timestamp": "00:16:54",
      "start_timestamp_seconds": 1014.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1014"
    }
  },
  {
    "text": "care if they take and then you just drive to the fucking hotel because they won't fuck with you at the hotels because the hotels will stand up for you. Because they obviously are trying to get tourism and industry going there, which stuff like bribery really nukes because it's not super fun. Like I wouldn't go back to Jamaica at this point. I think it's a beautiful place. I liked it, but I didn't like all the fuck fuck games there. So Steele says, bro is laughing about getting robbed. Did he bucks dude, it's all life experience. Yeah, it was the the circumstance of that pullover was the funniest fucking thing because I had an entire conversation with my passenger about stopping. I came to the most obnoxious full stop you could possibly come to. And then the first thing he says to me is you didn't stop at that stop sign. It was I was just like it's pure comedy. It's pure fucking comedy. And I was just like, well, just fucking see how much it takes to get out of here. So I mean, that's also just getting used to the way that the world works, right? Because Westerners, the idea of like bribery is crazy, right? The idea of like trying to pay a cop off on the side of the road is like the fucking wild is thing on earth. But in a lot of the world, that's how these motherfuckers get down. It's",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 112,
      "start_timestamp": "00:17:51",
      "start_timestamp_seconds": 1071.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1071"
    }
  },
  {
    "text": "right? Because Westerners, the idea of like bribery is crazy, right? The idea of like trying to pay a cop off on the side of the road is like the fucking wild is thing on earth. But in a lot of the world, that's how these motherfuckers get down. It's how you move around. So you just kind of take it for what it is. And I mean, it's 80 bucks, right? Like we're okay. They didn't fucking bother us more than that. These are just some dudes trying to make some fucking money. I don't agree with that. I think it's fucked up. But what am I going to do, right? H has it the exact way, pay to play. You kind of know what you're doing when you're getting there and that's all good. You just fucking you, you now have a hilarious story to tell people because that is the that Lawrence says I've heard Russia is worse. Russia. Yeah, that that place you got to be super careful. I've never been there. So I can't say, but I've have friends that are from there and whatnot. And that's a different ballgame because yeah, they play, they play hard and they go hard in the paint. So yeah. All right. So should we start with diving into the trades or do you guys want to do a quick recap of GME activity last week? I am cool with either or we can start with whatever makes you",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 112,
      "start_timestamp": "00:18:48",
      "start_timestamp_seconds": 1128.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1128"
    }
  },
  {
    "text": "play hard and they go hard in the paint. So yeah. All right. So should we start with diving into the trades or do you guys want to do a quick recap of GME activity last week? I am cool with either or we can start with whatever makes you happy. I was looking through, we got to 2021. So there's no way we're going to get through the rest of his trades today. I just don't see that happening. So I'm guessing this will probably be like a six part series give or take just because there's there really is so much with all these trades to to keep track of. Yeah, okay. So we'll. It looks like esoteric. You've been strongly outvoted and we're going to run through a quick recap. So let's let's get that going. So first and foremost, let's grab. GME. Okay. So there's a few things that I saw from a high level. I'm not going to go super far into detail on like price action and stuff like that because one, it is what it is to I did a video on Thursday that talks about some of that. So I don't want to waste too much of your time with that. If there's questions, obviously happy to answer. But from a general perspective, what I would highlight for you here is that GameStop clearly once the at the market concluded GameStop really started to find a little bit of strength. And here's",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 112,
      "start_timestamp": "00:19:45",
      "start_timestamp_seconds": 1185.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1185"
    }
  },
  {
    "text": "to waste too much of your time with that. If there's questions, obviously happy to answer. But from a general perspective, what I would highlight for you here is that GameStop clearly once the at the market concluded GameStop really started to find a little bit of strength. And here's a really, really important point to the strength that I see. If I show you the Russell, what do you notice different about GameStop versus Russell? And I'll make this a little easier to track here. So if I throw GameStop up top and then I throw Russell down here and then I'll change both of these to a three month daily to get a slightly better scale. What's the difference on the week that you notice there? Really important. And I'll explain why this is so important. But how do they do on the week comparatively? And the reason why I think this is so important to highlight for you is because when I look at H says inverse, there you go, they finally broke the correlation because for quite a while, when we look at GameStop, we can clearly see GameStop was actually struggling a little bit. And a big part of that I think was the larger small cap space coming under fire, just having pressure. Now with the post earnings drop and even still small caps are showing upward strength, a little bit of downward pullback, but still upward strength. But the relationship is now generally",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 112,
      "start_timestamp": "00:20:56",
      "start_timestamp_seconds": 1256.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1256"
    }
  },
  {
    "text": "a big part of that I think was the larger small cap space coming under fire, just having pressure. Now with the post earnings drop and even still small caps are showing upward strength, a little bit of downward pullback, but still upward strength. But the relationship is now generally broken in a short term timeframe. Because if we go to like nine sixteen into the to the 19th, GameStop's going down while smalls are going up, then we have smalls from the 19th into the 25th going down, then we have GameStop going up. So this definitely looks like it was largely suppressed and then it starts rebounding back up and out. So we have to absolutely track the relationship between these because it helps us understand the perspective price movement for sure. Rowing titties here, everybody, big giant shout out to fan favorite, roaring tittie. Roing tittie says, do we get to talk any tinfoil later? You know I'm always down. I literally had my wife construct for me a tinfoil hat. So yeah, as soon as it's time to get into theories, I am so down. But from a price action standpoint, there's not really any theories here. This is unfortunately looking at boring cold hard data. That is what it is, right? Who likes that stuff? It's like, that's like the stuff for nerds. You know, it's like when I think about, when I think about the stuff that I like typically look at, I realize",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 112,
      "start_timestamp": "00:22:10",
      "start_timestamp_seconds": 1330.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1330"
    }
  },
  {
    "text": "here. This is unfortunately looking at boring cold hard data. That is what it is, right? Who likes that stuff? It's like, that's like the stuff for nerds. You know, it's like when I think about, when I think about the stuff that I like typically look at, I realize it's like no wonder why nobody likes this shit. I don't know why I do, but I do. So that's the first thing I see with respect to GameStop and its behavior around the indices, which is very important to flag. Okay, cool. That point's been made. Now let's go back and take a look at a couple other things that I want to flag for GameStop specifically. The first thing is I'm seeing volume tailor off, but not drop entirely. That's another exceedingly important point right now. So if I go into this space in here, right? So this space being pretty much anything from the 5th of August into earnings almost. I can see overall volume is very, very, very, right? So I can see volume here is 6.5, 6.5, 4.3, 5.3.5, 3.5, 3.1, 3.3, 4.4, 4.7, so on and so forth. So we're talking like sub five almost this entire time. Then we get in here, we have on the 20th, 62 million shares transact. That drops to 13.9, 12.1, 6.15, 5.7, and then takes back up to 7.4. So when we look at this volume activity, it's showing me a different structure, a different behavior pattern",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 112,
      "start_timestamp": "00:23:27",
      "start_timestamp_seconds": 1407.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1407"
    }
  },
  {
    "text": "almost this entire time. Then we get in here, we have on the 20th, 62 million shares transact. That drops to 13.9, 12.1, 6.15, 5.7, and then takes back up to 7.4. So when we look at this volume activity, it's showing me a different structure, a different behavior pattern than what I see here, and then also even from what I see in here. And as always, I am a data driven trader. I'm going to look for other cues, symbols, pieces of information to help me construct the broader thesis of what I think may or may not be going on. But what I can objectively say is that it is not supremely quiet still. It is below average volume periods that is not surprising at all. I'm looking at relative volume for five and 20 day periods. And there's no shock. The reason why there's no shock is because there's going to be a massive spike in volume around earnings. That's super normal. Then we have the at the market that obviously is going to contribute to some of this. And then we have the post at the market that obviously is going to contribute to some of the compression being relieved. So now when I look at this, I still see elevated volume and I'm very curious to see where it goes. So Sam Cleman says, what's your price target for your long shares? I don't have one. It's because I'm not really trading the long",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 112,
      "start_timestamp": "00:24:52",
      "start_timestamp_seconds": 1492.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1492"
    }
  },
  {
    "text": "of the compression being relieved. So now when I look at this, I still see elevated volume and I'm very curious to see where it goes. So Sam Cleman says, what's your price target for your long shares? I don't have one. It's because I'm not really trading the long shares. The long shares I've told you guys this a while ago. The long shares that I have on, it's literally just to show some love to the ape community and to move in solidarity with you all. There's another one that I already told you. I also have shares in AMC. And that's again, from a bet that I made on a live stream, literally I think like three years ago or some shit. So for something like, for the GameStop shares, the AMC shares, it's no target. It's literally just shit that I'm holding to show some love. Now in terms of like the trading though, because for me, I trade GameStop with options. I trade most things with options because that's my bread and butter. And I like the way I can construct trades. But right now I am in no specific fashion to do anything with options. I traded a little bit of this breakout that I immediately flattened the next day and the reason and I didn't even catch most of this breakout. I essentially got into on the 20th. I just jumped in when it was breaking above this kind of this volume profile",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 112,
      "start_timestamp": "00:26:17",
      "start_timestamp_seconds": 1577.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1577"
    }
  },
  {
    "text": "options. I traded a little bit of this breakout that I immediately flattened the next day and the reason and I didn't even catch most of this breakout. I essentially got into on the 20th. I just jumped in when it was breaking above this kind of this volume profile right here, this node. So it's like when it was at 20 and a half. And then I got out when it was like 2190, right? So it's like a point and a half move. It really was nothing to write home about. But it's just to essentially gain a little bit of exposure to the movement because I do know that it tends to exhibit some follow through. But right now I'm still just trading primarily short calls against the long shares, which I know some people don't like that. But I'm not going to not say it because it's what I'm doing and I'm going to always keep it a buck with you guys. So yeah, don't say that because I want games stop to go down or anything like that. But it's because I'm a fucking trader. So that's the way that I'm built. So yeah, that's the main thing that I'm doing right now. But yeah, really no price target just yet. The one thing I will flag as well is that we are now firmly into this point of control. And the reason why I think it's important to highlight this point of control is",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 112,
      "start_timestamp": "00:27:16",
      "start_timestamp_seconds": 1636.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1636"
    }
  },
  {
    "text": "the main thing that I'm doing right now. But yeah, really no price target just yet. The one thing I will flag as well is that we are now firmly into this point of control. And the reason why I think it's important to highlight this point of control is because it's actually quite persistent across a few different time frames. So that tells me that there are a lot of transactions happening right around this handle. So we have one point of control on the short term time frame. It's really difficult to see, but there it comes out to here. So that means that there's a lot of volume at that price handle being the 22 handle. And then the next point of control above that is literally right up here around the 25 handle. So there's a ton, a ton of people interested in transacting at these levels. Again, you have seen I've not drawn any new lines on this for a really long time. These are the same lines in terms of support resistance lines as far as I see it. These I actually can take off for the time being because these don't really matter. These are all built off of that squeeze. But I am not drawing any sort of news support resistance. I've kept these the same. This one realistically is going back further. I actually would keep that one closer to there. So I think we can modify that one. And I",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 112,
      "start_timestamp": "00:28:23",
      "start_timestamp_seconds": 1703.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1703"
    }
  },
  {
    "text": "These are all built off of that squeeze. But I am not drawing any sort of news support resistance. I've kept these the same. This one realistically is going back further. I actually would keep that one closer to there. So I think we can modify that one. And I think this represents more or less what I see here. So yeah. Roindt Cleese says, did you DRS your shares? I didn't. It's just held through the brokerage. I do have them turned off for for loaning, but I don't have them. And the main reason is because it's kind of an annoying process to go through just again, keeping it a buck with you. So I keep everything within within the same brokerage platform. So yeah. Roindt, he says he doesn't realize he's one of us. I really appreciate that, but I continue to remind you guys. I don't like the idea of like considering myself in ape because I'm still relatively new to this. Most of you have been along most of my journey with this and I started paying attention to like the story, the background primarily from I would call it may is when I started getting more into it. So I still feel like I'm too new to it. So it doesn't feel right to like because I have a lot of respect for the people that have been following this for a long time. Like every time that I talk to somebody like Newton",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 112,
      "start_timestamp": "00:29:21",
      "start_timestamp_seconds": 1761.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1761"
    }
  },
  {
    "text": "getting more into it. So I still feel like I'm too new to it. So it doesn't feel right to like because I have a lot of respect for the people that have been following this for a long time. Like every time that I talk to somebody like Newton who's been following this thing as close as he has, like I obviously would completely consider him in ape and I think he's like deserved the title, so to speak. But that's the that's the thing. I don't know. I feel weird about trying to take a title that I don't necessarily feel like I deserve or that I've earned yet. Not that it's like, you know, this big prestigious thing, but a lot of it comes from my time in the military, right? Like we we want to earn whatever it is. That's a big part of the psyche. So I definitely am doing my best to like learn about the story, learn about the background. I still literally text with Newton almost every single day to bounce ideas around and to learn a little bit more. But yeah, I still feel like I haven't put in the time yet because there have been people in this thing for four fucking years. Well, three three and change, which is a long time, man. So I still consider myself a bit more of a guest. And it's again, it's more just out of respect than anything. So yeah. Um, generational",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 112,
      "start_timestamp": "00:30:32",
      "start_timestamp_seconds": 1832.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1832"
    }
  },
  {
    "text": "yet because there have been people in this thing for four fucking years. Well, three three and change, which is a long time, man. So I still consider myself a bit more of a guest. And it's again, it's more just out of respect than anything. So yeah. Um, generational capital says, do you sell covered calls? Not covered. I essentially will never sell covered calls. But I always sell calls at a ratio. So yeah, I really like ratio covered calls, but that's essentially what I have on now and game stop. And the reason why I do that is because I don't want to cap my upside. And I'll walk you through again for anybody that's not seen it. I'll always show you this because I think it's super, super important. Um, here. So if I have, let's say, for example, again, this is using my IRA pass through accounts. There's no money in it. It's just blank. This is also going to be regulation T. So, but let's say if I have 25,000 shares of game stop and I'm not going to get rid of these other positions because most of these are the cats, which I'm going to have to go back through. This was an example that I did recently so I can kill these two. So let's say that there's 25,000 shares and let's say the basis is like 19. Now in the trade right now, it's up 86 grand or whatever. Cool. Now,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 112,
      "start_timestamp": "00:31:27",
      "start_timestamp_seconds": 1887.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1887"
    }
  },
  {
    "text": "going to have to go back through. This was an example that I did recently so I can kill these two. So let's say that there's 25,000 shares and let's say the basis is like 19. Now in the trade right now, it's up 86 grand or whatever. Cool. Now, here's the problem. When if I come in here and I sell calls against it. And you'll notice something as I click this button more and more times, you're going to see that that right hand side is going to move further and further down. So if I kind of fast forward our time a little bit and pretend that this is at a one to one ratio. So if I have 25,000 long shares and I sell 250 calls against it, which represents the same size, you'll notice a really, really problem, like a big problem. And it's specifically that the, like we lose our upside profit potential, which I have no interest in doing that. Even though I really have no real game plan to sell the shares again, I've already told you that just being completely honest, it's still just anti the way that I trade. So I'm still going to generally apply the same fundamentals that I would. So in this kind of instance, when I look at something like this instead of doing like 250, if I sell something like 100 calls, well, you'll notice that I get plenty of upside potential still. I'm not",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 112,
      "start_timestamp": "00:32:50",
      "start_timestamp_seconds": 1970.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=1970"
    }
  },
  {
    "text": "I'm still going to generally apply the same fundamentals that I would. So in this kind of instance, when I look at something like this instead of doing like 250, if I sell something like 100 calls, well, you'll notice that I get plenty of upside potential still. I'm not giving up a ton of upside, but then I can still collect a fairly meaningful amount of premium against those options. So that's the general idea here. It allows for a little bit of income generation or just taking in premium when things were going sideways. It helps generate some profit, but I wouldn't want to give up upside, essentially ever. And because here's why this is the entire reason why if we look at this position, guess what? We now have capped profit potential, right? We know how much we can make right from the jump. We are stuck at 138,000 fine. Here's the issue. If we look to the left hand side, we are still taking on the entire downside risk profile, the entire downside risk profile. So what I'm doing is I'm taking the downside risk, but I don't get the profit potential. I don't like that. And it's exactly why I don't typically mess with covered calls at all in anything I trade. It will always be at a ratio and that so that I can appreciate to the upside. It's a big part. And it says, that's what I put say that's hilarious. Steele says,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 112,
      "start_timestamp": "00:34:01",
      "start_timestamp_seconds": 2041.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2041"
    }
  },
  {
    "text": "And it's exactly why I don't typically mess with covered calls at all in anything I trade. It will always be at a ratio and that so that I can appreciate to the upside. It's a big part. And it says, that's what I put say that's hilarious. Steele says, don't worry, you're a GME enthusiast is new and would say, yeah, I think that that's completely fair. I am absolutely a giant enthusiast of GME. The entire, I've told you guys this a million times and I'm always happy to say it again because it's so fucking cool. But I've been trading a long time, right? Like I'm coming up on my 17th year of trading and trading has changed my life. It's why I do the whole YouTube thing. It's not because I belong on a camera. But this is such a curious story, everything about it. And that's why again, if you'll notice at the beginning of the stream when I was talking about the cat, I am beyond infatuated with the way that he does things because it is so anomalous. So it's like I'm looking at something like if I'm looking at nature, that's what this feels like. I'm looking at nature being the stock market. And I'm seeing something that doesn't fit in with anything I've ever seen before. So I can't help but keep looking at it because it's so strange, absolutely super, super strange. So yeah, I think that's a great way",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 112,
      "start_timestamp": "00:35:24",
      "start_timestamp_seconds": 2124.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2124"
    }
  },
  {
    "text": "this feels like. I'm looking at nature being the stock market. And I'm seeing something that doesn't fit in with anything I've ever seen before. So I can't help but keep looking at it because it's so strange, absolutely super, super strange. So yeah, I think that's a great way to, I think that's a great way to frame it. Of Roryntiti says, why do you think so many people haven't left GME? It's not only the squeeze, it's the story definitely. And that's one of the things I love about the apes. I learn a lot from you guys. That's one of the, that's, it's one of the very neat things about this is that what you'll find is there's a lot of things that I think apes generally lack knowledge of and that's not to throw shade, but it is what it is. But there's a lot of very interesting things that apes know an insane amount about. And I get a chance to tap into some of those things over time, which is actually really, really fun for me. I'm a big fan. Willie says thoughts on GME maintaining price above 19 post two sizable dilutions demand. That's exactly what that tells me. And I talked about this before, even when it started catching on this thread down here, the fact that it dropped down to these levels and then continued to get bit up, it tells me that people do absolutely value this thing at a",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 112,
      "start_timestamp": "00:36:30",
      "start_timestamp_seconds": 2190.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2190"
    }
  },
  {
    "text": "That's exactly what that tells me. And I talked about this before, even when it started catching on this thread down here, the fact that it dropped down to these levels and then continued to get bit up, it tells me that people do absolutely value this thing at a certain level. And this is before even when they did that first offering. I think one of the biggest things about the first offering is that provided a absolute exit for a lot of systemically short positions that were able to now access shares relatively easily. And that gave them a big out. But before that, this was being systemically shorted massively. So the fact that in those conditions, it didn't get bit down heavily. It tells me that there's demand for those shares. So yeah, I think without a doubt, the fact that this is continued to hold these handles is really, really important because it starts alluding to what the intrinsic value of the stock might be perceived to be, which is not to be confused with whatever we try to calculate. It's cash value at people. People obviously still value the brand, the intellectual property, which is a really important thing to see that it's not simply being valued at cash. So yeah, for sure, for sure. Dr. Zays says you may be a rookie, but you're like a top five draft pick. Yeah, I am a rookie. I've been looking at again, it's been what? Like",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 112,
      "start_timestamp": "00:37:37",
      "start_timestamp_seconds": 2257.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2257"
    }
  },
  {
    "text": "a really important thing to see that it's not simply being valued at cash. So yeah, for sure, for sure. Dr. Zays says you may be a rookie, but you're like a top five draft pick. Yeah, I am a rookie. I've been looking at again, it's been what? Like four months. I'm very, very new to this. So Christian says guest ape. Yeah, I think I do view myself as a guest. I think that that's fair. Sam says any of y'all watch Jackie to between him, Richard and this, the different perspectives are fascinating. Got it. I don't know anything about Jackie. I've heard some of you mentioned him before, but this goes back to the other thing is like I, and I talked about this on my standard YouTube channel videos and live streams and stuff. Like I don't watch anybody shit because I just kind of do my own thing. I think the main thing is with somebody like Newton, because I don't really catch all of his videos either, but I'll talk with him. And the thing with Newton is like he was unbelievably, unbelievably gracious and useful for me. Like when I'm developing my background understanding of things and like understanding the qualitative components that I'm not so sure about. But yeah, I don't really watch much of anything because most of the time I spend the vast majority of the time like doing what I consider doing work. Like I like to go",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 112,
      "start_timestamp": "00:39:01",
      "start_timestamp_seconds": 2341.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2341"
    }
  },
  {
    "text": "background understanding of things and like understanding the qualitative components that I'm not so sure about. But yeah, I don't really watch much of anything because most of the time I spend the vast majority of the time like doing what I consider doing work. Like I like to go in, look at things for myself. And even when I have conversations with somebody like Newton, the main thing with him is he has a lot of background information, but I still like to go in and validate what I'm seeing. And it's just because I understand how humans perceive things. And again, it's because I've been trading for a long time. I understand all these different cognitive biases, confirmation biases, availability biases, all of these different kinds of things that kind of paint the way that we perceive information, which I guard so heavily against because my entire objective as a trader to be is as objective as humanly possible in the analysis of things. So yeah, I spend so much time doing that personally, but I think that for anybody that watches stuff, obviously I would always 100 recommend Newton. Like Newton, I think you cannot go wrong with because he has so much qualitative background. From a trading perspective, like I don't trade the way he does. I can tell you that for sure. But with like the trading element aside, the amount of information that he has and he's taken the time to build around this",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 112,
      "start_timestamp": "00:40:20",
      "start_timestamp_seconds": 2420.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2420"
    }
  },
  {
    "text": "with because he has so much qualitative background. From a trading perspective, like I don't trade the way he does. I can tell you that for sure. But with like the trading element aside, the amount of information that he has and he's taken the time to build around this thing is like just straight up second to none. I haven't met many other people that have the background that he does. So yeah, I am, I literally am a massive fan of Newton. And anytime anybody asks me about GameStop, I literally always direct them to him because he's the dude. The thing when it comes to like looking at, when it comes to looking at, again, GameStop, I would trust my eyes analyzing the stock and analyzing the options and analyzing the movement over anybody else. And that's not to say that, you know, I'm better than anybody else. It's just I trust my eyes. I trust my experience. But when it comes to taking a look at the breadth of the story, how things have evolved, the characters, I literally called Newton the GME scribe because he is straight up the the scribe that has tracked just about everything about this. So yeah. Dr. Zayas says need to have balanced views. Yeah. And I think that that's one of my favorite things about, that's one of my favorite things about Newton is even when he and I before before he started getting back to work and he's,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 112,
      "start_timestamp": "00:41:36",
      "start_timestamp_seconds": 2496.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2496"
    }
  },
  {
    "text": "about everything about this. So yeah. Dr. Zayas says need to have balanced views. Yeah. And I think that that's one of my favorite things about, that's one of my favorite things about Newton is even when he and I before before he started getting back to work and he's, you know, like super busy now. But before he started getting back to work and all that, when we did a few live streams together, you can see that he and I very frequently would go back and forth, right? Because we have no problem challenging one another's thoughts. And it's obviously out of nothing but deep respect in trying to understand. And I gather that from him from the jump. And I both are literally seeking to understand. And I cannot tell you how much I identify with that because I genuinely do not care very much about whether or not I'm categorically right or wrong. I care about the assumption of information and data. And that's what I care about. If I have, there's a saying I use all the time, strong convictions loosely held. I say that in my trading community all the time. And it's because I think we develop strong convictions by doing a bunch of research. We have really well formulated ideas. They're loosely held in that as soon as there's good information that contradicts or sends us down a different path, I will dump the previous thing that I thought and held in",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 112,
      "start_timestamp": "00:42:54",
      "start_timestamp_seconds": 2574.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2574"
    }
  },
  {
    "text": "I think we develop strong convictions by doing a bunch of research. We have really well formulated ideas. They're loosely held in that as soon as there's good information that contradicts or sends us down a different path, I will dump the previous thing that I thought and held in high regard like a fucking rock to pick up the new thing if they're supporting data. And that's part of why I think I've been successful as a trader is because I have no problem abandoning things because I'm not attaching my identity to these different ideas. The way I look at it is I'm analyzing information. I'm coming up with the best possible assumption I can with this information at a given point in time. And as soon as it changes, I need to change period. It's not a representation of who I am. And as much as financial media and social media, as soon as you flip an idea, most people like, oh my god, he's wishy-washy. And to me, I'm thinking what a dumb way to look at that. Of course, if it comes to things like values, values need to stay adhered to even when it's inconvenient and stuff. That's a completely different conversation. But when it comes to, I have hypothesis about where something might go or the current breadth of information, what that indicates. I'd drop it like a rock as soon as there's better information available. Zero, literally zero attachment to it. Strong",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 112,
      "start_timestamp": "00:44:09",
      "start_timestamp_seconds": 2649.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2649"
    }
  },
  {
    "text": "inconvenient and stuff. That's a completely different conversation. But when it comes to, I have hypothesis about where something might go or the current breadth of information, what that indicates. I'd drop it like a rock as soon as there's better information available. Zero, literally zero attachment to it. Strong convictions loosely held. I think that's the way. Dr. Zayas says, can you give an example of a conviction that you like go of? Absolutely. Easy. The trading of vertical spreads. The first several years that I traded options, we talked about this yesterday during the beginner livestream. The first several years that I traded options, I used vertical spreads. And it's because they balance a lot of things. They're reduced risk because they have capped risk and profit. But you can, they're super capital efficient. You can put a lot of them on and you can create really good probabilistic outcomes where you win a lot. I thought for sure, vertical spreads were the way. And I traded them a lot under that premise. Then I started taking a really close look at the overall trading performance of the systems. And I was noticing as I started logging a little bit into my trading career, I was looking at it and saying, I feel like I'm crushing it with vertical spreads. And the reason why I felt that way is because I would win a lot because there are high probability trades. But for any of the options traders",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 112,
      "start_timestamp": "00:45:18",
      "start_timestamp_seconds": 2718.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2718"
    }
  },
  {
    "text": "little bit into my trading career, I was looking at it and saying, I feel like I'm crushing it with vertical spreads. And the reason why I felt that way is because I would win a lot because there are high probability trades. But for any of the options traders out there, you know there's a giant downside to them. And it's that typically, let's look at an example together really quick. We could look in GameStop. If I do a 1 wide vertical spread and typically you'll get something close to 30 cents for that. The issue here is I'm collecting 30, but I'm risking 70. So do the math. I need more than two wins to overcome every single one loss. So even though I feel like I'm winning all the time because I am, it doesn't fucking matter. Because when I have a handful of losing trades, it wipes out 2.3 times plus my winning trades, not including fees. So as soon as I started taking a really hard look at that, realizing that, yeah, okay, verticals, they have a place. But I was literally like flat. I think I was up a little bit money with them at the end of like several years of trading them. I was like, this is fucking trash. So I had been trading them for several years. And then I literally pivoted. It was over a weekend and I just stopped trading them entirely. So that is an example for",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 112,
      "start_timestamp": "00:46:29",
      "start_timestamp_seconds": 2789.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2789"
    }
  },
  {
    "text": "them at the end of like several years of trading them. I was like, this is fucking trash. So I had been trading them for several years. And then I literally pivoted. It was over a weekend and I just stopped trading them entirely. So that is an example for Dr. Zayas. Can you give an example of a conviction that you like go of? That's a massive one for me because I spent a lot of time fucking with those and it just wasn't really worth the time or effort. Oh, we have a New Zealander fleet haul. Let's see, let's see if we have New Zealand. New Zealand. We don't. Let's get the right spot then. Christ church. Damn, that's like, no fucking, electric there, huh? Christ church. Like, damn. Like real specific and sweet. So now we have New Zealand. That's fantastic. Fleet haul, if you can, whenever you get around to it, find us somebody from Papa New Guinea, would you? Because they're like pretty fucking close and I feel like you can make that happen. And then also it wouldn't hurt for Tasmania. If we can get like a lemur or some shit, that would be kind of cool. And then we got Bangkok Thailand. Is it good to have a Bangkokian? That's beautiful. Okay. Over there. Um, MFN says, do you think the GME option positioning Friday could lead to a ditty party type action next week? So we're going to have to, we're",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 112,
      "start_timestamp": "00:47:50",
      "start_timestamp_seconds": 2870.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2870"
    }
  },
  {
    "text": "be kind of cool. And then we got Bangkok Thailand. Is it good to have a Bangkokian? That's beautiful. Okay. Over there. Um, MFN says, do you think the GME option positioning Friday could lead to a ditty party type action next week? So we're going to have to, we're going to have to really get into the ditty party classification so that I'm on the same page as you. Are we inferring that there's going to be a lot of like roofies and then un really unrequested homosexual activity that's like one directional? Or are we talking about something where there's just like a lot of, are we talking about the P. Diddy parties before or after midnight? Maybe that's the way to, maybe that's what I need to say. So is it, yeah, is it going to be pre midnight ditty party or post midnight ditty party? Because I think that will be the primary differentiator of how we might classify. Because I could see GameStop, GameStop price action being something like, you know, pre midnight ditty, but I do think it becomes a little more dangerous if we're kind of forecasting post midnight ditty party because then that means like shorts are getting fucked pretty bad. And I don't know if I see the conditions for that at least as of right now who knows it can always happen. But I don't see that amount of baby oil in the options as it sits. So yeah, I",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 112,
      "start_timestamp": "00:49:13",
      "start_timestamp_seconds": 2953.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=2953"
    }
  },
  {
    "text": "that means like shorts are getting fucked pretty bad. And I don't know if I see the conditions for that at least as of right now who knows it can always happen. But I don't see that amount of baby oil in the options as it sits. So yeah, I think I could see pre midnight, a little bit of action, some surprise, some half advances. I think we could see the really awkward moment where you bring like your hot girlfriend or your wife and you think ditty is trying to take your girl, but then you realize like ditty is trying to take you, right? That's like a different kind of fear. I think that would be part of that pre midnight thing. And then I think the post midnight is when the doors are locked and you're trying to find a fucking window to get out and ditty now has baby oil everywhere that I don't think we're at that point yet. I think the shorts felt that previously, but I don't know if they're going to be quite at that point in the near future. So yeah, Roryntady says he did some horrible shit to women. He did. He beat the shit out of that one woman. I saw it. I think it was him in the lobby of the hotel. I'm absolutely not saying that he yes, yes. I think the main thing I'm just highlighting is that it's a strange, it's a strange happen",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 112,
      "start_timestamp": "00:50:51",
      "start_timestamp_seconds": 3051.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3051"
    }
  },
  {
    "text": "He did. He beat the shit out of that one woman. I saw it. I think it was him in the lobby of the hotel. I'm absolutely not saying that he yes, yes. I think the main thing I'm just highlighting is that it's a strange, it's a strange happen stance when most guys are slightly insecure. You have a really hot wife or something or a girlfriend typically because it's not that committed yet and you're like, yo, I want to show my girlfriend off. But it's like, you know, all these guys are like trying to hit on her. That gets a little old. And I think that moment that you realize that like ditty actually isn't interested in the girlfriend is like more interested in you. I think that's terrifying because then it's it almost primes your brain where it's like, wait a minute, like maybe like my girlfriend, right? I almost would prefer that that is really a masculine insecure. But I think the process of like ditty targeting me would be like real terrifying. So yeah, I mean, he felt comfortable. I saw a clip where he was like touching Mike Tyson's leg. That's a different level of comfort. Like completely a very different level of comfort. And then Mike Tyson like moved his hand and ditty didn't even, he didn't care. So it's like, that's a that's a different level of comfort, I would say. Yeah. So yeah, let me know if that answers",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 112,
      "start_timestamp": "00:52:01",
      "start_timestamp_seconds": 3121.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3121"
    }
  },
  {
    "text": "different level of comfort. Like completely a very different level of comfort. And then Mike Tyson like moved his hand and ditty didn't even, he didn't care. So it's like, that's a that's a different level of comfort, I would say. Yeah. So yeah, let me know if that answers the question because I wanted to make sure that we got to the bottom. I always want to seek first to understand, to understand again, the quality that we were referring to. And then I think we're there. James says, when you say you sell calls out a ratio, what does that mean? I gave an example. What? James, I gave literally a straight up example. Did you not see the example? James, we did this. Don't do this to me. James, you bastard. I'll show you. I'll show you just because I'm a nice guy. So in short, the way that the ratio would work is we would have a certain number of shares. And then when we sell a call against those shares, we would sell less calls than the number of shares we have is all. So the way to think about it is essentially you just need over 100 shares. Because the fewest number of calls you can sell is one, right? You can't sell a half a call. And each one short call represents up to 100 shares of the underlying. So in that context, as long as I have literally 101 share, I now",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 112,
      "start_timestamp": "00:53:17",
      "start_timestamp_seconds": 3197.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3197"
    }
  },
  {
    "text": "need over 100 shares. Because the fewest number of calls you can sell is one, right? You can't sell a half a call. And each one short call represents up to 100 shares of the underlying. So in that context, as long as I have literally 101 share, I now have unlimited profit potential. Now obviously, in this case, I would have 100 of the shares covered in only one uncovered share. So it's not really what I would want. Right? So ideally, it would be at least something like 150 shares. So now you have 100 shares that are covered. And then you have 50 shares that are uncovered. But the idea in general is to strike a balance depending on what you want to see happen. But most of the time, like in this example, I wouldn't sell a call against it unless I had something like at least 500 shares. Because the main thing is I don't want to sacrifice the profit potential. So I want to sell calls at a very light ratio against the longs, maybe one, maybe two, here definitely no more than two. So yeah, the idea is to try to make sure you're not capping your upside and you give yourself the biggest ability to take advantage of the upside when it happens. So that goes back into having like a really, really solid plan about how you're going to manage the trade as it gets there. Because that's one of the",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 112,
      "start_timestamp": "00:54:43",
      "start_timestamp_seconds": 3283.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3283"
    }
  },
  {
    "text": "you're not capping your upside and you give yourself the biggest ability to take advantage of the upside when it happens. So that goes back into having like a really, really solid plan about how you're going to manage the trade as it gets there. Because that's one of the things I actually have a video coming out next week and next Saturday that's about trading meme stocks with options. And I've made a couple videos really geared more so more so towards the ape community to try to help frame using derivatives in order to make like better trade decisions. So yeah, that video will come out and it'll talk about some of these things, but a big part is having a solid exit plan, which I actually think the majority that I find of apes, they actually tend to not, which always breaks my heart to a degree because the reason why it breaks my heart is like you don't make any money without an exit plan. Like if there's not a way to book profit, then the only thing we do is watch something in show profit and then profit goes away. And then it was there, but now it's gone with nothing really to show for it. So yeah, it's always a little bit of a bummer when I see that. H says what's an exit strategy is an arcade quote. Yeah, we saw that actually in here when we were looking at this stuff, we",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 112,
      "start_timestamp": "00:56:03",
      "start_timestamp_seconds": 3363.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3363"
    }
  },
  {
    "text": "but now it's gone with nothing really to show for it. So yeah, it's always a little bit of a bummer when I see that. H says what's an exit strategy is an arcade quote. Yeah, we saw that actually in here when we were looking at this stuff, we saw him say that. Again, the problem there is that he has an exit strategy and he's used it a lot because you like I can see him building the account by booking wins. So he absolutely has an exit strategy. There's absolutely no literally no debate about it. He joked as if he doesn't because I would make the same exact joke just like I would make the joke of no matter what I do, the stock market does the opposite. That's obviously not the case, right? Because I'm fortunate I make a good bit of money trading. So it's like I make that joke because it's funny, but it doesn't actually represent what I'm doing is the same thing here. Like him joking that he doesn't have an exit plan is literally just a troll comment because he's having fun with people, I think. Sedrick says with options, you have to shares is different. It's not like it's not different. That's the problem is when we look at let's take a look at this together really quick. If and we'll go into on demand, we'll start getting a set up to go through the catch trades because we're",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 112,
      "start_timestamp": "00:57:12",
      "start_timestamp_seconds": 3432.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3432"
    }
  },
  {
    "text": "you have to shares is different. It's not like it's not different. That's the problem is when we look at let's take a look at this together really quick. If and we'll go into on demand, we'll start getting a set up to go through the catch trades because we're here. So let's go back to 2021 and we need to be in February. And it looks like February is his first update. So we'll go somewhere around here and I'll show you. So with GameStop, if you, I don't know what it's doing here. I don't know if this is actually what happened if it actually went to this or if this is just on demand. Did it actually do this on the first of Feb? Is that right? The crazy part is is I don't know. Yeah, so it looks like it did. It looks like the last price was 225. So it looks like it actually did do this, which is fucking nuts. So yeah, so here, for example, this is a hilariously well timed example. But first thing I want to show you, the very first thing I want to show you is the same thing I see every single time before squeeze every single time. I've looked at all of them. Volume is up massively, not trivially. But a little bit volume is up when I'm trading the movements in GameStop. This is what I look at because I will always reiterate this point. GameStop",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 112,
      "start_timestamp": "00:58:25",
      "start_timestamp_seconds": 3505.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3505"
    }
  },
  {
    "text": "I see every single time before squeeze every single time. I've looked at all of them. Volume is up massively, not trivially. But a little bit volume is up when I'm trading the movements in GameStop. This is what I look at because I will always reiterate this point. GameStop does not follow standard technical analysis. Of course it does to a degree. I want to be very clear. That doesn't mean that like your standard rules apply not at all, right? Most people I notice when I say things, they take the null, meaning the inverse, but I don't often mean the inverse. I mean a middle ground. So what I mean by that is for something like GameStop, let's say before this price move and started happening, I had support or resistance flagged at 3850 for whatever reason. A lot of times other stocks that move more normally will hit a line of resistance, can always go through it. But it'll typically bounce around it for a little bit until we see if demand or supply is going to win out. If demand does, it'll go back up through. But there's normally a little bit of contention. And I can show you that in just about every other stock, other than things that are primed for squeezes. The problem when you're looking at something that is essentially squeeze prone like this, is it's a completely different rule set. And I've talked to you all about this now because",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 112,
      "start_timestamp": "00:59:38",
      "start_timestamp_seconds": 3578.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3578"
    }
  },
  {
    "text": "I can show you that in just about every other stock, other than things that are primed for squeezes. The problem when you're looking at something that is essentially squeeze prone like this, is it's a completely different rule set. And I've talked to you all about this now because I started kind of looking at the overall amount of analysis that I've done, right? Because I typically quantify things. I want to know what I'm doing. Even with like the herniated disc bullshit that I have, I started looking at it and I've like 34 hours of research just into reading books, studies, podcasts, learning about the back because right now I've a fucking up herniated disc that I'm learning about. So with GameStop, it's literally light years past that at this point, right? Like it's hundreds of hours that I've spent looking at it, studying not just GameStop, but squeezes, the behavior of squeezes. And it does not, it does not attribute well to standard technical analysis. Like if somebody drew a Fibonacci extension on this, I literally couldn't care less. I couldn't possibly care less. It doesn't, it doesn't mean anything here. If it gives a trader ideas and it's useful to them, beautiful. I love that. Do whatever works for you. But what I can tell you is that as soon as there's some sort of condition that causes a movement of price, fuck your Fibonacci's. Fuck the resistance that you think is there. Right now",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 112,
      "start_timestamp": "01:01:00",
      "start_timestamp_seconds": 3660.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3660"
    }
  },
  {
    "text": "ideas and it's useful to them, beautiful. I love that. Do whatever works for you. But what I can tell you is that as soon as there's some sort of condition that causes a movement of price, fuck your Fibonacci's. Fuck the resistance that you think is there. Right now in this case, GameStop is up at 322. That is not because the structural business, the valuation of GameStop has now changed. And it's at 322 because of that. It happened specifically because of structural constraints that break standard price rule sets. So that's why when you're doing things like technical analysis in something like GameStop, you have to pay attention to the profit mechanisms in the signals that correspond with the profit mechanism. In this case of a squeeze, they are highly unique. They exhibit defined behavior that I've already quantified for you to a degree. The video that's going to come out actually next weekend goes into way more of the quantifiable behaviors. But the punch line is when you're looking at something like this, you have to understand how it behaves and then tailor your analysis to how it behaves. And again, one of the things I can definitively tell you, most people know that I don't speak in absolutes. But this is an absolute before every single squeeze I've seen with GameStop before the squeeze happens, there is a massive expansion and volume every single time. Now that does not mean, again, don't take the know",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 112,
      "start_timestamp": "01:02:11",
      "start_timestamp_seconds": 3731.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3731"
    }
  },
  {
    "text": "can definitively tell you, most people know that I don't speak in absolutes. But this is an absolute before every single squeeze I've seen with GameStop before the squeeze happens, there is a massive expansion and volume every single time. Now that does not mean, again, don't take the know of what I'm saying to infer that every single time there's an expansion and volume, it equals a squeeze because it does not, right? I can show you right here. Volume here at this point went from 50 mil to 127 mil. There was no squeeze here. I can show you another time back here. Volume went from 13.2 mil to 305 mil. There was no squeeze here. So it does not mean every time you see a massive expansion in volume, it equals a squeeze. But I can tell you before every single squeeze, there is an expansion and volume. Really important trait to be aware of. Because when I'm structuring trades, that's the exact kind of thing I'm personally looking for. It gives me a ton of clarity around what to look at and when to look. So going back to the exit plan part of this is if you have stock, which I think was Cedric was saying that if it's different with stock or did I fuck that up and did I say that that was somebody else? Hold on. There we go. Cedric. So Cedric says with options, you have to have a exit plan",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 112,
      "start_timestamp": "01:03:32",
      "start_timestamp_seconds": 3812.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3812"
    }
  },
  {
    "text": "if you have stock, which I think was Cedric was saying that if it's different with stock or did I fuck that up and did I say that that was somebody else? Hold on. There we go. Cedric. So Cedric says with options, you have to have a exit plan shares is different. The reason why shares is not different is that if I'm holding shares that I got here at 5.33 and GameStop is trading anywhere in here trading at 88 trading at 322, the difference is if I don't have an exit plan for a certain price move, then even though if I bought, let's take a look. If I bought, this is old examples. I'll leave that to working only. Let's say that I bought 100 shares at three bucks. We got in early. We got in the elevator early. We have 100 shares. On that 100 shares at this point, I'm up 30 grand. Nice big profit. Super, super, super big fan. Great. That's what if you don't book that profit or some of that profit or set a stop for that profit or do anything to secure that profit as soon as GameStop comes back down, which it will, I guarantee it. That is another trait of squeezes a preamble to the video that's going to come out next week is that it always comes back down in price. It's because of the function that leads to a squeeze. It's how they behave. It is",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 112,
      "start_timestamp": "01:04:56",
      "start_timestamp_seconds": 3896.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3896"
    }
  },
  {
    "text": "down, which it will, I guarantee it. That is another trait of squeezes a preamble to the video that's going to come out next week is that it always comes back down in price. It's because of the function that leads to a squeeze. It's how they behave. It is a structural irregularity that leads to the price movement. That's why the move is not sustained because as soon as the underlying conditions abate, price will return to its nominal level, whatever that is. So if we're trading a squeeze and we hold it while it's up, that's sick. If we continue holding and do nothing, it's going to come back down. And then what? You're holding a trade here that you had 100 shares that was up 30 grand. And then as it comes back down to whatever it's nominal prices, let's say it comes back down to like 15, well, now you have something that's worth a grand. Big problem. We've just made a massive mistake because another thing traders do is forget that you can always reenter a trade. So for me, if I was trading GameStop with shares for squeezes, I don't do that. I prefer options. But if I was using shares, what I would do is set profit targets based on different levels that I would scale out as it hit these different levels. Then as soon as GameStop finishes its squeeze because again, it's going to. Anything that squeezes is going to finish",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 112,
      "start_timestamp": "01:06:17",
      "start_timestamp_seconds": 3977.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=3977"
    }
  },
  {
    "text": "options. But if I was using shares, what I would do is set profit targets based on different levels that I would scale out as it hit these different levels. Then as soon as GameStop finishes its squeeze because again, it's going to. Anything that squeezes is going to finish at some point and return to some sort of nominal level. It's going to happen. And then when it comes back down to whatever that nominal level is, I can just buy again. I can just buy more shares. But traders are so linear in their thought process that they think like once they're out, the trade's done and they just move on. And it's so silly because you've done all this due diligence. You have all this research. You have this conviction. You have something you like. If nothing else has changed other than this temporary price movement because we know it's temporary because we studied the profit mechanism as soon as that abates, we just get back in as long as nothing else has changed. So yes, you absolutely need to have an exit plan whether you hold shares or if you hold options because otherwise you're just going to watch the value of your account look really beautiful. But then you're not going to hold any of the money. It's going to go away, which is a giant problem. And this is exactly why I can tell you this is not what Roaring Kitty does because the",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 112,
      "start_timestamp": "01:07:54",
      "start_timestamp_seconds": 4074.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4074"
    }
  },
  {
    "text": "going to watch the value of your account look really beautiful. But then you're not going to hold any of the money. It's going to go away, which is a giant problem. And this is exactly why I can tell you this is not what Roaring Kitty does because the account shows obviously selling positions for gains, but it also shows capital appreciation within the account. You cannot do that if you hold something as it goes up them back down. You have to take exits. So great question though. Love that one. I got to do a switch over and I got to get into my watermelon. We're probably going to have to grab a mango orange in a little bit as a replacement. Oh, damn, give me one second. I just spilled some. Cool. How about that? Hmm. Watermelon, seltzer, water is the way. Okay. So are we all caught up? Generational capital says you should start a squeeze watch list. I mean, I inherently do by the way that I scan markets. So I mean, for me, it's kind of, yeah, it's something that I typically pick up on when it happens. All of them obviously, but squeezes for me a much smaller part of the way that I trade. It's a much smaller part of the overall book. But all right, let's move this here. Let's grab our little tracker and we got some work to do. That Lauren says I've held all the way up",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 112,
      "start_timestamp": "01:09:04",
      "start_timestamp_seconds": 4144.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4144"
    }
  },
  {
    "text": "squeezes for me a much smaller part of the way that I trade. It's a much smaller part of the overall book. But all right, let's move this here. Let's grab our little tracker and we got some work to do. That Lauren says I've held all the way up and all the way down like four times now. This time I do have an extra strategy and a re-enter strategy. I'm not playing this time. That's good. That's exactly what you make the fucking money. That's like make the fucking money. Then if you could have made more money, we call that a high class problem in trading. If you've made money and you could have made more money, high class problem, low class problem is you made money then didn't make money. That's a low class problem because if you not made fucking money, make the fucking money. I love that plan Lauren. That's exactly correct. It is absolutely correct. Could not, I literally could not possibly agree more with you there. All right. So let's take a look. We did 29 Jan. So now we are here in one Feb. Let's get into it. So one Feb. 21. We already know shit is going crazy. So the total gain that we're seeing is 21, 22, 25, 0, 8.63. The cash in the account is 13 million, 817, 295.47. And then the value of the account is now 35 million, 794, 795.47. Okay. So now anything change. I",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 112,
      "start_timestamp": "01:10:47",
      "start_timestamp_seconds": 4247.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4247"
    }
  },
  {
    "text": "21. We already know shit is going crazy. So the total gain that we're seeing is 21, 22, 25, 0, 8.63. The cash in the account is 13 million, 817, 295.47. And then the value of the account is now 35 million, 794, 795.47. Okay. So now anything change. I see we're still holding the 16 April 2112 call. So no change here. And he's had this for a little while now. And he has 50,000 shares, which let me double check where you was at here, 50,000. So same, same shares. And here he has still the same 500. So he's holding 500 of those 16 April 12 calls. And now 16 April 21. Now the date is one Feb, 21. I'm just tracking the DTE because this is one of the things I'm trying to identify. So 74 DTE remaining. One of the things I'm very curious about is what's the exiting behavior around these different time frames. So that's where I'm keeping eye on. Roy and Clity says, wow, I think I was just called low class. Well, I didn't call you low class. But if you did that, you do have a low class problem. That's true. You don't have to worry about what you're going to do with the money you made because you didn't make any fucking money. You don't have to worry about how much more you could have made because you didn't make any fucking money. So yeah, I agree. Those are",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 112,
      "start_timestamp": "01:12:10",
      "start_timestamp_seconds": 4330.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4330"
    }
  },
  {
    "text": "true. You don't have to worry about what you're going to do with the money you made because you didn't make any fucking money. You don't have to worry about how much more you could have made because you didn't make any fucking money. So yeah, I agree. Those are like general low class problems. Yeah, but you're not low class. I don't think so at all. Semicristen says a little voice is whispering that this data could be extracted with AI and put in Excel. So we can just start the analysis point. Just a little voice. It actually couldn't not well. And I wouldn't trust it. So for Semicristen, if you want, you could absolutely do that for sure, 100. But yeah, I think that you're going to miss a ton, a ton of detail. One click, he says, what if I did it so many times now, it's my identity. That's the cool part. That is literally the cool part. You can always, always change your identity totally up to you. There's no imperative at any point in your life. You get to decide who you are, what you value, what you're about. And you've already told me before earlier in this chat that you have a different fucking plan. So you now are not getting ready to deal with low class problems. You've already outlined a plan to deal with a high class problem. So I offer to you, you've already changed your identity by developing",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 112,
      "start_timestamp": "01:14:01",
      "start_timestamp_seconds": 4441.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4441"
    }
  },
  {
    "text": "me before earlier in this chat that you have a different fucking plan. So you now are not getting ready to deal with low class problems. You've already outlined a plan to deal with a high class problem. So I offer to you, you've already changed your identity by developing that plan. And then the next time we get a big squeeze, we're going to be talking about what to do with your high class problem, which I eagerly await. Those are the fun ones in general. So take that, Roryn Clity says, hi, I think that was someone else. Oh, I think it might have been that Lauren. Well, just you two, do the same thing. Do that same exact thing. Okay. So no other change here. Let's move on to two, two, two, two, two, two, one. And we have total gain seven. This is an important day. I can already tell you seven, five, nine, eight, seven, five, eight, got six, three. This is a very interesting day, which I'm going to talk to you about in a minute. Full cache is about the same. So 13, eight, one, seven, five, six, seven, got six, two. And then value is 22, one, seven, one, three, one, seven, got six, two. Okay. So this is an important day. Why do you think that this is an important day in my opinion? There's a few things that I see here that are really, really important to me. And then",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 112,
      "start_timestamp": "01:15:17",
      "start_timestamp_seconds": 4517.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4517"
    }
  },
  {
    "text": "then value is 22, one, seven, one, three, one, seven, got six, two. Okay. So this is an important day. Why do you think that this is an important day in my opinion? There's a few things that I see here that are really, really important to me. And then give me one second. I'm going to let the dog out and grab another mingle orange. All right. So here's, here's the main thing that I see. And I look at the price movement between these two days. And I look at the overall gain that he had, not so much on the shares, but on these options. It's actually really, really important to note the difference between these, right? So in this case, he was up 10.7 mil. The end of Jan, he was up 15.96 mil. From here, he was up nine. So this goes back into the entire thesis that I have with respect to how he trades his options, which is kind of the inverse so far of what I've talked to you all about in terms of having an exit strategy, because the exit strategy here is not based on price. Now again, I'm not saying that he doesn't have one. He clearly does. But what I've have seen a few times is because when I look at the way that he holds these options is a lot of times, he takes them in pretty close in time, but not always. So we have a",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 112,
      "start_timestamp": "01:16:45",
      "start_timestamp_seconds": 4605.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4605"
    }
  },
  {
    "text": "saying that he doesn't have one. He clearly does. But what I've have seen a few times is because when I look at the way that he holds these options is a lot of times, he takes them in pretty close in time, but not always. So we have a couple areas that I really need to go back once we finish going through all of these to dissect more in detail. Because here, for example, that he got out of the 15 Jan 21s, the 17s and the 15s, but he kept the 10s and 20s all the way in until like 10 DT. And then he took the others ones in at one DT, right? That's actually funny enough. It's a very clear identifier to me that this is actually not a straight up solidified plan at all. This is something that's kind of being worked out as we go, which is interesting. Now, for those that don't know, I don't really care about eating that much, but I do need some calories. So I'm going to have this little pouch thing. It's 180 calories and it is 12 grams of protein. It's apple, sweet potato, banana, almond, butter, collagen, and lion's mane. And it will take me just a second to get down. It's pretty quick. And then that's it. Boom. Yeah. I know, it's gonna be pretty quick. But I don't have to worry about it. There's no chewing, there's no fuss, done and done. Hot",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 112,
      "start_timestamp": "01:19:51",
      "start_timestamp_seconds": 4791.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4791"
    }
  },
  {
    "text": "butter, collagen, and lion's mane. And it will take me just a second to get down. It's pretty quick. And then that's it. Boom. Yeah. I know, it's gonna be pretty quick. But I don't have to worry about it. There's no chewing, there's no fuss, done and done. Hot and hydrason does it taste good. I like it. I think it tastes okay. I think the I'll tell you the flavor. The flavor is apple pie. I don't know that I would call it apple pie. Like I don't think it actually tastes like that to be completely honest. But yeah, it tastes fine enough. I'm very much a utilitarian feeder, so I do not care at all. about, well, that's a lie. I mean, obviously I like good food, but I don't care that much. Like, if there was a way for me to have like a pill that could nourish me fully and never have to eat, I would pick that. I'm not a foodie by any means, like even a little bit. Doctors A says, what's it called? It's called re-up. I get them off Amazon. Long Swazie says, my son likes these as well. The funny thing is, is like, before I found these ones, which is like the adult version, I literally would have the baby food version, which is always hilarious, because I would be everybody would think, like, oh, you know, we're grabbing it for our baby, which we don't have one.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 112,
      "start_timestamp": "01:20:58",
      "start_timestamp_seconds": 4858.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4858"
    }
  },
  {
    "text": "funny thing is, is like, before I found these ones, which is like the adult version, I literally would have the baby food version, which is always hilarious, because I would be everybody would think, like, oh, you know, we're grabbing it for our baby, which we don't have one. I'm the baby. And the running joke was that if we have kids that I'm going to be fighting the kids for their little, for the baby food pouches, because I like them too. And I'm bigger than them. So they're going to have to figure that out. That's going to be difficult, I think. So yeah. That's the main thing I see here. The fact that he had this position that literally was up 15 million. And then now it's up only, only 3.8 million. So this goes back into highlighting the risk tolerance, what he's looking for. And it highlights a lot of the mindset that he's using here that again, I find very, very interesting. So this I find interesting as well, that he forecasted when he's backing off the daily updates. I think he started them for a little while, but he like went before he was doing like weekly updates. So we'll see what he goes to from here. So this is three Feb 21. And looks like no change. So total gain is seven, eight, five, three, zero, zero eight, dot six, three. Get this out of the way. And then cash, 13, eight,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 112,
      "start_timestamp": "01:22:14",
      "start_timestamp_seconds": 4934.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=4934"
    }
  },
  {
    "text": "was doing like weekly updates. So we'll see what he goes to from here. So this is three Feb 21. And looks like no change. So total gain is seven, eight, five, three, zero, zero eight, dot six, three. Get this out of the way. And then cash, 13, eight, one, seven, five, six, seven, got 62. And then value 22, 425, five, six, seven, got six, two. Okay. So same, same, no change. He's another day in on these options, 72, DTE. Easy update. Gladamere says he already sold 500 of those April 16 calls. Yes, he did it at two different points. We already know this. So he did it first on 25 Jan, he took 200 down. And then on the 27th of Jan, he took 300 down. So yep, we know that down here 19 Feb 21, 19 Feb 21. Now we are at we are down to 2825. That's nuts. That's absolutely nuts. 2825, 130, dot six, four. That's nuts. Passes moved a little bit. So 11, eight, eight, two, seven, oh, two, dot seven, one. And then value is at 17, 397, 952, dot seven, one. And knew it. So he pulled money out of the account here. He pulled a non-trivial amount of money out of the account. He pulled a few million dollars out of the account. Very interesting. And he doubled his shares. So now he added. So he's still holding these. Please have 71 DTE. And then added, let me",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 112,
      "start_timestamp": "01:23:23",
      "start_timestamp_seconds": 5003.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5003"
    }
  },
  {
    "text": "of the account here. He pulled a non-trivial amount of money out of the account. He pulled a few million dollars out of the account. Very interesting. And he doubled his shares. So now he added. So he's still holding these. Please have 71 DTE. And then added, let me come over here. Added 50 K shares. Let me take a look. What was his prior cost basis? So prior basis here was 14, eight, nine, four, seven, eight, nine, four, seven. And then now we have 100,000 shares at 26, seven, nine, eight, six. And now I'm seeing what he added his basis at. I'm going to have a see. So it looks like he added the basis at 387025, 7025. Interesting. Okay. So now we have end of update, 26, Feb, 26 Feb, 21. And by Feb, I obviously mean Feb. I say we go through Feb and then we'll see how many more there are. Like we'll do like a few more and then we'll get into some tinfoil hats stuff if you guys still want. Because these ones should go pretty quick, I think. Total gain now is 11, 952. 630.640. The cash in the account now is stable, at 1188257.9.21. And then the value of the portfolio is at 26, 525. 329.2.1. And 11952. There looks like a slight rounding error here, but not bad. Yeah. Yeah. Hot nitrogen says, why don't you put the dates in a format, sheets understands would be easier to",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 112,
      "start_timestamp": "01:25:23",
      "start_timestamp_seconds": 5123.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5123"
    }
  },
  {
    "text": "now is stable, at 1188257.9.21. And then the value of the portfolio is at 26, 525. 329.2.1. And 11952. There looks like a slight rounding error here, but not bad. Yeah. Yeah. Hot nitrogen says, why don't you put the dates in a format, sheets understands would be easier to manipulate data later if you wanted. Because well, one, these are dated how I want. These I can just parse out pretty easily. The really the entire purpose of this part of the analysis literally is just to get a fingerprint for his trading. That's like the entire objective. So I already have like other sheets that have already pulled all of his all of this stuff out. But I want I literally want to go through line by line and look at it. It's the same thing when I look at a lot of people are really shocked that like as a professional trader, well, a professional retail trader, whatever you want to call it full-time trader, that I still actually largely prefer to manually input my own trades. Like I still physically type them in versus automating it, which is not hard to do. And it's an entire it's like it's literally based on an entire preference. So yeah, that's generally why here at least. So he's still holding these. And now it's 26 fab 21 26 21. So now we have 49 DTE. So now these are starting to get to a point where something may or",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 112,
      "start_timestamp": "01:28:24",
      "start_timestamp_seconds": 5304.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5304"
    }
  },
  {
    "text": "it's like it's literally based on an entire preference. So yeah, that's generally why here at least. So he's still holding these. And now it's 26 fab 21 26 21. So now we have 49 DTE. So now these are starting to get to a point where something may or may not have to happen at some point in here. These are other just scratches where I figured out the price of his other stock purchases. I'll move this up here. What's out of the way? And then here we go. So now we have eight March. Eight March 21. And now little gain is 25. So he's up massively again 25 816 130.64. The cash and the account is about the same. So 11882936.46. And then the value here is 40. 389.286.46. So slight deviation in these. This looks like just extra interest earned. Something like that. It doesn't look like much. And we're still holding these. So this is now eight March. Eight March 21. And now we have 3090. So again, this goes back to what we were talking about before, which is still very very very very much looks like. He's managing these not based on some sort of profit target that I don't see. Interesting. Okay. So then let's go to 23 March. Oh, yeah, we're flying now. No change to position size. Total gain here is 2391 to 2380.64. Cash on hand is 11882812.96. And then value is 38.485. 312. Got it. 96. Okay.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 112,
      "start_timestamp": "01:30:00",
      "start_timestamp_seconds": 5400.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5400"
    }
  },
  {
    "text": "some sort of profit target that I don't see. Interesting. Okay. So then let's go to 23 March. Oh, yeah, we're flying now. No change to position size. Total gain here is 2391 to 2380.64. Cash on hand is 11882812.96. And then value is 38.485. 312. Got it. 96. Okay. So he's still locked in there. And now the date is 23 March 21. And now we have 24 DTE. So it's now I'm kind of getting excited because it's coming up on. He's going to have to do something with these options soon. And I'm actually quite eager to see when. Yeah, when this happens. The other thing. The other thing that I find really interesting. For 101. 40. 92. Interesting. So he does why like why does he do this? So now he does like a couple on a row 24 March 21. I haven't really been able to figure out this. Like the posting pattern. It's like erratic. And the one thing I see it's like when it's making more money, he posts more. I can. I can clearly see that. And then it's almost as like as he's losing money. And then 24 March 21. Okay, total gain is 14. 805. 130. Got six four. Cash 1188. Two 812. That's six. And then value is 29. 378. 062. That nine six. Okay, we're still holding these. Which are now more DTEs. So 23 DTE. Now the good part here is that these are so far. These",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 112,
      "start_timestamp": "01:32:00",
      "start_timestamp_seconds": 5520.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5520"
    }
  },
  {
    "text": "total gain is 14. 805. 130. Got six four. Cash 1188. Two 812. That's six. And then value is 29. 378. 062. That nine six. Okay, we're still holding these. Which are now more DTEs. So 23 DTE. Now the good part here is that these are so far. These are so far in the money that there's no love lost to hold these at these point. Because with the underlying trading at 120 or you know over 100, these are like so so far in the money. And then here 31 March 31 March 21. Rolling TDCs you got to look at the events. Not just the numbers. Yeah, tell me that's why we're doing this on the live stream. So you guys tell me what was going on on these days. Because that's something we can definitely take a look at together. Because again, that's why I'm tracking the the dates in between these. Is because it like I can see clear tendencies between the posting frequency, right? So here we're up a million dollars. Then we get a post two days after up three. Then we get a post afterwards up 3.9. Then essentially it started going static. So nothing happened. We're up 3.9. Then three days later we're up 7.9. Then a day after that we're up a point two. Then we double. So it's a day after that. Then we double again. So it's a day after that. We cut in half. So we get",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 112,
      "start_timestamp": "01:34:44",
      "start_timestamp_seconds": 5684.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5684"
    }
  },
  {
    "text": "static. So nothing happened. We're up 3.9. Then three days later we're up 7.9. Then a day after that we're up a point two. Then we double. So it's a day after that. Then we double again. So it's a day after that. We cut in half. So we get it a day after that. Doubles again. It's a day after that. So like here it's like clearly very exciting. Then we get two days in a row where it's at 7.6 mil. And then it goes dark. And then as soon as we have this 2.8 mil update on the 16th, seven days later we get one that's at 12 mil. And he goes back to this kind of standard cadence almost. Where but then again here we go from 23 mil to 14 mil. And now we're getting another update on 31 March a week later. So really, really interesting. Total gain here on 31 March is 25231. 880.640. And then cash is 11882911.02. And then total is 39804. 911. That's 02. And we are still holding these. And now it is 31 March. Which gives us 16 DTE. 4. So we testified to Congress on the 18th. Yeah, and then he posted right. Yeah, so I don't think there's a good chance that this in here. I don't know when he got. Do you guys know what was he deposed? Did he have to testify or did he choose to testify? Do you guys know the answer",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 112,
      "start_timestamp": "01:36:27",
      "start_timestamp_seconds": 5787.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5787"
    }
  },
  {
    "text": "Yeah, and then he posted right. Yeah, so I don't think there's a good chance that this in here. I don't know when he got. Do you guys know what was he deposed? Did he have to testify or did he choose to testify? Do you guys know the answer to that? Because I do not. And I think that would actually be an interesting data point because that would also inform some of his posts, I think. Then we have 1 April. 1 APR. 21. Oops, 1 APR. And total gain here is 25403. 630. Got. 640. Ash 11882. 979. Got 98. Value 39. 976. 729. 9A. Oops. This looks like a slight rounding error, so it looks about the same. And everything else is the same. So now we have it on 1 April 21. Which is 15 DTE still no change. And now as options are sitting at 9 mil gain. So. And they're coming in on time. There's still so far in the money that he doesn't really lose much by holding them. So he's not like bleeding a bunch of theta. So I don't think he cares so much about like theta to care optimizing for that at all. Willie says what's RK strategy so far? Anything noteworthy. I think it's two things. It's. It's definitely obviously playing the appreciation of GameStop. The parts that can found me is that. I don't think. The cat actually thought GameStop would be worth 200 in like a",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 112,
      "start_timestamp": "01:38:01",
      "start_timestamp_seconds": 5881.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=5881"
    }
  },
  {
    "text": "for that at all. Willie says what's RK strategy so far? Anything noteworthy. I think it's two things. It's. It's definitely obviously playing the appreciation of GameStop. The parts that can found me is that. I don't think. The cat actually thought GameStop would be worth 200 in like a natural valuation or over 200. Like I don't actually think he thinks that because he's a value investor, he knows better. So one of the things I find really interesting is that he continues to hold some of these positions as they're ebbing and flowing at these much higher price levels. And he's just kind of like seemingly holding. And that is really interesting because again, part of the game is understanding the profit mechanism of what you're trading. So here again, he's smart. So he knows what he's doing. And he knows that a squeeze doesn't materially change the value of a company. So as it's going through a squeeze, I know that he knows that this is a temporary thing. So with that as the case, I think a big part of what he's doing here, at least seemingly, oh fuck, I messed this up. Hold on, sorry. This one's 15 DTE. And then this one was 31 March, 21, this was 16 DTE. So these look like they're just based on like time. And this goes back, I genuinely believe, off-puting says he's stacking shares. He's not. Like he already put on all the shares, at least",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 112,
      "start_timestamp": "01:40:10",
      "start_timestamp_seconds": 6010.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6010"
    }
  },
  {
    "text": "This one's 15 DTE. And then this one was 31 March, 21, this was 16 DTE. So these look like they're just based on like time. And this goes back, I genuinely believe, off-puting says he's stacking shares. He's not. Like he already put on all the shares, at least as of, you know, to this point. Right? Because he added 50,000 shares back in 19 Feb. And he's been sitting on over 11 million of cash. So he's not stacking shares. He's obviously building shares when he wants. There's no doubt there. But he's done nothing with shares in this. He's just adding periodically. And then he's holding these options for a really long time. And that I find, again, it's from a trading perspective. It's illogical to hold them as he has. So then we have 16 April, 21. And the total gain is 19 902, 513. Got 83. The cash in the account is 3, 535, 248, got 01. So we obviously used a bunch of cash here. And then the value of the portfolio is 34, 473, 248, got 01. Okay. So the 16 April, 12 calls are gone. Now we need to figure out where they went. So to do that, we're going to look at his new 200,000 position or 200,000 shares. So prior, he had 100,000 shares. So if I have 100,000 shares, and the basis on that 100,000, was 26. 7, 9, 8, 6. And now we have 200,000 shares. And our",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 112,
      "start_timestamp": "01:41:55",
      "start_timestamp_seconds": 6115.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6115"
    }
  },
  {
    "text": "they went. So to do that, we're going to look at his new 200,000 position or 200,000 shares. So prior, he had 100,000 shares. So if I have 100,000 shares, and the basis on that 100,000, was 26. 7, 9, 8, 6. And now we have 200,000 shares. And our new basis is 55, 55, got 1774. So the basis of the added shares, so let's see. So the basis of the added shares was 83, 5562. So added 100,000 shares at 83, 5562. And then the 16 April, 12 calls sold, I think. And we can confirm that really quick. Because who wouldn't say he exercised for 50 and then bought 50? It literally wouldn't make any sense to do that. It would literally make zero sense to do that. So I do not think that that's what he did. So let's see. But we can test the theory, because maybe it is true. I'll take it as if it's true. So we think we have 50,000, because the problem is 50,000 shares, 50,000 shares. So we have 50,000 shares then at 12. Off Putin says 154.69 plus 12 divided by 12 equals. That again, I think you're looking at the wrong thing here. Because the last update that we got from him was on the 1st of April. So when was this posted? Yeah, he absolutely did not exercise. I know for a fact, he did not exercise. Do you know why I know he didn't exercise? It",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 112,
      "start_timestamp": "01:43:58",
      "start_timestamp_seconds": 6238.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6238"
    }
  },
  {
    "text": "at the wrong thing here. Because the last update that we got from him was on the 1st of April. So when was this posted? Yeah, he absolutely did not exercise. I know for a fact, he did not exercise. Do you know why I know he didn't exercise? It actually makes the problem said even easier. Don't even have to waste the time on that. I know definitively he did not exercise. And he guess? Average the current share price with his 12 strike. It doesn't matter. Unless he, no, maybe. Okay, so no, I redact that. I don't know for a fact. That's true. I don't know for a fact. But the reason why I strongly don't think he exercised is because if it's the April 16th and he took it into exploration, which is be the most logical place to exercise your option. If you hold it into exploration, I don't think he exercised early. They wouldn't, they wouldn't be added yet. Because he posted this at 120 PM Pacific time on the Friday the 16th. The he's his shares wouldn't, they wouldn't be settled then. The exercise literally doesn't happen that fast. It would be the next day that they're there. So they wouldn't be there yet if he exercised. So if he did the logical thing, take it into exploration so that he's not giving up extrinsic value, then it's the 16th. If he took his options into exploration that were in the money with",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 112,
      "start_timestamp": "01:46:30",
      "start_timestamp_seconds": 6390.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6390"
    }
  },
  {
    "text": "next day that they're there. So they wouldn't be there yet if he exercised. So if he did the logical thing, take it into exploration so that he's not giving up extrinsic value, then it's the 16th. If he took his options into exploration that were in the money with the intent of exercising them, which he absolutely could have done, then they wouldn't be there until the next day. They wouldn't be in the account 20 minutes after the market closed on the 16th. So I don't see that. And then off Putin says he paid 600K to exercise. Yeah, that's just it literally doesn't make sense to exercise. That's the point. It's one it literally doesn't make sense. So I don't believe that he did. That is my best thesis right now. Is that I don't see. I don't see that he did. Mr. Overseh says just be direct and tell us your bearish on GME. I'm not bearish. I have no. Again, this is the person or this is like the kind of people that I find. Like when they hear that I sell calls again shares, they think that that means I'm bearish. If I hold shares, it's a bullish position. It's not bearish. I don't want the stock to go down if I hold shares. So no, that's absolutely not that's not correct. I'm not bearish. I'm very direct with what I think about GameStop and in terms of the way it performs. And in",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 112,
      "start_timestamp": "01:48:01",
      "start_timestamp_seconds": 6481.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6481"
    }
  },
  {
    "text": "shares, it's a bullish position. It's not bearish. I don't want the stock to go down if I hold shares. So no, that's absolutely not that's not correct. I'm not bearish. I'm very direct with what I think about GameStop and in terms of the way it performs. And in terms of more over than that, depending on what I want to happen doesn't matter. T.C.M. King says I don't think he could get that cost basis without exercising to get 50,000 and then bought 50,000. Yeah, let's take a look at that because that's a great point. And that's I think the next natural segue. So let's see. So essentially what we need to see is the price behavior between the first and the 16th. So I think, yeah, do you know where I can get a non-split adjusted chart? Because that would be better. Let's go to the end of April and let's see what this looks like. He absolutely could have if this is even remotely correct. Hmm. And then let's just do that math really quick. Let's see. So we were talking about 50,000 and then 50,000. And then we think some of that might have been done at 12. It would have been technically 12.2 because that was his basis. And then we'd have to figure out whatever the we'd have to figure out whatever the residual would be. Then this equals this. Okay. Okay. So then, all right, I'm just going to throw this",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 112,
      "start_timestamp": "01:49:16",
      "start_timestamp_seconds": 6556.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6556"
    }
  },
  {
    "text": "been done at 12. It would have been technically 12.2 because that was his basis. And then we'd have to figure out whatever the we'd have to figure out whatever the residual would be. Then this equals this. Okay. Okay. So then, all right, I'm just going to throw this into the chat. GPT will be a little bit faster. So the original scenario is if I had 100 shares of stock at a basis of 26, 7, 9, 8, 6, now I have 200,000 shares at 55.1774. Let's say I'm just going to say bought. I'm not going to bother telling it that I exercise anything. So I bought 50,000 shares at 12.2. What is the basis for the remaining 50,000 shares I added? Let's see. All right. GCM King says just multiply your 15 April 2021 chart. I don't the problem is I don't trust it, right? Because the other thing is I can't just use the I can't use the 15 April because there's a window here, right? So I don't know. Like he could have bought those 50,000 shares. Like if the scenario that we're working with is that he exercised 50,000, which again, I don't see it yet, but I'm open to it for sure. Because he also uses, I think what is this e-trade? I don't use e-trade. So maybe e-trade shows the shares faster than any other platform I've seen that could be. Again, strong convictions loosely held. Happy to abandon it if",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 112,
      "start_timestamp": "01:51:11",
      "start_timestamp_seconds": 6671.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6671"
    }
  },
  {
    "text": "see it yet, but I'm open to it for sure. Because he also uses, I think what is this e-trade? I don't use e-trade. So maybe e-trade shows the shares faster than any other platform I've seen that could be. Again, strong convictions loosely held. Happy to abandon it if I see data that lines up. So but when I look at this, the problem is we can't use this 16th, the 15th, or really any other period before that. Because like he could have bought those 50,000 shares any time in here, right? So any point during this, which we wouldn't know. So off-putin says only 12 would come out of current cash, not 1220. It's again, Putin, you're looking at the wrong thing. I don't care if it came out of cash. Whatever came out of cash doesn't matter to me right now. All I'm doing is I can figure this out by basis. That's all I need, right? So when I look at the basis of the shares, that's the equation that we're working with. So Roryntady says some brokers auto exercise in hours before the close, right? No, definitely not. Absolutely not. They would not do that. Because exercise, again, exercise is done after the close. So even if I choose to exercise my options in a day, it's not going to be settled and see them until later in the day. What does this say? Thus the basis for the adding, yeah, see, I don't",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 112,
      "start_timestamp": "01:53:10",
      "start_timestamp_seconds": 6790.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6790"
    }
  },
  {
    "text": "that. Because exercise, again, exercise is done after the close. So even if I choose to exercise my options in a day, it's not going to be settled and see them until later in the day. What does this say? Thus the basis for the adding, yeah, see, I don't think it's right. Because then the added shares in this scenario, the added shares would have been at 154. 91124. And I just don't think that's correct. Because then his original position was 100,000. And then his basis in that 100,000 was 26.7986. Total cost here equals this times this. So then here, well, off-put in the problem is, like, and again, this is why I need a pre-adjusted chart that I trust. Because right now, I like, I don't actually trust what I'm seeing here in GameStop. Is it accurate? So we can finish this really quick. So essentially, we just need to do equals some of that equals some of this equals. 55, 17, 74. 4 lines up perfect. Lines up perfect. 154.91. This, I also think, yeah, no, I think you guys are right. I think you guys are right. Because the other thing is this is showing last price at 154.69. So then this to me looks like he would have bought right before the close. Because that lines up really well with this. Yeah, you guys are 100 wrong. You guys are 100 correct. So he added, so this looks like, because here this is,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 112,
      "start_timestamp": "01:54:34",
      "start_timestamp_seconds": 6874.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6874"
    }
  },
  {
    "text": "showing last price at 154.69. So then this to me looks like he would have bought right before the close. Because that lines up really well with this. Yeah, you guys are 100 wrong. You guys are 100 correct. So he added, so this looks like, because here this is, oh, I need to see a chart. I still believe that you guys are right. Based on what I see here, I still think that that is absolutely the most likely that I see now. But I need to see like a GME. Non-split adjusted. Does Yahoo Finance do that? So the first split was in 07, which doesn't matter. I don't come on, man. Let's see. This doesn't tell me when the splits were. That's kind of really annoying. I just want to see something. Do you know if Yahoo Finance does this? EME. Let's take a look at this really quick. And then let's do. We want to do off Putin says the shares had not touched 83.50 since Feb. Okay. Yeah. That's exactly what I want to confirm. Because as long as that's the case, then I literally completely agree with you guys. I think that that is spot on. Let's do six month one day. And then we are in 2021. And we are in April. Yeah. Completely agree. Okay. So I think this is certainly confirmed. Then 50K of the 50K of the 16 April. Thank you for the help guys. 12 call. Exercise. And",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 112,
      "start_timestamp": "01:56:30",
      "start_timestamp_seconds": 6990.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=6990"
    }
  },
  {
    "text": "is spot on. Let's do six month one day. And then we are in 2021. And we are in April. Yeah. Completely agree. Okay. So I think this is certainly confirmed. Then 50K of the 50K of the 16 April. Thank you for the help guys. 12 call. Exercise. And then 50K. bought to open. At. 154. Got 9124. So now we have no options. That's perfect. Yeah. Off Putin says math. Don't know. Yeah. That's exactly that's the beautiful part. And again, this is another thing that I clearly am learning. Right. Because when I look at this, this is completely different than any other platform. So I've never seen a platform that will credit the shares. Now this leads to another potential thing. Because I'm just not sure. If he exercise because he might have exercised early. And I don't have a way to identify that. But there's a chance he could have exercised between one April and 16 April, which opens up another really interesting question. So let me see if Chatchy PT can answer that for me. He uses is this E trader fidelity? This is E trade, right? Is that accurate? Because. E trade. Okay. Thank you. So let's take a look. Within the E trade platform. If I hold an option. And let's say that I hold it into expiration. I hold in in the money call into expiration. That I want to exercise. When will the shares appear in my account? Very, very",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 112,
      "start_timestamp": "01:58:17",
      "start_timestamp_seconds": 7097.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7097"
    }
  },
  {
    "text": "Thank you. So let's take a look. Within the E trade platform. If I hold an option. And let's say that I hold it into expiration. I hold in in the money call into expiration. That I want to exercise. When will the shares appear in my account? Very, very interested about this. And then off-putances, the shares closed at 156.44 the prior day. Yeah. So it's like obviously trading around that 154 handle. Here we go. Okay. So if you hold in the money option into expiration and choose to exercise. Yeah. See, it says the shares will typically appear in your account by the following trading day. So usually on the Monday after expiration. So this leads me to believe that he exercised slightly early. I'm going to add a note here. Early question mark because I don't know. But I believe this is early, which is an important note for me. Believe it or not. Wow. What a banger. What a fucking banger. So this is super curious. All of this is super curious so far. I'm going to pause us here before we get into the recent stuff. And I want to recap some of what I'm seeing. So the first thing that I'm seeing is that most of the time, he's holding the options very close if not all the way into expiration. Very, very close like all the way in here. And I've seen that multiple times now. In this case, it looks like",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 112,
      "start_timestamp": "02:00:31",
      "start_timestamp_seconds": 7231.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7231"
    }
  },
  {
    "text": "I'm seeing. So the first thing that I'm seeing is that most of the time, he's holding the options very close if not all the way into expiration. Very, very close like all the way in here. And I've seen that multiple times now. In this case, it looks like the overwhelming probability is an early exercise. And it's probably because he was expecting to lose all the extrinsic value anyways by taking it into expiration. Now, again, it's a suboptimal choice. It doesn't actually make sense to do that. Now, the only reason why this could make sense to take it all the way in the expiration is because there's so far in the money that he would net that difference if he unwind the position. But based on what most of us have seen so far before the chewy stuff, it doesn't really look like he unwinds the positions. So that entire scenario is actually quite fascinating to me. And watching him take these options so far into expiration is really, really interesting. The other thing that I noticed is that the total gain on the account obviously is massive, massive, massive volatility. I see the peak here was 33 mil. And then when he left off, he was at essentially 20 mil. So that is also very interesting. So, Royntady says he stacks the shares. Yeah, and that's something that Newton told me that based on what Newton had seen that he's never unwound, although I do",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 112,
      "start_timestamp": "02:02:16",
      "start_timestamp_seconds": 7336.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7336"
    }
  },
  {
    "text": "was 33 mil. And then when he left off, he was at essentially 20 mil. So that is also very interesting. So, Royntady says he stacks the shares. Yeah, and that's something that Newton told me that based on what Newton had seen that he's never unwound, although I do think he unwound to get into Chewie, which we will need the tinfoil hat for that part if we want to go into that, which I'm happy to. This one here. So if we take a look at, we have to zoom out. See, we need Newton. I need to hit Newton up because here it is. I'm slowly figuring out how to navigate this stuff. But he has stuff everywhere. It's really tricky. So here, Newton has shown me that essentially he scales the account. And this all looks right. And again, so this Newton already covered this. No surprise. And then, hmm. Yeah, because so we've done the cost analysis on the Chewie position. Let me grab my hat. All right, now we're ready. Oh, whoa. My hold on. Just so everybody can see that. Whoa, it's like, get a backup. Here's the hat. The hat and its full glory. So now that we have the hat on, we can take a quick look at the Chewie position. Because again, I think the problem with the Chewie position is that there just was not enough money in the account. Now, Roy and Titty says, I don't think so.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 112,
      "start_timestamp": "02:03:37",
      "start_timestamp_seconds": 7417.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7417"
    }
  },
  {
    "text": "full glory. So now that we have the hat on, we can take a quick look at the Chewie position. Because again, I think the problem with the Chewie position is that there just was not enough money in the account. Now, Roy and Titty says, I don't think so. He was trading with multiple accounts. He had money in other places. He used for Chewie. I again, maybe he did. But I just I just don't see it. And the reason why I don't see it is because. And again, who knows this is why the hats on is I don't know. It's pure speculation. But the reason why I don't see it is because let me consolidate this stuff down so we can zoom in a little bit. The reason why I don't see it is because when he comes back, he came back here with 210, 210 milli. So with 210 milli, why if he had another, literally another 210 milli, why would it not just be here? I don't I just I he obviously has made a lot of money. And another thing I'm even more interested in to be completely honest with you is I'm not convinced that from 16 April 2021 to June that he went from 34 mil to 210 by just trading. Absolutely could have, but I'm not convinced that that's what happened. And it's just because I can't prove it one way or the other. What's the what is the compound",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 112,
      "start_timestamp": "02:05:22",
      "start_timestamp_seconds": 7522.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7522"
    }
  },
  {
    "text": "not convinced that from 16 April 2021 to June that he went from 34 mil to 210 by just trading. Absolutely could have, but I'm not convinced that that's what happened. And it's just because I can't prove it one way or the other. What's the what is the compound annual growth rate from 2021 to 2024 moving from 34, 34 mil to 211 mil. Just out of curiosity. So it's a three year period. KCM say says would you have 400 million all at one broker at least two? I don't see I don't see the reason to split it between two. I again, like if you're already at the 200 million handle. So yeah, he could. And again, the other thing that I would absolutely highlight is I don't see any reason why he wouldn't have money elsewhere. Right. I'm not suggesting that he doesn't. But my main point is I think the money that he would essentially have to trade would be TCM King says rumors, he trade thread in the closest position. I heard that too. But again, that's that's later into this. My main point and maybe you guys will have an opinion on it. So my main point here is that when he came back at two June and he has 211 million. Why wouldn't you come with all the money that you're going to trade if you had another 200 million dollars that you were going to use for something at some point",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 112,
      "start_timestamp": "02:06:53",
      "start_timestamp_seconds": 7613.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7613"
    }
  },
  {
    "text": "So my main point here is that when he came back at two June and he has 211 million. Why wouldn't you come with all the money that you're going to trade if you had another 200 million dollars that you were going to use for something at some point anyways? The other thing is that when we look at something like this, we have another really interesting scenario in my opinion where it's clear that he would have used options in the meantime because the compound annual growth rate for the three year period for him would have been about 85, which again, that's insanely good. But that I could see him doing that. Like that's not overly crazy. In this case, it looks like I just I don't see why he would come back if he was expecting to use 400 million to trade and have 210 million in the account. Why not just have it all in one spot, especially for the way that he rolls. I don't see why he would split them. Yeah. Orange guy says, but why would he buy calls, exercise them and sell them instead of just bagging the premium? Well, you don't bag the premium. If you buy the calls, the premiums going to go away. So yeah, that's the reason why it is the same reason why he uses calls here. It's for leverage. So one of the things I can tell very clearly from his options positions is that",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 112,
      "start_timestamp": "02:08:42",
      "start_timestamp_seconds": 7722.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7722"
    }
  },
  {
    "text": "don't bag the premium. If you buy the calls, the premiums going to go away. So yeah, that's the reason why it is the same reason why he uses calls here. It's for leverage. So one of the things I can tell very clearly from his options positions is that he unequivocally uses options for leverage. Even in this case, he actually doesn't need to use options for leverage here. He has enough money for sure. But he still prefers the leverage. And I think that that's again, like an artifact of the way that he trades and the way that he rolls, really, which is again, pretty nuts. So Blanc Swayze says there is a couple of run-ups since April 21. He probably perfected the game. That's the problem though. It's like, I just don't see that. Based on what I see here, like I don't see him perfecting the game. Again, I want to be so clear. He's incredible. And he clearly has definitely timed things very well, very well. But one of the things that I can tell you again by just looking at this is that the way he's trading is not really predicated on timing. And I don't see any evidence here that he perfected it. Because if he perfected it, we wouldn't have a 33-milli-count that drops to seven that then goes back up to 25 that goes back down to 20. So the problem that I see with this idea that he's like,",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 112,
      "start_timestamp": "02:09:58",
      "start_timestamp_seconds": 7798.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7798"
    }
  },
  {
    "text": "And I don't see any evidence here that he perfected it. Because if he perfected it, we wouldn't have a 33-milli-count that drops to seven that then goes back up to 25 that goes back down to 20. So the problem that I see with this idea that he's like, and again, I love the way that we hold the cat in high regard. We should. What he's done is insane. But I still think it's really important again to look at things as objectively as possible. And one of the things that I can see going on here is to me, it looks pretty clear that the timing is not perfect. I don't see perfect timing here. I see massive account volatility, massive. And I see most of his trades being managed by time in the trade, not by taking profits at advantageance points. So I don't see the timing argument. It just looks to not be the case, at least as far as what we know so far, which is fascinating, isn't it? Because even the fact that he was willing to exercise these, but then to buy in what? He bought 50,000 shares at 155. You want to talk about a fucking choice? That's a fucking choice. Because again, if we think about the psyche and the background of him as an investor, he talks about how his background is as a value investor. There's clearly no world that he actually thinks GameStop was worth 155 there.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 112,
      "start_timestamp": "02:11:21",
      "start_timestamp_seconds": 7881.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7881"
    }
  },
  {
    "text": "to talk about a fucking choice? That's a fucking choice. Because again, if we think about the psyche and the background of him as an investor, he talks about how his background is as a value investor. There's clearly no world that he actually thinks GameStop was worth 155 there. Like there's no world that he thought that. And this to me looks like a confirmation of his pivot from a value investor, which I absolutely saw him talk about in one of his live streams, where he talked about how he would value things and then they would move differently. And that would get under his skin after a little while. Semicresion says for clarity, tinfoil, it's on. You can see it's on. It's a visual representation of the speculation. This is all speculation, because I can't, I literally can't prove any of it. So the stuff that we can prove are the things that I can work out via math. I can look at money coming in and out of the account, like all of those things. But I can tell again from this purchase, that's not a value purchase. There's no world that he would have thought 155 is fair value or even below value for GameStop. There's just absolutely no way. So Willie says, wasn't he tired of price not meaning his value target? It's exactly. And he talked about that in one of his live streams. We can see if we can find it. I",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 112,
      "start_timestamp": "02:12:50",
      "start_timestamp_seconds": 7970.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=7970"
    }
  },
  {
    "text": "155 is fair value or even below value for GameStop. There's just absolutely no way. So Willie says, wasn't he tired of price not meaning his value target? It's exactly. And he talked about that in one of his live streams. We can see if we can find it. I mean, again, we have the tinfoil hats on and everything. We can go in for a little bit. My dinner's not going to be here for a little while. So we can get, we can get in. We got a fresh mango orange. So we're ready to rock. Let's see what we have in these. No, no, no. No. No. I think it might have been a live stream. There we go. Let's try one of these new ones. Well, he says Mexican food. No, we're doing a place called Carl Strauss. It's kind of like a pub. So the guy that got me into investing, I talked about him last night. He's he was one of my high school teachers. He was a junior ROTC instructor. He's this guy right there. He's over at my house right now hanging out. Actually, he's here for like the weekend. We've we've kept in touch. I've I referred to him as my stepdad, but he's the one that I referred to him as, yeah, I referred to him as his stepdad. He's not like in any sort of relationship with my mom, but like he took very much like a father role",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 112,
      "start_timestamp": "02:14:13",
      "start_timestamp_seconds": 8053.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8053"
    }
  },
  {
    "text": "kept in touch. I've I referred to him as my stepdad, but he's the one that I referred to him as, yeah, I referred to him as his stepdad. He's not like in any sort of relationship with my mom, but like he took very much like a father role in my life. And he's the one that introduced me to the concept of investing in high school, which he literally is the dude that changed my life. Anyways, he likes burgers. So that's why we're ordering from Carl Strauss tonight, because when he's here, it is whatever works for this dude. So yeah, that Lauren says I was wondering if you were having Mexican tonight. Yeah, no, I I was literally joking with Mel about that about how you guys advocate for sometimes with the Mexican, but no, not tonight. So semi-Christian says, has anyone tipped his driver? No, not me. I mean, I I tip them always well, but no. Jonathan says brewery. Yeah, exactly. That's what Carl stresses. Vladimir says, don't skip past the 55 17 74 cost basis on the final 200,000 shares post split 1380. Yeah. Yep. Willie says, oh man, I have a high school teacher who I respect. Yeah, they like that dude literally changed my life. So yeah, he became and it's funny because his son, he had an adopted son that actually committed suicide. And then I had an abusive dad that wasn't in my life a lot. So it's just",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 112,
      "start_timestamp": "02:15:51",
      "start_timestamp_seconds": 8151.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8151"
    }
  },
  {
    "text": "school teacher who I respect. Yeah, they like that dude literally changed my life. So yeah, he became and it's funny because his son, he had an adopted son that actually committed suicide. And then I had an abusive dad that wasn't in my life a lot. So it's just the hilarity of the universe, but it kind of put both of us together at a point where we both kind of really needed each other. And it yeah, it formed this really, really incredible relationship that was just pure happenstance. Well, whatever we consider happenstance. Rhino says, every time I say I'm trading anything but GME, the Abe community calls me a shill, it's hard to follow GME and actually make money without abuse. Well, I don't know. Rhino, I can't speak for you, but in that case, at least for me, like, I keep it a buck, right? Like it is what it is. Whatever I do is whatever it is. So like, there was that person earlier in the stream that was pissy with me because they were saying that I'm bearish because I'm selling calls, right? It's like, whatever they're going to think is whatever they're going to think, man. But like I honestly couldn't possibly care less with that one person thinks because one literally the statement doesn't make sense, right? When we look at something like a covered call, covered calls make maximum profit when the stock is above your short call. That's where",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 112,
      "start_timestamp": "02:17:09",
      "start_timestamp_seconds": 8229.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8229"
    }
  },
  {
    "text": "going to think, man. But like I honestly couldn't possibly care less with that one person thinks because one literally the statement doesn't make sense, right? When we look at something like a covered call, covered calls make maximum profit when the stock is above your short call. That's where maximum profit is. So again, that's just people being ignorant. It's people that don't understand how things work and they're just kind of looking for something to look at. That's genuinely what I believe. So for example, if I take a look at this scenario again, let's say that we have just 100 shares is fine. And I can get rid of all these other ones now. And let's say that I sell a call against these shares. Where's my max profit? Right now in this scenario, GameStop is trading at 22. It's right here. Where's my max profit in this trade? It's fucking up. It has to go up for me to hit max profit even in a covered call. So when people say things like, oh, you sold a call, you're bearish. It again, it's pure ignorance. So like, for example, so that's just that guy. I immediately discount whatever they think because it's illogical. The people that I think it makes sense to truly onboard their opinion of you are people who know you really well. And there was an actor who said this at some point, I don't know who it was because I was watching",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 112,
      "start_timestamp": "02:18:19",
      "start_timestamp_seconds": 8299.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8299"
    }
  },
  {
    "text": "discount whatever they think because it's illogical. The people that I think it makes sense to truly onboard their opinion of you are people who know you really well. And there was an actor who said this at some point, I don't know who it was because I was watching a YouTube short where somebody was paraphrasing what they heard. It was an actor that was paraphrasing what they heard another actor say. But essentially, it's something to the effect of if you, if you have a problem with me, text me. And if you don't have my number, you don't know me well enough to have a problem with me. I actually like that a lot. I think that that's a really smart way to look at it. So Rhino, for the internet people that have a problem with you, just tell them to text you. And if they do not have the number to text you, it tells you that they don't know you well enough in order to come up with that opinion. So yeah, whatever they say is what they say. Don't even worry about it. Willie says, haters going to hate Aristotle. I think, yeah, that's probably the Aristotle probably. Yeah, that's right. Warring to the said, my fifth grade teacher taught me how to use chopsticks. She paid me to grade math test after school and took me to Chinese. She was really awesome. Keep me out of trouble. Yeah, that's so fucking sick.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 112,
      "start_timestamp": "02:19:38",
      "start_timestamp_seconds": 8378.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8378"
    }
  },
  {
    "text": "that's probably the Aristotle probably. Yeah, that's right. Warring to the said, my fifth grade teacher taught me how to use chopsticks. She paid me to grade math test after school and took me to Chinese. She was really awesome. Keep me out of trouble. Yeah, that's so fucking sick. I love that. That's super cool. It's one of the reasons again. It's one of the reasons why I do this stuff is because I've had a lot of people positively impact me in my life that I would be in a completely different spot. And sometimes it just takes a couple interactions to send somebody down a completely better path in their life, which I think is really cool. I genuinely value that. I think that that is so unbelievably cool. All right, so let's go back into this and let's see what we can learn here. I need to turn on the volumes that you can hear. And let's see. Move it up in size. Where is it up there? Yeah, look at this. I mean, I need to have this number. So do I get some trading here? Yeah, yeah, 2023. So look at this. You still got them trading in the 90s here. And oh, let's look up. Let's look up where they've been trading the past out of what's upside. And with RFP, I do think that's the case. I see the other one, SWN. So I had a smaller number of them in here.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 112,
      "start_timestamp": "02:20:54",
      "start_timestamp_seconds": 8454.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8454"
    }
  },
  {
    "text": "got them trading in the 90s here. And oh, let's look up. Let's look up where they've been trading the past out of what's upside. And with RFP, I do think that's the case. I see the other one, SWN. So I had a smaller number of them in here. RFP, it's here. Why didn't you tell me RFP was in this spreadsheet? Maybe you did. I wasn't listening. So if I click this, if I click this, does it bring me right to it? Okay, look at that. 300 million market cap elsewhere as well. A 15. Oh, I thought it was a more than that. I haven't tested this in a while. Let's see. Or as well, I forget what the bomb prices are tentacle, but then I thought tentacle. I mean, I don't remember where it is. I'll have to go through them and see if I can find it. I do not remember where it is at all. Let's see. Let's see. Let's see what this one is. I'm back. And I try to think about why, why everyone thinks that night. The most obvious reason is just because we all lean on those oversimplifying ETFs to measure the style success. But I mean, that's not really successful over the past decade. The reasons why maybe this is it where it says why I'm not a value investor. Roaring Titty says it was in his live stream when he's talking about a spreadsheet. That's so tricky",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 112,
      "start_timestamp": "02:21:54",
      "start_timestamp_seconds": 8514.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8514"
    }
  },
  {
    "text": "to measure the style success. But I mean, that's not really successful over the past decade. The reasons why maybe this is it where it says why I'm not a value investor. Roaring Titty says it was in his live stream when he's talking about a spreadsheet. That's so tricky because I don't like I've seen I've seen like pieces of his work around in different spots. And I just like haven't mentally bucketed where each of these are. So my Christian says, chat you be used. So yeah, I'm happy to run it through chat you be. Let's see. And this thing is like completely locked up for some reason. I'm back and up. All right, so let's see. Grab this. Got this into video summarizer. And then let's see. Okay. So summarize this video. Let's see what that comes up with. Yeah. I try to think about why, why everyone thinks that night. The most obvious reason is just because we all lean on those oversimplifying ETFs to measure the style success. But I mean, that's not a good way to measure a bona fide value approach. It's um. So the summary, I'm just going to read you this summary because it's a little bit faster. So this says it starts with him explaining his style makes it clear he's not offering day trading trips or quick stock excitement isn't that funny. Isn't that funny? The beginning of the video starts with him saying he's not offering quick",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 112,
      "start_timestamp": "02:22:58",
      "start_timestamp_seconds": 8578.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8578"
    }
  },
  {
    "text": "this summary because it's a little bit faster. So this says it starts with him explaining his style makes it clear he's not offering day trading trips or quick stock excitement isn't that funny. Isn't that funny? The beginning of the video starts with him saying he's not offering quick stock excitement. And then he that's just so classic. I love that. And then it says value investor with a twist. He says he identifies as a value investor, but he doesn't fit the traditional model. He rejects the idea that value investing is dead. But he doesn't rely on discounted cash flow. He focuses on a broader framework where value is one of the many factors. He incorporates technical analysis into his strategy, which obviously is contract to value. And he aims for aggressive 50 to 100 annualized return, acknowledging that his approach may not suit everyone. He emphasizes lumpy returns, which is exactly correct, which meaning some years while perform while others might fall short. It literally, it literally is perfect. And the reason why it's perfect is because that's a direct representation of what I've seen him do. So I'm going more into the I'm asking it more about the differing of his approach. That Lauren says break that down for the dummies. Sure, what, sorry, which part? Tell me I could take this off now because my head's getting hot. Lauren, tell me what part we we need to dive into. You know, I'm happy to",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 112,
      "start_timestamp": "02:24:49",
      "start_timestamp_seconds": 8689.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8689"
    }
  },
  {
    "text": "more about the differing of his approach. That Lauren says break that down for the dummies. Sure, what, sorry, which part? Tell me I could take this off now because my head's getting hot. Lauren, tell me what part we we need to dive into. You know, I'm happy to let me know. Are you guys getting ads? I'm seeing comments about somebody say something about YouTube premium or whatever. And then Lauren, let me know what all of it, what does it mean in layman's terms? Layman's all of it. You mean the value investing thing that I'm talking about? I just want to make sure I'm talking about the right thing. The value investor, the idea that value investing is dead, that stuff, and like the model thing. So, okay, so yeah, let me run through this. And Lauren, let me know if there's like specific follow-ons. So value investing is a really, really distinct approach to investing. And it's very specific to investing. It's not specific. It's not tied to trading. And value investing is really predicated on searching for companies whose current stock value is below to a degree whatever the target value is, whatever somebody thinks it should be. And the way that people arrive at what they think it should be largely depends on their models, a very common one is called a discounted cash flow. And it's essentially, it sounds what it kind of does, what it sounds like, where we're trying to",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 112,
      "start_timestamp": "02:26:14",
      "start_timestamp_seconds": 8774.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8774"
    }
  },
  {
    "text": "thinks it should be. And the way that people arrive at what they think it should be largely depends on their models, a very common one is called a discounted cash flow. And it's essentially, it sounds what it kind of does, what it sounds like, where we're trying to discount future cash flows to figure out what the current price of something should be. So, his general approach is that was his basis. That was his foundation. And we can see that represented as we go through like a lot of this earlier stuff, right? So like his little spreadsheet thing here is really specific to trying to find things at value. Now, the problem with value, well, there's a bunch of problems with value investing as an effective tool. It does work just fine to be clear. But in terms of his return profile, it doesn't work that well at all. So value investors are not typically targeting 50 to 100 returns. It's just unreasonable. Most of their stocks will move much less than that. The other thing is most value investors do not bother with technical analysis because technical analysis represents interim movements when really they're most concerned with their model and their pricing because that's where they think something should ultimately land. And then the prices in the model would get updated each quarter as new financials come out. So his general approach as he was outlining there is obviously really interesting because it's completely blending",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 112,
      "start_timestamp": "02:27:58",
      "start_timestamp_seconds": 8878.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8878"
    }
  },
  {
    "text": "concerned with their model and their pricing because that's where they think something should ultimately land. And then the prices in the model would get updated each quarter as new financials come out. So his general approach as he was outlining there is obviously really interesting because it's completely blending different things together, which is unequivocally just fascinating. And the way that he trades in terms of one of the things he was talking about is lumpy returns. Well, that's the nature of value investing in general. And you can see traits of those lumpy returns here where things go up, things go down, things go up, things go down. Now with the whole lumpy returns thing that I find fascinating is because it tells me that he's not actually really trying to time things super well, that he's okay holding through these different you know, movements up, movements down and so on and so forth. So yeah, the whole prospect of like his origin, you can tell his very value investing focused, but the way that he trades, obviously, this is this is not value at all. I think he came across GameStop and thought that it had decent value in the beginning, but you can tell he abandoned that fully because the way that he traded this is trading the thesis of value in my opinion, meaning that he thinks GameStop should be worth more in the future than it is now. But the way that he set",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 112,
      "start_timestamp": "02:29:13",
      "start_timestamp_seconds": 8953.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=8953"
    }
  },
  {
    "text": "value in the beginning, but you can tell he abandoned that fully because the way that he traded this is trading the thesis of value in my opinion, meaning that he thinks GameStop should be worth more in the future than it is now. But the way that he set this entire thing up from the beginning doesn't jive with again, the approach for like a normal value investor. A good example of a value investor is Warren Buffett. That's essentially one of the primary current state users of it, at least that scale. So yeah, the departure clearly happened. I don't know when it happened, but it definitely did happen. Do you guys know maybe it was in the live streams when it is early live streams go through a bunch of different positions? Yeah, it looks like it. So here he has a bunch of different positions. Here he still has a bunch of different positions. Let's click this one really fast. I said, I'm into the trim. Dove the just to raise some cash. My cash is getting low. Okay, so yeah, here he has a ton of stuff. Very standard value investing approach. Okay, so this was 19 aug 2020. Still value, I can see that here. Let's take a look. Shall we pull that up? Yep, so this looks like he's still holding multiple things. Let's do it. Let's do it. A lot of other roles look super bullish, but through I kind of just",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 112,
      "start_timestamp": "02:30:27",
      "start_timestamp_seconds": 9027.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9027"
    }
  },
  {
    "text": "was 19 aug 2020. Still value, I can see that here. Let's take a look. Shall we pull that up? Yep, so this looks like he's still holding multiple things. Let's do it. Let's do it. A lot of other roles look super bullish, but through I kind of just ballparked, although I was curious, brick and mortar and okay, so this one was when was this one? It could be 26 augs. Let's fast forward a little bit. So clearly here, still value. This guy, but his ex. So here he's introducing Cohen. I want to see if his spreadsheets in here. There it is. San Jose says, how long does this meme stock mania run? What are the limits to this? Well, I think meme stocks are never going to go away. I think that their shape will change and what is currently a meme stock will ebb and flow. But yeah, I don't see meme stocks ever going away at this point. I think meme stocks are going to continue to be a thing and it's because of social media. I don't think it'll ever change. So let's see, I want to go through this thing a little bit more and see if I can find any of his current positions. Because this looks like he's just doing valuations, right? Like this is a cash flow model. So he's trying to come up with different deflators and he's coming up with different assumptions of where he thinks",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 112,
      "start_timestamp": "02:31:47",
      "start_timestamp_seconds": 9107.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9107"
    }
  },
  {
    "text": "little bit more and see if I can find any of his current positions. Because this looks like he's just doing valuations, right? Like this is a cash flow model. So he's trying to come up with different deflators and he's coming up with different assumptions of where he thinks things might go and you can see like these are just looking at different different companies. But what I want to see is if he has a snapshot of his portfolio, same thing, this looks like it. This looks like his portfolio. Yep. So this, yep, so I can see the percentage of his portfolio. So GameStop is now 17 of his portfolio. So this started to happen. When is this? 28 August 2020. Okay. So now let's open up another YouTube window really quick. And what I want to do is actually look at the movement of his position, meaning in terms of the concentration. So these are during the live streams. Yeah. TCM King says this is why people think he has more than one account. His E-trade is yellow account. We never saw a yellow post that shows any of his value shares. Well, because my hypothesis is that at that point, he became highly concentrated. And that's what I think we're going to see. And that's actually why I'm doing this exact exercise right now is I want to go back to like the beginning, like here. And I want to see what his distribution of",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 112,
      "start_timestamp": "02:33:37",
      "start_timestamp_seconds": 9217.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9217"
    }
  },
  {
    "text": "is that at that point, he became highly concentrated. And that's what I think we're going to see. And that's actually why I'm doing this exact exercise right now is I want to go back to like the beginning, like here. And I want to see what his distribution of of positions were. So in this case, this is seven aug. And we can grab his portfolio tracker. Let's see where it is. This is different. Let's find it. That looks different. Unless he changed the structure a little bit. So this one is called arcade tracker. Yep. So we're in there. Let's just see if we can find it. So what I think we're going to see is I think we're going to see his position in GameStop build and then consume everything else. This is like super blurry. And I get something I can read. There we go. Price. So this doesn't look like in his portfolio. This looks like valuation stuff. So we have to find his portfolio. Not there. That's valuation stuff. We've seen this already. More valuation. More valuation. Is this? Is? Percent evaluation. 52 week. I don't see anything in here that shows like percent of portfolio. But I don't think this is the same page. What's the stock? What's this look like? Yeah, it didn't. All right. So it's sold off. And that that was the thing. It looked like it might still hold up well, even if we'll. Some of the questions",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 112,
      "start_timestamp": "02:35:10",
      "start_timestamp_seconds": 9310.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9310"
    }
  },
  {
    "text": "percent of portfolio. But I don't think this is the same page. What's the stock? What's this look like? Yeah, it didn't. All right. So it's sold off. And that that was the thing. It looked like it might still hold up well, even if we'll. Some of the questions says this is better than a detective TV show. Do you realize that? Yeah, so funny. I yeah, I like trying to dive into this and see what we can find. Rointit, he says I think that is his portfolio. He has a very wide spreadsheet. Yeah. It just looks different than this. Because here I can clearly see this is in what DT. So it would be way further down. It could be. Oh, did you just see what I saw? There's Luna. That's funny. DDC, Intel, Zag. Yeah. So Rointit, I agree with you. T.C.M. King says here. He already had a GM yellow post only showing GME way before the date of the video. You just played. Oh, interesting. Very interesting. Yeah. So let's see. We have the first one in here. So the first one I see is September of 2020. Did I now go back far enough? So I think that's the first one that we grabbed. Let's go all the way down. Okay. So now all the way down at the bottom. This is the first that I see, which was 8 September in 2019. Interesting. Very interesting. So and this would make a",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 112,
      "start_timestamp": "02:37:28",
      "start_timestamp_seconds": 9448.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9448"
    }
  },
  {
    "text": "far enough? So I think that's the first one that we grabbed. Let's go all the way down. Okay. So now all the way down at the bottom. This is the first that I see, which was 8 September in 2019. Interesting. Very interesting. So and this would make a lot more sense too. Because I think at this point, what I see here then is I agree with you that this is like just a straight up yellow account. And then he had stuff elsewhere that was doing other stuff. That's a great point. What a great find. Because this is definitely from 2020. So we saw exactly to your point. We saw the really concentrated GME position. Now here's the part that doesn't make sense to me then. Why is it here only at 16? Let's see what the position is here. Let's see if it mirrors what we find around 28 August 2020. We can see this. Does it show that actual position? Different accounts? Yeah. So it could be. That's the thing I'm trying to figure out. Is I want to see if whatever he's tracking in here is the same as his other account. But so I can see the percent of the portfolio, which is fine. I need to see like the number of shares, though. And I don't know if he shows that. Do you guys know? So if he does, that would be really helpful. Because then we could very, very easily",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 108,
      "total_chunks": 112,
      "start_timestamp": "02:39:09",
      "start_timestamp_seconds": 9549.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9549"
    }
  },
  {
    "text": "so I can see the percent of the portfolio, which is fine. I need to see like the number of shares, though. And I don't know if he shows that. Do you guys know? So if he does, that would be really helpful. Because then we could very, very easily identify if he's mirroring the position here or elsewhere. Or if it's like a completely separate account. I don't see it here. Damn. Damn. Daniel. Damn it. Okay. So that's something that we're going to have to add that to my to-do list for the next one that we do. So we need review, archives, 2024 trades, and analyze live streams to parallel, current portfolio, or to parallel, or multiple portfolio, and to see if what he's reporting in or on Reddit mirrors what he's tracking in his port. Or in his excel sheet. Okay. Well, I got some instructions for the next one. Jonathan says, Eric, why don't you have a red headband complete oversight? That's because it's his. I have a tinfoil Viking hat. This is mine. I am again, I don't really copy people. I like to do my own shit. So this is exactly why. Okay. So we'll have to explore that because I don't know the answer to it yet. But what I want to see is if there's somewhere in one of these that shows us the number of shares he has, because then that will actually tell us a lot, a lot. And",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 109,
      "total_chunks": 112,
      "start_timestamp": "02:41:36",
      "start_timestamp_seconds": 9696.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9696"
    }
  },
  {
    "text": "So we'll have to explore that because I don't know the answer to it yet. But what I want to see is if there's somewhere in one of these that shows us the number of shares he has, because then that will actually tell us a lot, a lot. And it'll help us explore a little bit more about the multi portfolio theory and like what it could look like. Because I do think that there's a lot behind the theory right from this from the jump, right? The fact that we see 100,000 here. And then we obviously can see that he has other stuff elsewhere right from the jump that it looks like he's kind of tracking in a centralized spot. And then likely executing in different places. So I can totally, totally see that. So yeah, I'm interested to see what we can learn from that though. Because here we can see the overall snapshot. All right, gang. It is time for me to wrap up. Go grab some dinner. Absolutely blast to hang it out as per always. I'm looking at doing a live stream with Peruvian bull this coming week. We shifted it from this past week because I had to go get the shots in the old disc. So we're going to try to reconnect. I think this coming Thursday at 1700 Pacific time. So come hang out. I think I haven't talked to him before. So I don't know much about his background.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 110,
      "total_chunks": 112,
      "start_timestamp": "02:43:49",
      "start_timestamp_seconds": 9829.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9829"
    }
  },
  {
    "text": "past week because I had to go get the shots in the old disc. So we're going to try to reconnect. I think this coming Thursday at 1700 Pacific time. So come hang out. I think I haven't talked to him before. So I don't know much about his background. I just got connected with them. And I thought it would be fun to meet him. Have a conversation. Explore his understanding of you know, GameStop, what he's seen and you know, just bullshit a little bit about different ideas. So that's the game plan. As always, if any of you need anything, hit me up. I'm always around. Be an outlier, be an ape, be an outlier ape, whatever most closely you identify with. But most importantly, enjoy the rest of your weekend. I'll see you all around. Take care.",
    "metadata": {
      "video_id": "NRNqMP0AULs",
      "title": "Analyzing Roaring Kitty's Trades Pt4 | GameStop Analysis Live Ep12",
      "url": "https://www.youtube.com/watch?v=NRNqMP0AULs",
      "upload_date": null,
      "duration": 9954.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 111,
      "total_chunks": 112,
      "start_timestamp": "02:45:01",
      "start_timestamp_seconds": 9901.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NRNqMP0AULs&t=9901"
    }
  }
]