[
  {
    "text": "What up outliers quick market update. We're going to go through the markets writ large talk about some upcoming news. I want to talk about my sicky loss because those are always fun for everybody. I want to talk about crowd strike the rally that's going on there and then I want to take a look at GameStop and Chewie both because I had a couple questions on each of those. Not going to lie, a couple minutes late today because your boy was watching a rugby highlight reel that completely captivated me for a while. I love rugby. So it was a super sick video, but we're back in the office now. I read it rock and roll. So what's going on today? Well, a few things realistically. I think when I look at the market today, there's kind of one big thing that I point out, which is this right here retail sales month of our month came in at one versus 0.4 versus the prior being at negative 0.2. What does this all mean? Well, it means that this is like the largest expansion in this metric for like the last year and a half. The reason why this matters is because it shows that the economy is still relatively resilient. We're not seeing chargeoffs going through the roof. We're not seeing the link when he's going too crazy. So all of that in this case leads us to just essentially seen that the market is holding",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=0"
    }
  },
  {
    "text": "why this matters is because it shows that the economy is still relatively resilient. We're not seeing chargeoffs going through the roof. We're not seeing the link when he's going too crazy. So all of that in this case leads us to just essentially seen that the market is holding up fairly well. And if we take a quick look at the indices, now you can see an interesting realignment in terms of their price performance. This is what we were talking about not too long ago, whether or not this turns into a V shape recovery straight up to the highs and so far spy is running that route. Cuses not too far behind Russell's lagging. I get it is lagging bro. It's not even close this gap yet from the initial drop, whereas both cues inspire beyond that gap and they're starting to close in on previous highs. Cuses about halfway there. So I see a slight realignment of the indices, but it's not robust yet and I WM is still kind of the week one of the bunch. Now if we take a look at the Fed watch tool. We can see that the probability of a cut is still 100 or September 18th, but the probability of a 25 basis point cut is now higher. Why is that the case? Well, because the main reason we were looking at potentially a 50 basis point cut previously is because we thought and had pretty good indication that",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:01:00",
      "start_timestamp_seconds": 60.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=60"
    }
  },
  {
    "text": "cut is still 100 or September 18th, but the probability of a 25 basis point cut is now higher. Why is that the case? Well, because the main reason we were looking at potentially a 50 basis point cut previously is because we thought and had pretty good indication that the economy was like really starting to slow. So we thought the Fed might have to be a little more drastic in their plan and we saw this being priced in much higher if we go back in time here, you'll see not all that long ago. We were looking at a probability of a 50 basis point cut up at 55 a week ago and again that essentially corresponds with when we're going through this drop. So now we're getting new information and as always in Bayesian statistics, new information means new probabilities and that's what's going on here. So for me, when I look at the market here, it does look like it's starting to gain a foothold. It is, I don't think it's out of the woods. I think it's going to continue to be really really predicated on new news, but right now the news is good. It leads me to believe that large caps are probably going to continue to cruise along be happy move closer to these highs, unless there's a change of pace for whatever reason. We're also seeing the percentage of SP 500 stocks cracking above the 50 day moving averages over",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:02:16",
      "start_timestamp_seconds": 136.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=136"
    }
  },
  {
    "text": "good. It leads me to believe that large caps are probably going to continue to cruise along be happy move closer to these highs, unless there's a change of pace for whatever reason. We're also seeing the percentage of SP 500 stocks cracking above the 50 day moving averages over 66. We're seeing VIX continue to contract down before I get into my crappy trades. That's a good trade still the fading VIX is again, just such an easy trade not easy to carry sometimes it could be super painful. But it generally pans out sooner or later depending on how patient we are. I'll take a quick look across across the sectors. And it's a little bit of a mixed bag. So main areas of strength. I'm seeing really come down to things like XLP, XLR, XLU, XLV. You can see all of these are positive sloping on the standard deviation channels. So they are showing strength still, but many of them are starting to peter out just a little bit. And again, this is kind of normal, especially if we think this broader trend might start to resume. It would not surprise me at all to see XLK tech really start flying. And if it looks like it's going to be sustained, if it's not, I think these more defensive plays is just as far as broad sector themes probably hold out. All right. Now let's take a look at SIGGI with my world renowned trade that just",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=195"
    }
  },
  {
    "text": "tech really start flying. And if it looks like it's going to be sustained, if it's not, I think these more defensive plays is just as far as broad sector themes probably hold out. All right. Now let's take a look at SIGGI with my world renowned trade that just straight up straight up did nothing like I wanted. And by SIGGI, obviously, I'm in SIGGI, my bad. Yes. So I started entering it when it broke above this handle here. It looked interesting to the upside. I didn't take anything down yesterday, because I really did think that there was going to be a little bit more of a continuation. And then it opened gap down. Super sick for me. Now realistically, it doesn't matter. It's a super small trade. I got in right around when it was like 1060, close today at 962. So it's down like a dollar. But it's just super annoying that this thing that I really had pretty specific expectations for just at least as far as the continuation play just goes and does whatever it wants, which again, I bring these up as a reminder that is cool as our ideas might be the market does not care, bro. And this seemingly felt like it probably was more likely to go up then down and who knew it could do both at once because it gaped down, but then it went up big. It had a pretty massive up move, but from the",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:04:25",
      "start_timestamp_seconds": 265.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=265"
    }
  },
  {
    "text": "the market does not care, bro. And this seemingly felt like it probably was more likely to go up then down and who knew it could do both at once because it gaped down, but then it went up big. It had a pretty massive up move, but from the close yesterday, it was down like 19 or something. So yeah, still not a good move. I ended up flattening about half the trade. I'll leave half of it on because I don't think that the thesis is dead. And we're just ready for more gap moves. Ray for me. But I mean, for a little while on the open, it was ugly, right? Because if I start getting in around 1060, and then it opens down here at like seven, that that's a pretty big down move. But news driven trades like this row is much smaller allocations because I know exactly how these things go. It is a straight craps you. It's again, it's a numbers game. I'm trying to play things that probably realistically seem to me more likely to do one thing than something else, but it doesn't mean it's going to. So this is a great example of some of the things that did what I wanted, but also not at the same time did what I wanted in that it had a really big day from open to close, but didn't because that a giant gap down from the day before. Now let's pivot",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:05:28",
      "start_timestamp_seconds": 328.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=328"
    }
  },
  {
    "text": "great example of some of the things that did what I wanted, but also not at the same time did what I wanted in that it had a really big day from open to close, but didn't because that a giant gap down from the day before. Now let's pivot over really quick to GameStop. And this is a little interesting because one of the broad themes we've been expecting so far with GameStop is that some of the suppression that it might be experiencing is due to the broader small caps lagging. That's not really so much the case now. For the last couple days, small caps have started gaining a little bit of a footing and GameStop is still trending generally sideways. So we're seeing it now hovering right around the 22 handle. It's definitely consolidating, which is great to see moving averages are starting to kind of real line. Based on this movement, the longer term moving averages are going to be grossly out of lack because of these kinds of recent moves. So overall that parts generally good to see if we take a look at the options, they've gotten pretty busy here. So in here, I'm seeing the call OI at 738,000 put OI 350. So we are at the 2 to 1, which is again something I typically specifically look for in something like GameStop. And we can see that we're spread across the various expiration cycles. I see density still in 16 aug",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:06:11",
      "start_timestamp_seconds": 371.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=371"
    }
  },
  {
    "text": "I'm seeing the call OI at 738,000 put OI 350. So we are at the 2 to 1, which is again something I typically specifically look for in something like GameStop. And we can see that we're spread across the various expiration cycles. I see density still in 16 aug though some of these are going to be a lot of things that I'm going to do. And this further expiration cycles are starting to get built out like the 17 Jan notice it's here here here. It's kind of contesting for some of the bigger spots. So people are playing deeper options, which this is relatively new. They've been playing them here and there, but this is now becoming large enough positions that I think it's going to continue building out like a broader thematic position like these are obviously longer term plays of some sort. And so I think the reality where some of this can be hedging activity for institutions of some sort, I don't know either way. So I don't want to put a finger on it because I don't know. But we are generally seeing from an options perspective more of a build out in these specific explorations, which is again relatively new. Let's take a look at the volume for today, 104,000 against 29 so relatively quiet. And we're seeing 16 aug super busy. So the 23s had 900 transact the 22 7000 transact zone and so forth. So one of my guesses is",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:07:35",
      "start_timestamp_seconds": 455.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=455"
    }
  },
  {
    "text": "these specific explorations, which is again relatively new. Let's take a look at the volume for today, 104,000 against 29 so relatively quiet. And we're seeing 16 aug super busy. So the 23s had 900 transact the 22 7000 transact zone and so forth. So one of my guesses is to see if this is starting to establish out in other expiration cycles. So here you can see that 28 aug 25s are starting to move along. Did I say 28 aug 23 aug sorry about that 23 aug. So let's see. Yeah, you can see like all these greens. This is net ads. So these are people that are rotating somewhat from this front expiration. So you can see like this is getting taken down a little bit. These are still building up. I wonder if this will be the case leading into tomorrow. It looks like it will be because I see 3700 contracts here 5700 traded. So automatically essentially at least 2000 are going to be added, which is actually pretty surprising to me if I'm being honest, it was the day left. But I guess it's super cheap and kind of standard lot of plays. That's what looks like to me because I still am not seeing like that standard really bullish configuration that I talked about that I caught at the end of May or at the end of April early May, where you can see the options, she is getting really, really heavy, really",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:08:32",
      "start_timestamp_seconds": 512.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=512"
    }
  },
  {
    "text": "what looks like to me because I still am not seeing like that standard really bullish configuration that I talked about that I caught at the end of May or at the end of April early May, where you can see the options, she is getting really, really heavy, really concentrated. You can see stock volume starting to pick up. We're not really seeing much of that happening right now. So from an institutional standpoint or kind of a catalyst standpoint, one of the things I look for is just larger volume and the cool part about keeping your eye out for those kinds of things is that they don't happen overnight. They take a few minutes. So yeah, the volume in here isn't anything too crazy, but what I really want to see is where are we starting to build out after this week. Because after this week, open interest is going to dump quite a bit. There's 300,000 of this total ally in this front expiration that's going to go away after tomorrow. It's got to go somewhere. I'm very curious where it goes because I don't know if people are going to start building out for the earnings release on the fourth or if they're going to start moving out to the next primary expiration. Again, this is a really interesting product, but what I can tell you is like this kind of thing is fascinating that the 13 steps are going crazy. There's 113 vol in",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:09:59",
      "start_timestamp_seconds": 599.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=599"
    }
  },
  {
    "text": "earnings release on the fourth or if they're going to start moving out to the next primary expiration. Again, this is a really interesting product, but what I can tell you is like this kind of thing is fascinating that the 13 steps are going crazy. There's 113 vol in there as compared to the 86 volume seeing in six step and further in. So, so it's really hard to say, but this expiration cycle looks like it's starting to get a little bit more interesting and I don't exactly know why. If we check out 13 steps still super light super super light, let's take a quick look at the wall in there. I'm just curious if we can find anything to look at 13 step. Yeah, that's like you see how jagged that is. That's just misprice not I don't want to call it mispricing, but it's not agreed pricing on what the correct balls are for these different things. So the fact that it's all bumpy like that is not not normal. You'll notice that kind of this is more so. What in agreed volatility surface in this case smile will look like this is when there's discrepancies different people pricing things differently. This can also happen just when there's a wide market and it's just showing the balls there, even though that's not what they actually think the balls are that's super common to you don't always want to rest the order from market making perspective.",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:10:57",
      "start_timestamp_seconds": 657.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=657"
    }
  },
  {
    "text": "discrepancies different people pricing things differently. This can also happen just when there's a wide market and it's just showing the balls there, even though that's not what they actually think the balls are that's super common to you don't always want to rest the order from market making perspective. Based on the balls that you think it actually is you'll kind of rest dummy balls so that you're not showing your hands in terms of what you think of all actually is and then is somebody comes in to move the market, then you can adjust your quotes, but interesting. The other thing I want to take a look at quick is crouch strike then chewy so for crouch strike. It is starting like a this is the exact move I've been talking about and the ability to trade this in both directions is very interesting to me because had this big giant news driven sell off for lots of different reasons for relatively smaller problem, but pretty high severity. And it's starting to navigate its way out of here so this is a rubber band that's been expanded pretty massively and now it's starting to move back into value so I find that really interesting it's literally budding up against this volume note that's down here and then as long as it continues that moment and it looks pretty healthy now it does have earnings coming up, which has the ability to play a lot of games, but",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:11:59",
      "start_timestamp_seconds": 719.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=719"
    }
  },
  {
    "text": "value so I find that really interesting it's literally budding up against this volume note that's down here and then as long as it continues that moment and it looks pretty healthy now it does have earnings coming up, which has the ability to play a lot of games, but in this case after this kind of sell off I actually would imagine even if earnings is not great it still would be a positive catalyst. So this to me looks like a pretty concerted recovery play and again like it's just one I've been talking about for walks it's been such a fascinating case study and you can see that I mean moving averages are catching up underneath it's breaking up above here I like it essentially as soon as it starts breaking above this handle here and this is like the first warning shot that it looks like it's starting to get legs above like 243. If it breaks above this floor which it just did today above 255 starts to look stronger and stronger that doesn't mean that it flies right back up, but it looks like the downsides priced in from that move that's generally what I see here and then chewy. This is showing way more bullish drift so as I look across chewy and we take a look not at the implied volatility take a look at the options we can see 276,000 calls against 194 puts. So much tighter centralization and you'll notice",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:12:55",
      "start_timestamp_seconds": 775.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=775"
    }
  },
  {
    "text": "I see here and then chewy. This is showing way more bullish drift so as I look across chewy and we take a look not at the implied volatility take a look at the options we can see 276,000 calls against 194 puts. So much tighter centralization and you'll notice that we're all over on explorations we have stuff in 16 aug we have stuff that's out I'm guessing this is 25 17 Jan 25 we have stuff that's out in 27 so it's kind of all over the place. So the options markets in here are relatively conflicted but it does have earnings coming up and it looks like the 28th before the market and you can see that priced in beautifully here on the 30th. Expiration cycle 101 volume so pretty busy for chewy and it's starting to gain its footing above all the ma's it's definitely above the point of control at this point. It didn't even base that much in here it looks like the next volume node is essentially right here which now would serve as support technically speaking so we'll have to keep an eye on how chewy plays out from here so. A bunch of interesting stuff going on market starting to turn over a bit in a positive direction so as always if there's anything you need let me know. Throw it in the comments below be an outlier I see you guys later.",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:13:49",
      "start_timestamp_seconds": 829.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=829"
    }
  },
  {
    "text": "bunch of interesting stuff going on market starting to turn over a bit in a positive direction so as always if there's anything you need let me know. Throw it in the comments below be an outlier I see you guys later.",
    "metadata": {
      "video_id": "nSZp-hUSjdk",
      "title": "Market Rebounding | GME, CRWD, SIGA, CHWY",
      "url": "https://www.youtube.com/watch?v=nSZp-hUSjdk",
      "upload_date": "20240815",
      "duration": "",
      "channel_name": "Outlier Trading",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:15:00",
      "start_timestamp_seconds": 900.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nSZp-hUSjdk&t=900"
    }
  }
]