[
  {
    "text": "Hey everyone, Eric here with a very quick small stack portfolio update. I established a position in Pfizer that I think is pretty well positioned. I do think that it's going to be a little tough to manage in the small stack portfolio. I actually have it replicated in my margin account at a larger scale that I intend to manage a little differently and more actively. But nonetheless, I do like Pfizer here and I like them as a long term product. So that's why I entered into a call diagonal. So let's take a look at Pfizer first and kind of where they're at and then we'll jump over to the portfolio. So in general, Pfizer for the last two years has been coming down. If we zoom out to the last five years, it's still up trending and we see them between the mid and minus one standard deviation channel, which all sounds kind of part for the course. And then I see them approaching the minus one standard DV panel here. Now one of the reasons why I'm willing to get long here is I absolutely expect there to be a little bit more downside. But if you take a look at it, it's really not that large of a dollar value. So we're going to look at essentially 36 down to 33 to get to the minus two standard deviation. And more over than that is as soon as I can exit my XLE position,",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=0"
    }
  },
  {
    "text": "if you take a look at it, it's really not that large of a dollar value. So we're going to look at essentially 36 down to 33 to get to the minus two standard deviation. And more over than that is as soon as I can exit my XLE position, which is short puts, I'll have up, I'll have some recapital that I can apply to this trade that, you know, average my basis a bit and scale into the trade, which is 100 by my plan. A few notes. This is a, in my opinion, typically a very risky trade because we see the nine day moving average essentially is going to close before the 50 very shortly. And then we see price dropped below the 50 and the 200 day. That's typically not a good thing. However, I have a longer term perspective in this trade. So that's why I'm willing to place it anyways despite some of the technical indications that, you know, indicate to me, there might be a little bit of chop coming up. That's okay. I am definitely in this for the longer haul. So let's take a quick look at the portfolio and what we have going on. So first off, we still have X11 Zingua. Both of those positions are expiring on the second and the ninth of October respectively. So still not doing anything in either of these. XLF, pull that up quickly, is essentially hanging out very, very close to",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:01:14",
      "start_timestamp_seconds": 74.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=74"
    }
  },
  {
    "text": "what we have going on. So first off, we still have X11 Zingua. Both of those positions are expiring on the second and the ninth of October respectively. So still not doing anything in either of these. XLF, pull that up quickly, is essentially hanging out very, very close to my basis. But I still don't really see any sort of necessary adjustment to be done in there. We will leave that one alone. And then if we pull up Zingua, we see that that is just below my 8.50 basis. So I will leave that on at least for a while longer so that I can bleed out some more of the extrinsic value and then we'll go from there. So neither one of these are in any sort of position that I feel like I need to manage aggressively. Then we have Kroger. And Kroger right now still looks good. I don't have any adjustments to making there. We're short. The 36 call currently. So if I pull this up, we're short the 36, which is obviously looking completely fine right now with the product at 3462. Now this may be a situation where in the next day or so, I may close out that short call. Because if you remember, it's pretty short time frame. I have that expiring on the, I'm sorry, this one's on the ninth of October. So this one is a little bit longer. I was thinking about the prior trade. I might",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:02:26",
      "start_timestamp_seconds": 146.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=146"
    }
  },
  {
    "text": "or so, I may close out that short call. Because if you remember, it's pretty short time frame. I have that expiring on the, I'm sorry, this one's on the ninth of October. So this one is a little bit longer. I was thinking about the prior trade. I might take this off before earnings for a small profit and then establish a new position closer to the current basis because it'll still be above my critical strike and capitalize on that earnings increase in volatility right out another shorter term trade and then establish a new longer term position. So that's what I'm looking at in Kroger. And then in Pfizer right now, I established a one to one ratio. And I just realized I mixed up the positions in Kroger were short the 36, not the 36, 36 is in Pfizer, sorry. And then in Pfizer, I'm long the 28 call that is expiring 16 July 21. And I paid 8.54 it and then I am short the nine October 36. The reason why I did that is in my small stacks account, I went a little further out than I did in my margin account. And I also made sure to essentially try to collect as much money as I can. I like to trade these at a ratio, which doesn't cap my upside. But this is what trading a small account is all about. So I think making sure that when I can scaling into the",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:03:49",
      "start_timestamp_seconds": 229.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=229"
    }
  },
  {
    "text": "also made sure to essentially try to collect as much money as I can. I like to trade these at a ratio, which doesn't cap my upside. But this is what trading a small account is all about. So I think making sure that when I can scaling into the trade, purchasing another leap so that my upside is not capped is certainly the goal once I figure up some capital. But for the time being, this is just how it goes trading these smaller accounts. So that's why I favored setting the short call a little further out in time so I can collect a little bit more money. The overall trade is honestly really well structured. It's over a 16 return on invested capital. I put up 8.50 and I took in 138. It's really just a well, well set trade. So we will see how this one plays out. I definitely like Pfizer longer term and it's involvement with COVID. I think there's a lot of potential there. And as kind of how I've been, I'll continue updating the portfolio as I make different moves. If anybody has any questions on anything I'm doing, feel free to drop me a line. This is definitely a revisit for me. I haven't traded a small account for some time. And it is an interesting intellectual challenge that oddly enough, I welcome because I view these accounts as puzzles. You have to have the right pieces that fit together to",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:05:11",
      "start_timestamp_seconds": 311.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=311"
    }
  },
  {
    "text": "drop me a line. This is definitely a revisit for me. I haven't traded a small account for some time. And it is an interesting intellectual challenge that oddly enough, I welcome because I view these accounts as puzzles. You have to have the right pieces that fit together to make sure that you aren't putting this account in a bad spot. One of the things I'm very careful about is the correlation. And the correlation in a lot of these products is very low and that's by design. It's offering me some sort of inherent diversification in case one certain group takes a hit, not all of them necessarily take the same scale of hit. And that is very purposefully by design. So right now, total utilization on the account is 98.84, we're almost completely utilized. We have 4,942 that is currently committed. We do have a realized gain of 64. So realistically, my capital is 5,064. I just didn't bother inputting that yet. But my utilization is most certainly pretty high. So that is all good. That's what I expect to see in a smaller account. Now as the market starts to capitulate, maybe time to sit out for a while and just let the trades work because I do not want to start aggressively trading these and building up losses. It's one of the main goals I have to avoid in this account. But I have no problem taking assignment on either X, Zingha and just holding",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:06:21",
      "start_timestamp_seconds": 381.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=381"
    }
  },
  {
    "text": "for a while and just let the trades work because I do not want to start aggressively trading these and building up losses. It's one of the main goals I have to avoid in this account. But I have no problem taking assignment on either X, Zingha and just holding it for very much as long as I need to because I like both of those products long term to the upside. And we'll kind of play it out, see what the market shows us. So as always, anything you want me to talk about or any questions? Let me know and I will catch you really later.",
    "metadata": {
      "video_id": "NxU5WXfFKC8",
      "title": "Portfolio Update - Small Stacks Pt6",
      "url": "https://www.youtube.com/watch?v=NxU5WXfFKC8",
      "upload_date": "2020-09-09T01:32:57Z",
      "duration": "PT8M21S",
      "channel_name": "",
      "description": "I review my current portfolio and share a new trade I established in PFE. Current account is nearly 100% utilized.",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:07:46",
      "start_timestamp_seconds": 466.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=NxU5WXfFKC8&t=466"
    }
  }
]