[
  {
    "text": "I'm back with you and Sinclair. Welcome to the Outlier podcast where we're going to talk about trading. This is you and like half a dozenth time on the channel. So he knows that I am the resident lay person. He breaks things down for me pretty simplistically. Hopefully so that you guys can learn some stuff along the way. First off, you and welcome back. Yeah. Thanks for having me. Pleasure chatting with you once again. We were literally just talking about what I think to be a pretty interesting concept, which is why I wanted to hit the record button here. We were kind of talking about this idea of time behind the screen and how that translates into profitability. I cut you off abruptly. I apologize for that, but it was really interesting stuff. I was hoping I could re-engage your thought process there and have you share it with the broad audience? Yeah. So I'll try and sort of go back to what we were actually talking about. Is this idea that people have that the more time they spend trading or the more effort they put into trading? So not even time, right? It's like, you know, we all know smart is better than longer, but they think that the more effort they put in the more money they will make. And that's not unreasonable to think that because that's true in most things in life. If you're a baker, you get paid to bake",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 60,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=0"
    }
  },
  {
    "text": "you know, we all know smart is better than longer, but they think that the more effort they put in the more money they will make. And that's not unreasonable to think that because that's true in most things in life. If you're a baker, you get paid to bake cakes. So the more cakes you make and the more time you spend making cakes, the more money you will make. But trading isn't like that. The payoffs are very heavily skewed to the first initial observation you make. So here's the simplest one that I can think of. Stocks go up. Okay. Now that is the most well documented fact in trading. Stocks go up over the long period, all the data we have in every country we have, that's like the closest thing to an unassailable law of nature. So once you know that, you go and buy some stocks, right? Buy and hold. That's your plan. It turns out beating buy and hold in any sort of way that we can judge someone's skill is astonishingly difficult. So timing the market seems to be very close to impossible. Not I'm not saying it's impossible, right? But the amount of effort you have to put in to do that, you might turn your sharp ratio from buy and hold from a half to like 0.55, maybe. And even if you're good at picking hops, the times you miss the market will still be going up. So you're going",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 60,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.84666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=98"
    }
  },
  {
    "text": "amount of effort you have to put in to do that, you might turn your sharp ratio from buy and hold from a half to like 0.55, maybe. And even if you're good at picking hops, the times you miss the market will still be going up. So you're going against that inesurable tide that the buy and hold guy has on his side. It's really hard to beat that. Stop picking is not quite as difficult, but it's still astonishingly difficult. And you'll hear someone say, oh, look, I called this, I bought this a bit. It's like, yeah, okay, but you know, there's got to be someone is there's got to be some losers, right? But if you look over time, look the professionals, these guys are better than your average dude behind a screen at home, right? They just are. They don't show any ability to consistently beat the benchmarks like none, like Warren Buffett who legitimately did for three decades, I think he absolutely crushed it, right? His sharp ratio was less than three quarters. So that's the amount of skill you need to beat the very, very simple observation. And that happens in a lot of things like with the variance premium, right? There's your observation options are usually overpriced. Well, if you come up with a really simple way to monetize that just by say, sell VXX, sell VIX futures, sell index options. Now these are all slightly different, but they're all based on",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 60,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.69333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=197"
    }
  },
  {
    "text": "of things like with the variance premium, right? There's your observation options are usually overpriced. Well, if you come up with a really simple way to monetize that just by say, sell VXX, sell VIX futures, sell index options. Now these are all slightly different, but they're all based on that same thing. And once you've done that, you versus me who I'm going to arrogantly say, I know more about this than you. Unbelievable. Out, cannot believe it. I'm going to have very, very, very high correlation. But once you're in the same trade as me, overall, all of the little details I put in, it's like, yeah, well, I mean, it just really doesn't matter. So it's well, I think people screw that up more than anything else. Because the one thing I guarantee you, if you trade more, you wrap up more costs, that's guaranteed. But what isn't guaranteed is you trading more actually adding anything. So that was basically what I was going to say to you before we went on air. Yeah. And I think it highlights an important point, though, especially for a lot of the newer traders, because there is this, and I mean, I can pretty still, well, remember this, there's this function where you feel like, you know, you have to, you have to grind more, you have to put more time in, you have to put more positions on in order to make more money. And then over time, you",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 60,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=296"
    }
  },
  {
    "text": "mean, I can pretty still, well, remember this, there's this function where you feel like, you know, you have to, you have to grind more, you have to put more time in, you have to put more positions on in order to make more money. And then over time, you kind of realize that's not so much the case. Now, how do you balance maintaining enough activity to diversify risk without being overactive? I think most risk diversification, well, the most effective way of doing it is diversifying across positions, rather than timing and actively trading one position. Because diversifying across positions doesn't really cost you much more. Like, it doesn't cost you more to buy 100 shares of one company and 100 shares of another company than it does to just buy 200 shares. Right. So that is the best risk mitigator. And a lot of the other tweaks and stuff you do, you're reducing variance of PL. Right. So in the options world, the more you restrict, the more you rebalance, yeah, you absolutely are maintaining exposure to the risk factor you want, but you're reducing variance. That's perfect. But you're also, again, racking up costs by doing it. And not just the cost of doing the trade, but if you're still in there staring at your screen all day, you're essentially your labor is going into that as well. And that's a pretty significant cost, right. Like if it's like me actively trading all day, versus some",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 60,
      "start_timestamp": "00:06:35",
      "start_timestamp_seconds": 395.38666666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=395"
    }
  },
  {
    "text": "it. And not just the cost of doing the trade, but if you're still in there staring at your screen all day, you're essentially your labor is going into that as well. And that's a pretty significant cost, right. Like if it's like me actively trading all day, versus some guy who just does a basically a buy and hold version of what I'm doing, you know, the analogous thing to it. I've got to sort of somehow make up 40 hours worth of my time on top of the money he makes. I mean, that's very, very difficult to do. So I think it comes back as well that people see professional traders. And I don't mean, you know, people who trade professionally. I mean, real professional traders, right. Someone who works for Susquehana, someone who works for Goldman and people see them at work all day. But that's a very different thing like it's a totally different game. It's like saying, you're in the army. I'm in the army, right, except that you're in special forces and I'm a cop. You know, you're in the same industry, but comparing like to like is kind of, I mean, it's just silly. Yeah. And you hit on something that I try to reiterate as much as I can because I think this is something that retail traders really struggle with. And it's kind of the friction aspect, the cost of doing business. It's hidden from them in a lot of",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 60,
      "start_timestamp": "00:08:14",
      "start_timestamp_seconds": 494.23333333333335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=494"
    }
  },
  {
    "text": "just silly. Yeah. And you hit on something that I try to reiterate as much as I can because I think this is something that retail traders really struggle with. And it's kind of the friction aspect, the cost of doing business. It's hidden from them in a lot of places now, right. Commissions are super low upfront commissions. So can you talk a little bit more about the friction side of trading because you talk about how big of an impact that that has on profitability, but then a lot of retail traders that don't fully understand that picture, they'll say, well, well, shit, Robinhood has zero commission. So I guess I'm doing really great. I should hedge all the time. Yeah, Robinhood does have zero commissions, but Robinhood makes money. It's not just by selling ads, right. They're making money by basically passing your orders off to someone else that payment for order flow situation, right. So they get paid to send their orders to Citadel and Citadel gives it gives you a shitty a fill. Then I get by putting it in through IB. Now, IB charges me a dollar for option. If I go through as a retail person, I think that's right. I don't know. I don't think it's like 50, 60 cents now for most, like most of the main platforms per option. Okay. So you don't see that on Robinhood. Because you don't get that, but what you do get is a crappier",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 60,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=593"
    }
  },
  {
    "text": "a retail person, I think that's right. I don't know. I don't think it's like 50, 60 cents now for most, like most of the main platforms per option. Okay. So you don't see that on Robinhood. Because you don't get that, but what you do get is a crappier fill from Citadel and it's probably worse. Like I would think that if you traded on Robinhood and someone else traded on IB at the doing exactly the same trades and exactly the same time, I think you'd probably do worse at the end of the year than you would on IB. Like a pretty sure those costs are going to be higher because name another industry in the world where the wholesale operator has high. A cost in the retail operator and if you're throwing shit through IB, you are slightly closer to wholesale than you are if you're throwing shit to Robinhood. And also it's like most of these retail platforms try and get people in with the bells and whistles. Right. So you'll have an app. You'll have a really nice way of measuring your risk and showing, you know, your PNL payoff under various scenarios and blah, blah, blah, blah. Now that's worth shit. The thing you should use to improve your trading is none of that. It's just the lowest costs because all of that other stuff. It is a worthless no, but it's not worth paying the amount you're paying in higher costs. Well,",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 60,
      "start_timestamp": "00:11:31",
      "start_timestamp_seconds": 691.9266666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=691"
    }
  },
  {
    "text": "blah, blah, blah, blah. Now that's worth shit. The thing you should use to improve your trading is none of that. It's just the lowest costs because all of that other stuff. It is a worthless no, but it's not worth paying the amount you're paying in higher costs. Well, give you give me a really nice platform that has all that stuff and then a crappy one that doesn't and they've got the same costs. Well, obviously, right. But it doesn't. It's like it's like how casinos give you free drinks. You know, I mean, they seem, they seem great, right? You can have a nice whiskey. That's a well dollar drink. I mean, the casinos don't not idiots. You think, you think TD Ameritrade's making all that nice looking stuff and not charging you for it just because they like you. I think you bring up another point that dovetails beautifully off of that where I don't think retail traders fully understand the landscape of how brokers fit into this world. Meaning I think a lot of them think, for example, like broker education. Really cool. That a lot of brokers will provide education, but I think they don't understand some of the inherent incentives on the broker side in what they're presenting to retail traders. What's your perspective on the way that the broker and retail customer relationship operates because I think a common thought process towards that is retail traders think like, oh, we're friends. They're",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 60,
      "start_timestamp": "00:13:10",
      "start_timestamp_seconds": 790.7733333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=790"
    }
  },
  {
    "text": "don't understand some of the inherent incentives on the broker side in what they're presenting to retail traders. What's your perspective on the way that the broker and retail customer relationship operates because I think a common thought process towards that is retail traders think like, oh, we're friends. They're trying to do everything they can for me because they like me, not fully understanding what it actually is. Yeah, it's some. I didn't thought of it like that, but yeah, people think, oh, that education platform that sends me to this brokerage. They really want me to do well. So they think the broker is their friend, right? But and then I think the market maker is their enemy. Whereas, in actual fact, the broker is your friend in the way a drug dealer is your friend. Sure, he's going to be friendly, but he wants you to buy the Dan drugs and the option trade broker wants you to do all the options. You think it's to coincidence that a lot of these people are pushing you to do iron condos every day. You know how much money that wraps up for the broker and commissions. So and conversely, the market market market doesn't give a shit about any of you. The market market maker doesn't think about retail at all. So yeah, it's. I mean, brokers want you to trade. And I think I think that's one of the problems where people are. This is one of",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 60,
      "start_timestamp": "00:14:49",
      "start_timestamp_seconds": 889.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=889"
    }
  },
  {
    "text": "conversely, the market market market doesn't give a shit about any of you. The market market maker doesn't think about retail at all. So yeah, it's. I mean, brokers want you to trade. And I think I think that's one of the problems where people are. This is one of the big deals with zero DTS, right? The edges and zero DTS are minuscule, but the costs are still the same. You're still paying like what do you say 60 cents an option? So you can pay 60 cents an option for a three month option or one that's got three hours left. So the costs relative to your edge just become enormous. But the broker isn't here. You're doing that every day. Just look at the numbers for him. And one of the problems and this is professionals as well. Costs are always small on any given day. Like your PL just from doing the options might be plus or minus 5,000 bucks. And your cost might be 50. But that's 50 every single day. You make 5,000, give me 50 bucks. You lost five, give me 50 bucks. I mean, it's like you're attaching a negative, an infinitely negative sharp ratio to a variable PL. So people don't want to hear this, right? They want to think, how do I improve my trading? It's like I do more research. I look at new indicators, all that kind of stuff. You improve your trading by reducing your costs. You",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 60,
      "start_timestamp": "00:16:28",
      "start_timestamp_seconds": 988.4666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=988"
    }
  },
  {
    "text": "negative sharp ratio to a variable PL. So people don't want to hear this, right? They want to think, how do I improve my trading? It's like I do more research. I look at new indicators, all that kind of stuff. You improve your trading by reducing your costs. You get the cheapest possible service you can. You negotiate the best rates you can. And then you trade as little as you can to maintain the exposure to the risk factor you want. So if that means you're accepting more variance around it. That's probably what you should do variance isn't your enemy. I mean, variance, it's not fun, but it doesn't cost you money on average. But. Cost you money to remove it. Right. And the thing you highlighted earlier is something funny, because I see this on Twitter a lot where people. They retail traders seem to like to make it like David versus Goliath, him versus, you know, them kind of thing where. If you make money that you're keeping it from the market maker, there's literally gifts and memes about that exact thing. And I always just chuckle when I see those, because it's just, you know, they're missing the broader relationship. But speaking of the market makers, I actually just did a video on this not too long ago, but it was a good question that came up. In on Reddit that I wanted to get your thoughts on, which is market makers, we know",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 60,
      "start_timestamp": "00:18:07",
      "start_timestamp_seconds": 1087.3133333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1087"
    }
  },
  {
    "text": "know, they're missing the broader relationship. But speaking of the market makers, I actually just did a video on this not too long ago, but it was a good question that came up. In on Reddit that I wanted to get your thoughts on, which is market makers, we know they're subject to order flow. They essentially are going to make markets as orders come in. There's a lot of this conversation about like a max pain strike and then potential stock market manipulation, depending on if we're very close. I think at least that's the most efficacious variant of that I've seen. Whereas, you know, some people will say, well, if max pain is 15 points away, you know, if it's a 100 product or whatever, they'll say, you know, it's like. The market maker's not moving at 15 points, man. Like it's just order flow is going to be what it is. But what are your thoughts on max pain? Let's say if it's 100 stock max pain is at one or one and right now we're trading at one hundred and a half. Okay, so I got a backup a bit. What the fuck is max pain mean? Yeah. Okay. And the fact I have no idea about that and I've been in the market making world for 30 years tells you an awful lot about what market makers think about it. I legitimately don't know what that strike means. Is that like the amount of gamma",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 60,
      "start_timestamp": "00:19:46",
      "start_timestamp_seconds": 1186.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1186"
    }
  },
  {
    "text": "mean? Yeah. Okay. And the fact I have no idea about that and I've been in the market making world for 30 years tells you an awful lot about what market makers think about it. I legitimately don't know what that strike means. Is that like the amount of gamma exposure they've got and that kind of stuff? It's where the highest national value of open interest lives. So the theory then is that the market makers obviously would prefer for those options to expire worthless if they had a choice. So the idea is that if they're very close that there would be some element of manipulation to attempt to get just over that hurdle. That's the idea. Okay, so that's a real effect without a doubt. And it's nothing to do with the market makers trying to do anything at all. What actually happens is the market makers just through the nature of their dynamic hedging. If they're long, right? So if they're long, they want the market to move, right? They're long volatility, right? They want movement. But the thing is if you're long in the market goes up, you sell stock. If it goes down, you buy stock. So the market makers manipulation is almost always screwing themselves over. So it's when they're long that they'll get pinned to a strike because the dynamic hedging is compressing things. And conversely, if they're short, they'll get driven away from the strike. So it's not manipulation. But if",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 60,
      "start_timestamp": "00:21:25",
      "start_timestamp_seconds": 1285.0066666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1285"
    }
  },
  {
    "text": "buy stock. So the market makers manipulation is almost always screwing themselves over. So it's when they're long that they'll get pinned to a strike because the dynamic hedging is compressing things. And conversely, if they're short, they'll get driven away from the strike. So it's not manipulation. But if you want to think of it as someone getting systematically screwed over, it's the market makers who are getting screwed over. It's not it's not retail and market makers can't push things with the exception of very, very small stuff. It's not a stock with a daily option, sorry, a daily, a daily stock volume of 100,000 shares. And there's a 5,000, 5,000 option position that's out there somehow. Yeah, that'll move the market. But if you look, if you take the SP complex and you look at the total amount of trades that go through as hedging for option positions. It's less than 1 of the daily volume. I mean, no one's manipulating the SP 500. I mean, that's like me standing at the dock and trying to push a battleship, right? It's just not going to move it. You know, it's market makers. If there's manipulation going on, it's not it's market makers getting pushed around by big customer flow. And it really is a it's a secondary tertiary effect. I think people like to talk about it because it removes the responsibility from them. But do you know, maybe do you ever watch madman? Yeah. Okay, so",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 60,
      "start_timestamp": "00:23:03",
      "start_timestamp_seconds": 1383.8533333333335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1383"
    }
  },
  {
    "text": "it's not it's market makers getting pushed around by big customer flow. And it really is a it's a secondary tertiary effect. I think people like to talk about it because it removes the responsibility from them. But do you know, maybe do you ever watch madman? Yeah. Okay, so there's a thing where Don Draper is talking to Pete and Pete's like going on about, I think this about you, I think this about you. And Don Draper looks at him in a kind of a blank way and says, I don't think about you at all. You know, and that's how market makers feel about pushing the market round and stuff. I mean, that too busy doing other stuff. If you're your market making stocks, you'll be market making options on three or four hundred stocks. You don't have the time and the energy and the bandwidth to go around pushing something around. Because, you know, I don't know, someone read it bought 500 options. I mean, it's just not going to register. So yeah. I think you highlighted it beautifully, though, where the retail traders looking for a boogie man, right? Like they want something to remove their own shortfalls and to be able to blame something. But you'll definitely see situations where you identify the strike and then the market rushes towards it. I mean, of course you will, but it doesn't have been systematically. And it doesn't have been big enough to actually do anything",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 60,
      "start_timestamp": "00:24:42",
      "start_timestamp_seconds": 1482.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1482"
    }
  },
  {
    "text": "their own shortfalls and to be able to blame something. But you'll definitely see situations where you identify the strike and then the market rushes towards it. I mean, of course you will, but it doesn't have been systematically. And it doesn't have been big enough to actually do anything with. I mean, you can't. Again, generally, you know, so I know there's going to be someone out there now who's mad about the fact that I just said that because it's reddit, right? People are mad on reddit all the time. It's grumpy. Yeah. Yeah, it's like, what am I going to be pissed off about today? So yeah, in general, it's just not really a market maker's aren't manipulating anything with the exception of the VIX market makers on the expiration where those guys are still screwing over the world. Talk a little bit more about that. VIX futures, settle to the print of the VIX on the open on a given day. You can manipulate the print of the VIX by trading SP options. So if you're trading, and particularly very far out of the money puts. So you can push that around a bit just by, for example, hitting all the beds or lifting all the offers that that's enough to shift the VIX settlement a bit. It's a big enough deal with the VIX where there was a people really complaining about it maybe three or four years ago and telling CBOE they should fix",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 60,
      "start_timestamp": "00:26:21",
      "start_timestamp_seconds": 1581.5466666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1581"
    }
  },
  {
    "text": "for example, hitting all the beds or lifting all the offers that that's enough to shift the VIX settlement a bit. It's a big enough deal with the VIX where there was a people really complaining about it maybe three or four years ago and telling CBOE they should fix it and blah, blah, blah. But they're not going to fix it. So if you look where the big market makers are, the other guys who are doing that. So they're not, you know, you're not going to convince those firms. Well, I'm not going to mention them, they don't want them suing me. You're not going to convince those firms to go along with the restructuring of that. But you could easily, you could easily fix it. You can have an averaging process over an hour or something or. I'm not used to be a really big deal in index. Futures as well. Like when I was trading in Germany, there were a couple of times when. Dissepplement to say the like the curve what it should have been sloping up, right? September should have been under December. But there were a couple of times when I was there where the December future settlement price was above the December price. And it was higher than the index itself had ever traded. Because of the way they settled the index, it was like to the first certain number of trades of each stock. So they don't have to be synchronous.",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 60,
      "start_timestamp": "00:28:00",
      "start_timestamp_seconds": 1680.3933333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1680"
    }
  },
  {
    "text": "where the December future settlement price was above the December price. And it was higher than the index itself had ever traded. Because of the way they settled the index, it was like to the first certain number of trades of each stock. So they don't have to be synchronous. And it's just, yeah manipulation manipulation like that happens. Because that's like an instantaneous thing that you can do with very small volumes. If you do it right. When you say very small volumes in that context, I still imagine like the VIX itself isn't like small. Obviously neither is the SP 500 products. So when you say like very small volumes. What like what is that? Because for retail traders, probably still huge, but. Oh, you're talking about multiple thousands of SP options. The big ones. But yeah, you do the numbers. I mean, these these guys aren't doing it randomly, right? They know that each point in the VIX is worth this amount to them. They know they can move the VIX by this amount by spending this amount on the options. Yeah, that is a thing. But. And then for that kind of phenomenon to hold true, is there do you think collusion between some of the different firms in order to move things more efficiently or is it just kind of each person kind of understanding that that's generally what people are going to try to do in their position anyways. I doubt that there's actual",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 60,
      "start_timestamp": "00:29:39",
      "start_timestamp_seconds": 1779.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1779"
    }
  },
  {
    "text": "is there do you think collusion between some of the different firms in order to move things more efficiently or is it just kind of each person kind of understanding that that's generally what people are going to try to do in their position anyways. I doubt that there's actual real collusion because people. Well, I was going to say people aren't stupid, but we've seen a couple of situations of collusion recently, right? In the metals market and then li-boar. I mean, if you're if you're dicking around with li-boar. That's, you know, that's a pretty big deal. And these guys were right what they're using a chat or WhatsApp or something. But anyway, I don't think these firms would be doing that because it's not one or two traders doing it. It's like more of a team effort. There was a thing that I saw. I'm trying to think of it maybe three or four years ago. I saw a way that you could. Sort of predict which way the VIX was going to get pushed on the settlement. Literally my next question. But I can't remember what that was. And also, I mean, I don't know if that was a long time ago. I don't know if it's still true. Yeah, because that actually seems like the kind of thing that would be right up your alley with some of the things that you talk about in terms of, you know, people finding edge through observable phenomenon.",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 60,
      "start_timestamp": "00:31:18",
      "start_timestamp_seconds": 1878.0866666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1878"
    }
  },
  {
    "text": "that was a long time ago. I don't know if it's still true. Yeah, because that actually seems like the kind of thing that would be right up your alley with some of the things that you talk about in terms of, you know, people finding edge through observable phenomenon. Yeah. It's, I guess the closest analogy would be market on clothes, order, and balances. Which is one of those things everyone thinks it's got to have some sort of predictive power, right? And people think first, if you know there's a big buy order, you can front run it or whatever. But it turns out by the time that's made public, it really, you can't. There's not much in that anymore either. So sometimes just because these things look like they're front runnable or fadible. I mean, doesn't mean they necessarily are. And I think you know, the order and balance than probably was. But it's just not really anymore. But look at it. There's a lot of things that I've heard you talk about that seem to fall into that not anymore category or is not as much. Just meaning in terms of like what kind of edge can be extracted or what provides edge, I guess is the right better way to phrase that. What's the 10 years from now look like? Do you think that a lot of the things that we do will continue to contract like that? Because even something like variance risk premiums,",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 60,
      "start_timestamp": "00:32:56",
      "start_timestamp_seconds": 1976.9333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=1976"
    }
  },
  {
    "text": "can be extracted or what provides edge, I guess is the right better way to phrase that. What's the 10 years from now look like? Do you think that a lot of the things that we do will continue to contract like that? Because even something like variance risk premiums, we know it exists. It's still there. It's been observable and it probably will continue to be there. But it's definitely contracted a bit. Do you think that it will get to the point where it's not worth the risk taken or that there will be another alternative? For that one, I doubt it. Two reasons first, it's been around for, you know, as long as we've known about options. So at least 130 years, we've known about this, right? So the fact that it's been low recently, although it wasn't in the first half of this year, you would have from killed it, right? So the fact it might have been low. It something's low for two years, but it's been big for 128 years. Statistically, that's not much in the way of evidence, right? And the other thing is there were just such sound. Psychological reasons for it being there. You know, if someone's taking risk away, they're going to pay for that. You know, and then options land. Options of risk neutral. They don't care whether you're the buyer or the seller. They think you're only interested in expected value, but it's not like that. When we're",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 60,
      "start_timestamp": "00:34:35",
      "start_timestamp_seconds": 2075.7799999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2075"
    }
  },
  {
    "text": "being there. You know, if someone's taking risk away, they're going to pay for that. You know, and then options land. Options of risk neutral. They don't care whether you're the buyer or the seller. They think you're only interested in expected value, but it's not like that. When we're talking about the movement of variance or premiums, what are some of the simpler ways that a less sophisticated retail trader can track that relationship? Well, it's really easy to track what it has been. And there's lots of measures of it. There's no such thing as risk premium, right? There are. It's a family of things. So one of the one of the ways you could do it is just keep track of the at the money volatility of say a constant tenor option. So like the SP 30 day in which you can legitimately do now. Who a day, right? The 30 day at the money volatility and then see what the subsequent. It would be 21 trading days, realized volatility looked like. So you can do that. The problem with the risk premium is you don't actually see it contemporaneously. Because all I know now, I know today what the implied vol was. I'm not going to know what realized vol was and for another month. You know, so you're comparing things going forward with a particular observation now. So it's difficult to do that. And it's very difficult to predict it. It seems like it would",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 60,
      "start_timestamp": "00:36:14",
      "start_timestamp_seconds": 2174.6266666666666,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2174"
    }
  },
  {
    "text": "today what the implied vol was. I'm not going to know what realized vol was and for another month. You know, so you're comparing things going forward with a particular observation now. So it's difficult to do that. And it's very difficult to predict it. It seems like it would be easy. Because you know, to mean reverting series. You would think it would be easy. And it's not impossible. But like I said, it's one of those things which really hard to beat the simple naive observation. That there's a risk premium. So I'm going to sell options every month and rebalance them. It's really hard. It's really hard to beat that by time in the market. You bring up two things. The first one I'm going to linger on because it was the last thing you said. This is just another saying I hear a lot. This is more for like, uh, equity trading. I see it used, but I'm generally just curious in your thoughts on the saying that time in the market beats timing the market. Of the most people over most prime periods that's unequivocally true. Pining the market. The problem with it is even if you get the fluctuations right. You'll be out of the market or short the market enough times that you're going against that tide. I mean, think about the market is literally giving you eight percent a year. So that's what you've got to beat by all of you a",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 60,
      "start_timestamp": "00:37:53",
      "start_timestamp_seconds": 2273.4733333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2273"
    }
  },
  {
    "text": "if you get the fluctuations right. You'll be out of the market or short the market enough times that you're going against that tide. I mean, think about the market is literally giving you eight percent a year. So that's what you've got to beat by all of you a little wiggling around. Furthermore, all of your little wiggling around. You got to pay tax on all those profits. And the more interest the more invested you are and the more often you're trading the worse your tax situation is going to be right because it's all going to be short term. Um, and you're actually trading all the time. So there's trading costs involved. It's very difficult to beat the market by timing it. I. It's more possible to beat the market by picking stops. I mean, again, not easy, you know, like Warren Buffett, like we were talking about before Warren Buffett who, you know, legitimately alleged his sharp ratio was about 0.74. You know, and I've seen people on. Twitter, Reddit, you know, whatever platform you like. Who are like, well, I'm not going to do all that work to get a sharp ratio one. Well, you know, go and tell Warren Buffett that he's wasted his life. Because getting a sharp ratio one, a real one over a long period of time. I mean, that's going to, that's going to put you in the hall of fame as a stock trader or as a long term",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 60,
      "start_timestamp": "00:39:32",
      "start_timestamp_seconds": 2372.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2372"
    }
  },
  {
    "text": "know, go and tell Warren Buffett that he's wasted his life. Because getting a sharp ratio one, a real one over a long period of time. I mean, that's going to, that's going to put you in the hall of fame as a stock trader or as a long term trader. So I mean, it's just, I think people have wildly unrealistic expectations. You know, the people who are like, I just want to make 1 today. Or even I want to make 1 a week. Really, that's nearly 60 a year. Can you do that? Oh, sure. Some years you will. Absolutely. But on average again, just get your calculator out and see what, you know, 10,000 compounded at 60 a year. See what you've got after two decades. You know, tell me if you think that's likely. Well, the follow on to that is a lot of times when people say time in the market beats timing the market, they'll add a secondary metric. I've seen different versions of it, but typically it's like, you know, if you miss the 10 best days, then your return drops to whatever. Right. I always curious. How to think about that? Because to me, that also would indicate that there's a pretty significant reward. If you can get decent at timing the market in intermittent time frames. I think most of us acknowledge that timing the market in very short term time frames is near. Again, I don't like using absolute.",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 60,
      "start_timestamp": "00:41:11",
      "start_timestamp_seconds": 2471.166666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2471"
    }
  },
  {
    "text": "Because to me, that also would indicate that there's a pretty significant reward. If you can get decent at timing the market in intermittent time frames. I think most of us acknowledge that timing the market in very short term time frames is near. Again, I don't like using absolute. It just seems near impossible. It might be doable, but it seems very difficult. But what do you think about the capacity, the time markets in more moderate time frames? Because we do know a few things about markets in long run series. I don't think that's particularly easy either. If you think back to the two biggest market crash events of my life. Well, certainly. Anyway, the 2008 crisis, right, when stocks absolutely crazy. I knew plenty of people who sold the bottom of that one. And these aren't like people who are, you know, idiots. These are like professionals who thought the market was going to zero. More importantly, COVID, right, the headlines from around COVID and all the sensible views on what would happen. Would have had the stock market absolutely crashing. The stock market had some of its best years after COVID. In 2021, the stock market was up 28. You know, it's like all of your sort of this is what's reasonable. Would have pointed you in the wrong direction. And then think of all the people who made a couple of famous calls back in the old days. You know, like someone who predicted",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 60,
      "start_timestamp": "00:42:50",
      "start_timestamp_seconds": 2570.0133333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2570"
    }
  },
  {
    "text": "market was up 28. You know, it's like all of your sort of this is what's reasonable. Would have pointed you in the wrong direction. And then think of all the people who made a couple of famous calls back in the old days. You know, like someone who predicted the 87 crash. And then they've been predicting crashes ever since. Right. Let's say you're an absolute legend and you predict a 10 crash. Did you also miss the 28 rally in 2021? Because that you've got to get a lot of 10 crashes right. I.e. make legendary calls a lot. And then you're going to have to get a lot of 10 in order to make up for a couple of bad ones. You know, so. Maybe, but I'm not going to waste my time doing it. I got other things to do. Yeah, I kind of see it in two different lights because to me, it seems like if you can get OK at it, it definitely would pay well. But then I also look at if you look at like a day traders typical life. Like the advocate against day trading, being like the only thing somebody does. I think it's good to diversify across time frames. But for a day trader, if you think about like a good day, they might take a point out of something on Monday, a point out of something on Tuesday, so on and so forth. And they might miss a",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 60,
      "start_timestamp": "00:44:28",
      "start_timestamp_seconds": 2668.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2668"
    }
  },
  {
    "text": "does. I think it's good to diversify across time frames. But for a day trader, if you think about like a good day, they might take a point out of something on Monday, a point out of something on Tuesday, so on and so forth. And they might miss a couple days. They might be down a couple days. But then, you know, I look at the aggregate performance for them. And a lot of times if they had a good week, they might make 10 points. You know, the underlying might have moved up 15 or 20 points. So it's kind of like your, you know, cycling to catch these small things, even though the positive drift or, you know, whatever the force was at the time, led to this bigger move that you then didn't participate in. Do you think that there's a middle ground for people that are looking to time things where if your goal is not so much to top tick or bottom tick. The goal is to generally ride the positive drift of things, but then decrease your participation in draw downs. Because I think that there's two ways most retail traders can do really well. One of them is make really good returns. If you can do that, but then the second is to avoid draw downs to not go down as much as the market because then you obviously have a better launch pad for whenever you can resume the upside. And",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 60,
      "start_timestamp": "00:46:07",
      "start_timestamp_seconds": 2767.706666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2767"
    }
  },
  {
    "text": "really well. One of them is make really good returns. If you can do that, but then the second is to avoid draw downs to not go down as much as the market because then you obviously have a better launch pad for whenever you can resume the upside. And not convinced that they're that they're any easier. The way to avoid draw downs, right, is deciding when the market's going to go down. And I don't, I mean, that seems to be a very difficult problem or you buy puts, which is almost always a bad bed because they're wildly overpriced, right. So I think they seem like different approaches, but I'm not sure they are. But I wouldn't take a little bit of issue with your first thing you were talking about about, you know, the market went up to 20 points and you talk 10 points out of it. I think that's legitimate. If you aren't benchmarking against the market. So let's say you put all your retirement savings into, you know, some mutual fund and you already look at every quarter. Good idea, by the way, right. But every day you come in and you're just trying to ride the fluctuations in something and go home flat. I think that's legit. I mean, that's sort of how I treated Bitcoin or the crypto space in general, right. I wouldn't want to be in crypto. I mean, I had no interest in being invested in any of",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 60,
      "start_timestamp": "00:47:46",
      "start_timestamp_seconds": 2866.5533333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2866"
    }
  },
  {
    "text": "trying to ride the fluctuations in something and go home flat. I think that's legit. I mean, that's sort of how I treated Bitcoin or the crypto space in general, right. I wouldn't want to be in crypto. I mean, I had no interest in being invested in any of that garbage with any of those garbage people who do that garbage stuff. But as something that sort of just wiggles around, yeah, that seems fine. So I think it's legitimate as a day trader to benchmark yourself against cash. And if you're making 10 points a week on that basis, that's terrific. It's a different thing to long term holdings. I don't want to say invest in different from trading because I'm not. They're both exactly the same thing, but they're on very different timescales the way we usually use those words. But you know, when someone says I'm not a trader, I'm an investor. Really, I mean, look up the definitions of what those things mean, right. And it's exactly the same gambling as well, right. All of them, you're putting money at risk in an uncertain situation with the aim of making money. I mean, it's all the rest of it is sort of. I mean, I don't know a lot of it's moralizing, I think, being an investor, that makes your goods sound human being being a trader. Well, that makes you sort of a risk seeker, but you might be a superstar and being a",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 60,
      "start_timestamp": "00:49:25",
      "start_timestamp_seconds": 2965.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=2965"
    }
  },
  {
    "text": "the rest of it is sort of. I mean, I don't know a lot of it's moralizing, I think, being an investor, that makes your goods sound human being being a trader. Well, that makes you sort of a risk seeker, but you might be a superstar and being a gambler, well, you're going to be, you know, lying on the side of the road drinking out of a, you know, a bottle of paper bag. But none that's true, right. I know gamblers who've made millions. And I know plenty of investors who've lost money. So. Yeah, but then what random pedantic terminology could people fight about if, you know, we don't nitpick terms. Well, I mean, that's the thing, right. I mean, well, nowadays people will never run out of things to be mad about. That's fair. Yeah. That's totally fair. Um, the, so this is another interesting paradox that I think is fun to talk about, which is. A lot of what we're talking about here is looking at historic reference periods observing something and then making an assumption about what it's more likely to do in the future. Right. How do you balance the idea of using a historic reference period, but then. And then, you know, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the,",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 60,
      "start_timestamp": "00:51:04",
      "start_timestamp_seconds": 3064.246666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3064"
    }
  },
  {
    "text": "using a historic reference period, but then. And then, you know, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, you would only see",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 60,
      "start_timestamp": "00:52:43",
      "start_timestamp_seconds": 3163.0933333333332,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3163"
    }
  },
  {
    "text": "the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, the, you would only see the differences between the three things, the two things, the two things, the two, the three, the, the, the, for the, the, the, though something is missing, bald straight ago, the that one was an initial prize, the example. The example, the example, just mentioned that it couldn't just enjoy the example, it was an initial prize. The example, just mentioned that it could get to the home where all the we're looking at, well, on the daily level, right? And I was just looking at this today, so I'm not, I know these numbers for a reason. I don't know every year. 2021, the market went up 27.5. But the average daily volatility on a daily level was 0.8. Right? So the daily randomness is about eight times as big as the daily drift. But the drift is the thing that we can predict. So there's always, what we don't know is always going to be way bigger than what we do know. So you look for these broad effects. Stocks go up. Carries are a good thing. Options are overpriced. Leverage ETFs go down. These have all got a lot of data behind them. And they've also got",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 60,
      "start_timestamp": "00:54:21",
      "start_timestamp_seconds": 3261.9400000000005,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3261"
    }
  },
  {
    "text": "don't know is always going to be way bigger than what we do know. So you look for these broad effects. Stocks go up. Carries are a good thing. Options are overpriced. Leverage ETFs go down. These have all got a lot of data behind them. And they've also got compelling theoretical reasons for why they're true. But you can't just look at data and say, well, this is what has been in the past. I think it's what's going forward. Because, well, there's got to be a reason too. And if you can't identify the reason, you're really, you're in a very unpleasant place because you don't know when your edge is going to go away. Because you don't really understand why your edge was there in the first place. If you're a high frequency trader, that's not a problem. You don't need reasons because you've got so much statistics. You've got millions of data points for a day. But if you're an option trader, the VIX has been around for what, 32 years. That's not a lot of data on a daily time frame. And volatility realistically moves on more like a weekly or a monthly time frame. You don't know very much about the VIX. So just doing analysis on that isn't, you need a theoretical reason on top of that. That's a really great way to think about that. Yeah, because it's something that I've always used more of a probabilistic explanation. But I think the",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 60,
      "start_timestamp": "00:56:00",
      "start_timestamp_seconds": 3360.786666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3360"
    }
  },
  {
    "text": "You don't know very much about the VIX. So just doing analysis on that isn't, you need a theoretical reason on top of that. That's a really great way to think about that. Yeah, because it's something that I've always used more of a probabilistic explanation. But I think the part that you highlighted there, that's something that I definitely will put in my pocket going forward is the idea of identifying a reason. Because I think that that does at least help us understand some of the pervasiveness. Whereas like I said, for me, I typically would just look at a recent part of the series and then just think it's more likely to look like that. Now, that leads to be fair. There are a lot of times when I do trades just on the statistics. I don't really know the reason. But I think you have to treat them very differently from ones where you do know the reason. I mean, I'm not saying that I don't over trade. I'm not saying I don't do stupid stuff on things that are marginal. Try and manage that tendency. But there are certainly times where I do trades just because something's always worked. Rather than I know why it's always worked. Right. It leads me to a follow-on question where we know volatility clusters. We know that it mean reverse. What are your thoughts on different ways traders can identify if it is likely to begin transitioning into a",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 60,
      "start_timestamp": "00:57:39",
      "start_timestamp_seconds": 3459.6333333333337,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3459"
    }
  },
  {
    "text": "because something's always worked. Rather than I know why it's always worked. Right. It leads me to a follow-on question where we know volatility clusters. We know that it mean reverse. What are your thoughts on different ways traders can identify if it is likely to begin transitioning into a different spot? The whole thing that's really difficult is to predict when it goes from a low volatility to a high volatility state. That's really difficult because all of those transitions are driven by something different. Volatility needs a catalyst in order for it to go up. It doesn't need a catalyst for it to stay low. That just means nothing's happening. Whereas when something happens, the something's always different. If I knew how to do that, I would be very happy. But on the other hand, you can identify when spikes are likely to revert because we've got data on the average length of spikes. Because it's difficult to predict that bit. But the decay process afterwards, that's basically what all of these garg-type models are modeling. The modeling speed of that mean reversion. That's possible. That is what all the myriad thousands of versions of garg-do. But to be honest, you can kind of get a decent idea of just looking what it's been like in the past. When the VIX spikes to 40, when it comes back down through 40, how long did it take to get to 20? Not just the average, but it got the",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 60,
      "start_timestamp": "00:59:18",
      "start_timestamp_seconds": 3558.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3558"
    }
  },
  {
    "text": "be honest, you can kind of get a decent idea of just looking what it's been like in the past. When the VIX spikes to 40, when it comes back down through 40, how long did it take to get to 20? Not just the average, but it got the spread of results there. Just looking at what's happened in the past to give you a lot of context for how things are likely to come down. It's much easier to predict that relaxation point than the spike. And predicting the spike, probably one of those things, I would put it into the, it might be possible, but it also might not be a very good use of your time and energy. Just because something's possible doesn't mean it's economically sensible to do it. Right. It seems to me what I like to do if I'm trading some sort of VIX product, looking at a more contemporary timeframe, depending on the duration of whatever my thesis is. Actually, a trade that I recently did that you would hate is when the VIX dipped below 13, I established a long position in the VIX using options. But I bought further dated deep in the money calls. And it's what I did in that thesis was look at the performance of the VIX over the last 18 months, the periods that I dropped below 13, the duration below 13, the subsequent move outs. And I'm curious why you think that that is",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 60,
      "start_timestamp": "01:00:57",
      "start_timestamp_seconds": 3657.326666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3657"
    }
  },
  {
    "text": "deep in the money calls. And it's what I did in that thesis was look at the performance of the VIX over the last 18 months, the periods that I dropped below 13, the duration below 13, the subsequent move outs. And I'm curious why you think that that is more difficult than the reversion back down. If there's a way to wait time frames, because we know VIX can stay low for a really long period of time. Yeah, that's interesting. There are times series analysis by its very nature works on a constant time slice. Right. So you say, look, what is the property of the daily VIX time series? What is more sensible in a way is to wait things in a different way. So you're waiting it by something else that indicates business. So maybe volume, maybe volatility, maybe you have a different way of slicing up your series. That is, it's an interesting research avenue. So if someone is going to try and research that themselves, that's where I would start. It hasn't been studied to anywhere near the same degree as the time series stuff, because it's the mathematics doesn't fit. It's not as easy to do. And like just coming up, if you want to measure the standard deviation of something, you need to have equally spaced things. So doing statistics on something that isn't a time series is much more intricate. And it's nowhere near as well study. But that I think",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 60,
      "start_timestamp": "01:02:36",
      "start_timestamp_seconds": 3756.173333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3756"
    }
  },
  {
    "text": "easy to do. And like just coming up, if you want to measure the standard deviation of something, you need to have equally spaced things. So doing statistics on something that isn't a time series is much more intricate. And it's nowhere near as well study. But that I think is a legitimate way of looking at things. I mean, I wouldn't tell you you're wrong for doing that. Typically, I think the problem with buying the VIX is, however you do it, through futures, through options, through ETFs, the carry you're paying on that basis is such a huge thing to overcome. And that's typically larger at low levels. So you look back to 2016, 2017. I think a couple of the lowest fall years, like ever. VIX decayed quite significantly. So typically those really low volatility periods are periods where that vol basis is really high. So I'm not saying you're wrong. And I think looking at it in that way is possibly interesting. But I haven't, yeah, it's not easy to put that way. And I haven't done it enough to say that you're wrong. There. Another slightly, I'm going to make a note of that. I might have a go at it at some point in something. It's been interesting to be honest. And I've been, I tinker with different weightings, different weight periods, different weighting tools. But because to your point, like that kind of trade, it's not something I would put on for nearly",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 60,
      "start_timestamp": "01:04:15",
      "start_timestamp_seconds": 3855.0200000000004,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3855"
    }
  },
  {
    "text": "might have a go at it at some point in something. It's been interesting to be honest. And I've been, I tinker with different weightings, different weight periods, different weighting tools. But because to your point, like that kind of trade, it's not something I would put on for nearly a decade, what we saw during the bull market. But yeah, it has been interesting. You know, one of the ways that's surprisingly good, if you've been putting on short vol trades, and usually that's the way to go, right? And you've been losing money. Sometimes even though you're losing money, it's not because the VIX is spiked or anything, it's just path dependency and whatever. And you know, there's a lot of luck involved and all that, that actual volatility is still where you think it should be. That sort of path dependent noise seems to have some predictive power of volleys bikes going forward. Not a lot. But you know, one of my friends, James, often says you shouldn't sell vol when short vol is being a deck. And that's sort of what he means. It's like the profitability of vol trades tends to be correlated over time as well. So that's an undeveloped research idea that might be worth looking at more. Yeah. Switching gear slightly, this was, I didn't see you talk about this stuff much in your book. So when I got this question for you on Reddit, I think it's a fair ask. It's",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 60,
      "start_timestamp": "01:05:53",
      "start_timestamp_seconds": 3953.866666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=3953"
    }
  },
  {
    "text": "as well. So that's an undeveloped research idea that might be worth looking at more. Yeah. Switching gear slightly, this was, I didn't see you talk about this stuff much in your book. So when I got this question for you on Reddit, I think it's a fair ask. It's completely different from like the more technical stuff we've been talking about. But essentially, somebody was saying looking for career advice from you, for people that are looking to go from retail trading to the professional side. And I imagine you have an interesting perspective there. You already covered some color around that based on how different they are. But what are your thoughts on that? Well, for a start, I'd emphasize again that they're often very different jobs. Like a retail trader, retail traders have practically no edge over a professional who's trading the same thing. Right? But if you're a professional and you're a dispersion trader, that's what you do. You come in every day and you do that. You don't get to decide, you know what, it's not working. I'm going to trade potato futures or whatever. You can't. You're part of a cog that you do your job. Right? And you're told what your job is. Whereas if you're retail, you don't have to do that. You can legitimately bounce around. So if that's your style and you're like always finding the busy thing or the new little micro edge, which is doable, it's not easy,",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 60,
      "start_timestamp": "01:07:32",
      "start_timestamp_seconds": 4052.7133333333336,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4052"
    }
  },
  {
    "text": "your job. Right? And you're told what your job is. Whereas if you're retail, you don't have to do that. You can legitimately bounce around. So if that's your style and you're like always finding the busy thing or the new little micro edge, which is doable, it's not easy, but people can do that. Because inefficiencies come along in various shapes and forms like encrypto, there was all that yield stuff that worked really well for a while and stuff like that. So you can't do that as a grow. So they are different jobs. In terms of making that transition, I'm not really very useful. I was going to say anymore, but probably ever we never hire or hired depending on what firm you're talking to. We never hired people from outside the core group. They would either be professional traders who are coming from another firm or people straight out of college. So you come to me and say, I've got this, this, this and track record. It's a pretty heavy reach for the firms I was at. But again, the firms I was at are just one little bit of the ecosystem. So you're probably better off trying to go to a hedge fund. I would think I think that probably less likely to be stuck into that. We go to these 10 colleges every year and interview students and hire the best ones. But it's a tough transition. And again, it's sort of like the",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 60,
      "start_timestamp": "01:09:11",
      "start_timestamp_seconds": 4151.5599999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4151"
    }
  },
  {
    "text": "off trying to go to a hedge fund. I would think I think that probably less likely to be stuck into that. We go to these 10 colleges every year and interview students and hire the best ones. But it's a tough transition. And again, it's sort of like the Army thing, right? Maybe you're the best MMA fighter in the world, but the Army doesn't want people who can fight, right? The Army wants soldiers. It's a different job. It seems the same, but it really isn't. Yeah, can you talk a little bit more about the hedge fund angle? Because that was actually my original thought too, especially because I think one of the things retail traders don't fully understand is that at least maybe I don't even understand either, but it seems like from what I've come across that most of the time, those kind of institutions are looking for math minds anyways. Like just like really smart people, PhD types, not to say that you can't break in otherwise. But it's not necessarily, you know, if somebody tries to go work at a firm and you tell them like, oh, I've been a retail trader for 10 years, like they're not going to give a fuck about that. That's my guess. Well, again, that would depend on the firm a lot. The thing about hedge funds is it's such a broad category. And it's there will there will be hedge funds that trade very much like",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 60,
      "start_timestamp": "01:10:50",
      "start_timestamp_seconds": 4250.406666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4250"
    }
  },
  {
    "text": "10 years, like they're not going to give a fuck about that. That's my guess. Well, again, that would depend on the firm a lot. The thing about hedge funds is it's such a broad category. And it's there will there will be hedge funds that trade very much like your what you think a retail trader trades like the problem with it is finding those hedge funds. Whereas like if you're looking at Citadel or a QR, yeah, they're not going to take some retail trader either. It's not so much they want math minds. That's sort of a bit that's not really to the degree you might think. Some firms do, but a lot of firms don't. And I mean, certainly the trade they're kind of trading I've sort of been around. The best traders are certainly not the ones who are the most mathematical. Although having said that, when I say not mathematical, I mean engineering degree from Cornell or something. So it's still pretty mathematical, but it's not I wouldn't consider the math people. But yeah, the problem with the problem with breaking into the hedge fund world is it's just so fractured. I mean, that's a that's more of a net working problem. I don't really know how you do that. What do you think the future for kind of more of the quantum firms will look like in years from now? Well, it's probably just going to be evolution of what's going on now.",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 60,
      "start_timestamp": "01:12:29",
      "start_timestamp_seconds": 4349.253333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4349"
    }
  },
  {
    "text": "a that's more of a net working problem. I don't really know how you do that. What do you think the future for kind of more of the quantum firms will look like in years from now? Well, it's probably just going to be evolution of what's going on now. Right? I mean, anything that can be computerized gets computerized. So the where that changes is the power of computers. Like, you know, 20 years ago, you just didn't have the computing power to do what they're doing now. But computers haven't really changed in their nature yet. They just become more powerful versions of what they were 20 years ago. But we're seeing now with the whole AI thing. Instantly, if you don't pay 20 bucks a month for GPT plus, you're insane. It's like the best 20 bucks I've ever spent. It's better than an intern by lot. So that kind of thing, that's going to get incorporated into trading much more. And I know there have been hedge funds for a long time who say we've used AI and blah, blah, blah. And they really didn't because up until recently, these guys who wrote GPT plus are the best there is. You know, some random dude at a hedge fund is not that guy. But this is that sort of level of AI power is definitely going to change things. So it'll be the same as it's been. There'll be fewer traders in 10 years because the",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 60,
      "start_timestamp": "01:14:08",
      "start_timestamp_seconds": 4448.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4448"
    }
  },
  {
    "text": "the best there is. You know, some random dude at a hedge fund is not that guy. But this is that sort of level of AI power is definitely going to change things. So it'll be the same as it's been. There'll be fewer traders in 10 years because the good traders will be able to, their skills will get leveraged over a wider universe. And the sort of the junior trader bit is going to keep getting more and more automated out of existence. But that's the way it's been going forever. You know, when I started, if you were trading stock options, you'd trade, you'd stand in the stock option pit and trade maybe options on two things or maybe three. Whereas now, you know, you'd probably be trading options on three or four hundred stocks. So there are fewer traders, but each trader is trading more stuff. So let's see that that's probably the evolutionary route that will continue to go down. It won't affect retail because you can still do all the stuff you do. But it will lower the cost structure on the professional side, which actually should help retail. It does get passed down eventually. No one's paying 50 bucks around turn for futures anymore. And same question, but for hedge funds. Again, hedge funds are difficult because they're such a broad thing. I mean, AQR is a quantum, you know, that's very quantitatively driven. They will be leveraging this computing power more and",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 60,
      "start_timestamp": "01:15:46",
      "start_timestamp_seconds": 4546.946666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4546"
    }
  },
  {
    "text": "eventually. No one's paying 50 bucks around turn for futures anymore. And same question, but for hedge funds. Again, hedge funds are difficult because they're such a broad thing. I mean, AQR is a quantum, you know, that's very quantitatively driven. They will be leveraging this computing power more and more. But if you're a macro guy, I mean, you're that's it's a totally different game. So I don't know, I mean, maybe it will be such a big change that those macro guys will actually be able to make some money. Not even gonna lie, that was going to be my next question. Do you think that it will increase the efficacy of macro specifically because one of the things I noticed from like any of the macro community, and again, this is just a personal anecdote from my own small purview. But it seems like a lot of those motherfuckers guess at a lot of fucking things and just keep guessing. And soon or later something's right, but if you look at like the actual percent accuracy, it seems so damn low. Well, you see, I know you don't know about baseball, but you probably watch some sports stuff, you know, NFL free games or something, right? And you see these guys who legitimately know an awful lot about football, right? I mean, I'm not maybe they're not geniuses, but they've been in the game. They know the game. They can't pick winners. I mean, I see macro",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 60,
      "start_timestamp": "01:17:25",
      "start_timestamp_seconds": 4645.793333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4645"
    }
  },
  {
    "text": "stuff, you know, NFL free games or something, right? And you see these guys who legitimately know an awful lot about football, right? I mean, I'm not maybe they're not geniuses, but they've been in the game. They know the game. They can't pick winners. I mean, I see macro as like sports punter tree for darts. I mean, it's just it's the same kind of thing. They're always looking to tell a story and there might be in the same way with sports gambling where there are happens, there's data, you can look at stuff, you can do stuff, people make money doing that stuff. Maybe that's where macro goes. Stop talking about bullshit stories about what you think will happen and actually do data analysis of what happens when this happens and so forth. One of the problems with macro is that all the situations are different, right? I mean, the war in Ukraine, totally different situation from the war in Palestine. Like they're both wars, people are getting killed on both situations, but in practically, you know, the dissimilarities between them are so much greater than the similarities. So maybe AI will be able to start sort of passing that kind of stuff together. Maybe. Why do you say maybe? To me, it seems like it would be pretty fair. I don't think it'll be like predictive in any capacity, but I think it probably could create some sort of like multi-point analysis between different things and",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 60,
      "start_timestamp": "01:19:04",
      "start_timestamp_seconds": 4744.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4744"
    }
  },
  {
    "text": "of passing that kind of stuff together. Maybe. Why do you say maybe? To me, it seems like it would be pretty fair. I don't think it'll be like predictive in any capacity, but I think it probably could create some sort of like multi-point analysis between different things and to decide if something is more similar or more dissimilar. And then maybe you can make a hypothesis off of that or you think it's too far of a reach. No, I mean, I think you could do something like a cluster analysis. Right. You know, whereas it's like they've done interesting stuff like that for sports as well, right? With basketball, once you do a cluster analysis of the commonalities between different players, it turns out there aren't five positions. You know, there's more like 11 positions. It's just you don't always have them all at the same time. You could probably do that kind of thing, whether it's so you could in that case say, I don't know, the war in Palestine is much more similar to the war in Northern Ireland than it is to the war in Ukraine, right? It's a guerrilla thing in an urban environment. There aren't tanks driving around and stuff and jet fighters. Maybe you could do that. That I know you can do, right? Whether that's predictive or not, I don't know. Yeah. There's a lot of things that are descriptive without being predictive. I think that's one of the things",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 60,
      "start_timestamp": "01:20:43",
      "start_timestamp_seconds": 4843.486666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4843"
    }
  },
  {
    "text": "environment. There aren't tanks driving around and stuff and jet fighters. Maybe you could do that. That I know you can do, right? Whether that's predictive or not, I don't know. Yeah. There's a lot of things that are descriptive without being predictive. I think that's one of the things I find so curious about that stuff is that I feel like what we see just in humanity on an annual basis is almost something we've seen some permutation of before, but it's always the confluence of all of those different permutations that create such different landscape at that given point in time. That's why I'm curious if AI will be able to kind of decipher all of those variables more successfully than the human mind. I think it will do better, but I don't know. There's just everything that are also complicated in different ways, right? It's like every president in the last 50 years at least has tried to solve the Middle East, right? Why haven't they? There's no solution. There's no, there was an easy solution. Then, you know, Gerald Ford would have done it or something. It's like there's no there's just no simple way to do this. Even when the walls stop, often people don't really know why that happened. The Northern Island thing just kind of stopped, and then they did all the negotiation and stuff, but it wasn't the negotiation that stopped it. It just kind of peed it out on its own,",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 60,
      "start_timestamp": "01:22:22",
      "start_timestamp_seconds": 4942.333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=4942"
    }
  },
  {
    "text": "do this. Even when the walls stop, often people don't really know why that happened. The Northern Island thing just kind of stopped, and then they did all the negotiation and stuff, but it wasn't the negotiation that stopped it. It just kind of peed it out on its own, and then everyone was sort of looking around for why did that end kind of thing. You know, so yeah, it's always just complicated. It's difficult. Like World War One, right? None of the people who got involved in World War One really wanted to get involved. It just sort of started happening and everyone found themselves all pulled into it. So, and that was like, you know, second worst war ever, right? And it was sort of something that the world was sort of at that breaking point, but you know, some archer Duke getting shot. I mean, realistically, who gave a crap about that? That wasn't worth, you know, how many 20 million people died or something? I don't even know how many people died in World War One. Actually, good question. I find out right now. I'm curious. What's your guess? Just combat and occasional, please? 20 million. That's actually a really insanely good guess. So total military and civilian casualties was 40 million. 20 million deaths right on 21 million wounded. The total number of deaths includes 9.7 million military personnel and 10 million civilians. Wow. So you're, yeah. Well, you read about the battles, right?",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 60,
      "start_timestamp": "01:24:01",
      "start_timestamp_seconds": 5041.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5041"
    }
  },
  {
    "text": "million. That's actually a really insanely good guess. So total military and civilian casualties was 40 million. 20 million deaths right on 21 million wounded. The total number of deaths includes 9.7 million military personnel and 10 million civilians. Wow. So you're, yeah. Well, you read about the battles, right? And like the number of people killed on the first day of the summer, it was like the size of a fairly large city. And now it's like a terrible war, right? I mean, we're talking now thousands of people, but you know, it's like three or four hundred thousand people died in the first six hours. And like, it's incomprehensible. Literally is incomprehensible. You just kind of imagine that, right? There was an entire generation of European men who just was missing. banished. Yeah. Yeah. That's actually this poster right here is of the Marines at Bellow Wood. And like the whole poster is there's, you know, Marines and Germans and gas masks. And one of them stab in one of them with a fucking bayonet, one of them shooting them with a pit, and they're just a mustard gas. So to your point, and that's still relatively recent, right? Bellow Wood's not not war one. So it's just it's fascinating seeing the evolution of warfare in that way. Yeah, it's, I mentioned it's got worsens a lot of regards, but it certainly got better in a lot of regards as well. Okay. Like the ability to treat people",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 60,
      "start_timestamp": "01:25:40",
      "start_timestamp_seconds": 5140.026666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5140"
    }
  },
  {
    "text": "right? Bellow Wood's not not war one. So it's just it's fascinating seeing the evolution of warfare in that way. Yeah, it's, I mentioned it's got worsens a lot of regards, but it certainly got better in a lot of regards as well. Okay. Like the ability to treat people is massive. That's why we actually see battlefield casualties going down so massively. Yeah. We see a lot more amputees coming back now, right? Because again, this is the five ability is so much, so much greater. Yeah. To wrap us up, I have one more question. Looking into the end of the year, not predicting anything, but I'm curious, is there anything that you are looking forward to seeing how it plays out into the end of the year, or are you just kind of going along business as usual? Yeah. I think in terms of market news, it's kind of continuation of what it's been. It's like all eyes on the Fed. The next earnings cycle is going to be I think pretty important. Just clearly we've got a fairly bearish sort of general attitude right now. I mean, bonds have gone down a lot. Stocks have gone down a lot. Gold's gone up. You know, Tesla's earnings were terrible. But it's sort of I think this earnings cycle is going to be relatively important for driving that narrative going forward. If enough of the big companies make money, people will suddenly be like, oh, well, maybe, you",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 60,
      "start_timestamp": "01:27:18",
      "start_timestamp_seconds": 5238.873333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5238"
    }
  },
  {
    "text": "down a lot. Gold's gone up. You know, Tesla's earnings were terrible. But it's sort of I think this earnings cycle is going to be relatively important for driving that narrative going forward. If enough of the big companies make money, people will suddenly be like, oh, well, maybe, you know, even in this interest rate environment, maybe things are not as bad as we thought. What do you think of the banks that started reporting already? Because I was actually surprised at how well they're doing writ large. Banks are tricky. Financials are always tricky because it's sort of what they're doing part of their business. You don't really know what they're betting on and what they're you have to actually go through what they're doing. So like banks can do really well in a really bad period. Like typically retail banks do better at high interest rate environments, right? Well, high-ish interest rate. You don't want 20 but you don't want zero either. So financials are always tricky in that regard. I'm not sure that particularly good bell weather for the rest of stuff. But once the tech start having more, I mean, we've already seen a few, right? But once they start coming online more, we might give us something like Nvidia again that'll shape things up. Yeah, because I was actually I do a YouTube live session with the community on Mondays and we were looking at the Wells Fargo release at a curiosity. I like",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 60,
      "start_timestamp": "01:28:57",
      "start_timestamp_seconds": 5337.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5337"
    }
  },
  {
    "text": "right? But once they start coming online more, we might give us something like Nvidia again that'll shape things up. Yeah, because I was actually I do a YouTube live session with the community on Mondays and we were looking at the Wells Fargo release at a curiosity. I like looking at banks for that exact reason because if you go through their documents, you can kind of see how they're making how they're losing money. And what I thought was interesting about it is that exactly, I mean, you already know this, but they're making good money in a lot of different methods. But then when you look at the customer facing side of business, it's suffering, like pretty good. And you can see it. Mortgage rates, originations, as you can tell, they're down, like massively auto loan originations down massively. But the next stuff's up a lot. Right. Because, you know, they're charging now for auto loans, what, like 7 in some cases, right? But what are you getting paid out on your bank account? You know, that spreads now enormous, right? I mean, people are still getting paid like 1 for bank accounts. So having like a 6 credits, but there is huge. Right. Yeah, it's interesting to me to just kind of see the the behavior of the customer side, right? Kind of continue building out what, at least what that landscape looks for them. Because this is, I know that I said I was wrapping",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 60,
      "start_timestamp": "01:30:36",
      "start_timestamp_seconds": 5436.566666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5436"
    }
  },
  {
    "text": "6 credits, but there is huge. Right. Yeah, it's interesting to me to just kind of see the the behavior of the customer side, right? Kind of continue building out what, at least what that landscape looks for them. Because this is, I know that I said I was wrapping up, but you just jog my mind on one other thing if you have a minute. I'm really curious your thoughts that I, again, I know that you're not an economist, but I know that you watch markets, you know, way more than I do. But I've been surprised at how strong employment is held. It has the performance of employment struck you as any kind of way. Yeah, I actually don't pay any attention to stuff like that. Like I'm always kind of shocked when like some big number like CPI comes out and I'm like, why the market moves so much, you know, up to 7. Someone pointed out to me, because I think the things like that, it's like I care what the market did. I don't want to care why it did it, but that kind of stuff, because I don't have any way of predicting what the market's going to do in advance. So I just don't really pay attention to it. I think one of the things though, on a sort of societal level with employment, it matters much more now what kind of jobs are being created, because we're seeing a lot of",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 60,
      "start_timestamp": "01:32:15",
      "start_timestamp_seconds": 5535.413333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5535"
    }
  },
  {
    "text": "what the market's going to do in advance. So I just don't really pay attention to it. I think one of the things though, on a sort of societal level with employment, it matters much more now what kind of jobs are being created, because we're seeing a lot of shitty jobs coming around, you know, jobs paid at minimum wage, jobs paid where you're on like contracts essentially that last a day. So I don't think it's as predictive of the broad market. The headline number would have been, as it was say 20 or 30 years ago, when jobs involved working for a company where you had like a whole bunch of sort of contractual protections and you've got a certain, you know, standardised benefit package across companies and stuff. That just doesn't really happen to the same degree anymore. So I'm not sure that number to me seems like something that we're going to have to kind of sort of reevaluate, have we measured it? And I know you can break it all down, right? But the headline number doesn't. Right. Yeah, and it's funny to say that because I actually fall very much into the same camp where when I look at unemployment and stuff like that, I kind of like two different parts of my brain when it comes to markets. Some of it is like, what can I trade? And then I do have the other side is just markets economy. I find this",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 60,
      "start_timestamp": "01:33:54",
      "start_timestamp_seconds": 5634.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5634"
    }
  },
  {
    "text": "camp where when I look at unemployment and stuff like that, I kind of like two different parts of my brain when it comes to markets. Some of it is like, what can I trade? And then I do have the other side is just markets economy. I find this stuff interesting. I really do. I find it very curious. And I know we've talked about this before. You think I'm fucking absurd for having that and you don't necessarily share it. But anyways, yeah. I mean, people, there are a lot of people who find things interesting. People like fishing, you know, because other people like to do something, I'm not going to say that it's impossible that you like it. But on the other hand, I mean, to me, fishing and reading the news are right up there in terms of why I just cannot see why someone would find either of those things interesting. I think it's fair. Well, you and I know it's a little bit later on a Friday for you. So we'll get you out the door. But I love talking with you. It really, you have a very interesting perspective on things. And as always, genuinely appreciate you taking some time to share what you know with at least my community. They always look forward to whenever I'm chatting with you. So sincerely, thank you for taking the time to hang out for a bit. No problem. I can go and watch the",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 60,
      "start_timestamp": "01:35:33",
      "start_timestamp_seconds": 5733.106666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5733"
    }
  },
  {
    "text": "as always, genuinely appreciate you taking some time to share what you know with at least my community. They always look forward to whenever I'm chatting with you. So sincerely, thank you for taking the time to hang out for a bit. No problem. I can go and watch the end of the All Blacks game. Perfect. Well, we'll I'm sure we'll be in touch soon, but enjoy the rest of your game. Thanks. Thank you, too.",
    "metadata": {
      "video_id": "nxxdC4PK2BI",
      "title": "Market Manipulation & VIX with Euan Sinclair The Outlier Podcast Ep 51",
      "url": "https://www.youtube.com/watch?v=nxxdC4PK2BI",
      "upload_date": "",
      "duration": 4485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 60,
      "start_timestamp": "01:37:11",
      "start_timestamp_seconds": 5831.953333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=nxxdC4PK2BI&t=5831"
    }
  }
]