[
  {
    "text": "What's up everybody, Eric here, back with you in and we have a bunch of stuff to talk about. It's been a few weeks since we've talked last, so I'm interested to learn a few things from you. The first thing is you just wrapped up a course. We've talked about that a little bit before we started recording, but how'd it go? Well, obviously it's not really up to me to say how it went, but the feedback we've got from the participants is really good. People really liked it. The Slack community's growing. It's pretty active. People are now sort of this cross-pollination of ideas. People are working on stuff and we've managed to keep it to very sort of evidence-based, very much like, I don't want to hear your fucking opinion on Tesla, whether it's going up or the Elon Musk is genius. I want you to like, on Thursday, Tesla calls are underpriced. Right, find the data, go and tell me is that true, that kind of thing. So it's working well in that regard. It was heavily oversubscribed. We'll probably do it again, maybe August. We limited it this time a little bit because we didn't know whether we could keep up with the questions and it kind of depends on, you got to get a workflow going, but that went pretty well. So I think if we did it again, we'd probably just have an open enrollment thing. So that's awesome. Yeah, I'm glad",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 52,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=0"
    }
  },
  {
    "text": "didn't know whether we could keep up with the questions and it kind of depends on, you got to get a workflow going, but that went pretty well. So I think if we did it again, we'd probably just have an open enrollment thing. So that's awesome. Yeah, I'm glad to hear one of the things I remember when we were first talking about it and I had a chance to look over some of the materials is like, I think you do such a good job balancing the higher theoretical slash math heavy aspects with the practical application. Because I think that's like one of the biggest niches, quote unquote, that's kind of missing when you talk about options is things tend to be either super theoretical or just some dude that doesn't really understand put-call parity, but it's just slinging options. And it doesn't seem like a lot of educated middle ground. How did you guys go about finding that balance between including enough theory, but not overwhelming theory, but including enough practical application, but not just focusing only on that? Yeah, I think in general, that's where you've got to be as a trader, right? I mean, there's options in our irreducibly mathematically complex and there's no point pretending none not. So on one hand, you've got the, you know, the the Chad who thinks it is edge everywhere and all you've got to do is fire out thousands of orders and he is going to make",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 52,
      "start_timestamp": "00:01:07",
      "start_timestamp_seconds": 67.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=67"
    }
  },
  {
    "text": "there's options in our irreducibly mathematically complex and there's no point pretending none not. So on one hand, you've got the, you know, the the Chad who thinks it is edge everywhere and all you've got to do is fire out thousands of orders and he is going to make so much money and he's worrying about what kind of Ferrari he's going to get at the end of the year, you know, and that's, although I also, you know, but and then you've got the professor at the other end who's like only sees the math and he thinks there's an edge in the math and neither of these people's right, there's no edge in math, there's no edge in knowing about options, but if you don't know about options and you're trading them, you're going to blow up. Absolutely, like they are complicated and they will get away from you very quickly. So there is definitely stuff you need to know, but there's a lot of other stuff that you get taught in college courses that you don't need to know at all. Like you don't need to know stochastic calculus and I don't think you ever needed to, you know, no one, none of the research is using that now anyway because all the stuff that could be solved, that way's being solved. So I think you've got a lot of math professors teaching the course, you know, basically from 25 years ago and that's no real",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 52,
      "start_timestamp": "00:02:10",
      "start_timestamp_seconds": 130.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=130"
    }
  },
  {
    "text": "to, you know, no one, none of the research is using that now anyway because all the stuff that could be solved, that way's being solved. So I think you've got a lot of math professors teaching the course, you know, basically from 25 years ago and that's no real use to anyone. So that's what James and I are trying to do is find that middle ground. And I think that's what I tried to do in my books as well. Obviously the books are written at a more, probably at a more mathematically high level, but they're not mathematics books. And I never, I was never setting out to impress people with mathematics. That's not the point. But you should be able to read them and just read through the equation and just trust me on what's going on there if you need to because it's the phenomena that's the important thing. And this is one of the reasons I wanted to do it with James is because he's very much on the same pages me with that. He's got much more of a Delta one background than I do and the honest trading Delta one is much more of a, it's more heavy on the trading side because it's less heavy on the theory side. So that's normally the way it works as things get theoretically more complicated, they trade in a more and more simple manner. One of the other things that I was actually rereading",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 52,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=192"
    }
  },
  {
    "text": "more of a, it's more heavy on the trading side because it's less heavy on the theory side. So that's normally the way it works as things get theoretically more complicated, they trade in a more and more simple manner. One of the other things that I was actually rereading through positional options trading, actually working through those differential equations the way that you are. So I'm curious if it's to help people understand the way that options are behaving in a real world or is it to give the theoretical background to them? I mean, it could be either, but the way my brain works normally with these things is say, I've got a problem. I want to figure out, I don't know, some sizing problem like if you're doing a certain trade, what's the best way to size it, right? So once you've got that idea, that you have to then convert it into a mathematical model so you can work through the implications of that model. So that's sort of the way I would do it with say the option pricing stuff as well, like the directional option pricing stuff, you're like, well, okay, what does it mean that there's a return in the underlying? Where does that flow through to the equations? You work through that and you see where it ends up the other end. So it's like you start with your assumption and you work through the mathematics to see where it takes you.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 52,
      "start_timestamp": "00:04:13",
      "start_timestamp_seconds": 253.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=253"
    }
  },
  {
    "text": "mean that there's a return in the underlying? Where does that flow through to the equations? You work through that and you see where it ends up the other end. So it's like you start with your assumption and you work through the mathematics to see where it takes you. So does that make sense? It does, yeah, absolutely. It's basically the way a physicist would approach the world. It's like you make an observation then you try and model that observation and see what the model leads you to. Hopefully it's something new. You want to get something new out of the model that wasn't just in the observation you made. Got it. Yeah, and I think that that's one of the cool things about when I was reading a lot of your work, even your older work is that it got me to think a lot more along those lines. People that took your course, what did you give them specific next steps on like, okay, this is what we showed you guys. This is what we think you should be focusing on next. How do you see their progression? I mean, to be honest, we call the course quant for retail. Because the idea was we were going to get a whole bunch of sort of retail traders or people who weren't options traders, like we had RIAs and money managers and so forth, we were going to teach them quantitative methods that worked. What it turned",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 52,
      "start_timestamp": "00:05:24",
      "start_timestamp_seconds": 324.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=324"
    }
  },
  {
    "text": "course quant for retail. Because the idea was we were going to get a whole bunch of sort of retail traders or people who weren't options traders, like we had RIAs and money managers and so forth, we were going to teach them quantitative methods that worked. What it turned out to be more though is retail trading for costs. Because a lot of the people we had, a lot of people had very heavy math backgrounds, like we had math professors, we had engineers, computer scientists. Their problem is much more that are on the academic side of things and they want certainty before they do a trade. So we thought we were going to be taking the, no offense, but the YouTube was and telling them slow down, do some work first, make sure you understand it, then do a trade. Whereas what we ended up telling these people is like, just don't be a pussy, do a damn trade. Put something on it, yeah. You're going to learn a lot more when you've got a trade on than you are by thinking about it before you put the trade on. And a lot of these people, they would say something like sell options on Friday night. And I'd be like, what's the best time to sell them? I'm like, I don't know, Friday night. And they're like, well, five minutes before the close or 10 minutes before the close. And I'm like, literally, I don't know. If",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 52,
      "start_timestamp": "00:06:22",
      "start_timestamp_seconds": 382.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=382"
    }
  },
  {
    "text": "would say something like sell options on Friday night. And I'd be like, what's the best time to sell them? I'm like, I don't know, Friday night. And they're like, well, five minutes before the close or 10 minutes before the close. And I'm like, literally, I don't know. If I want to go early, I'll do it 10 minutes before the close. If I'm sitting at my desk, I'll do it right on the close. It doesn't matter. And it's like, that's not the important thing. Two or three minutes here and there, it doesn't matter. And I'm like, well, could we find an optimal and I'm like, look, look, you're going about this the wrong way. You're going to waste time looking for an optimum, an optimal solution to something that doesn't exist. You'll find something, but it's meaningless. The only thing we know is we've got this broad effect. And the best you can do is throw shit at this broad effect and hope over time it wins. All these other little minuscule things really aren't the problem. So you'll learn a lot more. You can always make things better. But you've got to start doing the basic stuff before you really know what it is you have to improve. Because before you do a trade, honestly, you don't know what the weaknesses of your process are. Is it your execution? Is it your transaction costs? Is it the fact you're doing it on the wrong index?",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 52,
      "start_timestamp": "00:07:31",
      "start_timestamp_seconds": 451.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=451"
    }
  },
  {
    "text": "basic stuff before you really know what it is you have to improve. Because before you do a trade, honestly, you don't know what the weaknesses of your process are. Is it your execution? Is it your transaction costs? Is it the fact you're doing it on the wrong index? I don't know. You have to do the trade to figure that out. So that was really where we were bullying these guys to do. And they'll be like, have you tested this effect? Like we're giving them an effect, right? Very standard one. Bonds go up in the last week before the end of the month. Absolutely they do. So we're like, go and buy some futures, buy some TLT. And they're like, can I tell you some putts, brains? I'm like, look, you can do whatever you like. But why? Why are you doing this when the simplest thing? We've told you it goes up. What's the simplest way to make money from that? Buy it. OK, don't dick around and make it more complicated. The idea is to make things simpler, not more complicated. So you always want to trade the simplest, cheapest instrument. And that's never options. So if you need to trade options and trade options, but if you don't, that's great. That's a good thing. It's not a bad thing. So that's what we're hammering it. We're still hammering it about that. I like that. It reminds me of a saying that I tell",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 52,
      "start_timestamp": "00:08:31",
      "start_timestamp_seconds": 511.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=511"
    }
  },
  {
    "text": "options. So if you need to trade options and trade options, but if you don't, that's great. That's a good thing. It's not a bad thing. So that's what we're hammering it. We're still hammering it about that. I like that. It reminds me of a saying that I tell a lot of people, perfection is the enemy of progress, right? Like the idea is do something that you think is relatively well thought out and then optimize it over time. But yeah, if you try to find that perfection, but it also seems to really affect like you're talking about that crowd of people, the people that are really smart, super analytical, that they get stuck in this loop that they can't escape from. So speaking specifically to that audience, it's, tell me. See, I was briefly an academic. And when you say perfections, the enemy of like progress, in the academic world, you can't be perfect. But if you don't try to be, you won't be good enough. It's such a, the best analogy is like professional sports. It's such a competitive place that you have to do everything to be as good as you can. So that's the game that these people are coming from. And it's just that they're trying to apply that game into a situation where it really doesn't fit. So what they're doing is understandable. And I was like that as well. Like I definitely, that was my problem. I had to overcome.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 52,
      "start_timestamp": "00:09:45",
      "start_timestamp_seconds": 585.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=585"
    }
  },
  {
    "text": "the game that these people are coming from. And it's just that they're trying to apply that game into a situation where it really doesn't fit. So what they're doing is understandable. And I was like that as well. Like I definitely, that was my problem. I had to overcome. It's like I, I would wait for a trade to be perfect. And by the time, as a market maker, by the time the perfect trade turned up, 50 other people already done it. Because they're prepared to do it when it's pretty good. Not perfect. So I know the thing that's struggling with. And it's very common for people to be like, these academics, they'll never be good traders, blah, blah, blah. But the YouTube chatter probably won't be either. Everyone's got a separate group of problems they've got to get through. It's hard for everyone. So whether you're starting at this end or at this end, it's going to be difficult. But in order to be good, you've all got to end up in the same place. You know, just throwing trades out there isn't well done. You're not under trading, but you've got other problems. Right. Yeah, and that makes total sense. I think the thing that I'm kind of referring to is when before somebody is willing to try something, they want it to be perfect. Or they want to have a well-formed essentially as good as they can possibly get it structure. And I think",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 52,
      "start_timestamp": "00:11:00",
      "start_timestamp_seconds": 660.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=660"
    }
  },
  {
    "text": "and that makes total sense. I think the thing that I'm kind of referring to is when before somebody is willing to try something, they want it to be perfect. Or they want to have a well-formed essentially as good as they can possibly get it structure. And I think that they're, again, to your point that there's value in that. But I've always seen that same force, though, where the people that kind of trade long-term, they find this balance of both. And I definitely think that it's awesome that you guys talk so much about it. And I also think it's really cool that you continue to remind people. It's actually reentered my conversation cycle of trading the simplest product. Because one of the things that you'll, I'm sure you've heard, right? People are options traders or futures traders. And sometimes they might be, but it seems like from the retail perspective that might be limiting. So for that audience, though, that spends so much time trading, you know, specific products, what would you say to get them to be more open to trading a simpler product, i.e., maybe they think something's going to go up to go to Delta 1 versus buying out of the money calls or buying in the money calls that are far out in time. Like how would you get them to think about those two different value propositions? Well, I think part of the reason that people end up in the options",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 52,
      "start_timestamp": "00:12:09",
      "start_timestamp_seconds": 729.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=729"
    }
  },
  {
    "text": "to Delta 1 versus buying out of the money calls or buying in the money calls that are far out in time. Like how would you get them to think about those two different value propositions? Well, I think part of the reason that people end up in the options world is a very sensible one. It's because volatility is more predictable in direction. But most of the time, you can't predict the direction of a stock. You just can't, right? Especially on the daily level, like it's the most difficult problem in the world. Like everyone's trying to do it. It's not going to happen. 99 of the time. So you go into the options world for a very good reason. But then you get really hyper focused on that. And you find a situation where that isn't, it doesn't apply. And your mind is just stuck in this other world. So I think the thing to do is just to be, and this applies to all trades all the time, be very clear on what your age actually is. Like, ask yourself, like, what am I trying to do in this trade? What is the phenomenon I'm trying to monetize? So it's, yeah, bonds go up. OK, what's the simplest way to do that? It's not to buy a call spread. It's not to buy a one-year leap. But it's not, it's to buy bonds. And I think you have to, a lot of this is just about",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 52,
      "start_timestamp": "00:13:18",
      "start_timestamp_seconds": 798.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=798"
    }
  },
  {
    "text": "to monetize? So it's, yeah, bonds go up. OK, what's the simplest way to do that? It's not to buy a call spread. It's not to buy a one-year leap. But it's not, it's to buy bonds. And I think you have to, a lot of this is just about being very, very clear about what your actual age in any case is. You know, so often, yeah, I don't, yeah, that's it. That's the answer. Period. Yeah, but I think that it's a great way to frame it, to get traders to simply ask themselves, what's the edge? And then finding the clearest way to express it. Because one of the things that I picked up from one of your books, and I think it's a great way to frame it, is as soon as you start trading options, you're introducing a lot of other forces that might not even be part of your hypothesis. IE bonds go up. OK, well, as soon as you're buying options, now you're introducing volatility, time to get, like, all these other things. So I think it's a really great way to think about it. And speaking about volatility, one of the members from my community was asking about, well, first they were asking about volatility regimes, but then we bracketed down really what they were asking about is volatility surface regimes. And they're curious how you determine what kind of regime that we're in at a given point in time. Like, how",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 52,
      "start_timestamp": "00:14:24",
      "start_timestamp_seconds": 864.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=864"
    }
  },
  {
    "text": "from my community was asking about, well, first they were asking about volatility regimes, but then we bracketed down really what they were asking about is volatility surface regimes. And they're curious how you determine what kind of regime that we're in at a given point in time. Like, how do you essentially analyze a volatility surface regime? I don't really know what they mean by regime. Yeah. You mean, if it's in terms of parameterizing the slope or the term structure, I mean, there are ways of doing that, but I'm not really sure. The thing that I think most people get a little bit wrong is that the volatility surface 95 of the time just is kind of constant. I mean, the level of vol changes, and the term structure does flip up and down, right? But the actual shape of the curve doesn't change nearly as much as people kind of hope it does. So I'm not really clear on exactly what they want. Yeah. So what they were referring to was Colin Bennett's book, Trading Volatility, there's a section in there that talks about idealized volatility regimes. So things like sticky delta, sticky strikes, sticky local vol and jumpy vol, essentially. But it's talking about them in relation to the vol surface. The thing about all of those things is they're all idealized states that the world is never sticky strike. It's never sticky, whatever, sticky. What is the other one, sticky strike? That's what I",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 52,
      "start_timestamp": "00:15:28",
      "start_timestamp_seconds": 928.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=928"
    }
  },
  {
    "text": "vol and jumpy vol, essentially. But it's talking about them in relation to the vol surface. The thing about all of those things is they're all idealized states that the world is never sticky strike. It's never sticky, whatever, sticky. What is the other one, sticky strike? That's what I can't remember what they are, kind of tells you something, right? The world is never exactly one of those things. The world is always doing all of those things. And I think it's more of a, I don't know, an educational conceptual tool than actually one that you'd really hang your hat on too much. I mean, I really don't think about that stuff at all. So yeah. I think it makes sense to you how important it really is. Right. Yeah, no, and that makes total sense to me. I think there could be opportunities to trade it potentially. But when they first brought up vol regimes, I immediately interpreted it as is volatility in aggregate, high, low, or transient. That's what I originally thought. And then they kind of sent me the clip and I realized that they were actually talking about vol surface regimes. And I just similar kind of, because the following one question to that, which is what I'm genuinely curious about is how would you trade that? Okay, so if some of these vol regimes, if the market is really behaving like that, some of them are arbitrajable. Right. And I can't remember one",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 52,
      "start_timestamp": "00:17:01",
      "start_timestamp_seconds": 1021.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1021"
    }
  },
  {
    "text": "similar kind of, because the following one question to that, which is what I'm genuinely curious about is how would you trade that? Okay, so if some of these vol regimes, if the market is really behaving like that, some of them are arbitrajable. Right. And I can't remember one of my books talks about it a bit. The problem is they're never perfectly in that regime. So it's not like an ab, and that you're buying something and immediately selling something else. It's kind of like an arbitrage process. So it'd be like if you find something that moves in a sine wave. I mean, that's arbitrajable because you sell it there and you buy it there. And you can, so it's dynamically arbitrajable. Sure. But you can do it. And so when I said I don't use it, I definitely shade my delts as their way. So I don't use black, shoulder, delta for hedging anything. I use a total delta, which also includes the effect of volatility change as the underlying changes. So you use a total derivative instead of a partial derivative. So you do have to make some assumptions there about how volatility is moving. So I do use it a little bit, but basically I'm just using an empirical model. I'm saying volatility is doing this. So the amount of volatility does this as the market moves. And it's typically neither sticky, vol, nor sticky strike. It's somewhere in the middle of those two.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 52,
      "start_timestamp": "00:18:19",
      "start_timestamp_seconds": 1099.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1099"
    }
  },
  {
    "text": "So I do use it a little bit, but basically I'm just using an empirical model. I'm saying volatility is doing this. So the amount of volatility does this as the market moves. And it's typically neither sticky, vol, nor sticky strike. It's somewhere in the middle of those two. Yeah, you do use, I use basically an empirical version of it, which essentially is just looking at how that relationship has moved over the last, well, I think I tend to use like three to six months. Yeah, because I actually remember reading that book a while ago, and when I took a look at it, I started tracking it a little bit. And I noticed that most of the time it was like that sticky local vol and the other three scenarios were far less common, at least based on what I was observing. But it's interesting that you bring up like that total delta concept. Can you explain that a bit more? Okay, so this might be difficult to do without like a white board or something. Blacksholes delta is the derivative of the option price with respect to the underlying, assuming nothing else is changing. So it's a partial derivative. In reality, things other things are changing. In particular, the volatility is changing. So as well as devol, as well as the option DS, you have to have the option devol times devol DS. So you need to basically know your Vega times how much the",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 52,
      "start_timestamp": "00:19:38",
      "start_timestamp_seconds": 1178.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1178"
    }
  },
  {
    "text": "it's a partial derivative. In reality, things other things are changing. In particular, the volatility is changing. So as well as devol, as well as the option DS, you have to have the option devol times devol DS. So you need to basically know your Vega times how much the volatility of that option is changing as the spots changing. I see. So it's like if you've got puts and you go down, you can expect the volatility of that put to go up. Right. But again, depending on what vol regime you're in, if the curve slides like that, it's going to do one thing. If the curve doesn't slide and the put's going to move, it's going to do another thing. Emmanuel Durman wrote a paper on this a long time ago. But yeah, like every market maker will use a total delta like that because if you don't, you really are going to be mis- hedged. But it also matters more to market makers because they want to stay on the market. Their delta hedge is really going to immunize them from what the market is doing. So it's really important that they're matching what the market's actually doing. So they're not going to just use one of these simple regime models. They're going to be using an empirical model as well. Otherwise, it's not going to match. Then for like a typical retail trader, what do you see the efficacy of a total delta tracking for",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 52,
      "start_timestamp": "00:20:57",
      "start_timestamp_seconds": 1257.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1257"
    }
  },
  {
    "text": "actually doing. So they're not going to just use one of these simple regime models. They're going to be using an empirical model as well. Otherwise, it's not going to match. Then for like a typical retail trader, what do you see the efficacy of a total delta tracking for them as worthwhile, not worthwhile? I think it's probably not even worth dealing with. It's one of those things that to do it is going to be a lot of work. Like you'd have to come up with your actual empirical model of how does the vol of this particular strike move as the underlying moves? And it's going to be different for all the strikes. Like the amount of money is the most important one. But you'll also have changes in the wings and changes in the risk reversals. And it's a lot of work to track all that stuff. And then I'm not sure how you're going to make any money out of it because I wouldn't recommend most retail traders do delta hedging anyway. So whether you think something, if you just bring up your ID screen and it says this is the 25 delta put and your model says no, it's actually on a 28 delta. I mean, who gives a shit? It's like for you in order, as a retail trader, there's no difference practically between 25 and 28. It's like it's going to be lost. And you think you've made a difference, but really",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 52,
      "start_timestamp": "00:22:16",
      "start_timestamp_seconds": 1336.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1336"
    }
  },
  {
    "text": "your model says no, it's actually on a 28 delta. I mean, who gives a shit? It's like for you in order, as a retail trader, there's no difference practically between 25 and 28. It's like it's going to be lost. And you think you've made a difference, but really once you take into account all the uncertainty and the modeling to get to that 28 over 25, I mean, who knows? You could just be completely wrong. So I can't see it being useful to retail at all. I mean, most crop, like longer term, prop guys wouldn't bother using it either. It's really a market-making tool. You can see right on the market all the time. And that's actually the only context I've heard it in as well. So that's why I was curious if there was a use kit. I don't use it at all. So yeah, I think it's a market-making thing. Fair. One of the other questions that I got that's actually, it's a really fun dialogue because there's a lot of papers and a lot of research out there on it. And it is holding leveraged ETFs to essentially just increase buying hold returns, right? So the idea is instead of holding spy or IWM and the queues, you're holding the leveraged counterpart. And there's pretty like, interestingly, two camps. There's the one camp that says, oh no, drag is so bad that you can't make any money. And then the other camp is",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 52,
      "start_timestamp": "00:23:27",
      "start_timestamp_seconds": 1407.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1407"
    }
  },
  {
    "text": "right? So the idea is instead of holding spy or IWM and the queues, you're holding the leveraged counterpart. And there's pretty like, interestingly, two camps. There's the one camp that says, oh no, drag is so bad that you can't make any money. And then the other camp is saying, fuck you guys, it's good enough. I'm curious if it's something that you've studied and if so, what do you think about retail traders holding leveraged ETFs to enhance returns? Almost always not a good idea. There's a lot going on. It's not as simple as saying there's volatility drag. They always decay. They don't always decay. It's a very complicated process. For something very simple mathematically, it is a very complicated process, particularly because we don't know what the actual process of the stock itself is. So we know how leveraging it changes that process, but we don't really know what it was in the first place, see what I mean? So it's like you can say certain things if you assume it's a Brownian motion and then you leverage it, but it's not. So it's a very complicated process. So it's never as simple as saying they always go to zero. They do decay. The mean return will tend to be below zero, like I said. It doesn't have to be, and there are plenty of times when it isn't. Like some of these things have massively outperformed their reference product. Can't think of one off the",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 52,
      "start_timestamp": "00:24:39",
      "start_timestamp_seconds": 1479.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1479"
    }
  },
  {
    "text": "always go to zero. They do decay. The mean return will tend to be below zero, like I said. It doesn't have to be, and there are plenty of times when it isn't. Like some of these things have massively outperformed their reference product. Can't think of one off the top of my head, but I'm sure they have. It's basically a situation where as with any trade, there's an optimal size for the trade. So basically that comes back to the Kelly criterion. This is the optimal growth size. And if you leverage more than that, you're going to end up taking more risk and getting lower returns. And that's the side that most of these leverage ETFs are on. It's basically you've got the optimal Kelly size, which might be like 1.2 times leverage, and you've leveraged it to three times. So you're at the point where you're actually getting diminished returns because of that leverage effect. So if you want a really simple rule of thumb, take all of your long stock positions in your long-term stock holdings and replace them all by going short, the leveraged ETFs. So what's the leveraged cues? Does it SQQQ or something? That's one of them. And then there's T triple cues, yeah, because there's different layers of leverage, right? You can have a 2X3X. That's the typical breakdown. Yeah, and it's not again, okay. So normally the higher leverage ones will decay more, but there is a more volatile. But",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 52,
      "start_timestamp": "00:25:53",
      "start_timestamp_seconds": 1553.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1553"
    }
  },
  {
    "text": "something? That's one of them. And then there's T triple cues, yeah, because there's different layers of leverage, right? You can have a 2X3X. That's the typical breakdown. Yeah, and it's not again, okay. So normally the higher leverage ones will decay more, but there is a more volatile. But the bigger problem you have to really look at is your borrowing costs, which a lot of people don't look at. So like right now, there's, well, there's VXX, right? Then there's UVIXI and there's UVIXI. UVIXI is one and a half leveraged. UVIXI is two leveraged. So you might think that the two leveraged ones are better short than one and a half, but the two leveraged one right now has got a 22 borrow rate. Whereas the one and a half has got a 3 borrow rate. And if you look at the expected decay and put that in, turns out that the one and a half in this case is a better sale in terms of risk reward. Of course, it's UVIXI, which is now trading at like 2.7 or something because that determined for it to become completely irrelevant, I think. I don't know what the issue is doing there. I think they've just given up on it. Like they should have split it when it went to 20 and they should split it to get to like 200. It's a never, we know what's gonna happen. Or letting it go down to these levels, just",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 52,
      "start_timestamp": "00:27:20",
      "start_timestamp_seconds": 1640.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1640"
    }
  },
  {
    "text": "issue is doing there. I think they've just given up on it. Like they should have split it when it went to 20 and they should split it to get to like 200. It's a never, we know what's gonna happen. Or letting it go down to these levels, just you can't trade it. The transaction costs are just way too big. In like, what would the calculus be to just let it go as it's just becoming like too much of a burden or they're not making enough money on issuing, continuing to issue it? Like what's, to me, it seems like you've gone through all of the work to set it up. Why not maintain it until the wheels fall off? I have no idea what they're doing. Don't know, could be, could be a lot of things. Okay. But it's, it's got to the point where it's basically in a relevant product. You know, if you've got a bit asked spread of a cent and you're paying a ticket charge per share, why am I gonna trade something that's 2.7 instead of trading VXX like 35 or something? Yeah, it's just pointless. Got it. Another thing that is becoming more and more invoked lately that I find curious is the retail trader obsession with algos. And for retail traders, obviously, it's this brand new novel concept. And to me, it seems like there's just a tremendous amount of focus on it. And I think retail traders grossly",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 52,
      "start_timestamp": "00:28:32",
      "start_timestamp_seconds": 1712.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1712"
    }
  },
  {
    "text": "is becoming more and more invoked lately that I find curious is the retail trader obsession with algos. And for retail traders, obviously, it's this brand new novel concept. And to me, it seems like there's just a tremendous amount of focus on it. And I think retail traders grossly misunderstand how it might fit into their world and also just how long it's been around otherwise. Specifically for retail traders, how do you view AI more importantly, algos for this question, fitting into their portfolios or trading portfolios? You mean them using it as a way of generating alpha? Right. Let me do it. It's very unlikely that someone who's not a specialist is going to get some AI algo that can beat the market. It's, I'm not saying no one can. But if you look at the firms that are really going into this, they've got people with PhDs and machine learning. You're not going to do a course online or even an undergrad course and figure out enough to beat the market. You're not as good as these guys. It's one of those games where you're just not going to win straight up against these guys. So you have to do something else. I kind of think, I mean, I use ChatGPT all the time. But basically, it's like an intern. It's like instead of me trying to do something, and one of the hard things about having an intern is you got to explain very carefully",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 52,
      "start_timestamp": "00:29:34",
      "start_timestamp_seconds": 1774.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1774"
    }
  },
  {
    "text": "you have to do something else. I kind of think, I mean, I use ChatGPT all the time. But basically, it's like an intern. It's like instead of me trying to do something, and one of the hard things about having an intern is you got to explain very carefully what you need done. And that's the same as the GPT app, right? It's like you've got to be very clear about, I want you to do this and then this and then this. And under those constraints, it's fantastic. I can write hundreds of lines of code, and it will do it pretty well. It will do it a lot faster than me. And it's a really great tool. But in terms of using it to predict volatility or whatever, I'm not even going to. That's just one of those problems that, even if I can do it, there's better uses of my time. It's, I think, we have to be very clear that every time you do a trade, you're making a forecast. Like, there's some people had this idea, I don't forecast. Well, yes, you do. You just bought something. So you're obviously thinking it's going to go up. Otherwise, you wouldn't have bought it. So the action of doing a trades and implicit forecast. But I think this idea of like trying to out forecast the market like that, it's just a very difficult problem. And I think people are being somewhat seduced by this idea",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 52,
      "start_timestamp": "00:31:04",
      "start_timestamp_seconds": 1864.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1864"
    }
  },
  {
    "text": "go up. Otherwise, you wouldn't have bought it. So the action of doing a trades and implicit forecast. But I think this idea of like trying to out forecast the market like that, it's just a very difficult problem. And I think people are being somewhat seduced by this idea of alpha. They've got to get alpha. You don't have to get alpha. You've got to get money. You know, beta counts as money too. It's much more likely that you're going to benefit by finding risk premier that are always there. And you are going to essentially get paid for taking that risk. It's a much more likely outcome than you genuinely finding alpha by out forecasting the market. Could you, yeah, sure. And if you really feel like, if you want to do it as a puzzle, instead of like, I don't know, Sedoku or something, yeah, knock yourself out. But it's just not, it's not a very good way to run this if you're thinking of it as a business and really trying to make money. It's not the right way to do it. It's like with sports gambling, right? Everyone goes into sports gambling thinking, I'm going to predict who's going to win this game. And that's not what the pros do at all. Like the pros are basically saying, the spreads this, the totals that, therefore what should the equivalent spread in the first quarter be? And they're just looking at all these relative value",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 52,
      "start_timestamp": "00:32:13",
      "start_timestamp_seconds": 1933.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=1933"
    }
  },
  {
    "text": "going to predict who's going to win this game. And that's not what the pros do at all. Like the pros are basically saying, the spreads this, the totals that, therefore what should the equivalent spread in the first quarter be? And they're just looking at all these relative value trades. Like they practically never try and predict who's going to win an NBA game because that market is so efficient. It's the same with the markets. Right. So you kind of alluded to another topic that I wanted to ask you about, which is chat GPT and kind of retail traders using AI to just enhance their process. So from a retail trading perspective, what are some of the things that you think retail traders could or should do with something like chat GPT or AI in their trading process? I would caution them against using it at all. I think most people use the computer too much. It's this idea that you should automate all the stuff you need to automate. And people are like, well, jump trading do it. So it must be the thing to do. Jump trading kind of have to do it because of the way they trade. Like if you're doing HFT, you need to automate everything. If you're doing a million trades a day, you can't do that by sitting in front of a computer. But I think for your average retail person, you don't want to speed things up. You want",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 52,
      "start_timestamp": "00:33:25",
      "start_timestamp_seconds": 2005.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2005"
    }
  },
  {
    "text": "the way they trade. Like if you're doing HFT, you need to automate everything. If you're doing a million trades a day, you can't do that by sitting in front of a computer. But I think for your average retail person, you don't want to speed things up. You want to slow things down. You want to actually be more engaged because you want to learn. And the way you learn is by reviewing every step in the process. So it should be like, look at an options trade, right? It's a complicated thing. You have to make a forecast of what volatility is going to be. You have to choose your strike. You have to choose your expiration. You have to choose your re- hedging frequency. How did each of those impact your trade? At the end of the trade, you go back and you're like, well, my forecast was slightly optimistic. So I shouldn't have made quite as much money as I thought I would. But then this happened, and this happened, and this happened. And you actually have to think through the whole process. And you might find that you're actually really good at forecasting volatility, but you're hedging too sloppy so you're getting too much luck involved, and that's masking the results. And if you don't go through that process, you won't find that out. And you're not going to find that out by automating everything. You know, people ask, you know, what's the software that",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 52,
      "start_timestamp": "00:34:37",
      "start_timestamp_seconds": 2077.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2077"
    }
  },
  {
    "text": "you're hedging too sloppy so you're getting too much luck involved, and that's masking the results. And if you don't go through that process, you won't find that out. And you're not going to find that out by automating everything. You know, people ask, you know, what's the software that you should use? Like maybe Excel, maybe a Word document, but maybe a piece of paper and a pen. You don't want to be doing this fast. You want to be doing it as slow as you can. And people, so there's this thing everyone kind of knows that you should keep records, right? And people have the wrong idea of what that process is for. It's not about so you can go back and do statistical analysis on all your results from three years ago or whatever. I mean, I keep records of everything I do every day, but I have no idea where they are. Like I couldn't tell you where my files from three years are going to are, because that's not what they're for. What the four is for the process of making them, because it makes you sit down and think about each thing. And the slower you go through it, the more you're going to learn. It's about active learning. It's not about statistics. So even if you just do it on a legal pad and then throw it away, that'll be fine. It's not the keeping of them. That's important. It's the making",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 52,
      "start_timestamp": "00:35:38",
      "start_timestamp_seconds": 2138.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2138"
    }
  },
  {
    "text": "the slower you go through it, the more you're going to learn. It's about active learning. It's not about statistics. So even if you just do it on a legal pad and then throw it away, that'll be fine. It's not the keeping of them. That's important. It's the making of them. I actually love that. And it's probably one of the most common things I tried to talk to people about is literally the process. One of the things I do find chat GPT useful for, and I'm curious what your thoughts are on this. Specifically, if there's a concept, let's say they're reading your book and they come across a part that they're just, they're struggling with. What do you think about using something like chat GPT to help them understand that concept or look it up? One of my favorite things to do with chat GPT is essentially the 80, 20 rule, whatever you want to call it. I think it's Bernoulli principle or whatever. But essentially, the parade always at it. Yeah, thank you. The parade will principle where essentially you get a synthesized list of the highest impact information. Do you think that accelerates the process too much and they're not respecting the process in that manner? Do you view that as an accelerator? No, that can be useful. I use it for, so one of the things I did, and this was basically I did it because a student was like, trying to convince",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 52,
      "start_timestamp": "00:36:44",
      "start_timestamp_seconds": 2204.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2204"
    }
  },
  {
    "text": "process too much and they're not respecting the process in that manner? Do you view that as an accelerator? No, that can be useful. I use it for, so one of the things I did, and this was basically I did it because a student was like, trying to convince me it was a useful thing. And so I did this as a little test, but it's a useful way to, it was a good project. I'm very big on using Monte Carlo simulations. And I typically, I used to have a really great little Excel and then I got free with some book a long time ago, but it doesn't work on the latest versions of Excel. So I'd had to get a bunch of stuff. And then basically I told Jack, Jack GPT to write me one. And I gave it like two instructions. And it pretty much wrote the whole thing, exactly as I wanted to, and thought the results, and it took me like 10 minutes. And it's like 150 lines of code. And if I'd done that, they would have taken me the best part of a week because I'm not very good at Python. So using it for that is fantastic. And I use it for the intraday volatility measurement stuff that I do, because I measure volatility at like all different frequencies. And then I aggregate it. And I can just do that by, I had it write all this code in Python.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 52,
      "start_timestamp": "00:37:57",
      "start_timestamp_seconds": 2277.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2277"
    }
  },
  {
    "text": "So using it for that is fantastic. And I use it for the intraday volatility measurement stuff that I do, because I measure volatility at like all different frequencies. And then I aggregate it. And I can just do that by, I had it write all this code in Python. And now I can just hit run in a Jupyter Notebook and then off it goes, it's great. So if you go to stuff like that, it's fantastic. But in terms of actually, think of it as an intern. Interns are useful, right? But would you have one, but would you have one come up with your alpha? Would you get some guy that is just, he's finishing his third year of college and he's looking for a job in the summer. And you're like, how should I trade this option? I mean, you wouldn't do that, right? But that grays it like, hey, write me a Monte Carlo simulation. And off they go. It's like that, it's great. It's a fantastic tool. And I think that's all it is. It's a fantastic tool. But it's not for, it's not going to tell you how to beat the market because it doesn't know. Sure. Yeah, because the other thing I think that's good about integrating stuff like AI into the process is I also think it starts to introduce people to AI. Because I don't think it's going anywhere. I think it's going to continue to grow in prevalence, going",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 52,
      "start_timestamp": "00:38:57",
      "start_timestamp_seconds": 2337.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2337"
    }
  },
  {
    "text": "it doesn't know. Sure. Yeah, because the other thing I think that's good about integrating stuff like AI into the process is I also think it starts to introduce people to AI. Because I don't think it's going anywhere. I think it's going to continue to grow in prevalence, going forward and not just trading, just literally in different assets of life. So I feel like in general, it's a good way to get familiar with a tool that either you can kind of evolve with and learn alongside of it. Or you could just kind of not pay attention to it. And then you get left behind. But I think that I do think that AI has a place in accelerating learning curves. But to your point, I think especially for new concepts going through that process is really important for folks. What do you see the future of, and this is the last question, by the way, I don't want to keep you too long. But what do you see the future of AI in the markets in general? I could have visited just a situation where AI takes away most of the market liquidity providing stuff. Like we've seen in the crypto world these AMMs, these liquidity providing pools and uniswap and stuff. And obviously they've got problems, right? But that isn't even AI. That's just the simplest possible algorithm. Even going back to the early 2000s, I was developing a market-making system, kind of an automated",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 52,
      "start_timestamp": "00:40:05",
      "start_timestamp_seconds": 2405.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2405"
    }
  },
  {
    "text": "we've seen in the crypto world these AMMs, these liquidity providing pools and uniswap and stuff. And obviously they've got problems, right? But that isn't even AI. That's just the simplest possible algorithm. Even going back to the early 2000s, I was developing a market-making system, kind of an automated market-making system, which was based on a very simple application of what a market-maker would do. And it basically encoded that. That was using technology that's 25 years old now. And I think AI is going to be able to do that way better than a human market-maker will. It'll be able to manage, it will see all the flows, and be able to react to all of them absolutely optimally, not just semi-optimally, like a human does. And a human basically is quoting a spread, not just to collect the spread, but to immunize themselves against the fact they're not doing everything perfectly. So AI won't need it anywhere near as big a spread. And it will be better. And I think a lot of those kind of jobs, like especially on the Delta one side, for sanitation desks, you know, market-making in vanilla, all that kind of stuff, I could see that completely being automated. The things that it won't be as good at, the things that don't have a set process, you know, the things where you might have a customer calling you up and saying, I kind of want to do this, but I'm not sure",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 52,
      "start_timestamp": "00:41:26",
      "start_timestamp_seconds": 2486.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2486"
    }
  },
  {
    "text": "I could see that completely being automated. The things that it won't be as good at, the things that don't have a set process, you know, the things where you might have a customer calling you up and saying, I kind of want to do this, but I'm not sure what do you think. You know, it's like this is an old joke that a computer can beat a grandmaster at chess, but they can't put the pieces back into the box. So computers are really good at doing hard stuff, but they're not actually all that good at doing ill-defined, easy stuff that people are good at. So I think that are the jobs that are going to stay around. But I also kind of think there's a decent chance that AI just takes a look at us and decides we're not worth a hassle. I mean, there's never been, this isn't my observation. This is the chief AI guy from Google who resigned while back. He said that there's never been a situation in the world where a less intelligent group ruled over a more intelligent group. I mean, you can make some joke about politicians here, but I think at the species level, that's absolutely true. Right. We're not being ruled by the pecs here. So I could definitely see that happening. I don't think all of the stuff around AI is alarmist. I think there are problems that it could come up with. So we'll see",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 52,
      "start_timestamp": "00:42:46",
      "start_timestamp_seconds": 2566.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2566"
    }
  },
  {
    "text": "I think at the species level, that's absolutely true. Right. We're not being ruled by the pecs here. So I could definitely see that happening. I don't think all of the stuff around AI is alarmist. I think there are problems that it could come up with. So we'll see how that goes. Yeah, the other question I have specifically related to AI, how do you think the inclusion and I had a similar hypothesis where a lot of the market making liquidity provided roles likely could get phased out? How do you think that that would impact the long-standing market function slash forces that we see like the variance risk premium in indices or just put call skew, things like that? Do you think it would have any impact or would the overall disposition of human beings on the back end still wanting that protection, still willing to overpay, allow it to persist? Yeah, I think that's the sort of thing that is driven by people's desire to avoid risk. And it may become tighter. That's the computer might, it's like I'm always selling vault, right? And I also have a certain degree of risk aversion that would mean that I might not be doing it as aggressively as I should be. And a computer's not gonna have that. But on the other hand, the computer, it's not the computer's money, right? It's someone's money and they're going to have these issues too. So I think things like that",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 52,
      "start_timestamp": "00:43:59",
      "start_timestamp_seconds": 2639.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2639"
    }
  },
  {
    "text": "that I might not be doing it as aggressively as I should be. And a computer's not gonna have that. But on the other hand, the computer, it's not the computer's money, right? It's someone's money and they're going to have these issues too. So I think things like that will always be around. I think it's purely the matching of buyers and sellers that could change. And to be honest, that's happened already. You know, like 30 years ago, if you were an options market maker, you might make markets on three stocks. But now, I mean, when I left, it was an options market maker would make markets on a hundred. Now it's like five or 600. So the automation of that process is already well underway. So now instead of having one human do five or 600, why don't you just have a computer do the whole lot? I mean, it's not revolutionary. It's just continuing along that process. Right, I'm kind of scaling interesting. Okay, the very last question, because I always lie to you on the last question and then there's always one more. And then I'll let you go for real. But have you studied the volatility around the debt ceiling conversations? Yeah, kind of. We don't really have enough data to say anything. And each one has been against a fairly different backdrop. So I can't really find anything that I particularly believe. And if you look at this time, volatility really didn't",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 52,
      "start_timestamp": "00:45:23",
      "start_timestamp_seconds": 2723.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2723"
    }
  },
  {
    "text": "studied the volatility around the debt ceiling conversations? Yeah, kind of. We don't really have enough data to say anything. And each one has been against a fairly different backdrop. So I can't really find anything that I particularly believe. And if you look at this time, volatility really didn't do anything. The market really didn't do anything. The market had sort of got to the point where it's like watching a horror movie, right? Look, we know how this is going to play out. You know, you don't want to be the good looking blonde girl. We know what's going to happen to her. And why is she going into the basement all alone? But we know the whole thing, right? It's like that. It's like we kind of knew how it was going to end. We didn't know the exact steps, but really, it's very straightforward, right? Both sides want to basically blame the other side. Whatever happens, the president's the one who gets blamed the most. And that's pretty much that was like that under Obama and Trump and Biden, same old, same old. So this one, the market really didn't care. And there were a lot of people like, oh, the VIX is way too low because of this debt ceiling, right? Which is a classic example. Oh, really, it's too low. Well, the market's not moving. And do you think you're the only one who knows that this issue's out there? I mean, you're going",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 52,
      "start_timestamp": "00:46:32",
      "start_timestamp_seconds": 2792.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2792"
    }
  },
  {
    "text": "of people like, oh, the VIX is way too low because of this debt ceiling, right? Which is a classic example. Oh, really, it's too low. Well, the market's not moving. And do you think you're the only one who knows that this issue's out there? I mean, you're going to have to have a better reason for that for why the VIX is too low. So turns out the VIX wasn't too low. If anything, it was too high, right? The part that I find interesting is like, we know with relative certainty, the likely outcome, but we don't know with pure certainty. And if big if there wasn't, there was no agreement for whatever reason and there was a default. Like, obviously the risk there is just massive. So that's the part I find so curious about the event is that it's a very high probabilistic, determinable outcome, but the risk on the other side in that small percentage of cases that it could not happen would be pretty big. So it's curious how just longer term, I started looking at it myself, but obviously I'm like a fucking caveman with this stuff compared to what you can do. That's why I was asking you. I don't think this is, even if there was a default, right? Would you be huge? I don't think it would be nearly as big a deal as if it happened in say the 50s. America is not the world's overwhelming economic power",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 52,
      "start_timestamp": "00:47:51",
      "start_timestamp_seconds": 2871.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2871"
    }
  },
  {
    "text": "do. That's why I was asking you. I don't think this is, even if there was a default, right? Would you be huge? I don't think it would be nearly as big a deal as if it happened in say the 50s. America is not the world's overwhelming economic power to the way it was back then. And also to be honest, these idiots have been messing around with this stuff for so long that this whole idea of America being absolutely risk-free funds, no one believes that anymore. I wouldn't be surprised if there's another credit downgrade because if you keep acting like an idiot with the credit, eventually people aren't gonna be surprised when something bad happens. And it's not at this point where it's like Bolivia or anything, but it's not Switzerland now either. And we have seen sovereign nations have defaults before. Like and reasonably big sovereign nations, like I don't know what the biggest economy they have a default has been, but I don't know, because Italy defaulted, Mexico has defaulted a whole bunch of times, Mexico's huge. So if it did, I don't think the world would end. Obviously it would be bad for the US markets, but I don't think the market would crash 50 or anything. Right. Yeah, that makes sense. It's somewhat ludicrous that Congress can authorize spending and then decide not to pay for it. It's so funny you say that. I had an economist on the podcast last week",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 52,
      "start_timestamp": "00:48:57",
      "start_timestamp_seconds": 2937.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=2937"
    }
  },
  {
    "text": "the US markets, but I don't think the market would crash 50 or anything. Right. Yeah, that makes sense. It's somewhat ludicrous that Congress can authorize spending and then decide not to pay for it. It's so funny you say that. I had an economist on the podcast last week and that was actually one of the questions I was talking to him about, because to me, it seems so strange to create a budget with the known spend, projected spends, like we know where we're going and yet we come into this. And I was also looking at the frequency specifically because I think like 1917 or something like that is when it was first instituted the debt ceiling. And then in the 40s is when it was starting being activated a lot more, but like in the last two decades is when we're having them at a decent clip. And to me, yeah, I just struggle with it. Like to me, it makes no fucking sense. Like we know where things are going. Why is this happening? Why don't we just have a bigger budget or whatever the fuck is or not overspend? But yeah, here we are. Well, right, it's not even about the level of spending. It's the fact that these are two separate processes. I mean, that's just no matter what you believe about government spending levels, that is just ridiculously done. And it's one of those things that people kind of, I think up",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 52,
      "start_timestamp": "00:50:14",
      "start_timestamp_seconds": 3014.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3014"
    }
  },
  {
    "text": "Well, right, it's not even about the level of spending. It's the fact that these are two separate processes. I mean, that's just no matter what you believe about government spending levels, that is just ridiculously done. And it's one of those things that people kind of, I think up until recently kind of just accepted because it didn't happen that often. But also it wouldn't happen. I don't think anywhere else in the world this could happen. The government could authorize spending and then say, oh, by the way, we're not paying for the stuff which is we were going to pay for. Right. Without defaulting, right? That is like, I'm voting to spend this money. Now I'm voting that we can't spend this money. Like, just welcome to America. This makes no sense at all. Well, you know, it's how America does what it does, right? You never let them know your next move because we don't know our next fucking move. Well, it's a lot of the stuff about the American bulls political system. There's always a reason why each incremental step happened, right? So we know why the electoral college came about. I get that. We know why the Senate has the structure it has. On the other hand, it is goddess to a place that makes no sense. Right. And it's like, I don't think it's a coincidence that every other democracy that's come along since had a chance to look at the American system.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 52,
      "start_timestamp": "00:51:16",
      "start_timestamp_seconds": 3076.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3076"
    }
  },
  {
    "text": "know why the Senate has the structure it has. On the other hand, it is goddess to a place that makes no sense. Right. And it's like, I don't think it's a coincidence that every other democracy that's come along since had a chance to look at the American system. And no one has said, we've got to go with that. So that's what yeah, they've really worked that one out. It's yeah. And these are even like democratic governments that the Americans have installed. Like they didn't go to Afghanistan and said, come on guys, where's your electoral college? Yeah, it's it's interesting. And I think the part that always I find so intriguing about it is like, I know these aren't stupid people. That's what I always go back to is sure, you know, they have their leanings and all that kind of stuff. But most of the people there, they're legitimately not dumb. So it just tells you the amount of structural stuff around that kind of puts us in these interesting scenarios. Yeah, there's a whole bunch of problems, right? I think the fact that the highest level of the civil service is political appointees always creates this level of takes wild for people to get up to speed. Right. As opposed to the certainly the Commonwealth countries whether the civil services or, you know, that's their job. It's not a political appointment. So even if the politicians are all completely idiotic, the underlying machinery is",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 52,
      "start_timestamp": "00:52:26",
      "start_timestamp_seconds": 3146.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3146"
    }
  },
  {
    "text": "creates this level of takes wild for people to get up to speed. Right. As opposed to the certainly the Commonwealth countries whether the civil services or, you know, that's their job. It's not a political appointment. So even if the politicians are all completely idiotic, the underlying machinery is run by people who know how to run that thing. It's, you know, it's like, and the military interestingly doesn't have this, right? I mean, the joint chiefs of staff are not like some guy who was a good campaign contributor, right? I mean, it's no, it's, it's got some ad ball. He spent 40 years in the Navy. But we don't do that with a lot of the other departments. Yeah, that's actually kind of an interesting juxtaposition, huh? Well, I think it probably tells us something, right? Yeah, I mean, and it's easy to make fun of, you know, there's the whole catch 22 and mash and everything about how the army is run so ridiculously. And a microvival, it kind of is, but it has a huge logistics operation. It's amazing. So I mean, it's really good at like, forget about the blowing things up there. The fact that the American military can put thousands of tons of provisions anywhere in the world in a matter of days. It's incredible. Yep. Yep. And I mean, you're, I'm a former logistician. So that's literally what, what we would do is we would look at how to put a",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 52,
      "start_timestamp": "00:53:36",
      "start_timestamp_seconds": 3216.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3216"
    }
  },
  {
    "text": "fact that the American military can put thousands of tons of provisions anywhere in the world in a matter of days. It's incredible. Yep. Yep. And I mean, you're, I'm a former logistician. So that's literally what, what we would do is we would look at how to put a giant force off of somebody's doorstep and be ready to put them closer, if need be. And it's exactly that point. It's funny like if you read anything with Sun Zoo or, you know, we're classmates. It's the ability to support a large fighting force that makes such a massive difference. So yeah, it's logistics of when wars. Yeah. I mean, everyone talks, you know, everyone's all enameled about the special forces and all this kind of stuff. But yeah, it's putting thousands and thousands of pounds of, you know, munitions in the right place is what you need. It doesn't matter how good your troops are if they can't eat. Right. Right. Wrap us up. I'm curious. Have you done any driving? Has it been nice weather there? Has it been very nice weather? I haven't read anything much. I've got a few problems, well, always. One of the problems is my pop-up headlights. I can have a choice of one being up or both being up. So I have to have both of them up all the time at the moment. So I've got to get that fixed. Also, my wipers aren't working. Which car is this? That's",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 52,
      "start_timestamp": "00:54:51",
      "start_timestamp_seconds": 3291.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3291"
    }
  },
  {
    "text": "problems is my pop-up headlights. I can have a choice of one being up or both being up. So I have to have both of them up all the time at the moment. So I've got to get that fixed. Also, my wipers aren't working. Which car is this? That's the 456. Got it. The 308 I think is working fine. But I haven't taken it out yet because the weather hasn't been very good. And also now that you've said that, I'm sure when you sit in the car, it probably will have heard that in the ether. And then it will find something to be upset about. Well, yeah, I mean, obviously things always break. Also, it might be too hot now. You don't really want to be driving an 80 degree weather. Well, 80 plus gets too hot. Are they, is that one air cooled or? No, it's not so much the engine. The engine's fine. It's neat. Got it. Oh, okay. The roof of it. So it acts like a little, it's got big windows, big engine behind you. X like a little greenhouse. Yeah, okay. It doesn't really do anything. And if you take the roof off, you just end up getting sunstroke. Got it. Yeah, because I was going to say that's, it would be mind blowing to me. I know there are some people that do air cool conversions just for two different purposes. But it would have been really interesting to me",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 52,
      "start_timestamp": "00:56:04",
      "start_timestamp_seconds": 3364.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3364"
    }
  },
  {
    "text": "roof off, you just end up getting sunstroke. Got it. Yeah, because I was going to say that's, it would be mind blowing to me. I know there are some people that do air cool conversions just for two different purposes. But it would have been really interesting to me if you did that. So the gross heat factor makes a lot more sense. No, the gas. It's fine. Right. Just that I would probably die. Yeah. It gets really hot in there. Well, instead of going to a sauna, you just go for a drive, you know. Yeah, I also get deaf. You don't get deaf in the sauna. There's, yeah, the cars and coffee. I think I sent you a photo of a 48. I saw there one time, but there was a 40 this past weekend. That was just absolutely gorgeous. Beautiful car. I've never been a huge fan of them, to be honest. There are a little extreme. And it seems like based on your cars, at least of what I know that you have, it definitely seems contrary to your general style. But for what they are, 288, a lot. Right. You know, because it's basically a 308 on a Lloyds. I mean, it's got no panels the same as a 308, but it looks like a bigger one. But I don't know. That's an old car, you know, in an old super high performance car, just a lot of work. Probably isn't much fun",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 52,
      "start_timestamp": "00:57:09",
      "start_timestamp_seconds": 3429.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3429"
    }
  },
  {
    "text": "basically a 308 on a Lloyds. I mean, it's got no panels the same as a 308, but it looks like a bigger one. But I don't know. That's an old car, you know, in an old super high performance car, just a lot of work. Probably isn't much fun to drive. Yeah, I never been in one myself, but I remember I looked into it. And I'm not like huge or anything, but the seat was so narrow. I was just looking at it as. Oh, yeah, it's got the big bolstered seats, right? Exactly. Yeah. It's actually a bit weird. A lot of the like the 308's got really, really, really thin seats. Because you know, they're astonishingly comfortable. I mean, for what they look like, you think there's no padding at all. And they're actually, they fit me perfectly. Well, I feel like you also kind of learn to respect the ergonomics of the seat as compared to, you know, how much thickness or cushion there is. If you have a well shaped, actually think, yeah, it makes a ton of sense that that would be way more comfortable. What do you think about the, the Lamborghini Diablos? Well, Diablos, nice. Okay. It's like the last, the last real Lamborghini. Yeah, I absolutely, I saw one of those. Now they're just outies. Yeah. Yeah. I don't like the Lamborghini's at all anymore, but all of the pre-outie ones are fantastic. I love them. Yeah. The, there was",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 52,
      "start_timestamp": "00:58:12",
      "start_timestamp_seconds": 3492.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3492"
    }
  },
  {
    "text": "Diablos? Well, Diablos, nice. Okay. It's like the last, the last real Lamborghini. Yeah, I absolutely, I saw one of those. Now they're just outies. Yeah. Yeah. I don't like the Lamborghini's at all anymore, but all of the pre-outie ones are fantastic. I love them. Yeah. The, there was a Diablo there that was just, it was so cool, especially it wasn't too far away from the F40. So it was kind of a chance to check on both out next to one of the other. But hopefully the weather gets a little bit more decent for you guys there to get some wheel time in. I don't know, it's been cloudy here, but at least temperate. So it's actually been pretty good driving here. Yeah, we've, it's been overcast here a lot. Overcast kind of dull. This is the first hot day we've got. I don't know how hot it is. It's probably like 90. It got hot today. Yeah. Starting off the summer with the bang, I suppose. Yeah. Well, it was a long time coming, but yeah, it's hot. Yeah. Well, you and thanks so much for hanging out. I honestly, I just have a blast chatting with you. So thanks for sharing some of your experience with folks, talking some cars and looking forward to the next course. Whenever that gets announced, let me know. I'm happy to share with my community and yeah, get people in front of you because you share a lot",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 52,
      "start_timestamp": "00:59:16",
      "start_timestamp_seconds": 3556.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3556"
    }
  },
  {
    "text": "chatting with you. So thanks for sharing some of your experience with folks, talking some cars and looking forward to the next course. Whenever that gets announced, let me know. I'm happy to share with my community and yeah, get people in front of you because you share a lot of awesome information. So thank you. Well, thanks for chatting. Enjoyed it. Of course, take care of you. Thanks, partner.",
    "metadata": {
      "video_id": "O8mP2Ine9ZQ",
      "title": "Chat GPT, Leveraged ETFs, and Volatility Regimes with Euan Sinclair | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ",
      "upload_date": "",
      "duration": 3640.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 52,
      "start_timestamp": "01:00:19",
      "start_timestamp_seconds": 3619.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=O8mP2Ine9ZQ&t=3619"
    }
  }
]