[
  {
    "text": "Hey everybody, so I am super stoked. I have Tom Baso here. I actually listen to how to pronounce your name. I hope I didn't kill it from. Oh, you did it perfectly. It's Italian Baso. Yeah, there we go. Good. So first off, you know, welcome to the channel. We had a chance just to talk for a few minutes, you know, get generally acquainted. I'm really looking forward to your perspective here. So when you see me looking down, it's because I have my handy dandy notebook, because I'm Polish and I can't remember things from questions. I'm 69 and I can't remember things. But realistically, I think one of the really fun parts of my YouTube channel is just connecting with people like you with a very different background, something that I know very, very little about. And I'm really excited to dive into that. So first off, thank you so much for coming on and chatting for a while. It's certainly my pleasure and thank you for your service. I can see the marine thing on the back wall there. That's right. Yeah, a lot of people are like, what is all that crap on your walks? I got like knives, ale horns. I got a Tomahawk all sorts of little dude dads hung up my wife loves it. Let me tell you. You probably know how to use them. So I figure, you know, always helpful to start with a bit of background. And what",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "walks? I got like knives, ale horns. I got a Tomahawk all sorts of little dude dads hung up my wife loves it. Let me tell you. You probably know how to use them. So I figure, you know, always helpful to start with a bit of background. And what led me to you is I was looking through just Twitter and your name popped up. And I was looking through a page a little bit and I was like, oh, okay, this is like just a couple of things lined up that really peak my interest. And basically the money manager background that you have is always of interest just because it's such a different world than retail trading. Maybe not, you know, completely disparate, but I'm sure you could share a little more about that in a little bit. But then the other thing was, you know, the part about like futures and currency trading still, you know, we were talking a little bit about hogs and lumber. And I was like, to me, that's actually really interesting that you have that money manager background, obviously still very active as a trader. So first off, I would love to just get a, you know, quick synopsis of how you got started in the markets. And what did that look like for you? It was a chemical engineer out of Clarkson University up in northern New York. This is back in 1974 at the end of a 50 down",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "to just get a, you know, quick synopsis of how you got started in the markets. And what did that look like for you? It was a chemical engineer out of Clarkson University up in northern New York. This is back in 1974 at the end of a 50 down market on the SP. So I'm making 12,000 a year and in those days 12,000 a year was a lot of money. And so I start sucking money into a stock account and a bunch of us engineers would sit around at lunch and talk about investments and what newsletters we were reading and what their brokers told us and sharing ideas and eventually led to an investment club of some sort. And another guy and myself started practically managing it. De facto because nobody else in the club really could had any energy to do anything. So little by little, we took over that and had had a raise a bunch of money and then we hooked up on the third guy and that ended up forming a firm, investment advisory firm, which we ran part time for about three years or so while we were still working is during the day as chemical engineers. And one thing led to another pretty soon we have enough money under management we can afford my salary outside of the chemical company. So I leave and I open up an office and the whole thing goes crazy and I eventually sold my",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "during the day as chemical engineers. And one thing led to another pretty soon we have enough money under management we can afford my salary outside of the chemical company. So I leave and I open up an office and the whole thing goes crazy and I eventually sold my shares and that ended up forming trends that which was my firm for. I think around 28 years or so and we expanded into all sorts of areas, currencies futures mutual fun timing we did a little stocks in the early going even traded some treasury bonds along the way when we had to do use the treasury bonds for collateral against the futures transactions. The laws have evolved over the years and things that can happen today. I mean literally didn't exist back then. Right. You would have really been inventing the wheel. You would have just been all by yourself and probably never raise a dollar. So I tried to stay with what I knew could be interesting to clients, but then you mentioned in your questions. So I've gone from just an amateur now all of a sudden is trading my own money that was successful now I'm managing other people's money and now we got my own firm and it grows to 600 million and I'm trading money for you know Merrill Lynch and Chase and all sorts of big banks and the world is just completely going crazy new market was it's come out I'm",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "I'm managing other people's money and now we got my own firm and it grows to 600 million and I'm trading money for you know Merrill Lynch and Chase and all sorts of big banks and the world is just completely going crazy new market was it's come out I'm now Mr. Serenity. Everybody knows who I am I'm getting a lot of people stopping by to say hi and down in Scottsdale where our office was and you know the world kind of went nuts for about at least three or four years and then and then it just kind of fizzled the currency business when the year old came into being gosh about 15 different pairs that I traded disappeared so diversification went down. And a lot of big institutions get really cold feet quickly. It's like they didn't know what to expect they it's like the sort of they didn't mind having currencies and it wasn't like there was a lot of losses. But they just saw the potential for profit to get narrowed in the potential for diversification definitely to go down which does put you in a more vulnerable position I agree with a mayor I don't agree with them that there isn't still some nice potential in the effects markets and I certainly made some good money still but. You know the institutions are the institutions they do what they do and they have bureaucracies and committees and when that got you know the",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "I don't agree with them that there isn't still some nice potential in the effects markets and I certainly made some good money still but. You know the institutions are the institutions they do what they do and they have bureaucracies and committees and when that got you know the friends that then assets under management went down I got to a point where it was probably 60 of my time was spent with people coming in and auditing our firm the IRS the SEC the state of Arizona the investment advisory business so the national futures association would come in. And our firm was so complex that because we traded so many different things that a good example I was on the board of the national futures association. I am representing one of the three slots that were commodity trading advisors and I did that all the way up until I retired and then I resigned from the board since I no longer was a CTA I retired on my resignations and happily put a smile on my face and the smiles been the herbicides I think. What ended up happening is they send in somebody to audit us or to review our stuff and these people generally are six months or less out of school and I've got foreign exchange going on I've got futures going on I've got mutual fun time and going on I've got hundreds of clients everything's automated unbelievably. It takes us maybe in",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "or to review our stuff and these people generally are six months or less out of school and I've got foreign exchange going on I've got futures going on I've got mutual fun time and going on I've got hundreds of clients everything's automated unbelievably. It takes us maybe in the afternoon it took us 15 20 minutes to run hundreds of accounts across dozens of trading desks across I don't even know how many positions probably hundreds of positions and would transmit them all all in 20 minutes and so these people would come in and I felt like I was okay I'm kind of obligated I'm on the board of the NFA I got to be polite to these people I got to try to help it's part of the organization I'm on the board of the NFA. I felt like I'd spent days and days teaching these kids what they're really should be asking me and then giving them how to answer yes exactly and it just seemed awfully big waste of time and it's about 60 of my time towards the end was done in in what I call non productive to the client the clients paying me money to manage their money but only 40 of my time I'm not sure what I'm doing. The time is able to be managing their money or inventing new and better trading strategies or working on the position sizing algorithm some more or trying to find new markets",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "paying me money to manage their money but only 40 of my time I'm not sure what I'm doing. The time is able to be managing their money or inventing new and better trading strategies or working on the position sizing algorithm some more or trying to find new markets we can trade or all the things you do that try to help improve value added to the client I couldn't do it I was tied up and reading legal documents and running over accounting programs and just seemed like not what I really thought was fun in life. I wanted to, I got into the money management business because I really liked managing money. So I decided, finally, I don't really need the money. Why am I doing this? So we found our employees a number of opportunities out there and they scattered to the four wins. Some of them actually went into retirement with me. Others found other positions. Some of them fail. Unbelievably substantial compared to where they were at my place. So good for them. And life goes on. And I've enjoyed retirement now for some 18 years. Right. I've only worked 28. So 10 more years and retirement becomes my number one job in my life. And a good job. Yeah. So that's kind of the evolution all the way from starting out as a chemical engineer to retirement sort of. But hopefully that answered your couple of questions there. It does. But as with",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "years and retirement becomes my number one job in my life. And a good job. Yeah. So that's kind of the evolution all the way from starting out as a chemical engineer to retirement sort of. But hopefully that answered your couple of questions there. It does. But as with any good answer to a question, I have more. So the first one you were talking about, this is really just geographic question for my own understanding. So you said that you were in upstate New York. Was that just for college? Or were you, where do you were a chemical engineer? Did you move to Arizona? Say Lewis. No, St. Louis. Oh, OK. Got it. Very early stages of Monsanto, the famous company that invented all the herbicides and everything. OK. Got it. I was making industrial chemicals. They had nothing to do with all that egg stuff. But there was a different division. But yeah, I was a chemical engineer designing actual, well, ortho-nortar clay or benzene was my first project. No all about that. A seed of metafine. They did some vanilla flavoring. I did a project for that. We did some plant for Brazil, some Paulo Brazil. So it was fun for a while. And then after about five years, I realized, you know, it's kind of the same thing over and over. And if you designed one pump, you've kind of designed them all. They don't get out. They don't end up being all of",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "Brazil. So it was fun for a while. And then after about five years, I realized, you know, it's kind of the same thing over and over. And if you designed one pump, you've kind of designed them all. They don't get out. They don't end up being all of them. It's different. So I had very high ratings that was promoted as fast as I could be. I eventually moved to the business side of the company. I ended up getting an MBA. Thought that would be my career path more on the business side of the chemical industry. And then along came this money management thing. And I'm like, OK, I'm making this over here. And I'm making, I could make that over there. It's the same number. Right. And I, this is really intriguing. I could have my own business. And that would be fun. So I got it. And off went into the money management business and never looked back. So what can you just walk me through? Were you from originally? Syracuse, New York on the West Side. Little village called Salve. It's like 10,000 Italians. Everybody's got an I-O-E or A at the end of their name. OK. I went to RIT. So I'm generally familiar with upstate New York area. That's why I was curious about that. I would have considered them, but they didn't have chemical engineering at the time. Yeah. Well, now they got all from a Jenny engineering. You can",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "of their name. OK. I went to RIT. So I'm generally familiar with upstate New York area. That's why I was curious about that. I would have considered them, but they didn't have chemical engineering at the time. Yeah. Well, now they got all from a Jenny engineering. You can think of. I had a good friend that did like packaging science. That's actually a pretty fascinating gig. But anyways. So then you went to this job in St. Louis. St. Louis. I stayed there for about, I was probably an engineer or in the business side for maybe eight years, nine years. OK. And then by then I was full-time money management. OK. So the money management started in St. Louis. And then what moved you to Arizona? Well, that was a strange thing. Financial planners seemed to like working with me because I was so, I don't know, I hopefully pleasant to be around with the clients. I knew my stuff. I was highly technically capable. Right. A lot of the financial planners lean towards the salesman side. They have to represent a lot of different types of strategies and products to their clients. So they have to be outgoing personalities and go out and find the clients and have lunch with them and do all the things that more of the sales type of the industry does. And when anybody had a challenge, like they had a big pension plan and they're wondering, what are they supposed",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "be outgoing personalities and go out and find the clients and have lunch with them and do all the things that more of the sales type of the industry does. And when anybody had a challenge, like they had a big pension plan and they're wondering, what are they supposed to do with it? Are they're going into retirement? Now they've got the huge rollover. What do I do with it? A lot of times I'd be brought in just to talk through the issues. And I knew so much about so many things in the industry that I could help narrow things down to crystallize their thinking. And many times we ended up with some of the money to manage. So it was sort of marketing on my side too. And it turned out that when I looked at the number of clients I had in St. Louis and the number of clients I had in Phoenix, and we did business in all sorts of places. California, Florida, Texas, we had a number of clients strewn all over around the world, really, in currency trading. And so what it would end up happening is I had the most concentration of clients in the Phoenix metropolitan area. The word had spread mouth to mouth and clients had talked to other clients and we'd end up with a strange phone call out of the blue. And when are you coming down to Phoenix next? I'd like to meet with you and",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "of clients in the Phoenix metropolitan area. The word had spread mouth to mouth and clients had talked to other clients and we'd end up with a strange phone call out of the blue. And when are you coming down to Phoenix next? I'd like to meet with you and stuff. So it just kept going. And I love golf. And I got really tired in St. Louis of putting my clubs up at about October and pulling them back out in April to play in the mud. Right. And here I play around and it's gorgeous. It's called heaven. So for me as a golfer, this is like the place to live. And then I thought to myself, well, this is probably where I'd end up retiring anyway. So I might as well move the company while I have the energy and the money and everything else to do it. It cost me a quarter of a million dollars to move the company here overnight. And we had airborne express. We had 40 computers to move. We had rock collections. We had a boat that we moved. In that mine, my head trader, we had China collections. We had all sorts of weird, everybody's cars and their spouses. We had booked an entire auto carrier straight through husband and wife team. And everybody showed up at work with their cars. We loaded them on and off it goes to Phoenix. So it was a fun overnight experience. But by",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "all sorts of weird, everybody's cars and their spouses. We had booked an entire auto carrier straight through husband and wife team. And everybody showed up at work with their cars. We loaded them on and off it goes to Phoenix. So it was a fun overnight experience. But by 4th of July weekend, Friday afternoon, we shut it down. Everybody got in the plane at Lambert Field in St. Louis. We arrived in Phoenix that night at about 6'7 o'clock, had dinner, showed up next day at Saturday of 4th of July weekend. And the weekend, that 4th of July happened that fall on a Tuesday. So Monday was a dead day too. We had a four days to play with. But by Tuesday afternoon, even Monday, we needed to be up and running preferably Sunday, because the currency markets were going to be open in some places of the world on Monday. Guess what? Britain doesn't celebrate the 4th of July. Think about it. So there's places that are open. So we had to be operational. And we were operational by completely by Sunday morning. That's impressive. So in the Marine Cross, a logistics officer. So listen to me. You talk about the logistics there. Then you know what I'm talking about. It's just speaking to me. Yeah. Because we've got Airborne Express with a box with packing material sitting in front of every computer. We're running the last run of the day on currencies. And as soon",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "me. You talk about the logistics there. Then you know what I'm talking about. It's just speaking to me. Yeah. Because we've got Airborne Express with a box with packing material sitting in front of every computer. We're running the last run of the day on currencies. And as soon as it's everybody that's left in the company, every half of the company is already down in Phoenix, getting ready. And the other half is finishing up St. Louis. As soon as that last one hit it successfully, and we called New York and they said, yeah, we got it. That computer went down. They picked it up, stuck it in the box. They got the box is sitting on a dolly. And they're out the door, hitting the afternoon run from Airborne Express. They deliver it in Scottsdale to our new office sometime back at 10.30 in the next morning. That's so cool. That is. That's a really good planning. Now, that was highly, highly, highly designed. It took us probably the better part of six to nine months. Oh, from start to finish, it might have been almost a year. But from the time we told the employees and actually started planning some of the really, really detailed stuff, it was a real heavy six months of planning and getting every detail figured out, every computer where it was going to go. Do we need to replace it? We had a whole new network. We had a whole",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "and actually started planning some of the really, really detailed stuff, it was a real heavy six months of planning and getting every detail figured out, every computer where it was going to go. Do we need to replace it? We had a whole new network. We had a whole new computers down at Scottsdale. But we brought some of the old equipment as well as backups and we had a new design to the office so that we had places where we could run back in those days. You don't have so much of this. But back in those days, the computers were so slow. We'd start a, you know, some kind of a big study. And we'd started on like Monday afternoon and it would run till Thursday morning or Friday morning or something. So you'd have to have these computers sitting on shelves kind of away from everybody so that nobody would touch it. And you'd literally take the keyboard and shut it off so that nobody could go up and accidentally hit a keyboard and interrupt the flow of this massive study we're doing. So that we designed our operations. So there was computer labs of multiple layers of micros computers that could run individual studies and be independent from the other ones. And so some of our research people could tie into any one of those machines by hitting a couple switches. That's pretty crazy now because I mean, obviously, now we have Python or",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "multiple layers of micros computers that could run individual studies and be independent from the other ones. And so some of our research people could tie into any one of those machines by hitting a couple switches. That's pretty crazy now because I mean, obviously, now we have Python or atom and you know, it's a couple minutes if that. The world is different. Yeah. See if C sharp. So what one of the things that I was really, really curious about is when you first got into trading, what like while you were still a chemical engineer, what trading were you doing? Like what kind of trading did you actually start with? Stocks. Okay. And it was low price stocks was my favorite. I tended to like to buy stuff that was less than 10 a share. I felt like the percent return on investment was the highest. It was trying to find small companies that would be the next Microsoft or IBM or whatever. And I had screens that I would try to do back in those days. A lot of it was done by paper. There were no computers. I had a ad-subtract multiply divide calculator. 1980 is when you really had the IBM, first IBM PC come out and I bought one and that was revolutionary. Very expensive too. For me at that age, but it was well worth it. It leveraged my time. I never looked back. I bought the first IBM AT and kept",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "is when you really had the IBM, first IBM PC come out and I bought one and that was revolutionary. Very expensive too. For me at that age, but it was well worth it. It leveraged my time. I never looked back. I bought the first IBM AT and kept expanding and just ended up with 40 computers at the peak and 10 people to run them. Got it. So you started with stocks and then what happened? What started here? Here's the mental process. And it's a very interesting one to me because I have evolved over what 50 years or so now. And it goes like this. If you start out in stocks and you're just buying long. In the back of your mind, you're thinking, especially me because I came out in 73, 74. I just saw when I was a junior or senior at college, I'm tracking stocks to see what companies that I'm considering going to look like financially because I'd like to go to a company that was doing real well. So I thought I'd go to plot all these chemical companies. So I had Dow and DuPont and Monsano and Shell Oil and all sorts of backs on. And you start realizing when you think about it that hey, if the stock market were to go down 0.50 on a dollar again, 50 or worse, or say it's a depression, 1929, whatever, I'm gonna really lose a lot of money on the value",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "all sorts of backs on. And you start realizing when you think about it that hey, if the stock market were to go down 0.50 on a dollar again, 50 or worse, or say it's a depression, 1929, whatever, I'm gonna really lose a lot of money on the value of my account. Wouldn't it be nice to have something that could make money during that period to at least diversify myself and offset some of it? And that got me thinking about futures because commodities, because back in those days, you could trade say a corn contract that didn't cost you that much. And I thought to myself, well, corn probably doesn't really care what the stock market's doing today. And stock market runs and really care what corn's doing today. So there's two things that could do their own thing. And then I started thinking about, well, how about cattle? How about gold? How about bonds? And little by little, I kept adding. And I just, it was this sort of approach that in my mind is trying to get to sort of an all-weather type of strategy where, you know, throw some hail at me, tornado or hurricane, sunny day, I don't really care. Every day here at my office is the same as the day before, no matter what happens in the world. And I've got eight different strategies running across futures and ETFs and securities, probably at any one time, somewhere between 40 to 60",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "hurricane, sunny day, I don't really care. Every day here at my office is the same as the day before, no matter what happens in the world. And I've got eight different strategies running across futures and ETFs and securities, probably at any one time, somewhere between 40 to 60 positions that cover the gamut. And God sorts of things could happen. And you look at my portfolio on a day like today and out of say, around 50 to 56 positions, probably, I'm running probably 60 to 65 of them went my way today. The other 35 went against me. The ones that went against me didn't go against me that much. The ones that went in my favor went big. Right. So I had a really good day. But that's just a typical day and what goes on here. I don't win on everything every day that I trade in. I don't even try. I'm trying to get lots of different exposures so that no matter what the world in the markets throw at me, I'm just sort of cruising along another day. So for context, when I started trading, I started with some stock, but then I got into derivatives, mostly options though. And I've been trading futures for a while now, but I find it really interesting that you even stumbled into them. Because what year was it when you started working with futures? Probably 1976. Which I actually, I'm not familiar. Do you know when",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "got into derivatives, mostly options though. And I've been trading futures for a while now, but I find it really interesting that you even stumbled into them. Because what year was it when you started working with futures? Probably 1976. Which I actually, I'm not familiar. Do you know when futures were launched like on actual exchanges? I know they've been around forever. I don't, but there's different. I mean, now there's, I don't know, 75 to 100 futures. Right. Reddyly gets to around the world electronically, especially. Back in those days, there was maybe 20, 25 markets that were deep enough and everything was traded by hands. So basically I would call a commodity broker. Commodity broker would write a ticket up by hand, take it over to his teletype operator. They would type it in. It would go to the floor. The floor would either signal it into the pit or they give it to a runner. The runner would run it out there, hand piece of paper to the guy in the pit. Guy in the pit would do his hand signals and buy or sell. He'd write up who he bought or sold it to, toss the ticket on the floor, the runner would pick it up, take it back to the teletype operator, teletype operator, back to the broker's office, teletype then sends the little message over to the broker's desk. He then calls me for my fill. Wow. Nowadays, that's so straightforward. Yeah, nowadays",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "the ticket on the floor, the runner would pick it up, take it back to the teletype operator, teletype operator, back to the broker's office, teletype then sends the little message over to the broker's desk. He then calls me for my fill. Wow. Nowadays, that's so straightforward. Yeah, nowadays I sit here and I go, huh, I think I got one too many contracts of corn there. I need to peel off one. So I get my cursor and I, you go, corn, sell one, market, submit, and it's beeping over here on the right side already. Done. And then I watch my position size go down by one or from my corner and I'm done. It takes less than 10 seconds to do everything. So how did, I'm really curious. So like I was saying, when I started with options, there was definitely, you know, material available, right? We have books, one of my favorite is options is the strategic investment. But I mean, I started trading options mostly in like 2008. So even like YouTube and stuff like that wasn't huge then. It existed, but it wasn't huge with that data. How did you even come across futures, let alone like get to the level of proficiency where, you know, you're running 60 different trades at once with it? Well, the first trade I did, I remember was in corn and I had no idea what I was doing. And I started with 600 and immediately went",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "futures, let alone like get to the level of proficiency where, you know, you're running 60 different trades at once with it? Well, the first trade I did, I remember was in corn and I had no idea what I was doing. And I started with 600 and immediately went to 400 and then I closed it and I said, what happened? Was it good? And so I had to figure it out, little by little, you know, talking to the broker, reading a few books, nothing comes to mind as being significant, but just figuring out the math of it. And then, I guess the profound moment for me was to sit there with, if you remember, point and figure charts, they're still available on some platforms. Hardly anybody uses them anymore. Back in the day, when you didn't have computers, you had little cards on the floor, so they put X's up and zeros down or O's down and they could track a lot of price information on a small card and they card could fit in their pocket with a pencil, because they're out there without a desk and no computer is paying. So that was point and figure was really big back in the 20s and 30s and 40s before computers, but bar charts and candlesticks and all that are now the fancy stuff and very colorful. So back in those days, when I had that, I took a bunch of point and figure charts about",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "and figure was really big back in the 20s and 30s and 40s before computers, but bar charts and candlesticks and all that are now the fancy stuff and very colorful. So back in those days, when I had that, I took a bunch of point and figure charts about all the major commodities that I could possibly trade. And I figured that out by just looking at the Wall Street Journal and they had a page, and I had saved all these Wall Street Journal third sections or whatever that were nothing but data. And I had literally in my closet, I had stacks and shelves of labeled by which year is which and going back for a decade or something. So if I wanted to do a study on futures, I just resigned myself to getting a long drink of iced tea or something and sitting at my desk and putting a big pile there and then saying, okay, what was the price of corn today? And then put it over here and then do that. It would take me a weekend sometimes. And I would just go through and I just do one market and do all the point and figure. What happened after I had a bunch of these charts is one day I decided a lot of money could be made in the very big runs. So what I did is I laid the charts down on the floor. I never forget this. It was",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "the point and figure. What happened after I had a bunch of these charts is one day I decided a lot of money could be made in the very big runs. So what I did is I laid the charts down on the floor. I never forget this. It was in my living room and I'm sitting in the sofa and I cleared away this massive space and I just put all the charts facing me. And from that far distance, I could see every trade that I wanted to make sure I was in it. So I kind of circled them in a way. I yelled at them in so I knew this is a trade I need. This is a trade I would like. This is a trade I would like. And so I took the top 10 things that I could see from a distance and I brought them all back up to the coffee table level. Now they're right in front of me again. I said, what are the common characteristics here of these trades? These are the ones I want. The other stuff is garbage. It's not going to get you anything. These are going to make you a lot of money. So when I did that, I discovered something that I thought I could live with that got nine out of the 10 of those trades. That was the start of it. That's really, really interesting. And then one thing led to another and",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "to make you a lot of money. So when I did that, I discovered something that I thought I could live with that got nine out of the 10 of those trades. That was the start of it. That's really, really interesting. And then one thing led to another and I started realizing that just trend following was an easy way to pick up all of those trades. 10 out of 10. Don't filter it too much. Try to get in on every one of those big trades because they pay for a whole lot of losses. Right. That's interesting. So do you think that the cyclicality of futures was part of that analysis? You were kind of, because when you first start trading something like corn, we may not think about the harvest season or the planting season. You know what I mean? Stuff like that. I didn't. Okay. And then if it's going up, I want to be long. If it's going down, I want to be short. We got it. So generally irrespective of like the future, you know, characteristics themselves. But more how is it working on the chart? No predictions whatsoever. Just look how it's moving and go with it. You know, I got it. Strictly measuring the trend. If the trends up, I want to be long. If it's down, I want to be short. The beauty of futures, you can go in both directions. Right. So when the stock market is having a",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "moving and go with it. You know, I got it. Strictly measuring the trend. If the trends up, I want to be long. If it's down, I want to be short. The beauty of futures, you can go in both directions. Right. So when the stock market is having a struggle over in my stock portfolio side, I could be cleaning up over in the future side. And you know, life's good. Just keep going. As stocks are down and futures get up, the futures get a little more dominant. My math would have me taking money from futures and moving it over into my stock portfolio. So now I'm buying stocks cheap. With the extra money I've made over in futures. Right. That protects my drawdown coming up in futures that sooner or later is going to happen. It gets me some cheap prices over in stocks. And now that goes crazy. And maybe futures is struggling. And again, the other way it turns around. And it takes money from the stocks that put us over in futures. And I keep balancing and rebalancing and rebalancing. And it improves your return to risk ratios. And at this stage, you know, that's all I try to go for. It's very high return to risk ratios. I like to get to little or no drawdowns. I haven't got there yet, but I keep working at it. Because then your denominator, the risk side, gets to close to zero. And your return",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "know, that's all I try to go for. It's very high return to risk ratios. I like to get to little or no drawdowns. I haven't got there yet, but I keep working at it. Because then your denominator, the risk side, gets to close to zero. And your return to risk gets close to infinity. Right. That's a high comfort level for most people. And certainly for a guy like me in retirement, it's perfect. I'd rather not have a lot of violent moves. Sometimes it's unavoidable. I mean, if crude oil one day is going negative, like it did last year, I'm short. There's not much you can do about it. You just have to kind of enjoy that ride and then deal with whatever comes out of it. Typically a lot of brokers close those positions for you when you wanted to have them or not. But it was at a nice profit. So yeah, and I just put the position on for the next month. So I was not short, but I took a profit on the one that went to negative. And I think that the lesson you'll learn here is that you're looking at a lot of different return streams over a lot of different time periods, over a lot of different markets. And your strategy dictates the sort of the personality of that return stream. So if you plot any strategy against any set of markets and with a certain logical position sizing",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "a lot of different return streams over a lot of different time periods, over a lot of different markets. And your strategy dictates the sort of the personality of that return stream. So if you plot any strategy against any set of markets and with a certain logical position sizing algorithm, you're going to get some kind of equity curve going up the page. And what you find is one of my friends, Lauren's Ben's Dorp, I don't know if you've ever heard of him automating your stock portfolio, great book on multiple systems trading. He lives down in Brazil in a beautiful place. He talks about when a track record's going up the page and then has this little dip's called drawdown and then they go back up and resume and make new highs. That's kind of like a hole. It's like a pothole. Right. And your job when you're trying to deal with multiple systems and trying to think about diversifying yourself to try to improve your return to risk is to fill that hole. So ask yourself, why did that loss occur? And what could you do to fill the hole? Is there an option strategy? Is there a hedging strategy that could have diminished the hole? Maybe you don't fill it all the way. Maybe you just make the hole a lot less deep. But you keep trying to straighten that line out. So it's just a smooth upward sloping line up the hill. Right. Right.",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "there a hedging strategy that could have diminished the hole? Maybe you don't fill it all the way. Maybe you just make the hole a lot less deep. But you keep trying to straighten that line out. So it's just a smooth upward sloping line up the hill. Right. Right. If you had a line that looked like a CD or something and you were making good returns in the markets, that would be pretty nice. So it's a good goal. I haven't gotten there yet, but keep trying. Yeah. I think it's a good goal to shoot for at least though. Yeah. So that leads me to one last historic question for you. Again, this one is a selfish question. I'm just curious about it. Don't worry. But you mentioned mutual fun timing. You know, part of the... I'm just curious, what did that look like? Because I've heard different variants of that before. But I'm... Yeah. Well, of course, today you have exchange-traded funds. So mutual fun timing is just for the dinosaurs like me back in the old days. What you had to do... You've only had when I came out of school, I think there was 500 mutual funds or something like that in the world. Nowadays, there's, I don't know how many ETFs, so I mean, thousands and thousands. Yeah. And they trade tick by tick. I mean, there's a bit aspirated all day long. So mutual fun timing looked like this. Again, this is",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "500 mutual funds or something like that in the world. Nowadays, there's, I don't know how many ETFs, so I mean, thousands and thousands. Yeah. And they trade tick by tick. I mean, there's a bit aspirated all day long. So mutual fun timing looked like this. Again, this is getting back into the ancient years. But computers might have just barely started coming into play. But basically, at about three o'clock in the afternoon, St. Louis time, we would have to figure out whether we're going on a signal long or selling whatever we were doing or just doing nothing and staying with what we had. But let's say we had to buy, we would have to get that signal at about, right at three, have it already pre-calculated, have everything faxable ready to go. We would fax it into a trading desk. By 315, when the futures markets kind of closed and the aftermarket trading finished up, they had to know whether they were buying or selling and how much and then try to adjust their positions so that they could keep the mutual fund properly positioned for all these assets. Particularly important if you're selling, they need to raise cash to pay you off. They need to sell something in those last 15 minutes. So there was a lot of that and a lot of it was manual and the bigger you got, the more the mutual funds hated you. And then the right access of the",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "to raise cash to pay you off. They need to sell something in those last 15 minutes. So there was a lot of that and a lot of it was manual and the bigger you got, the more the mutual funds hated you. And then the right access of the world came in in the early years where they invented mutual funds that were geared towards timing. They welcomed timers and they got tons and tons of business from the timing industry. And then of course, ETF started coming in and the whole world changed and now everybody would time ETFs. And that's what I trade now. I don't even do mutual funds anymore. God, I use ETFs. I trade 20 sector funds and then I have a momentum ETF program that are strategy where I look for ETFs that are with a high relative strength over the last 30 days. And then I try to concentrate my purchases on those with fairly tight stops and then let them run if they want to run and if they want to turn, take me out. That's okay. But these are going to be very volatile kind of make a lot of money and not move type instruments. It's only a small portion of my money. So just another return stream that's different from the other return streams. That's super interesting. I get, I kind of geek out about some of, I don't know just how things were. Because it's me, I",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "money and not move type instruments. It's only a small portion of my money. So just another return stream that's different from the other return streams. That's super interesting. I get, I kind of geek out about some of, I don't know just how things were. Because it's me, I think it's helpful for context because the market hasn't been around that long and a lot of people I think get used to the idea that what they're doing right now will be working in 15 years. It may or may not. So I like to learn from folks like you that have seen evolution and how you've adapted. So. Yeah. You know, like there was no Bitcoin might have been the business. There was no Bitcoin futures. I'm trading Bitcoin futures. There was none of those just a few years ago. Ethereum just came in in December. Yep. Brand new. And I'm trading that now. So yeah, things evolve, which you got to be on the lookout for in my mind is what viable liquid markets are there out there and that actually have movement that are not price fixed to my governments by something artificial. Because the more price movement happens, the more profit a trader can make. It stands to reason if you buy something and you only sell it here, you didn't make anything. But if you can buy it here and sell it there, then you're going to make the difference between these two, right?",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "price movement happens, the more profit a trader can make. It stands to reason if you buy something and you only sell it here, you didn't make anything. But if you can buy it here and sell it there, then you're going to make the difference between these two, right? And so you want things that move. You like volatility, but you want to be able to attack the risk involved. I think so many people out there including my dad who liked to buy CDs at the savings and loan was always trying to be fearful of risk, protective of risk. He's trying to provide for his family, he's a postal carrier in the circuit area. And so he didn't have a huge sum of money and he didn't have certainly my level of knowledge of investments. But he thought he was trying to avoid risk by going to a savings and loan CD. Right. But then what happened? Right. Economics, interest rates went up, savings and loans to the tune of hundreds of billions of dollars went under including my dad's money. So it turns out the government came in and bowed out all bunch of people and my dad was made whole and he learned his lesson that risk free is an exactly risk free. Right. And you got to think a little bit more through these things. And I think that what my lessons that I've learned over my lifetime is the best way to handle",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "my dad was made whole and he learned his lesson that risk free is an exactly risk free. Right. And you got to think a little bit more through these things. And I think that what my lessons that I've learned over my lifetime is the best way to handle risk is not to try to avoid it. But instead to try to attack it. So example, mutual fund timing, when it's an early lesson. If I've got a gross stock mutual fund that's going to go up in an up market but in a down market it's going to get killed. How can I attack the down market risk? Well, there's a couple different choices. Back then it seemed like the logical thing was to do is just sell out of it and go to a money market fund. So put together a trend following model. You're going to miss the top but it's going to go down a certain amount. You're going to get a signal. You're going to say, okay, I'm out. That's enough of a loss from the top. I'm going to sit out here and let the market settle down give me a signal to the upside. As soon as I get that signal I move it back into the risk. So I'm attacking the risk by doing something against that which will cause me to lose it. And nowadays you could also use an index futures hedge. So you could have the ETF on",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "the upside. As soon as I get that signal I move it back into the risk. So I'm attacking the risk by doing something against that which will cause me to lose it. And nowadays you could also use an index futures hedge. So you could have the ETF on the one side if you wanted to. And that's going to make money with the palm going up. And then you could put in place a futures hedge with a signal. And that's got to make money when it goes down. If you balance them perfectly they're going to move together. You're going to make and lose equal amounts of money. That's another way. But that futures hedge is attacking the risk. And I think more you attack risk, the more you feel sort of empowered and relaxed. I think one of the reasons Jack Schwagger always thought of me as Mr. Serenity is that I attacked risk across so many different markets. And so easily that everything I did was sort of boring. Right. So I'm serene. And I think too many traders get locked into, you know, they follow a ten or 20 stocks and they live and die with the intraday movements of these 20 things that they got on five screens in front of them. That's kind of limiting to me. I mean, the action is all in 20 things. I've got hundreds of things I can consider all automated and it takes me 20 minutes",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "die with the intraday movements of these 20 things that they got on five screens in front of them. That's kind of limiting to me. I mean, the action is all in 20 things. I've got hundreds of things I can consider all automated and it takes me 20 minutes a day. And the rest of the day I go do other stuff. I was out working on the subdivisions landscaping for two hours before lunch. Right. Beautiful day, you know, sunny out here in Scottsdale and a short sleeve shirt at this point. You know, a lot of the countries got the park is on already. And, you know, to me, life can be pretty good to just, if you're thinking through what you're trying to achieve and you, you kind of systematize it and attack the risk that you see out there, you're going to smooth things out and it's going to just make your mental side of trading so much easier to deal with. You're not going to be up at night and stressed out and ulcers and all the things that you see, you know, that traders sometimes stereotypical traders go through the Wall Street, Wall Street, the movie, you know, guys. I'm not, I, and if somebody told me to watch a Wall Street movie that are series that they really, really enjoyed and I watched the first couple and I said, this is garbage. This has nothing to do with trading in my view.",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "Street, the movie, you know, guys. I'm not, I, and if somebody told me to watch a Wall Street movie that are series that they really, really enjoyed and I watched the first couple and I said, this is garbage. This has nothing to do with trading in my view. It's, it, it was story time the whole time. Right. It wasn't to me, normal mathematical trading that I go through. There's no excitement like that. So. Yeah, it's, it's funny. So I have a mentor that I reference on the channel a lot just because he's an army doctor. He's old now. He just retired from trading. He's in his knees. But he has a very similar mindset to you where, you know, he said, as long as you are, you have a well-developed plan and implementing a plan, there's nothing to get excited about. And I, I really think that that's an important message for people because I think a lot of people are under the impression that the way to be successful is exactly like you said. Have six monitors put more charts up and, you know, look at it for, yeah, exactly. Look at it for 16 hours a day and spaz out about it. I had a guy today on Twitter asking me a question. He said, you know, I really feel like I've got what I want to do with the stocks down and I've got my positions and it usually takes me about,",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "16 hours a day and spaz out about it. I had a guy today on Twitter asking me a question. He said, you know, I really feel like I've got what I want to do with the stocks down and I've got my positions and it usually takes me about, you know, half an hour or so a day to get everything put in place and my stops are there and everything's great. But then I feel guilty. I don't know what I'm supposed to do the rest of the time. And yet, all these people talk about trading and, you know, they're watching this move and that move and they're putting charts on Twitter and it's sort of exciting sounding to me and I don't feel like I should be paying attention to that stuff, but a lot of it's compelling and I'm not sure if that's part of the trading process or not. And I said, no, 20 minutes a day, 130 minutes, you're all done. Go out and play golf, go hit balls, go work out, go make lunch, go make dinner, go, I don't know, read a book, go watch a movie, go prune your yard, cut your grass. Yep. There's a million of other things you could do. The very first thing my mentor first told me about trading is, you know, this isn't where you go for excitement, this isn't where you go for entertainment. He's, you know, if you can keep it not",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "cut your grass. Yep. There's a million of other things you could do. The very first thing my mentor first told me about trading is, you know, this isn't where you go for excitement, this isn't where you go for entertainment. He's, you know, if you can keep it not exciting and just business and it's productive, it's good. And go do something else exactly that. Yeah. I would agree. So I'm really curious for like a more practical slash current conversation when I think about, you know, most traders, especially in my audience, a lot of them are derivatives traders, a lot of them trade options and things like that. But I'm really curious to understand a little bit more about the way that you like to approach, you know, hedging and filling in those potholes and things like that. How do you go about actually devising different ways to fill the potholes or to smooth that line a little bit? I have obviously my take on it, but I imagine yours is probably a lot more developed. Yeah, and it's getting more and more complicated as I get older and I have a little bit more, well, and I have more capabilities, you know, I'm consulting with a trading platform that is hopefully going to be out in 2022. More on that when it happens. But the, as I get more automation and what I'm doing, either using spreadsheets or some programming, what you end up with is",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "I have more capabilities, you know, I'm consulting with a trading platform that is hopefully going to be out in 2022. More on that when it happens. But the, as I get more automation and what I'm doing, either using spreadsheets or some programming, what you end up with is ability to expand your time horizons. So let's say for a dog just draw out some numbers, they don't mean anything. Let's say I'm running a strategy of 25 different futures markets and I'm doing it on a picket number 21-day triple indicator by cell engine. It's just to coin an example. That's not what I do, but I'm just coining it to make it simple. I could then take the platform and say, well, how about a 10-day or a 9-day or something like that? So now I've got a shorter term one. How about a 50-day? What does that look like? Now the risks in a 50-day are going to be very long. So your position size is going to be very small. The 9-day smaller risk size, bigger positions, but you're going to get a lot more whip-saws, you're going to get a lot more action. So, but you're going to get different return streams from each of those three time periods. Then you start adding markets and you say, instead of 25 markets, how about if I could go up to 50 markets? Now you're all of a sudden trading iron ore and Singapore or whatever,",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "but you're going to get different return streams from each of those three time periods. Then you start adding markets and you say, instead of 25 markets, how about if I could go up to 50 markets? Now you're all of a sudden trading iron ore and Singapore or whatever, you know, lead in London or something. You know, you've got different markets that are going to have different return streams. Some of those are going to be very different from what you have now. So they're going to help fill the hole because they could be making money when yours, the ones that you are currently trading are losing money. Then there's the whole gamut of sort of geography. There's stock indices around the world you can deal with. There's sovereign debt around the world you can deal with. You can trade currencies around the world 24 hours just about. So there is precious metals tended to go most of the time around the world. There's lots of energy markets. There's lots and lots of things that you can do that get you some exposures there. So then you have different strategies. So now you're getting into, let's say, good example. I decide that I'm one of my strategies is to trade on a nine day basis the NASDAQ index futures long or short, long or short back and forth. That's all I do. It's been highly profitable. There's enough movement in it that it seems to run far",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "good example. I decide that I'm one of my strategies is to trade on a nine day basis the NASDAQ index futures long or short, long or short back and forth. That's all I do. It's been highly profitable. There's enough movement in it that it seems to run far enough to where I can move my stops up to the point where I break even or better. And then if it hits it, I reverse go the other way. So now that is one return stream, but it's going to be driven by the stock market's movement in one direction or the other. But what about those years or months where the stock market doesn't do anything? Well, then I sit there and say, well, there's these things called index options over here. How about if I figure that we're going into sideways actions and I get an overbought condition and sell a call spread or I get an overbought a sold position in the markets oversold and I sell a put spread. So I've got a limited loss locked in. I can't ever run away infinite loss or anything because I've got myself covered. I've got a limited return, but it's going to tend to make the return as the market goes sideways and the time premium disappears and the prices don't go anywhere. So that's going to coin a lot of money during sideways action when my trend following is going to be sitting there doing nothing.",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "return, but it's going to tend to make the return as the market goes sideways and the time premium disappears and the prices don't go anywhere. So that's going to coin a lot of money during sideways action when my trend following is going to be sitting there doing nothing. So that's an example of aren't they both in the stock market? Sure. But the way you structure your strategies is so different that one can be making money while the other one's losing on the same thing amazingly. So that's kind of the way I look at it. I try to look at strategies. When I look at that whole and I see that the whole was caused by a lot of sideways action that caught my trend following models in whip saws, then I say to myself, hmm, how about if I came up with a strategy that actually tried to trade in sideways markets and try to explain that and then you end up with all different mindset and development of the math and the logic that you would use to try to extract a profit out of that. But I'm going to start adding these pieces together and I've got eight of them now. I've got so many different pieces and I'm on my way to more. I probably will have who knows 12 to 20 over the next few years if the platform gets up and running and I have the capability of leveraging my",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "together and I've got eight of them now. I've got so many different pieces and I'm on my way to more. I probably will have who knows 12 to 20 over the next few years if the platform gets up and running and I have the capability of leveraging my time even more. I'll probably invent a few more. So when you're going through this automation process, what software are you using to actually automate right now? Well, that's one of the issues. The platform is not finished. It's not ready for time, prime time yet. I get access to it as a alpha tester you could call it. I'm sort of the alpha consultant trying to help them build it. And it's getting close. I think within the week I'm going to probably be running simulations on it. So it's not forever off there. But I'm hoping it's pretty quick that we get it out there to the public, but it could be a lot of fun for a lot of traders, I think. But it's an easy to use platform that allows me to then get the data, add some track markets, play with the actual strategies and the math that I want to use to buy and sell, play with the position sizing, and run simulations of historical data. See how it acts. What I can do then is I can design something that is going to try to go after that hole that I saw back",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "the math that I want to use to buy and sell, play with the position sizing, and run simulations of historical data. See how it acts. What I can do then is I can design something that is going to try to go after that hole that I saw back there in 2008 or whatever. If I then run a new strategy, I've got to try to design it so that it makes money in 2008 and doesn't cost me too much the rest of the time when everything else was making money. Because what I'm going to do is probably pull some of the success of the good strategies, the rest of the time down a little bit, but I'm going to then improve the 2008 hole smooth line. Right. Right. That's what I'm going for all the time. And so that's the mentality I take on. I'll just try to, I think through, okay, the prices aren't really going anyplace, but they are noise, it's a noise band. So in that type of environment, I'd kind of like to sell the highs, buy the lows and buy the lows and sell the highs. I know I'm going to be limited on my monoprofits. I can make any runs. It's got to be a shorter term, probably. And I'm starting to, you know, check the items off. And so, okay, this is starting to sound like maybe this type of math would work and I'll do some testing and",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "be limited on my monoprofits. I can make any runs. It's got to be a shorter term, probably. And I'm starting to, you know, check the items off. And so, okay, this is starting to sound like maybe this type of math would work and I'll do some testing and play with it a little bit. See if I can come up with something with the right markets and the right combination of math that's easy to run and simple and understandable and strikes at the heart of that hole that I'm trying to fill. And then I'm good to go and turn it on. Now we have number nine. Got it. And then go look for number 10. So for those that are interested, I know definitely in my audience, there's people that are really interested in learning how to automate more effectively. I have invented far into it myself. You know, I use primarily think or swim is the platform and a lot of people do. And there's a bit you can do in there, but it doesn't, you know, it doesn't sound anything close to, you know, what this new platform would potentially be able to do. But for those that are maybe interested in, you know, how they could take next steps to automate more of what they're doing. What would you recommend for them? Well, the first thing I would do is kind of what I did. You start with spreadsheets. I mean, there's certain",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "But for those that are maybe interested in, you know, how they could take next steps to automate more of what they're doing. What would you recommend for them? Well, the first thing I would do is kind of what I did. You start with spreadsheets. I mean, there's certain little functions that you do every day as a trader, an example. Let's say you've got on your broker platform, think or swim or whatever, you've got a distance between where the price is now and where your stop losses. And the stop losses, you know, line on the page, you can easily see it. And either in your head or by a calculator, you can say the risk portrayed is 13.27. Well, you can set up a spreadsheet, sort of a macro where you can put in 13.27, put in your equity and it could tell you how many shares you should have by your position sizing algorithm. So there's things like that you can do. So without having to sit there and use a calculator, you can use think or swim or some simple little spreadsheets. You know, there's lots of API, I know, interactive brokers has spreadsheet, API capability so they can send you live data on your account and on some pricing. And then you could create algorithms within the spreadsheet so that as this live data is coming in from your trader workstation, it's actually helping to make decisions and alerting you to, hey, you",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "API capability so they can send you live data on your account and on some pricing. And then you could create algorithms within the spreadsheet so that as this live data is coming in from your trader workstation, it's actually helping to make decisions and alerting you to, hey, you should be buying this stock over here. It's breaking out right now. That type of thing. So little things like that, the way I did it, my mentality when I first started was simple. I was so busy being a chemical engineer, running money. I was getting an MBA. I was custom designing a house southwest of St. Louis. I was getting married. I felt like I had five full-time jobs all at the same time. I ended up saying to myself, what I really need to do is to put myself out of business from the standpoint of trading. I need to stop working. I need to have everything that I do is routine. If it's something that I could tell a computer to do and I can get rid of it, that gives me another five or 10 minutes a day. I need that five or 10 minutes because I'm overwhelmed. So I worked really, really hard at analyzing every step that I went through every day. Kind of wrote it down and they said, what out of here could I make go faster or be more efficient? And I said, ah, right there. Instead of me writing",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "because I'm overwhelmed. So I worked really, really hard at analyzing every step that I went through every day. Kind of wrote it down and they said, what out of here could I make go faster or be more efficient? And I said, ah, right there. Instead of me writing down all these orders by hand and pencil, I could go ahead and try to get the computer to write those down and have them be nice and printed. So they wouldn't have to worry about my sloppy handwriting. Everybody could read it. All right, now I gotta sit there and I gotta fax it. How about if I got these things called fax cards and put it in my computer and then have that dial up the broker's bottom and drop the fax straight to him right from my computer. So now I'm generating the text file and I'm sending it right from the computer. Now, hey, that's starting to look interesting. Now, what can I do to automate the actual decision making on the buy and sell? Well, that's a little more hard because, little more difficult because of the nature of what I was trading and how I was trading at then. But, you know, if you take long enough, you can pick away at it and tell the computer, this is how I do what I do. And now the computer's generating your orders. Position sizing. Gotta know how much to buy in sell. Well, there's",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "I was trading at then. But, you know, if you take long enough, you can pick away at it and tell the computer, this is how I do what I do. And now the computer's generating your orders. Position sizing. Gotta know how much to buy in sell. Well, there's math involved to that too. You can put that into the computer. So pretty soon, you get down to the end of the day and you hit one button and it incomes the data and it in another button that runs it through your orders and another button that's transmitting to the broker and you're done in five, 10 minutes and you go on, you just liberated an hour or two of your life every day. Right. And that was very valuable to me then and it's still valuable to me now. I'd rather be out playing golf and sitting in front of a computer. Fair enough. I don't know, I am a basemolite golf. I like driving the golf cart though, but if the computer sounds better to me than golf, just because I like golf. I just like the sun. I think the sun is so much fun and we get 330 sunny days a year here. So I don't ever get tired of it and to me it's just, I don't know, I feel retired. I don't feel as retired when I'm sitting in front of a computer. Right. Yeah. That sounds right. So I have one",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "and we get 330 sunny days a year here. So I don't ever get tired of it and to me it's just, I don't know, I feel retired. I don't feel as retired when I'm sitting in front of a computer. Right. Yeah. That sounds right. So I have one more question for you. Sure. I had an interesting past couple of years with COVID and everything. This coming year looks equally interesting for a lot of reasons. I'm just curious, what do you think about 2022 coming up? Like as a macro, whatever comes into the top of your mind about going into this trading year? Well, my wife always jokes that she hears me say this so often and I'll say it one more time, she repeats it now. She's heard it so many times. I always try to remind myself that the market will do, at the market will do. And if you keep, if you put that in a sign and stick it on your wall and reminds yourself of the fact that you gotta be ready for everything and let's not get ahead of ourselves and try to pre-position which way we're gonna lean or what you think is gonna happen because then you psychologically get shaded one way. And I like to stay dead neutral. I completely agnostic to the direction. I mean, I can see the stock markets, it's been having a good run here. I mean, today I think the NASDAQs hit",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "what you think is gonna happen because then you psychologically get shaded one way. And I like to stay dead neutral. I completely agnostic to the direction. I mean, I can see the stock markets, it's been having a good run here. I mean, today I think the NASDAQs hit the skids a little bit but then they were coming back. I don't know whether it's gonna carry or not. But it's been doing pretty well through December and it could easily continue on. There's no reason for it to necessarily go down. On the other side of it, there's lots of reasons why it could go down. So I gotta be ready for both. I'm ready for both. If the thing wants to follow apart and go down 60 on the SP fully prepared, ready to go. Hedges will be in place, timing will get me out of a lot of ETFs. Momentum will go to zero and I'll be in cash. Hopefully my futures pick up some stuff over on the bond side, maybe gold, maybe currencies. Things like lumber, oil could collapse in a recession type of an environment. Gas could crush down, copper could fall. We could have inflation in the meats and grains. There's lots of opportunities out there. Cotton, coffee, cocoa. There's just lots of different return streams. So whatever happens, I got everything I need in place to do and I gotta do. And so my, I guess the one thing I think",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "could have inflation in the meats and grains. There's lots of opportunities out there. Cotton, coffee, cocoa. There's just lots of different return streams. So whatever happens, I got everything I need in place to do and I gotta do. And so my, I guess the one thing I think you could count on, probably in 2022 will be volatility. Yeah. I'm kind of, since volatility helps feed my profits, I'm kind of looking forward to that. But because the more volatile a market is, the more profit you can make from it. Of course the more risky after manage, but I do do a decent job, I think, of managing risk and position sizing is a forte of mine I wrote a book on the subject. So I think that that's my attitude towards trying to predict 2022. I almost am agnostic as to what's gonna go on as a trader. Now as a citizen, I got totally different opinion. Sure. I really hate what the last year I thought we've shot ourselves in a foot as a country, so many different ways. I can't, I believe it. And it's happened so fast, it's just stunning. And how anybody thinks what we're doing is logical, long term is just beyond me. But hey, I'm one guy, one vote. And we'll see where it goes from here. But well, I think some things really got to change. Or we're going downhill so fast, when we're not be, any markets to",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "thinks what we're doing is logical, long term is just beyond me. But hey, I'm one guy, one vote. And we'll see where it goes from here. But well, I think some things really got to change. Or we're going downhill so fast, when we're not be, any markets to trade down the road, that'll be a bad day. But yeah, right now, I'm just watching them move around and I'm sort of amazed they're up as much as they are. But hey, I'm long like 75 of my sectors and I've got one momentum ETF on. And had a good day in futures today. So it was, you know, it's a good day. And I just try to have positive days every day if I can. Right. And it sounds like, you know, just the general disposition is seeing what the market, you know, offers and then taking advantage where you can. Yeah, I think traders have to, I think there's an old adage, you can't control the wind, but you can adjust the sales. Yeah. And I think that that's a real good analogy to the stock, to the markets in the trading of markets in that I can't control where the lumber prices go up or down. I'm right. Just a small fry retired guy. And, but I can say, all right, let's see. Right now, the directions up, I'm long. So as it continues up, that a real good day in lumber today. Now, a week",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "can't control where the lumber prices go up or down. I'm right. Just a small fry retired guy. And, but I can say, all right, let's see. Right now, the directions up, I'm long. So as it continues up, that a real good day in lumber today. Now, a week from now or less, even, it could turn around and start going the other way, gives me my signal to go short. I'm out of the long, take the profit, go short, and then starts plummeting. All right, so I've adjusted my sales. The wind has definitely changed direction. And I just adjust the sales and I continue to propel the vote. Don't worry about which way your job is to, is to let the market do what it wants to do, because that's what it'll do forever. And your job as a trader is to position yourself so that you attack the risk and exploit the profit. Right. Yeah. And you can only exploit what's there if there's no movement in the markets go dead sideways for the whole year. You'll be lucky to even break even, because there's costs of trading, there's whip saws, there's all sorts of things. So you really need movement. I actually did a study that's added, joy the right dot world. On movement in markets equals profits for the commodity industry. If there's no movements in the volatility is very low that month in the industry, then you'll see the CTA performance indexes",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "things. So you really need movement. I actually did a study that's added, joy the right dot world. On movement in markets equals profits for the commodity industry. If there's no movements in the volatility is very low that month in the industry, then you'll see the CTA performance indexes will be lousy, negative, whatever. Hard to speculate. There's big volatility. You'll see the CTAs do very well. Right. Right. And that actually leads me to kind of the last part here is I did have the opportunity as I was talking about before we started recording to check out, enjoy the right dot world. But I thought it'd be cool just to talk about it for a couple minutes here before we sign off, because like I was saying, one of my favorite things to do is to connect traders with resources. And there's a lot of really good reading on there that I enjoyed. Oh, tons. So yeah, yeah, talk to me about it. Enjoy the ride came out of an interesting session by Poole in Malaga, Spain, with Rosado in our hands, a nice little chilled Spanish wine. My wife and I were just, I don't know, talking about all sorts of things. And I said, you know, I wish there was one problem in my life. I wish I could solve. I get, I enjoy helping new traders coming into the business and I feel like it's my way of giving back to what's been a",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "talking about all sorts of things. And I said, you know, I wish there was one problem in my life. I wish I could solve. I get, I enjoy helping new traders coming into the business and I feel like it's my way of giving back to what's been a very great career for me. And, but they ask me the same questions over and over and over again. And I find myself typing emails, like thousands of emails I've already done. And I must have answered, you know, any one question is 100 times. And it's very inefficient. And it's not getting smaller. It's getting worse. More people seem to know, I mean, I've back then I had, I wasn't even on Twitter hardly. And now I've got like 33,000 or 32,000 Twitter followers. So everybody's always asking me questions. And I'm trying to answer them all. Yeah. But so I started thinking, you know, what we need is a way to automate the way that it could respond to the emails. And she said, well, why don't you like kind of do what some of your friends do? Actually run trader sort of mentoring or education programs where you actually work with them and make them go to school, you know, run a school basically for traders. And I said, yeah, but then I'd be working again. I'm retired. I don't want to work on backwards. I'm going backwards. This is not right. So then I explain the",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "you actually work with them and make them go to school, you know, run a school basically for traders. And I said, yeah, but then I'd be working again. I'm retired. I don't want to work on backwards. I'm going backwards. This is not right. So then I explain the difference between synchronous and asynchronous. What we're doing right now is synchronous, because we're both on the Zoom call together. But asynchronous means you send me an email. And I'm out in the golf course. When I get back from the golf course, I answer your email. I don't have to be around when you actually said something. And so that's why I always like the email approach. But we started evolving into, well, how about if you had a collection that people could get to, they said like a website. There's the answer. And we thought how we could call it, like how about enjoy the ride.com? And it turns out it was taken. Of course. So I said, well, how about enjoy the ride.world? Because I have people sending me emails from all around the world asking me trading questions from India and China and Taiwan and Japan. And sometimes I have to use Google translate to even understand what they're asking. And Google translate to answer them, by the way, too. Because I hope it translates well, because I have no idea what it says when it's translated. And so all of a sudden enjoy the ride.world",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "And sometimes I have to use Google translate to even understand what they're asking. And Google translate to answer them, by the way, too. Because I hope it translates well, because I have no idea what it says when it's translated. And so all of a sudden enjoy the ride.world got born about, I guess it was about three and a half years ago or something, four years ago. And what I did is it took about nine months to a year of learning how to create a website. It was fascinating to me. I never knew how to do that. And I learned a lot. And got everything all lined up. And then I just started going out into the web. And I was astonished to put my name into a web search. And then look at how many citations and things that are out there from my earlier career that are still there. And so I just collected all the research papers that I'd ever written, started collecting the interviews from people that I either had copies of or had access to or links to further interviews like this one. Hopefully we'll put on the website. So future visitors to the website will see you. And I talking, you and me talking. And so that's kind of evolved. And then people were asking me, what kind of books do you recommend? Well, I'll do a recommended reading page. And I'll put it in order. If I'll I recommend",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "visitors to the website will see you. And I talking, you and me talking. And so that's kind of evolved. And then people were asking me, what kind of books do you recommend? Well, I'll do a recommended reading page. And I'll put it in order. If I'll I recommend them. And then how about, do you ever do webinars? I mean, do you ever do that type stuff? Well, yeah, if my wife and I feel in the mood, we set up a webinar and we talk about a topic and she produces it. And I do all the presentation and answer the questions. And she asks the questions. And people live are asking me questions. And those are fun. And then I record them and put them on there and people can watch them in the future. Did a video series on how to create a trading strategy for yourself? Every now and again, Lawrence and I will do a seminar. If governments around the world will allow their people to travel to different places, it's been hard to do a seminar lately because you can't get anybody to come to it because they can't get here. Lawrence had a three week process to go through to get to the last seminar. It was very expensive and very involved. And involved two different tests. He's fully vaccinated. He's never had it. And yet, three weeks to get here. It was crazy. I drove down from my place here",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "had a three week process to go through to get to the last seminar. It was very expensive and very involved. And involved two different tests. He's fully vaccinated. He's never had it. And yet, three weeks to get here. It was crazy. I drove down from my place here that I'm talking right now down to the finish. So for me, it was like a 20 minute trip. Right. My car. But essentially, that's what happened. I put my hedging page up there. I put trying to remember what else I have there. There's a whole bunch of different types of things on enjoy the right that world. It'll allow a trader to just come in. And if he wants to just listen to an interview, listen to this interview. Here are what questions you're asking. He might pick up one gem of wisdom there along the way and then watch another one pick up something else. And hopefully it crystallizes some people's thinking and gets them head started a little bit down the path. Because when I started out, I had then vent all the stuff myself. There was no internet to speak of. There was no mentoring programs. There was physical copies of books. And I read a lot of books on trading and mental side of trading, the trading psychology, if you will. But the resources out there now at places like Enjoy the Ride.World are so extensive that you could just research for six months",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "programs. There was physical copies of books. And I read a lot of books on trading and mental side of trading, the trading psychology, if you will. But the resources out there now at places like Enjoy the Ride.World are so extensive that you could just research for six months or a year before you ever get started. And it would be well along the process. Yeah. So where you need to be. That's awesome. Well, I'm sure a lot of people are really thankful. You know that you've taken the time to put that together. I definitely enjoyed poking through it myself. I'll make sure to link to the website also in the video description when I put this up. And I will do the same the other way with this interview. Awesome. It'll be fun one more interview. The interview page is getting very, very long. Good. You could probably spend 40, 50 hours listening to me talk to different people. It's good. If you had the time. It's good. I think people like you with the amount of experience you have, the fact that you take the time to share it with people is really impactful. The last question I have for you is I know you're on Twitter. So if somebody wants to look you up, see what you talk about on there. It looks like it's at BASO underscore Tom. I'll also went to that. And I'm the same exact thing on Gitter. J-E-T-T-R. And",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "last question I have for you is I know you're on Twitter. So if somebody wants to look you up, see what you talk about on there. It looks like it's at BASO underscore Tom. I'll also went to that. And I'm the same exact thing on Gitter. J-E-T-T-R. And I'm enjoy the right dot world on my page on Facebook. OK. And let's see. I think I'm enjoy the right dot world on Parler and MeWay. OK. I'm going to search on my name on MeWay. So I'm on LinkedIn, Tom BASO. So I'm on LinkedIn as well. So there's lots of places. I have an Instagram account, but I've never quite figured out. I mean, it's kind of like they want to have a picture there to do something. And I work with computers and messages and economic data. And I did Instagram doesn't fit what I do that much. It's not like I'm trying to sell my golf shirts. I wear my ETR golf shirts, but nobody else does. It's funny. You say that just because a lot of people, especially for like YouTube and stuff like that, it's helpful to be on Instagram. But I hate it. So it is not something that I hate. My most hated social media is Twitter. I can't stand Twitter. I think I must be, I don't know, what's the term, is it you, there's a term for it, low-quacious. Is that a proper term? I use a lot of",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "it. So it is not something that I hate. My most hated social media is Twitter. I can't stand Twitter. I think I must be, I don't know, what's the term, is it you, there's a term for it, low-quacious. Is that a proper term? I use a lot of words. I talk too much or whatever, but 288 characters is not sufficient for me to get across. I see. And, but you know, I get her, same setup. It's 777 characters. Got it. So it looks the same, but I got 777 characters. You just have to do the comment thing, you know? Where they have the first title and then they start writing their own. And you see these things are broken in the five pieces. It's a thousand characters broken in the five different posts. And oh, gosh, I come on. And then Twitter, the other thing I don't like about Twitter, I have my picture up there on my profile, right? And I got, it's the same picture everybody sees. I think it's got the screen behind me on it. I've had seven imposters and all of them use that same picture. Now, tell me Twitter can't lock down that photo somehow or make it, you know, I run into all sorts of other images that you can't even do a control screen on. You can't capture the screen because it'll block it. It just depends on security. You can't tell me Twitter can't come up",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "can't lock down that photo somehow or make it, you know, I run into all sorts of other images that you can't even do a control screen on. You can't capture the screen because it'll block it. It just depends on security. You can't tell me Twitter can't come up with a way to get rid of imposter. You just got to get them to verify your account, get that blue check mark and then ever try to try it twice. They turn me down both times. Apparently, I'm not enough of a public figure or personality. You're an imposter or sports figure or whatever else. I'm supposed I'm not an actor. So no, no blue check for me. That sucks. Yeah. So I look over there at Gitter and I like, but I do like me. Me, we is my Facebook kind of alternative. Got it. Me, we flows a lot like Facebook does. There's more pictures. There's more. It's a little bit lengthier articles and links to research papers and things. So that I'd say me, we and Gitter probably are getting to be my two favorites to be on a Twitter. And me, Facebook, I do for the family, you know, vacation. We all do that and stuff. Yeah. But other than that, it's, it's not exactly efficient. Yeah. I totally agree. But I'm not all of them. Definitely, thanks for obviously sharing where people can get ahold of you. And more importantly, thanks for taking some",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  },
  {
    "text": "the family, you know, vacation. We all do that and stuff. Yeah. But other than that, it's, it's not exactly efficient. Yeah. I totally agree. But I'm not all of them. Definitely, thanks for obviously sharing where people can get ahold of you. And more importantly, thanks for taking some time to chat with me. I really enjoyed learning. Definitely a bit about your background, which is always fascinating to me. But then also just some more current stuff, you know, how people can take a look at their portfolios, different ways to diversify risk and things like that. So thanks a lot for hanging out for a bit. It was totally fun. And if there is a need, let's do it again. It was fun. I would love to do it again. Yeah. Thanks, Tom. It's great.",
    "metadata": {
      "video_id": "oKKtoZ-v7as",
      "title": "Money Manager and Futures Trader Tom Basso",
      "url": "https://www.youtube.com/watch?v=oKKtoZ-v7as",
      "upload_date": "",
      "duration": 4664.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oKKtoZ-v7as&t=0"
    }
  }
]