[
  {
    "text": "pay attention to term volatility. All that means is each expiration cycle is going to have its own volatility and implied volatility. And you can learn a lot about the way that this looks. Now we talk about things like term structure, which is what is the term volatility. Across all these different expressions, and you can plot it to see it more simply, or you can just always look at the numbers and see what sticks out to you. So for example, the fact that this two-may expiration is all the way up at 80, and then everything else is kind of like in the 40s, else is something, and obviously it has earnings during this expiration cycle. So you can go through and come up and say, well, this one seems really low compared to something else, and then you might be able to trade relative volatility compared to cheap terms, compared to more expensive terms. But there's a lot of information baked into term volatility. It's worth checking out, being out on our sale later.",
    "metadata": {
      "video_id": "oswSMmcsizo",
      "title": "Term Volatility",
      "url": "https://www.youtube.com/watch?v=oswSMmcsizo",
      "upload_date": "2025-05-13T00:56:26Z",
      "duration": "PT56S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, direct Q&A, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=oswSMmcsizo&t=0"
    }
  }
]