[
  {
    "text": "Aha, it is Nvidia, the bell of the ball, the conversation that everybody can't stop having because it uses the terms AI. Well, I want to walk you through in earnings trade that I ran in Nvidia that turned out to be a pretty handsome winning position to the tune of over 30,000 on a 20-some thousand dollar investment. And there's a couple things that I want to discuss in this video. I want to talk about the analysis ahead of time, the trade as I structured it and then the management once the trade was on. So let's get straight into it. What's up everybody? Welcome back to the outliers shout out to the Patreon family. Let's get right into this thing. So as you can see, Nvidia had earnings on the 20 second after the close and there was a lot of really interesting factors going into this earnings release. I actually covered some of it in the Patreon channel and then also on a couple of the YouTube lives leading into this release. And I highlight that because one of the things we identified going into this release was actually some pretty bullish positioning for the options changed surrounding the earnings. Take a walk with me into think or swim. So down at the bottom, I'm just showing you a reference. This is what it looks like right now using the forward looking explorations. And right now, if you look at the call open interest, this is",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "changed surrounding the earnings. Take a walk with me into think or swim. So down at the bottom, I'm just showing you a reference. This is what it looks like right now using the forward looking explorations. And right now, if you look at the call open interest, this is across all explorations. There's 1.68 million and then the put open interest is 1.627. So still very, very slight call ski, but notice how similar those are. It's essentially same same slightly bullish call ski, which is actually abnormal by itself. You typically would see puts you, but I want to show you what I saw leading into the Nvidia earnings release. And we're actually going to use on demand for this. So I've just gone back in time. It's loading right now. It takes a second. And we're now looking at 22 May at 0902 Pacific time. So in the morning. And let's take a look at the same data that I'm showing you and I'll scoot this over so that you can see a little bit more of that side. So here's what we have. If we look at all explorations, we see 1.9 million calls and 1.8 million puts. So pretty no worthy call skew still, but this is across all explorations. I want to know what it looks like for earnings. So what I first do is look at the release that encompasses just earnings here. We have 262,000 calls versus 197,000 puts on a percentage",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "million puts. So pretty no worthy call skew still, but this is across all explorations. I want to know what it looks like for earnings. So what I first do is look at the release that encompasses just earnings here. We have 262,000 calls versus 197,000 puts on a percentage basis. That is a very meaningful call skew. Now if we add the next expiration for 31 May, we go to 352,000 calls to 265,000 puts. And then if we go to one more expiration, just to kind of see how far out this goes in time, we go to 392,000 calls and 291,000 puts. So what I'm highlighting is a really interesting situation here. Now one of the things to know is when people institutions sophisticated investors have a thesis about a directional move through earnings more often than not. They're going to use options to trade it because of the leverage provided. So when I see this kind of skew around an earnings release, I'm at least going to consider it a little more seriously. That's a really interesting effect. Now it's not quite as simple as just looking at that scene call skew and then thinking, stonk, go up. And then I'll just go back a little more to it than just that, which I'll help explain now. So if we go back over here and we take a look at the previous earnings that we've seen a couple notes when I look at the past 11",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "go up. And then I'll just go back a little more to it than just that, which I'll help explain now. So if we go back over here and we take a look at the previous earnings that we've seen a couple notes when I look at the past 11 earnings, it had a few that saw pretty significant up moves, but just a few that moved down, meaning in terms of the implied move versus the realized move. The expected move for this release was around 7.8 the largest down move of the past 11 was 7.6 and there weren't many down moves. So what I did was adjust how I was looking at this and how I was going to play it based on this data. So first I see really interesting call skew, then I see a really persistent trend in in video where if we take a look at this other chart again, the actual EPS earnings per share has been beating Wall Street estimates for some time. I also see that the instances of post moves that tend to be larger are all to the upside. So notice here during this earnings release, it had a mist of the downside and it wasn't that significant. However, when we look at these moves to the upside, they tend to be pretty massive. So I was trading a little bit of this upside thesis for earnings under the assumption that I don't think Nvidia is slowing down",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "a mist of the downside and it wasn't that significant. However, when we look at these moves to the upside, they tend to be pretty massive. So I was trading a little bit of this upside thesis for earnings under the assumption that I don't think Nvidia is slowing down just yet. I see continued earnings per share growth. I see continued positive reaction to the position. So or to the stock, I should say. So really what I was looking at here is very different than the way that I typically trade earnings. So as you can see as a joke, I have yellow long calls. It's obviously not a yellow. I actually think most traders should abolish that term from their terminology, but again, it's still funny not to think about all the Wall Street bets degenerates that made probably the same trade I did, but here I am kind of conducting this analysis. And I'm sure a lot of them literally are just thinking Nvidia go up. And we probably had the same outcome except actually probably some of them made way more money than me because they'll risk their entire portfolio on an idea like this in that depressing. But anyways, let's take a look at what I was thinking. I already walked you through kind of the general hypothesis here. The portfolio fit. This is in a speculative allocation and the profit mechanism for this individual position is a post earnings release direction move that",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "in that depressing. But anyways, let's take a look at what I was thinking. I already walked you through kind of the general hypothesis here. The portfolio fit. This is in a speculative allocation and the profit mechanism for this individual position is a post earnings release direction move that is accommodating to my position. Most of the time when I'm trading earnings, which I'll throw video in the description below that walks you through how I typically trade earnings, which is with short options to trade the contraction of implied volatility. So if you take a look at the way that implied volatility tends to move post earnings in most instances, it tends to contract. However, Nvidia is been a little bit of an anomaly in that sense, where a lot of its post earnings moves have actually been. Pretty significant, but you can still see when we look at the implied move around these earnings releases, it still tends to contract as they do around earnings. So it's a really important note because as I'm highlighting here, why would I buy premium into an event that I know tends to have a contraction in volatility, which would hurt this position. So why would I do that and throw your answer in the comments below and I'll give it to you now, which is. Because I was expecting a large enough move to overwhelm the contraction in volatility, that's what this trade was based on. So when I looked",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "this position. So why would I do that and throw your answer in the comments below and I'll give it to you now, which is. Because I was expecting a large enough move to overwhelm the contraction in volatility, that's what this trade was based on. So when I looked at my targets for the position, I was looking for a 15 down move as we talked about that would result in a 17,000 loss in the position or an 8 up move, which is conservatively using the expected move. So notice what I do here, I am conservatively estimating the upside down move. I'm also estimating the upside potential by using the expected move, but then when I'm calculating the probable max risk factor at that before because it was wrong, I missed the word max. I used much larger than both the expected move and the largest down move of the past 11. I'm trading this in a conservative structure as I'm using these inputs to determine my size using this conservative profile. I'm buying premium into the earnings release because I think we could see a big enough move that it would compensate for this. So the next question then is why would I go out to 21 June again, throw your thoughts to that in the comments below and I'll give you the answer now, which is I wasn't fully confident like our standard Wall Street bets degenerates that we necessarily would see the move immediately",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "next question then is why would I go out to 21 June again, throw your thoughts to that in the comments below and I'll give you the answer now, which is I wasn't fully confident like our standard Wall Street bets degenerates that we necessarily would see the move immediately after earnings. Part of me was preparing for a reasonable earnings move, but then might see some positive drift afterwards. So that's why I didn't use the week ending, although there's a trade off here. If I used the shorter term expiration, so instead of going to 21 June, if I had gone to 24 May, I would have paid less. So I would see a larger percent increase on the premium that I paid. But overall, I wanted to give the position a little time to drift if we saw a nice big up move, kind of like what we're in now. So if you haven't noticed the position that I put on on 22 May was six of the 21 June 945 calls and I bought them for 44 78, which is about a 27,000 delta. They were a little over 50 52 to 55 delta's when I scaled in and why would I go with 55 delta's, well, a couple reasons. A lot of the times when I'm trading something like a ratio called diagonal or even long options that I'm expecting to turn into a ratio called diagonal or put diagonal is I'll go deeper in",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "scaled in and why would I go with 55 delta's, well, a couple reasons. A lot of the times when I'm trading something like a ratio called diagonal or even long options that I'm expecting to turn into a ratio called diagonal or put diagonal is I'll go deeper in the money on the delta's. But again, the premise on this trade was a large directional move post earnings. So I wanted to give the position a good opportunity to compound, which is why I went with 55 delta's it strikes a balance where I'm close to the money. So I still get a decent dollar for dollar move in the underlying. But it's not so deep in the money that I can't compound as effectively as I would if I bought something, you know, that was further out of the money that then moved into the money. So let's see how this trade moved on. So then as you can see on the 23rd of May, we did see a pretty nice pop. So before the release we closed at essentially 950 and after the release, we opened at 1020 ultimately closing at 1037. And it was a healthy up move post earnings, but actually slightly within the expected move. So on 23 May, I ended up selling four of these at 118.05, which gave me 47,000 of a credit, which takes the realized PNL of the four to 29,000. So now I still have a 29,000 profit, which",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "up move post earnings, but actually slightly within the expected move. So on 23 May, I ended up selling four of these at 118.05, which gave me 47,000 of a credit, which takes the realized PNL of the four to 29,000. So now I still have a 29,000 profit, which means it puts me in the profit zone on the entire position, just trading these. And I still have a couple on so why would I just close for again, if you know the answer, throw it in the comments, but the answer is pretty simple. I already alluded before that I wanted to see the potential for drift, where if it continues to move in my direction, I can trade. I'm going to trade the post earnings announcement drift and that's exactly why I wanted to leave a couple on so we have the latest on the 24th of May, I closed one of the 21 June 1945's at 1264, which is a 12,000 credit. So I'm going to be in a few minutes of PNL in a position now is 37,000 for 24. So we're left with a decision point. How do we handle the last leg here, because I still have one leg on and I'm looking at this today on the 26 of May and in hindsight, I actually don't know if I wanted to close this there. I think part of this is my risk aversion that comes through as a trader that I'm working",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "because I still have one leg on and I'm looking at this today on the 26 of May and in hindsight, I actually don't know if I wanted to close this there. I think part of this is my risk aversion that comes through as a trader that I'm working on. In this case, I thought that the move on the next day was still good and I still had plenty of room to take the profit, but my original thesis for the trade was to close it post earnings after I got my move, maybe trade the follow through on the next day or two. I hadn't originally thought about and again, this is one of the errors I made when I was formatting this position is I didn't originally think about potentially turning it into a ratio called diagonal, which in this case actually can make a lot of sense because essentially what I would do now is set a stop that would occur right here where price closes below 1020, I would exit the whole position for a profit, but then give it room to run. So I'm actually what I'm going to do now going forward, but if I had not closed this, I could have had a two lot to trade at a better ratio. And if you're not familiar with the ratio called diagonal, I'll throw a video in the description below, but essentially I have one runner left out that is completely paid",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  },
  {
    "text": "but if I had not closed this, I could have had a two lot to trade at a better ratio. And if you're not familiar with the ratio called diagonal, I'll throw a video in the description below, but essentially I have one runner left out that is completely paid for I can't get hurt on it at all. And I'm going to trade it like a diagonal, but this is very different than I typically trade earnings and it's because of those little pieces I saw leading into the release now in terms of sizing in the portfolio, this was a very small position. So even though you might see 26,000, I don't want you to think that it's wise to go out there and start betting, you know, 10 of your portfolio on an earnings move like this. It's unwise at best. So this is still a very small subset of the portfolio, but that was the overall thesis behind the trade and kind of some of the things I picked up to get me there. If you have any questions, throw them in the comments below, be an outlier, like subscribe, share. See you guys later.",
    "metadata": {
      "video_id": "ov3HItjq5AU",
      "title": "Using Long Call Options to Trade Nvidia Earnings",
      "url": "https://www.youtube.com/watch?v=ov3HItjq5AU",
      "upload_date": "",
      "duration": 803.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ov3HItjq5AU&t=0"
    }
  }
]