[
  {
    "text": "What's up, everyone? Welcome back to the outlier podcast. I got my favorite green caricature hanging out, Duneberg. Great to see you. Eric, great to be back. And I'm looking forward to another robust discussion. And if our preamble before you hit record is end indication, this is going to be a good one. Yeah, which fun fact for everybody. We were talking a little bit about creative process and Duneberg has a very cool creative process, kind of like what I've heard from different kinds of authors and stuff. And we were just talking a little bit about the way that people build that together. Because you have an interesting production schedule. Have you talked about that before with people or no? I think I may have on a short, too, but I'm happy to repeat it. Yeah, we're on a four day treadmill. I think I was telling you and we have to research right, edit, publish, promote, and defend a piece roughly every four days. We do about eight a month, depending on the month. Our target is six to eight. But we're since we left Twitter, we have a lot more time in our hands since how we've been reaching the upper bound of that objective. And for me personally, I've always been a very systematic sleeper. The difference between sort of naps and full-saleed cycles and those kinds of things. And I paid close attention to it. And I found that my body and my",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=0"
    }
  },
  {
    "text": "how we've been reaching the upper bound of that objective. And for me personally, I've always been a very systematic sleeper. The difference between sort of naps and full-saleed cycles and those kinds of things. And I paid close attention to it. And I found that my body and my brain coalesced best overnight. And so I'll typically do most of the writing for Duneberg between two and five a.m. depending on when I go to bed and what else I have going on. And that's worked very well for me personally. It doesn't work for everybody. But the brain is clear. The house is quiet. The phone is dead. Everyone else is asleep. And you kind of also feel like you're getting one up on everybody, you know, like a little bit of a productivity hack. So for me, I'll typically sleep two cycles, get up, work, two or three hours, bang out a piece, and then go back to bed for another cycle or a few naps. A nap is about 20 minutes for me. And a full sleep cycle is about an hour and 42 minutes. And they're very different experiences. But the body, you know, derives value from both. And being systematic about when you sleep and when you work is one of the significant benefits of writing your own business and being able to set your own schedule. And we're very disciplined about not taking meetings and putting aside time to be creative. It's what",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 47,
      "start_timestamp": "00:01:37",
      "start_timestamp_seconds": 97.88936170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=97"
    }
  },
  {
    "text": "value from both. And being systematic about when you sleep and when you work is one of the significant benefits of writing your own business and being able to set your own schedule. And we're very disciplined about not taking meetings and putting aside time to be creative. It's what we're paid to do. So it's nice that when your bank account is aligned with what's best for your body and your brain. Yeah, that's huge. And I think one of the coolest things about that that you highlight is just the process of like finding what works for you because as we were kind of discussing and just for a few moments, I find it really interesting when I read about different authors and, you know, people who write and all the different kinds of things that they do to get into their groove. It's always interesting to me how that goes. Yeah, I'm a big believer in optimizing your micro environment as well because you spend almost all of your time in your micro environment. And look, you can't really do this if you're in a job or if your schedule is beholden to somebody else's needs. We're very, very disciplined about what meetings we take, which is basically nonexept podcasts and putting aside time for creativity. And we did this before Doomer became successful, but now that it has become successful, there's just nothing that could convince us to change the way we go about things. And,",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 47,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.77872340425532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=195"
    }
  },
  {
    "text": "very, very disciplined about what meetings we take, which is basically nonexept podcasts and putting aside time for creativity. And we did this before Doomer became successful, but now that it has become successful, there's just nothing that could convince us to change the way we go about things. And, you know, we're at 330 articles into this journey. And we've got the steps down to pretty much a science at this point. Again, for those who have created for a living, that treadmill is real. And it could either tire you out and cause you to burn out or you can embrace and rearrange the rest of your life to embrace the challenge of it. And for me, it's just, I couldn't imagine doing anything else now after having done this for three and a half years. Yeah, yeah, I totally get that. And speaking of sleep schedules and whatnot, what did you think of the election? Were you up all night for that or how'd that go? Well, the decisive moments happened to go inside with when I would typically be up. And so yeah, I was. Perfect. Online when the races were called, at least by Fox and by decision desk HQ and sort of less partisan news outlets. I think the outcome was both profound and predictable. I think the Democrats did themselves in when Joe Biden, who you may remember when he was elected in 2020, basically ran as not Trump caretaker won't run again.",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 47,
      "start_timestamp": "00:04:53",
      "start_timestamp_seconds": 293.668085106383,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=293"
    }
  },
  {
    "text": "and by decision desk HQ and sort of less partisan news outlets. I think the outcome was both profound and predictable. I think the Democrats did themselves in when Joe Biden, who you may remember when he was elected in 2020, basically ran as not Trump caretaker won't run again. That's kind of a forgotten detail of how 2020 came to be. And the moment Biden decided to run again, whichever of the Biden's decided it. And went back on that promise, it robbed the Democrats of a true open primary to have the voters select the best candidate. It was very clear to me and to anybody who was objective that Biden was beginning to suffer serious cognitive decline even back in 2020. There's no way he could have continued to run in 2024. That was very clear. And in fact, when I saw that the first debate was scheduled so early, I had a hunch that maybe those in the DNC who knew for a fact what was going on maybe wanted to create that moment where they could interview any convincing belief. But by the time they did, it was too late to have anybody but Harris as their nominee. And I think winning the primary is essential practice and essential an essential exercise in winning the general. Trump for all his baggage is now a three time winner of the Republican primary and a two time winner of the general election. He would probably argue that",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 47,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.55744680851063,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=391"
    }
  },
  {
    "text": "as their nominee. And I think winning the primary is essential practice and essential an essential exercise in winning the general. Trump for all his baggage is now a three time winner of the Republican primary and a two time winner of the general election. He would probably argue that he's a three time winner. But Harris received no votes and was anointed. And I think that really mattered. And look, when you have a razor thin electric, like we do, you know, the difference between Trump winning versus Biden winning or in this case, Harris winning versus Trump winning is a few percentage points. And the way the DNC went about initially selecting and then coordinating its ultimate nominee had to be worth two to three points to the negative. And that's a decisive swing in our politics. Look, for all the talk of landslide, red wave and mandates. I mean, it's still plus or minus four or five points, either way, the vast majority of people voted the same. A few people changed their votes or showed up or didn't show up. And now we have a completely different world. And I think as the next piece, we publish will outline Trump's victory and mandate and popular vote victory in particular, combined with the fact that he is a far more effective president now than he would have been if he had won in 2020, having had four years to ponder what went wrong and what he would",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 47,
      "start_timestamp": "00:08:09",
      "start_timestamp_seconds": 489.44680851063833,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=489"
    }
  },
  {
    "text": "publish will outline Trump's victory and mandate and popular vote victory in particular, combined with the fact that he is a far more effective president now than he would have been if he had won in 2020, having had four years to ponder what went wrong and what he would do differently, for example. And the fact that he's unencumbered by the need to occasionally soften his views out of political expediency because he's not writing again. This is one and done for him. He is going to be a decisive and transformative president, especially in the first two years with Republican control of the Senate and likely control of the House. And there's going to be deeply meaningful things. Look, one of the things we've warned our friends on the progressive left about for years, as you should not concentrate too much power or affect change amongst the agenda and as you care about through executive action, because it's not going to be forever that you control the presidency. And now there were nightmare, the impotentment of all the things that they proclaim to oppose, not only has a mandate to power the pen, but a decisive ambition that he is going to execute with vigor. And it's going to be a shocking couple of years for those on the left in our view. What did you make of the the actual announcement and outcome of the election? One of the things that I was a little surprised by,",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 47,
      "start_timestamp": "00:09:47",
      "start_timestamp_seconds": 587.336170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=587"
    }
  },
  {
    "text": "he is going to execute with vigor. And it's going to be a shocking couple of years for those on the left in our view. What did you make of the the actual announcement and outcome of the election? One of the things that I was a little surprised by, not even so looking back, is I genuinely thought that the race was going to be a lot closer than it was just based on what I've heard. I always know that when you hear different media sources talking about it, obviously they're going to have their bias and their slants. The market seemed to have Trump pretty much pinned. You can look at equities, bonds, leading into the election, prediction markets, all had him. So that seemed to be a generally expected outcome just from a financial markets perspective, but still the talking points where this was going to be very close. And it wasn't. Did that? Yeah. So I'll tell you an issue, anecdote for me. So I live in a swing state. And prior to the election, I was getting 30 to 40 texts a day, super knowing, right? And even though I like those random numbers and stuff. Oh yeah, Kamala Harris says ABC. You know, so I, I, I, I religiously blocked them or for all of them, but didn't see the slow things down. And then about a week before the election, I managed to vote early. And within hours of voting, the tech",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 47,
      "start_timestamp": "00:11:25",
      "start_timestamp_seconds": 685.2255319148936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=685"
    }
  },
  {
    "text": "and stuff. Oh yeah, Kamala Harris says ABC. You know, so I, I, I, I religiously blocked them or for all of them, but didn't see the slow things down. And then about a week before the election, I managed to vote early. And within hours of voting, the tech stopped. Like almost none. There was a few local texts, but no presidential texts, maybe one or two over a period of days where I was getting dozens every day. And that was very, I'll have a moment for me. The campaigns knew it's exactly how they were doing moment by moment. They could see early voting. Now they don't know who I voted for, but they know what party I'm registered to vote with in the primaries. And they know the other aspects of my demographic background to the point where they can model with, you know, 90 plus percent certainty, who I probably voted for. And knowing that the campaigns were in possession of an extraordinarily granular amount of data about how things were going, I then watched the body language of the two candidates in the final four or five days. And it was very clear to me that Harris was despondent, the Langry, whereas Trump was, who was always somewhat optimistic, was very optimistic as body language. If you just watched the two candidates with a sound off, you could see the body language between the two was stark. The difference between them was stark. And",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 47,
      "start_timestamp": "00:13:03",
      "start_timestamp_seconds": 783.1148936170213,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=783"
    }
  },
  {
    "text": "me that Harris was despondent, the Langry, whereas Trump was, who was always somewhat optimistic, was very optimistic as body language. If you just watched the two candidates with a sound off, you could see the body language between the two was stark. The difference between them was stark. And I noted with interest that Harris really only visited Pennsylvania on the last day, whereas Trump did his typical four rallies, 18 hours flying all over the country, finished in Grand Rapids, Michigan at 2 a.m. I believe. This was a guy running through the tape. And Harris struck me as somebody hoping for it to end. And so that, and again, people will say that I'm just being biased. But I think if a neutral observer would say that there was a pronounced fall off in Harris' body language in the last week as the early return data was coming in. And this was my hunch was buttressed by the actual early returns as they came in and were reported during the day on the fifth. So, and even with all of that, it still was very close. Like, you know, Pennsylvania difference 2 percent, Michigan difference, I think it's a point a half. Arizona looks like it's going to be somewhere less than that. So we're not talking about a huge amount. But back to my earlier point, like the way in which the DNC selected and then reselected its candidate probably hurt them enough to be decisive.",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 47,
      "start_timestamp": "00:14:41",
      "start_timestamp_seconds": 881.0042553191489,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=881"
    }
  },
  {
    "text": "it's a point a half. Arizona looks like it's going to be somewhere less than that. So we're not talking about a huge amount. But back to my earlier point, like the way in which the DNC selected and then reselected its candidate probably hurt them enough to be decisive. Yeah. I think the specifically the point on the lead in is pretty pertinent. I also thought it was interesting. I don't know how impactful just from a personal curiosity standpoint. I'm curious your thought on Harris not doing the Joe Rogan podcast when they try to line that up. What do you think about that? Yeah, I think, you know, Taylor Lorenz was out with an interesting piece this morning. She's a former reporter at the Washington Post and now, full-time substacker, I think. There is an entire alternative media ecosystem on the right that the left just doesn't have. And so it isn't really that she didn't go on Joe Rogan. It's that the left doesn't have a Joe Rogan. Now, I think Lorenz's piece totally mischaracterizes the real issue. The real issue is the right has created this alternative media ecosystem in reaction to the fact that the vast majority of the traditional media system is dominated by the left with the possible exception of Fox. But like CNN, MSNBC, ABC, CBS, NBC, Washington Post, LA Times, New York Times, these are all decidedly liberal news outlets. And so the sort of echoes of Rush Limbaugh that",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 47,
      "start_timestamp": "00:16:18",
      "start_timestamp_seconds": 978.8936170212767,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=978"
    }
  },
  {
    "text": "the vast majority of the traditional media system is dominated by the left with the possible exception of Fox. But like CNN, MSNBC, ABC, CBS, NBC, Washington Post, LA Times, New York Times, these are all decidedly liberal news outlets. And so the sort of echoes of Rush Limbaugh that we now see with the Benny Johnson's of the world and now the Joe Rogan's of the world were created out of necessity. And this entire ecosystem, which I think Trump used masterfully during the campaign, he went on basically every podcast that would have him. And this was underrated. You know, Harris was doing the traditional Facebook, Google ads, Blitz spending hundreds of millions of dollars. Whereas Trump was just, you know, gathering up engagements after engagements and listening to somebody in a podcast is a great engagement. And he went on all the big shows and she didn't have a Joe Rogan to go on. She was invited, he was invited on to Joe Rogan now. That's not a format that plays to her strength before being totally honest, right? But by the way, that's the type of thing you could have sniffed out in an open primary, which they did the last time around when she didn't even make it to Iowa. And so back to my earlier point, I mean, I think it was fatal that the DNC just decided that Biden could run again without a primary. And then by the way, they actively opposed,",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 47,
      "start_timestamp": "00:17:56",
      "start_timestamp_seconds": 1076.7829787234043,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1076"
    }
  },
  {
    "text": "which they did the last time around when she didn't even make it to Iowa. And so back to my earlier point, I mean, I think it was fatal that the DNC just decided that Biden could run again without a primary. And then by the way, they actively opposed, you know, our FK juniors run, which he has, I think, accurately documented for all to see his swinging over the Trump was worth a few points too. Let's be honest. And again, in a in a six point swing, two points is 33 of the variance. Right? I mean, it doesn't take too many blow changes or the outcome to be as decisive as what we saw on Tuesday. One of the things that makes the US presidential election so emotional is that, you know, it truly is a deeply polarized country. The outcome is winner takes all, regardless of the size of the vote differential. And the position has been the recipient of ever growing delegations of authority far outside what the constitutional framers envisioned. So the point where who occupies the president is a decisively powerful thing. And so when a couple of thousand votes in a county that few have ever heard of makes all the difference because of the chaotic nature of the election systems in the various states, it becomes a very violent tug of war. And we see this played out. We're personally just very glad that a decisive outcome was reached. I",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 47,
      "start_timestamp": "00:19:34",
      "start_timestamp_seconds": 1174.672340425532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1174"
    }
  },
  {
    "text": "county that few have ever heard of makes all the difference because of the chaotic nature of the election systems in the various states, it becomes a very violent tug of war. And we see this played out. We're personally just very glad that a decisive outcome was reached. I mean, I think a contested election would have been a catastrophe to those in the left. A Trump victory is a catastrophe and vice versa on the right. But in our view, the only real catastrophe on the board was a contested and protracted legal case around who won the election. I'm pleased to agree. Now, thinking a little bit more about the election, when you look at some of the different implications of policy, if you were to segment it into kind of like a near-term impact, longer term impact, near term being maybe six months in within just to define it. And then long term greater than six months out to five years. Plus, what are some of the primary themes that you're looking at under the new context, understanding that House and Senate still TBD and will impact stuff to a degree for everybody wondering today's the seventh. The Senate is not TBD, but the House is still mildly so, although the prediction markets still have the Republicans at 85 chance of getting over the line. And if they do get over the line and be by a race within margin, and so basically a replay of",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 47,
      "start_timestamp": "00:21:12",
      "start_timestamp_seconds": 1272.5617021276596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1272"
    }
  },
  {
    "text": "seventh. The Senate is not TBD, but the House is still mildly so, although the prediction markets still have the Republicans at 85 chance of getting over the line. And if they do get over the line and be by a race within margin, and so basically a replay of what we just had, I don't really view it as short and long-term because what we're seeing in the short term is the repricing of the long-term effects of what's about to transpire. So I'd rather just talk about the major themes that we see. And the one we're running about next is that this is the end of climate change as a defining narrative in our political discourse. Trump is going to kneecap the carbon agenda. He thinks it's a scam and a hoax. And by the way, what he thinks is way more important than what me or you are anybody listening thinks. And so we're just trying to appraise what he thinks, not necessarily judge it. I think you just need to understand where the man's head is if you're going to model and invest and reposition yourself to the facts as they are on the board, not as how you wish them to be. So I with that disclaimer, Trump in 2012 tweeted that he thought that climate change was a hoax manifested by and for China until we can and make the U.S. manufacturing sector non-competitive. That is his view. He views the world as",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 47,
      "start_timestamp": "00:22:50",
      "start_timestamp_seconds": 1370.4510638297872,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1370"
    }
  },
  {
    "text": "not as how you wish them to be. So I with that disclaimer, Trump in 2012 tweeted that he thought that climate change was a hoax manifested by and for China until we can and make the U.S. manufacturing sector non-competitive. That is his view. He views the world as a great struggle economically between the U.S. and China. He wants to make things big beautiful things in the U.S. And China has tricked the naive former leaders of the country into thinking climate change is a real thing. He doesn't care about climate change. And he is going to lead accordingly. And so what does that mean in all practicality? It means all the EPA regulations against power plants coming off the board. It means drill baby drill. It's back in style. It means higher oil and gas production. All things being equal much lower oil and gas prices. Bad for oil and gas equities. Good for oil and gas service providers. He wants to make things in America again. There's going to be a huge investment boom in the U.S. But most importantly, if you press them based on my own experience, the vast majority of C-suite executives at major companies in the U.S. don't actually think climate change is a big deal. And certainly don't think they should reorient their entire strategies around it and have been kind of just playing along to get along. On the subject and Trump, I believe, is going to give them",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 47,
      "start_timestamp": "00:24:28",
      "start_timestamp_seconds": 1468.3404255319151,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1468"
    }
  },
  {
    "text": "at major companies in the U.S. don't actually think climate change is a big deal. And certainly don't think they should reorient their entire strategies around it and have been kind of just playing along to get along. On the subject and Trump, I believe, is going to give them all of the protection they need to express their true views on the topic. And I think key milestone for us. It gives you something to look at on the board next week. COP29 in Niger-Brijan is next week. We marked COP28 last year in the United Arab Emirates as peak ESG. You're going to see less than a third of the number of people attending this meeting that we saw at the same event last year. I think the air is coming out of the climate balloon. As we say in this piece, Trump likes his numbers to go up. And if carbon emissions are among them, so be it. That's what he's going to be. We're going to roll the dice on climate. China has never really cared about climate change. It has laughed the U.S. in carbon emissions. I think it's the most important chart on the board. We published on notes this morning, which is the the annual carbon emissions from China and the U.S. on the same plot. You could see that the U.S. has been left to declining since 2000. China has been up and to the right. And to the extent that CO2",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 47,
      "start_timestamp": "00:26:06",
      "start_timestamp_seconds": 1566.2297872340425,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1566"
    }
  },
  {
    "text": "board. We published on notes this morning, which is the the annual carbon emissions from China and the U.S. on the same plot. You could see that the U.S. has been left to declining since 2000. China has been up and to the right. And to the extent that CO2 emissions are a proxy for manufacturing intensity. And the lack of increasing emissions in the U.S. is a proxy for the rusting out of the Midwest. Trump's going to change that. And so there's going to be a lot of howling on the left. But because the left mainly has over the years worked to make the power of the presidential pen and the weight of executive orders so so meaningful. They have now found themselves in a worst case scenario where a man that they despise who was removed from office in a contest of election in 2020 has had four years to ponder what he did wrong and how to do better. And all of the mistakes that he made both in the last term of his, you know, the first term as president in the last election. He is a way more effective president now than he would have been if he had won in 2020. And that's what's about to transpire in our view in the next year. That's the biggest one on the board. There's all other policy things we talk about too. But, you know, carbon and energy are really, really central to the",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 47,
      "start_timestamp": "00:27:44",
      "start_timestamp_seconds": 1664.1191489361704,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1664"
    }
  },
  {
    "text": "would have been if he had won in 2020. And that's what's about to transpire in our view in the next year. That's the biggest one on the board. There's all other policy things we talk about too. But, you know, carbon and energy are really, really central to the economy. And Trump has been very clear on what he intends to do. And I think people in the left are going to be shocked by what transpires in the next six months. What are your thoughts on the 60 era of Chinese imports? Yeah, he's going to do all those things. All of this will catalyze an investment boom in the US. Let's be very clear. It's not all great. Trump likes the numbers to go up. That means Trump is an inflationary force. And the long bond is telling you that. And I think the US is still in a very viscally dangerous place with interest payments, passing a trillion dollars a year and a trillion dollars in debt going on the books every quarter. The rules of the game have changed, but Trump's views on how the game should be played have not. And so he's going to print. He's going to try to grow. He's going to build big beautiful things. He's going to push Powell to lower interest rates. He wants the stock market to go up. He wants GDP to go up. He wants nominal paychecks to go up. And he wants gas prices",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 47,
      "start_timestamp": "00:29:22",
      "start_timestamp_seconds": 1762.0085106382978,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1762"
    }
  },
  {
    "text": "to print. He's going to try to grow. He's going to build big beautiful things. He's going to push Powell to lower interest rates. He wants the stock market to go up. He wants GDP to go up. He wants nominal paychecks to go up. And he wants gas prices to go down. Right? I mean, these are very simplistic anchors of his worldview, but they should not be ignored. It's what he's going to do. And so in our view, inflationary hedges are going to be in high demand. In the long term, that means things like gold should do well. But there's going to be a boom in the US. There's just no question about it. He will through just the pen, let alone if the house comes on board. Look, if he has the house to send it, the pen and the Supreme Court, I mean, the next two years are going to be a blitz of right-wing wish list items, one after the other being knocked out. And it's going to be a shocking realization to the left as to what the power of a president who has been both, you know, distilled in the cauldron of political upheaval and skilled in the art of of having learned from his prior experiences, it's going to be far more profound than even what the market is predicting. And that's why I think, for example, the solar ETF, I think it's 10, was down to something like 15",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 47,
      "start_timestamp": "00:30:59",
      "start_timestamp_seconds": 1859.8978723404255,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1859"
    }
  },
  {
    "text": "of political upheaval and skilled in the art of of having learned from his prior experiences, it's going to be far more profound than even what the market is predicting. And that's why I think, for example, the solar ETF, I think it's 10, was down to something like 15 in the morning of the election. These are big four or five sigma moves on the board that we're seeing a total realignment given the the nature of the Republican Trump in this cycle. Specifically for the tariffs, the path of that is really of interest to me, and when I say path, just the protocol that it's implemented with, because that kind of thing, obviously, essentially, basically, I can know what you know this matter. It's basically just going to be passed on to the consumer. And I'm wondering if you have a perspective on the way that something like a 60 tariff on Chinese goods could look in terms of implementation and then therefore impact. It's a blunt instrument to be sure. And passed on to consumer is a temporary thing until domestic supply comes online. The thing that I can't quite square is how this all works with a stronger dollar, which was the initial market reaction, you know, to his to his victory. So I think the US dollar has to get much weaker over time if Trump is going to get his way. Like when you think about the things that foster and protect a",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 47,
      "start_timestamp": "00:32:37",
      "start_timestamp_seconds": 1957.7872340425533,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=1957"
    }
  },
  {
    "text": "with a stronger dollar, which was the initial market reaction, you know, to his to his victory. So I think the US dollar has to get much weaker over time if Trump is going to get his way. Like when you think about the things that foster and protect a domestic manufacturing supply chain, it's a weak currency and protection of tariffs. And those are the things that need to happen. And in particular, US dollar needs to get substantially weaker against China's currency in order for the playing field to become substantially equalized. But Trump is also a strong US dollar type guy as well. So there are some inconsistencies that look Trump is in the name of right. I mean, let's just let's be clear. Like the man is a force of nature. I think his stamina, persistence, and ability to shake off extreme criticism are pretty unique in the history of our politics. Whatever you think of the man, he is the energizer bunny of American politics and totally agnostic to the most dastardly accusations and slanders of his character, right. I mean, how many times do we have to call somebody Hitler in our politics? Like can we be done with that already? But nonetheless, he just seems totally oblivious to it all. And I think that's part of what makes him so attractive to everyday Americans. So he is a highly underrated, very talented retail politician. He connects with average voters in a way that",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 47,
      "start_timestamp": "00:34:15",
      "start_timestamp_seconds": 2055.676595744681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2055"
    }
  },
  {
    "text": "can we be done with that already? But nonetheless, he just seems totally oblivious to it all. And I think that's part of what makes him so attractive to everyday Americans. So he is a highly underrated, very talented retail politician. He connects with average voters in a way that those among the more elite in the country failed to comprehend because he is so orthogonal to the behavior patterns, acceptable behavior patterns and their social circles that they think it must be that everyone else would reject him too, but it just simply isn't true. And I can't say that I fully understand it, but I could tell you I once was in the vicinity of once of his rallies of one of his rallies. And I was totally shocked by what I saw. Like, what did you see? I saw waves of red and flags and everyday normal Americans coming out for a politician with enthusiasm and affection that has been unprecedented, like not even Reagan, of this is such a response from from everyday Americans. And you see it like the unions coming out and voting for him in droves, even though their leadership didn't want to endorse them. Like that's sort of a classic example. But like Trump is a rich guy in a suit with a very long tie and plumbers and firefighters and police officers. They love them. He invokes a deeply visceral loyalty and enthusiasm that no other politician of our time comes",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 47,
      "start_timestamp": "00:35:53",
      "start_timestamp_seconds": 2153.5659574468086,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2153"
    }
  },
  {
    "text": "endorse them. Like that's sort of a classic example. But like Trump is a rich guy in a suit with a very long tie and plumbers and firefighters and police officers. They love them. He invokes a deeply visceral loyalty and enthusiasm that no other politician of our time comes close. I think Obama did, but not with a different demographic. I live in flyover country and I could just tell you that these people would walk over glass to vote for him. And they did. They turned out again. You have to tip his hat. I don't know quite what it is. Like he's just got like, look, whatever you think of the McDonald's and garbage trucks stunts. I mean, when I went to go out, there were people standing in line wearing colored vests. And when I drove by the voting station on my way into the office on election day, there was an enormous number of pickup trucks in the parking lot. He just connects in a way that Harris couldn't. And politics is about passion and momentum. Speaking of the momentum element of just his brand and his platform, what do you think the first 60 days of his presidency are going to be focused on specifically from an economic standpoint? It's going to be a blitz. It's going to be deregulation, especially in the energy sector. It's going to be tariffs and it's going to be, I think, RFK Jr. is going to get a",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 47,
      "start_timestamp": "00:37:31",
      "start_timestamp_seconds": 2251.4553191489363,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2251"
    }
  },
  {
    "text": "days of his presidency are going to be focused on specifically from an economic standpoint? It's going to be a blitz. It's going to be deregulation, especially in the energy sector. It's going to be tariffs and it's going to be, I think, RFK Jr. is going to get a free hand on the sort of health agenda. I noted with interest that in the euphoria of the 1500 point rally in the Dow day after election day, one company was ominous in its failure to participate. And that was Pfizer. Pfizer was down on the day or flat. Unch, as you might say, that was very curious to me. Solar being down 15 Pfizer unchanged and everything else to the moon. So it tells you the market believes that Trump is going to do what he says he's going to do. But they're hedging on the power of the pharmaceutical companies because they're just so omnipresent in all of the sort of political donation cycles and all of that other stuff and in the media cycles as well. I do think that there is a significant risk that is being underappreciated, which is RFK Jr. is going to target pharmaceutical company advertising and getting it banned in the US, which would be a one two punch because it'll be a death blow to the quote unquote traditional media or mainstream media that Trump hates so much. You take away pharmaceutical advertising from ABC, NBC, CBS, Fox, CNN. These companies",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 47,
      "start_timestamp": "00:39:09",
      "start_timestamp_seconds": 2349.344680851064,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2349"
    }
  },
  {
    "text": "pharmaceutical company advertising and getting it banned in the US, which would be a one two punch because it'll be a death blow to the quote unquote traditional media or mainstream media that Trump hates so much. You take away pharmaceutical advertising from ABC, NBC, CBS, Fox, CNN. These companies are going to be in the heart locker. And so we're seeing a lot of angst amongst our contacts in the pharmaceutical industry. The traditional media is still trying to figure out how this phenomenon could happen. They have no idea how out of touch they are with the exact same people I just described as willing to walk over glass to vote for Trump. It's gotten to the point now where if something is published in the traditional media, not only is it not believed by the people I just described, they immediately assume the opposite must be true. We've written a piece that we haven't published on Ivermectin, for example. The moment the press started making fun of those taking Ivermectin, everyone assumed it must be really effective against COVID. And there's just this this real knee jerk response to whatever it is that the man on CNN is telling me the exact opposite must be true. And that is a dangerous place for society, but it's where we are. Do you think that there's some sort of intervention or interaction with Ukraine is real those conflicts? Yeah, our initial response is this is a very bearish development",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 47,
      "start_timestamp": "00:40:47",
      "start_timestamp_seconds": 2447.2340425531916,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2447"
    }
  },
  {
    "text": "is telling me the exact opposite must be true. And that is a dangerous place for society, but it's where we are. Do you think that there's some sort of intervention or interaction with Ukraine is real those conflicts? Yeah, our initial response is this is a very bearish development for Ukraine. Let's not forget that they once impeached Trump on Ukraine. And it's not like he doesn't know what's actually going on over there. I think he is a person who has an affinity for and respect for strong men. And Putin certainly falls in that category as does GCPing, we should say. And he's really interested in fighting and winning an economic war with China. I think he would view the Ukraine Russia war as a distraction. The challenge that we see in the Ukraine situation is Trump is a little naive when it comes to his appraisal of the leverage the US currently has in that situation. And the type of deal that the Russians would be willing to accept after two and a half years of conflict with NATO. I don't really see where Trump to get a deal that he can sell as being an outproduct of his violent negotiation skills, at least his self-assumed negotiation skills. And I think the Russians are aware of who Trump is and have decided that they're not going to be fooled again, quote unquote, their view, not mine, on cutting another deal with the West, that the West",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 47,
      "start_timestamp": "00:42:25",
      "start_timestamp_seconds": 2545.123404255319,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2545"
    }
  },
  {
    "text": "outproduct of his violent negotiation skills, at least his self-assumed negotiation skills. And I think the Russians are aware of who Trump is and have decided that they're not going to be fooled again, quote unquote, their view, not mine, on cutting another deal with the West, that the West ultimately re-niggs upon in the years ahead. So I don't think that Trump is going to be able to stop the war in Ukraine as easily as he thinks he can. But Ukraine is in a very precarious spot. And Trump's election could cause a morale crisis amongst the troops in Ukraine that could make all of it moot, because the Russians have been gaining sort of rather rapidly in the past few months. As it pertains to Israel and Iran, that's a harder one for us to model. He has a unique history with Iran, and a closeness with Netanyahu allegedly, although I thought when he left office in 2020 that he and Netanyahu were a bit on the outs, but they seem to be back in good graces with each other now. Netanyahu certainly seemed to welcome Trump's ascension, but we shall see. I think if you take the big picture, one of the things that Trump regularly bragged about on the campaign trail was he had no wars during his first term. Now, he inherited existing wars, Afghanistan in particular, but there were no new conflicts started while he was president. And I think he views himself",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 47,
      "start_timestamp": "00:44:03",
      "start_timestamp_seconds": 2643.0127659574473,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2643"
    }
  },
  {
    "text": "the big picture, one of the things that Trump regularly bragged about on the campaign trail was he had no wars during his first term. Now, he inherited existing wars, Afghanistan in particular, but there were no new conflicts started while he was president. And I think he views himself as a champion of peace through strength, the classic sort of Reagan mold, whether he has enough strength to impose peace both in Ukraine and in the Middle East remains to be seen. Although I would note with some interest that we've seen a few reports like the Houthis unilaterally deciding to end their campaign in the Red Sea. I don't know if that's true. I saw it on Twitter and Hamas calling for a ceasefire now that Trump has won the election. But time will tell, I think I would not personally be surprised to see Trump and Putin meeting in person. Shortly after Trump takes office to try to iron out a grand bargain, that will of course horrify people in the collective West and the sort of the neo-continuing of the US political scene. Trump wants to bring these wars to an end. He wants to focus his efforts on an economic war with China. I don't think he wants a military conflict with China. By the way, he would like to be a peace candidate who brought economic prosperity back to the, you know, lunchpale joes of America. And escalating in either Ukraine or the Middle",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 47,
      "start_timestamp": "00:45:40",
      "start_timestamp_seconds": 2740.9021276595745,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2740"
    }
  },
  {
    "text": "his efforts on an economic war with China. I don't think he wants a military conflict with China. By the way, he would like to be a peace candidate who brought economic prosperity back to the, you know, lunchpale joes of America. And escalating in either Ukraine or the Middle East doesn't serve that agenda. Now, when you look at the interaction though between Ukraine, Russia, how long the conflict has been going, have you modeled even a loose idea of what an agreement could likely look like? I think that the, so one of the things I tried myself on doing is reading the local propaganda of all the parties involved. Because you have to understand what they're telling themselves to model the degrees of freedom they have in a negotiated settlement, for example. And people often mistake, or have the mistaken assumption that Putin is Russia and that he's the only person that matters in Russia. That's not true. He exists in a political system. He has allies. He has adversaries. He has people who might be angling for his job like every other country. And he has certain limitations in his degrees of freedom. I think the two sides are astronomically far apart. And Russia has stated its intent to impose a solution militarily and to dare the US or NATO to do anything about it. Unless and until the US, IE Trump is willing to escalate to a nuclear conflict in our view, not being military",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 47,
      "start_timestamp": "00:47:18",
      "start_timestamp_seconds": 2838.791489361702,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2838"
    }
  },
  {
    "text": "two sides are astronomically far apart. And Russia has stated its intent to impose a solution militarily and to dare the US or NATO to do anything about it. Unless and until the US, IE Trump is willing to escalate to a nuclear conflict in our view, not being military experts, but having followed the conflict very closely, especially since the beginning of the year when we started studying it for a piece that we wrote. But there's not all that much the US can do, short of a nuclear war. And I don't think anybody wants a nuclear war. So I think Putin views time as being on his side. He's fighting a war of attrition. Russia is bigger or populist. Has a much more pronounced military industrial complex right next door to the line of contact. As is convoluted and tied to China and thousands of miles away. It's just not a war that we could have ever won. We had to win earlier where we were going to lose a grinding war. And the Russians, if anything, know how to march from east to west, you know, leveling towns along the way. I do think we're going to see a pressing crisis that might bring Trump in the west closer to Putin's demands. By the way, his demands are the four regions and a comprehensive settlement to the entire security situation in Europe, IE, no missiles in Germany, and never allowing Ukraine to join NATO and all",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 47,
      "start_timestamp": "00:48:56",
      "start_timestamp_seconds": 2936.6808510638302,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=2936"
    }
  },
  {
    "text": "to see a pressing crisis that might bring Trump in the west closer to Putin's demands. By the way, his demands are the four regions and a comprehensive settlement to the entire security situation in Europe, IE, no missiles in Germany, and never allowing Ukraine to join NATO and all of these, what the West would call extremist demands. Well, might is right. And if he imposes those conditions upon Ukraine, and we can't do anything about it, then we'll get there eventually. But one issue that I think might accelerate an end to the war on terms closer to Russia's is the upcoming winter and the fact that the Russians have been, I believe, illegally targeting Ukraine electricity grid for destruction. And it's going to be a country that really just can't be lived in pretty soon if we have a cold winter. I see. Pivoting a little bit now, I want to talk a little bit more about the just energy sector reaction to things. And we've seen a bit of a mixed bag. What are your thoughts on nuclear power in the future for that? Bullish nuclear. Trump is very bullish nuclear. And the collapse of the environmental left will finally, you know, slay the last of the malfeudions, where opposed the nuclear power for silly reasons. So nuclear, totally bullish. Oil is a mixed bag. I think the initial response to his election was bearish, which is correct. And then we've seen a bit of a",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 47,
      "start_timestamp": "00:50:34",
      "start_timestamp_seconds": 3034.5702127659574,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3034"
    }
  },
  {
    "text": "environmental left will finally, you know, slay the last of the malfeudions, where opposed the nuclear power for silly reasons. So nuclear, totally bullish. Oil is a mixed bag. I think the initial response to his election was bearish, which is correct. And then we've seen a bit of a bounce back as the market digests the geopolitical uncertainties of Trump's views on Iran and Israel. He is a unknown or a chaotic actor in that regard. And so if he resolves the Middle East and we could get some form of peace in Ukraine, Joe Babydrell is just unabashedly bearish for oil prices, bearish for oil producers and bullish for oil service providers because there's going to be more volume pumped. That's sort of the superficial 20,000 but view of it all. A lot of ifs in there. But the all things being equal in no World War III, the direction of oil is down. OPEC is in big trouble. Trump is going to unleash the American oil and gas producers. They have very little track record of being disciplined in this regard. If they can drill, they will drill. And the model otherwise, I think, is silly. And Trump wants them to drill. He wants cheap hydrocarbons to feed the industrial revolution that he sees in the in the ensuring of the military industrial complex supply chains. What do you make of the there's like the I forgot the thing that he decided to call it, but he",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 47,
      "start_timestamp": "00:52:12",
      "start_timestamp_seconds": 3132.459574468085,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3132"
    }
  },
  {
    "text": "Trump wants them to drill. He wants cheap hydrocarbons to feed the industrial revolution that he sees in the in the ensuring of the military industrial complex supply chains. What do you make of the there's like the I forgot the thing that he decided to call it, but he it's one of the things that he's looking to use Elon Musk for. It's like the government efficiency. The Dodge. Yeah. Yeah. Is Elon calls it, but whatever it'll end up being. What do you think about that? I think that's going to be way harder than Elon thinks. Elon's used to walking in with a sink to Twitter and being a dictator. First of all, if it's a cabinet level position, he'd have to be approved by the Senate. That won't be a short putt given his rather colorful past. But beyond that, the hardest thing to do in Washington is to fire a government employee. And the unions have power. They have laws behind them. That one is going to be more challenging. I think removing rules and regulations through the stroke of a pan is far easier. Cutting out 2 trillion of federal expenditures is a whole different animal altogether. And frankly, many on the Republican side don't want that to happen either because it's a unit party of pork being distributed. And so all one giant grift. There's not like there's an army of physical disciplinarians on the Republican side that have been held back by",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 47,
      "start_timestamp": "00:53:50",
      "start_timestamp_seconds": 3230.348936170213,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3230"
    }
  },
  {
    "text": "different animal altogether. And frankly, many on the Republican side don't want that to happen either because it's a unit party of pork being distributed. And so all one giant grift. There's not like there's an army of physical disciplinarians on the Republican side that have been held back by the left. There's a very small number of honorable physical disciplinarians on the on the Republican side and a few on the left. But nowhere near a plurality or let alone a majority. And so I think it's easy to say I will cut 2 trillion for the budget. Let's see if you can do it. And another reason why I don't think it's going to happen is because that wouldn't be catastrophic for GDP. It would tip the country into recession. And Trump likes his numbers to go up. So then how do those reconcile? I don't think they do. I think we just stay on this fiscal dominance path. And Trump makes the numbers go up, including the debt, including the deficit, GDP, be it nominal or not, oil production. Again, the only number of the board he wants to see go down is gasoline prices. What do you think about the tax incentive he's looking at rolling out, where would reduce corporate taxes to I think 15. Yeah, look, he wants to extend his tax cuts, you know, but they accept the expire in 2025. And that's why the outcome of the House races is so critical.",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 47,
      "start_timestamp": "00:55:28",
      "start_timestamp_seconds": 3328.238297872341,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3328"
    }
  },
  {
    "text": "you think about the tax incentive he's looking at rolling out, where would reduce corporate taxes to I think 15. Yeah, look, he wants to extend his tax cuts, you know, but they accept the expire in 2025. And that's why the outcome of the House races is so critical. That's another example. You can't cut taxes and be unable to cut spending and then expect that like the deficit's going to go down. I think, look, Trump is inflationary. Let's be very clear. You need to pivot. The current US president is an inflationary force. Re-shoring is inflationary. The only deflationary impact is the bottom of the energy. And that's the significant one. But on balance, Trump is inflationary and should be modeled as such. So then I guess to zoom in on that though, do you think that companies are likely to respond to that? Do you think that companies are happier just taking the 5 hit on production and continuing to try externally? Do you think that there's a potential for this, actually, meaningfully move production of various things to within US borders? Oh, it's going to move the deal. Yeah. And they now have four years of regulatory certainty, which is like forever in politics, right? And so yeah, I, and by the way, like 95 of them voted for Trump. So like this is, they have all the cards now. This is the point of our next piece. Like this is a profound earth shattering,",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 47,
      "start_timestamp": "00:57:06",
      "start_timestamp_seconds": 3426.127659574468,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3426"
    }
  },
  {
    "text": "of regulatory certainty, which is like forever in politics, right? And so yeah, I, and by the way, like 95 of them voted for Trump. So like this is, they have all the cards now. This is the point of our next piece. Like this is a profound earth shattering, meaningful historic event that happened earlier this week. The game has changed. And the extent to which the game has changed and the amount of sort of changing that happens over the next four years is going to be well beyond what I think even the most aggressive people are modeling today, for sure. What do you think about immigration? I think he's going to do everything he said he's going to do. Look, it's, it's, look, as an immigrant to the US who followed the rules and took many, many years to eventually become a citizen, you know, and when I was immigrating, I never forgot that I was a privileged guest of the US government. I'm torn on the subject. The US needs legal immigration. It needs the number and training and backgrounds of the people that it should want to select into the country. I think who becomes a US citizen is, is well within the, the sovereign domain of the US government and look at countries like Australia, they do it, or even Canada, they do it on a merit-based system, a point system. The, the issue, which I think drove a lot of people to",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 47,
      "start_timestamp": "00:58:44",
      "start_timestamp_seconds": 3524.0170212765956,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3524"
    }
  },
  {
    "text": "becomes a US citizen is, is well within the, the sovereign domain of the US government and look at countries like Australia, they do it, or even Canada, they do it on a merit-based system, a point system. The, the issue, which I think drove a lot of people to the, to the tolls is the quote-unquote legal immigration. I have deep sympathy for people who want to come to the US and to make a better life for themselves because I was once one of those people and I have made a better life for myself in this amazing, wonderful country. But at the same time, you have to follow the rules, but then the counter to that is sometimes it's very difficult to know what the rules are. Like the rules of your current situation when you're coming over the border might make that decision a no-brainer from a game-through perspective get there and try to stay as opposed to trying to find a legal way to get there in the first place. And so I, I very mixed emotions on it, but objectively as an analyst, he is going to deport a lot of illegal immigrants. It's going to be very destructive for people who came here believing there were a different set of rules. It's going to be deeply polarizing and I believe I believe you should take him at his word is what he's going to do. What do you think the impact is there",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 47,
      "start_timestamp": "01:00:21",
      "start_timestamp_seconds": 3621.9063829787237,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3621"
    }
  },
  {
    "text": "going to be very destructive for people who came here believing there were a different set of rules. It's going to be deeply polarizing and I believe I believe you should take him at his word is what he's going to do. What do you think the impact is there to industry? I think it's another inflationary force. Look, one of the dirty secrets is a lot of big companies like illegal immigration because it gives them access to cheap labor, especially in the agricultural sector. And you know, there's a lot of jobs that quote unquote the current youth of America don't necessarily want to do or have been taught that they shouldn't do that they should go to college and such work has been eaten right. I don't subscribe to such things, but that's just the reality of the situation we have. And so it is inflationary, sorry inflationary, and it is going to provoke violence I think. It's going to add fuel to societal upheaval, but I think we should take him at his word that this is what he's going to do. What do you think about the US Mexico-Canada agreement agreement and the renegotiation he talked about there? I think if the flow over the Mexican border doesn't stop he'll tear it up because he needs he's threatening to raise tariffs on Mexico if they don't play ball on immigration. I suspect they will by the way I think. And by the way that the",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 47,
      "start_timestamp": "01:01:59",
      "start_timestamp_seconds": 3719.795744680851,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3719"
    }
  },
  {
    "text": "talked about there? I think if the flow over the Mexican border doesn't stop he'll tear it up because he needs he's threatening to raise tariffs on Mexico if they don't play ball on immigration. I suspect they will by the way I think. And by the way that the message will go out that this is no longer in your best interest from a game through your perspective to take that risk. I think he's going to cut off any benefits that he can to those that are here as a way to sort of drive them out. It's a catastrophe, a humane and inhumane situation that both sides bear significant responsibility for allowing to have gotten to this point and for the ugliness that I fear will soon follow. But again our objective as analysts is to observe the pieces on the board and predict the movements not necessarily to wish for one outcome or to advocate for an outcome. And speaking of predicting movements as you look across just the way things are going now and to summarize at a high level what are the top three to five pieces that you see moving in their impacts. Obviously we already talked about a couple of them things like oil, glass, oil and gas, climate change. What other things come to mind though? Massive deregulation, substantial investment, inflationary forces, cheap energy, abundant energy, political polarization. And I think Trump is the beginning of a worldwide movement. I think",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 47,
      "start_timestamp": "01:03:37",
      "start_timestamp_seconds": 3817.6851063829786,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3817"
    }
  },
  {
    "text": "Obviously we already talked about a couple of them things like oil, glass, oil and gas, climate change. What other things come to mind though? Massive deregulation, substantial investment, inflationary forces, cheap energy, abundant energy, political polarization. And I think Trump is the beginning of a worldwide movement. I think the impact of Trump in this last election. We already saw it look the government in Germany collapsed within 24 hours of Trump winning. I think the UK is going down to go a significant reconsideration of its politics. The European Union might not survive it. The Middle East is going to be totally reshaped. He is a historically consequential figure. There has never been another. Probably won't ever be another. And the next four years are going to be a hell of a ride. What do you think about the reshaping of the Middle East? Yeah, much depends on how Iran is real shakes out. And I just don't know. I don't have an edge. I don't have sources. I don't can't say that I can predict that I know what his objectives are, whether that can happen over there remains to be seen. Israel is in a very precarious position, by the way. I mean, if you cut through the propaganda and you actually go in and take a look at what actually is going on, it is a very foreign society. They had their democracy. They're, you know, Netanyahu is not a dictator. There's very strong arguments",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 47,
      "start_timestamp": "01:05:15",
      "start_timestamp_seconds": 3915.5744680851067,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=3915"
    }
  },
  {
    "text": "precarious position, by the way. I mean, if you cut through the propaganda and you actually go in and take a look at what actually is going on, it is a very foreign society. They had their democracy. They're, you know, Netanyahu is not a dictator. There's very strong arguments going on inside of Israel as to the wisdom of the current response to the October 7th attacks. This is the faint ability of this response. How the IDF is doing in Lebanon is a very interesting thing to ask and to ponder. And we've written about some of the vulnerabilities of Israel and how Iran's attack on a October 1st may have exposed them. So count us in a camp that hopes that Trump can lead to a lasting peace or at least a day-taunt in the region because war is always the abject failure of diplomacy. Look, if you can bring both wars to an end, I think you should get a Nobel priest, I mean, not that he will, but I'm all enough to remember when seeking peace was a liberal attribute and one that was rewarded. So we shall see. It's going to be a fascinating 90 days, for sure. I think Q1 2025 is going to be historic. One more question not related to the presidency, but just in general. We're obviously going through an earning cycle now. What do you make of that? I think the economy is doing mostly fine. Again, when you",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 47,
      "start_timestamp": "01:06:53",
      "start_timestamp_seconds": 4013.4638297872343,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4013"
    }
  },
  {
    "text": "90 days, for sure. I think Q1 2025 is going to be historic. One more question not related to the presidency, but just in general. We're obviously going through an earning cycle now. What do you make of that? I think the economy is doing mostly fine. Again, when you have fiscal stimulus, the likes of which we're seeing and dirt cheap abundant hydrocarbons, American companies are going to do fine. I think the economy is running roughly along the GDP numbers, the government prints. I look here, natural gas, 2.50 million BTO right now. That's dirt cheap. That's a very valuable hydrocarbon that does an enormous amount of work that feeds hundreds of cogeneration facilities within the browns field sites of heavy industry where they take that natural gas and they make both industrial grade steam and electricity with very high efficiencies. The fact that our industry supply chains can do it at a fraction of the globes is a huge advantage and explains why we didn't go into a recession before the election. I think earning a couple of big companies set the tone for everything and we'll have to see how they all end up reporting. But by and large, I think the economy is fine and we'll see what the Trump effect will be. Eager. That's just what comes to mind. I'm very, very curious what this whole thing ends playing out as. But I always really appreciate the nuance of your perspectives and taking the",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 47,
      "start_timestamp": "01:08:31",
      "start_timestamp_seconds": 4111.353191489362,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4111"
    }
  },
  {
    "text": "by and large, I think the economy is fine and we'll see what the Trump effect will be. Eager. That's just what comes to mind. I'm very, very curious what this whole thing ends playing out as. But I always really appreciate the nuance of your perspectives and taking the time to get into some of those details there. The last thing I want to ask you before we wrap up. Right now we're going through it looks like financial sector flying obviously starting to price in the expectation of deregulation and whatnot. Looking out before JP Morgan Goldman Sacks, they were starting to forecast a higher probability not super high but a higher probability of recession in 2025. One of the prospects for a recession is it sits now in your eyes. I mean, you eventually have to have one. It's been a while since we have. Look, I think the banks are flying because of the prospect of enough coming in at MNABOOM. I think the FTC, changing leadership at the FTC is one of the number one desires of Wall Street. And so I think Matt Stoller was just out with a great piece on Substack making this point earlier. But as far as recession in 2025 goes, it's hard to see. It's going to be a boom. People can flake fiscal spending and deficits and ever increasing debt and money printing as being bad. And they are, I suppose, in context, but not in a short",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 47,
      "start_timestamp": "01:10:09",
      "start_timestamp_seconds": 4209.24255319149,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4209"
    }
  },
  {
    "text": "this point earlier. But as far as recession in 2025 goes, it's hard to see. It's going to be a boom. People can flake fiscal spending and deficits and ever increasing debt and money printing as being bad. And they are, I suppose, in context, but not in a short term. There's a reason why it's called a sugar high. Now the crash will eventually come. Do I think the crash comes in 2025? I don't know. The US is still the global reserve currency and has a lot of runway in this regard. And seems intent on keeping the party going. So it'll look in less until you see a long bond blown out to six or seven or eight percent. Then we have a different discussion, I suppose. So big old TBD. We'll see how the bonds do. Money printer go per. Yeah. I tell you what, that thing can work in overtime. Well, by the way, let's one last point that I think runs counter to the sort of recession narrative. As China's not just going to sit there and Xi might be provoked into firing the big bazooka in response to Trump's tariffs and his protectionist isolationist ambitions. And if you have a giant bazooka coming out of China, that black debt liquidity is going to slosh around the world and find its way to our markets too. So in a race to the top, there are too many boats sunk to the bottom. So if",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 47,
      "start_timestamp": "01:11:47",
      "start_timestamp_seconds": 4307.131914893617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4307"
    }
  },
  {
    "text": "isolationist ambitions. And if you have a giant bazooka coming out of China, that black debt liquidity is going to slosh around the world and find its way to our markets too. So in a race to the top, there are too many boats sunk to the bottom. So if you pushed me, I would fade a recession in 2025. You heard it here first. Just don't remind me if I'm wrong, right, brother? Well, obviously, we just focus on the time time. Those are the important ones. Doomberg and team, I always say in team because I know that there's other people that make the whole thing happen over there. So I'm as always super thankful to catch up, always enjoy discussing. Obviously, people can find you on your website, which I will throw to in the video description below, but anything else you want to leave people with? No, doberg.com. Find everything there. Our pieces, our protier, our podcast appearances. We were also very active on Substack Notes, which is their version of Twitter, which is becoming actually quite active. And so we're trying our best to be like we once were on Twitter while we were still active on that platform. Eric, always a great pleasure to talk to you. Looking forward to the next time. Absolutely awesome. We'll see you guys later.",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 47,
      "start_timestamp": "01:13:25",
      "start_timestamp_seconds": 4405.021276595745,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4405"
    }
  },
  {
    "text": "active on that platform. Eric, always a great pleasure to talk to you. Looking forward to the next time. Absolutely awesome. We'll see you guys later.",
    "metadata": {
      "video_id": "OWQs77SA_m4",
      "title": "What's the REAL Election Impact on Our Future? w/ Doomberg | TOP",
      "url": "https://www.youtube.com/watch?v=OWQs77SA_m4",
      "upload_date": "",
      "duration": 3353.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 47,
      "start_timestamp": "01:15:02",
      "start_timestamp_seconds": 4502.9106382978725,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=OWQs77SA_m4&t=4502"
    }
  }
]