[
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "What's up, Alleyers? Welcome back to the Outlier podcast. We're back with a familiar face. Tom Saas Knopf and we actually just spoke not that long ago. And then you did a rope and dope on me. We literally talked on Monday or Tuesday and then Wednesday some big news comes out that you were making your departure and starting to look at something new. So then I reached out and I was just like, all right. Well, now I got to talk to you again and understand what's going on. So welcome back. Thanks for joining on a pretty short cadence, but I'm excited to talk to you. I'm excited to be back. Happy to spread the word. Spread the love. What do we do? Let's do exactly that. I think a lot of us when we heard that you're leaving T.C. live obviously most people are completely shocked. And it's because you've obviously built your whole life around markets doing that whole thing. I think sometimes people forget that you're a serial entrepreneur. Did the whole think or swim thing that made a jump. Did something else and this is kind of part of your broader M.O. but I think a lot of us got rolled into a fall sense of security and the news drops. So talk to us about that. What led to the switch? And can you explain a little bit about the timing? Why then? Sure. Because so I am definitely an entrepreneur. I'm",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 87.76,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "I think a lot of us got rolled into a fall sense of security and the news drops. So talk to us about that. What led to the switch? And can you explain a little bit about the timing? Why then? Sure. Because so I am definitely an entrepreneur. I'm a little bit of a psycho in that sense. For the last 44 years I have worked essentially for myself. I have even what I've killed basically. The only two times I've ever received a paycheck in 44 years where, well, right when I got a college I had a job for about six months but that doesn't count. When we got bought out by TD Ameritrade and then when we got bought out by IG, only times I've ever received a paycheck. And they checked though. Yeah, but not something that I'm used to or whatever. It doesn't register with me. At TD, I didn't cash a check for two years until they basically said, you got to cash these checks are not going to be good anymore. And IG, I cash a check but I have no idea what they paid me. I don't even know. I don't even know. I don't even know. I swear to God, I don't know. So I've been pretty much on my own. I still consider it and you know, always being on my own. After you get bought out, you lose control. And it's kind of a weird thing. When we",
    "start_timestamp_seconds": 57.6,
    "end_timestamp_seconds": 161.76,
    "start_timestamp": "00:57",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=57",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "even know. I don't even know. I swear to God, I don't know. So I've been pretty much on my own. I still consider it and you know, always being on my own. After you get bought out, you lose control. And it's kind of a weird thing. When we got bought out the first time by TD, I stayed on for two years because I just, you know, I was, I had, I had agreed to stay on for three years. But I was very close to the CEO Fred Tomzack at the time. And after two years I went to him and said, you know, Fred, am I ever going to be the CEO of TD Ameritrade? And he looked at me and he said, not, not over my dead body. And so we laughed about it and I said, listen, you know, I got to do something else. And because I, I'm getting older, I got to, you know, I got to build some stuff. And he's like, I'm surprised it took you this long. He goes, I'm shocked you're still here. He goes, you could stay as long as you want. But, you know, they were, they're paying me a lot of money and do whatever. But I just was like, I want to go on and build something. And so he goes, what do you want to build? I want to build this company called Tasty Trader. He goes, oh my god, I hate that",
    "start_timestamp_seconds": 142.76,
    "end_timestamp_seconds": 219.76,
    "start_timestamp": "02:22",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=142",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "they're paying me a lot of money and do whatever. But I just was like, I want to go on and build something. And so he goes, what do you want to build? I want to build this company called Tasty Trader. He goes, oh my god, I hate that name worse than thinker swim. And I'm like, well, thinker swim worked out pretty good for you. And he goes, yeah, it did. So I go, and he said, what is it going to be? And I said, well, we're going to build this network. And at the time, it was also such a thing of streaming. So I said, it's a streaming network. And he's like, what is a streaming network? And I'm like, you know, we're going to talk about markets. And we're going to talk about trading. We're going to talk about math and quantitative data. And we're going to talk about the market and quantitative stuff. And he goes, none of that makes any sense to me. But whatever you do, I want in. And so I go, okay, so he goes, how much? Well, I'll put up my money and you got to put up some money. He goes, I'll put up 20 million. Okay, which is a lot for an idea. And I go, all right, that's more than fair. And he didn't know anything. He hated the name, he hated the idea. And he's like, but I'm vetting on you. Because whatever you",
    "start_timestamp_seconds": 208.76,
    "end_timestamp_seconds": 276.76,
    "start_timestamp": "03:28",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=208",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "some money. He goes, I'll put up 20 million. Okay, which is a lot for an idea. And I go, all right, that's more than fair. And he didn't know anything. He hated the name, he hated the idea. And he's like, but I'm vetting on you. Because whatever you do, I think it's going to work. So I'm like, okay, well, I was going to head. We put up the money. They put up a portion of their money at the time. And, and then I quickly realized, I didn't want any more of their money. Because I didn't want, I didn't need their money. I didn't want it. But it was very nice and generous. And we cut a marketing deal with them. And we went ahead and built tasty. And it became crazy, successful of the next, you know, ten years. And I kind of had this old, to remember Theo Epstein, who was the, he was the GM of the boss of Red Sox, took him to the World Series. And then twice. And then he was the GM of the Cubs. And took the Cubs to the World Series. So he's a very successful GM. And he always used to say, they said, why do they leave the Red Sox to go as well? After ten years, it was just time. So after 12 years at Thinkerswim. And then it was 14, almost 15 years at tasty. We started in 2010 until the, you know,",
    "start_timestamp_seconds": 259.76,
    "end_timestamp_seconds": 338.76,
    "start_timestamp": "04:19",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=259",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "And he always used to say, they said, why do they leave the Red Sox to go as well? After ten years, it was just time. So after 12 years at Thinkerswim. And then it was 14, almost 15 years at tasty. We started in 2010 until the, you know, middle of or end of 2025. And we sold the company in 2021. And I lasted four years after we sold. Because I love what I do. I loved talking about markets. I loved the whole tasty nation. I loved everything about it. But I know longer had it had to see the table because I didn't want. I was the largest shareholder of the company in a publicly traded company in the UK. But I was, I was the largest shareholder. But I didn't want to, you know, I had no say anymore. I didn't want to say. I didn't, if I wasn't going to, I tried to run the company at one point. I went to the board at IG. And I said, I think I should run this company because I'm a better CEO than the people that you have. And I understand this business better than anybody at this company. And you guys have been stuck in the mud for 40 some years. Let me run the company and let me take it global. But they love the same thing that TD Ameritrade said to me, which is go pound sand. Which, you know, I mean,",
    "start_timestamp_seconds": 322.76,
    "end_timestamp_seconds": 407.76,
    "start_timestamp": "05:22",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=322",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "anybody at this company. And you guys have been stuck in the mud for 40 some years. Let me run the company and let me take it global. But they love the same thing that TD Ameritrade said to me, which is go pound sand. Which, you know, I mean, obviously everybody's entitled to that. They go, we want your company, but we don't, we don't want you to run it. You know, we don't want you to run this whole thing. I'm like, okay, just wanted to make sure we understood. And I made it pretty passionate, get taste for it. You know, to move to London, I want to run the whole thing globally. They said, no, it's fine. Well, then I don't want to run the US anymore. I just want to do my thing. And they're like, okay, that's fine. So, four years into the deal, I decided it's time. I can finally sell some stock. I decided it's time for me to move on. I have nothing but great things to say about tasty. It's an amazing company. It's probably the best brokerage firm on the planet. You know, I still use the platform, you know, 50 to 100 times a day. And the people there are awesome, but it was just time for me to go out on my own terms. So to answer your question, the long form, it was just time for me to go out on my own terms. And I",
    "start_timestamp_seconds": 390.76,
    "end_timestamp_seconds": 468.76,
    "start_timestamp": "06:30",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=390",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "know, 50 to 100 times a day. And the people there are awesome, but it was just time for me to go out on my own terms. So to answer your question, the long form, it was just time for me to go out on my own terms. And I had an idea of working on for a couple of years. And it was time for me to go and take over a new company. That I'm the lead investor and or one of the lead investors, but but I had never run the company until, you know, two or three weeks ago. When you made the choice to sell tasty to IG, I have to imagine you didn't really need the money. In that scenario, you probably knew that you were giving up control. But you didn't like in Thinkorswim. So walk me through that logic. Well, you know you're going to give up control when you sell. Obviously. But the logic is is when you make a decision that you're going to consider selling. For some, somehow, I can't explain how. When we decided that we're going to sell Thinkorswim, there were three companies willing to pay cash for. It was very popular. It was in the middle of the whole financial meltdown. Everybody wants to pay cash. So I knew we had a great company. When we wanted to sell tasty, or when we at least talked started trying to confirm there were five companies that came",
    "start_timestamp_seconds": 451.76,
    "end_timestamp_seconds": 541.76,
    "start_timestamp": "07:31",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=451",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "for. It was very popular. It was in the middle of the whole financial meltdown. Everybody wants to pay cash. So I knew we had a great company. When we wanted to sell tasty, or when we at least talked started trying to confirm there were five companies that came out to buy tasty. And so five different companies, all, you know, cash cash and stock, the whole deal. And we just felt like, you know, when you've been doing something in the same space for 40 some odd years, I know it's really cool to take it to the very end. But it's also really cool to have to put a winner on the board, have a really good legacy to do multiple unicorns. And then to go try to do it again, a different, something different. And I think all of us had this idea where, you know, it was a great trade. It was a great win. It was an amazing company. And we all like Scott and I and Christy and Woody, we all love building stuff. We're the same team that built both Thinkorswim and tasty. Scott and I have actually been partners since the late 80s. And we built three companies together. First one was a prop trading firm. And I built Christy and I and Woody and I built Thinkorswim and tasty together. So we've all been together for a long time. And we love building stuff. Running stuff, rather people, not our",
    "start_timestamp_seconds": 524.76,
    "end_timestamp_seconds": 613.76,
    "start_timestamp": "08:44",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=524",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "late 80s. And we built three companies together. First one was a prop trading firm. And I built Christy and I and Woody and I built Thinkorswim and tasty together. So we've all been together for a long time. And we love building stuff. Running stuff, rather people, not our thing. Even though, you know, they left us alone because the companies were double what they paid for it now. You know, it's, it's an amazing company. But it was time to just do something different. So the thought process is nothing more than, you know what? We had a great run. And it's time for us to do more stuff. Like you have to think about it two ways. Either you stay in and you try to make, you know, some more money, of course, or you try to challenge yourself to do something else. Which is crazy. And that's what we all decided to do. It also seems like you're getting to the point of your work. We're like, you're starting to focus a little bit more on like, I don't want to call it like social issues, but like, like things that you care about, whether it's social issue, markets, whatever, because you can also see that in your writing, right? Like over the last few years. I'm opinionated. So just I find I feel like there are certain. I. I understand, you know, the whole, I understand the whole Republicans by sneakers too, you know, going",
    "start_timestamp_seconds": 595.76,
    "end_timestamp_seconds": 690.76,
    "start_timestamp": "09:55",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=595",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "social issue, markets, whatever, because you can also see that in your writing, right? Like over the last few years. I'm opinionated. So just I find I feel like there are certain. I. I understand, you know, the whole, I understand the whole Republicans by sneakers too, you know, going back to the Jordan era. You know, when when when he was asked about that. And and I understand the, you know, the Barclay, not political. This is, you know, I'm an athlete, not a politician. I get all that. And I'm a trader. And I have always been markets and trading first. And I have always been in different to the size of somebody. The size of somebody's account, the amount of money they have, the way they trade. I am, I treat everybody the same way that you have a hundred dollars in your county, you have a hundred million. Doesn't matter to me. But I think there are certain things in the world that do matter to me. You know, I grew up as the, my dad was a civil rights attorney. My grandparents were very political going up in the, you know, growing up in the 60s and seven, late 60s and early 70s. You know, it was, it was the time of, you know, all the Vietnam War protests and all the marches on Washington. And it had an impact on me. And I think that, I think that it's okay to say, you know,",
    "start_timestamp_seconds": 665.76,
    "end_timestamp_seconds": 763.76,
    "start_timestamp": "11:05",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=665",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "60s and seven, late 60s and early 70s. You know, it was, it was the time of, you know, all the Vietnam War protests and all the marches on Washington. And it had an impact on me. And I think that, I think that it's okay to say, you know, when you're writing stuff to talk about things that matter to you, I think it's okay. And I don't really care. What that means, like, like, there's a lot of people that go, I hate his politics. I love his, his trading. You know, I love what he does. I hate what he sometimes what he says. But 98% of what I do and what is, and what I talk about is trading. I think it's okay to mix things up. And I think people that have a voice need to speak up. And I don't think there's anything wrong with that. I think it's fun. And I am what these people that believe in the how important discourses, how important it is to embrace certain arguments and to have certain discussions. And I think it's healthy. And I don't know, that's, I leave it there. I think it makes sense. I burned it. That's all, you know, I burned too. The right to say whatever the, whatever the fuck I want to say. And I'm not, I'm not just about it. I don't, I'm not in somebody's face. I'm just like, hey, this seems wrong to me. This seems",
    "start_timestamp_seconds": 742.76,
    "end_timestamp_seconds": 832.76,
    "start_timestamp": "12:22",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=742",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "sense. I burned it. That's all, you know, I burned too. The right to say whatever the, whatever the fuck I want to say. And I'm not, I'm not just about it. I don't, I'm not in somebody's face. I'm just like, hey, this seems wrong to me. This seems really wrong to me. This seems right to me. I don't know. That's it. I think it's good. Like I genuinely think it's good. I know I definitely have had people talk even on some of our podcasts where they don't necessarily love some of the political stuff. But sure. Which is always going to be the case. But I think more importantly than that is the point that you highlight just on exchange of information and ideas. I think that you probably come across all the time stuff you like don't like, but you can still listen to it. I just appreciate the point of view and then continue on your day. Yeah, you know, I really only do for the last 10 years. I've done one podcast weekly with Dylan Radigan called Truth or Skeps which sometimes we cover topics that are just, you know, we like to debate back and forth. So somebody has to take the other side of everything. But Dylan and I, you know, Dylan's incredibly bright and he's super interesting guy and he's great, great, you know, he has great debate skills. And I love, you know, getting into it with him on",
    "start_timestamp_seconds": 817.76,
    "end_timestamp_seconds": 895.76,
    "start_timestamp": "13:37",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=817",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "debate back and forth. So somebody has to take the other side of everything. But Dylan and I, you know, Dylan's incredibly bright and he's super interesting guy and he's great, great, you know, he has great debate skills. And I love, you know, getting into it with him on just a million different topics. Sometimes it gets political, but other than that we're pretty much, you know, we're pretty much, we stay away from too many controversial topics. But I am now not getting into that. You, I'm not turning my new, my new gig into a political show at all. I'm going after something. I think that everybody will embrace, which is worker fairness. I don't think there's a single person or at least I hope there's not a single person in America that is opposed to worker fairness. I don't see how that's a, I don't see how that's a, you know, a blue red debate. I just don't get, I don't imagine it can be. I mean, everybody wants to be treated fairly. And I think the traditional, the traditional methods of what we call kind of worker fairness are outdated, you know, like a social safety net is outdated, you know, minimum wage as important as it is is not a solution, you know, and so there's things like that, you know equal opportunity is not the answer. It's education and education is really tough when it comes to, you know, wage disparity, you know,",
    "start_timestamp_seconds": 869.76,
    "end_timestamp_seconds": 975.76,
    "start_timestamp": "14:29",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=869",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "safety net is outdated, you know, minimum wage as important as it is is not a solution, you know, and so there's things like that, you know equal opportunity is not the answer. It's education and education is really tough when it comes to, you know, wage disparity, you know, income inequality. And I think that that's a topic that I can't imagine there's anybody that's opposed to making more money. I don't care what side of the venture on. So I'm not making this political at all. Right. Before we talk about law, stock and one lucky dog. I want to ask you one more question about tasty to button that side up specifically. I want you to, and I'm sure you have already, but I want you to reflect on what it is, what you built. And I have two questions. The first thing is what is one piece that you've been pleasantly surprised. And what is one thing that you wanted to do that you never got to. Well, the one thing that's, and sorry for my voice, like just getting over cold so my voice is on great. The one thing that I'm really happy about is that that our mission of the last 25 years was worked and that was accepted and people engaged in it. So, you know, 25 years ago when we decided to build a thing for someone, people were like, Tom, nobody trades options. Nobody trades and, you know, this makes",
    "start_timestamp_seconds": 950.76,
    "end_timestamp_seconds": 1062.76,
    "start_timestamp": "15:50",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=950",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "is that that our mission of the last 25 years was worked and that was accepted and people engaged in it. So, you know, 25 years ago when we decided to build a thing for someone, people were like, Tom, nobody trades options. Nobody trades and, you know, this makes no sense what you guys are building. And when we started to build tasty people were like, nobody wants to listen to you guys talk about markets and talk about math and statistics and probabilistic analysis. But like, nobody wants that crap and we're like, and I always look at people and think, you know, like, why would I ever listen to you? Like, like, like, I make go down in flames, but I don't give a flying fuck what you said. You know, there was somebody that was a writer that came out we built Thinker Swim and she wrote an article in Cranes and she said, New Chicago company raises $22.5 million and it's called Thinker Swim. Doomed to fail because of that name. Worst name ever. Thinker Swim outlasted virtually every other brokerage firm in the world, you know, like there's 50 brokerage firms that have been bought out or sold. And even today, Thinker Swim still lives as part of Charles Schwab's primary platform, you know, I used to say. And then when we built tasty, you know, a bunch of different people from like C. MVC, I got it. I got a call from the",
    "start_timestamp_seconds": 1037.76,
    "end_timestamp_seconds": 1133.76,
    "start_timestamp": "17:17",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1037",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "bought out or sold. And even today, Thinker Swim still lives as part of Charles Schwab's primary platform, you know, I used to say. And then when we built tasty, you know, a bunch of different people from like C. MVC, I got it. I got a call from the executive producer of C. MVC. They're like, you guys cannot pull this off. This is not you, you know, you're not built for this. This is not your thing. And I got a call from a writer, a columnist at the Wall Street Journal, he's like, what the hell are you doing? Nobody watches digital, you know, streaming networks. And what are you guys going to possibly talk about? Nobody cares about, you know, trading that kind of stuff. And I'm like, okay, well, like, I don't listen to that crap. So the fact that what we built was engaging that it worked, that's the coolest part. The, the negative part is that I really was hoping with the deal I did in 2021 with IG that I could take the platform global. And, you know, really kind of send change the whole, I feel like we've changed so much of trading over the last 25 years between both us platforms and between the tasty, you know, network. But I don't feel like we, we, we made, I feel like it was more difficult to go global than I thought. And although we have hundreds of thousands of people from",
    "start_timestamp_seconds": 1116.76,
    "end_timestamp_seconds": 1213.76,
    "start_timestamp": "18:36",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1116",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "of trading over the last 25 years between both us platforms and between the tasty, you know, network. But I don't feel like we, we, we made, I feel like it was more difficult to go global than I thought. And although we have hundreds of thousands of people from all around the world. And, you know, people watching from 180 countries, people trading from, you know, 80 different countries. We still didn't make the global impact that I would have liked to. It's a lot harder than you think. So, so maybe that's the, the one negative on the positive side, you know, was all the other stuff. Yeah, that's awesome. That's it's interesting to hear the thought process to you said something that I wanted double click on because. I just want to get your your thoughts you share a similar way that I've thought about it, which is just kind of like focusing on what you think is right versus the external inputs, but I do find as obviously you know better than most people that as people tend to grow your footprint grows what you're working on grows your brain grows. That there really is no shortage of critics and it always seems. Frequently that critics really don't necessarily have like some sort of great pedigree behind them to even start criticizing and it feels like a lot of times critics come at it just to like tear and idea down versus like trying to give",
    "start_timestamp_seconds": 1190.76,
    "end_timestamp_seconds": 1268.76,
    "start_timestamp": "19:50",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1190",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "shortage of critics and it always seems. Frequently that critics really don't necessarily have like some sort of great pedigree behind them to even start criticizing and it feels like a lot of times critics come at it just to like tear and idea down versus like trying to give like constructive criticism. Obviously, you've developed a way of handling critics, but what's been the way that you typically manage that over time because I mean realistically trading platform called tasty trade is random like objectively it's random, but it's worked. You were able to like see through that criticism, but my guess is you probably have some thought partners that you do let in, but I'd like to hear more about that balance between external criticisms, but integrating like good ideas. You know, I spent 20 years on the trading floor in a pit with 400 sweaty guys that would you know that that would lean on you spit on you not intentionally screaming your ear. Tell the same story over and over 40,000 times bitch about every single thing that's going on in the world that affected them. Tell you about every losing trade they ever made. You couldn't hurt me like like I got to the point where I'm able to block out virtually all the noise because at at some point the only way you can be a successful floor trader back in the day. Was you had to own you were able to kind of",
    "start_timestamp_seconds": 1263.76,
    "end_timestamp_seconds": 1369.76,
    "start_timestamp": "21:03",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1263",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "couldn't hurt me like like I got to the point where I'm able to block out virtually all the noise because at at some point the only way you can be a successful floor trader back in the day. Was you had to own you were able to kind of not listen to everything that was being said around you, but you could pay attention to like where the order flow is coming where brokers were screaming. I really carried over the fast decision making and the ability to block out all the negative noise, you know, all the people bitching at you, you know, and you have to think about this on the trading floor, it's just. Everybody wanted to steal every single thing that you had they didn't care if you walked out of that pit naked and broke every single day and I did it for 20 years. And so you get to the point where you're like the guy standing next to me is one of my best friends and yet he'll take every dime I have if you could. That at at some point. I learned how how the world operates and I was I'm very comfortable in that environment. I don't care about you know, you know, how they tell us tell athletes don't read don't read your press clippings like don't read with people write about you well in the world of social media. I don't read what people write about me good",
    "start_timestamp_seconds": 1353.76,
    "end_timestamp_seconds": 1444.76,
    "start_timestamp": "22:33",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1353",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "very comfortable in that environment. I don't care about you know, you know, how they tell us tell athletes don't read don't read your press clippings like don't read with people write about you well in the world of social media. I don't read what people write about me good or bad, but I know that it's I know it's 98% good and the people that is bad you know whatever that's who care I don't care. And it'll don't matter to me, I don't give up shit about them at all. I care about all the people that care about me and don't care about the people that don't and I think it's just a numbers game. I mean, you're if you can get think about if you were politician and you had a 98% approval ready they consider you the greatest politician of all time. I mean, I'm an entrepreneur a very public entrepreneur with probably a 95 or 98% approval ready. I'm pretty happy with that. I don't think there's anybody else in the world that gets that so. So I have nothing to be ashamed of or nothing to be sad about. I mean, there are plenty of people over the years that have written me to say things like you suck. I hope I'll be die, you know, like all this stuff, but it doesn't it doesn't even remotely affects me and there's other people that go, you know, your broker stinks you guys are",
    "start_timestamp_seconds": 1422.76,
    "end_timestamp_seconds": 1504.76,
    "start_timestamp": "23:42",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1422",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "plenty of people over the years that have written me to say things like you suck. I hope I'll be die, you know, like all this stuff, but it doesn't it doesn't even remotely affects me and there's other people that go, you know, your broker stinks you guys are the worst, you know. I didn't get a response and my answer is always the same. I go, a name me one other CEO of a online broker church just name me one. You can't even name one and if you could name one, go right them in email and see if you get a response. Okay, and then right back to be in a apologize and say, hey, I'm so sorry because I will write to you. And you won't believe how many times people have written back and said, okay, you win, you're right. Nobody else will ever write back to me and I take it back because I at that point, you know, at some point if you stay really negative will just fire you. You know, you can't be our customer. We have a right not to serve, but but we we rarely rarely do that. That's pretty awesome and it's it reminds me a while back when you were explaining some of your email habits which seems insane, but the fact, yes, the fact that you are so passionate about communicating with customers, but then industry, it's a little bit different where you're kind of",
    "start_timestamp_seconds": 1496.76,
    "end_timestamp_seconds": 1566.76,
    "start_timestamp": "24:56",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1496",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "That's pretty awesome and it's it reminds me a while back when you were explaining some of your email habits which seems insane, but the fact, yes, the fact that you are so passionate about communicating with customers, but then industry, it's a little bit different where you're kind of like you have whatever. I'm really care. Well, you know, it's funny. I still I have no tolerance for people that don't respond and they tell me they're too busy like, like, you know, somebody like a CEO or something that doesn't respond to me. I wrote an email the other day to a CEO, I'm not going to tell you. But because we were having conversation, and he took him a week to get back to me a week. And I know him. So I, you know, a week later he wrote back to me and I said, I thought you ghosted me, that piss me off and he goes, because I didn't ghost you. I was just I was so busy. I didn't have a chance. I go, you didn't have a chance to what? Tell me you're busy, so you get back to me in a couple days. Like, like in the trading world, I can understand some other world, but in the trading world, if you don't get back instantaneously, you're not worthy. You are not, I will not accept that. Like, if you work for me, I can tell you this right now. If you",
    "start_timestamp_seconds": 1566.76,
    "end_timestamp_seconds": 1635.76,
    "start_timestamp": "26:06",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1566",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "days. Like, like in the trading world, I can understand some other world, but in the trading world, if you don't get back instantaneously, you're not worthy. You are not, I will not accept that. Like, if you work for me, I can tell you this right now. If you send me an email, and it gets intercepted by like, you know, Brittany, who's my assistant works for me. If you don't get back in 30 seconds of shot. Just tell me, have you ever waited more than a minute for her to get back? She's quick. She's super quick. I'm telling you a minute, if you're a toss. There's no excuse. I don't care where she is in the world. She'll be back to you in 30 seconds to a minute. Okay, that's how we operate. I'm the same way with customers. But I'm in box zero. So if I have to stay up to four in the morning, I'm going to respond to every single customer. And they're like, what the hell is wrong with you? And I'm like, this is why I am. Okay, that's why we're successful. It doesn't. I don't only respond to CEOs. I respond to customers that don't even have a count with us. I don't even check. I don't care. I'll tell you. I'll respond. Awesome. So pivoting now to your next thing. Obviously, we, well, I guess most people probably had a sneaking suspicion that when it was time for you",
    "start_timestamp_seconds": 1621.76,
    "end_timestamp_seconds": 1700.76,
    "start_timestamp": "27:01",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1621",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "respond to customers that don't even have a count with us. I don't even check. I don't care. I'll tell you. I'll respond. Awesome. So pivoting now to your next thing. Obviously, we, well, I guess most people probably had a sneaking suspicion that when it was time for you to make your exit that there would be something. I as soon as I saw that message come out, I immediately said to myself, there will be something very soon I bet. And as, as it were there was and there's this thing lost dog one lucky dog. This seems like actually a pretty significant departure from the last 40 years because very March market centric. This takes a look at some of these issues that you're passionate about. It applies a lot of what you've learned over the last 40 years, but in a new realm. Can you tell us about it? Well, part of it is that I do have a lot of restrictions on let's put it this way. I'm probably not going to start another brokerage. Anybody that, you know, would do anything with me at some point, try to make sure that I don't build another brokerage firm, which is totally fine. I'm cool with that. But I, you're right. I'm. There's nobody that's surprised. Like, you know, my wife said to me, she's like, she's like, I'm excited that we're going to be able to travel now and don't have to, you know, like,",
    "start_timestamp_seconds": 1689.76,
    "end_timestamp_seconds": 1781.76,
    "start_timestamp": "28:09",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1689",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "another brokerage firm, which is totally fine. I'm cool with that. But I, you're right. I'm. There's nobody that's surprised. Like, you know, my wife said to me, she's like, she's like, I'm excited that we're going to be able to travel now and don't have to, you know, like, you do all this stuff. Oh, well. She goes, but in the back of my head, I've got this idea that I got this thought that you're probably going to start another business tomorrow, right? And I go, well, we've kind of already started and yeah, yeah, I'm not even she goes, are you taking a day off? I go, no, started left one day, started the next day. She's like, I'm actually not surprised at all. So, you know, good luck. I didn't even ask you what I was doing. Didn't even say, hey, what are you doing? I'm like, she's like, I never understood what they're doing anyway. So, and you probably don't even know, but you'll figure it out. So, I've had this idea for a long time. And we've actually been investor, I invested in some people, some ideas, a while back to start to build out kind of the foundation for this, but I didn't take it over until I left tasty two weeks ago or whatever it was, two, three weeks ago. And Scott and I actually both left and we both took this over again, as our roles are, well, coach CEOs right",
    "start_timestamp_seconds": 1765.76,
    "end_timestamp_seconds": 1850.76,
    "start_timestamp": "29:25",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1765",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "out kind of the foundation for this, but I didn't take it over until I left tasty two weeks ago or whatever it was, two, three weeks ago. And Scott and I actually both left and we both took this over again, as our roles are, well, coach CEOs right now. And the company is called Lost All. Lost All is a play on a poster I saw once when I was doing a live show about a stray cat called Lost Cat. And so, I decided, I've always loved it. I tried to buy it from the artist. He wouldn't sell it to me, but he sold me like a copy of it. And so, I had it hanging up in my coffee shop, which I'm promoting here today, because I'm the only person that loses money on every cup of coffee that we sell. But we built some really cool facilities in Chicago. Everybody knows where Chicago-based company, we love this city, and we want to support this city. And this time we built our 50 or 506 business in Chicago and our build out. And this time it's in kind of near rig leave. Just outside of Ridleyville, in a really cool industrial neighborhood. And we built an amazing set to do a streaming show called One Lucky Dog, which is going to start November 10. Going to be every day, part of it's going to be live, part of it's going to be produced. It is",
    "start_timestamp_seconds": 1834.76,
    "end_timestamp_seconds": 1944.76,
    "start_timestamp": "30:34",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1834",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "Ridleyville, in a really cool industrial neighborhood. And we built an amazing set to do a streaming show called One Lucky Dog, which is going to start November 10. Going to be every day, part of it's going to be live, part of it's going to be produced. It is going to talk about business and Scott and I and a woman that we've been friends with for about 30 years. So used to work for us for 20 of those years. Name Saul, she is going to also help us co-host and we are going to talk about how to build success. And what that means and how to differentiate yourself and how to make yourself, how to give you context to make yourself more valuable. Here's the basic premise, Eric, basic premise. Over the course of your lifetime and virtually everybody else. There is a number that you are underpaid or that you leave on the table because you don't know what you're worth. We figured out that over 40 year period, the average is between two and three million dollars. And we've got to do it with the way that you leave on, which is compounded at just risk free rates. This has nothing to do with that week, just risk free rates that most people virtually everyone leaves on the table. And the way to narrow the wealth gap in this country, the way to bring true work or fairness is not through subsidies or supported",
    "start_timestamp_seconds": 1920.76,
    "end_timestamp_seconds": 2016.76,
    "start_timestamp": "32:00",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=1920",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "just risk free rates. This has nothing to do with that week, just risk free rates that most people virtually everyone leaves on the table. And the way to narrow the wealth gap in this country, the way to bring true work or fairness is not through subsidies or supported programs or things like that. You can't regulate it in. The way to do it is to educate. The way to do it is through know how. The way to do it is to close the gap by letting people know what their worth. It's happened in sports. Through agents and everybody else, but it's never happened in the real workforce. Nobody knows really, I mean, if you get a job for $100,000, you don't know if that job should be 110 or should be 120 or should be 90. You have no idea the companies make it up. Like even a tasty when somebody comes in for a job, we always go, I don't know. Will you take this? You don't know. So every firm is the same way. You just don't know what the, you know, you kind of have an idea of what the range is. But nobody really has the statistics. So what we're trying to do is to build a streaming network that will help people to understand. What success means? The reason we were successful talking about trading was because we were successful traders. Period. Done it for 40 years. Fall we've ever done.",
    "start_timestamp_seconds": 2004.76,
    "end_timestamp_seconds": 2099.76,
    "start_timestamp": "33:24",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2004",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "nobody really has the statistics. So what we're trying to do is to build a streaming network that will help people to understand. What success means? The reason we were successful talking about trading was because we were successful traders. Period. Done it for 40 years. Fall we've ever done. Well, we're also been successful business people. I sold two companies for $1 billion. We've sold. We just sold the exchange. We built for a hundred million. I mean, I just mentored somebody who's who's about to put up a huge number for the firm that they built. We have been very successful. It just luck is lucky is how. But we've done it. So I think we have the credibility and the integrity and the validation to talk to people about success. It's one thing when somebody gets up on a stage and says, I'm going to make you successful, but they've never done shit in their life. And we have actually practice what we've reached. We've built multiple companies. We've sold them for hundreds of millions and billions of dollars. And it's all real. Because it's not if it's it's all real. And we want to share this with everybody. It's goodwill. That's what one lucky dog is. That's starting November 10. But you have to have something behind you. You have to have a revenue model. You have to build something where there's. There's a business. And the business that we built is a platform that actually.",
    "start_timestamp_seconds": 2076.76,
    "end_timestamp_seconds": 2175.76,
    "start_timestamp": "34:36",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2076",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "with everybody. It's goodwill. That's what one lucky dog is. That's starting November 10. But you have to have something behind you. You have to have a revenue model. You have to build something where there's. There's a business. And the business that we built is a platform that actually. Tells you what's your worth. So every person can go on. You could upload your resume. You could fill it in by hand, whatever you want to do. And we will show you what the industry averages for that job. What your worth based on all the. It's a massive AI platform based on everything that's. Pumped in there all government statistics and everything. And then we'll show you. What you should strive for. And then we'll show you what difference that makes between. Over the course of your lifetime. And then we'll update you every two weeks. And give you an idea of how you're doing. And then we built a. Real time data feed. For jobs. So instead of stock quotes. It's job quotes and it moved. It takes real time. It's super cool. Never been built before. And on top of that. We'll give you all the analytics. To make you more valuable. The more information you give us, the more information you give you. Makes you more valuable. It's a subscription based model. It's cheap. It's a hundred dollars a year. It's nothing. And for what it does, there's nothing like it in the world. But",
    "start_timestamp_seconds": 2158.76,
    "end_timestamp_seconds": 2255.76,
    "start_timestamp": "35:58",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2158",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "analytics. To make you more valuable. The more information you give us, the more information you give you. Makes you more valuable. It's a subscription based model. It's cheap. It's a hundred dollars a year. It's nothing. And for what it does, there's nothing like it in the world. But it doesn't end there. On top of all that. We're building a digital ecosystem that will allow people. To purchase a stable coin. To get. Um, a. I don't want to give away the whole thing. But to get a book. And what we're building. And also to be able to do. Different kinds of tokenized investments over time. It's a really interesting ecosystem because we want people to be able to. To take this new found wealth or this and to. Invest in something that has an equity stake because we believe that equity compounds way faster than risk free rates. I mean, it's proven a thousand times over. So we want people to learn how to. Make themselves more valuable. And then we make yourself more valuable. Add to that with some long term equity commitments. And do it through a new age of tokenization and globalization. It's an ambitious project. But it's a very broad reach. And I can draw out a much wider net. I can get to all these people I've never gotten to before. And I can introduce them to who we are to what we do to kind of, you know, people like",
    "start_timestamp_seconds": 2238.76,
    "end_timestamp_seconds": 2331.76,
    "start_timestamp": "37:18",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2238",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "an ambitious project. But it's a very broad reach. And I can draw out a much wider net. I can get to all these people I've never gotten to before. And I can introduce them to who we are to what we do to kind of, you know, people like the way we. To communicate and make very complex things simple. And I think that that's what our strength is. And we're going to take that forward. Fascinating. There's a lot there. There is. There is. I have a couple key questions. The first one that jumps to mind though is how the fuck did you come up with this. I'm not. Okay. I love building style. And this is my own. You know, I mean, I'm still partners with Scott, but Scott is a great part of it. I have because he's he's he's an ex he executes. Right. You know, like like he's operational. He executes. I'm always tasked with the vision and the and kind of the vision and and the ideas. The creativity of it all. And then we like to surround ourselves with really smart developers. AI experts, clients. And we just start building it and see what happens. And that's what we've been doing. We've been doing it for a while now. We're super excited. We're bootstrapping. We haven't raised anybody. We don't need to right now. We will at some point down the road. And it's we want to get our we want",
    "start_timestamp_seconds": 2320.76,
    "end_timestamp_seconds": 2421.76,
    "start_timestamp": "38:40",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2320",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "and see what happens. And that's what we've been doing. We've been doing it for a while now. We're super excited. We're bootstrapping. We haven't raised anybody. We don't need to right now. We will at some point down the road. And it's we want to get our we want to get all our viewers fans. We want to get everybody involved. Want to make an offer that nobody can refuse. Because we we'd like to share we're generous. And it's important to us. So we're going to build something that's never been built before. And we're going to tackle a social issue that's I don't think anybody's ever effectively tackled. Next question. I've always been genuinely interested in the economics of this and this is at least part of what you're you're addressing here. It's hard for me sometimes to understand. I definitely believe in capitalism and things that do well should continue to grow and things like that. But one of the things I genuinely do question and struggle with a little bit is like when you see some CEOs that are getting. You know, tens of millions sure and then you you have like some base level employees understanding not every employee is contributing to the same amount. But it just seems like a hell of a disparity at points between like the physical doors of most businesses versus the people that you will good job, you know, it may not be climb to the top. And",
    "start_timestamp_seconds": 2405.76,
    "end_timestamp_seconds": 2502.76,
    "start_timestamp": "40:05",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2405",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "employees understanding not every employee is contributing to the same amount. But it just seems like a hell of a disparity at points between like the physical doors of most businesses versus the people that you will good job, you know, it may not be climb to the top. And that paradigm like entered your brain. I imagine in some way it must have but oh my god so one of things that that one of things that we plan to do is share some or equity with our viewers. The other thing that we're going to make really clear is that Scott and I won't take a dime. Because one of the things that pisses us off the most is when somebody like you know like the CEO of city group gets $300 million to CEO of Goldman Sachs gets $300 million. And the lowest paid employee gets $65,000. You know, and those numbers the multiples are insane insane. We don't like business that's not a business to me. There's certain things that there's so many things that are wrong. There's nothing wrong with free markets. I'm sorry, but no CEO is worth $300 million. I know the CEOs most of them, they're not worth $3, let alone $300 million. And you know you get in situations where like you know Elon Musk has got to pay back it for a trillion dollars. If he does something right, you know whatever he's got a crazy numbers but a trillion",
    "start_timestamp_seconds": 2477.76,
    "end_timestamp_seconds": 2579.76,
    "start_timestamp": "41:17",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2477",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "most of them, they're not worth $3, let alone $300 million. And you know you get in situations where like you know Elon Musk has got to pay back it for a trillion dollars. If he does something right, you know whatever he's got a crazy numbers but a trillion dollars. We've gotten we've gotten stupid with this stuff. You know like the average CEO made what like I mean of a major company made what 16 to 20 million dollars last year. I mean numbers are insane insane. And I'm telling you that my own experience with all these CEOs in my entire lifetime of dealing with all these public companies. I had met two CEOs, two that I would hire. This is out of hundreds. I've met two. These people were paid hundreds of millions of dollars. I had met two that I would hire. So it's complete garbage. So what Scott and I are saying is we're going to build lost dog. We're not taking a dime. Now we're lucky we're in a position we don't have to. We're not taking a dime. So the employees, whatever everybody gets everything else. We're not taking anything. That's number one. You have to lead by example. And we are. So that's one of the ways that we're addressing this is saying, you know what? We're going to build this amazing company. We're going to talk about you know. Well, it will equality and narrowing the wealth gap. But we're",
    "start_timestamp_seconds": 2565.76,
    "end_timestamp_seconds": 2657.76,
    "start_timestamp": "42:45",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2565",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "one. You have to lead by example. And we are. So that's one of the ways that we're addressing this is saying, you know what? We're going to build this amazing company. We're going to talk about you know. Well, it will equality and narrowing the wealth gap. But we're not going to take any money. So nobody can ever say, you know, hey. Right. You guys are part of the business. You do a rich yourself. No we did. You know, if in the end the companies were some money, right. The investors will, the investors will, you know, you take a lot of risk. I'm when you build a startup and you deserve to be rewarded if you're successful. But in the intro, we're not taking a dime. And super classical. That's how we're addressing that issue. But that issue is a big part of what this shows about. Interesting. That's awesome. Yeah. I'm really stoked on that. I spent some time at Deloitte as a consultant. And some of the projects that I worked on, a effective, who were around this kind of idea for a business. Like, what is the lowest we can possibly pay people that are coming in? And that always felt weird because they're paying us a ridiculous amount of money for what we do. And yet I'm sitting here like advising them on how to create this pay package where if they include a flexible Friday, they can decrease their annual pay",
    "start_timestamp_seconds": 2637.76,
    "end_timestamp_seconds": 2715.76,
    "start_timestamp": "43:57",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2637",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "that are coming in? And that always felt weird because they're paying us a ridiculous amount of money for what we do. And yet I'm sitting here like advising them on how to create this pay package where if they include a flexible Friday, they can decrease their annual pay by this month. It's insane. And so the same time they don't say that same thing. How what's the cheapest we get to see you for? Like, they don't say that. Interesting in it. Yeah. Two two other quick questions. When you envision the company, I imagine you had to have thought of something like Glass Door, which has pieces of this, where it shows really. Because like Glass Door will show like the average salary for like a specific title at a specific company like that kind of stuff. And it seems like you guys took that a step further or just even without a diagnostic of that. And you're approaching the problem from a W-2 perspective, which is interesting to me. I always envision you as like the entrepreneur guy. And I actually thought what your next move is going to be is more focused on like business business startups and stuff. Talk to me about this. There's a lot of focus on differentiating yourself through business startups and all that kind of stuff. Got it. But the majority of people don't work for business. I mean, the majority of the people are not doing business startups and",
    "start_timestamp_seconds": 2703.76,
    "end_timestamp_seconds": 2796.76,
    "start_timestamp": "45:03",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2703",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "business startups and stuff. Talk to me about this. There's a lot of focus on differentiating yourself through business startups and all that kind of stuff. Got it. But the majority of people don't work for business. I mean, the majority of the people are not doing business startups and I want to appeal. If you're just appealing to business startups, you're audiences limited. I want, I want to help every, I want to have the opportunity to get in front of everybody. Got it. Yeah, it makes complete sense that the thing I find super cool about this to is that that group of people, realistically speaking, is the one that kind of needs it the most. Because a lot of those people are the ones that end up with not necessarily golden handcuffs, maybe like rusted handcuffs that, you know, like everything's like just good enough. And that's how most of them end up living most of their lives. So I can actually see like a really cool potential impact from this. If you were to think about like the broad industry impact of something like this, what do you think that this will do to like ironing to interview process. What do you think there? I think that I think giving people context is the most powerful thing you can do. And I don't think it's been done before. You know, looking at a range of salary on glass or it doesn't mean anything to me. But",
    "start_timestamp_seconds": 2778.76,
    "end_timestamp_seconds": 2875.76,
    "start_timestamp": "46:18",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2778",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "to interview process. What do you think there? I think that I think giving people context is the most powerful thing you can do. And I don't think it's been done before. You know, looking at a range of salary on glass or it doesn't mean anything to me. But having somebody break down my resume with respect to what I'm going for it. It gives me lots of very. It gives me so much quantitative information that I can use. That it does help in the negotiation process when some kid comes in remember. I think over the last 25 years we've hired. Let's just say a thousand people. Probably more, but I mean, Tacey has 330 people right now and think or so I'm had 550. So that's without even any turnover. It's like 900. So it's well over a thousand. And a lot of times, you know, what we pay people and what they ask for and all this kind of stuff is it's. What's taken into consideration is not necessarily the real market. You know, like you make a judgment based on who the person like what their experiences. You make a judgment based on what you can afford to pay not necessarily what the market will. You know, not necessarily what the market is. You make a judgment based on how bad does that person need that job or are they willing to take less. You know, like there's a lot of factors. Very few",
    "start_timestamp_seconds": 2838.76,
    "end_timestamp_seconds": 2961.76,
    "start_timestamp": "47:18",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2838",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "you can afford to pay not necessarily what the market will. You know, not necessarily what the market is. You make a judgment based on how bad does that person need that job or are they willing to take less. You know, like there's a lot of factors. Very few people get some people get more than their worth. Very few people get what they're worth. And I think just having some numbers in here, I'll make it easier. Before you go into buy a used car or a car, you might go to Kelli Blue Book and you might take a, you know, you might just download a page of the car that you want to buy and you'll have a pretty good idea of what the price of the special use car. But I'm, you know, in real estate, they do it with cops. You have a pretty good idea what the cops are to this neighborhood. In jobs, you don't have any of that. There's none of that. What we're doing is we're giving you that information to help you. It doesn't mean you're going to be able to use it. Some places will go say, hey, screw that. You know, that's what that's what they say, but that's not the real market. I understand that. But that's what Zill did. But there's way more than that than just being Zill or Kelli Blue Book. I want to empower you through the content that we create, through",
    "start_timestamp_seconds": 2942.76,
    "end_timestamp_seconds": 3019.76,
    "start_timestamp": "49:02",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=2942",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "screw that. You know, that's what that's what they say, but that's not the real market. I understand that. But that's what Zill did. But there's way more than that than just being Zill or Kelli Blue Book. I want to empower you through the content that we create, through the analytics that we build, through the AI tools and the mechanisms that we built. Because it's, they're so different. They're so purposeful. And, you know, giving you information, it can not hurt you. It can only make you more valuable. I mean, for $10 a month or $100 a year, if I can get you a few extra $1,000 or a few million dollars of your lifetime, who wouldn't do that. Right. Yeah. No, it's awesome. It also gives you, we're going to give you a live quote, students. You can see what jobs are in other cities. You can see what it's worth. You can see you can make decisions for yourself. Hey, you know, you're entitled to that. You can go get the best market for yourself. I think one of the coolest things about this that strikes me is it starts to break away that whole taboo that company has been so successful in, which is making it really awkward and weird to talk about what you make at a place. So then nobody ever knows what anybody else makes and it creates this really difficult negotiation landscape where you can have these insane gaps between",
    "start_timestamp_seconds": 3005.76,
    "end_timestamp_seconds": 3088.76,
    "start_timestamp": "50:05",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3005",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "taboo that company has been so successful in, which is making it really awkward and weird to talk about what you make at a place. So then nobody ever knows what anybody else makes and it creates this really difficult negotiation landscape where you can have these insane gaps between people. What's funny about that is we've talked about this a lot. What's funny is that my generation boomers. Nobody ever talks about, which you make. It's not it's totally taboo. Nobody talks about it. But the current generation, 20, five years, they all talk. They all talk about everything. They all talk. They put their pace stops up there. So they're much more open about it. It's kind of a LinkedIn mentality. It's, you know, it's, it is a slightly different mentality. I'm not going to try to break any of that up. I just want to like, I think that there are certain sites out. I'm not interested in finding people jobs because that's outside of training interest level. But there are like, if you go to LinkedIn and stuff like that, there's these are massive sites with a billion people, right? But I'm not sure they give you information, but they don't give you know how. And I feel like know how is 40 years of, you know, what we've learned. Like you could say, I could say, make the same argument for trading. You know, everybody gives you information, fundamental, technical analysis, all the other crap.",
    "start_timestamp_seconds": 3072.76,
    "end_timestamp_seconds": 3169.76,
    "start_timestamp": "51:12",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3072",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "you information, but they don't give you know how. And I feel like know how is 40 years of, you know, what we've learned. Like you could say, I could say, make the same argument for trading. You know, everybody gives you information, fundamental, technical analysis, all the other crap. But until we came along and started talking about trading, no, he's ever given you actual trading information. We changed the whole industry and it exploded based on the information we gave about trading. And the know how we put out there. It never existed before. What if you do the same thing for jobs? Like, I don't know if, I don't know if I've got that in me. Like, I don't know if I can pull it off. But, you know, like, it's going to be fun. We're going to die trying to be fun. You know, Scott, and I have a good time with this. If it's successful, we'll bring a lot more people. We'll have a lot more fun. We have a super cool set in Chicago. If you ever get Chicago, show it. It's really cool. We have a giant stage. We built out a super cool set. It's going to be a really amazing, you know, network. It's going to be fun. Is this the same neighborhood where you're showing your wife, your new pad, and then there was the store that was getting robbed or is this in a different location. Okay. This is",
    "start_timestamp_seconds": 3153.76,
    "end_timestamp_seconds": 3240.76,
    "start_timestamp": "52:33",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3153",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "cool set. It's going to be a really amazing, you know, network. It's going to be fun. Is this the same neighborhood where you're showing your wife, your new pad, and then there was the store that was getting robbed or is this in a different location. Okay. This is a different neighborhood. That's that's important. Or were there at least squatters in there when you came in? No. Those squatters either. Man, you really big departure. We're all big at warehouse, and we just got it and built up everything. We've been working a couple of years. But you lose the brain. You turn a new leaf. I thought for sure that there would be some artifacts of your old purchases in there. Now, oh, there's if you come to our coffee shop, there's there's a little tribute on the wall to all the businesses that we built. We have some fun. That's just, you know, that's just, you know what, we move on. You just got to like, I walk out the door and then I start next thing right away. It's cool. I mean, I've said this to you before, and I know it's uncomfortable for you, but I always have to say it. You do inspire a lot of people, and it's super cool what you do. So, that end. Okay, but brief. Say thank you there. Now, folks, they can sign up for your wait list on lawstog.com. And then you're going live on 10",
    "start_timestamp_seconds": 3223.76,
    "end_timestamp_seconds": 3306.76,
    "start_timestamp": "53:43",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3223",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "but I always have to say it. You do inspire a lot of people, and it's super cool what you do. So, that end. Okay, but brief. Say thank you there. Now, folks, they can sign up for your wait list on lawstog.com. And then you're going live on 10 November with one lucky dog. That's just the network, the software, what you're signing up for is actually one lucky dog's free. And you can watch them. You're over on our site, whatever. Got it. But when we go, when we go live with the software, it'll be late November. That's something everything comes out right. It'll be late November. And then you'll get a bunch of emails before that. Got it. Yeah. Thanks to all that stuff in there, there's just one final question. Obviously, the berets gone, but does that mean that you're not trading anymore or how. I'll tell you right now. Absolutely not. Thank you. I made 77 trades. Slow day. Slow day. Yes, so no, I'm absolutely trading. I think 77 trades today. I was all over the place. I've been short goal for a while. I finally went down today. So and same with silver. That was, that's been a painful ride. But finally, we got paid today and golden silver. Gold down to 20 and silver down 320. But. Now I just need the market to sell off a little bit. So we've got to get paid there. Is we're a little bit",
    "start_timestamp_seconds": 3288.76,
    "end_timestamp_seconds": 3385.76,
    "start_timestamp": "54:48",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3288",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 3420.0
  },
  {
    "video_id": "OXdM2BxOE5s",
    "title": "Why Tom Sosnoff Left tastylive & What’s Coming Next | The Outlier Podcast",
    "text": "silver. That was, that's been a painful ride. But finally, we got paid today and golden silver. Gold down to 20 and silver down 320. But. Now I just need the market to sell off a little bit. So we've got to get paid there. Is we're a little bit short. The S and P's and NASDAQ. So we'll see what happens. We'll see it. It all lines up for you. Always. I'm going to stop trading by the way. That's what I do. I love it. Never second. That was more of a tongue in cheat kind of thing because it's been pretty clear that like you if there is an addiction you do have it and. Yeah, yeah, I don't think there's a rehab for this one. So you're you're kind of locked in. Yeah, but always awesome hanging out Tom. Thanks for chatting and looking forward to seeing the next next update. Talk to you soon. Yeah.",
    "start_timestamp_seconds": 3367.76,
    "end_timestamp_seconds": 3418.76,
    "start_timestamp": "56:07",
    "video_url": "https://www.youtube.com/watch?v=OXdM2BxOE5s",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=OXdM2BxOE5s&t=3367",
    "chunk_index": 46,
    "word_count": 160,
    "upload_date": null,
    "duration": 3420.0
  }
]