[
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 9,
    "text": "Hey everyone, Eric here, hopping on to do a very quick small stack segment, made a few adjustments today, and I'm trying to do my best to keep the videos in terms of the adjustments a little bit more real time based on some feedback I got. And it's it's good feedback. So the idea is to try to make sure that I'm sharing regular updates with specific information for the trade so that it's easier for folks to follow. So today I ended up making a handful of adjustments. So let's jump over to the screen and take a look. The first one is I exited out of XLF today and what I ended up doing is closing the trade out for a little over 50 max profit. I had the 22 and a half puts I sold those for 54 cents and I closed it today for 24 cents. So essentially just moving money around there taking in money when I see it. And I offered exposure in XLE. So let's take a look real quick at the two trades XLF is you could tell just made a small move up. So for me that was just a pretty simple profit management in that scenario. I like to manage at about 55 max profit. And in general, if I see 30 plus 30 plus percent profit in the first week, I tend to take a look at the trade as well. Now what I will save for the",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=0"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 9,
    "text": "pretty simple profit management in that scenario. I like to manage at about 55 max profit. And in general, if I see 30 plus 30 plus percent profit in the first week, I tend to take a look at the trade as well. Now what I will save for the small stack segment because I am so limited in products. There was a very key step that I take and that is before I exited XLF. I have found a suitable replacement trade so that I can move my money from XLF into a different trade that satisfied my requirements. Because if we go back over to the whiteboard here, if I closed it at 24 cents, I still had 24 to make on that trade again. It doesn't sound like a lot in terms of dollar amount, but for this portfolio, it's that's not a negligible amount of money. So in order for me to find to put on another trade and close out of this trade, I needed to find something that was going to pay me more than that 24 cents in something that I liked. So I like to look at that before I exit the trade to make sure there's a suitable replacement. So Q XLE. In there, I ended up selling one of the 30 October 29 puts and I collected 72 cents. So in general, I think energy is getting beat down and I think that it's in definitely a pretty rough spot.",
    "start_timestamp_seconds": 79.0,
    "start_timestamp": "00:01:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=79"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 9,
    "text": "trade to make sure there's a suitable replacement. So Q XLE. In there, I ended up selling one of the 30 October 29 puts and I collected 72 cents. So in general, I think energy is getting beat down and I think that it's in definitely a pretty rough spot. I do not feel very bullish about the product, but this is the kind of thing that I would very, very happily turn into a coverage strangle and hold on to it for some time. The reason being is if we kind of zoom this out a little bit and we look at something like a three year, we're getting near all time lows where the low is 23. And if I get held up at 29, I would be pretty far away from that. I would have to buy more to cost average in a bit. But nonetheless, it still is definitely at the lower end of that range. This is not a product I'm looking to hold on to long term. What I'm doing is just capitalizing on the price. So getting 72 cents on that option is kind of a big deal. One, because it's a really good return. It's over, you know, 2 return on the money for a 30 day trade, which is obviously healthy. So the other thing is that if I end up being assigned this pays over slightly higher than a 7 dividend. So it's something that would be reasonable to maintain",
    "start_timestamp_seconds": 149.0,
    "start_timestamp": "00:02:29",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=149"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 9,
    "text": "good return. It's over, you know, 2 return on the money for a 30 day trade, which is obviously healthy. So the other thing is that if I end up being assigned this pays over slightly higher than a 7 dividend. So it's something that would be reasonable to maintain a coverage strangle in ideally, we'll be able to soak up some of that credit and then move on much like we did with XLF. But we'll see what the market has if we'll kind of adjust as needed. So that is kind of what happened on the covered strangle front. And then if we jump over to the croaker diagonal, I still have that position on. And essentially what I did is take down the 23 October 35 puts. I sold those out for 62 cents and I took them down for 40 cents. So if you'll notice this is less than my 55 premium capture. This didn't hit any sort of 30 threshold in a certain amount of time. I was in the trade for. I don't think I have the calculation on here. I think I only do that for the for the leap. I might have to add that. But I wasn't in the trade for that. Oh, yeah, duh. I entered the train on 22 September. So I was in it for six days. Now, the reason for this adjustment is because if you'll notice, I again found a suitable replacement where I was collecting",
    "start_timestamp_seconds": 220.0,
    "start_timestamp": "00:03:40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=220"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 9,
    "text": "to add that. But I wasn't in the trade for that. Oh, yeah, duh. I entered the train on 22 September. So I was in it for six days. Now, the reason for this adjustment is because if you'll notice, I again found a suitable replacement where I was collecting more than this 40 cents. Most importantly, I started moving my strike up. So this is that should be the 35. Yes, so I just realized that's an error right here. This is this strike right here should be 35.5 not 35. And the reason why I made the move is to move my short strike up that 50 cents. It gives the trade a little more room to move. And I appreciate more capital gains. The other thing that you'll notice is that I only sold a one lot. I could easily sell a two lot if I wanted to and still have no upside risk. The reason why I'm not doing that is I'm waiting to see how price moves. If we start getting some sort of up move, I'll sell another call a bit above the basis so that I can collect more money up front. But not cap my upside. Now, if we start moving down, then I'll just stay with the one call. The reason why I do that is because I see more I see more premium in these options. So if the underlying makes a move up, I don't want to get stuck",
    "start_timestamp_seconds": 295.0,
    "start_timestamp": "00:04:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=295"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 9,
    "text": "not cap my upside. Now, if we start moving down, then I'll just stay with the one call. The reason why I do that is because I see more I see more premium in these options. So if the underlying makes a move up, I don't want to get stuck at just collecting that 52 cents. And if I did it for a two lot because if we take a look at the options here and we go out to six know if you look at something that's at the money or the money. Or even right out right out of the money, they're trading for 90 cents to 1. So I do not want to miss that potential premium by selling to upfront. I'm obviously comfortable holding this product for some time. So that's why I'm not prioritizing collecting additional capital up front. I'm giving more credence to the potential upside. And that's the trade off we make in this scenario. So in total, the total realized PNL in the account is 668. So we're still cruising above 11 closing in on 12. Credit outstanding as of right now is 124, which represents a 2.2 stake in the account. That's again, for me in my target, that's a really good return. I know I say it every single lesson because it's so important that in terms of a dollar amount, that doesn't mean much. It's fairly insignificant. What we're doing in this small stacks account is not trying to",
    "start_timestamp_seconds": 367.0,
    "start_timestamp": "00:06:07",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=367"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 9,
    "text": "That's again, for me in my target, that's a really good return. I know I say it every single lesson because it's so important that in terms of a dollar amount, that doesn't mean much. It's fairly insignificant. What we're doing in this small stacks account is not trying to develop our 5,000 into our future wealth. It's not going to happen. So what I'm doing in this account is taking a pragmatic approach, trading it as if I was starting over again. What I'm focusing on is refining and deploying a strategy that as the account grows, I can scale the strategy. And instead of making 2 on a 5,000 account, as the account grows, I save money, get promotions, do other business, sell a house, whatever. Instead of making that 2 on a 5,000 account, now we're making 2 on a 500,000 account, something like that as your money grows. So that's the focus. Right now we're building a skill set that we're refining and making sure that we have a good process down. I say it all the time because I think too many people think that they're going to grow this 5,000, 10,000, 50,000, even 100,000 into something that's going to be their future wealth. And I truly think it's a mistake. It's a big mistake. So anyways, the account right now is utilizing about 4,300, so that's 75 utilized. Means we have a little bit of cash left, but not much. And what I likely",
    "start_timestamp_seconds": 446.0,
    "start_timestamp": "00:07:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=446"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 9,
    "text": "into something that's going to be their future wealth. And I truly think it's a mistake. It's a big mistake. So anyways, the account right now is utilizing about 4,300, so that's 75 utilized. Means we have a little bit of cash left, but not much. And what I likely will do with the remaining capital is wait and see how both XLE and CROG are look. Typically I like to add room, save room for an additional put in something like XLE for the coverage strangle. So I probably won't here. If I get assigned, I'll just turn it into a covered call and ride that out. So ideally, I'll be looking at another strangle at some point. Before I do that, more likely than not, what I will do is wait until CROG has some sort of up move so that I can unwind one of the leaps that I have in CROG. Make sure that I have a good basis and free up a little bit more capital to gain exposure to another trade. I could easily have room right now with that remaining 700 to get into another diagonal. But I don't want to red line myself right now, especially as I've been talking about my margin account going into the election. I'm just no interest. So right now we're playing with a good amount of our capital, but we're not at 100 and we're not trading on margin. So that is all I got for",
    "start_timestamp_seconds": 522.0,
    "start_timestamp": "00:08:42",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=522"
  },
  {
    "video_id": "p5jeGg0pCl4",
    "title": "Trade Updates XLF, XLE, KR - Small Stacks Pt10",
    "url": "https://www.youtube.com/watch?v=p5jeGg0pCl4",
    "upload_date": "20200928",
    "duration": "PT10M46S",
    "channel_name": "Outlier Trading",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 9,
    "text": "myself right now, especially as I've been talking about my margin account going into the election. I'm just no interest. So right now we're playing with a good amount of our capital, but we're not at 100 and we're not trading on margin. So that is all I got for this right now. We'll see how the next few weeks shape up. I'm not expecting to make any adjustments at least for a week or two. So we'll see what happens if we get some sort of big move. I'll absolutely take trades down, but in general, this is pretty much set up to run on its own until we get closer to expiration. So if anybody's any questions is always dropping a line that we know and I will catch everybody later.",
    "start_timestamp_seconds": 602.0,
    "start_timestamp": "00:10:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=p5jeGg0pCl4&t=602"
  }
]