[
  {
    "text": "All right, everybody, Eric here with part two of my favorite strategy, which is the cash secure strangle. I already introduced it in a previous video, talked about kind of how I like to set it up, what I look for, those kinds of things. Now what I want to jump into next is how do we manage the trade? So let's jump over to the main screen here and work through it. Question foremost, if you recall, we kind of did a little bit of a management tree on how the trade works out. So let's do that again real quick just to recap. First, I'm going to sell to open a put of some sort. And then one of two things is going to happen. The put is either going to remain out of the money, in which case I'll close for a profit and then sell another put and continue to do this circle here. Now, the other scenario is we can end up in the money. If we end up in the money, there again is a branch of two possibilities. The first one is we can roll the trade and based on how we choose to roll the trade, it'll either end up out of the money or it'll end up in the money, which we will continue this process here. We can roll for some time. I've rolled for over a year before, so you can roll for some time. Or you can choose",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "to roll the trade, it'll either end up out of the money or it'll end up in the money, which we will continue this process here. We can roll for some time. I've rolled for over a year before, so you can roll for some time. Or you can choose to allow assignment. Now if we allow assignment, this essentially equals, we now have a long position. We own shares of whatever we sold to put on. So now there's another kind of two lane approach here. What will happen is we're going to create a covered call for the long shares. So this is where we're long shares and then we sell a call against the end. That's the shares. And then in this scenario, one of two things will happen. This will fall in, let's keep this side out of the money. Sorry, just to keep it the same. So this will fall out of the money. And if the calls remain out of the money, we just sell another one and then continue that loop here. Or the calls will fall in the money in which case will be assigned. And then we will lose the longs. So then what will happen is the call will fall off. We'll keep that profit. And then the long stock is sold. So we're going to sell the stock or sell the underlying at your strike price. Now let's go all the way back up here. We're also going to",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "So then what will happen is the call will fall off. We'll keep that profit. And then the long stock is sold. So we're going to sell the stock or sell the underlying at your strike price. Now let's go all the way back up here. We're also going to sell another put. And then this put here follows this put structure. These two is the same thing. So I'm just moving this one down here now in which case one of two things will happen out the money in the money and it just follows down this tree. So this is kind of our assignment tree or our management tree in an individual. So let's talk about the easy one. Let's first talk about this. I'm going to underline them so that they're kind of easier to see the different stages because I know the arrows might be a little confusing. So let's just break these out with those underlines. Great. Okay. So first, let's talk about this out of the money position here. This guy. If we are out of the money, the very first thing is if at any point in the trade, I have a 60 profit, I'm going to look to take it down. It doesn't mean I always will, but I'm going to look at it. I'm going to consider it very strongly. Now if I ever have a scenario where I've 80 of my max profit with greater than 50 days expiration on",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "profit, I'm going to look to take it down. It doesn't mean I always will, but I'm going to look at it. I'm going to consider it very strongly. Now if I ever have a scenario where I've 80 of my max profit with greater than 50 days expiration on the original trade left, I will take that down. So let's say if I sell something with 40 days to expiration and then at 21 days to expiration, we have 80 or higher max profit, I'm going to take that trade down. The other scenario that can happen here is if I make 30 to 40 of the trade in less than two days, I potentially will take that trade off. Now the way that I approach the out of the money management depends a lot on the current market conditions, how I feel about the market at that point in time. If I feel that the market is stable, kind of continuing to climb, that sort of thing, like we've seen the last few years, very likely would just leave a position on longer. But if we're more in a market that we see now, I'm less inclined to do that. I manage positions a little more regularly so I can continue to realize profits in lower my outstanding risk. So that's kind of the out of the money that handles this leg right here. Now let's talk about in the money. So this is this leg right here.",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "do that. I manage positions a little more regularly so I can continue to realize profits in lower my outstanding risk. So that's kind of the out of the money that handles this leg right here. Now let's talk about in the money. So this is this leg right here. And then what I want to specifically talk about is this rolling portion, which is this side right here. So we already did this out of the money. Now we're assuming we're in the money and I'm not going to take assignment. I want to roll. I always know that the best role opportunity is going to take place when the strike price equals my short strike. So if I sell a put at a 10 strike, when the stock or when the underlying is trading around 10 is my best time to roll. The reason being is because you can still typically roll out of the money at that point. But I have some rules on how I approach this person foremost, I always, always, always make sure I get a credit for the rule always. If you don't get a credit, you're going to make this a very difficult trade to manage for the long term. The second thing is I monitor the size of my trade because when we roll, we know we're closing the front position and we're establishing a further out and time position that should cover the cost of closing this front position. So",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "difficult trade to manage for the long term. The second thing is I monitor the size of my trade because when we roll, we know we're closing the front position and we're establishing a further out and time position that should cover the cost of closing this front position. So based on my assessment of the market, my current thoughts, I will look and adjust my size accordingly. For example, if I have a position that I put on with 40 days to expiration and with 35 days left to go, it falls in the money, I'm not going to do anything. The reason being is I like to wait until about 20 days to expiration so that market is closed. So that I'm able to maximize my use of weekly contracts and not have to roll out an entire month. I try to roll out as little in distance as possible, typically. So if my strike is slightly in the money and there's 20 days left to go, something like that, I likely will roll that out to reestablish a new position, you know, 40, 45 days to expiration. However, instead of selling a five lot, I might only sell a four lot, but keep it at the same strike. I might take some of my position off, removing some risk from the trade. Let's say same scenario, I sold a 48 expiration option, we're at 22 days left to go and all of a sudden my option is",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "sell a four lot, but keep it at the same strike. I might take some of my position off, removing some risk from the trade. Let's say same scenario, I sold a 48 expiration option, we're at 22 days left to go and all of a sudden my option is far in the money. If I roll out in time, I'm collecting a very small credit. In that scenario, I might add some of the allocation I set aside for the trade so that I can add additional short puts and allow myself to roll closer to the money. So in that example, let's say if I sold five puts at a 10 strike and I might have, I'm the new position I established might have six puts at a nine strike or an eight strike. The goal is to move closer or out of the money. So size can be adjusted to add risk or reduce risk depending on what the objectives are at that point in time. Now the duration for the rules, I hit on a little bit to start. If I am wary of the market and concerned that it might come down or if I feel there's it's bottom heavy like I do right now, I try to let it get as close to expiration as I can so that I'm leaching all of the theta out. So I'm not buying back a whole bunch of theta when I roll the position. And once I",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "feel there's it's bottom heavy like I do right now, I try to let it get as close to expiration as I can so that I'm leaching all of the theta out. So I'm not buying back a whole bunch of theta when I roll the position. And once I get, you know, 14, 15 days to expiration in a market like this, I am going to try to roll out in time as little as I need to in order to roll down as well. So if I want to roll out and down, I might have to go two weeks or three weeks instead of just one. If I am thinking that the, you know, position is on the dance floor, I'm close, I might just roll out to the same strike a week later. And then the last kind of broad scenario is if I want to roll and I want to make sure I get out of the money, I might have to go further out in time. I might have to reestablish a new position in order to collect a new credit, you know, all the way up 40 to 45 days to expiration, something like that. And again, I'm going to do a scenario for most of these because I know I'm talking about a lot of hypotheticals and it might be confusing. So don't worry if what I'm talking about sounds a little abstract. We'll do an example, not on this video, but",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "like that. And again, I'm going to do a scenario for most of these because I know I'm talking about a lot of hypotheticals and it might be confusing. So don't worry if what I'm talking about sounds a little abstract. We'll do an example, not on this video, but the next one. Okay, so let's jump over to kind of if we're going to allow assignment. This one's pretty quick. So once we get to the 20 day window, let's say again, we sold open five puts at the 10 strike and we're at the 20 day to expiration window, we choose we want to allow assignment. Great. We're going to let the underlying continued to move towards its expiration. Now the week of expiration or whenever I see the extrinsic value of the option hit a nickel, I'm always going to reevaluate one more time. I'm going to say, okay, do I really want to let this go to expiration and be assigned or do I want to potentially roll this now? So that's kind of my last evaluation. Let's say if it hits that point, let me say, nope, I want to own the underlying pool. Once we own the stock, I like to sell a covered call. So what that means is I will take assignment. I'm now a long shares and I will sell a call above my basis always. So if I'm assigned at 10, I'm always going to sell at 10 or above.",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "we own the stock, I like to sell a covered call. So what that means is I will take assignment. I'm now a long shares and I will sell a call above my basis always. So if I'm assigned at 10, I'm always going to sell at 10 or above. There may be times where I can't sell and collect a premium above my basis. That's fine. I will wait because if you go back all the way to the beginning, I already know I pick something I like to own, so I will wait. And then at the same time, I will always outlay an additional put below my strike. So if I'm at a short strike of 10, I might sell in 8 put or a 6 put or 5 or 7, whatever, something below my basis. So what this does is it allows me to scale into the trade, still collect a premium, and then if I'm assigned again, if I choose to allow assignment again, then in only then, my cost basis will reduce as my size increases. So if we sold that 5 lot and then now we're long 500 shares, and then if we sell a 3 lot cheaper, well, now we're going to be long 800 shares, but at a lower price. So that's why I like to sell the additional put. And then that's it. We're just going to repeat the put management until it's assigned again or more rolling or out",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "sell a 3 lot cheaper, well, now we're going to be long 800 shares, but at a lower price. So that's why I like to sell the additional put. And then that's it. We're just going to repeat the put management until it's assigned again or more rolling or out of the money, just like the original diagram I shared, or we're going to keep going until that covered call is called away. Whenever the covered call expires worthless or is very close to expiring worthless, I might take it down and sell another one and just keep doing that over and over again. So this is my favorite strategy, the cash secure strangle. It's nothing to manage. There's a lot of management that goes into it, but it's not frequent. You know, I might put a trade on that has 40 days to expiration and adjust it once every two weeks. So there's a lot of thought that goes into the management, but it makes the execution very easy and systematic. So the next video I'm going to do are a few different examples of either historical trades I've done or I'll share some of the trades I have on now so that we can see what this looks like in practical application. So I hope this is helpful and I'm looking forward to exploring the strategy more with everybody. Talk to you guys later.",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  },
  {
    "text": "on now so that we can see what this looks like in practical application. So I hope this is helpful and I'm looking forward to exploring the strategy more with everybody. Talk to you guys later.",
    "metadata": {
      "video_id": "pbtz6PHj39E",
      "title": "10b. Erik's Favorite Strategy - The Covered Strangle (CS) Pt2 | Options Strategies",
      "url": "https://www.youtube.com/watch?v=pbtz6PHj39E",
      "upload_date": "",
      "duration": 798.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=pbtz6PHj39E&t=0"
    }
  }
]