[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you especially with this game of tariffs, is tariffs take quite a long time in order to completely work through the plumbing, and they can have pretty significant impacts that are very different than the upfront incentive structures than you might think. So this is something to keep a really close eye on because I view a couple different very key ways to trade it. So there's the original news launch that has happened and we can trade that initial reaction, which is pretty standard that's going to happen. And then after that initial reaction, there's also going to be the actual trickle through effect of the tariff itself. That trickle through effect is important to understand how it works with the broader market plumbing because a lot of people will think like, oh, tariffs, that means that domestic production is gonna skyrocket in order to fill that gap. Well, the problem with domestic production filling that gap is that domestic production is way more expensive. That expensiveness is going to work through the entire system. So what that means is aggregate expenses, in this case, for everything that has to do with steel and aluminum is going to go up. So then you can logically forecast the impact of that on different industries like materials, come",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 50,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=0"
    }
  },
  {
    "text": "expensiveness is going to work through the entire system. So what that means is aggregate expenses, in this case, for everything that has to do with steel and aluminum is going to go up. So then you can logically forecast the impact of that on different industries like materials, come up with some ideas. You can also look at very basic ideas. Like who are the largest US users or who are not even US, who are the largest users of American based aluminum and steel? And let's take a look, I'll ask Chattchen B.T. right now. Who are the current largest users of US-sourced steel and aluminum that are publicly traded companies? Now, the reason why I filter it by publicly traded companies, not because that's the only way to find an impact, a lot of publicly traded companies interact with non publicly traded companies. So you can still find a trickle through effect. This is just an easier straight A to B connection that I can draw for you. So the automotive industry knows shock, right? The automotive industry knows shock, right? So things like four GM bowing planes, a lot of fucking metal, BA, construction, caterpillar, deer, John Deere, so CAT and DE packaging, like ball, BAL, manual, factoring and industrials, like GE, all of those are big consumers of US-sourced aluminum and steel. So that means we have to look at their businesses and how price sensitive their end consumers are. For example, airline industry, the",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 50,
      "start_timestamp": "00:14:33",
      "start_timestamp_seconds": 873.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=873"
    }
  },
  {
    "text": "John Deere, so CAT and DE packaging, like ball, BAL, manual, factoring and industrials, like GE, all of those are big consumers of US-sourced aluminum and steel. So that means we have to look at their businesses and how price sensitive their end consumers are. For example, airline industry, the government, not super price sensitive, we need fighter jets, we need commercial airlines to move people across the globe. So there will be cost passed through, but there's a little more resilience in the price sensitivity there. For things like automotive, there's a small cohort of people that are die hard fans of like an individual auto maker brand, but you would better believe. If all of a sudden Ford vehicles start spiking in price because of something like this, then all of a sudden, other alternatives start to look better like Toyota or other just manufacturers that aren't restricted to US-sourced steel and aluminum. Now, one other note, and this is a really useful general lesson for everybody. This is the original purpose of futures. So you better believe right now is everybody that interacts with steel and aluminum. Right now, they are in futures markets hedging their cost exposure. This means that this entire cost here, this 25 tariff is not a full pass through cost. And it's because most entities that interact with steel and aluminum that have some sort of investing slash risk management arm that deals with capital markets, which most of those players will",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 50,
      "start_timestamp": "00:15:55",
      "start_timestamp_seconds": 955.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=955"
    }
  },
  {
    "text": "exposure. This means that this entire cost here, this 25 tariff is not a full pass through cost. And it's because most entities that interact with steel and aluminum that have some sort of investing slash risk management arm that deals with capital markets, which most of those players will for GM bowing all of those absolutely will, they're hedging right now. And the way that they hedge is they go long the thing that's gonna go up in price. So that then as their source materials are going up in price, some of that is partially offset by the increase in their futures contracts. This is obviously an extremely, extremely simplified example, but that this is the source of hedging. This is why it happens. So if we take a look at the COT report, there's a couple things we can, let's take a look at aluminum. Now, for those that don't know, you can either use the aggregator or disaggregated report. It doesn't really matter, but one of the main things is, we want to get a sense of specifically people that deal with the products themselves. So if we go to the disaggregated report, you can take a look at the change in commercials from the producer merchant processor and user line and take a look, they've been hedging. They've absolutely started to hedge some time ago. And the reality is this is probably going to peak up quite a lot. Now the COT report lags, right?",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 50,
      "start_timestamp": "00:17:27",
      "start_timestamp_seconds": 1047.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1047"
    }
  },
  {
    "text": "a look at the change in commercials from the producer merchant processor and user line and take a look, they've been hedging. They've absolutely started to hedge some time ago. And the reality is this is probably going to peak up quite a lot. Now the COT report lags, right? So you can see that this is back from three Feb in before that will have been 27 Jan, but this lags, this will likely start to increase as that hedging activity changes. Now what I do want to take a look at though, is the E-minis. And I'm specifically curious about that thing we were talking about in the beginning. This idea that retail is stepping in front of the, I don't really think so. I don't really think so at all. Interesting. So here's what I'm eyeing right now. I actually don't really care that much about the price for this up here. I care about these two lines. And if we're looking at the legacy report, you can see that small speculators, which is this violet looking color line, they're about the same, right? They've been training sideways. It's actually a slight downtrend if we plotted this carefully. Let's move this in way closer in time. Let's look at like a three month look to blocky. We'll look at a six month. Okay, I like one year. And you can see that speculators have definitely gotten a little bit extended bullish to the upside, but they're still",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 50,
      "start_timestamp": "00:18:55",
      "start_timestamp_seconds": 1135.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1135"
    }
  },
  {
    "text": "carefully. Let's move this in way closer in time. Let's look at like a three month look to blocky. We'll look at a six month. Okay, I like one year. And you can see that speculators have definitely gotten a little bit extended bullish to the upside, but they're still there in force. And then take a look at this massive change from managed money, large speculators. We care way more about managed money in this scenario for something like the SP than we do for commercials. Commercials in managed money will almost always go opposite directions. And it's because they're doing different things. So the commercial side of things, those are people that are using this again for production, hedging activities of some sort, currency hedges, all different ways. Even you can use SP futures to do something like that. It's really, really nuanced. But what we can clearly see is that small speculators, those are the peasants that's you and I. And we've been getting net long for some time now. And we can see that large speculators, this is institutions had hedge funds, places like that. They are now just taking up massive long. So the in terms of their relative level, they're still short, right? So you can still see it's at negative 4800 or so. And this is a net figure. So they're still short, but they're changing. They're tuned very, very quickly. And now the game is, are they starting to get long here?",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 50,
      "start_timestamp": "00:20:18",
      "start_timestamp_seconds": 1218.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1218"
    }
  },
  {
    "text": "terms of their relative level, they're still short, right? So you can still see it's at negative 4800 or so. And this is a net figure. So they're still short, but they're changing. They're tuned very, very quickly. And now the game is, are they starting to get long here? No, which we have to wait and see. We have another week or so to go. The COT report doesn't come out for a little bit. Interesting. So this goes back to what we were talking about in the beginning. I don't actually see the correlation. And again, I'm actually really curious from the chat from you guys. Have you seen that thing I'm talking about or is that just me? It's I'm genuinely asking because I don't know. The thing I'm talking about is it seems like as I'm going through X and other social media places, Reddit, it seems like retail traders are really nervous right now that they're kind of like waiting for a crash. But we can see that in the aggregate, they're still quite long. So I don't know if that's just the silo of information that I'm looking at or if that's something that collectively people are picking up. Because right now that seems to be the trend. I'm seeing a lot of people talking about the bearer side, the potential downside in the market, which is always comical to me. It's we always do that as soon as markets start getting a little",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 50,
      "start_timestamp": "00:21:36",
      "start_timestamp_seconds": 1296.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1296"
    }
  },
  {
    "text": "collectively people are picking up. Because right now that seems to be the trend. I'm seeing a lot of people talking about the bearer side, the potential downside in the market, which is always comical to me. It's we always do that as soon as markets start getting a little bit extended. But that's definitely what I've been seeing. We got capital ape. What a travel says how many times a year can we win? Lauren says all I heard was quick easy wins. Yep, that'll be Thursday. Thursday's designed is supposed to be something simple. Ken says what I see seems odd so many long. Okay. I mean, I guess to me, I don't see why it seems odd that people are long. Because if we take a look at just where the market is, the market is essentially hovering near all time highs. So if I zoom these out, I'll take all these out to like a six month. I don't really know what bonds is in here. Why are we looking at bonds? Oh, that's right, because I hate the doubt. I think the doubt dumb. So I see like we're literally less than a percent off of all time highs. So to me, this is actually the like a decent spot to not be long. To not not be long. I mean, you needed the double negative there. I think right now is a logical place to be long because of, I mean, this is exact",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 50,
      "start_timestamp": "00:22:47",
      "start_timestamp_seconds": 1367.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1367"
    }
  },
  {
    "text": "of all time highs. So to me, this is actually the like a decent spot to not be long. To not not be long. I mean, you needed the double negative there. I think right now is a logical place to be long because of, I mean, this is exact thing, right? Like we're literally near all time highs. People do tend to get verbally skittish. Tommy says crypto retails are scared but hanging on large liquidations in crypto. I saw that whole thing too with the bar stool coin. I forgot the name of it, jail stool, jail stool coin. I don't know anything about it. But I saw Porton only talking about that, which I always like watching Porton. I use fucking hilarious to me. But Bd's will says folks have been super bears for a long time but keeps seeing the market move up, which that tends to be what, here's what I tend to surmise from that. I think it's the same thing we see in a lot of politics and other stuff where there's a very vocal minority. And then there's the majority that are a little more quiet kind of doing their thing. I always say it with respect to like politics and stuff like that because if you look at the news, politics, you would think like everybody hates each other and it's like left versus right and there's a great massive divide between them. And all of a sudden, if you take",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 50,
      "start_timestamp": "00:24:21",
      "start_timestamp_seconds": 1461.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1461"
    }
  },
  {
    "text": "always say it with respect to like politics and stuff like that because if you look at the news, politics, you would think like everybody hates each other and it's like left versus right and there's a great massive divide between them. And all of a sudden, if you take most people that are left and right and just haven't talked about some shit, there's a lot of stuff that they get along with just fine. So it's just kind of exacerbated by, you know, the media presentation of that. I get that same sense with the market where there tends to be a pretty vocal minority of people that tend to be perpetually short. Those are people even like Michael Burry. Michael Burry has been saying that the market's gonna go down for a long time now and I mean, he's just continually wrong. That's not, he's smart as hell, not taking anything away from that dude. Just saying that like that angle is really, really common for people that like to talk about it. So it also seems really intelligent, right? For people to be the one that calls the drop. But it's just like in anything else where the number of quote unquote calls that don't come to fruition have to be mentioned because those are the periods that were wrong. I or two that says federal government is shedding thousands of jobs opposite of what was happening just a few months ago. This will show up",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 50,
      "start_timestamp": "00:25:28",
      "start_timestamp_seconds": 1528.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1528"
    }
  },
  {
    "text": "where the number of quote unquote calls that don't come to fruition have to be mentioned because those are the periods that were wrong. I or two that says federal government is shedding thousands of jobs opposite of what was happening just a few months ago. This will show up in a few months. Yeah, but I mean that shedding of thousands of jobs is actually really good for the broader economy because we've been running in a deficit for so long. Again, not getting political in terms of if we're shedding the right jobs or if the way that we're doing it is right, just talking at a high level, government spending versus government income. And this game of drawing down government spending which the largest part of that is personnel that contracting to create a better balance with government income, I actually think that that's better for the market long term. And also it's also worth noting that like the federal government is federal government. So that's not necessarily a direct lend over to capital markets which are typically private. Private, I'm sorry, not private. They're publicly traded but corporations. They're obviously not private. The ones that we can trade at least. So yeah, I mean the turnover that's going on in the government I think is something to keep an eye on but I don't really see that same angle in terms of that being a reason for people being nervous about Apple potentially going down or",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 50,
      "start_timestamp": "00:26:30",
      "start_timestamp_seconds": 1590.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1590"
    }
  },
  {
    "text": "can trade at least. So yeah, I mean the turnover that's going on in the government I think is something to keep an eye on but I don't really see that same angle in terms of that being a reason for people being nervous about Apple potentially going down or Nvidia potentially going down. They seem fairly disparate to me at least. Now speaking of Nvidia, we should take a look at it because there she is. This is exactly what I had been talking about. So this and take a look, I didn't change this from when we spoke about it. So this became the spot to be and we had talked about Nvidia actually on the fifth and that to me is when it started looking good because it's starting to make consecutive pretty strong moves and I mean this has been probably one of the easier trades which is about anybody could have gotten into again. I didn't trade it directly personally simply because I'm already generally and directly involved in it via SSO and T triple queues but we're trading an individual tech company on top of that. I mean this was like one of the simplest no-brainer trades in my mind when it started to materialize. As I always say when it first made the drop and we talked about this in my mind, the game was waiting and seeing what it was going to do. Now I don't think Nvidia has had any massive",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 50,
      "start_timestamp": "00:27:52",
      "start_timestamp_seconds": 1672.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1672"
    }
  },
  {
    "text": "simplest no-brainer trades in my mind when it started to materialize. As I always say when it first made the drop and we talked about this in my mind, the game was waiting and seeing what it was going to do. Now I don't think Nvidia has had any massive change in underlying value pipeline relevance. It's at the heart and soul of this entire AI revolution. This is one of those very rare, very rare market opportunities and it's one of the reasons why I talked about Nvidia quite a few times and that's because you don't get this many gifts from the market. You can essentially count them over your lifespan of trading where you can have probably one of the absolute best position companies on planet earth just fall off a cliff due to some news in short term sentiment changing so heavily dropping almost 20. I mean it had an incredible drop from here, not 20 a little less. But anyways this still I think is a really solid place to keep an eyeball on. If you've not already made a trade on it or again from an investor's perspective, this is all still I think an incredible spot, an absolutely incredible spot because the probability of Nvidia being anywhere near any of this two years down the line so low, so so very low, very unlikely. So Nvidia to me looks really, really strong. Let's take a quick look at the overall market. I'm going",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 50,
      "start_timestamp": "00:29:03",
      "start_timestamp_seconds": 1743.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1743"
    }
  },
  {
    "text": "an incredible spot, an absolutely incredible spot because the probability of Nvidia being anywhere near any of this two years down the line so low, so so very low, very unlikely. So Nvidia to me looks really, really strong. Let's take a quick look at the overall market. I'm going to pop the door for Thor. So we can go grab his dinner. He's out of there. So the SP 500 had a decent, a decent spike. It's kind of rebounding off of this fairly significant contraction by the way. And Q's is now in a really, really delicate spot. It's running up into overhead resistance. Again, this trend line has been drawn for some time. From a technical perspective, it still looks favored, I think, to punch through it. But it's too really to tell. And what we might favor doesn't really matter what matters is what it ultimately ends up doing. Now what I can tell you is that if it doesn't and if it starts to roll over, to me, that becomes pretty attractive for at least a very short term downside trade two, three days, probably something super short term like that, but not a bad opportunity. So I'm watching it for really both of those directions. Again, I still have the coverage triangle that's out in Teachable Q's and in SSO. So I'm broad, large, broad, long, large cap equities. But I still will trade the short term movements because the coverage triangle is really",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 50,
      "start_timestamp": "00:30:18",
      "start_timestamp_seconds": 1818.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1818"
    }
  },
  {
    "text": "opportunity. So I'm watching it for really both of those directions. Again, I still have the coverage triangle that's out in Teachable Q's and in SSO. So I'm broad, large, broad, long, large cap equities. But I still will trade the short term movements because the coverage triangle is really a much longer term style position and I can trade around it really success. We'll even directly to the downside. There's nothing wrong with that in my book. So I'm always happy to do that. Small caps can't catch a bid to save their fucking lives. Now, small caps also interestingly, for those that haven't looked, this is worth showing you, I think. We pop over to IWM and we go into the trade grid. I want to show you something. Take a look at even like a 20 delta, 22 delta put. You essentially get a 1 return for a 22 delta put that's 39 days out. So let's track that, right? So somebody pay attention to that. Remember that, 22 delta and it's about a percent. Now let's go to spy. Let's go to same expiration. Let's go to a 22 delta. 22 delta, you are collecting. I have to do the math because it's much less than that. Whoa, that's intense. I had the scientific calculator up for a little bit and I just needed to chill out because it's, I don't need all that noise. So what is it's like call it 406? So 406, 406",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 50,
      "start_timestamp": "00:31:47",
      "start_timestamp_seconds": 1907.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1907"
    }
  },
  {
    "text": "have to do the math because it's much less than that. Whoa, that's intense. I had the scientific calculator up for a little bit and I just needed to chill out because it's, I don't need all that noise. So what is it's like call it 406? So 406, 406 divided by what, 583? 0.7. Why am I telling you this? Why would I identify that as a data point real? James says, you still have ORATS affiliation? I do. I do still have an ORATS affiliation. Did that fall out of like the description thing? Normally it's in the description. If it's not and you want it, let me know. I can send it to you. It's like I tell you guys what I make from like those affiliates. It's so insignificant to me. It literally doesn't matter. The only reason why I do that is for those that are interested in it, like straight up gets you a discount. But I literally make essentially nothing off of them. It's not not really consequential. Anyways, back to the question. Why am I talking to you about this? Why am I talking about the relationship between what I can get in terms of premium on a short put from spy versus Nvidia, or I'm sorry, spy versus IWM. I was writing Nvidia my little update here. Nvidia analysis. Spy versus IWM volatility. IWM expected more if a downside compared to spy. Not quite. It's a good guess, but it's not",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 50,
      "start_timestamp": "00:33:01",
      "start_timestamp_seconds": 1981.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=1981"
    }
  },
  {
    "text": "in terms of premium on a short put from spy versus Nvidia, or I'm sorry, spy versus IWM. I was writing Nvidia my little update here. Nvidia analysis. Spy versus IWM volatility. IWM expected more if a downside compared to spy. Not quite. It's a good guess, but it's not quite. What I'm showing you is a relative volatility. Now, normally we see pretty strong correlation between the various indices. So if you look at the SP 500, if we take a look at Q's, if we take a look at the Russell, they tend to be fairly similar in terms of their price action and their willingness to follow one another. Now, for the last two years, three years now, what, four years now almost, you've seen a massive decoupling of that from small caps, the Russell, and the rest of the large caps. You can also plot the correlation of volatility. And the correlation of volatility between these tends to be a little stronger than what it is. So if I'm a volatility trader, you can literally trade the dispersion of volatility between two different indices based on a pairs trade. Now, that's a really cool style of trade because it's effectively hedged internally, provided that the relationship is your confident in the relationship and the normalization of it. But then also from a non-bate or risk design trade, that's really the goal of that kind of position is to capitalize on the variance and volatility, not just",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 50,
      "start_timestamp": "00:34:21",
      "start_timestamp_seconds": 2061.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2061"
    }
  },
  {
    "text": "trade because it's effectively hedged internally, provided that the relationship is your confident in the relationship and the normalization of it. But then also from a non-bate or risk design trade, that's really the goal of that kind of position is to capitalize on the variance and volatility, not just in anyone index, but between the two indices because that's a big gap. The fact that right now, you can get essentially a percent on 22 delta out of the money put in IWM and then in spy, you're looking at 0.69 percent. It's a big difference. And there's not an insignificant opportunity wrapped into that. Now, again, it's not sexy, it's not super fun, it's not high flying, but it's just another idea. All right. Now, I want to take a look through a few other things with you all. The first thing is I want to talk, actually I'll save that for the procession tomorrow. I have a couple of single trades on in a few different companies and I do want to talk about those because I think that there's a few broader takeaways from a trend following perspective, but we can get into that stuff more so tomorrow. The other thing I do want to flag though is trying to get more downside opportunities. So the market, as it sits now, is still showing that same divergence that we were talking about yesterday and really for the last week or so. So if we take a",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 50,
      "start_timestamp": "00:36:00",
      "start_timestamp_seconds": 2160.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2160"
    }
  },
  {
    "text": "so tomorrow. The other thing I do want to flag though is trying to get more downside opportunities. So the market, as it sits now, is still showing that same divergence that we were talking about yesterday and really for the last week or so. So if we take a look at, that's not what I want. I want this. So if we take a look at what's performing really well right now compared to what's really starting to roll over, real estate is still slowing down pretty significantly compared to everything else. Now, a lot of these other names you can see that they're relatively slow compared to the 20 day and the five day. That's essentially saying no change that a bunch of these were remaining about the same. But you can see things like energy, industrials and utilities are now starting to pick back up because we're starting to come into another defensive rotation and it says a lot to do with the tariffs that are coming out right now. There's also a handful of really big economic releases this week that are worth mentioning. If we run through that really quick, we took a look at these yesterday so I'm not going to linger on them, but I do want you to be aware of what's coming up because there's quite a few things at this point that potentially pretty significant impact is far as I'm concerned. And a lot of that is going to come",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 50,
      "start_timestamp": "00:37:19",
      "start_timestamp_seconds": 2239.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2239"
    }
  },
  {
    "text": "these yesterday so I'm not going to linger on them, but I do want you to be aware of what's coming up because there's quite a few things at this point that potentially pretty significant impact is far as I'm concerned. And a lot of that is going to come from down here, CPI. So CPI is obviously a really important inflation gauge and the market's watching CPI very, very closely. And then you also have production. Production is also going to be really, really important. And GDP, the reason why these metrics are so important is because the market is trying to get a sense we're still trying to gauge the probability of a hard versus soft landing. And we don't really know. The overall leanings and probabilities as far as I've researched so far still seem to favor the probability of a soft landing. But I mean, we're still in the middle of pretty persisted inflation. So it's not soft, it's not super soft. Maybe bumpy landing, we'll call it at this point. But those are probably the bigger metrics that you see coming out this week along with CPI a little bit later. Retail sales, I was talking about that yesterday quite a lot. And it's because the health of the consumer right now is really important to keep an eye on. The consumer that we saw, we were looking at what was the earnings release we were looking at yesterday? It's a financial company, was it",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 50,
      "start_timestamp": "00:38:33",
      "start_timestamp_seconds": 2313.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2313"
    }
  },
  {
    "text": "talking about that yesterday quite a lot. And it's because the health of the consumer right now is really important to keep an eye on. The consumer that we saw, we were looking at what was the earnings release we were looking at yesterday? It's a financial company, was it a firm? Might have been a firm, that sounds familiar. We were looking at, I think it was a firm. And essentially the payoffs for writing off debt that isn't being paid out and the delinquency rates are slowly starting to go up. And these are things I typically watch from Fred, the Federal Reserve education, I forgot what Fred stands. What is Fred stand for? It's from the economic division. What the fuck does Fred stand for? Federal Reserve, no it's not that. Hey, how does Fred stand for? Yo, somebody hooked me up here. Trying to figure out what Fred stands for. I can't remember, I'm trying to log it into the dashboard right now so I can show you what I look at. It's not letting me log in. That's actually kind of frustrating. Nobody gave me the answer? Damn, you all are gonna make me look up myself? All right. Ah, Federal Reserve economic database. I mean that's realistically that is a very intuitive name. I just didn't remember it. I think that's pretty good. So anyways, you can create different dashboards and stuff there to visualize stuff. It looks like my old email's gone, but",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 50,
      "start_timestamp": "00:39:49",
      "start_timestamp_seconds": 2389.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2389"
    }
  },
  {
    "text": "up myself? All right. Ah, Federal Reserve economic database. I mean that's realistically that is a very intuitive name. I just didn't remember it. I think that's pretty good. So anyways, you can create different dashboards and stuff there to visualize stuff. It looks like my old email's gone, but I was gonna show you guys another time. So let's take a stroll and let's take a look at a few things. I think from a trading perspective, there are a couple ideas that stick out to me right now. For my own portfolio, I'm already pretty good in terms of my tech exposure. And again, that's because a lot of it, a lot of the portfolio, I share with you all the sample portfolio, like the segment that I break out from the broader portfolio, but the percentages and stuff like that essentially mirror one another. Otherwise it would be annoying for me to track all the differences. So what that means is a decent amount of the portfolio right now is still sitting in the coverage triangle. Actually, I think, yeah, here. So this is the segment portfolio, the reference portfolio that I've been sharing with you all. And this is again, just essentially taking a bit of what I have in my broader portfolio, pulling it over into a smaller allocation and then using it as an example for us to take a look at and explore together. And still you can see one of the key",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 50,
      "start_timestamp": "00:41:12",
      "start_timestamp_seconds": 2472.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2472"
    }
  },
  {
    "text": "And this is again, just essentially taking a bit of what I have in my broader portfolio, pulling it over into a smaller allocation and then using it as an example for us to take a look at and explore together. And still you can see one of the key themes right now for the portfolio is I still am very, very heavily in cash-secured puts versus long equity. And I do this a lot, but anyways, of the total subset allocation of 550K, you can see that 375K of that is in T triple-q's and SSO, which really is kind of getting direct exposure to tech broadly, right? Because the SP 500 is most tech now and T triple-q's is even higher concentration tech. So the reason why I bring that to your attention is because then as I'm looking for different trade ideas, I'm looking at it from the perspective of, I'm not like, shying away from tech because I still think tech is the primary place to look. However, it's not where I'm waiting to like really try to add more risk in tech. I actually am trying to find things in other ideas. Now that's not working well because a lot of the opportunities that I'm seeing are in tech and so be it, that is what it is. But that starts to increase overall correlation risk of the portfolio, which I don't want too much because of the leverage ETFs. And then you kind of",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 50,
      "start_timestamp": "00:42:43",
      "start_timestamp_seconds": 2563.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2563"
    }
  },
  {
    "text": "working well because a lot of the opportunities that I'm seeing are in tech and so be it, that is what it is. But that starts to increase overall correlation risk of the portfolio, which I don't want too much because of the leverage ETFs. And then you kind of have a bunch of positions that all look the same. If there is a big market turn down, that then starts to look really painful. So that is the context on why I want to actually take a look and see from a directional perspective. Now from a volatility trading perspective, we're in one of the best times of the year already, which is earnings. So there's a ton to do from an earnings trading perspective. I'm not really scrounging bottom of the barrel to come up with ideas here. It's kind of the opposite. There is just a pure abundance of things to do. So this is easy. This is how I manage most of the volatility book coming through this kind of earning cycle. But from a directional perspective right now, there's a couple different ways we can go. We can look at things that are showing strength within energy and leading energy because there are a handful of names that we looked at before that continue to be the dominant leaders. Or we can look for things that are starting to break down massively like in real estate and we can look for the weakness within real",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 50,
      "start_timestamp": "00:43:58",
      "start_timestamp_seconds": 2638.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2638"
    }
  },
  {
    "text": "within energy and leading energy because there are a handful of names that we looked at before that continue to be the dominant leaders. Or we can look for things that are starting to break down massively like in real estate and we can look for the weakness within real estate or even financials. The financials sector has been all over the place. So if we take a quick look here, let's see what's slowing down on the month. PayPal is slowing down a lot, EG, P-R-U, USB. So all of these are slowing down on the financial sector quite a lot, which again, that offers opportunity to us because we can trade things that are showing more weakness within the sector. Yeah. And it obviously had a disappointing earnings. So now this to me looks like if it breaks down below, then I very much favor a downside acceleration. If it rebounds and breaks out from the top, then there's really nothing to be done there. Now this also can be traded via stuff like short calls and with the expectation of maybe having to manage them a little bit. But trading short calls in something like PayPal, it's not like a massive mover. So from six months over the last six months, it's gone from 63. It did hit a high of 92. So it's not a small move obviously, but that's not like a crazy move. Like you can easily keep pace with that kind of move.",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 50,
      "start_timestamp": "00:45:06",
      "start_timestamp_seconds": 2706.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2706"
    }
  },
  {
    "text": "not like a massive mover. So from six months over the last six months, it's gone from 63. It did hit a high of 92. So it's not a small move obviously, but that's not like a crazy move. Like you can easily keep pace with that kind of move. So this is a pretty easy place to look for downside. Pretty easy place to look for downside. Now if we take a look at the volatility surface really quick. And let's take a look at. Ah, interesting. So you see how the 16 May expiration that blue line that gets overlaid essentially is showing so much higher than these others. This is a really curious scenario. This is essentially the market telling us that it thinks that there is a higher probability for PayPal to have a moderate size move. Right now it's favoring a downside move in terms of severity, which means upside move is slightly more, well not slightly, probably significantly more probable, which we can look at the probabilities for that. And it's expected to happen essentially before 16 May, because once we get out to 16 May in 20 June, it flattens out massively. So we lose the smirk and it goes more into a flat a near flat, obviously not perfectly flat, so that's what the market is telling us from a whole perspective in PayPal. Interesting. Yeah, we'll keep an eyeball on it. Let's take a look at some eG. It reminds me",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 50,
      "start_timestamp": "00:46:35",
      "start_timestamp_seconds": 2795.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2795"
    }
  },
  {
    "text": "we lose the smirk and it goes more into a flat a near flat, obviously not perfectly flat, so that's what the market is telling us from a whole perspective in PayPal. Interesting. Yeah, we'll keep an eyeball on it. Let's take a look at some eG. It reminds me of like eA sports. Amboy. So this looks. Ah, interesting. So this is kind of the previous floor. That was priced in. And you can see. Where we are relative. So now the question becomes, how does it deal with that, that for something like this, this also becomes a fade potential. So all I'm doing is setting up a couple alerts to stay button close to it. And then if it breaks down, essentially look to trade it to the downside. Let's take a look now at. Want to take a look at one of the other sectors we've got like 10 minutes left. So I'm going to continue this and then in like two minutes, I'll just pivot over to you guys and we can take a look at any questions or anything that you guys want to take a look at specifically and he stocks. So if there's anything like that, now's the perfect time to start throwing that stuff out there. Right now. I'm just trying to find a couple ideas, make a couple dollars. You know how it is, you know how it is. We're just out here trying to make a couple dollars. No,",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 50,
      "start_timestamp": "00:48:12",
      "start_timestamp_seconds": 2892.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=2892"
    }
  },
  {
    "text": "there's anything like that, now's the perfect time to start throwing that stuff out there. Right now. I'm just trying to find a couple ideas, make a couple dollars. You know how it is, you know how it is. We're just out here trying to make a couple dollars. No, this doesn't look bad at all, unfortunately. But this does look like something I want to see if it starts to look bad. Because this also at disappointing earnings. Things that have bad earnings, I always favor them. But one of the notes I found I was reviewing my trade log for my monthly review last month. One of the things I'm noticing more recently is that the fade opportunities are there in terms of numbers, the severity has gone down quite a lot, especially compared to like my average PL from a short from this year so far compared to last year. So what that means is I am sizing up a little bit more on the long puts or short calls and I'm typically taking them down a little quicker. Just for your general context, let's take a look at thing. I mean, this just looks like straight downside on it. This looks like a continued. Just a continued massive. Downside channel. Like that. And. I mean, this I also heavily favor to the downside has earnings coming up. So we can see how the markets positioning in it for earnings. Let's take a look. Trying to get",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 50,
      "start_timestamp": "00:50:21",
      "start_timestamp_seconds": 3021.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3021"
    }
  },
  {
    "text": "downside on it. This looks like a continued. Just a continued massive. Downside channel. Like that. And. I mean, this I also heavily favor to the downside has earnings coming up. So we can see how the markets positioning in it for earnings. Let's take a look. Trying to get the earnings detail. What is it's 24th. February 24th. So we have to be out here. A lot of callsque. In this near term, which this has got to be recent flow in. So if we take a look just at a curiosity. My guess is we'll see way more flow coming in from this side. Yeah. Yep, exactly as expected. No surprise. Most of the inbound flow has been very recent. And it probably has a lot to do with the news that we saw today. And yesterday, like us last week, but coming into this week. So the market definitely this is still being punished though. And I don't really want to fade VLO COP. That's actually the other play I was looking at though is finding long. Long ideas based on the expanded drilling. So that's a I didn't finish working on it with chat. So create a list of publicly created companies that are likely to benefit the most from. From. Rumps. Expansion. Of. Oil extraction and drilling. Let's see what this says. I want to poke through some of these names. All right. Up, moving me down. I wish format as a table. These year,",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 50,
      "start_timestamp": "00:51:42",
      "start_timestamp_seconds": 3102.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3102"
    }
  },
  {
    "text": "a list of publicly created companies that are likely to benefit the most from. From. Rumps. Expansion. Of. Oil extraction and drilling. Let's see what this says. I want to poke through some of these names. All right. Up, moving me down. I wish format as a table. These year, I normally have chat GPT. This again, if you're not using chat GPT on a daily basis, you're literally wrong. You're just making a very poor choice. Because it accelerates everything. It's not perfect in any capacity. But it helps a lot. So here's a few names to start. Now. What categories are most likely to benefit. The most from Trump's policy. And I want to see what it says to that. I want to see what it says. I want to see what it says. I want to see what it says. Exploration and production. Oil field. Because fracking is probably going to go up. So they're talking about Halliburton. Shlumberger S.L.B. Which should be in there. Baker Hughes. Which is not in there. So. Create a new table with all these. And. Cole. I'm not really super bullish on Cole, to be honest. I think Cole can be fine. I don't think Cole's going anywhere. But I'm just not sure that that's where I would position for. A bigger move. I'm not sure if I can get a new table. I'm not sure if I can get a new table. Okay, this is going to have to be.",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 50,
      "start_timestamp": "00:53:35",
      "start_timestamp_seconds": 3215.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3215"
    }
  },
  {
    "text": "fine. I don't think Cole's going anywhere. But I'm just not sure that that's where I would position for. A bigger move. I'm not sure if I can get a new table. I'm not sure if I can get a new table. Okay, this is going to have to be. Like a multi. Is there's. That rules me a sec. I don't know what. I don't know what's super secret content you guys are about to see. We'll find out. This is where I make obviously the little. The little. Blockboards for the videos that I show. Show you guys. Nothing. That sucks for you. Because I have a bunch of stuff in the works over here. That could have been fun. Anyways. I guess an easier. Would have just been. Yeah. So I should be easier. I'm not sure. Literally. Just. I'm. I'm. I'm. And then we'll poke through these relief. And then we'll do Q and A promise. I'm. I'm. I want to see these. Okay. All right. So you guys can all grab a screenshot or take a peek at that. As far as you want. And then I'm going to move it off to the side now so that I can like see. It'll allow me to move much, much more quickly. So exon mobile. Man, I just don't like these to the upside. The problem is this is going to be a news driven trade based on whenever this stuff starts breaking. But this might",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 50,
      "start_timestamp": "00:55:52",
      "start_timestamp_seconds": 3352.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3352"
    }
  },
  {
    "text": "now so that I can like see. It'll allow me to move much, much more quickly. So exon mobile. Man, I just don't like these to the upside. The problem is this is going to be a news driven trade based on whenever this stuff starts breaking. But this might be okay for like short puts. I wouldn't hate selling puts in XMobile, but I'm not sure that I'm expecting some sort of big breakthrough. I don't like COP. This you can see I already have a bunch of alerts waiting for it trying to find some strength, which just literally has not happened. So no doubt there. This looks better, but not good. EQT continues. This wasn't on that list. I just wanted to see EQT. But EQT looks really good. Um. How else. I don't know if it looks terrible. See, man, I just. I really just can't get behind going along these companies. They look like straight trash. What I can get behind doing though is keeping an eye on them that I absolutely can do. And monitor. If there's a perspective entry over time. But. I mean, the reality is based on where these sit now. I think that's the reason why I'm going to be doing that. I would want to do with them to the upside. There's just so much better opportunities that are moving heavily. You sent me or dinner order. I'm going for Mexican. So I'm sure she's not going to. Not",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 50,
      "start_timestamp": "00:57:49",
      "start_timestamp_seconds": 3469.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3469"
    }
  },
  {
    "text": "I think that's the reason why I'm going to be doing that. I would want to do with them to the upside. There's just so much better opportunities that are moving heavily. You sent me or dinner order. I'm going for Mexican. So I'm sure she's not going to. Not going to go for it. But we'll see. As expected. That's alright, burrito for me. Okay, order is up. So. This doesn't look good. S.L.B. This doesn't look good. B.K.R. Looks good. So this is what I'm talking about, about looking within the sector. And finding strength. Because there is strength in the sector, especially something like energy right now. Because even though energy isn't doing anything that we're like, oh, wow, this is, you know, so crazy. What crazy such moves. But it definitely still is performing moderately. And the reason why we know that is because of this. Because of this giant change in the number of stocks within the sector that are above a short term moving average compared to a slightly longer term moving average. So there has to be stocks doing this. And then we can sort them. We can actually get, I mean, the tip the way I typically would do this. If I wasn't looking for something based on a broader market theme. Is that would just come into this. And then I would sort this. And normally I prefer to sort looking for stuff that's exhibiting momentum. So that's why EQT came",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 50,
      "start_timestamp": "00:59:14",
      "start_timestamp_seconds": 3554.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3554"
    }
  },
  {
    "text": "tip the way I typically would do this. If I wasn't looking for something based on a broader market theme. Is that would just come into this. And then I would sort this. And normally I prefer to sort looking for stuff that's exhibiting momentum. So that's why EQT came up on that list is because EQT has been something I've been in and out of several times now. And it's because EQT continues to be a leader. And then no shock here. Take a look at what else popped on the list that we happen to be looking at right now. BKR. So this is literally how you can navigate through markets and find ideas literally at any point in time. People that struggle to find trades confound me. Because there are always things to do. There's unlimited things to do. It's always a function of finding the best things to do. But there's a ton of them. So this is another, again, really simple idea. Is BKR is involved in this broader exponential change that we might see from the oil development and further production from oil field services BKR. They essentially can benefit from the growth in equipment and services. If we take a look at their fundamentals. I mean, their fundamentals look good. There's one other thing I want to look at and then I promise we'll pivot now to the QA. And you know, take a look at whatever tickers you want. But I want",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 50,
      "start_timestamp": "01:00:41",
      "start_timestamp_seconds": 3641.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3641"
    }
  },
  {
    "text": "equipment and services. If we take a look at their fundamentals. I mean, their fundamentals look good. There's one other thing I want to look at and then I promise we'll pivot now to the QA. And you know, take a look at whatever tickers you want. But I want to take a look at their last earnings release. BKR. What I want to do is I want to see where their money comes from. Hell yeah, look at her go. What the fuck? He's the only one with a patch. Uniformity. What Marine and me is bugging out right now that that's not at least more similar. Let's see. What up Nancy? I want to see the breakdown. No, I don't care. I don't care. I don't do I care? I don't care. Okay. Flexible pipe systems orders massively going up. 15 increase in best value countries. So global global revenue coming in. Okay. Here we go. Here we go. This is what we want. Let's see. Well construction. 943. Production solutions. 974 sub C932. So that will be useful. Geographic region. Interesting. Again, this is another reason why we like to look at this is because if we break out their potential revenue sources from different geographic regions, it's actually a minority from North America. Because again, think of it from the perspective of the idea that we're trying to tease out here. The idea that we're trying to tease out is Trump is saying I want more",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 50,
      "start_timestamp": "01:01:53",
      "start_timestamp_seconds": 3713.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3713"
    }
  },
  {
    "text": "break out their potential revenue sources from different geographic regions, it's actually a minority from North America. Because again, think of it from the perspective of the idea that we're trying to tease out here. The idea that we're trying to tease out is Trump is saying I want more oil drill bitch. We're then doing a little bit of preliminary research saying, okay, who's involved with the drill bitch function of that. And some of it is Baker Hughes for sure. And they're performing well. But if we take a look at the overall revenue by region, I want you to look at two things. The first thing is take a look at the North American revenue streams for the past three earnings cycles. 1018, this was obviously year over year. So a pretty significant decline and then quarter over quarter from 971 to 971. Nothing is changed. So most of this growth is happening from Latin America, Middle East. And that's important because then if we take a look at their total revenue streams from non-US based functions, it's the majority. So then how much of the potential revenue impact would be realized by them if Trump says drill more and then they're involved. That's not to say that it can't be significant. It can be significant. What I'm highlighting is that there's an opportunity here because right now it's about gridlocked. It's not really doing anything. It's declining 5 year over year. But we would need to",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 50,
      "start_timestamp": "01:04:10",
      "start_timestamp_seconds": 3850.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3850"
    }
  },
  {
    "text": "drill more and then they're involved. That's not to say that it can't be significant. It can be significant. What I'm highlighting is that there's an opportunity here because right now it's about gridlocked. It's not really doing anything. It's declining 5 year over year. But we would need to see how well they're positioned to then interact with the various product lines that they produce what the competition looks like. So now that's the next question and so on and so forth. And I promised you that I would pivot to QA. But that's I'm just letting you know the way that I would do this. So the next step for me here would be to look through that. I would go through, find their competitors. An easy way to do that is to come in here. We can look at BKR. And then we can figure out who their primary competitors are. SLB, HAL, TES, which TES is also doing really well in FTI. And then we can look through their earnings and see what their market cap right now or what percentage of the revenue comes from North America. And then this helps us pick the right place to put the money to play the idea. This is one of my favorite things about trading, especially more thematic ideas is you get to do really cool research at least for me. I'm a fucking nerd about this stuff. I like this. And to see essentially what's going",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 50,
      "start_timestamp": "01:05:26",
      "start_timestamp_seconds": 3926.26,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=3926"
    }
  },
  {
    "text": "place to put the money to play the idea. This is one of my favorite things about trading, especially more thematic ideas is you get to do really cool research at least for me. I'm a fucking nerd about this stuff. I like this. And to see essentially what's going on in the broader market. Now a couple of other notes. This is the kind of thing I would absolutely use leverage for and it's because of this. Take a look at the institutional ownership 98.7. This stock is just about locked up. So what that means is the ability for the stock price to move meaningfully is really muted. And it's not going to be some sort of high growth, high flying stock like some of the other newer up and coming names will be. But on the same token, I can't trade most of those up and coming names because they're too liquid for the size that I have to put on in order for the trade to make sense. So that is a quick rundown at least of capitalizing on the energy side of things and you know seeing what might be possible there. So all of that aside now, let's. Let's pivot to QA. I just have to update our little timestamps here. Trade opportunity and energy. What is this BKR? Okay. Now we're at 108 20. We'll do a little QA. Anything you guys want to hit? If not, that's totally cool. But I just",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 50,
      "start_timestamp": "01:06:42",
      "start_timestamp_seconds": 4002.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4002"
    }
  },
  {
    "text": "that aside now, let's. Let's pivot to QA. I just have to update our little timestamps here. Trade opportunity and energy. What is this BKR? Okay. Now we're at 108 20. We'll do a little QA. Anything you guys want to hit? If not, that's totally cool. But I just I promised you so I wanted to make sure that you have the opportunity to throw out anything that you might want to take a look at. Tesla sure. Trash bro. So Tesla to me here looks bad. And that's probably not any sort of surprise. It's in a fairly defined downtrend at this point. And this new tool by the way of redraws channel channel is very, very cool. If you guys don't use this, I recommend it. The other thing that in case you don't know, they added a new tool. You have to go into the settings. I don't want to go in there because it shows some of your account information. But if you go into settings, think or swim now has a new tool where you notice this, you can't see it. Let me squish this down for a second. Okay. So you see this thing down here, the navigator. This is cool. So this essentially is like if I zoom in on this section, it shows me where I'm at. And then I can slide through this section. And then obviously I can zoom back out to recapture the whole screen and stuff like",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 50,
      "start_timestamp": "01:07:51",
      "start_timestamp_seconds": 4071.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4071"
    }
  },
  {
    "text": "thing down here, the navigator. This is cool. So this essentially is like if I zoom in on this section, it shows me where I'm at. And then I can slide through this section. And then obviously I can zoom back out to recapture the whole screen and stuff like that. But that's you just have to turn that on in your settings. But I actually like that quite a lot. It's very, very useful. And it shows you the overall trend. That's what the little mountain is. So pretty cool. And for Tesla, it looks bad. I mean, that's the reality of it. It's falling through successive areas of support. It's running into its next volume node right now. It's essentially on the next volume node. It's also coming down onto a 100 day moving average. So yeah, I mean, for me, I favor it to the downside right now. And I like Tesla. I want Tesla to do well. But automotive manufacturers are in a rough spot right now. And I don't think that that's going to change. That's why and especially in the EV industry, I think people that are trying to play the EV industry have to be super, super careful. Like Rivian as well. Rivian is just not doing well. And you can see it also in their earnings, right? Like they're still losing money. So automotive companies struggle historically. Rivian is no different than most of the broader companies. The main difference though is",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 50,
      "start_timestamp": "01:09:27",
      "start_timestamp_seconds": 4167.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4167"
    }
  },
  {
    "text": "to be super, super careful. Like Rivian as well. Rivian is just not doing well. And you can see it also in their earnings, right? Like they're still losing money. So automotive companies struggle historically. Rivian is no different than most of the broader companies. The main difference though is Tesla has come up and it has found a way to turn a profit to make some money. But it's highly, highly volatile. It's still making good money and even Tesla is starting to slow down. So I think it's an important note, at least to be aware of. So we can take a look at the options chain and see slight call skew. Recent call volume traded today. Take a look at the surface. Favourite downside, higher probability of upside. And compressed movement expectations. They're expecting more of that movement in the near term. Valtility isn't that high. IV percentile right now is 48. Yeah, I favor it to the downside. This stops in my eyes are this 340 ish zone that you see. I'll draw like a little box around it so that you can see again what my eyes are looking at this. Essentially that volume node becomes the next support line. And then it's already built a lot of overhead resistance potential. There's this volume node. And then there's this volume node for overhead resistance. So now it's we will see that's the way I look at it is see how it behaves around here, but",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 50,
      "start_timestamp": "01:10:30",
      "start_timestamp_seconds": 4230.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4230"
    }
  },
  {
    "text": "becomes the next support line. And then it's already built a lot of overhead resistance potential. There's this volume node. And then there's this volume node for overhead resistance. So now it's we will see that's the way I look at it is see how it behaves around here, but I don't like it. I think it looks at least I don't like it to the upside. Jonathan says Trump also mentioned bolstering US steel X is the ticker tariffs on incoming steel and aluminum. Yeah, well, that's that's the whole idea, right? Tariffs they're designed to try to spur domestic production. The problem is is again domestic production is more expensive. So in terms of how much they're actually able to produce will be really dependent on the price sensitivity of the primary consumers of whatever they produce in this case, whatever, you know, US deals primary partners are. So a fairly tricky prospect, I think. Oz he says cost going along with Jamie again means whatever happened back in June is still on the table. I think in general you're going to see a lot of those names move together. We've seen that correlation for some time now for GameStop. I'm really stoked to see again, a bit of a rally here, but I think it still is in a just really dangerous spot. So this essentially has become invalid and then I mean, it's still in a really big downward channel. It did break out and it",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 50,
      "start_timestamp": "01:12:40",
      "start_timestamp_seconds": 4360.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4360"
    }
  },
  {
    "text": "for GameStop. I'm really stoked to see again, a bit of a rally here, but I think it still is in a just really dangerous spot. So this essentially has become invalid and then I mean, it's still in a really big downward channel. It did break out and it broke above two of these, which I think is really important because there's not big volume nodes here yet, which is good. So now it's does it consolidate and we'll see obviously I'll make a GameStop video on it tomorrow. But yeah, definitely a little bit tricky. I think here. Coke. You mean Coca Cola? Kale? Or okay, so I'm just lexic? I assume you mean Coca Cola or do you mean something else with Coke? Kale, okay, yeah, that's what I figured. And I don't love it. I don't love it for either direction, to be honest. And this is again from a trading lens. The reason why I don't love it for downside or upside is that in my eyes, there's not like an easy win here. It broke out of that downward channel, which is good. It's starting to build successive higher lows, which is good. But and it doesn't have a ton of overhead resistance, which is also good for like a upside idea. But the question I always say to myself is always is like, you know, it's not can there be a trade. Like is there a trade? Is there something that's good? It's",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 50,
      "start_timestamp": "01:14:08",
      "start_timestamp_seconds": 4448.86,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4448"
    }
  },
  {
    "text": "and it doesn't have a ton of overhead resistance, which is also good for like a upside idea. But the question I always say to myself is always is like, you know, it's not can there be a trade. Like is there a trade? Is there something that's good? It's not can I put something on and I don't want to trade this to the downside because it's rallying. I don't want to trade this to the upside because it's gone from a low of 60 up to 64. So I really couldn't care less about that size of a move in a company this big. And it's really swimming upstream right now. So it does look like there might be a little bit of information that could have come out regarding earnings. And people might be front running it a little bit. So we can take a look at that really fast. There's definitely calls skew way more calls traded today. Most of them at the ask this to me looks like somebody knows something about earnings. And what would consolidate this down in my mind is if we see a lot of this activity in these front expirations. So right now earnings is on the 11th. So I wouldn't expect that necessarily to be in the 14 feb experee. That's simply because bigger entities need liquidity and there's less liquidity here. So if they're trying to trade this directionally through earnings a lot of them will go out",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 50,
      "start_timestamp": "01:16:01",
      "start_timestamp_seconds": 4561.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4561"
    }
  },
  {
    "text": "So right now earnings is on the 11th. So I wouldn't expect that necessarily to be in the 14 feb experee. That's simply because bigger entities need liquidity and there's less liquidity here. So if they're trying to trade this directionally through earnings a lot of them will go out to 21 feb, which we can see that there is definitely a bit of build out going on here. We can see that these at the money transactions are heightening up. And from last Friday to today, there's a pretty big on load. And you can see that today's volume is also very high. So all of that leads me to believe that there's a chance some information would have come out regarding its earnings. And people are trying to trade it from a bullish perspective. Let's take a look at the volume. 85 against 36. And yeah, sure, shit. Take a look at where most of them are. Love that 85 traded today. 52 are in the front two experee. So leads me to believe somebody is thinking something about earnings. And if I take a quick look on here, I just want to see what their previous earnings looks like. That previous earnings. Still within move though. This is something I trade pretty regularly actually from an earnings play perspective. It just doesn't move that much. But from a directional from a directional play. So to summarize all of that. Right now it's a mess. The moving averages",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 50,
      "start_timestamp": "01:17:20",
      "start_timestamp_seconds": 4640.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4640"
    }
  },
  {
    "text": "looks like. That previous earnings. Still within move though. This is something I trade pretty regularly actually from an earnings play perspective. It just doesn't move that much. But from a directional from a directional play. So to summarize all of that. Right now it's a mess. The moving averages are all fucked up like a football bat. They're just starting to reorganize. It looks like it's building a near term uptrend. So this really delicate stage can be traded to the upside. It just has to be traded really carefully. Meaning I wouldn't give it a lot of room to fall back down to the downside. I think it has earnings coming up on the 11th before the market. So tomorrow, AM, it looks like a bunch of people are positioning in this pre earnings move with the expectation of upside. It's because they do that. It doesn't mean it's going up. They can be wrong. But that's what it looks like is happening to me. And it's really not got a lot of overhead resistance. There's just not a lot of volume in here. So that part is good. It's not like fighting through a bunch of prior people. It will slow down when it gets up here, almost guaranteed if it gets up here. And that's just because a lot of people are probably feeling some type of way about it. Meaning the ability to get out at a profit. Now the other thing from a fundamental",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 50,
      "start_timestamp": "01:18:31",
      "start_timestamp_seconds": 4711.58,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4711"
    }
  },
  {
    "text": "people. It will slow down when it gets up here, almost guaranteed if it gets up here. And that's just because a lot of people are probably feeling some type of way about it. Meaning the ability to get out at a profit. Now the other thing from a fundamental perspective, it's really, really important. Remember is that Coca-Cola is within consumer staples. So if we take a look at the behavior of staples over here compared to discretionary over here, staples is been in a massive downtrend. So the weight of the broader sector is also bearish for consumer staples. So that serves as a natural headwind. This is something like Coca-Cola. So that sums up about two cents. All right, we'll take one more before I wrap up. Let me see really quick. So we were at like 116. 116. And this was K-O-N-L. Let's see. Dark Mark says, are you still on for a balance here? Yeah. So I still have my balance here position on. Palantir is a super easy trade. I again, I'll run through this more in detail tomorrow. But Palantir is a ratio call diagonal. So I do have the 21 March, 125s, the short calls. And those are still OK. They're obviously being challenged here. And then I have out in 16 Jan 26. That's where the long options are. So I'm really planning to play this for a much longer term idea. So that's what I'm seeing here. I like this.",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 50,
      "start_timestamp": "01:20:00",
      "start_timestamp_seconds": 4800.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4800"
    }
  },
  {
    "text": "the short calls. And those are still OK. They're obviously being challenged here. And then I have out in 16 Jan 26. That's where the long options are. So I'm really planning to play this for a much longer term idea. So that's what I'm seeing here. I like this. We'll review that trade way more in detail along with the rest of the portfolio. Like we normally do during the pro livestream tomorrow. But yeah, Palantir, I still think looks really good here. Just kind of monitoring it as it's trickling up. Not really because I'm intending to manage the long options really at all and planning on letting them go. But it's mostly because I want to opportunistically manage the short calls to pull in as much as I can. As always, they are at a ratio to make sure that there's uncapped upside profit potential. But they're paying a little bit now, especially because of the potential of a severe move to the upside. The wall on the call side looks pretty good. The skew is not bad. So that wraps me up, gang. Absolutely awesome. Hanging out. As per always, I'll see the pro members on Tuesday for those that are coming to hang out on Wednesday for the skilled development segment. I'll tell you exactly what we're doing. We're doing how to build trade exit plans. So that will be the session for Wednesday. Then Thursday there will be a case study on this. And",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 50,
      "start_timestamp": "01:21:34",
      "start_timestamp_seconds": 4894.94,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4894"
    }
  },
  {
    "text": "Tuesday for those that are coming to hang out on Wednesday for the skilled development segment. I'll tell you exactly what we're doing. We're doing how to build trade exit plans. So that will be the session for Wednesday. Then Thursday there will be a case study on this. And then on Friday for those that are joining for the outlier options trading basics, we are going into the Greeks. Now for the Greeks, I am going to give you a reference video first that I asked you to watch because I already did a pretty big video. It's like 20 minutes on the Greeks. I'll throw that in here and then I'm just going to leave that in here for my reference as well. But the reason being is because I want the video to focus way more on the practical side of the Greeks versus like understanding that the Greeks measure things like, okay, great. I want to be way more practical. So like actually using them to understand your positions better. That's the idea. As always, if you have any questions, let me know anything. Want me to take a look at you give me a via email. I try to pull in as much as I can into the live streams. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 50,
      "start_timestamp": "01:22:48",
      "start_timestamp_seconds": 4968.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=4968"
    }
  },
  {
    "text": "email. I try to pull in as much as I can into the live streams. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "PcQmBEYaFQ8",
      "title": "Steel Tariff Impact & Trade Opportunities - Stock Market Recap | Outlier Trading Live",
      "url": "https://www.youtube.com/watch?v=PcQmBEYaFQ8",
      "upload_date": null,
      "duration": 5051.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 50,
      "start_timestamp": "01:23:59",
      "start_timestamp_seconds": 5039.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PcQmBEYaFQ8&t=5039"
    }
  }
]