[
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you your theories you give yourself a pat on the back. If you made it to episode four of doing this on Fridays, that's pretty cool. The unbelievable amount of like forecasting versus doing is quite insane. People love the ideas of an output, but people don't typically embrace the process that goes into creating that output. It was literally just gonna post a screenshot at some point in the discord. I haven't got around to it, but I got a confirmation from my brokerage account on a wire transfer and it was for a quarter million bucks. And the funny thing is, I distinctly remember the first time that I moved that kind of money, that it felt like significant. It felt like, okay, like I literally ammoving of quarter million dollars, this or half million dollars, this is a lot of money to move. I feel something, right? Like it causes something, but then like at this point, it's just like, okay, capital is going in and out of the account. It really doesn't make me feel any type of way. The funny thing about that is, I know for a fact, if I asked how many of my peers, so people that I went to high school with, people that I",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 712.36,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "capital is going in and out of the account. It really doesn't make me feel any type of way. The funny thing about that is, I know for a fact, if I asked how many of my peers, so people that I went to high school with, people that I went to college with, people that I was in the Marine Corps with, like all these people, if I asked most of them, hey, what's the most amount of money you moved? And it's not some sort of flex, but it's just being at a different spot. My guess is the overwhelming majority of them would probably never have moved anything even close to that. And that, again, to me, is reminder of this, whatever for to is the outlier mindset. It's embracing doing the things that other people don't want to do. And by doing that, you open up a world that is not open to other people. And if you do a good job at it, that's the whole idea of this thing, is that there is a payoff. You're doing stuff that other people don't want to do. So shout out to you guys. It looks like we got brain, we got Kirk, we got Sigma, great to see you all. So the session today episode four is about building a balanced portfolio. Now, I'm gonna give you a very, very quick overview of the prior sessions. And I will have links in the description of the",
    "start_timestamp_seconds": 694.96,
    "end_timestamp_seconds": 793.16,
    "start_timestamp": "11:34",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=694",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "we got brain, we got Kirk, we got Sigma, great to see you all. So the session today episode four is about building a balanced portfolio. Now, I'm gonna give you a very, very quick overview of the prior sessions. And I will have links in the description of the sessions before so that you can go through and easily see them. They're actually all in a playlist. In case you don't know, there's a playlist on the YouTube channel called, think it's basics. Like, I'll tell you right now, exactly what the name of it is. Give me one second. Because outlier, options trading basics. And the reason why I made an entire playlist of this is to give you a consolidated place to check out the different streams that we do relevant to this material. So they go right there. I just threw that in there for you as well for the prior episodes. And we've covered kind of a lot so far. That's why I like doing these more focused seasons where we have a clear agenda. So let's talk about what we've discussed. The first episode was turning a market view into a trade. This is the idea of, how do we look at something going on in the market? And then how do we find a way to an express and idea on that and make money? Funny enough, what we're gonna talk about today is really several instances of that, combined with a few",
    "start_timestamp_seconds": 767.88,
    "end_timestamp_seconds": 864.6,
    "start_timestamp": "12:47",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=767",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "the idea of, how do we look at something going on in the market? And then how do we find a way to an express and idea on that and make money? Funny enough, what we're gonna talk about today is really several instances of that, combined with a few other things like risk management. The second episode was using the Greeks to guide decisions. This is a piece that is part and parcel to trading options. It's the fact that as soon as you touch an option, you are adding complexity. There are now other factors that influence the piano of your trade and sometimes people don't even really understand them as they're doing it. Great example of this is the people who buy a call and the underlying goes up, get their flat or they lost money. And that could be because time has passed with the combination of vault dropping. But if you don't understand the instruments, it's a really poor way to try and capitalize on an idea and make money because it's a great way to do something that might have been right otherwise but end up losing money. The Greeks are designed to help navigate that entire world. Episode three was about managing in exiting trades. This is when we make decisions in terms of, how are we going to make decisions about this position that's currently on? What's the framework that we use around it? So for example, the way that I will",
    "start_timestamp_seconds": 849.32,
    "end_timestamp_seconds": 936.64,
    "start_timestamp": "14:09",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=849",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "navigate that entire world. Episode three was about managing in exiting trades. This is when we make decisions in terms of, how are we going to make decisions about this position that's currently on? What's the framework that we use around it? So for example, the way that I will manage a coverage triangle in an index ETF is very different than the way that I manage an earnings play or the way that I manage trading volatility in the indices or the way that I manage breakouts or break downs. And so on and so forth. The point that I'm emphasizing there, and a big thing that we covered in the last episode is this idea of taking the time to understand what the profit mechanism is that you've built a strategy around so that then you can make good decisions about how you manage those individual positions. Again, this is a really simple concept that most people jump right over in the hope of making a bunch of money. Typically, it doesn't work out that well. Now for today, building a portfolio, the goal in this is to give you an idea on how you can start structuring an actual portfolio. So we have to start with a few level setting concepts. The very first one is that we are going to have to agree on a couple key traits, one of them being in account size which you guys will pick, and then we need to discuss",
    "start_timestamp_seconds": 917.84,
    "end_timestamp_seconds": 1024.64,
    "start_timestamp": "15:17",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=917",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "an actual portfolio. So we have to start with a few level setting concepts. The very first one is that we are going to have to agree on a couple key traits, one of them being in account size which you guys will pick, and then we need to discuss goals. So let's do that now together. In the chat, do me a solid. What size portfolio in terms of dollars, do you want to discuss for this stream? It could be whatever you want, put whatever number you want in the chat, and then I'll pick whatever it seems to fit the majority of the best. So do that now, please. And as you're thinking about that, the next question is going to be, what is our goal? Meaning, what are we trying to accomplish? Which is interesting, my guess is a lot of people probably don't even think about the markets that way, which I'll explain why that's an important concept. So right now, I see 100K, 200K, 10K, keep, we need a couple more, and then I'll pick, I'll really just pick something 30K. Okay, so what I'll do is, well first, let's talk about these account sizes because I think this is worthy of a small discussion by itself. First, we got to find a section on the end. This scratch sheet is starting to get a little unruly. I got shit everywhere. Okay, this spot looks good. We can move these things over. Is this",
    "start_timestamp_seconds": 1007.08,
    "end_timestamp_seconds": 1111.4,
    "start_timestamp": "16:47",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1007",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "sizes because I think this is worthy of a small discussion by itself. First, we got to find a section on the end. This scratch sheet is starting to get a little unruly. I got shit everywhere. Okay, this spot looks good. We can move these things over. Is this for? Okay, so we'll get rid of that. Great. Made us some space. Sure, we'll get rid of this stuff too. Perfect. So let's talk about some of these account sizes because this is actually the really, really important starting point. If I think about what are the major differences between account sizes, we have the first difference, which is when you can get margin, which is reg T, this is the basic margin account. I honestly couldn't tell you what sizes to count as. I don't know. I don't think it's a lot of money. I think it's a few grand, but I don't know. I'm gonna guess maybe like 5K, you guys can correct me if I'm wrong, but I don't know. Then after regulation T, the next key threshold is when you have access to what's called portfolio margin. And I'm also not gonna lie, I don't know when this is. I'm gonna guess, I think it's 150K and then maintenance is you have to keep more than 125 if I'm not mistaken. But again, you guys can correct me if I'm wrong. These will be ballpark correct. These are the two like big differences. After these",
    "start_timestamp_seconds": 1084.88,
    "end_timestamp_seconds": 1190.44,
    "start_timestamp": "18:04",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1084",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "know when this is. I'm gonna guess, I think it's 150K and then maintenance is you have to keep more than 125 if I'm not mistaken. But again, you guys can correct me if I'm wrong. These will be ballpark correct. These are the two like big differences. After these two differences, the next major difference really comes at like the 500K level. Once you get to 500K, the reason why there's a pretty big gap here is because the kind of things that you can do with half a million in above do differ than sub 500K. This is in terms of how you can, what kind of strategies you can even trade. And I'll explain that in a moment. If we brainstorm, oh, here we go, thank you. Reggie says 25K for day traders, thank you. That's absolutely awesome ad. I always forget that one, thank you. So 25K is for PDT to go away. Now again, the reason why I normally skip that one to be completely straightforward is I actually don't think, I don't like regulation. I think people should be able to make their own choices. But I do not think that traders with sub 25K, I don't even think traders with like 50K should really be specializing and really focusing on super short-term timeframes. I literally think it's to their own detriment. So yeah, I typically skip that one, but it's an important one. Now, one thing to note about PDT is that you",
    "start_timestamp_seconds": 1171.12,
    "end_timestamp_seconds": 1278.04,
    "start_timestamp": "19:31",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1171",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "25K, I don't even think traders with like 50K should really be specializing and really focusing on super short-term timeframes. I literally think it's to their own detriment. So yeah, I typically skip that one, but it's an important one. Now, one thing to note about PDT is that you do have choices, it's not that you can't like close trade, you can close trades. But the issue there is very frequently, you cannot open up as many as you want, which is a issue. And this looks like, Kirk is saying you need 125K. Let me ask, I'm curious if it's different by broker. What account size is needed for portfolio margin in the US by broker? I'm curious if there's any difference, I don't know. But we'll find out, good old chatchipyt5.1, what tell us? Okay, so interactive brokers, it is different. So interactive brokers is 110, Schwab is 125, tasty is 175, and a maintenance of 150. So it is different, very interesting. So yeah, anyways, you just heard those numbers. portfolio margin literally is different based on your broker. And then there's this threshold over here. Okay, let's talk about the practical implications. If I'm gonna try to put on a certain number of positions, which we're gonna talk about in an entire framework, how to think about all this. I'm just trying to prime your mind on the differences in these numbers. I already know, effectively between, oh shit, effectively between all of these, I",
    "start_timestamp_seconds": 1255.2,
    "end_timestamp_seconds": 1371.68,
    "start_timestamp": "20:55",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1255",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "try to put on a certain number of positions, which we're gonna talk about in an entire framework, how to think about all this. I'm just trying to prime your mind on the differences in these numbers. I already know, effectively between, oh shit, effectively between all of these, I am gonna run into the constraint of capital before I likely will hit any other constraint, meaning I'm gonna run out of money before I run out of like, until I get into all the positions that I want. Once you get into really the 500,000 plus, more often than not, your main constraint here is actual whatever for to is imperative. What are you trying to do? Whereas this, the constraint is gonna be capital. So the difference here is, if in a 500,000 dollar account, if I wanna put on 50 positions, I easily can. If I wanna put on 50 positions in a 5K account, I am severely limited in how I can possibly achieve that. So the way that we build these different accounts, changes quite a lot. So I wanna start with talking about these different account values and giving a framework on how to think about this. So I'm gonna start with like 25K and down. 25K and down no matter what, you are taking lopsided risk. What that means is you have to accept the fact that you are gonna be pretty much oversized, always. This is just the reality for this size",
    "start_timestamp_seconds": 1352.64,
    "end_timestamp_seconds": 1459.48,
    "start_timestamp": "22:32",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1352",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "think about this. So I'm gonna start with like 25K and down. 25K and down no matter what, you are taking lopsided risk. What that means is you have to accept the fact that you are gonna be pretty much oversized, always. This is just the reality for this size account. You're pretty much almost always oversized. So what that means is, if it were me trading a 25K account ish, I'm genuinely gonna take one of two approaches. I'm either gonna go balls to the wall and it's either gonna be lambo or broke. And I'm not recommending that. I'm just saying that is one of the two routes you can take this thing. You either go lambo or broke and you just accept the fact that this 25K is probably gonna fucking go away if you go that route. The second route is to focus more so on fundamentals on fundamentals in process, not to grow this 25,000 dollar account necessarily, because the way that you're gonna grow this 25K account like way more profoundly than anything else is by saving. So this one saving matters a ton and the way that I think about this is focusing on a process. The purpose of the process is that as your 25 account inevitably grows to a 50K account and then grows again to a 250K account and then grows again to half a million and so on and so forth, you are already building the experience that you're",
    "start_timestamp_seconds": 1438.24,
    "end_timestamp_seconds": 1536.52,
    "start_timestamp": "23:58",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1438",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "on a process. The purpose of the process is that as your 25 account inevitably grows to a 50K account and then grows again to a 250K account and then grows again to half a million and so on and so forth, you are already building the experience that you're going to leverage here, gear and here. If you don't do this and if you play the game of lambo or broke, which again, I'm not shitting on it, I'm saying do whatever's right for you. But if you play that game, what happens is you eventually go broke. What that means is let's say you do go lambo or broke and let's say that this 25K does turn into 300K. That's awesome, that's sick. But the problem is is the way that we got there is through pure degeneracy. So then the probability of us going like a millionaire or broke off of this, it increases each time you play this game, you spin the wheel, it increases the probability that you land on an unfavorable spot and go fucking broke. So when you see somebody for those that are used to a game stop and the whole game stop thing, when you see somebody like Warren Kitty, it's actually really important to understand what he did because what he didn't do is say I have $25,000, I'm gonna go all in on game stop with my $25,000. That's not what he did. He took a certain amount of",
    "start_timestamp_seconds": 1517.88,
    "end_timestamp_seconds": 1611.12,
    "start_timestamp": "25:17",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1517",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "stop thing, when you see somebody like Warren Kitty, it's actually really important to understand what he did because what he didn't do is say I have $25,000, I'm gonna go all in on game stop with my $25,000. That's not what he did. He took a certain amount of his total money here and he broke off a small piece of it and then he said I'm using that amount so that if this is billionaire or broke, if it did go break, he wasn't fucking over his family, he was still gonna have plenty of money to work with in here in order to continue growing. Really important caveat there. Because a lot of people that try to mimic what he's doing, which again is whatever, do whatever's right for you, but they're doing it with all their fucking money. That's not what he did. And that's a really important factor in how he was able to treat it the way that he treated it because he already had something else going for him and he was in a good spot. So that allows a completely different mindset to go into this versus the person that's like I'm gonna make a fucking car payment or I gotta pay my mortgage or pay my rent, whatever. So this is 25K. Then after this, I would say pretty much, I'll just bubble all of them until like 250K in below. 250K in below in here. This is really when you're",
    "start_timestamp_seconds": 1592.64,
    "end_timestamp_seconds": 1682.56,
    "start_timestamp": "26:32",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1592",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "gonna make a fucking car payment or I gotta pay my mortgage or pay my rent, whatever. So this is 25K. Then after this, I would say pretty much, I'll just bubble all of them until like 250K in below. 250K in below in here. This is really when you're pretty much able to execute but you still have to execute within a logical structure for how much money you have. This is where you'll have the ability to have how I split my portfolio, core and speculative. And this is where you'll be able to implement multiple strategies at the same time, which is great. And then beyond that, it like I said, it's kind of whatever you want. So based on the numbers, I'm gonna start us with I can one other person, I see another person, Reggie, can one other person put in a number that you guys wanna work with? And then I'll be able to break the tie. I'm essentially seeing if we're gonna do three digits or two digits. So for the example that we're gonna build together, what size portfolio do you guys wanna use? 100K, okay perfect. So that looks perfect. Because that's also scalable for pretty much everybody. And I still think that that's small enough that you will, why the fuck am I raising all that one by one? So we'll do 100K, I like that. Let's begin this process pretty much how I would. I would start with my",
    "start_timestamp_seconds": 1661.76,
    "end_timestamp_seconds": 1767.12,
    "start_timestamp": "27:41",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1661",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "that's also scalable for pretty much everybody. And I still think that that's small enough that you will, why the fuck am I raising all that one by one? So we'll do 100K, I like that. Let's begin this process pretty much how I would. I would start with my portfolio value, Evalue, which is 100,000. Awesome. Now the way that I would begin this exercise is by defining my goals. What's my goal? So that includes a target return. What's my target return? What am I trying to hit at the end of a year? Let's say that I've been trading for a little while and my goal gets to be greater than zero. And for those that might not know what I'm referring to, the way that I think about this personally is if we put on a time series, this is zero. This is your one, this is your two, this is your three and then we'll just go to like five plus. When you're in this range here, you don't get to have a goal. Your goal is greater than zero. Walk out and don't lose money. If you can do that for your first two years while aggressively saving, you're gonna be so far ahead of pretty much the overwhelming majority of other people that are trying to go lamb or broke. Some of them will make it. And sometimes seeing that will make you think, like fuck, I'm moving too slow. I'm not doing",
    "start_timestamp_seconds": 1746.92,
    "end_timestamp_seconds": 1844.68,
    "start_timestamp": "29:06",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1746",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "years while aggressively saving, you're gonna be so far ahead of pretty much the overwhelming majority of other people that are trying to go lamb or broke. Some of them will make it. And sometimes seeing that will make you think, like fuck, I'm moving too slow. I'm not doing this quick enough. The problem with that is the likelihood of making that happen is very low. So you might see the one in 200 that breaks through and actually makes it, but you're not seeing the 199 that also tried and failed. This is a survivorship bias. You have to be very, very thoughtful about that. So my typical pitch here is that literally for your first entire two years of trading, greater than zero, you don't get to pick a goal, greater than zero. That's all you get to pick. Then you're two to like five, the way that I would approach this is one of two methods. The first one is pace the market, which is fine. The second is depending on what your returns did look like during these years, maintain pace, either of those are fine. Then once you start getting to like four years after you have another two years of good data, that's when you can kind of make logical decisions. You'll have a pretty good understanding of like, what are you capable of? And understanding what your capable of will inform a lot about what your return target is. So for example,",
    "start_timestamp_seconds": 1824.96,
    "end_timestamp_seconds": 1930.64,
    "start_timestamp": "30:24",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1824",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "after you have another two years of good data, that's when you can kind of make logical decisions. You'll have a pretty good understanding of like, what are you capable of? And understanding what your capable of will inform a lot about what your return target is. So for example, it's very reasonable to have a 20% return target that's super reasonable. It's even reasonable of a 25% return target. Does that mean that you're always gonna hit it, probably not. But like those are reasonable. That said, they're completely unreasonable for a new trader. A new trader, your goal is greater than zero. So with that, I'm gonna say that our target return is my instinct would be like 10%. But I know that as soon as somebody sees 10% here, they're gonna think like, man, that kind of sucks. But that's the reality of this thing. If you're in this window, that ain't a bad return. The one thing to keep in mind is especially if you're actively trading, not only do you have to overcome the friction and taxes that you're inducing by actively trading. But you also take on all of the potential downside. So if you can decrease the total volatility in your portfolio, it will actually scale faster long term. The last thing I wanna note on this before we open a new tab, apparently. What the fuck did I do? Okay. Back to our spot. The last thing that I wanna say on",
    "start_timestamp_seconds": 1912.92,
    "end_timestamp_seconds": 2010.24,
    "start_timestamp": "31:52",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1912",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "you can decrease the total volatility in your portfolio, it will actually scale faster long term. The last thing I wanna note on this before we open a new tab, apparently. What the fuck did I do? Okay. Back to our spot. The last thing that I wanna say on this is I want you to think about this starting point that we're discussing here like this. In terms of impact, you start here. So this is time and then this is impact. Meaning how much you can grow your money. It works like this. It kind of starts, well really. It starts really, really slow, really, really flat, little bumpy. And then it really genuinely begins to go absolutely parabolic. My approach to trading is not to go from year zero to parabolic. That's not to say it's not doable, but that wasn't my approach. The way that I think about this is simply to try to shift this parabolic to the left, not all the way to the left. So instead of this, maybe the parabolic stage starts here. Because if you get to this a little bit earlier, it will have a profound impact on your life. All right, that's all about goal setting. Because what I can tell you is a massive mistake is if you say, well, in order to grow my $100,000 account into the amount of money that I need, I need to get a 50% return or a 30% return. That's not",
    "start_timestamp_seconds": 1986.76,
    "end_timestamp_seconds": 2097.56,
    "start_timestamp": "33:06",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=1986",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "All right, that's all about goal setting. Because what I can tell you is a massive mistake is if you say, well, in order to grow my $100,000 account into the amount of money that I need, I need to get a 50% return or a 30% return. That's not good. That's a bad approach. Because the overwhelming probability is that in the pursuit of that 50% return, you are probably going to lose your money. And then the only thing that you've done is move your starting point backwards. You're probably not going to have a whole lot to show for it because in order to get a 50% return out of the jump, you're going to probably super reckless, not have much of a plan. And again, think of what goes into successful trading. A lot of work. You have to learn. And nobody is that learned within five years. It's just not happening. Now, you can rapidly increase your knowledge and experience for sure. But it takes time. That's just the reality of this thing. And you kind of have to embrace that because if you try to go too far to the right and try to like over aggressively move this, you set yourself up for a pretty significant issue. And I'll show you why. This, if you think about how long it takes to develop mastery in something, think of something else you're really good at. If you played sports in high school, if you",
    "start_timestamp_seconds": 2080.72,
    "end_timestamp_seconds": 2178.28,
    "start_timestamp": "34:40",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2080",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "like over aggressively move this, you set yourself up for a pretty significant issue. And I'll show you why. This, if you think about how long it takes to develop mastery in something, think of something else you're really good at. If you played sports in high school, if you do whatever, think about how much time you spent and write example, actually, because the majority of people that played sports in high school you probably weren't at the top. There were probably people better than you. Yet you probably went to a similar, if not more number of practices had coaching and all that kind of stuff. But in order to really develop a really strong understanding of what you're doing, it effectively takes five hours every single day for five and a half years, five hours every single day, five and a half years. The point that I'm making is that this is completely doable. This comes down to pressure over time. But what doesn't work well is when people try to accelerate this too quickly for themselves, and then they blow up, that doesn't help you. So when we're talking about in discussing this goal setting step, be thoughtful about what you're attempting to accomplish. So in here, let's start with a 20% return. Let's say that you've been trading for four years and your first two were greater than zero, and let's say that your next year or so, you're noticing that you're able to slightly",
    "start_timestamp_seconds": 2151.84,
    "end_timestamp_seconds": 2259.56,
    "start_timestamp": "35:51",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2151",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "be thoughtful about what you're attempting to accomplish. So in here, let's start with a 20% return. Let's say that you've been trading for four years and your first two were greater than zero, and let's say that your next year or so, you're noticing that you're able to slightly outpace the market. So we're targeting 20%. What does that equal in terms of dollars required? I'm literally showing you how to build your own version of this in order to make the decision yourself. You need to make three October dollars. If no idea why there's so many dates stuck in this thing, but there are. So this is how we apparently view the world here. We need 20 grand. So then if I break this down to a monthly return target so that I have a general ballpark of what I need on a monthly basis, I need 1667. Now again, this is not factory infriction. This is not factory in taxes, missions, fees, all that stuff. But what I've done here is I've given myself a starting point. I am now not approaching the market blind. I'm not opening up a brokerage platform just throwing off trades. I now have some sort of target to shoot for. Again, whether or not I hit this target, another story. But in marksmanship, we have a saying, aim small, miss small. What that means is if I'm shooting at a target that's 500 yards away and let's say the bull's",
    "start_timestamp_seconds": 2236.12,
    "end_timestamp_seconds": 2343.04,
    "start_timestamp": "37:16",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2236",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "I now have some sort of target to shoot for. Again, whether or not I hit this target, another story. But in marksmanship, we have a saying, aim small, miss small. What that means is if I'm shooting at a target that's 500 yards away and let's say the bull's eye is this big. If in my mind, I'm just trying to be anywhere in this bull's eye, anywhere spine, I'm aiming at the entire bull's eye. I'm probably gonna be all over the place. So a lot of times what we do is we try to be dead center on the bull's eye. And then as soon as your dead center on the bull's eye, the next shot, you're trying to just put it through the previous hole, that's your goal. This shot through this previous hole, this is if you're emphasizing accuracy. It changes if you're emphasizing speed or movement, this is just accuracy. The point that I'm making here is having something that you're targeting, something that you're shooting for, is super, super important. If you do not have that, you're probably not gonna have enough for a scorn, you're gonna have too much risk on and it's gonna be completely fucking random. That doesn't work well. Let's continue one more step. The way that I personally would think about specifically a $100,000 portfolio is I do think we get to split this up. So I would make a core and speculative allocation. In my world, the",
    "start_timestamp_seconds": 2327.84,
    "end_timestamp_seconds": 2425.52,
    "start_timestamp": "38:47",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2327",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "it's gonna be completely fucking random. That doesn't work well. Let's continue one more step. The way that I personally would think about specifically a $100,000 portfolio is I do think we get to split this up. So I would make a core and speculative allocation. In my world, the reason why I differentiate these two is in the long run, my core allocation should get me to my target in the long run. That doesn't mean on every single month, means in the long run. So in my portfolio, the core allocation, typically is the coverage triangle in some sort of index ETF. The reason for doing this is because if I've really fucked up, I still am probably gonna be okay. I'm not saying you have to be this conservative. Again, for those unfamiliar with my background and how I started in this whole thing, the Cliff Notes version is I came to the markets with scarcity as my background. So the risk of losing money in disproportionately skewed my decision making, compared to my ability to make the commensurate amount to the upside. So that's why I've always split out my portfolio into a core and speculative, because if I'm trading something like a coverage triangle in an index ETF, if I really fuck it up, I might end position is either flat in profit or holding shares of an index ETF. I'm fine with either of those scenarios because in the long run, it bears out.",
    "start_timestamp_seconds": 2396.24,
    "end_timestamp_seconds": 2513.52,
    "start_timestamp": "39:56",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2396",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "because if I'm trading something like a coverage triangle in an index ETF, if I really fuck it up, I might end position is either flat in profit or holding shares of an index ETF. I'm fine with either of those scenarios because in the long run, it bears out. What does that look like this? If I zoom us out over a five year weekly period, what do we see? We see that the market is absolutely had some dips. And some of these dips went for some time. Some of them went longer than others, like the bear market that we had in 22. But what happened after the bear market in 22, we've had a parabolic run up afterwards and it's continuing. What I'm iterating here is that by starting with this as my core allocation, I'm positioning myself to be pretty damn close to this target without hurting myself if I fuck it up. So I would attach a percentage here. And let's say my starting percentage is 75%. That means of this total $100,000, my core allocation is gonna get 75 grand. Now let's add the speculative, which will be the residual 25% that will obviously give us 25 grand. This is how much money I have to use in both of these allocations. I'm gonna take a pause here. Does anybody have any questions on what we've talked about so far? Do you understand the idea of generating some sort of return target? Do",
    "start_timestamp_seconds": 2496.92,
    "end_timestamp_seconds": 2602.0,
    "start_timestamp": "41:36",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2496",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "obviously give us 25 grand. This is how much money I have to use in both of these allocations. I'm gonna take a pause here. Does anybody have any questions on what we've talked about so far? Do you understand the idea of generating some sort of return target? Do you have an understanding of that timeline that I gave you? Does the idea of breaking your annual target into smaller milestones makes sense? Do you have any questions about the core versus speculative allocation? We'll get more into detail on that. But at least in terms of what you've seen so far. This is the bedrock for the rest of our decision making. Notice how the start of this stream didn't go into, hey, here, let's add these five positions to the portfolio. There you go, that's how you build a portfolio. That's bullshit. Sure, that's a way to build a portfolio. But that's not something that's gonna sustain you longer term doing this. This planning is let's continue. Up into this point in the prior episodes, we discussed a couple really important concepts with respect to strategies. Reggie says the idea of being oversized with a smaller account means you would only do the core position no speculative. That's a great question. Reggie, could you give me an example of the account size that you're thinking of in that scenario? Because I can give you, I can give you like a specific answer rather than a generalized one.",
    "start_timestamp_seconds": 2584.28,
    "end_timestamp_seconds": 2687.16,
    "start_timestamp": "43:04",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2584",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "means you would only do the core position no speculative. That's a great question. Reggie, could you give me an example of the account size that you're thinking of in that scenario? Because I can give you, I can give you like a specific answer rather than a generalized one. Because the idea of being oversized, yes, that's granted, but I wanna 45K. No, I think with the 45K account, you can still absolutely do core and speculative. For sure. I would say the point where you really have to make that decision between core and speculative is if you're like five K. And here's why, again, that's why I made this as a calculator so that we could play with some numbers. If I throw in $5,000, what do you see? I have 3750. If I think about any sort of index ETF, there isn't any that I can think of that I could get into 100 shares for 3750. I can't get one iteration of a coverage triangle on in here. Let alone trade the actual coverage triangle, which realistically requires at least 101 shares of equity and enough for a short put. So think 201 shares total, not even close. So that doesn't mean that you can't trade it this way, but it does mean that the way that the core allocation will look will probably a lot different. Maybe instead of doing a coverage triangle, you're forced to do some sort of ratio diagonal. The problem",
    "start_timestamp_seconds": 2668.84,
    "end_timestamp_seconds": 2765.68,
    "start_timestamp": "44:28",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2668",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "not even close. So that doesn't mean that you can't trade it this way, but it does mean that the way that the core allocation will look will probably a lot different. Maybe instead of doing a coverage triangle, you're forced to do some sort of ratio diagonal. The problem is if you're running this with some sort of ratio diagonal, you can get fucked. So a great example of a ratio diagonal that would not work well. Let's go here. Let's go to one Jan in 22. We're gonna go back in time, jumping the time machine with me. And I just wanna show you a quick example. Let's go to one Jan of 22. I guess three Jan. And let's see. Kirk says SPYG, but low volume, no, you can't even do that with SPYG. That's my point, you can't even do it with SCHD. So go to SCHD. It's 2724. Again, take a look at what our position is. We have 3750. So if we have 2724, we need, let's call it 101 shares for the equity side of the equation. And then we need another 100 shares. So let's go and let's see, at the 27, you would have to be, which is a 35 delta. So then you would have 27, and you would have another 100 here. You see my point, you don't have enough money. You don't even have enough money in the entire account to do this to run a coverage triangle.",
    "start_timestamp_seconds": 2746.32,
    "end_timestamp_seconds": 2864.44,
    "start_timestamp": "45:46",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2746",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "you would have to be, which is a 35 delta. So then you would have 27, and you would have another 100 here. You see my point, you don't have enough money. You don't even have enough money in the entire account to do this to run a coverage triangle. So yeah, these won't work. So that's SCHD, SPYG, I'm pretty sure is even more expensive. Yeah, that's 104, it's not even close. You can't even get one. This one, you need significantly more capital. That's the trick with small accounts is you run out super, super fast, it's just how it goes. So back to our example, let's go to SPY and let's say that you don't have the capital, right? Let's say that you look at this, you're like, okay, I got 3750. And I want some sort of index exposure, but I can't buy 100 shares to trade a coverage triangle. Let's see if we can get into anything that's within our budget. We can. If we go out here, I can effectively go at the money the 485. If I look at the 485 calls, there are 58 delta. I can grab these. They will use most of the capital that I have, but I can snag them. I'm gonna get them for, let's call it, like the mid-between these, we'll call it 3050. Let's say that I grab 3050. That's gonna be my premium and we're looking at the 20 Jan 485 calls. So 20",
    "start_timestamp_seconds": 2847.36,
    "end_timestamp_seconds": 2951.36,
    "start_timestamp": "47:27",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2847",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "most of the capital that I have, but I can snag them. I'm gonna get them for, let's call it, like the mid-between these, we'll call it 3050. Let's say that I grab 3050. That's gonna be my premium and we're looking at the 20 Jan 485 calls. So 20 Jan and these are the 485s. Let's just fast forward some time. I wanna go forward a bunch, just like most of the year. Let's go to one of the expires in January. Let's go to, let's go to January. Gonna like what December 30th. That'll be, yeah, 21 days before they come out. And let's see what our option is trading for. We bought it for 3050. It's trading for one penny. This is an example where even though the market does go up in the long run. It does go up in the long run. But if you have a small account and you miss time, your entry on something like this, you are fucked. You're fucked because you just blew up the majority of your account. 70% of your account is now gone. You play a good idea. Long-term market go up. You play a good idea. But when you use options, as we talked about before, you're adding complexity. You're adding a time-bound element. So even though the S&P 500 is made or a recovery and then some, you're fucked. It's gone. So if you had shares, you would have made money by now because you",
    "start_timestamp_seconds": 2931.4,
    "end_timestamp_seconds": 3045.0,
    "start_timestamp": "48:51",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=2931",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "But when you use options, as we talked about before, you're adding complexity. You're adding a time-bound element. So even though the S&P 500 is made or a recovery and then some, you're fucked. It's gone. So if you had shares, you would have made money by now because you could hold, you could stick it out long enough. You can't do that with this. Now if you go to roll it to regain your exposure, now you have 750 bucks that you can use. That's my point. So if you're going to use some sort of holding strategy with leaps for a levered long exposure to an index, there has to be a timing element to it. It cannot just be leaps and hold through anything. You cannot accept that risk with a smaller account. With a bigger account, you really can accept that risk and you can manage it differently. Should still time it. But you can manage it differently. The purpose of this exercise is just to give you an example that with a smaller account, you're limited. If you make too many sacrifices with a smaller account, you're going to put yourself in a really compromised position. If it were me starting over again with this $5,000 account, there's a few ways that I would think about it. If I'm thinking about what I know now and honestly how easy it is to make money, not in terms of trading necessarily at that point. But in",
    "start_timestamp_seconds": 3025.92,
    "end_timestamp_seconds": 3116.28,
    "start_timestamp": "50:25",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3025",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "position. If it were me starting over again with this $5,000 account, there's a few ways that I would think about it. If I'm thinking about what I know now and honestly how easy it is to make money, not in terms of trading necessarily at that point. But in terms of life, it's way easier to make money than I ever thought it was. And that's, I'm not talking about what I do now. I'm talking when I was on active duty in the Marine Corps and doing a bunch of side stuff. I didn't realize how easy it was to make money. I was overly conservative. So going back and thinking what I knew at that time, I would focus on something that I really, really believed in that I think would likely go up in the long run. My mind immediately goes to tech. I would personally be looking at probably trying to get a coverage triangle on in something like Excel K. Now again, at this point, literally can't do it. Too expensive. But when I was first starting something like this would be way more accessible. If this isn't doable because that index is too expensive, the next thing that I would do is see what are the primary constituents in here and then can I get into any of the constituents that I think are really, really solid? Here's how I would approach this problem set. We go into S&P and we go into",
    "start_timestamp_seconds": 3094.48,
    "end_timestamp_seconds": 3178.92,
    "start_timestamp": "51:34",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3094",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "expensive, the next thing that I would do is see what are the primary constituents in here and then can I get into any of the constituents that I think are really, really solid? Here's how I would approach this problem set. We go into S&P and we go into tech. And I just look to see if there's anything in here that I generally like that could be gotten at a reasonable price. And as I flip through these, again, for a smaller account, it's literally no every single time so far. All of these are $5,600. There are all just way too much. I'm just explaining literally the exercise I would do. Markets do change things collapse. So you might get in at a reasonable time. Jen is the only one that's even remotely close so far with a last price of 20, 7, 60. I'm seeing if anything else even looks reasonable. I saw 131 Cisco is 78. So Cisco, you can have like a partial coverage triangle on but not a full thing, S&C I. So S&C I is the closest thing that I would probably like and after that, the really just is a much. So the next thing that I would do is effectively say, based at this point in time, there isn't anything that I really like in there that I could build a meaningful position. So the way that I would think about this next is I know I need a timing",
    "start_timestamp_seconds": 3161.08,
    "end_timestamp_seconds": 3260.68,
    "start_timestamp": "52:41",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3161",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "So the next thing that I would do is effectively say, based at this point in time, there isn't anything that I really like in there that I could build a meaningful position. So the way that I would think about this next is I know I need a timing element. Now again, this is going down a pretty deep rabbit hole on a small account. But I think a lot of people have a small account. And the goal is to try to give some color around that and then I'll pivot back to the $100,000 account. That's much easier. In the small account, I'm looking at this and I'm saying to myself, I really can't find anything that I like at the more conservative level. So the index ETFs, the sector ETFs, stuff like that. The next thing that I would look at and is a pretty easy way to identify stuff. I was actually downloading data in here for another study that I'm working on, is I would look at stuff based on a momentum factor. And I would sort this based on momentum and I'm looking for stuff like this, like P-GEN. What is P-GEN? Let's go to P-GEN. And I got to zoom this in. This is out really far. This. This looks okay. Rather than trading the coverage triangle in the stuff that I really would prefer to, I'm forced to accept other stuff. This would qualify. This is exhibiting actually really solid momentum.",
    "start_timestamp_seconds": 3245.0,
    "end_timestamp_seconds": 3338.0,
    "start_timestamp": "54:05",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3245",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "go to P-GEN. And I got to zoom this in. This is out really far. This. This looks okay. Rather than trading the coverage triangle in the stuff that I really would prefer to, I'm forced to accept other stuff. This would qualify. This is exhibiting actually really solid momentum. It's up over the last year, six months. It's very persistent momentum. This is where I would look. And if I was going to do a coverage triangle, I would build with stuff like this. Cheaper names that I can see clear momentum. That's the starting point. Next is deciding how I'm going to manage the risk. With a smaller portfolio, I would pay very close attention to this next egg. I would have to have very centralized positions, things that I like, and things that I can manage risk in. What I wouldn't be doing with this small portfolio, $5,000 is trading a million vertical spreads. They're fucking useless. You're not going to make a lot of money on them. They're really not going to help you that much. Does that mean that we can't add wings if we need to. We can. But in general, I would seek to avoid those. And I would literally build a portfolio based on these. Because you can't even get that many on. You can get a few. And that's kind of the cool part. If I look at PGen, this is 485 bucks to get 100 shares. You double that. You're",
    "start_timestamp_seconds": 3315.28,
    "end_timestamp_seconds": 3409.28,
    "start_timestamp": "55:15",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3315",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "to avoid those. And I would literally build a portfolio based on these. Because you can't even get that many on. You can get a few. And that's kind of the cool part. If I look at PGen, this is 485 bucks to get 100 shares. You double that. You're at 1,800 bucks to shy of 1,000 to get 200 shares. This will do it. And you can get more than one. You can get a few of these. That's the direction I would go with a smaller account. But you have to have a really good strategy around managing risk. Let's say, for example, that we bought as it was breaking out to the upside here at 406. We bought it 406. And I need to place a stop. Let's say my stop goes at 361. So here we got in at 406. We're saying that we would get out at 361. Here, that means that we would accept a 45 cent loss. Let's say you have 100 shares. You can see what I'm talking about. You can get out of this pretty unscathed. You can get out for a $45 loss. Relative to the entire portfolio, you've still controlled your risk. And your risk here is less than 1% of the entire portfolio. But again, this goes into having a good system. You have to have good timing with your strategies. But this is a really slick way to get enough positions on in order to do something.",
    "start_timestamp_seconds": 3392.8,
    "end_timestamp_seconds": 3477.68,
    "start_timestamp": "56:32",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3392",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "controlled your risk. And your risk here is less than 1% of the entire portfolio. But again, this goes into having a good system. You have to have good timing with your strategies. But this is a really slick way to get enough positions on in order to do something. So that's the $5,000 account. That's the direction I would go. Kirk says, thoughts on levard ETFs like TSL for smaller accounts. I would not do it. Leverd things really need the ability to scale. If you can't scale with a lever to count and you're going through a bad path, you're in a lot of trouble. You're in a lot of trouble. So let's go into TSL really quick. And let's just zoom this out. You can see that it still hasn't gotten anywhere near back to where it was in the beginning of 2025. It's not even close. If we go to Tesla by comparison, it's way closer. The point there is that leverage decay is absolutely destroying you with something like this, a smaller count can get stuck. This doesn't mean that it's bad for other accounts. But with a smaller count, especially if you don't have a good ability to scale into this, you get completely stuck. So I would not do that with a smaller count. With a smaller count, the reality is, I would focus on the general methodology that I discussed but most importantly, saving. Because this 20% amounts to $1,000. That's 83",
    "start_timestamp_seconds": 3463.16,
    "end_timestamp_seconds": 3566.16,
    "start_timestamp": "57:43",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3463",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "a good ability to scale into this, you get completely stuck. So I would not do that with a smaller count. With a smaller count, the reality is, I would focus on the general methodology that I discussed but most importantly, saving. Because this 20% amounts to $1,000. That's 83 bucks a month. If you can save $100 a month, you've given yourself a guaranteed over 20% return by just saving $100. That's the most important thing you can do with a smaller count is make more money. The glorification of turning a small count into some sort of massive amount of wealth just about sets everybody up for failure. It can happen. It's unlikely as all hell. OK, back to our original, not $10,000. Here, we have a different problem set now. Now we're trying to make $1,700 a month. Let's see how we can set this up. We first say to ourselves, well, I want to be in an index ETF. I would want to be a little more tech heavy. So I'm going to focus in CUTES. Let's see what I can do in CUTES. If I sell a 31 delta put, I'm going to give up 59 grand. You can see that that's a lot relative to what I have allocated. But that's OK. I can handle that. I have a choice. I can either begin buying shares or I can look to interview a put. Let's just eyeball this really fast. Q's right now is",
    "start_timestamp_seconds": 3542.44,
    "end_timestamp_seconds": 3660.16,
    "start_timestamp": "59:02",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3542",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "59 grand. You can see that that's a lot relative to what I have allocated. But that's OK. I can handle that. I have a choice. I can either begin buying shares or I can look to interview a put. Let's just eyeball this really fast. Q's right now is 60886. I have $75,000 allocated to this thing. That means at spot price, I can get two May, which is 123 shares total, which this will work or a coverage triangle. It won't work perfectly, but this will work. It will work because when I onboard the shares, it means I might not be able to sell that additional putchus yet. But it does mean that I will be able to at least have a ratio. If by contrast, I take a look at my total account value, I can get 164. So it's not worth allocating the entire portfolio to this thing. This will work just fine. Now the other thing to remember is that there are cheaper alternatives to the S&P 500. I'm going to get a list for you guys right now. This is the same exposure. I'm asking GPT. I know three of them. No, I don't want. This is giving me like cheaper in terms of cost, not in terms of expense ratio, but spot price. Let's see what it says. There's S.P. No, God. Yes. Just give me one. All right, here we go. So there is S.P.Y.M.QQQM. Oh, so these actually might be",
    "start_timestamp_seconds": 3633.76,
    "end_timestamp_seconds": 3774.76,
    "start_timestamp": "01:00:33",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3633",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "don't want. This is giving me like cheaper in terms of cost, not in terms of expense ratio, but spot price. Let's see what it says. There's S.P. No, God. Yes. Just give me one. All right, here we go. So there is S.P.Y.M.QQQM. Oh, so these actually might be more liquid. Yeah, these actually are okay. These are offered by spiders. So here you go. Here's a $70 version. Now all of a sudden instead of being in the big version, you can find yourself into the micro versions here, which is actually cool that they do this. They're both liquid. I mean, relatively. Let's keep that a buck. But liquid enough for sure. No weaklies. You don't need weaklies. If we look at a 35-day option, that's like a 34-delta. That's perfect. Let's go that route. That's why I'm going to get this allocation set up is with coverage triangles. So I'm going to have a coverage triangle in QQQM. And then I'll see if there's, I would probably try to do something in Bitcoin as well, just because that is a good relationship with the market. And I think that there will be enough. QQQM right now is too fitty. I actually think just got dropped a little bit more to 53. This is great. I bet would be high on the priority list. 53.48. Okay. What I want to do is I want to say to myself, okay, for QQQM, I want to be able to",
    "start_timestamp_seconds": 3733.44,
    "end_timestamp_seconds": 3869.48,
    "start_timestamp": "01:02:13",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3733",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "is too fitty. I actually think just got dropped a little bit more to 53. This is great. I bet would be high on the priority list. 53.48. Okay. What I want to do is I want to say to myself, okay, for QQQM, I want to be able to get at least 250 shares. Ideally, that would be my preference. I can see what that will cost me. That'll cost me 62 grand. Okay, that's actually completely fine. And then what that means is I get the residual 12,500 or I bet. I can now figure out how many shares that gets me, which is 233, which is great. I now have my core allocation structure. What I'm going to do is begin a coverage triangle in both of these. I would sell, a put, and then just apply the coverage triangle plan, maybe buy some shares because I can get 50 over so I would have two options that I can sell and then I have 50 shares that I can scale into and then I have 30 shares, 34 shares. I can scale into over here. I would scale into this one a little more aggressively than this one and I would just apply that strategy, but this isn't a video about strategies. This is a video about portfolio. That leaves me with my residual speculative allocation. So this is my core and then I have my speculative. Speculative for me includes stuff like earnings. It includes",
    "start_timestamp_seconds": 3852.28,
    "end_timestamp_seconds": 3959.08,
    "start_timestamp": "01:04:12",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3852",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "this one and I would just apply that strategy, but this isn't a video about strategies. This is a video about portfolio. That leaves me with my residual speculative allocation. So this is my core and then I have my speculative. Speculative for me includes stuff like earnings. It includes stuff like index ball. It includes stuff like breakouts, break downs, so on and so forth. The main question I have to ask myself here is how many do I really need to have on and here's how I arrive at that. The first thing I do is I say, okay, I can sell at least one put in QQQM and one put in I bit. I'm going to move this off to the side. I'm going to see how much money we get. So for I bit, let's say we do the 50s. I'm going to get 189. And then let's say for QQQM for the 35s, I'm going to get 495. If I look at how much money this is going to bring out total so far, oops. I'm getting 684 here. I need to get 1667 per month. I have a deficit of 1983. So question I ask myself, is how do I want to get that 1983? One of the ways that I can get that is I can increase the size of one of these if I want. And here's how I would do that. I would say, do I have the current price? I",
    "start_timestamp_seconds": 3934.72,
    "end_timestamp_seconds": 4055.44,
    "start_timestamp": "01:05:34",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=3934",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "ask myself, is how do I want to get that 1983? One of the ways that I can get that is I can increase the size of one of these if I want. And here's how I would do that. I would say, do I have the current price? I do have the current price. What's the strike price for these? Strike price for this is 245. And then for I bit, what I'm doing, I'll show you what I'm doing. I'm making a logical decision. Was the 50. And this was 1809. What I can do is I can see how much of these, how much they return relative. So this thing is giving me 2.02% of my money. This is giving me 3.78. What does that tell me? It tells me that I'm actually going to favor this rather than running this up. I might actually take some money from this and give it to this and let me do more here. So what I might say is I would actually really like to be able to get to 300 or 350 shares. What would that cost me? Let's take a look at 300 shares. I need 16.04.4. What does that leave me up here? 58.956. How many shares total does that get me? 22 August shares. It's me 236 shares. Completely great trade off. Okay, so I've now just made a decision. The first thing here is I'm going to bump this up. So instead of just",
    "start_timestamp_seconds": 4039.48,
    "end_timestamp_seconds": 4149.16,
    "start_timestamp": "01:07:19",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4039",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "What does that leave me up here? 58.956. How many shares total does that get me? 22 August shares. It's me 236 shares. Completely great trade off. Okay, so I've now just made a decision. The first thing here is I'm going to bump this up. So instead of just being able to sell one and then saving 100 shares, I'm actually going to try to sell two of these. And realistically, I actually might ratchet this up a little bit more. I can even ratchet this up a little bit more. I can ratchet this up a little bit more. I effectively can get to 425 shares. The reason why this matters is now instead of only selling one, I can sell like 3. So if my size here now is 3 of these, I'm now at 567. I can still do the same thing over here. I can still get that same one that I'm targeting over here. That now takes me to 1062. What's the residual that I need to get over the month? I need to get 605. That's closer to how I would want these numbers to look. The important thing to know is this is on average. This is doing things over the long run. If I wanted, I could simplify this entire process for myself. And I could say, I'm not going to worry about a speculative allocation right now. Let me just see if I can get the entire return that I",
    "start_timestamp_seconds": 4119.2,
    "end_timestamp_seconds": 4248.96,
    "start_timestamp": "01:08:39",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4119",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "is on average. This is doing things over the long run. If I wanted, I could simplify this entire process for myself. And I could say, I'm not going to worry about a speculative allocation right now. Let me just see if I can get the entire return that I want using the entire capital, rather than 75 grand, let's say that this thing gets the full amount. It gets 100 grand. If I want to start jacking these positions up, I can. Let's see what they can turn into. Right now, the total that I need is 85. Let's add these current numbers of 250 and 425. We have another 15 grand that we can go between these. Let's see how we might want to set this up. We already know that we're getting way more money over here. Let's take this to like 600 shares. That takes us real close. Let's say we try to bump this to like 275. We're just over. 265 and then that'll let you get like 615 here. What this means now, let's say that I can do five here. And then here, let's say that I just start with the full two. I can now get my entire return to target 20% using just this. And I'm not using all the money. That's the important part here. In this side, I'm not using enough capital for 115 shares. And here, I'm not using enough capital. I have 65 shares left over that",
    "start_timestamp_seconds": 4230.6,
    "end_timestamp_seconds": 4352.08,
    "start_timestamp": "01:10:30",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4230",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "I can now get my entire return to target 20% using just this. And I'm not using all the money. That's the important part here. In this side, I'm not using enough capital for 115 shares. And here, I'm not using enough capital. I have 65 shares left over that I could scale into. This now gives me a starting point on just the short put side of the equation. This is not foolproof. If you go through a massive bear market and you don't have a game plan to manage this, you're going to have a problem. This is why the strategy piece to this is so important. The way that I break this out, though, in terms of core and speculative is I say to myself, is there a reasonable way to get me as close as I possibly can to my monthly return target using the core. If yes, great. Let's turn this on. Head for example, let's say both QQQM and I bit were near Ultern Hot, Ultern Heist. And I don't really want to scale in quite that heavy, especially like I bit right now. It's fine. I wouldn't care. Great. But if it was near Ultern Heist, I would feel much more reservation about it just because of the limited capital available. If that's the scenario, then it means that I need to be able to leverage the rest of my speculative portfolio in order to make money. What could that look like? Let's",
    "start_timestamp_seconds": 4333.12,
    "end_timestamp_seconds": 4424.76,
    "start_timestamp": "01:12:13",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4333",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "near Ultern Heist, I would feel much more reservation about it just because of the limited capital available. If that's the scenario, then it means that I need to be able to leverage the rest of my speculative portfolio in order to make money. What could that look like? Let's use a recent example. If I take a look at some of my recent earnings plays and I'm going to use, I'm going to scale them so that the largest loss would fit within the tolerance here. If I scale so that my largest loss is 1% of this allocation way too tight, not going to make it. If I'm trading earnings, I know that I'm going to have to scale things a little more aggressively than this. So I can say to myself, well, what if I have to ratchet this up to 10%. That's a little high. But the thing to remember is that that's 10% of the speculative allocation, not 10% of the portfolio. So if we bring this back out, 75,000, and we take a look at what this $2,500 represents in terms of the total portfolio, it's really only 2.5% of the total portfolio. This becomes a little more palatable. It means that it's going to be high risk to be 10% of the speculative allocation, but only 2.5% of the portfolio. If we go through an earnings season, let's say this last week, I, you just got to give me a second so I",
    "start_timestamp_seconds": 4404.44,
    "end_timestamp_seconds": 4507.76,
    "start_timestamp": "01:13:24",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4404",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "becomes a little more palatable. It means that it's going to be high risk to be 10% of the speculative allocation, but only 2.5% of the portfolio. If we go through an earnings season, let's say this last week, I, you just got to give me a second so I can scale stuff to this. Perfect. So I scaled my trades in earnings last week to something that would fit this. I made the largest loss equal to 1260. So it's about less than half of this or a little more than half of this. The total P&L over the course of the last week with those is 2784. That 2784 would put me well over these numbers, well within my tolerance here, all done through a speculative allocation. The way that I would reconcile that is some weeks are going to be worse than others, but my main effort at this point would be something like that. How did I know to look for earnings? I knew to look at earnings because they happened four times a year for me, they're very profitable, although they're lumpy, but they will allow me to take consolidated risk perch rate that's not on for extended durations exposed to significant drawdown potential like these and it provides non-correlated return sources off of this. That's an example. I want to summarize now in the last couple of minutes what went into that example. I'm thinking of it this way. If we have our total",
    "start_timestamp_seconds": 4490.88,
    "end_timestamp_seconds": 4599.0,
    "start_timestamp": "01:14:50",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4490",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "on for extended durations exposed to significant drawdown potential like these and it provides non-correlated return sources off of this. That's an example. I want to summarize now in the last couple of minutes what went into that example. I'm thinking of it this way. If we have our total portfolio and then we split it into core and speculative, I'm thinking of it as how can I generate as much turn as I comfortably can with the core based on my strategies. Then for my monthly return target, what's my gap? What am I missing? How much money do I need to try to pick up with my speculative? Then based on my understanding of my strategies, specifically the volatility of my strategies, I should then be able to say what strategies make sense for the speculative. I might be able to say something like, well, I need to emphasize breakouts and it's because my speculative allocation is really, really small because I have a small account. I don't have a lot of work, a lot of room to work. I need to take quick losses so that any one of these trades, one of these speculative trades doesn't fully derail me. That's in the case if you have a $10,000 account. You probably are going to be limited in different ways. But this is like the core starting point here for a conversation. The most important things from the lesson today is this exercise is actually attaching some",
    "start_timestamp_seconds": 4576.8,
    "end_timestamp_seconds": 4671.56,
    "start_timestamp": "01:16:16",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4576",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "fully derail me. That's in the case if you have a $10,000 account. You probably are going to be limited in different ways. But this is like the core starting point here for a conversation. The most important things from the lesson today is this exercise is actually attaching some numbers and some expectations about what the fuck you're trying to do and then piecing together the puzzle. If I were to guess the overwhelming majority of people, probably have never thought of this or an exercise even similar to this. And it's because most options traders, they're just saying, I know how to trade vertical. So I'm going to go put on some random verticals. The issue that you will find is that there are two kinds of people. One kind of person will have too much risk on the other person. In this example here, let's say that it was all $100,000 in the core. But the person would say, well, damn, like Q's is really close to highs. So I'm just going to sell one put. And man, I bet it's going down. I'm just going to sell one put. What's the problem here? Well, if this is what you're doing with your entire portfolio because you're a little gun shy because things don't look exactly how you want, well, you're going to be way, way off at the end of the year. When you know you need to hit something close to this on average, this",
    "start_timestamp_seconds": 4656.08,
    "end_timestamp_seconds": 4740.8,
    "start_timestamp": "01:17:36",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4656",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "is what you're doing with your entire portfolio because you're a little gun shy because things don't look exactly how you want, well, you're going to be way, way off at the end of the year. When you know you need to hit something close to this on average, this isn't going to get you there. And then you'll be at the end of the year. Sure, you won't have any big drawdowns because you're using such little capital. That's great. But then if the market has a really good upside year, you're sitting there holding your hands out like fuck, I missed all of it. That's bad. This is why applying this kind of planning process is so important because it gives you something to shoot at. One last point that I have to emphasize. And if you have any questions on anything that we went through now is the perfect time to throw the member for a wrap up. The last point that I want to emphasize is that there will be some months where you can hit this return target. There will be some months where you can exceed it. There will be some months where you will be far behind it. Not the kind of thing that you should start breaking all of your rules because you have a random number written down in an Excel sheet. The whole point here is to give you something to shoot at something to guide your decision making. A",
    "start_timestamp_seconds": 4729.44,
    "end_timestamp_seconds": 4812.04,
    "start_timestamp": "01:18:49",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4729",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "will be far behind it. Not the kind of thing that you should start breaking all of your rules because you have a random number written down in an Excel sheet. The whole point here is to give you something to shoot at something to guide your decision making. A great example of people breaking this concept is we have this scenario. We have month one. We return 600 bucks. And then in month two the person says, ah fuck, I now need to get $2200 this month in order to make up this month and then get me back on target for this month. That's not how it works. It might be that maybe this month, if things go exceptionally well, you walk out at 1900 bucks. And then if you walk at a 1900 bucks, that doesn't put you in a bad position for the rest of the months to get you caught up and back on track. But one of the worst possible things people can do here is this game of catch up because you miss a month because what's the difference? The difference is just what we talked about in order for us to get to our 1900 bucks. We have to use the majority of the portfolio. So then if the next month, let's say we needed to make that 2200 bucks, well now we have to use even more of the portfolio in order to get there. And then you are literally completely",
    "start_timestamp_seconds": 4788.64,
    "end_timestamp_seconds": 4887.4,
    "start_timestamp": "01:19:48",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4788",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "to our 1900 bucks. We have to use the majority of the portfolio. So then if the next month, let's say we needed to make that 2200 bucks, well now we have to use even more of the portfolio in order to get there. And then you are literally completely vulnerable to path. What happens to happen? Does the market happen to crash this month? Yes or no? If no, you might walk out unscathed. But the worst part is is you're reinforcing a terrible pattern. If it does crash, now you're just holding shit, same fuck. I have way too much risk out. I wish I didn't. This is a guide post. You have to take it in context. If you overemphasize it, you risk putting yourself in the very same scenario that the trader that is trying to make the 50% return is sitting at. So just keep that in mind. Okay, brain says do you use Kelly for position sizing on your speculative bets? I do not. If somebody uses Kelly on those, you would definitely want to use some sort of fractional Kelly. The only context that I use Kelly in my decision making is to understand what strategies generally speaking should get what amount of money. But beyond that, I don't use Kelly in that way. The thing to remember about Kelly is that it's designed to optimize portfolio growth. I'm at a completely different spot in my trading career now. I'm really not trying",
    "start_timestamp_seconds": 4867.56,
    "end_timestamp_seconds": 4967.04,
    "start_timestamp": "01:21:07",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4867",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "understand what strategies generally speaking should get what amount of money. But beyond that, I don't use Kelly in that way. The thing to remember about Kelly is that it's designed to optimize portfolio growth. I'm at a completely different spot in my trading career now. I'm really not trying to aggressively grow my portfolio. As you guys I was talking about at the beginning of the stream. I'm actually spending most of my time pulling money out of the portfolio and to other things. So I'm not optimizing for that. You have to understand what the sizing tool is that you're using and what its purpose is. The purpose of Kelly which includes accepting a tremendous amount of volatility. It's not the same, but not all too different from a martingale strategy, not the same, but not all too different. In terms of how much risk you have to take at some points. Naden says just wondering how you would manage the core if a bear market were to happen. Yeah, let's take a, I'm totally cool to go longer. I haven't even ordered dinner yet. And I think it's a great question. Naden, so let's, let's do it. I need to find a, I need to find a coverage triangle tracker. I thought, I thought for sure that there would be one in here. The last there isn't. Okay. Let me make one really quick. We'll literally click through a little bit really fast. Because I think it's",
    "start_timestamp_seconds": 4944.84,
    "end_timestamp_seconds": 5043.56,
    "start_timestamp": "01:22:24",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=4944",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "I need to find a, I need to find a coverage triangle tracker. I thought, I thought for sure that there would be one in here. The last there isn't. Okay. Let me make one really quick. We'll literally click through a little bit really fast. Because I think it's a, wait, I have the sample one in here. Here it is. Yeah, here we go. Let me grab one of these. And I'll just drop this in on it. Actually, this is a nightmare. So I'm gonna not do that. And I'm just gonna use one of these. This one. So what I'm doing is I'm just clearing everything out really quick. This is the sample one that I've been working with you guys on. All right, this one's all flattened out. And then I'll do the same exercise here. Let it all this madness out. And what I'll do is I'll go, we'll go back to 2022. And we will literally look at it together. Like this. All right. Let's say this one has to stay zoomed out a little bit just because I need to be able to see off. But I can go in. There we go. This will work fine. So we said that we're gonna do Q Q Q M. And what did we say that that was gonna get? I think we said like 68 or something. That one is gonna get. 66 250. So this gets 66,000 to 50. And then that",
    "start_timestamp_seconds": 5019.48,
    "end_timestamp_seconds": 5164.68,
    "start_timestamp": "01:23:39",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5019",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "go. This will work fine. So we said that we're gonna do Q Q Q M. And what did we say that that was gonna get? I think we said like 68 or something. That one is gonna get. 66 250. So this gets 66,000 to 50. And then that means our total is 100,000. 33 750. Let's go back in time really quick. Nate says, No extra capital to scaling. I wouldn't do that. I definitely wouldn't do that. So what I mean is you can see even with 100% allocated to the covered triangle. In this scenario, we're still keeping money set aside to allow us to scale in. It's actually really, really important to do that. It's like a critical piece of the broader strategy. So let's go step in front of a moving train really quick. And we'll go through just the beginning stages of the bear market because 2022 is a bear market. Was I bit around then when was I bit launched? It just realized 2024. Fuck. Why did Q Q Q M come out? 20 20. Okay, so we could do Q Q Q M. We'll just do that one for now. This will at least let us look at this really quick. Okay. So we won't have the I bit example unfortunately, but we will have this one. So this is going to be at 164. 37. And give me one second. I just got to open the door. Let's take a",
    "start_timestamp_seconds": 5127.68,
    "end_timestamp_seconds": 5310.68,
    "start_timestamp": "01:25:27",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5127",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "will at least let us look at this really quick. Okay. So we won't have the I bit example unfortunately, but we will have this one. So this is going to be at 164. 37. And give me one second. I just got to open the door. Let's take a look. Here we can go to like the 33. And let's say that we get three bucks. So those are the 160's. I'm going to move this off to the side is always so I can go a little bit faster. So this will be 3 Jan 22. The spot price was 164. X-Bree we looked at 18 Feb. Strike price looked at was the 160. Delta was a .33 premium was three bucks. And let's see how much we can use. We can get. Three of those off. Three of those off puts us at 72.45%. Our total premium collected right now is 400 bucks. That's right. That's fine. Let's fast forward. I'm just going to go to each expiration. There's a bunch of other shit that I would do to manage it obviously. But I just want to go through the exercise of like how this would manage into this down move. And let's see where we're at. So this is now on expiration day 18. 5 of 22. And we're going to see where the underlying is trading at. We're at 147. We have of you base choices here. The primary choice we have is do we",
    "start_timestamp_seconds": 5262.68,
    "end_timestamp_seconds": 5411.68,
    "start_timestamp": "01:27:42",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5262",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "into this down move. And let's see where we're at. So this is now on expiration day 18. 5 of 22. And we're going to see where the underlying is trading at. We're at 147. We have of you base choices here. The primary choice we have is do we want to try to roll this or do we take assignments? Let's see if it's even possible to get a roll out of this. That is we're going to have to close this for let's call it 19 35. And let's take a look at where we could go and get anything even close to that. And we're at the 160. So let's go if we can get more options. We can't. So now we have two choices. We have to go further out in time. This doesn't mean that you're going to hold it that long, but it does mean that you're going to be in this trade for a while. So we can definitely go to the 160 still. And we can get a small credit with going this far out in time. You're already accepting the fact that this isn't going to be a sick year. And I would try to get some sort of basis adjustment out of this. So let's take a look. So let's go to 18 feb 22. And again, full transparency. There's a million things that I would do. That. Not be in this scenario with this trade, but that goes into",
    "start_timestamp_seconds": 5374.68,
    "end_timestamp_seconds": 5487.68,
    "start_timestamp": "01:29:34",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5374",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "I would try to get some sort of basis adjustment out of this. So let's take a look. So let's go to 18 feb 22. And again, full transparency. There's a million things that I would do. That. Not be in this scenario with this trade, but that goes into like actual strategy stuff. This is just a good exercise on like how to manage this kind of thing. And we're going to go to 17 June. Our strike price. We're going to target the 150s. We're going to be a 60 delta premium. There's B 13 95. And we're going to do three of those does that net us out. It doesn't. That's unfortunate. So we're going to have to creep up. We'll do like the 152s. The 152s give us 1515. That still doesn't net us out. Let's go to the 154s. You should work. That'll get us for 1635. That literally nuts us out flat that puts us at zero. Now, here's the here's the downside to this decision. I'm showing you the decision that's being made. This would be. Uh, this should be 22. This will effectively will be flat. It means that you're going to have a trade that's on for up to 119 days and over the course of that duration. Your your absolute hope is just to break even. That's all you can do. What's the benefit here? The benefit here is that you've lost six dollars in terms of your basis. So",
    "start_timestamp_seconds": 5469.68,
    "end_timestamp_seconds": 5576.68,
    "start_timestamp": "01:31:09",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5469",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "have a trade that's on for up to 119 days and over the course of that duration. Your your absolute hope is just to break even. That's all you can do. What's the benefit here? The benefit here is that you've lost six dollars in terms of your basis. So that if in the end, you do get a signed. Not only do you get a signed $1,800 cheaper, but you now are closer to spot price even though you're still pretty far away. It is what it is. The downside to this is you just realize the loss. It's not the end of the world, but you did just realize the loss. That's part of the the thing. So right now. Notice how we also decreased how much money we're using. We're down to 69 74. So the next question we would ask is like, okay, how far down do we think this is going to go? What might it look like? And right now premiums would be super super rich. So I would actually be really really interested in trying to offer more, but we need to see how many we can offer in total. So it looks like we have enough only for one lot more. And at one lot more, there might not be enough in here for us to justify it, but let's see. It's not giving me more strikes for some reason, which is kind of annoying. I'll just guess what they are. I'm",
    "start_timestamp_seconds": 5554.68,
    "end_timestamp_seconds": 5646.68,
    "start_timestamp": "01:32:34",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5554",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "like we have enough only for one lot more. And at one lot more, there might not be enough in here for us to justify it, but let's see. It's not giving me more strikes for some reason, which is kind of annoying. I'll just guess what they are. I'm going to guess that the 135 is like a 35 delta. And probably what are these? These are 40 cents apart. And these are two deltas. Yes, so the 135 is like 35 delta. And that'll be a dollar 80. No, 60 cents. These are 40, these are 60. It's like a dollar 80 cheaper. Ish. What I'm going to do is you can tell I'm literally just guessing, but I, there would be more offered here. So we're going to go to 14 April. And then I'm going to offer the fake 135s that aren't there, but I'm guessing are about a 35 delta. And I'm going to guess these are for 525. What are these for? 555. So 30 cents. 30 cents off. So I would guess 60 cents. Ish. So I'm going to guess like 460. And can only do one of them. Now the way that this would be set up for me is I would really, really want to be able to get another one on. Unfortunately, just can't with what's out here. If this thing crashes enough, I'll be able to. 14 April. And we'll check on our positions and see how they're doing.",
    "start_timestamp_seconds": 5628.68,
    "end_timestamp_seconds": 5748.68,
    "start_timestamp": "01:33:48",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5628",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "this would be set up for me is I would really, really want to be able to get another one on. Unfortunately, just can't with what's out here. If this thing crashes enough, I'll be able to. 14 April. And we'll check on our positions and see how they're doing. Let's see. All right, so our 137s are doing handsome. Those are going to come down for a nickel. So we're at 1494. These are going to come down for minus 0.05. These will come down for a nickel and we'll get something on, which is great. The next thing is we need to take a look at these. The 17 June 154s. Let's check on those. Those are now at 1385. So let's see what we could do here. 1385. That puts us net negative 41.55. Yeah, just leaving for now. And let's see what we get for our next short put. We'll go to like the 136s. Now we'll go, yeah, the 136s. So we're at 14 April. 144. Exploration is going to be 20 May 22. Strike price. I said, I'm going to move this up. 1136. Yeah, 136. Delta's a 0.32. Premium here is like 275. And we can only get one of those. Now the other decision is for the remaining capital when choosing to scale in and whatnot. Again, I'm for going all of that. I'm literally just showing the management of this during a bear market. That's all. So I'm fast forwarding us",
    "start_timestamp_seconds": 5731.68,
    "end_timestamp_seconds": 5886.68,
    "start_timestamp": "01:35:31",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5731",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "And we can only get one of those. Now the other decision is for the remaining capital when choosing to scale in and whatnot. Again, I'm for going all of that. I'm literally just showing the management of this during a bear market. That's all. So I'm fast forwarding us now. And this is good. It actually deepens pretty significantly, which gives us a really, really great example. Let's see what we do. All right, so the first thing is we know that our 1504s are going to be so buried that there's there's really nothing to even do there. The 136s that we have, these are now buried. Those are at 1795. So what I need to do is go out here. And I need to say to myself, where can I find 1795? And unfortunately, it's not even given us that's kind of lame. I have to go out here again. Okay, so we're going to have to go out. 119 days. I wouldn't go out that far, but the platform literally just isn't giving me the strikes here. So I have no choice. And let's see what that does to us. 20 May. 22. And we are at 118. 11. We're going to be in 16cept. 22. And we need to get something close to 1795. Where's that at? We're at the 136th. 17. So we're going to be in here at like the 134. So the 134s. Those are a delta of 0.72. And our premium",
    "start_timestamp_seconds": 5871.68,
    "end_timestamp_seconds": 5986.68,
    "start_timestamp": "01:37:51",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5871",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "at 118. 11. We're going to be in 16cept. 22. And we need to get something close to 1795. Where's that at? We're at the 136th. 17. So we're going to be in here at like the 134. So the 134s. Those are a delta of 0.72. And our premium on those is going to be 1835. We're going to close these other ones for when it's at 118. And again, the closing was 17. So what I'm going to do in a second is I'm going to give us a quick update on where the positions are at. And one thing that I would do at this point, we still have like a tiny way how much money. Valocation is 66. We're using 59. So we have a few grand to play with. The current value is only 60 though because we've eroded. So we can't really buy a whole bunch of shares. So we're kind of we're kind of flat at this point. So let's fast forward. And we need to go to the 17 June expry. Now, before I go further actually, I just want to give you a quick comparison on what's going on. We're at 66. We're using 66250 total. Our portfolio right now needs 59.600. We started this exercise the first trade went on when this things at 164. We're now at 110. The underlying itself is had a profound move. The underlying itself has dropped 32%. If we take a look at what",
    "start_timestamp_seconds": 5950.68,
    "end_timestamp_seconds": 6089.68,
    "start_timestamp": "01:39:10",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=5950",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "66. We're using 66250 total. Our portfolio right now needs 59.600. We started this exercise the first trade went on when this things at 164. We're now at 110. The underlying itself is had a profound move. The underlying itself has dropped 32%. If we take a look at what our total P&L is, everything all in were up 770. But that's tied to open trades, right? So it's there, but we're still going to be up. But let's just take a look at what our realized losses. Our realized loss is 59.70 based off of our allocation. So where we at here, we're down 9%. Our realized P&L is down 9% while if we had bought the shares, we're down 33%. Even though our realized loss is net negative, we are drastically outperforming. The other thing that's going on is you can see that I'm moving my base this down each time. So that if slash 1, I ultimately decide to take assignment as compared to the buy and hold position that began at 164. I can now buy some of it at 154 and some of it at 134 and then some of it, I still will be able to buy out, right? This is effectively how it would go. Then at the end of this, it'll either keep going down and I'll keep rolling if I have to until it stabilizes, then I might start looking to take on shares and stuff like that. But this is",
    "start_timestamp_seconds": 6059.68,
    "end_timestamp_seconds": 6164.68,
    "start_timestamp": "01:40:59",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=6059",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "able to buy out, right? This is effectively how it would go. Then at the end of this, it'll either keep going down and I'll keep rolling if I have to until it stabilizes, then I might start looking to take on shares and stuff like that. But this is the real practical answer to your question, which originally was, how do you manage this if we're in a bear market? Just like this. And again, still ugly doesn't look great, but over the course of time and when it does eventually recover, which is why we're in an index ETF because as it's cratering, we're not asking ourselves the question of like, shit, is this going to go and solve it? Is this thing not going to be able to keep the doors open or are they going to go out of business? That's why it's an index ETF. As soon as QQQ goes out of business, you do not worry about money anymore. Now worried about food, water, and bullets. That's it. This is it. So we can continue the exercise, but I honestly think that this kind of shares the core concepts of what this thing would look like and how, at least, how I would start to manage it. Again, this isn't going into detail on the strategy because the way that I would do this is as certain technical indicators in bear markets start flipping pretty, pretty massively negative. What I do there is just",
    "start_timestamp_seconds": 6145.68,
    "end_timestamp_seconds": 6236.68,
    "start_timestamp": "01:42:25",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=6145",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 6293.0
  },
  {
    "video_id": "pCyYzVCMciI",
    "title": "How to Build a Balanced Options Portfolio | Outlier Options Trading Basics Ep4",
    "text": "look like and how, at least, how I would start to manage it. Again, this isn't going into detail on the strategy because the way that I would do this is as certain technical indicators in bear markets start flipping pretty, pretty massively negative. What I do there is just take some of it down for a small loss and then wait on scaling. But in this example, I just put us in face first so that we could effectively run out of money and then just see how it goes from there. So this is your example. And this is episode four. We have one episode left that will wrap us up next week and that one is going to be a little bit more in depth. We're going to discuss some super important concepts. One of them is getting us closer to truly understanding sources of edge, which is really commonly misunderstood. So I will see you all next Friday. Be an outlier. See you guys later.",
    "start_timestamp_seconds": 6210.68,
    "end_timestamp_seconds": 6287.68,
    "start_timestamp": "01:43:30",
    "video_url": "https://www.youtube.com/watch?v=pCyYzVCMciI",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=pCyYzVCMciI&t=6210",
    "chunk_index": 65,
    "word_count": 169,
    "upload_date": null,
    "duration": 6293.0
  }
]