[
  {
    "text": "you you you you you you you you you you you you you you you you you you you not being assigned. So let me grab GameStop and I'll actually show you what I'm talking about here. So if we go back here to like the seventh of November and we eyeballed, this was like the pre-run-up move. We can see GameStop's trading for like 23. So what I did was as I popped into this and I just found an equivalent 30 delta reference. So with SpotPrice at 33, 31 delta puts us at 30. So about 3 points lower or 10 in this case. So applying that same methodology about 10 lower from here would put us at about 21. So what I'm showing you is that if I sold a 30 delta put on a relative basis back here on the seventh of November, I would have made a few bucks. However, the stock didn't even get near it. So I never would have actually taken the shares on and I collected, let's call it 2 or something like that, which is decent, but I gave up 10 in Rally and the underlying itself. Bad tradeoff. So when I'm trading something like the covered strangle, if I want to get assigned on the puts, what I'm going to do is make sure that I selling close to at the money. And the reason for doing that is I want to get assigned to take on the shares.",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 43,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=0"
    }
  },
  {
    "text": "when I'm trading something like the covered strangle, if I want to get assigned on the puts, what I'm going to do is make sure that I selling close to at the money. And the reason for doing that is I want to get assigned to take on the shares. I'm not trying to just sell puts and collect the premium. I'm trying to get assigned. So I need to be more aggressive. I need to come closer to the money. Now for the puts today, I originally sold them when the stock was down a bit more in sub 32. So when I originally sold the puts that I reviewed in that video earlier today, which was in the 32, they were pretty much right at the money. I think it started just rallying up and out, just up and out. So for all intents, purposes, they were at the money. So the game plan though is I would never enter that way if I didn't already have long shares. And if I want to enter something for a covered strangle, I will typically open up with shares and selling a put, but I would just buy less shares than I ultimately intend to hold. So yeah, overall, you got some of it, which is good, right? Like you got a couple elements of what I'm doing there, but I think you just mistook buying versus selling. And it's probably just because you're defaulting to buying because most people",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 43,
      "start_timestamp": "00:09:10",
      "start_timestamp_seconds": 550.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=550"
    }
  },
  {
    "text": "than I ultimately intend to hold. So yeah, overall, you got some of it, which is good, right? Like you got a couple elements of what I'm doing there, but I think you just mistook buying versus selling. And it's probably just because you're defaulting to buying because most people do. And I think that's completely natural and okay. But instead of buying in this case, I'm selling actually. So yeah, not too far off. Sweet. So let's take a look back at our other screen because I do want to flip through this a little bit more and see what we can come up with. So this is black well. Here we go. So this becomes interesting. So man, this is just this technology is going to absolutely pivot how things work, but this is what you should take away from from this keynote speech. And I'll literally grab a screenshot and I'll throw it up on Twitter or X, but Nvidia is telling you what the ecosystem is. This is literally directly from them. So I'll drop this on. Oh, one sec. I'm making a post on it right now. So Nvidia AI ecosystem. Outline. I'm the names you like. And so this is cool. The fact that you can essentially see what the big boys video you the ecosystem has. And you can gain exposure to a lot of these Accenture is publicly traded for sure. Teradata publicly traded Oracle publicly traded and liquid I should add",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 43,
      "start_timestamp": "00:10:15",
      "start_timestamp_seconds": 615.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=615"
    }
  },
  {
    "text": "you like. And so this is cool. The fact that you can essentially see what the big boys video you the ecosystem has. And you can gain exposure to a lot of these Accenture is publicly traded for sure. Teradata publicly traded Oracle publicly traded and liquid I should add on top of that. SAP CrowdStrike Adobe all of those and Info Systems a lot of these are. So the cool part is if you like some of these and there are things that you want to add to your portfolio. Let's take a look at Oracle, for example, it's starting to be bid down. So maybe it's a entry opportunity for a longer turn play. Completely rational, especially when you see again, the involvement that companies like this are going to have with the broader ecosystem. Let's take a look at CrowdStrike that'll be more from a security perspective, I believe. They've been trending sideways for a while now. Actually, kill this. So this looks good either for near term short put style, just kind of collecting some premium or for a longer term bullish thesis in how this landscape might evolve. Really interesting, I think. So let's I want to see what he actually says about this stuff. Again, I'm going to be reading the subtitles with you because I'm trying to keep the video from being allowed. But we got to ramp this up way too slow. So it's talking about now how this model behaves and",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 43,
      "start_timestamp": "00:12:05",
      "start_timestamp_seconds": 725.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=725"
    }
  },
  {
    "text": "want to see what he actually says about this stuff. Again, I'm going to be reading the subtitles with you because I'm trying to keep the video from being allowed. But we got to ramp this up way too slow. So it's talking about now how this model behaves and what it does. I specifically want him to talk about this here. We're going to be working with the ecosystems. These AI technologies are integrated. We have great partners. Really great work being dumb at SAP, Demon, Hayden's great works and nopsis perplexity. They're just kind of not really saying anything. He's just saying that these are good partners, which is fine. But I didn't know if he was going to have specific things to say about them. That's another thing to pay attention to if you didn't see what he was just saying about the future of coding and that we're very likely going to see a future where crazy enough, but you're going to have people who are writing code that have help essentially assistance from some sort of AI assistant level tool. And I think that that's super important, to be honest. And the reason I think that's so important is because that changes the landscape from an employment perspective, from a hiring perspective. That's going to change a lot about the way that businesses view the landscape going forward, which it's something to be aware of because there are going to be companies that are going",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 43,
      "start_timestamp": "00:13:45",
      "start_timestamp_seconds": 825.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=825"
    }
  },
  {
    "text": "that's so important is because that changes the landscape from an employment perspective, from a hiring perspective. That's going to change a lot about the way that businesses view the landscape going forward, which it's something to be aware of because there are going to be companies that are going to be vulnerable during this. And you will find companies that don't pivot as well. Companies that lag heavily. So the idea is to identify those kinds of things before they start crashing. So either you can trade alongside with them, meaning trade them to the downside or you can get out of the way. So Lauren says code writers knew they were on the way out. That's what a friend told me. Well, that's the thing though is that I actually don't view them on the way out at all. Coters are their job is going to change. But there is no replacement yet. Still for human methodology. That's a big element of these kinds of things because again, we can see it even in really good coding platforms and stuff like that. You can just use GPT E. Clawed any of those for a general proxy. And they're good. But you still need a human to go through troubleshoot to get it on target. Now I'm not saying that that's not going to evolve. It absolutely is going to evolve probably massively over the next decade or two. But I still think Coters even at that point will",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 43,
      "start_timestamp": "00:15:24",
      "start_timestamp_seconds": 924.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=924"
    }
  },
  {
    "text": "good. But you still need a human to go through troubleshoot to get it on target. Now I'm not saying that that's not going to evolve. It absolutely is going to evolve probably massively over the next decade or two. But I still think Coters even at that point will still have a seat at the table. But they're going to have to reskill slightly. And it'll be less of them being the individual subject matter experts on coding because AI will be able to help a lot with that. And instead, they're going to have to be able to manage AI and use it as an accelerator across an enterprise, which is a very different skill set than being the person that's physically sitting there plugging in code. And this will apply to data analysis is going to be another really big one. So people that are running dashboards in Tableau or that are trying to build queries in SQL to manage large data sets. You already have a massive accelerator through AI, but you still need a bit of the human element for all of it. So I think you will see pivoting. And that's the important thing to pay attention to in my opinion from a trading perspective because depending on how we pivot and who pivots well and effectively, they will those kinds of companies will do really, really well in my opinion. And the companies that fail to pivot like that, they will suffer and",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 43,
      "start_timestamp": "00:16:43",
      "start_timestamp_seconds": 1003.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1003"
    }
  },
  {
    "text": "to pay attention to in my opinion from a trading perspective because depending on how we pivot and who pivots well and effectively, they will those kinds of companies will do really, really well in my opinion. And the companies that fail to pivot like that, they will suffer and they will get left behind. And there will be some of those that always are. So let's see. AI PCs, this is interesting. All right, let's see what this is. And created for the cloud. Enjoying AI on phones. Going to have continuous AI that's going to be with you and you use those meta glasses, of course, that I'm really excited for. Really, really excited for when AI is integrated into augmented reality. Want to do more than anything is put our PC. That's cool. So he's talking about Windows 95. And how that changed the platform a lot of broader ecosystem of things. And he's saying that they want to have AI essentially become an assistant versus apps and AP or instead of APIs. Generative AI for sound. That's really cool. That's really, really cool. So to use AI, there was another thing I was seeing when he was going over this, I think the RTX. And one of the fascinating things about that is he was talking about how they're using AI to generate pixels. So that like pixel offload and something like that is fucking crazy. I think that'll be a pretty big deal for personal",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 43,
      "start_timestamp": "00:18:08",
      "start_timestamp_seconds": 1088.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1088"
    }
  },
  {
    "text": "was going over this, I think the RTX. And one of the fascinating things about that is he was talking about how they're using AI to generate pixels. So that like pixel offload and something like that is fucking crazy. I think that'll be a pretty big deal for personal computing and stuff like that. All right, so WSL to two operating systems within one developed for developers. And you can have, I'm just giving them through the stuff that doesn't matter. Optimize for CUDA, which is important for this. So as long as the computer fits, you're going to have many models that fit whether it's vision models, language models or animation models. So you're going to have access to different kinds of models based on this, which is I think really, really cool too. And then physical AI. So that's, we just went through kind of like PC level AI. And then now they're talking about physical AI, which is if this happens in my lifetime, I cannot tell you how fucking stoked I'm going to be where if I can have a robot just roaming around my house. Because the main thing I think about with having a robot roam around the house is really not, I mean, just think of how much that changes things to be able to like sit in my office and control my robot to go bother my life throughout the day. Like, is there a better existence than that to just",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 43,
      "start_timestamp": "00:19:38",
      "start_timestamp_seconds": 1178.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1178"
    }
  },
  {
    "text": "a robot roam around the house is really not, I mean, just think of how much that changes things to be able to like sit in my office and control my robot to go bother my life throughout the day. Like, is there a better existence than that to just be able to like remote go up there and just like poker a couple times and then have the robot walk away or to another favorite thing for me to do is just like walk up and just move something on our desk, right? It's literally just a pester off, just to bother her a little bit. And this is, this is what I need in my life is to be able to do that with a robot. So I already do it with the cleaning robot. We have a like a I think a Robo rock or whatever it's called, but like I'll take manual control and I'll chase her with it, which is super fun. I like that a lot. So you guys in non terrorist, I enjoy having fun and playing around, especially at the expense of somebody else. It's, you know, always fun to play around, but when you can do it at the expense of somebody else, all the better. I'll be. Physical AI autonomous vehicles. I was actually looking at, so speaking of autonomous vehicles, I was looking at this, this weekend's my wife and I were going to go up to Idle Wild",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 43,
      "start_timestamp": "00:21:20",
      "start_timestamp_seconds": 1280.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1280"
    }
  },
  {
    "text": "but when you can do it at the expense of somebody else, all the better. I'll be. Physical AI autonomous vehicles. I was actually looking at, so speaking of autonomous vehicles, I was looking at this, this weekend's my wife and I were going to go up to Idle Wild because I'm not out of the the mountain vibe yet. So we're going to go hang out idle wild. I'm cove is actually pretty, pretty high. So and I don't where I'll tie this back as you guys know. So we're going to go here to a side rock. Damn, I didn't realize that it was like that. Don't get any ideas gang. If I don't come back, it I'm not that for me. So Idle wilds pretty cool. It's like up in the mountains and there's hikes and, you know, different kinds of things you can do. That's pretty fun. But what I was thinking about doing was I was looking on Turo and poking around at different whips and it struck my idea to go to like a cyber truck. So let's see. Let's see what we could do for cyber truck. Sure. 10 to 10 is fine. Make the other one I was looking at was not a Rivian. What is it? A lucid. That's the other one. I really like to look at those lucids. I think they're sick. There we go. A lucid model air. But I was actually looking at a cyber truck because",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 43,
      "start_timestamp": "00:22:27",
      "start_timestamp_seconds": 1347.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1347"
    }
  },
  {
    "text": "Make the other one I was looking at was not a Rivian. What is it? A lucid. That's the other one. I really like to look at those lucids. I think they're sick. There we go. A lucid model air. But I was actually looking at a cyber truck because I pre-ordered one of them. I didn't really intend on taking delivery of it just because I just don't think I want I want one yet. But I was also looking at maybe grabbing a cyber truck to go just test it out see if we like it because I genuinely don't know yet what they're like. I haven't driven one. I've seen them out which has been really, really cool. But I've not I've not actually driven one and like traveled with one. But looks kind of cool to drive around in and look like the the warthogs from Halo. Only thing is I can't load it with fireworks obviously. And I imagine if I go anywhere near Vegas, I'm going to get a bunch of weird looks. So we'll have to we'll figure that out. I don't know exactly. I mean, I guess I could load it. Fireworks just feel like the right thing though. It just feels right. And we'll see we'll see what I load it with. David says don't take cyber truck to it. Yeah, exactly my thought. Yeah. That's exactly right. Oh, that's it. Rowing Titty. That's exactly. Hey, yeah, what up, Rowing Titty?",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 43,
      "start_timestamp": "00:23:49",
      "start_timestamp_seconds": 1429.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1429"
    }
  },
  {
    "text": "just feel like the right thing though. It just feels right. And we'll see we'll see what I load it with. David says don't take cyber truck to it. Yeah, exactly my thought. Yeah. That's exactly right. Oh, that's it. Rowing Titty. That's exactly. Hey, yeah, what up, Rowing Titty? I was thinking that's exactly what I should do is rent a cyber truck and then like fly my drone over the cyber truck and just be a general public menace. But all of that going back to what we're talking about over here. What I'm very interested in is how this ecosystem is going to evolve because the autonomous driving world is still very limited and definitely dominated by Tesla, especially out here in California. Which is kind of interesting because you think California generally speaking a little more left leaning liberal in what you would expect. Elon has gone a little further off to the right hand side. So I was always thinking that there's a chance a bunch of the more left committed people will be like I don't like test line anymore, but you see it everywhere. So to me, that just goes to show how powerful that ecosystem is. And you can see a bunch of the different names up here that they're talking about working with Lucid being one of them. Rivian, another thing I want to highlight. I don't know. I noticed this yesterday when I was driving back from LA or no",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 43,
      "start_timestamp": "00:25:26",
      "start_timestamp_seconds": 1526.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1526"
    }
  },
  {
    "text": "powerful that ecosystem is. And you can see a bunch of the different names up here that they're talking about working with Lucid being one of them. Rivian, another thing I want to highlight. I don't know. I noticed this yesterday when I was driving back from LA or no two days ago when I was driving back from LA that I thought was really interesting is notice how all the text for these names is the fucking same. Rivian is essentially the same as Zika, which is essentially the same as Lucid, which is essentially the same as Zooks. It's I'm noticing a lot of these car brands are pivoting back to like the just very basic text. I noticed that on a couple Honda, there was like a Honda SUV I saw it with Lexus. They're all just doing like this style branding like this very, very basic text, just super interesting to me from a branding perspective. All right. Okay. So they're talking about essentially their involvement and you can see that he's working with every major car company around the world and say it is this is insane. In video, I still feel is a massive, massive value. This is crazy. Like this sell off from yesterday. I just think is a pretty significant opportunity to gain entry if somebody wanted to. In video is the kind of company I think in five years when you look back and you decide, you know, if you're happy",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 43,
      "start_timestamp": "00:26:44",
      "start_timestamp_seconds": 1604.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1604"
    }
  },
  {
    "text": "massive value. This is crazy. Like this sell off from yesterday. I just think is a pretty significant opportunity to gain entry if somebody wanted to. In video is the kind of company I think in five years when you look back and you decide, you know, if you're happy with your investment, I just have to imagine Nvidia would be one of those ones where you buy, you look back in five years and you're stoked about it. I mean, it's already the case, but I think it still has so much more to go, especially with Nvidia. I mean, listen, let's talk about it. This dude is wearing like a fucking snake skin leather jacket. You can tell that he's not, he's obviously a CEO of a tech company, but you literally can tell that this dude is picking up like a rock star persona. He loves it. You can tell he loves it. He loves, I can tell the way that he talks about things, the way that he presents stuff. He isn't just a dude that's really into tech, like a Zuckerberg kind of thing. This is a guy that's actually enjoying Stardom. He literally has become a star. The fact that there's a tech company CEO that is now becoming a partial rock star that tells you a lot, it tells you a lot about the industry, what it looks like, where it might be going, and is weird and is off the beaten path",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 43,
      "start_timestamp": "00:28:02",
      "start_timestamp_seconds": 1682.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1682"
    }
  },
  {
    "text": "become a star. The fact that there's a tech company CEO that is now becoming a partial rock star that tells you a lot, it tells you a lot about the industry, what it looks like, where it might be going, and is weird and is off the beaten path that is in terms of analysis. I do think there's a lot to pick up from this. The way that he presents himself, it's just very different. I find the potential for a company like Nvidia, every time I look at it, I find the potential to be tremendous. It's one of the reasons why trading the leveraged covered strangle on Teachable Cues to me is very satisfying because the Cues is pretty heavy in all of these main tech companies that I really do think there's going to be a pretty strong future for. There's actually a few ETFs that track just the Mag 7 that I absolutely would trade. They're just not liquid enough just yet. There's even a couple leveraged versions of them that look really interesting like a two times leverage and a three times leverage. It's just a little early. Enough liquidity, I would happily rotate into something like that from Teachable Cues. That's one of the benefits of trading an index ETF like Cues is that you get a lot of exposure really to this broad ecosystem and Nvidia being a significant part of it. So they're partnering with Toyota, which is huge. Oh,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 43,
      "start_timestamp": "00:29:28",
      "start_timestamp_seconds": 1768.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1768"
    }
  },
  {
    "text": "rotate into something like that from Teachable Cues. That's one of the benefits of trading an index ETF like Cues is that you get a lot of exposure really to this broad ecosystem and Nvidia being a significant part of it. So they're partnering with Toyota, which is huge. Oh, I saw the word Thor hold on. A robotics computer. It was funny when I was going to the, I was dropping the McLaren off today. So one of the things you can get with the McLaren is like an extended service contract. And I mean, I normally like working on cars myself, but especially for something like the McLaren, I much prefer to have the extended service contract, right? So I'm going to drop it off. And as I'm dropping it off, there's a lineup of all super expensive cars. There's a bunch of Bentley's a couple of the McLaren's. There's a few Lamborghini. It's all shit like that, right? As I was looking at all of these different cars, I literally could see all of the technology laden all over these cars. When we look at Nvidia, they are continuing to penetrate and spread into a ton of different industries. And the automotive industry is not slowing down at all. With adoption or technology technology integration. Actually, one of the reasons why I like the McLaren 570s as compared to something like a 720s or a 650s, those are the 650s I was very close on. I really",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 43,
      "start_timestamp": "00:30:47",
      "start_timestamp_seconds": 1847.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1847"
    }
  },
  {
    "text": "different industries. And the automotive industry is not slowing down at all. With adoption or technology technology integration. Actually, one of the reasons why I like the McLaren 570s as compared to something like a 720s or a 650s, those are the 650s I was very close on. I really like that car. It says a very similar structure and body as the 570. But when you start looking through the amount of electronics that it has in the car world, we call them nannies and an IES. They're kind of like things that help you drive. And obviously, makes a lot of sense, right? Fast, powerful cars. You're going to be faster with the technology for sure. But a lot of us that are buying stuff like this, we're not necessarily getting into it because we think, you know, we're trying to be the the next fastest car on planet Earth or running lap times or something. Sometimes we do it just because we like driving. We like the experience. And even something like the 570s is fascinating because it has electronic steering which is different. Most cars will have hydraulic steering. It's a much different feel. But all of those other versions that I was telling you about, like the 650s, they have dynamic dynamic spoiler systems. Same thing with like the 670. If you take a look at the 720s, it's the same story. So they have a massive amount of technology that's built into it, which",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 43,
      "start_timestamp": "00:32:35",
      "start_timestamp_seconds": 1955.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=1955"
    }
  },
  {
    "text": "of those other versions that I was telling you about, like the 650s, they have dynamic dynamic spoiler systems. Same thing with like the 670. If you take a look at the 720s, it's the same story. So they have a massive amount of technology that's built into it, which is really cool. But again, for like a driving experience, it really starts to sabotage a lot of it from my preference with respect to driving. So it's neat. Like this entire spoiler system is completely dynamic. And it will move and rotate as you're driving, as the car decides that you need different things, which is really, really cool. But yeah, it's I think indicative of the future. I was actually thinking about that. Funny enough, I was thinking how I'm kind of getting ready to grab another car just because I like them. And as I started looking through stuff, I'm struggling to find something that kind of scratches the itch from a modern perspective. So as I was like looking and scrolling through stuff, I was going further and further back in time to find things that give the experience that I'm looking for, which I just find so interesting. I understand more and more why old dudes tend to like classic cars. I totally get it. Because I can only imagine, I mean, I think most old dudes were excited when fuel injection came around and like independent rear suspensions and differential like that kind of",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 43,
      "start_timestamp": "00:33:56",
      "start_timestamp_seconds": 2036.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2036"
    }
  },
  {
    "text": "find so interesting. I understand more and more why old dudes tend to like classic cars. I totally get it. Because I can only imagine, I mean, I think most old dudes were excited when fuel injection came around and like independent rear suspensions and differential like that kind of stuff. I think universally people liked, but cars are getting to the point now where they have collision detection. And that's actually put me in more precarious spots more than it's helped me. Funny enough, where like you're trying to pull out, but it notices something that just went by and there's a lag when it receives what went by versus when you're trying to go and it's you're working in a window of seconds. So the technology is just going nuts, man. And if you see some of the new models, let's take a look at the Artura. We don't want the spider. We just want the Artura. But this thing has a crazy amount of technology in it, gorgeous car. It looks really, really pretty. But you can even see it in the front, like the entire front, lower body panel is all electronic. It has the same thing with the spoiler system you can see that this will lift up. So very, very interesting, but super, super technology, Layton, which I just, oh, this one doesn't have the active arrow. That's actually kind of cool. It's probably in the suspension itself. Well, let's see what we're going",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 43,
      "start_timestamp": "00:35:23",
      "start_timestamp_seconds": 2123.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2123"
    }
  },
  {
    "text": "thing with the spoiler system you can see that this will lift up. So very, very interesting, but super, super technology, Layton, which I just, oh, this one doesn't have the active arrow. That's actually kind of cool. It's probably in the suspension itself. Well, let's see what we're going to get, shall we? Hands in it. Tins in it's a beautiful color, but it wouldn't be my pick. We would have to go with orange. All right, let's see. Not volcano orange. This is what the 570 is. Is it hold on? I literally can't see the difference. This is what I have. So the McLaren is papaya spark. And the cool part about it is that it has like a lot of yellow flaking it. I mostly just want to see the technology that's in this thing. I don't care about all this stuff. I don't care about any of this. Pack pack. I have backpack. Oh, black pack. Don't care about any of this. Don't care. Don't care. I thought that they would have like a thing that talks about, here we go, tech lux. Let's see what this is. Their panels, their little devices typically aren't very good. It's funny. The console that I have in the Corvette is nicer than the one that's in the McLaren. Not even joking, like pretty significantly. Let's see. I don't care about entertainment. I want to see. Let's take a look at Volvo. They was talking about Volvo's Nvidia",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 43,
      "start_timestamp": "00:36:43",
      "start_timestamp_seconds": 2203.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2203"
    }
  },
  {
    "text": "very good. It's funny. The console that I have in the Corvette is nicer than the one that's in the McLaren. Not even joking, like pretty significantly. Let's see. I don't care about entertainment. I want to see. Let's take a look at Volvo. They was talking about Volvo's Nvidia relationship. See what this is. So they've been partners since 16. They have the Nvidia drive platform. And then it looks like it's powering the self-driving element. That's really interesting. Oh, fuck is that thing? Is this? I think it's just the way it's going, man. Yeah, take a look at this. Computer on wheels. That sounds exactly right. All right, let's see what our boy, what else he has. 20 times processing. See, and that's, I go back. That's the other really cool thing about where we're at right now with this technology. Take a look at this. So, or is 20 times the processing capability of the last generation, Orin? I would assume it would be, if it's Thor, I was guessing it'd be like Odin, but maybe it's Orin. I can't hear him. I'm guessing that the the C.C.s might be messed up. But we're still at the point where the technology that we're looking at is so rapidly expanding. I mean, massively expanding. That I also find intriguing because it's almost like the first few versions of the iPhone, right? The iPhone had some really, really huge leaps and bounds that it moved. And then it",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 43,
      "start_timestamp": "00:38:37",
      "start_timestamp_seconds": 2317.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2317"
    }
  },
  {
    "text": "the point where the technology that we're looking at is so rapidly expanding. I mean, massively expanding. That I also find intriguing because it's almost like the first few versions of the iPhone, right? The iPhone had some really, really huge leaps and bounds that it moved. And then it kind of started to slow down. And now with the iPhone, it's kind of like year over year, you just get the same shit, slightly different thing. I've already bitched about it. I'll take this opportunity happily to bitch about this again. Don't worry. But one of my least favorite things is this new button. This is the dumbest thing I've ever dealt with on a new phone in my life. I see absolutely no reason for this button. It takes me to the camera, but you can still just get to the camera by pressing the button on the front. Like this button is so stupid, but it's there. So, thought I would share my hatred for that button with you. But back to this, let's see. Full production, full robot, that's also smart. So they're using it in different things, which is super smart. Safety drive OS, first software defined programmable AI computer that's certified up to ASLD, which is I guess some sort of standard, standard rating, functional safe computer, building a robot in video kuda, omniverse and cosmos to do in the context of self driving. Oh, yeah, let's see. Let's see. How they use the",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 43,
      "start_timestamp": "00:40:58",
      "start_timestamp_seconds": 2458.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2458"
    }
  },
  {
    "text": "software defined programmable AI computer that's certified up to ASLD, which is I guess some sort of standard, standard rating, functional safe computer, building a robot in video kuda, omniverse and cosmos to do in the context of self driving. Oh, yeah, let's see. Let's see. How they use the card to reconstruct digital twins and to train future models. All right, let's see what this is. So, hold on, I realize I'm watching and not talking. Sorry. So it looks like they're using three computers. They have an Nvidia DGX that trains the models, omniverse test drives, and generates synthetic data. And then AGX is a supercomputer inside the car that tries to address edge real-life scenarios. That's crazy. That's absolutely crazy. So it has the maps built in, but then it has a supercomputer that helps it analyze real time through the various vehicle sensors to identify any of the strange circumstances like this, like if there's road work or something like that, that's so cool. That's a big problem of what's missing right now and what I think will still take a long time for this kind of thing right here, right, where we have a dude saying go slow, and then this isn't even that difficult to be honest. There's instances you all have been in them where like you have to drive in the opposite side of traffic. Like I'm really curious how is it going to do when it's forced down opposite side traffic",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 43,
      "start_timestamp": "00:42:23",
      "start_timestamp_seconds": 2543.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2543"
    }
  },
  {
    "text": "saying go slow, and then this isn't even that difficult to be honest. There's instances you all have been in them where like you have to drive in the opposite side of traffic. Like I'm really curious how is it going to do when it's forced down opposite side traffic or something like that? And it seems like that's the whole point of the super computer side of things. AGX is that it'll help it be able to learn that after it goes through the training element, which is really cool. Man, what? So cool. Literally so fucking cool. Even the process of like building the database to train this is absolutely insane. All right, what's this next one robotics? We got some robots. AVator Geeks says we are at level two automation now. All this stuff is for level three, which is just driver assist still not full automation. I don't know the actual nomenclature for like the different levels. I don't know if AVator is that like an actual nomenclature that you're using or you're just kind of coming up with what you would consider it to be because the reason I'm asking is it to me this still seems like level one, maybe level 1.5. I still feel like we are so far in the infancy of this whole thing. Oh, there's a whole line of them. Ah, you see that's a great way to frame it. That's a great way to frame it. AVator says yeah,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 43,
      "start_timestamp": "00:44:54",
      "start_timestamp_seconds": 2694.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2694"
    }
  },
  {
    "text": "still seems like level one, maybe level 1.5. I still feel like we are so far in the infancy of this whole thing. Oh, there's a whole line of them. Ah, you see that's a great way to frame it. That's a great way to frame it. AVator says yeah, industry talks. So then how many levels are there? Because if we're saying levels like two and three, I would have to imagine based on that that there would be like fucking 100 levels. Like you would have to be a ton of levels in that scaling system. But do you see what he's talking about here? This is important. The chat GPT moment for general robotics just around the corner. That's fucking cool. So for those that don't know what this is alluding to chat GPT as most of you know, kind of like sprung up and became the household name for AI. And obviously what he's saying is that soon enough, we're going to see this like these kinds of general robotics introduced across the broader ecosystem rapidly, which is I think just super, super cool. So this is saying why general robotics is so important as compared to tracks and wheels is that green fields, brown adaptation is perfect. We could build these robots and deploy them in the world that we've built for them through robots are a genic robots. So information workers. Okay. If we have the technology to solve these three, the largest technology",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 43,
      "start_timestamp": "00:46:29",
      "start_timestamp_seconds": 2789.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2789"
    }
  },
  {
    "text": "to tracks and wheels is that green fields, brown adaptation is perfect. We could build these robots and deploy them in the world that we've built for them through robots are a genic robots. So information workers. Okay. If we have the technology to solve these three, the largest technology industry, the world's ever seen. Yeah. The critical capabilities, how to train the robots, which will be a really big thing. Obviously, imitation information, the human demonstration, laborious need to come up with a clever way to make hundreds of demonstrations, thousands of demonstrations. That's actually something I feel doesn't necessarily get as much credit as it might need just how detailed and how in depth, the training element of this whole thing is, which is just absolutely massive. So they're just talking about essentially using synthetically generated motions to help teach it to perform a task. But that's a clunky, blocky process. That one walks weird. Group. That's a great name. Okay. So this is talking about essentially a robot as the interface to reduce risk. I mean, that feels not really. I am just eager to see all the videos. Can you imagine all the videos we're going to see of these robots when they're first being rolled out in how bumpy everything is going to be? The videos are going to be hilarious. Corey launched a shrunk it to DGX. I'll harmonize it with RTX, AGX, OVX. And it revolutionized DGX1. So it revolutionized artificial intelligence and",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 43,
      "start_timestamp": "00:48:00",
      "start_timestamp_seconds": 2880.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=2880"
    }
  },
  {
    "text": "to see of these robots when they're first being rolled out in how bumpy everything is going to be? The videos are going to be hilarious. Corey launched a shrunk it to DGX. I'll harmonize it with RTX, AGX, OVX. And it revolutionized DGX1. So it revolutionized artificial intelligence and they want to make it possible for researchers and startups to have out of the box AI supercomputers. This is one of the things I saw from a clip that looks really, really interesting. So this, if I'm not mistaken, I think this is like the 3,000 supercomputer. So that's the, God, look at that. Project digits right now. So it runs the entire Nvidia AI stack. Wireless or connected to a computer. That's so sick. So that's the thing where they talk about the price of this thing. Okay, what kind of car was that? Wait a minute. Oh, it's a Corvette CA right there. That doesn't look like a Z06. It's your winner. This reminds me of the fifth element. You guys, you guys see the fifth element? There's a scene where the dude is choking. And he's like pressing a bunch of buttons, trying to, because he has robots that do everything around the office, but there wasn't one that can help him. Hold on. Let me see if I can find it. I don't even know what to type in. Fifth element. Okay. This is what it reminds me of. This is what he's drinking that",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 43,
      "start_timestamp": "00:50:56",
      "start_timestamp_seconds": 3056.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3056"
    }
  },
  {
    "text": "has robots that do everything around the office, but there wasn't one that can help him. Hold on. Let me see if I can find it. I don't even know what to type in. Fifth element. Okay. This is what it reminds me of. This is what he's drinking that with, by the way. What do you put a cherry in like that? Also shout out to this plastic thing, the universal sign. So now he's like pressing all these little office buttons. And you see we're choking. So I don't know why, but seeing all these robots around reminded me of this. Like we're going to have robots do all all this crazy shit, but then we're not going to have the basics covered as humans anymore. Super cool. Now I wanted to flip through this, not just the Nvidia, but I wanted to flip through the rest of CES because there's a couple of other really cool pieces of technology that I want to take a look at. So let's see. Rollable laptop? What? It just looks like it. That's pretty cool. So it looks like it extends up. That's very, very neat. So you can see like there's these rails that you can extend it up and obviously the screen rolls somewhere just all the way. That's pretty neat. I don't care about this. I don't care about this. It was like a health scanner thing that looked really cool. What the fuck? That seems dramatic. That",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 43,
      "start_timestamp": "00:54:04",
      "start_timestamp_seconds": 3244.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3244"
    }
  },
  {
    "text": "there's these rails that you can extend it up and obviously the screen rolls somewhere just all the way. That's pretty neat. I don't care about this. I don't care about this. It was like a health scanner thing that looked really cool. What the fuck? That seems dramatic. That looks crazy. That I wonder if we need more of this. We need more. Remember what is the name of that little last car? The smart cars. This is I guess it looks a little cooler than a smart car at least. That don't care. Whoa, that's actually kind of cool. The box looks like a toaster. After a few seconds, the machine swaps out the depleted battery in the case. Oh, so it's like in a case weird. That's pretty neat. Battery backup for your fridge. That's not really anything cool. That's so excessive. Moveable TV. That's kind of dumb. This one seems so absurd. This one seems absolutely so absurd. Just like there's like these little fucking robot arms that pick up things. I could just imagine how useless that's going to be. Smart glasses. No. No. Digital art. That's kind of cool with fewer cables. That's really interesting. Wait, what? We're at a new strain of Audrey's. They unveiled a smart planter. Oh, I thought it was saying that like the focus. Where's this fucking? Let me find it. Here's this health scanner thing. Oh, that's interesting that it's withings. I didn't realize the brand because that's.",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 43,
      "start_timestamp": "00:55:59",
      "start_timestamp_seconds": 3359.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3359"
    }
  },
  {
    "text": "interesting. Wait, what? We're at a new strain of Audrey's. They unveiled a smart planter. Oh, I thought it was saying that like the focus. Where's this fucking? Let me find it. Here's this health scanner thing. Oh, that's interesting that it's withings. I didn't realize the brand because that's. I've seen their brand on a couple different things actually. But take a look at this. Whole body scanning thing. I'm a jig. So it's called the omnia. It's a transformable experience. Concentral product offer 360 degree body scans. Weight, heart, lung health, sleep activity, nutrition. From some sort of connected wearable. That would be so sick. That one I think is interesting. Rafael joined. Why not says he's going to slap the shit out of the robot. That's so funny. Rointit, he says it wasn't a cherry. It was a fireball. Yeah. Rafael says what is he looking for? I'm not looking for anything. I'm poking through CES. There's a ton of new technology coming out. I love new technology. I love trying to find things that look really interesting and investible, which we came across some of it actually. Nvidia specifically. I think that's like the main. That's like the main thing I can come across. The Nvidia ecosystem. Rafael says this is boring. Oh, that's cool. Hop off, man. Yeah, totally cool. This is a completely different style of stream, where that's why it's called crater hangout. We have no agenda. We're here just to bullshit. Take",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 43,
      "start_timestamp": "00:58:09",
      "start_timestamp_seconds": 3489.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3489"
    }
  },
  {
    "text": "like the main thing I can come across. The Nvidia ecosystem. Rafael says this is boring. Oh, that's cool. Hop off, man. Yeah, totally cool. This is a completely different style of stream, where that's why it's called crater hangout. We have no agenda. We're here just to bullshit. Take a look at stuff and explore. So yeah, no issue if this ain't your bag. But we'll catch you later on the next one. What do you guys think of these? Anybody going to be cruising around in the hyper ice night these are the people that do a lot of recovery stuff. So I think I have hyper ice boots already. And then I think they do a couple other things. I don't know if they do like the massage guns and stuff. But those look nuts. Interesting though that they appeared with Nike. Where he says only if they massage my bunions. I don't really know what a bunion is. I've heard of that. But I have no idea what the affliction is. Would you want that in a shoe? Something that does that? Lauren says those shoes look like a weapon. Yeah, no shit. They look crazy. They look like jet boots or some shit. Cool. CES, a lot of really, really cool technology. I think the main takeaway looking through this though is very much eyes on Nvidia. And that will be important because if I were looking for ways to capitalize on this new technology",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 43,
      "start_timestamp": "01:00:12",
      "start_timestamp_seconds": 3612.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3612"
    }
  },
  {
    "text": "They look like jet boots or some shit. Cool. CES, a lot of really, really cool technology. I think the main takeaway looking through this though is very much eyes on Nvidia. And that will be important because if I were looking for ways to capitalize on this new technology wave, a lot of the things that we're seeing coming out, Nvidia is kind of at the heart of it. So it's something that I would integrate into the broader plan pretty carefully. Because as we're seeing all the different connectedness between these different tools, you can see clear as day that Nvidia is kind of at the heart of most of it. Meaning Nvidia is powering all the different automotive manufacturers. Nvidia is powering the robots. Nvidia is powering the self-driving side of things. Nvidia is powering the AI side of things. So that tells you if you're trying to gain exposure from a trading position to this kind of stuff, I think the way that we gain exposure is Nvidia is kind of the core of it. And then you can find offshoots, smaller individual companies that are in that broader ecosystem that might have bigger growth perspectives. Because that's the other thing to keep in mind. Is when we're trying to find like this list. And some of these will be better positioned to grow more than others. And depending on how well they participate, obviously, will directly impact the growth potential. Where is this? Uh-oh. Time",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 43,
      "start_timestamp": "01:01:41",
      "start_timestamp_seconds": 3701.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3701"
    }
  },
  {
    "text": "Because that's the other thing to keep in mind. Is when we're trying to find like this list. And some of these will be better positioned to grow more than others. And depending on how well they participate, obviously, will directly impact the growth potential. Where is this? Uh-oh. Time to figure out the dinner order. All right. Let's go through some of these. I want to see Lama index. So Lama index is private. Obviously, GPT still is. Let's see what else. Let's try Lang chain. Not publicly traded. Through AI. So crude AI looks like it is. What's the ticker? There's a bunch of videos about analyzing crew AI stock. But I don't see a ticker. Is this a publicly traded company? Do you guys know? Well, let me move the chat over here so I can pay. Yeah, I'm trying to, I don't see crew AI. Is it ticker? But I'm seeing stuff talking about analyzing it. Okay, so it says privately held. So I have no idea what those videos were talking about. Probably something else. Let's take a look at synopsis. So that is SNPS. And they've done nothing for the past year. That's interesting. So this one here is synopsis from the agent platforms and applications. We take a look at that. SNPS. They're not doing shit. So big, big, big roll over here. Strangely though, it looks like they might be grabbing a little bit. Of support. But I mean, that's just like,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 43,
      "start_timestamp": "01:03:18",
      "start_timestamp_seconds": 3798.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3798"
    }
  },
  {
    "text": "So this one here is synopsis from the agent platforms and applications. We take a look at that. SNPS. They're not doing shit. So big, big, big roll over here. Strangely though, it looks like they might be grabbing a little bit. Of support. But I mean, that's just like, that's a deep contraction from here. What is this 621 down to 47? That's too far. That doesn't look good to me. So interesting to see them doing so poorly. Let's take a look at maybe NetApp. So these guys we know in tap. These guys are doing better. Still on a short term time frame though. Contracting pretty heavily. Let me grab app. Just adding these to our list. Yeah, they don't look great. I take a look at maybe data loop. Private still fast. L-O-N. Is this right? What is this? E-Mining opportunities in Romania's in Bob Lee. Yes, so this ain't it. That's a whole different bag. Dan says I'm debating whether or not the market would care of LA Burns. I don't think so. The other thing is we've, California has had enough fires at this point. It's not really anything hyper unique. All right, so it looks like tonight's dinner plan will be some zah. So I got to find when you're in California though, you can't get good pizza. You just kind of have to resign the fact that you're going to get like shitty, shitty pizza and just get over it. Not ideal,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 43,
      "start_timestamp": "01:06:10",
      "start_timestamp_seconds": 3970.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=3970"
    }
  },
  {
    "text": "it looks like tonight's dinner plan will be some zah. So I got to find when you're in California though, you can't get good pizza. You just kind of have to resign the fact that you're going to get like shitty, shitty pizza and just get over it. Not ideal, but you do what you got to do. All right, let me get this order over to her. And now is a great time. If there's anything that you guys want to take a look at, poke through, please start throwing them in the chat and then we'll go through them together. I made a sauce, pepperoni, that's good. Perfect. Just a standard, standard pizza. What we don't like is putting a bunch of weird shit on our pizza. That part's kind of unacceptable. Okay. I am Gucci. Phil, yo, what up Phil? Phil says, what are we thinking for GME this week? Well, from the video earlier today, in case you guys didn't catch it, I did do an update on the GameStop coverage triangle that I have on right now. And I'm still scaling into the position, but I still have a lot of it open. So at least for me, that means I'm leaving a little bit of risk to be added on. I'm about 67.5 utilized right now. And so I'm using 16,900. And the total allocation is 25. Okay. So I'm leaving a little bit extra to be able to scale into it. I don't",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 43,
      "start_timestamp": "01:08:39",
      "start_timestamp_seconds": 4119.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4119"
    }
  },
  {
    "text": "least for me, that means I'm leaving a little bit of risk to be added on. I'm about 67.5 utilized right now. And so I'm using 16,900. And the total allocation is 25. Okay. So I'm leaving a little bit extra to be able to scale into it. I don't really see anything in front of it. That's like thinking like because it's kind of in a free zone here. It doesn't have a bunch of overhead resistance at this point. And the only overhead resistance stems back from like three years ago. That's a long time to like, I don't really consider that resistance overly relevant at this point. So this looks like it's probable that it'll oscillate in this range that I defined. And we originally defined this range some time ago. It's like 30 to 35 handle because again, this is just going back to the prior point of control that we could see from older timeframes and seeing how it's running in this general range. But one of the things I will note is that it does look like it's established a bit of a floor here. And it's actually starting to break above. And what I would consider to be potentially the new floor if it holds that as support, which is too early to tell. It needs to. It needs to oscillate a little bit more so that we can actually see what it might do. But that's what I'm seeing here. As always,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 43,
      "start_timestamp": "01:10:40",
      "start_timestamp_seconds": 4240.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4240"
    }
  },
  {
    "text": "I would consider to be potentially the new floor if it holds that as support, which is too early to tell. It needs to. It needs to oscillate a little bit more so that we can actually see what it might do. But that's what I'm seeing here. As always, thank you for the 1.99. And I like that it's specifically a 1.99. It makes me happy. I look forward to being reminded. That I am essentially a cheap prostitute. But hopefully that is helpful. It's my guess is somewhere range bound between 35 and 30. In terms of end of week movement, I already told you that I sold those puts and there's honestly a really good chance I'm going to have to move them up. So I have the 10 Jan. And when I first sold them, they were literally at the money. So there already a 50 I didn't even see this. They're already a 50 profit. So I sold the 32s and 10 Jan. They were a 44 Delta when I entered. So essentially what the 33s are now. And I sold them for 95 cents. So I'm going to have to chase this up a little bit. So what that means is I what did I get in at earlier 32 23. So yeah, because when I entered the stock, when I bought the stock, the stock was trading at 32 24. So then I sold the 32. So I'll probably take that down tomorrow,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 43,
      "start_timestamp": "01:12:07",
      "start_timestamp_seconds": 4327.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4327"
    }
  },
  {
    "text": "little bit. So what that means is I what did I get in at earlier 32 23. So yeah, because when I entered the stock, when I bought the stock, the stock was trading at 32 24. So then I sold the 32. So I'll probably take that down tomorrow, Tbh. And then my expectation is I will yeah, I'll have to move them up into like the 33. I don't want to get too far into chasing it because at some point, I would rather just buy the stock, but I don't think it's necessarily breaking out just yet. So yeah. Interesting, interesting behavior though, so far in GameStop. The other thing I wanted to do was, oh, hold on, I got another question from Tommy. Tommy says, are you going to roll up the GME puts? Yeah, that's essentially what it would be. Common. And this actually is an example where I would call it a role. But and it's because interestingly to talk about the concept of rolling and the how weird it is, this is a little bit different because I'm essentially running it at the same, the position is the same thing in my mind. I want it to do a specific thing. And it's just not doing it right now, obviously making money, but I would rather be making the money via long equity at this point on some of it. So what's it trading at right now? This is marking it at 2055,",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 43,
      "start_timestamp": "01:13:25",
      "start_timestamp_seconds": 4405.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4405"
    }
  },
  {
    "text": "I want it to do a specific thing. And it's just not doing it right now, obviously making money, but I would rather be making the money via long equity at this point on some of it. So what's it trading at right now? This is marking it at 2055, which just doesn't sound right. Yeah, because this shows it closed at 33. So does this just need to reload? I want to see if this updates. But this is another example where I essentially make much less via the short put than I would make if I literally just had the equity itself at least on the day. Now again, you can't always look at stuff that way. It's not really a fair comparison, but it is absolutely something I think about is that's why I try to gain most of the exposure via the long equity so that then the short put side of things is really designed to help me manage my basis more than anything. So because if I take a look, where are we? We are... what's GME distance off of 52 week highs? I think it's like 50 or something like that, right? 48.5. Now that again, that's using a squeeze high, so you can't really use that. But the total percent... That's another thing I need to take a look at one sec. I'm adding another thing in here for the current stock value as a percentage, because I like to see how",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 43,
      "start_timestamp": "01:15:00",
      "start_timestamp_seconds": 4500.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4500"
    }
  },
  {
    "text": "Now that again, that's using a squeeze high, so you can't really use that. But the total percent... That's another thing I need to take a look at one sec. I'm adding another thing in here for the current stock value as a percentage, because I like to see how much of the position is in stock versus puts. So what I do is I track the cash secured requirement, which includes stock and options. But then I like to split it out. So I'll do like stock requirement and then work put, the SP requirement, so that we can track these separately. So then of this, divided by this, and then we'll just do throw a negative sign in front of it. So right now for the long side of it, it's like 50.50, which actually I don't love. I would prefer it to be a little better balanced than that. Yeah, definitely. It's literally just about 50.50. It's 52 short puts right now, which isn't enough. So that means we need to gain a little bit more exposure here. So the way that we'll do this is definitely, definitely rolling up those short puts. That's going to happen. That has to happen at this point. And then from there... Yeah, from there, we will see. Because I'm going to try to put those, the short puts to be essentially, essentially parked right at the money. Yeah, super interesting. Well, we got a little bit of work to do",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 43,
      "start_timestamp": "01:16:29",
      "start_timestamp_seconds": 4589.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4589"
    }
  },
  {
    "text": "That has to happen at this point. And then from there... Yeah, from there, we will see. Because I'm going to try to put those, the short puts to be essentially, essentially parked right at the money. Yeah, super interesting. Well, we got a little bit of work to do then. I mean, realistically though, the year has been super, super mellow. So, you know, I'm kind of taking for what it is at this point. It's been very, very, very easy to make. So we need to add underneath CS required. I got to reformat these. That's okay. Cool. What else we got? Anything else we want to hit? Lauren says, I'm going to be so annoyed if GME bon cones on a day I'm busy at work. Well, you got to be prepared because you never know. You literally never know. Reese says you have a profit target in the coverage triangle. So the whole point of the coverage triangle is to maintain a long holding. So the way that it will work though as I'm moving into and out of the position is essentially if the underlying itself doubles. That's when I start scaling out, specifically for GameStop. Because what I did is I analyzed all the price, the previous price behavior for GameStop. And that's what I will base that off of. So yeah, I'm being just continue to run it. And then once we see a double of some sort, then I'll start scaling. Sweet.",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 43,
      "start_timestamp": "01:18:17",
      "start_timestamp_seconds": 4697.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4697"
    }
  },
  {
    "text": "GameStop. Because what I did is I analyzed all the price, the previous price behavior for GameStop. And that's what I will base that off of. So yeah, I'm being just continue to run it. And then once we see a double of some sort, then I'll start scaling. Sweet. Well, that wraps me up for the pro members. Don't forget if you want to do the outlier options trading pair program. O T P P O O P P think O O T P P. Keep the acronyms. Don't forget to sign up. I'm going to look to kick that off probably next week. So I'm going to leave that open throughout the rest of the week for those interested in signing up. And then if there's anything you guys want me to take a look at it as always, let your boy know. Be in outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "poletQA-Pxk",
      "title": "Market Recap, CES, & Tariffs | Outlier Options Trader Hangout",
      "url": "https://www.youtube.com/watch?v=poletQA-Pxk",
      "upload_date": null,
      "duration": 4867.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 43,
      "start_timestamp": "01:19:59",
      "start_timestamp_seconds": 4799.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=poletQA-Pxk&t=4799"
    }
  }
]