[
  {
    "text": "Options are really informed markets. We can glean a lot of information even if you're not an options trader, but if you are all the better. The goal is videos to walk you through three of my absolute favorites, options analysis tools, so that you can make better informed decisions because at the end of the day, leveraged markets are almost always going to bring in a lot of really smart, a lot of very smart, a lot of very smart money. Okay, it's not all smart money. You will find degenerates that find their way into options, but don't let this represent our illustrious community. There are a lot of smart money and traders involved in options markets. It's actually where a lot of interesting phenomena and effects can be found. Take for example, something like this. If we take a look outside of our friends at Wall Street Bet and we look at something like insider trading, what's smarter way is there to make money than insider trading? Take for example, our very own icon, somebody like Nancy Pelosi, who clearly is not insider trading, but her portfolio is returned over 700 in a decade. That's pretty impressive. It must just be really good at analyzing stuff. Joking aside, insider trading is actually a pretty smart expression for people. And the reason why people will use options to try to chase down insider information is because of the leverage. We can also look at option pricing and its",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=0"
    }
  },
  {
    "text": "It must just be really good at analyzing stuff. Joking aside, insider trading is actually a pretty smart expression for people. And the reason why people will use options to try to chase down insider information is because of the leverage. We can also look at option pricing and its informative of market moves. We can look even in really big indices like the SP 500 and we literally can extrapolate where probabilistic moves might be based on options positioning and it tends to be pretty damn good. The reason this all comes together is because if you have an educated opinion and you're trying to monetize it, most people who are strongly convicted in that educated opinion are going to look for leverage because you can make more money. So let's talk about how we can use some of these different tools to make us more money in trading options. We're going to start with very basic probabilities. Now probabilities derived from options trading are actually highly informative. So let's take a look at something like lunar and we can see this is what's called a probability comb probability analysis from think or swim. There's different tools that plot this in different ways. You can even make your own if you don't have access to this platform. You can do it in Excel. I've done it a bunch of times. What this does is on the X axis shows you based on different days to expiration duration. The Y",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:01:14",
      "start_timestamp_seconds": 74.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=74"
    }
  },
  {
    "text": "this in different ways. You can even make your own if you don't have access to this platform. You can do it in Excel. I've done it a bunch of times. What this does is on the X axis shows you based on different days to expiration duration. The Y axis shows different prices. And right now I have it fit to be probability of a touch within a one standard deviation range. So what this means is let's say what do we think the probability of lunar hitting 15 is within the next two weeks 14 days. Well rather than guessing or going off of some janky assumption that you have because you feel it in your left ventricle and you think that that's your heart's telling you the right direction your heart's probably aligned to you. But we could take a look at the 15 strike in 14 days and you can see it's a 24.71 percent probability of hitting that you literally can quantify the probability of these things happening. This really feeds into our ability to structure trades informatively because then we can look at things like expected returns based on the probability of this price being hit within our time frame. And then we can look at what our P and L would be at those points and make an informed decision. We can use delta as an approximation for an option being in the money at expiration. But it's only an approximation and I'll",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:02:29",
      "start_timestamp_seconds": 149.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=149"
    }
  },
  {
    "text": "being hit within our time frame. And then we can look at what our P and L would be at those points and make an informed decision. We can use delta as an approximation for an option being in the money at expiration. But it's only an approximation and I'll show you why that's the case because the probability of an option being in the money or out of the money actually have their own calculations. For those that geek out over this stuff as much as I do, you can actually check out this video which I realize this is the wrong one because if you go there, you're going to find a bunch of formulas and stuff and most people are going to click off and never come back. I'm just kidding. For those that are actually interested in why delta is used as an approximation for probability of in the money, you can check out this video, throw a link to the description below to it. And suffice it to say that the calculation for delta is very similar to the probability of an option being in the money or out of the money similar. They're not the same. And let me show you exactly how this works. So we'll stay in lunar for our example. We'll go into the trade window here and let's just pick this nine days expiration. If we take a look at delta, which is this column on the call side, we",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:03:27",
      "start_timestamp_seconds": 207.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=207"
    }
  },
  {
    "text": "the same. And let me show you exactly how this works. So we'll stay in lunar for our example. We'll go into the trade window here and let's just pick this nine days expiration. If we take a look at delta, which is this column on the call side, we take a look at this 39 delta option. Well, actually, let's start with the 48 delta option. With the 48 delta, we would expect there to be a 48 probability of this option being in the money at expiration. If we take a look at the out sugar calculated probability, it's 41.34. So it's actually a pretty big difference. It's six points in change. Why is it so different? It's so different because volatility really exacerbates this phenomenon. So if you take a look at something like Apple for a quick near term example, nine days expiration. And we take a look at the 50 delta, you notice that the 50 delta probability is actually 48.91. So it's actually pretty close, right? Like not not too far off. Well, even for something that is lower volatility a little more evenly priced markets, if we go far enough out in time, let's just pick this 191 days expiration. We'll do this 46 delta. The 46 delta option has a 39 probability of being in the money. So you notice as you go further out in time, the variance between delta is an approximation in the actual calculation, widens. You'll also notice",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:04:29",
      "start_timestamp_seconds": 269.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=269"
    }
  },
  {
    "text": "let's just pick this 191 days expiration. We'll do this 46 delta. The 46 delta option has a 39 probability of being in the money. So you notice as you go further out in time, the variance between delta is an approximation in the actual calculation, widens. You'll also notice that it's really dependent on volatility. So if we have more volatile stock like lunar and we go further out in time, let's take a look at this 40 delta. This is actually a 26.2 probability of being in the money, even though it's a 40 delta. So when you use delta, it can work just fine in near term stocks, meaning near term expirations for those stocks. And then also stuff that's not quite as volatile, but just know that there are limitations and it's not perfect. You can also use these probability cones that are just simply baked into the expiration cycle. So you'll notice that we can see what's the probability of lunar within the next nine days, falling within a 1.62 or 1.62 dollar range. And it's a one-stand deviation probability of being in there. So we can use all these different probabilities to inform our trades. The next piece here is volatility. We can use different elements of volatility to inform what we think might happen. If you're familiar with the things that I do for a lot of the more meme slash growth style stocks like lunar like game stop, we use volatility a",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:05:34",
      "start_timestamp_seconds": 334.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=334"
    }
  },
  {
    "text": "trades. The next piece here is volatility. We can use different elements of volatility to inform what we think might happen. If you're familiar with the things that I do for a lot of the more meme slash growth style stocks like lunar like game stop, we use volatility a lot. So let's take a look first at this idea of smile and surface. Now again, for those interested in going a little further into detail, I have two videos for you. I have one that talks about volatility, volatility surfaces, IV rank, IV percentile, all those kinds of things here. And then this one talks about volatility surfaces and smiles. Now I'm just going to give you a quick synopsis again for those that might not be interested in all the nerdy details. We can go back over to the option chain and we can plot the implied volatility for different options in different expiration. So all of these different lines represent a different expiration different this purple here is 13Ds, this kind of I don't know what color that is pink ish is 27Ds and so on and so forth. So if we clean this up, just pick a couple of the main explorations to make it a little more clear. We can visualize what the volatility is for different strike prices at different points in time. And why is this informative? Well, very often you'll find this kind of configuration where the out of the money puts",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:06:48",
      "start_timestamp_seconds": 408.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=408"
    }
  },
  {
    "text": "a couple of the main explorations to make it a little more clear. We can visualize what the volatility is for different strike prices at different points in time. And why is this informative? Well, very often you'll find this kind of configuration where the out of the money puts have much, much, much more expensive implied volatility compared to the out of the money calls. This is standard. Now what happens if you see this flipped? What happens if you see the call side have way more implied volatility than the put side? Well, that means that the market is actually a little more nervous about something going up and it's pricing in the probability of an upside move a little more heavily. And a decent example of this typically, I don't know if it is right now, but actually we do see it right now in GameStop. So if we take a look specifically at this 20Ds expiration, take a look at that. We can see that it's actually pricing the out of the money calls way more richly than the puts, which is not normal. That means that there is an expectation of an upside move, which is why these are being priced more richly. We can also see which strike prices are being priced more richly compared to other ones. Like for example, the 36 handle is here is definitely priced more richly compared to the 37 handle stuff like that. So that's more for more",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:08:00",
      "start_timestamp_seconds": 480.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=480"
    }
  },
  {
    "text": "is why these are being priced more richly. We can also see which strike prices are being priced more richly compared to other ones. Like for example, the 36 handle is here is definitely priced more richly compared to the 37 handle stuff like that. So that's more for more specific options trading and volatility traders. Now implied volatility percentiles a really important concept. This plots the volatility, the implied volatility for a stock against itself. Now there's a difference between implied volatility percentile and implied volatility rank suffice it to say that other video will go way further into detail on the differences, but implied volatility percentile is typically a better metric. The reason why it's better is it's less prone to skew. So if we go back to GameStop, we can see that the implied volatility percentile is 61, but the implied volatility rank is only 20. Why is this? implied volatility percentile plots the current IV and it literally looks at out of the past year, how frequently is the volatility higher or lower than where we are today? So what this means in this case is 61 of the time, volatility is lower than where it is right now. So it means volatility is actually quite elevated. Why does implied volatility rank only show it at 20? It's because this metric is very prone to skew. It uses the extremes. So even though we're definitely on a higher relative volatility over the past year, something like",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:09:02",
      "start_timestamp_seconds": 542.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=542"
    }
  },
  {
    "text": "is right now. So it means volatility is actually quite elevated. Why does implied volatility rank only show it at 20? It's because this metric is very prone to skew. It uses the extremes. So even though we're definitely on a higher relative volatility over the past year, something like implied volatility rank is going to include these kinds of moves when we have the squeeze back in the spring slash summer. So that metric is going to be skewed in here until that data point falls off. This is why I prefer implied volatility percentile. This tells us on a relative basis how volatile something is. Then we also have implied volatility versus realized or historic volatility. This again is more for the volatility traders out there, but this is how we can capture things like variance risk premiums. So what we want to see is how frequently is implied volatility running overstated relative to historic volatility. All this means in simple terms is the market is pricing in bigger moves than are actually happening. And as you guessed it, I have a video that dives deeper into detail on that. All the links to these will be in the description for you to check out whenever you feel like it. Why does that matter? Well, because if you're buying options, it means that you're typically buying options more expensive than what the moves tend to be. And then if you're selling options, you might be able to monetize",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:10:21",
      "start_timestamp_seconds": 621.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=621"
    }
  },
  {
    "text": "the description for you to check out whenever you feel like it. Why does that matter? Well, because if you're buying options, it means that you're typically buying options more expensive than what the moves tend to be. And then if you're selling options, you might be able to monetize that. Now we can also look at things like expiration volatility and skew. What does that mean? Let's take a look. First, we'll crunch that down pop over here. Expiration volatility gives us ideas on what might be happening in different time frames. So if I just eyeball through this, I can see that this 116 percent IV is much higher compared to the relative ones right before and after it. Why is that the case? It would be a bunch of different things. It could be partially because it's a primary expiration. It could be that there's an event expected going on here. More often than not, when you see a higher level of volatility further out in time than near-term stuff, it tends to mean something. We don't always know what it is. This is really useful for trading things like biotech stocks and whatnot. Now we already went over volatility skew in terms of out of the money puts versus calls in the way that that works on the volatility smile. But we can also take a look in the options chain itself to visualize puts skew. We can take a look at the individual implied volatility",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:11:35",
      "start_timestamp_seconds": 695.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=695"
    }
  },
  {
    "text": "went over volatility skew in terms of out of the money puts versus calls in the way that that works on the volatility smile. But we can also take a look in the options chain itself to visualize puts skew. We can take a look at the individual implied volatility for these different strike puts right now. We're looking in GameStop 37 days expiration. And we can see, like for example, that these strikes are actually really, really cheap compared to something that's closer and further out of the money. So what am I showing you? These are trading at a 79 vol. 22. But if we take a look at the 26, it's an 86 vol. And if we go way out here to the 11, it's 151 vol. So we can take a look at which strikes themselves have anomalous volatility either higher low. And then we can also look at the volatility relative per delta and compare puts to calls. So a 30 delta option on the put side here is an 80.7 vol. We go to a 30 delta on the call side. And we take a look at the vaults 135 vol. That tells you a lot because typically there's what we call puts skew. The market tends to price puts more expensively than calls because the market fears the downside. But this case, it's inverse again, that's indicating that the market is expecting some sort of upside move. Now, the last thing on our",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:12:36",
      "start_timestamp_seconds": 756.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=756"
    }
  },
  {
    "text": "a lot because typically there's what we call puts skew. The market tends to price puts more expensively than calls because the market fears the downside. But this case, it's inverse again, that's indicating that the market is expecting some sort of upside move. Now, the last thing on our list is a general tool volume and oh, we can use this to identify things like liquidity. And we can also use this to identify interesting options positioning. So let's take a quick look at what this looks like. First things first liquidity. So we can look at which of these contracts have really high volume and open interest. What you will almost always notice are the contracts that end in zero or five will have the highest open interest. This is just natural human tendency to like those kinds of round numbers. This will be across pretty much all products. So if I take a look at the 20 strike, there's 17,000 open interest. If I take a look at the 25 strike, it's 26,000 open interest. Everything in between it much smaller. Almost always the case. You'll also find that more often than not, most of the volume and open interest is going to be in primary expiration cycles because there's more liquidity there. Now, we can look to see if there's concentration at these different levels. And we can kind of use that to inform ideas. So one of the things you'll see me do is first",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:13:46",
      "start_timestamp_seconds": 826.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=826"
    }
  },
  {
    "text": "and open interest is going to be in primary expiration cycles because there's more liquidity there. Now, we can look to see if there's concentration at these different levels. And we can kind of use that to inform ideas. So one of the things you'll see me do is first find where we are in terms of explorations. So right now, when I look at the call options and put options in GameStop, I can see that most of the open interest is actually out in 17 Jan 25. There's a lot of cases where this will invert and we'll see it in near term explorations. That's the market expecting a near term price movement for some reason or another. That's usable information for us. I also like to see the total skew between call open interest and put open interest because when we see way more calls than puts, that tends to mean that the market is expecting an upside movement. That's why people are coming in here to buy calls. So we can also detect kind of standard activity, something like hedging behavior. So if we go into spy, you'll notice that the puts are really, really heavy. 12 million puts compared to 6.2 million calls. Why is that? Well, it's because a lot of entities will use spy or SPX to hedge a broad basket of stocks because there's a lot of things in the SP 500 index. They might have individual holdings and individual companies. And",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:14:55",
      "start_timestamp_seconds": 895.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=895"
    }
  },
  {
    "text": "12 million puts compared to 6.2 million calls. Why is that? Well, it's because a lot of entities will use spy or SPX to hedge a broad basket of stocks because there's a lot of things in the SP 500 index. They might have individual holdings and individual companies. And then they'll come in here and they'll use this to hedge the whole portfolio. Why does that matter? Because the context matters a lot. Because if you look at this outright, you might say, wow, they're expecting a market crash. That's why there's so many excess puts compared to calls, but it's not so much the case. You'll typically see it like this. Now you can track the actual ratio. And when that starts to move, then it becomes a little more interesting. So right now two to one puts to calls from tracking is I can tell you it's not that excessive. But if we see something like four to one, five to one puts to calls, that's people really ramping up downside protection for some reason or another. So these are three of my absolute favorite options analysis tools. Let me know if you'd like to see a part two because this is the tip of the iceberg. We can go way deeper in detail. And I would also love to know if you learned something in this that's of genuine interest to me. So let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:16:15",
      "start_timestamp_seconds": 975.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=975"
    }
  },
  {
    "text": "part two because this is the tip of the iceberg. We can go way deeper in detail. And I would also love to know if you learned something in this that's of genuine interest to me. So let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "POw4SNUpWPc",
      "title": "3 of my FAVORITE Options Analysis Tools",
      "url": "https://www.youtube.com/watch?v=POw4SNUpWPc",
      "upload_date": "",
      "duration": 1057.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:17:21",
      "start_timestamp_seconds": 1041.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=POw4SNUpWPc&t=1041"
    }
  }
]