[
  {
    "text": "What's up, everyone? What's going on, Mr. Peruvian Bull? I don't even think I know your name. What's your name? I usually like to keep my name, my real name on the DL. I can tell you offline. For sure. So try to stay anonymous. It's like PB good. Like for because Peruvian Bulls are mouthful to say each time. Yeah, yeah, no, PB Peruvian Bull. Like if you just say bull, that's fine. Yeah, no, all the above are totally fine with me. Beautiful. Well, I came across some of your work from actually my community. So just to give you like some super, super quick background. Long time trader been doing this my whole adult life from 33 now. And I came across GameStop long time ago based on some of its initial movements, right? Because I'm a derivatives trader. So things that exhibit volatility. I'm going to be there like, you know, a moth to light because we're looking for volatility. It's how we make money. So I traded GameStop for a little bit. And then this most recent resurgence. I was trading it again. But this time I already had the YouTube channel started. So then I was like realizing that there's a lot more to this than I originally realized. I didn't understand the story behind it. I didn't understand the different players. I literally was just trading it previously. So anyways, long story short, started a series where I was looking closer at GameStop",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "I was like realizing that there's a lot more to this than I originally realized. I didn't understand the story behind it. I didn't understand the different players. I literally was just trading it previously. So anyways, long story short, started a series where I was looking closer at GameStop because from a trader's perspective, it's like a anomaly, right? Like I've been trading my whole life and it just completely differently than everything else. So I cannot help but be fascinated. Then you throw in a character like the cat who you look at him. And this dude's losing 200 million dollars in a day. And he doesn't care at all. Like everything related to like logical trade management. It's not there. So it's like it's nuts. So I became infatuated with it. And then my audience, they were like, yo, do you know this dude? Because he looks at some of this stuff too. And I was just like, oh, perfect. I'm looking to talk to everybody I can. I met with Richard Newton a little bit. He and I did a couple live streams. And I text with him about the madness that is GameStop. But that's how I came across you. And I'm absolutely stoked to chat with you about it, man. Yeah. No, thanks for having me on. I've been involved with the community, you know, since January of 2021. I've been grateful to be here. It has been a while right. And that is,",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "how I came across you. And I'm absolutely stoked to chat with you about it, man. Yeah. No, thanks for having me on. I've been involved with the community, you know, since January of 2021. I've been grateful to be here. It has been a while right. And that is, you know, what you mentioned right there is the key point that I think most people do not get is that GME is not like the others. You know, it is a, it is a complete anomaly in terms of, you know, trying to trade and understand its pricing movements. Like it doesn't follow the normal laws of supply and demand. And that's what has has changed people to use on the financial system and made people realize that there's a lot of stuff going on beneath the surface with regards to stock lending, you know, settlement plumbing options derivatives that doesn't normally occur with other stocks. So yeah, it's, it's an incredible journey. And I think if you the deeper you go down the game top right the whole the deeper you'll realize, you know, how little you understand about the stock market because this thing is a behemoth. And there's a lot of skeletons in the closet. I think that's one of the what you just said there is been one of my favorite things about this because I have, you know, buddies that trade that I'll talk with them be like, dude, like, why are you so",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "And there's a lot of skeletons in the closet. I think that's one of the what you just said there is been one of my favorite things about this because I have, you know, buddies that trade that I'll talk with them be like, dude, like, why are you so obsessed with like understanding game stop, you know, move on do something else. And I try to explain to them, I was like. The most interesting thing I find about game stop in like the ape community, which I continue to reiterate like I view myself as a guest right because I'm I traded it for a while, but I don't know anything half of what long standing people in the community know and I respect it. But one of the most intricate like intricate details about game stop is how involved the ape community has gotten with all these small tiny nuanced concepts that you can ask the majority of traders like my friends who've been trading as long as I have. They don't know shit about it and it's because like from a trading perspective, it doesn't impact us directly. So it's offered me a completely new lens to learn more about this world that I'm obsessed with, which is trading, right? So it's what I do. So the first thing I wanted to ask you though, just so I can gain some more context about your background is you said, obviously you're around 2021 what led you",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "to learn more about this world that I'm obsessed with, which is trading, right? So it's what I do. So the first thing I wanted to ask you though, just so I can gain some more context about your background is you said, obviously you're around 2021 what led you to game stop? Was it like the same as most other people or had you been trading for a while and then pivoted over to that? How did that start? Sure, no, yeah, I've been I've been trading since 2016 actually. I'm all of the look. I have a baby face, but I studied. I'm just late 20s late 20s late 20s. Yeah, I mean, I don't know. I should have asked the chat how old they thought you were first because I would have I would have guessed mid to late 20s. See that that's the other thing that was that you have I'm assuming you're Peruvian right. So you have some brown in you somewhere. Yeah, yeah, yeah, I'm I'm I'm half-frupping by an American citizen. Yeah, well, good. Okay, I've ever been everybody is worried about deporting this guy chill. He's American citizen already relax. If I says listening in calm down, but I it's just a fact that like as you could tell I'm as white as they come and we just aged terribly right because when I told you I was 33 you're probably like, you know, this motherfucker looks like he's 45. But yeah,",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "says listening in calm down, but I it's just a fact that like as you could tell I'm as white as they come and we just aged terribly right because when I told you I was 33 you're probably like, you know, this motherfucker looks like he's 45. But yeah, it's like the exact opposite that you have where you'll look. Young forever and I look like I'm dead already. So sick great for me. Well, I know I think you're fine. I think that beard adds some and I've grown on my beard to before and it does you look a little more aged. But yeah, if you cut the beard, you'll probably you'll probably like me probably you look like a. I look like a 20 year old with yeah, look at the child without the beard. It's actually kind of scary. I had my my wife knew me when I was on active duty in the Marine Corps and she literally is told me like she's like this only time I've ever saw your face. It's like ever since I went on the reserves and whatnot. I've never seen my face either. So hopefully I won't know what it looks nice nice actually my family military. My brother was in the Navy. Beautiful. So very curfew years. Yeah, yeah, it's good. So yeah, but trading since 2016. Yeah, yeah, so trading since 2016, but I you know, I studied finance economics and I want to go work",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "what it looks nice nice actually my family military. My brother was in the Navy. Beautiful. So very curfew years. Yeah, yeah, it's good. So yeah, but trading since 2016. Yeah, yeah, so trading since 2016, but I you know, I studied finance economics and I want to go work for a FinTech company doing basically like valuations to work. And so I also have some internships here and there with like, you know, actually portfolio management, but actually like out of college, I went into literal just valuations of. Small the small the medium size enterprises and in 2021, you know, we see this massive rise in the GameStop prize. I start following it like the second week and instantly I'm led to the DD, which is all this older post it from, you know, I'd say, no fall of 2020 and even before discussing why GameStop is a massive value play and why this stock is overshorted. And as this talk begins to rise right through early 2021 through this, you know, second and third week of January, you know, I'm working in this in an office building with all the other financial analysts and and valuations managers and CPAs and either couple guys who are charting obviously because you know we're in finance. So they want to just make money on the side apart from their day job. And I get a lot of them to start looking to this extra company slack on a long GME.",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "and CPAs and either couple guys who are charting obviously because you know we're in finance. So they want to just make money on the side apart from their day job. And I get a lot of them to start looking to this extra company slack on a long GME. So we're all talking about GameStop. And we start noticing like some really weird, you know, movement price movement, like, you know, you see the stock rip up into the after hours and then once it enters after hours, the stock price tanks, we start seeing news news media and coverage come out in insanely negatively on this is the third week of 2020 of January 2021. And then you see the large shorts like Citron research, for example, a bear traps or bear traps style publisher. He comes out and he's just like this thing's going to to 5 you guys are all retarded you don't understand short interest like this thing's going back to zero and the stock keeps rising right past 20 into 30 40 50. And on the Friday of it was the 20 21st of January, we see the stock price rip up into like 50 and then get slammed down to 30 and then close at 40 and everyone and it was this kind of sensation of like, okay, this like a storm coming like what the hell was that like I have never seen a stock rip that much and then collapse in",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "50 and then get slammed down to 30 and then close at 40 and everyone and it was this kind of sensation of like, okay, this like a storm coming like what the hell was that like I have never seen a stock rip that much and then collapse in the after hours then close higher like I've never seen that. In my life and that weekend was kind of quiet right and there were some articles coming out Melvin capital is underwater you know Citadel is looking into you know rescuing them and and funding them and then the next week Monday Tuesday the stock price just starts to go parabolic and starts to rip through all barriers right we're talking goes to from 50 to 80 to 100 to 150 to 200 and you know the financial media the financial service goes crazy. And as someone who's like again I studied finance economics I'd had I'd worked at a large insurance carry before I've I've I've I've familiar with the media right and I've been studying also I'll say this to prior to this I've been studying for about six years macro economics in depth. You know mainly focusing on trifters dilemma reserve currencies and I'd also been looking at you know oil markets and so I've been doing a lot of research in that area but it was separate from you know the more I thought like arcane or just boring stock market I was more into",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "focusing on trifters dilemma reserve currencies and I'd also been looking at you know oil markets and so I've been doing a lot of research in that area but it was separate from you know the more I thought like arcane or just boring stock market I was more into the macro side and but as the stock price began to rip in the entire financial media charted out I was you know curious I'm like what's what's their bone to pick like if they're going to be a business is actually a dying company that only a few hedge funds are shorted why is the entire financial establishment coming against this you know and then two days later we got our answer they shut off the by button and froze buying for basically like I was like 175 retail brokers basically the entire retail broker ecosystem and the only places you could actually get orders through or Vanguard and fidelity and the reason why is because those those large you know asset managers had their own you know they had their own internal inventory of GMM here so they could sell it to you but otherwise if you try to go to the open market you were enabled to buy right and all right so a lot there so first question though off shooting a little bit what do you think of oil here now oil starting to pop up a little bit. Oh yeah you know it's in",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "to go to the open market you were enabled to buy right and all right so a lot there so first question though off shooting a little bit what do you think of oil here now oil starting to pop up a little bit. Oh yeah you know it's in the 70s yeah I well I think oil broadly is a you know indicator of of economic strength right and so and it also is an indicator of of you know how I in my opinion of a political desire to lower inflation so whenever they join the SPR and they lower oil prices oil get lower gas prices to me it's a political move and I think that there's no there's no doubt that are doing this before the election to help secure you know democratic vote because they want to make the incumbent look better so my opinion if I would to guess on oil prices although I don't follow them as much as I used to far to guess I'd imagine we're going to remain range bound because they're going to try to increase production especially domestically in the US until the election. Yeah I was surprised that they didn't already announce it to be honest as soon as I started so it start rolling into the high 60s I thought for sure they were going to uncork it but yeah let's see maybe they're just a little slow to the punch here um cool so going",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "that they didn't already announce it to be honest as soon as I started so it start rolling into the high 60s I thought for sure they were going to uncork it but yeah let's see maybe they're just a little slow to the punch here um cool so going back to GameStop then when you first started getting involved with it did you set up your portfolio in a way where you're like still trading doing your thing and then had some of it in GameStop are you roaring kitty degenerate level all life savings going on. To something like just getting a scale of how that looks. Sure so I had a large out of large portfolio invested in large at least you know my in my in my in my view wasn't wasn't make less than 50,000 or less than. No less than 30,000 total but yeah um I because at that point I'd only just started working because I had trouble getting a job during the pandemic but I was mostly in actually gold stock prior to GME gold miners and I bought a bunch of leaps on those and so I liquidated some of those positions and so by the end of January as probably half GME and half gold stocks but a large part of that was also because of appreciation right because I started buying in at like maybe like 80 and then the price was at like 300 400 so yeah at",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "positions and so by the end of January as probably half GME and half gold stocks but a large part of that was also because of appreciation right because I started buying in at like maybe like 80 and then the price was at like 300 400 so yeah at a certain point I think it was like 70 GME so yeah I grew it to a large portion of my portfolio. Yeah got it interesting because that's one of the things I find so interesting about people who trade GameStop in different ways because um my portfolio turnover is exceedingly high right I'm trading so most of my stuff I might hold for like a couple weeks. So that's why I asked that question is because it's interesting to understand the dynamics of do we let it grow and consume more and more of the portfolio do we cut it down move it to other things they also think that that reflects a lot of the conviction which it sounds like you were still pretty strongly convicted with the direction it was going. Absolutely yeah I mean like them turning off the buy button was the answer that that was the answer the question we had we thought can this thing blow up the financial system and the answer was yes they had to shut off the buy button for a reason because it literally was doing that that's what people don't understand with with GME right like there's",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "was the answer the question we had we thought can this thing blow up the financial system and the answer was yes they had to shut off the buy button for a reason because it literally was doing that that's what people don't understand with with GME right like there's been other stock squeezes before but none of them were ever systemically risky right like this was this was essentially a lean in moment for um stock market and so this was difficult for most people most traders to understand and then what happens later right if you if you follow the stock price of GameStop and you follow if you follow the community in those early days. After that week after that week right they freeze buying they restrict and then they restrict buying for the next like we can have. All this media you know FUD comes out they tell us that retails dying they've tapped all their savings we're all going into silver it's over the reddit crowd is crazy they shut down the discord there's a community discord for Wall Street bets um and then they even have talks about suing reddit for market manipulation etc and over the next few weeks of early February of 2021 the stock price just tanks and it goes all the way back down to like I think it's like 40 at one point. And everyone said like all the traders who like day traders who said like look this",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "and over the next few weeks of early February of 2021 the stock price just tanks and it goes all the way back down to like I think it's like 40 at one point. And everyone said like all the traders who like day traders who said like look this is just a squeeze it's over you know you guys should have sold at the top you're all retarded you know now you're all baggolders ha ha ha there's all these memes everywhere right and we all thought we're like you know Fuck man maybe that's right maybe this the squeeze is over and maybe they were able to escape maybe maybe they covered at 300 and this is it like it's over and then late February was like 20 February like 23rd or something the stock price after hours goes from 40 to 100 and then the next day goes from 100 to 140 and we're just like what the fuck we are so back yeah we're so back and then over the course of the next month it goes back up to 300 and it touches 300 multiple times and every time it touches 300 we see a whip saw where it gets rocketed down by like 80 bucks especially after earnings. Go look at the look at the history of gmysok trace after earnings it's insane like the stock price will. Kind of go lower and then it'll in the week or so before you'll run up",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "whip saw where it gets rocketed down by like 80 bucks especially after earnings. Go look at the look at the history of gmysok trace after earnings it's insane like the stock price will. Kind of go lower and then it'll in the week or so before you'll run up usually and then after earnings will get it'll get slammed and so we saw in March of 2021 i remember watching live the stock price went to like 305 and then after earnings it went down to 150 and then it came back up to like 200 so it got like i mean again these are moves you never see in another stock you know so the funny part that you mentioned about the moves that you don't see in other stocks i back literally way back in like the mid 2010s i had started buying data from Sebo so that i could test ideas and this is you know a little bit old school compared to what you can do now but every time that i would test different ideas from like an option trading perspective understanding how things work in different size companies whether it works differently in indices ETF stuff like that and every single time that i would get like these weird returns in the strategies there was a handful of names that kind of became the usual suspects and in the beginning you know it was minor deviations yada yada yada and then all of",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "indices ETF stuff like that and every single time that i would get like these weird returns in the strategies there was a handful of names that kind of became the usual suspects and in the beginning you know it was minor deviations yada yada yada and then all of a sudden you come into like the early 2020s the same fucking name pops up over and over again those fucking game stop was in that cohort of things that just kept breaking all the rules with these different strategies and i was like what the fuck is this so it's funny that you guys picked up on very much of that same anomalous movement now one other question i had for you and then we can kind of pivot to some of you know what the chat wants us to talk about they have a couple questions about like swaps and stuff like that but just another general question for my own understanding one of the things i find so fascinating about the ape community is i find there to be like a broken a broken approach just in terms of methodology and again this is just like from a pure a pure trading perspective so a lot of people they talk about moas or like wanting to see like this really big squeeze i understand that the part that i don't fully understand is that most of them when i kind of will talk to them about like",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "a pure a pure trading perspective so a lot of people they talk about moas or like wanting to see like this really big squeeze i understand that the part that i don't fully understand is that most of them when i kind of will talk to them about like how this works you know what's the plan there's no exit plan for a lot of these people right they kind of just talk about like up or to the moon and from i don't know if it's like if i'm looking at it too literally but from a trading perspective i just think like like i get that we want a big squeeze i get that and i love that but but if you hold it all the way through then you don't make money right you still have the same so then to me it almost sounds like it's like a a value play right because if we're thinking long-term holdings we're thinking long-term price accumulation but there's so much focus on the squeeze i don't get that so to summarize all of that why is there the emphasis on the squeeze but then the traders don't have like an exit strategy during the squeeze why is that so that's kind of a meme i mean it's it's from the reason why that is is because so okay so during that week right the last week of january 2021 which was this is kind of like the you",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "like an exit strategy during the squeeze why is that so that's kind of a meme i mean it's it's from the reason why that is is because so okay so during that week right the last week of january 2021 which was this is kind of like the you know watershed moment that anointed most of the original OG gme apes but there were other watershed moments like march of 2021 or april you know or a lot of the earnings events or even like this summer right we saw massive swings in the price in man June of this year yep um and then you know swings in the price of chewy as well and other related stocks um during that initial week right people were coming to wall street beds the the audience size was growing exponentially right they got front page of reddit like dozens of times during that week like you know they were the most popular subreddit literally for the entire month and people were referring to dfv and they were saying look like he did this stuff in september of 2019 he bought more in 2020 and he's been holding and he started posting these daily updates where he shows his holdings and you see like oh the stock price calls at 201 day he's at like 13 million then it falls down to a hundred dollars the next day and then he's at six million and he doesn't sell a share yep",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "posting these daily updates where he shows his holdings and you see like oh the stock price calls at 201 day he's at like 13 million then it falls down to a hundred dollars the next day and then he's at six million and he doesn't sell a share yep and everyone's like whoa and and then this you know kind of climax as you could say in the them cutting off the buy button so after they cut off the buy button there's a lot of panic selling a lot of people freak out in the community they think oh my god the squeezes over they're not gonna let it squeeze they're not gonna let this happen you know this flood and just negativity spread and dfv tweeted at the end of the at the close of business day a close of market like his update and he hadn't sold a share and everyone was just like holy shit like this guy it's it's another it's like another you know it's a complete wrench in the in the in the ideology of of most you know big bank traders right like you're supposed to you're supposed to sell and make money and why would he not sell at the top like you don't understand and then there was an older Reddit response for him when people asked him what is extra strategy and he's said what is the next strategy yeah his goal is to hold it forever and",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "make money and why would he not sell at the top like you don't understand and then there was an older Reddit response for him when people asked him what is extra strategy and he's said what is the next strategy yeah his goal is to hold it forever and so people coalesced around him and they said look he during all this corruption during all this bullshit he didn't sell and there's this rage built up from 2008 that kind of boiled the surface and all these posts went viral on Superstalk that day or I'm sorry on Walsh events discussing the 2008 financial crisis and how it affected us and they said this is one of our chances to get these people and with them shutting off the buy button people were furious and people started buying GME we saw people who had no money who their last 200 bucks they bought some GME and they said I'm doing this not you know not for any like profit reason but because my brother committed suicide because he lost his home in 2008 or my uncle was an investment bank or lost his job lost everything and he went into depression for for 10 years like there's all these personal stories that started spreading so people said you know we're not sell we're never selling like if they're never if they're going to pull the strings and change the rules we're going to change the rules so the meme",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "into depression for for 10 years like there's all these personal stories that started spreading so people said you know we're not sell we're never selling like if they're never if they're going to pull the strings and change the rules we're going to change the rules so the meme was like they should off the buy button we should off the sell button so we won't sell and so the point is yeah so for a lot of people look and a lot of people said you know I'm not going to paint the community as a monolith because it isn't this is just a group of people who are interested in the same thing just like the Bitcoin community but I would say this a lot of people even with large number of shares are going to say we're not selling a large portion of our shares because we want the squeeze to happen and we want to destroy these hedge funds that have overshorted games up and overshorted bad beth and beyond and overshorted 50,000 other tickers since you know they've discovered this naked shorting loophole and the FTD loophole and the goal is to bankrupt them right to get them out of the market because what they're doing is damaging I don't know if you've ever heard of seller boxing um trading but you know there's a uh there's documentable evidence from all the large brokers um that market makers hedge funds and then the banks",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "right to get them out of the market because what they're doing is damaging I don't know if you've ever heard of seller boxing um trading but you know there's a uh there's documentable evidence from all the large brokers um that market makers hedge funds and then the banks themselves have been engaging in predatory naked short selling practices and this has been by the way this has been going on for decades there's a there's a court case in 2005 that was brought before um that went all the way up to a supreme court that actually forced a lot of public attention on this and it also forced congressional hearings which made the SEC implement reg show and they created the threshold list showing like how many days stock has been overshorted and if it's more than I think it's uh one percent of the float um or not if it's FTD if if it was one percent of the float is FTDing for five trading days consecutively you get put on the threshold list and so all these implementations got put in place in there in the early to mid 2000s because this was known to be an issue I mean there was CMKM diamonds there was um um oh there's another one there's an investor by the name of oh global links uh Richard Simpson uh or Robert I think his name was Robert Simpson an investor from Nevada he bought um all the the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "be an issue I mean there was CMKM diamonds there was um um oh there's another one there's an investor by the name of oh global links uh Richard Simpson uh or Robert I think his name was Robert Simpson an investor from Nevada he bought um all the the entire float of a real estate holding company those the public listed and the next day a hundred million shares traded and so he basically sent a complete to the SEC saying what the fuck like how how are shares able to trade if I own all of them at their in my brokerage account and no and and as by the way yeah and and actually I should he didn't own all of him he owned 111 percent so he owned more than all of them so he was like how is it possible that literally the entire like multiples of the float is trading when I own the whole thing and I'm not trading it with anybody shouldn't happen right and so theoretically theoretically and so this started to like what happened is the game shop quickly became for you know I quickly switched from a um you know I would just say like a a funny, memeable event in financial market history into almost like an active crime team investigation where we saw you know mathematicians data analysts financial analysts like going through the data and saying like look at all these anomalies this is weird or",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "know I would just say like a a funny, memeable event in financial market history into almost like an active crime team investigation where we saw you know mathematicians data analysts financial analysts like going through the data and saying like look at all these anomalies this is weird or finding historical examples of naked shorting in predatory practices from hedge funds and saying like this is wrong like I can't believe they were able to short you know 200 300 percent of float maybe more than that this is predatory and what they're doing is destroying companies and also obviously putting the disability of the US stock market at risk and so that's when GME started to switch into almost like a you know an active investigation and some people just became curious and learning as much as they could about the stock market and the plumbing and that's when we got brought dr. Tion and adabit has a series which I don't know if you're familiar with that stuff but um yeah we went really deep into the plumbing and we found out a lot of shady shit a lot yeah definitely I um I'm actually pretty good friends with Dave Lauer who I spent a while talking about like the internal mechanics of this stuff in the in the early days but the from a trading perspective I think it's one of the things that's just so fascinating to me because like from the way I look",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "friends with Dave Lauer who I spent a while talking about like the internal mechanics of this stuff in the in the early days but the from a trading perspective I think it's one of the things that's just so fascinating to me because like from the way I look at it is the more money I can make on the movements the more I can ultimately buy so it's a really interesting thought process to learn right like they turn off the buy we turn off the sell it's just it's very interesting to me so thank you for the detail there because again like I really I enjoy learning about this stuff so much because it's so different from a lot of this stuff that I look at which is yeah kind of boring at this point it's same same day over day um of course now when we get into the world uh I think I did I want to say like three or four live streams with Newton early on before he started like he went back to his job and all that's like super busy now but he was teaching me a lot about like the background the history and those kinds of things so I he's kind of been my general scribe or understanding the context here now one of the things that I find so interesting about a lot of the due diligence that I come across is that they're it I don't",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "the background the history and those kinds of things so I he's kind of been my general scribe or understanding the context here now one of the things that I find so interesting about a lot of the due diligence that I come across is that they're it I don't even know how to describe it it's almost like there's like fucking tentacles where as you're looking at something you're trying to follow this train of thought then there's like this little offshoot here that grabs this other interesting thing and then this offshoot over here that grabs this other interesting thing when you think about like the broader case for GameStop right like the the main thing not going off all the offshoot the tentacles but like the main case for GameStop just in terms of a company and its viability its future what do you view that as as it sits today so I would say there's actually two large aspects of this right obviously you know the first is the short sweet document so you know GameStop again this is where we start to get into maybe controversial territory because someone who's looking at short interest today will say the short interest sits at 22 or 28 or whatever is that and I would say sure that's what the reported short interest is but if you followed GameStop back in 2021 you remember seeing finrad data showing 140 short interest and then they found out during that",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "will say the short interest sits at 22 or 28 or whatever is that and I would say sure that's what the reported short interest is but if you followed GameStop back in 2021 you remember seeing finrad data showing 140 short interest and then they found out during that week of the last week of January 2021 that 140 was the technical limit that they were that finra was allowed to report short and other people found other brokers reporting 220 short interest and 315 short interest so we quickly realized and that combined with some volumetric data and just the you know the amount of FTDs on the stock were like holy shit they probably shorted multiples of the float and there's basically no way to close this position and the you know the argument that other traders had for years right was well or maybe not years but for the most of 2021 most people who are skeptical of GameStop were saying look yes there was a huge overbilled of short interest that short interest was evaporated in the run from 10 to 300 400 it's all over you guys miss it just hitting that is crazy right in the run from 10 to 300 400 dollars sorry it just the numbers sometimes when we talk about this stuff it never escapes me how fucking crazy that that in and of itself is yeah but it should have gone into the thousands right right like I'm completely",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "right in the run from 10 to 300 400 dollars sorry it just the numbers sometimes when we talk about this stuff it never escapes me how fucking crazy that that in and of itself is yeah but it should have gone into the thousands right right like I'm completely serious like no I know before before we yeah the CEO of interactive brokers Thomas Petterfee went live on CNBC on on January 28th and he explained he was first of all he's crying and saying you know we need to stop this we need to you know this is market mania but then they're asking what was happening he was saying like our settlement system was breaking like the FTDs were forcing continuous net net settlement to sort of force close all positions and he's like if this had if we hadn't enough the buy button we would have seen a general stock market meltdown because literally the CNS the way it would work is if there's FTDs that are you know being forced to close they'll they'll go to your brokerage account they'll override even the hedge fund like their ability to to manually trade or input trades it'll override their ability to manually trades manually trade and it will start liquidating their positions and using the cash the debits to fund purchases of GME and so he's like with you know what was it I think it was like a man it was insane it was like",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "it'll override their ability to manually trades manually trade and it will start liquidating their positions and using the cash the debits to fund purchases of GME and so he's like with you know what was it I think it was like a man it was insane it was like 70 of the float that week was expiring in options and with 140 reported short interest but obviously probably higher around 200 and with buying at record highs obviously each of these days was like 80 by volume he's like there was a shortage of hunt like we're talking hundreds of millions of GME shares and the float at the time was 80 million so he's like everything is 85 million so he's like how would you fulfill that he's like you can't so he's like the price would go into the thousands and he used the word plural thousands for a reason and so I mean we saw like this will shock most people because again most people don't don't realize this some people try to do fractional sales on the morning of of the 28th oh right yeah I heard this and some of these fractional sales sold for 2600 30 200 and the highest was like 5200 so they were selling shares for 5200 dollars in the in the in the few seconds before they turned off the buy button at around 9 30 a.m. Eastern time so or I think it's 935 or something yeah so",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "for 2600 30 200 and the highest was like 5200 so they were selling shares for 5200 dollars in the in the in the few seconds before they turned off the buy button at around 9 30 a.m. Eastern time so or I think it's 935 or something yeah so like five minutes into trading like they literally this thing was it was breaking the settlement system literally right and so that's what people need to understand like this is not a normal stock and then it's not a normal squeeze either right even Volkswagen didn't see didn't see this kind of activity and so yeah this changed the entire market infrastructure and everything now when looking at something like the squeezes I think the idea of like how far something goes I get the the premise right behind theoretical movements but I assume people know that governing bodies aren't going to allow a financial system to collapse because of this so it unfortunately will come at the cost of people not being able to buy the shares or whatever and it shouldn't happen because of the institutions that are systematically short that are causing the fucking problem but still that being the case in the reality like regulating bodies still aren't going to permit like a broad collapse right that's why they stepped in how do you like when you think about that how does that factor into the way that we think about game stop in like future",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "that being the case in the reality like regulating bodies still aren't going to permit like a broad collapse right that's why they stepped in how do you like when you think about that how does that factor into the way that we think about game stop in like future squeezes and stuff knowing that that that there is a backstop well I would say I would say this right like they would allow they can allow significant damage to take place but they cannot be right they cannot allow systemic failure and so what happened in January 2021 was literally the early stages of a systemic failure massive again at most people thought that this was a short squeeze but when the when the House Financial Services Committee report came out in October of 2021 they looked at the internal SEC data and found that it actually was not a short squeeze January 2021 was not a short squeeze in the shorts oh yeah I read that I read that report it was fucking wild and it is wild right because that that changes everything it's like holy shit these positions are still open and they're they're probably unclosable so you're right like okay so you know the financial authorities that be don't want to system-wide collapse but they obviously they can and they will allow large players to collapse I mean we saw the collapse of you know Melvin Capital we saw the collapse of Citroen research we've",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "so you're right like okay so you know the financial authorities that be don't want to system-wide collapse but they obviously they can and they will allow large players to collapse I mean we saw the collapse of you know Melvin Capital we saw the collapse of Citroen research we've seen Bill Hwang's fund was it Archie Archagos Archagos Archagos yeah Archagos or whatever you call it which is kind of funny because if you think of it the way that the fund is pronounced Archie goes it's like yeah basically it's a kind of a narcissistic name and then Credit Suisse and again all this stuff right like may not have been connected on the surface but when you look through some of the internal documents it there's the credits like for example the Credit Suisse position with their their total return swap position with Archagos the you know the no-sional losses on that spiked in the last week of January and the last week of February of 2021 and so they don't they don't disclose what's exactly in the in the basket swap but it's obviously that that's GME is one of them and my conversations with Dario who's another financial analyst and commentator also confirmed that he knows people at those banks and he's like yeah from what I've seen GME was a large portion of the short position of those swaps and again this the problem with the swaps and derivatives in general is that all",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "who's another financial analyst and commentator also confirmed that he knows people at those banks and he's like yeah from what I've seen GME was a large portion of the short position of those swaps and again this the problem with the swaps and derivatives in general is that all this stuff is off balance sheet right it's okay it's not reported in the same way that most positions are imported so we can't see it as easily not to say that there's nowhere to see it but even if you even the information we do have is limited so but yeah just one other note on that for people because I I spent a while looking into the swaps for folks and we'll talk about those a little bit more in a few moments but I think another problem that people don't understand in general with swaps is that they're highly individualized so understanding the terms of an individual swap is essentially impossible to comprehend so let's because it's unknowable to most people so because even you know we can see if it's something that can be rolled or not technically but there's nothing that says that that contract can't be closed and anyone can be opened which is rolled so yeah I just think it's an important note for people because I see a lot of interest in swaps trying to understand the impact you know that I can have on price movement and that's one of the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "can't be closed and anyone can be opened which is rolled so yeah I just think it's an important note for people because I see a lot of interest in swaps trying to understand the impact you know that I can have on price movement and that's one of the most difficult parts about using swaps is it's kind of like looking into a little bit of a black box we have some details but they're like literally opaque is like one of the best words I can think of for them because they're also very very modifiable by the governing well the two parties that are involved yeah yeah no I would agree with that you know I would say though that there are general you know from my study of the swaps like there are general like outlines they use so it's not like every single swap is the you know a completely new invention with new terms there's standards and rules and procedures so it's like most swaps will have the same basic you know factors right same basic formats and so but you're right there are there opaque you don't know the exact terms and you don't know how well they're hedged because again there's a whole off balance sheet and so that's why the swap predicting the price for swaps is very difficult yeah very difficult although it has been it has been accurate a few times I've ran I've ran a really significant regression",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "don't know how well they're hedged because again there's a whole off balance sheet and so that's why the swap predicting the price for swaps is very difficult yeah very difficult although it has been it has been accurate a few times I've ran I've ran a really significant regression on a bunch of these different general ideas swaps FTD's FTD's on various ETFs containing other baskets FTD's on game stop itself there even technical indicators I was just looking I ran like 162 standard technical indicators to understand correlations and then regress them and it's it's really interesting because to your point you can always find instances where something will line up but like the predictive capability broadly is is very low which is yeah knowing but is what it is yeah yeah but to your early point right like you know what will happen well they I think you know there's a little bit of a tinfoil around this right is oh there you go there you go nice my wife made that specifically for these as soon as I hear tinfoil I have my shit ready there you go I love it I love it the two little horns are great too so waking up yeah no look there's a there's tinfoil you know kind of theory out there that Ryan Cohen is is planning you know basically to allow the squeeze to happen again and the it what they're what they're you know working with the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "little horns are great too so waking up yeah no look there's a there's tinfoil you know kind of theory out there that Ryan Cohen is is planning you know basically to allow the squeeze to happen again and the it what they're what they're you know working with the SEC force to prepare the way so that it isn't systemically it won't crash the entire system but it'll only wipe out the bad players that they want to wipe out and that's fascinating yeah yeah and there is some there's some there is some evidence around this right like Brad Cohen is I was gonna see could you talk to me a little bit more about I'm fascinated by that that's crazy yeah again this gets into the you know this is the spicy financial tinfoil I'm not I can't I'm ready confirming all this stuff but I've discussed it with Ian Carroll multiple times and you know there's there's just some weird coincidences so for one Ryan Cohen has something called it's called Teddy Corp which is yeah basically a bank that he's incorporated and he's been using that bank to fund loans and other investments into companies and one of them for example's BBB why and where Ryan Cohen is listed as a creditor and the question is like if Ryan Cohen's focus on a game stop why is he investing in BBB why and why is he taking an interest to you know toys are us",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "and one of them for example's BBB why and where Ryan Cohen is listed as a creditor and the question is like if Ryan Cohen's focus on a game stop why is he investing in BBB why and why is he taking an interest to you know toys are us and his Teddy Corp seems to be almost like planning to make strategic alliances with other with other large companies to basically can basically form like a conglomerate that can fight Amazon so like again you can think like the CEO of Flexport which is Flexport's of global logistics and shipping company he and Ryan Cohen have been in in contact and they both follow each other and the CEO has now started tweeting stuff that's pro-GME and pro like Ryan Cohen in general and it's like well why you know if again we aren't able to have the actual conversations or no one is like stalking them and has like photo evidence of them together but there's just enough coincidences where it's like okay here we see this bill this contract between you know Teddy Corp and Flexport and here we see them follow each other on Twitter and then start to tweet at each other like why would a global shipping company that's mainly deals with like large containers and imports exports from Asia why would they be why would he be talking to Ryan Cohen when most you know he doesn't really deal with that stuff. GMME's",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "then start to tweet at each other like why would a global shipping company that's mainly deals with like large containers and imports exports from Asia why would they be why would he be talking to Ryan Cohen when most you know he doesn't really deal with that stuff. GMME's game stops you know what's called their supply lines are already set up they don't need they don't need to to change anything and so because especially video games like they you can produce that here domestically and then just ship them to your stores so you don't need international distribution and most games up source are in the US anyways. Although there's obviously there there's someone Canada I think under a different name but yeah no so like there's just these weird coincidences that have been popping up and another one is Ryan Cohen's brother Brad Cohen is on Twitter and he's been following a bunch of GME and then like Teddy Corp people and BBY people and apparently I don't can't confirm this but I've been hearing that he's been talking to people and so it's like why is you know Ryan Cohen's brother wouldn't be doing this without Ryan Cohen's blessing and so what's going on and again the theory is the broader theory is Ryan Cohen basically so his entire upbringing was you know extremely hard work entrepreneurship and honoring his father who has passed away now and his father was really for honesty and transparency",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "without Ryan Cohen's blessing and so what's going on and again the theory is the broader theory is Ryan Cohen basically so his entire upbringing was you know extremely hard work entrepreneurship and honoring his father who has passed away now and his father was really for honesty and transparency and and had a very strong but still the very strong moral compass in his sons and so that's why with Ryan Cohen's you know most successful venture chewy he ventured to take on Amazon he wanted to stick it to the big man because he thought and I think he's right Amazon engages in pretty predatory you know business practices both on the in the you know both on the guns like the the employee side meaning like they take advantage of those employees in the in the workshops they give them like 50 minute pea braid or like five minute pea breaks 15 minute lunches like you have to clock and clock out you're constantly monitored the time you and if you're slower than normally you have disabilities you get an injury they axiomedially but also on the you know maybe more like financial predatory side there's a quite a few famous DDPs is one of the one of which was called Amazon bust out schemes discussing how Amazon had worked with Bain and Capital which is a private equity fund owned by Mitt Romney to take over other you know struggling retailers and bankrupt them and then",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "quite a few famous DDPs is one of the one of which was called Amazon bust out schemes discussing how Amazon had worked with Bain and Capital which is a private equity fund owned by Mitt Romney to take over other you know struggling retailers and bankrupt them and then have Amazon coming and swoop the assets and absorb them basically a way for them to kind of like poison pill their competitors so they could install right like Amazon could use Bain and Capital to install bad leadership into the boards of these companies like Sears or like Toys or Russ they could load the company with debt they could drive down sales they could purposely tank the company once it goes into bankruptcy Amazon because maybe Amazon is a creditor or the owns some shares they can get first lean and they can buy all their assets for pennies on the dollar and that way not only did they take out a competitor but now they gain all these all this inventory and assets in storefronts and you know square footage that they can now in shipping trucks and logistics and everything that they can now use to grow their own empire and so the theory is Ryan Cohen saw this happening he took them on first in the name you know in the in the sense of chewy he took built his billion dollar company that was able to finally defeat Amazon as own game and just",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "grow their own empire and so the theory is Ryan Cohen saw this happening he took them on first in the name you know in the in the sense of chewy he took built his billion dollar company that was able to finally defeat Amazon as own game and just provide better you know dog food delivery service and now he took on game like in 2021 he took on GameStop as his new pet project of like taking on now he's going to take on Amazon in the video game on the video game front and his actions with Teddy Corp you know for example investing BBBY make people think like wow he is he is combining like a corzou style form of businesses and a corzou if you don't know what that is is in in Japan is post-war Japan all these companies would combine together and work together towards common goals and so it wasn't exactly like a you know a cartel I would say it's more like a friendly like it was like we're not going to come we're not going to undermine each other we're going to work together we're going to try to you know because we're all trying to get the same goal right the the glass manufacturer wants to make money the tire manufacturing wants to make money Toyota wants to make money and he's like they're like why don't we all coordinate on import export contracts on engineering standards on et",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "know because we're all trying to get the same goal right the the glass manufacturer wants to make money the tire manufacturing wants to make money Toyota wants to make money and he's like they're like why don't we all coordinate on import export contracts on engineering standards on et cetera et cetera et cetera so that we can all get the best make the most money and provide the best value for our customers and so that's what what the theory is that he's doing that he's conglomerating all these smaller businesses bbby gm e chui you know toys rs and he's like I'm gonna he's like none of these individually can take on amazon but if we combine them all together and have the global shipping and flexboard and have a bank in teddy corp all of that combined can can take a shot at amazon and so that's that's the tin foil and again I'm not I'm not saying it's right I'm not saying it's wrong I'm not saying anything about it that's just the theory I love me some tin foil that's part of the fun of this is seeing these different dots get connected because I mean I have to wear the hat right when I hear a lot of this stuff I can see how people might be interested in elements of it but from like again I'm a data driven human so I see a lot of loose connections happen stance from like",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "I mean I have to wear the hat right when I hear a lot of this stuff I can see how people might be interested in elements of it but from like again I'm a data driven human so I see a lot of loose connections happen stance from like a trading perspective I'm not trading off of any of that but the theories are fucking fascinating and you cannot help but find some of those coincidental things interesting now whether or not they represent something or don't it's again it's very difficult to tell but they're interesting nonetheless so yeah and also this too we do know that that like there's a legal documents from GME of their of them signing you know NDAs in contracts with the SEC for an investigation into naked short selling so we know that GME has provided documents and evidence to the SEC for a lawsuit on naked short selling and manipulative stock market practices so we know that like those are very farfable facts against any of the links after the show if you want to see it but like we know that they've worked with with the SEC in the past and and again the theory is that it's bigger than that all the stuff it's just they have to hide it behind the scenes until the master plan is ready yeah interesting so I want to get to the chat they've dropped in a few things and I'm going to",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "and and again the theory is that it's bigger than that all the stuff it's just they have to hide it behind the scenes until the master plan is ready yeah interesting so I want to get to the chat they've dropped in a few things and I'm going to start from the beginning Diego was asking about just talking about GME swaps so maybe I gotta take this off my head's hot um and I'll wait until we get back into tin foil to resu but sure could you talk a yeah could you talk a little bit about just GME swaps broadly and then Diego if you're still in the chat if you have like ancillary details to help us get on target with what you're trying to cover with respect to GME swaps um would love that but yeah maybe just start from a high level with GME swaps how they seem to fit into the picture well I would say the picture is also bigger than the swaps right we had large amounts of out of the money puts covered caught like in the money calls um you know a lot of derivative action around GME especially around key like you know settlement dates or earning dates or FTD expiration dates that showed us in 2021 that there was something going on beneath the surface so in March of 2021 um there was a finance professor browsing through Bloomberg and he he's been you know published",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "especially around key like you know settlement dates or earning dates or FTD expiration dates that showed us in 2021 that there was something going on beneath the surface so in March of 2021 um there was a finance professor browsing through Bloomberg and he he's been you know published multiple times on SuperSong and he's produced really good really good research and he's he's browsing um some of the more bespoke and strange um you know functions you can find on Bloomberg and he found a credit sweet subsidiary in Brazil that had 70 of the float in uh out of the in in uh in the money calls in game stock and and also held about another like you know 30 of the float I think it was in out of the money puts and so it was like a huge portion basically the whole float in options and it was held in the subsidiary of credit suites and so people started digging into credit suites they're like what the hell is happening why is credit suites um why are they holding this many derivatives and then what happened is you know people started he he asked Bloomberg he said is this correct like is am I seeing 80 million shares worth of options on um on GME held in a Brazilian subsidiary and 24 hours later and luckily he documented everything so we took video images um and he sent them a chat and 24 hours later",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "he said is this correct like is am I seeing 80 million shares worth of options on um on GME held in a Brazilian subsidiary and 24 hours later and luckily he documented everything so we took video images um and he sent them a chat and 24 hours later all of that was deleted and they he got a message saying that that um those swap those options were uh an erroneous filing and that it had been resolved and that he didn't need to ask any more questions and so that was like the first sign like what's going on so what that's when we started digging into credit suites and luckily about a few weeks later or maybe say unluckily for them uh credits free started to enter bankruptcy and the reason why was because of archigos which had failed in you know early to or mid to to late march and archigos had opened up total return swaps with a variety of counter parties and one arch goes went under because they went long on viacom and uh paramount and then a bunch of other Chinese stocks um when they went under the large prime banks on Wall Street had had a closed door meeting to figure out how to unwind this mess because they didn't realize that archigos had levered its book you know 25 to 1 it was opening up derivative positions five or six times it's it's uh equity value with every single",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "on Wall Street had had a closed door meeting to figure out how to unwind this mess because they didn't realize that archigos had levered its book you know 25 to 1 it was opening up derivative positions five or six times it's it's uh equity value with every single large Wall Street bank so it was like you know obviously credit suites jp morgan goleman and then no more uh as well and i think there was a bank of america and so they they they had this closed door meeting they said okay well how do we unwind this stuff and jp morgan and goleman told everyone they said well here's what we're gonna do we're gonna slow unwind over six months due to small block sales of these swaps are like trying to unwind them slowly so that we and we'll all do it at the same time holding hands trust me bro and they they said this on this was like you know a friday in in late march the opener business next monday we start to see giant block trades in the dark pools or viacom paramount gme as well and obviously all these Chinese stocks and quickly news came out like you know day later holy shit goleman and jp morgan were naked on the deal and these guys are they told the traders to dump everything and get out now so they they these are the banks work right they're they're kind of",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "stocks and quickly news came out like you know day later holy shit goleman and jp morgan were naked on the deal and these guys are they told the traders to dump everything and get out now so they they these are the banks work right they're they're kind of predatory but uh credits credit suites got stuck with the bag so all these swaps you know collapsed in value and jp morgan goleman got out nomura took a hit and credit suites was left with a huge bag and that's part of the reason why they failed not all of it obviously but i think that was the main you know it was the straw that broke the camel's back credit suites already had issues that had been lingering from 2008 but this was the final you know killing blow that really destroyed them and as credit suites was unwound over april may june of 2021 you know there were lawsuits that came out obviously and the lawsuits in the discovery process produced a lot of evidence showing that archa ghost had been shorting like i said um gme in some of the calls with the goleman broker uh archa ghost managing director was recorded as saying you know we need to make sure we we short these retail stocks and then she said are you sure do you mean gme and then he says absolutely and then they go on and and they don't specify the problems we",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "archa ghost managing director was recorded as saying you know we need to make sure we we short these retail stocks and then she said are you sure do you mean gme and then he says absolutely and then they go on and and they don't specify the problems we don't know again because of this the limited amount of of of information on the swaps we don't know how many exact shares we don't know how they were hedged but if the credits suites numbers are to believe to be believed credits suites alone was counterparty for 70 of the float of gme in swaps and they had hedged that with out of the money puts um so options well i think the other problem just we're trying to draw linear relationships like that is we also don't know what the rest of their book looks like right so we can see what the swaps show us but we have no idea what the rest of the broader book looks like which is difficult to piece together totally fair holy fair and that is true and you know but i'll say this you know credit suites required like uh what was it like a thirty billion dollar bailout from the swish national bank and they had the swish national bank absorb most of their toxic assets even then ubs didn't want to take them on and even now that you see articles like you know there's a recent one",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "what was it like a thirty billion dollar bailout from the swish national bank and they had the swish national bank absorb most of their toxic assets even then ubs didn't want to take them on and even now that you see articles like you know there's a recent one where ubs was trying to sell off a bunch of toxic credit suites assets and had to take a 60 right off on basically all of it they had to wind down their uh commercial property unit their commercial real estate unit that did nbs's cmbs's and so yeah it's we don't know the entire extent but we know that it was bad it was really bad and if again if those numbers are to be believed 70 of float with just credits we still own also implies if if if archie goes had copied this strategy with other head with other brokers and done the same basket swap going long some some some stocks and going short others that means there are more shorts out there and we also know again from dario from evidence from dario that in age he he's a former city group uh structured structured equities trader and he was saying that you know in asia he knows that there's at least two other hedge phones that were following bill whoang and archie goes tick for tick so he's like there's at least three of these guys in asia and there's probably a dozen more",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "equities trader and he was saying that you know in asia he knows that there's at least two other hedge phones that were following bill whoang and archie goes tick for tick so he's like there's at least three of these guys in asia and there's probably a dozen more elsewhere that had followed him had long into this basket swap trade because it seemed like free money right and to be fair to them right if you don't if you put your morals aside it makes sense yeah yeah fuck the morals but like it kind of made sense it the year is 2020 right march 2020 the stock markets collapsing covid's hitting the fed is panicking everyone thinks that the you know the shutdown is going to last forever and everyone thinks that coronavirus is the worst virus to ever the worst pandemic to come since the Spanish flu of you know was it 1917 that killed million 10 of the world's population or whatever was killed millions of people the panic that upset that that sets into markets is you know unprecedented it's the first time we've seen in a broad based equity markets markets melt off like that since 2008 and they you know that the hedge funds realize like look a lot of these retail stores these brick and mortal retailers they're not going to get any traffic and if they don't have an online presence and they don't have a viable e-commerce business line",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "like that since 2008 and they you know that the hedge funds realize like look a lot of these retail stores these brick and mortal retailers they're not going to get any traffic and if they don't have an online presence and they don't have a viable e-commerce business line they're not going to be able to make any money and so they're all going to zero and so it makes sense to do a basket swap that goes long whatever equities you want to go long whether it's zoom or you know Tesla or Facebook all the tech stocks and then you can go short you know game stop right BBBY you know Sears whatever any large retailer you want and if you have you know if you have any sense you want to you want to put pressure on these trades so you want other people to be in with you so you have idea dinners where you tell other hedge fund traders the same thing and again you're not coordinating but you're just sharing ideas and if they so happen to do the trade and they're making 8 a month on it they're going to love it too and so you can quickly see how multiple hedge funds start to pile in to this trade and this matches right the financial house financial services report which found there were over 70 hedge funds and again they won't name them which is unfortunate but there were over 70",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "too and so you can quickly see how multiple hedge funds start to pile in to this trade and this matches right the financial house financial services report which found there were over 70 hedge funds and again they won't name them which is unfortunate but there were over 70 hedge funds short game stop and 175 retail brokers that shut off the right by button and so we don't again we don't know how big this this you know monster is but we do know there's a lot of evidence on the swaps showing that archigos and several hedge funds in Asia for sure and then most likely dozens of other hedge funds across the US and Europe went short games up via swaps and then the reason why we saw this the reason why this this kept popping up is because we started to see correlations with some of the swap expiration dates and the running of the stock price because again like like we said at the outset right game stop is not a stock that follows any typical trading you know indicators right it does not follow uh rise decline it does not follow our assigned necessarily it doesn't follow any of that shit and we've seen days where you know you think nothing's going to happen like I said February of 2021 March of 2021 this May and June run up was another great example if you had said in a week and a half",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "necessarily it doesn't follow any of that shit and we've seen days where you know you think nothing's going to happen like I said February of 2021 March of 2021 this May and June run up was another great example if you had said in a week and a half game stops going to be a triple the price you're someone you know a no person will look at you like what the fuck what's the catalyst oh by the way there's no catalyst no news comes out it just rips 200 percent for no reason and then no one knows and then it goes back down and no one knows why it's like well hold on unless retail is collaborating and has more capital than we ever thought they did this has to be something else going on this has to be something coming happening with the with the plumbing of the system and so again the the working theory is they've been using these swaps to get rid of FTDs to kick the can on the road so to speak to not have to settle the massive obligation that they've built up since 2020 because from what Dario has shared with me most of these a lot of these swaps were entered into in March 2020 so they all got the bag in March 2020 they thought it was just going to print and make money and it's gone the opposite way and so they'll have to they've",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "has shared with me most of these a lot of these swaps were entered into in March 2020 so they all got the bag in March 2020 they thought it was just going to print and make money and it's gone the opposite way and so they'll have to they've had to find new creative ways to keep kicking this can interesting and there is a follow on question from Diego and Corey with respect to Chewy Swaps so I've seen a lot of interesting theories around Chewy's GameStop relationships the swaps as well is there any connection between those as far as you see it so I actually had someone reach out to me about this this is really interesting so on some of the basket swaps you can see two different legs which can make sense right like some of these like the leg can mean the receiving or the sending pair so you can you can hedge it you can do a swap either way where you're either promising to deliver shares or your promise or you're getting a promise to receive shares and so if you're promising to deliver shares then obviously you would want to be hedged and one of the ways you can hedge is via the opposite market and what they what we saw in some of this data that this uh unnamed gentleman shared with me is that on a lot of these swaps obviously you see GME on the first leg",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "be hedged and one of the ways you can hedge is via the opposite market and what they what we saw in some of this data that this uh unnamed gentleman shared with me is that on a lot of these swaps obviously you see GME on the first leg of the swap so you see you know no shul amount and then you see like tickers and it'll include like six or seven tickers and some of these tickers are really weird it's like I would never think like it's a goal like bear it gold mining or like you know uh some french banks you're just like why is this included and again we don't get any answer but um a lot of them will have GME on the first you know first leg of the trade right so that's basically like a promise to uh to send those shares out so those you know that that would have to be hedged but then on some of them again some of them the data is is uh they don't release the second leg the data for it was the second leg on some of them they don't have data on this first leg so it says promise to receive and on the receive some of them say chewy and a lot of them that are correlated are the ones where GME and chewy are included in the same basket stock and treated the same by a single counterparty",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "data on this first leg so it says promise to receive and on the receive some of them say chewy and a lot of them that are correlated are the ones where GME and chewy are included in the same basket stock and treated the same by a single counterparty but the problem is again we don't know who that is we don't know how well it's it's um hedged but from what I have seen from the data there were a bunch of chewy swaps that are expiring in late September of of this year so it's just you know a week ago and I haven't really followed the chewy swaps that much more because for me my main focus is GME because in my opinion and I think most people would agree with me on this GME has overall a more interesting and compelling story to investigate than chewy but um yeah there's been from what I've seen on the data there's been significant correlation like especially that first and second leg um a lot of sorry a lot of times where chewy shows up as a as a receiving leg of a of a swap yeah okay got it and that makes a ton of sense I've seen the same thing actually myself the and again the world of swaps I think is it's so interesting because of how dynamic they are so because I just continue to reiterate that point for people because I think a",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "got it and that makes a ton of sense I've seen the same thing actually myself the and again the world of swaps I think is it's so interesting because of how dynamic they are so because I just continue to reiterate that point for people because I think a lot of times when people are analyzing them they try to create direct parallels and causal relationships which is very difficult it's so so difficult because a lot of these entities will have an amalgamation of different kinds of swaps and derivatives in their entire bulk so it's really hard to see what offsets what but the relationship that you highlight there is I think important for people to understand at least with respect to how a lot of these things are seemingly very tied together because one of the things I've done with any sort of correlation analysis is the correlation between a lot of the products isn't really that unique compared to the correlation of most beta products but what you will find is the correlation between them strengthens during big moves that's noteworthy is so as soon as that standard correlation starts to expand during those kinds of movements and then break down post I think it highlights some movement that happens behind the scenes because that's really what drives any sort of correlation analysis for different time frames so I find that interesting yeah you know they did a study too I can send you the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "of movements and then break down post I think it highlights some movement that happens behind the scenes because that's really what drives any sort of correlation analysis for different time frames so I find that interesting yeah you know they did a study too I can send you the paper there was a paper out of University of Bernou in eastern Europe I forgot what countries when it was like hungry okay so you've read that so you saw the correlation between uh Jamie sock price short interest in ETFs and whenever whenever the sock price rose there were 16 ETFs identified as highly correlated or the FTDs in the ETF increase along with the Jamie sock price so it's and the borrow rates right so there was evidence that they were abusing you know the hedge funds and market makers and others were abusing the ETF mechanism as a way to get shares and you know there are causing FTDs in these in these derivative products like ETFs just because they wanted to get away from the hop potato of GME yeah well and then the creation redemption cycle on those ETFs is also I think a big part of that story um now one admin note because I remember I was talking with Newton about this too and I am no significant advocate of market makers I have a friend that's a market maker but I'm not like an advocate of them but sometimes I feel like",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "part of that story um now one admin note because I remember I was talking with Newton about this too and I am no significant advocate of market makers I have a friend that's a market maker but I'm not like an advocate of them but sometimes I feel like the their role is grossly misunderstood in markets so what like what role do you see them playing from your perspective with GME specifically to be clear sure and actually I you know I got corrected I just got some Twitter DMs I did say you know the regulatory bodies turned off the buy button um that's an oversimplification really it was clearinghouse apex clearing yeah exactly shut off the buy button yeah so when I said very like I'm more broadly meant like the powers that be the people who are running the plumbing of the of the system yeah I knew exactly you meant yeah so uh apologies there but um with sorry what was your question again it was about market makers through all their role with game stuff yeah so I've actually put together a couple good Twitter threats about this um you know actually at my prior company uh the FinTech company was working out they were trying to create a private market exchange essentially allowing people to transact shares of private companies on on a limited basis and so all this involved discussions of what is liquidity what is a market was the role",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "my prior company uh the FinTech company was working out they were trying to create a private market exchange essentially allowing people to transact shares of private companies on on a limited basis and so all this involved discussions of what is liquidity what is a market was the role of a market maker was the role of an exchange was the role of uh transfer agent how should all this work and my view quickly became especially with you know quickly like learning about the naked shorting mechanism and the FTD rules and the loopholes with ETFs you know that market makers can abuse the authorized participant loophole loophole um that our current ideology or market making is completely broken in the current market paradigm liquidity is viewed as everything so it's like all you want to do is maximize liquidity so the idea is right whether it shares or even just money itself the idea is we need to maximize liquidity keep everything running because if things fall apart then they'll be economic pain and that can happen either on the buy side or the sell side right if you run out of liquidity on the buy side as talk price can fall and if you run if you run out of liquidity on the sell side then the liquid then the stock price can rip and that is true and i'm not saying that there is an argument for liquidity in general but to maximize liquidity as",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "as talk price can fall and if you run if you run out of liquidity on the sell side then the liquid then the stock price can rip and that is true and i'm not saying that there is an argument for liquidity in general but to maximize liquidity as your primary nor star that your exchange or your software is pointing towards is completely broken because what what happens when you start maximizing liquidity is you start minimizing the importance of every other factor and you destroy the ability of of a market to function properly anyways right if if you want infinite liquidity then just have a an infinite share printer and an infinite money printer that just battle each other forever and get rid of the get rid of the reason for even people existing but do you think that the well how do you explain the nuance between infinite liquidity and trying to maximize liquidity because I would argue those are slightly different concepts yeah and i'm being a little you know bombastic right with with with the infinite liquidity but the point is their goal is to map their goals to increase liquidity no at all costs yep like that's how the current market paradigm works and that I think is an is a very very bad premise because what what ends up happening right is you get justifications for all these all these abusive market practices naked shorting FTD's ETF flu polls options you",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "all costs yep like that's how the current market paradigm works and that I think is an is a very very bad premise because what what ends up happening right is you get justifications for all these all these abusive market practices naked shorting FTD's ETF flu polls options you know off-laying settlement you essentially get to a system where all shares never have to be delivered and they can be kicked with FTD's forever because again it's liquidity hey we can't deliver the share we need to we need more liquidity we need to not let it be sold because then the price would be depressed or the price would rise if there's a lack of shares so we need to let we need to let the liquidity fairies do their work and keep kicking this can down the road so I see the current system the way I would change it which again might be controversial is having like a very different approach with let me know supply and demand and the idea of like if a stock price starts running and there's not enough shares the price will go up until there's no more sellers of shares and then it just freezes and we would just watch oh apples at 2000 why hasn't it moved because no one's willing to sell and no one's willing to buy higher so it's just frozen and once more people come in then then they'll change and so the market at",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "and then it just freezes and we would just watch oh apples at 2000 why hasn't it moved because no one's willing to sell and no one's willing to buy higher so it's just frozen and once more people come in then then they'll change and so the market at under my view maybe it would look a lot more jittery but I think it would it would reflect real supply and demand and once you want to broker runs out of shares that's it they're done they can't do this and all of this by the way is possible because here's a thing is the DTC runs all the share and trade settlement through a massive sequel database right they have centralized insight into you know through their DTC account they have centralized insight into every the positions of every single broker and you know market participant that there is and so why can't they have why can't they solve this problem they can and Suzanne Trombath said that it's they're able to do it it's just it's a lot of work sure they have to change some problems with the system they have to probably you know they have to eliminate the ability to naked short they have to get rid of FTD bypass rules but they can do it but they won't because the system as we know it would grind to a halt it'd be much more liquid yeah because I I hear some of your",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "have to eliminate the ability to naked short they have to get rid of FTD bypass rules but they can do it but they won't because the system as we know it would grind to a halt it'd be much more liquid yeah because I I hear some of your points I definitely can see it would be very difficult to implement something that like that specifically from a liquidity perspective but it's an interesting idea and I think one of the other things to note though is like the idea of naked shorting is kind of like a perversion of the rules like that's actually side-scirting around existing policy I'm not so sure that that's something that were we being again governing bodies but specifically regulators are attempting to to promote or promulgate for the sake of liquidity I think it's something that's happening but I don't think it's something that is supposed to be happening well you know market makers have a naked shorting exemption right of course but their mandate is slightly different because they have a covering window and the the premise for them naked shorting is completely different than the premise of institutions naked shorting so for them to your point market makers it's for liquidity for institutions it's because they're trying to be cheap and they can essentially gain exposure to things otherwise they might not have access to way way cheaper true but at what point just liquidity start destroying price discovery you",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "so for them to your point market makers it's for liquidity for institutions it's because they're trying to be cheap and they can essentially gain exposure to things otherwise they might not have access to way way cheaper true but at what point just liquidity start destroying price discovery you know again like if this is the issue it's like okay so let's say we get rid of naked shorting from other institutions other than market makers okay so market makers are the golden boys of Wall Street and they can naked short all day long wants to stop them from being the now being the the you know the monoliths of price discovery so they can now say oh well you know hey apples rising we don't like apple our clients are short apple we're gonna naked short a ton of shares today and we're gonna kick them with FDDs and never deliver the shares and sell people a bunch of fake fandom shares and make sure the price doesn't go up and what are you gonna do about it because we have an exemption like it the once you open the door it's one of those things where it's like give them a give them an inch they'll take a mile once you open the door a little bit you can see how it becomes so logical it's like well why wouldn't we do this why wouldn't we just naked short every stock I think it's just important",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "it's like give them a give them an inch they'll take a mile once you open the door a little bit you can see how it becomes so logical it's like well why wouldn't we do this why wouldn't we just naked short every stock I think it's just important to remember the the game of market maker right like they they're typically not managing a book for a client they're typically they make their money by providing markets so their entire job is to offer you a bit ask spread at a size so that you can trade what you want I understand your point fully but it's just the the way they make a living they're much more kind of like a scavenger of the market as compared to an entity that is moving as as that specifically I would I would disagree with you so that I would say that that's how it should be but if you look at the the actual structure of the market right now you know Citadel securities is a market maker Citadel itself is a hedge fund now those are both owned and run by the same people completely agree and Citadel secunds example completely agree with you yeah and Citadel the hedge fund shuts down or Citadel the hedge fund extends a 2.3 billion dollar loan to Melvin Capital in January 2021 to bail them out of their underwater GME shores right at this two days later an unnamed market",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "Citadel secunds example completely agree with you yeah and Citadel the hedge fund shuts down or Citadel the hedge fund extends a 2.3 billion dollar loan to Melvin Capital in January 2021 to bail them out of their underwater GME shores right at this two days later an unnamed market maker causes a you know clearing I guess you'd call it like error within apex to force to force freezing of of of buying of all the meme stocks because what happened is somebody made a you know this trade 385 some unnamed market maker but we assume a Citadel because Citadel was the designated market maker for AMC and GME and they're everywhere and they're everywhere they're the they're basically the largest market maker and some unnamed market maker made a 300-35 billion buy and sell trade for AMC in the evening of January 27th the next day 28th the apex clearing realizes what's going on they say holy shit there's a massive buy and sell and under their own you know internal rules and regulations whenever there's a massive buy and sell one of the legs of the trade must be manually verified and they hadn't whoever had made the trade had not manually verified the sell side so somebody so whoever's market maker one was had logged a buy for 285 million dollars with a AMC and then not log not manually logged the sell so they had the sell wasn't the system but it wasn't manually",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "made the trade had not manually verified the sell side so somebody so whoever's market maker one was had logged a buy for 285 million dollars with a AMC and then not log not manually logged the sell so they had the sell wasn't the system but it wasn't manually logged because through this uh root internal rule and apex clearing and maybe it's true of all clearing brokers I'm not sure do you have to make if a large sizable trade is made within one second you have to manually verify the trade which makes sense right it's like this two is buy sell within the same second that's is that an anomaly is at a mistake was once have the trade not meant to happen you know what was supposed to was supposed to go on here um and then and then the entire you know the entire stock market you know freezes and we see all the meme stocks have no buying available for them so the conflict of interest here can be you can immediately see a city of all securities has the ability potentially again alleged none of this is confirmed but potential ability to log buy and sell trades massive ones force you know basically like a technical default on the clearinghouse and force them to freeze buying for all the brokers and then on the other hand they have their hedge fund saving Melvin capital so it's like would they would sit with",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "log buy and sell trades massive ones force you know basically like a technical default on the clearinghouse and force them to freeze buying for all the brokers and then on the other hand they have their hedge fund saving Melvin capital so it's like would they would sit with the guys that said the security help out the guys and sit at all you know that the hedge fund probably and it's not far fetched to claim that and that's a problem with a lot of these yeah that's a problem with a lot of these market makers is that they're not these neutral arbiters of value they a lot of them have vested interests one way or the other yeah there's three of them that three of the big ones that operate also as hedge funds right so you hit one there's two sigma and then there's Susquehanna and then places like flow GTS Jane virtue those are strictly market makers exactly and so and that's another thing right the SAC should look at why are these people like to interest massive yeah why are they allowed to be run a hedge fund and a market maker that's insane yeah no I completely agree I think it's straight straight bulls yeah um so there was a question in here before from one of my favorite user names that I have the pleasure of seeing when I do live stream which is roaring titty big fan of that one",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "insane yeah no I completely agree I think it's straight straight bulls yeah um so there was a question in here before from one of my favorite user names that I have the pleasure of seeing when I do live stream which is roaring titty big fan of that one so we have a roaring titty and then there's normally a roaring clitty I like those yeah they're a dynamic duo but roaring titty was asking I have to find it because I don't want to miss it um was asking about yeah here it is what about Carl icon getting into those swaps in 2020 do you know anything about that and while you responded to that I have to grab another water so feel free to kick off and then I'll be back in my two seconds sure I haven't I haven't looked you know insanely deep into the Carl icon connection from what I know he had gone into the swaps um and potentially was even short GM me in 2020 but Ryan Cohen's parent friendship with him and pictures with him and and you know overall admiration of the guy makes me think that there's something deeper going on there so sorry I don't know a ton about it because I haven't looked into Carl icon that deeply but I do know that he was allegedly in the in the swaps shorting in 2020 which maybe he's changed his tune and maybe he's gone long or",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "deeper going on there so sorry I don't know a ton about it because I haven't looked into Carl icon that deeply but I do know that he was allegedly in the in the swaps shorting in 2020 which maybe he's changed his tune and maybe he's gone long or close to short position potentially yeah because when I saw about icon I've heard of that before but I never fully understood what his position was roaring to be saying I thought he got smashed with the GME shorts that's true that's what I've that's what I've seen yeah but if we could strange like I was saying earlier is what strange is why is Ryan Cohen so buddy buddy with him why does he cozy up to him and I would think that uh probably Carl icon changed his tune close to shorts and then now went long that's the most likely explanation but you know the the saga is not as clear cut as you would want it to be right there's there are players with mixed motives and so Carl icon might be one of them yeah so I just asked um chat GPT so I always frame at that right because I don't know how accurate it is but chat GPT looked at two different websites and it says icon profited from shorting games stopped during the peak of the frenzy in 21 um despite these icon experienced broader losses with his overall short positions contributing",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "frame at that right because I don't know how accurate it is but chat GPT looked at two different websites and it says icon profited from shorting games stopped during the peak of the frenzy in 21 um despite these icon experienced broader losses with his overall short positions contributing to 1.3 bill in losses in 21 so while the exact amount icon made on the GME short is not publicly disclosed his games on GameStop did not offset the other losses so it's hard to it's essentially not answer this doesn't tell us yeah what he would have done on the short side or even on the long side yeah and I also know a lot of hedge funds did go short at the top I have 300 I mean it's super logical to be honest again from a trading perspective trading both sides of squeezes um I have a video that's coming out soon that talks about like the the anatomy of a squeeze because the way that I think about trading is I break things down into icon profit mechanisms like what is this specific thing that lets me make money and short squeeze or gamma squeeze short squeeze don't really care what causes it maybe better just to call it squeeze but the there's very specific conditions and behaviors of squeezes that you can trade but one of them is the periodicity they're typically very very short term so they're really really really tradable events it's",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "short squeeze don't really care what causes it maybe better just to call it squeeze but the there's very specific conditions and behaviors of squeezes that you can trade but one of them is the periodicity they're typically very very short term so they're really really really tradable events it's kind of like if you see massive spikes in vix it's another highly tradable event yeah I actually used to trade uvxy like the leverage the leverage yeah it was fun it's fun you can make a lot of money and then you can lose a lot of money very cool yeah well that's the beautiful part about markets right is like it's just this game of taking money out of the machine and then just giving it back and then you look at it you're like well fuck I need to make that back again so then you go back again and here you are in the virtuous cycle of trading yeah well this is the issue right like it's become markets that become a gambling mechanism oh I think I'm afraid to yeah it's gamified but it's become a gambling mechanism and again because why because we've allowed the derivatives and the higher order functions of the market to super seed the actual market itself right let's go back to the original argument about it is like a price discovery mechanism yes yes what's the primary role of a market to be liquid or to have price discovery",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "the derivatives and the higher order functions of the market to super seed the actual market itself right let's go back to the original argument about it is like a price discovery mechanism yes yes what's the primary role of a market to be liquid or to have price discovery right you can't yeah it's a spectrum where it's like if you go further down the liquidity side you're giving up price discovery and so if you want markets to be truly truly price discovery you would have to put in a bunch of restrictions that are not in place today you'd have to eliminate naked shorting eliminate FTD loopholes all that stuff but more so you know you would have to limit derivatives you would have to say look like there's a hundred million shares of the float you know 30 million on by retail for 50 million on by institutions only leaves us 20 million we're not going to allow more than 10 million shares in terms of options to be sold and if that limit gets reached hardstop no more options can be sold that would that's what those are the restricts that would have to be put in place because again you couldn't have a market where the derivatives have a claim on more shares than actually exist right well I guess the only problem with that is if you look at the way that derivatives are typically resolved it's it's not through the movement of",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "put in place because again you couldn't have a market where the derivatives have a claim on more shares than actually exist right well I guess the only problem with that is if you look at the way that derivatives are typically resolved it's it's not through the movement of the underlying so I fully understand your point in terms of essentially making it so that it would be secured by the underlying itself but the overwhelming the overwhelming resolution of derivatives is trading in and out before expiration issues you're right it's cash settlement most derivatives are but again so here's another systemic risk of markets what happens if everyone exercises oh right yeah what happens it's the same thing would happen with with Nixon in 71 what happens to all these goals certificates if people actually call your bluff and say I want the gold what happens to all your GME options if everyone says holy shit you guys are manipulating the market well no longer do I want to trade my option to get 20k I want my shares and I want them now and I don't give a fuck about the money anymore I want to stick it to when I want to hold these shares because that's what happened like in in 2021 people started exercising their options they didn't sell them no one wanted to sell I was like give me the shares I want to stick to Wall Street and so and their",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "stick it to when I want to hold these shares because that's what happened like in in 2021 people started exercising their options they didn't sell them no one wanted to sell I was like give me the shares I want to stick to Wall Street and so and their models don't count for that the models will say oh two percent of all options will be you know exercise for shares or 10 percent or whatever the number is a fraction of the total what happens if 50 percent of them say they want to exercise which is a non zero probability so these are the restrictions you'd have to put in place on a market that was strictly based on price discovery and did not maximize liquidity because that kind of market with a fixed share count and four settlement all the time you can't have options running amuck well in the other funny part there is you think as I think about your theory that's really fascinating is if you consider the fact that you know when options are in the money coming up on expiration right market makers are typically going to hedge with the underlying expecting to deliver but to your broader point if people that are out of the money just decide to exercise and get their 30 shares on their 30 delta's or whatever or you know whatever the equivalent would be at that point in terms of what they would like that's",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "expecting to deliver but to your broader point if people that are out of the money just decide to exercise and get their 30 shares on their 30 delta's or whatever or you know whatever the equivalent would be at that point in terms of what they would like that's fascinating because yeah you're right that would be a massive stress test but I guess the reason why we think about it the way that they do in terms of markets is just it's completely irrational again to your point if the rationality is to stick it to Wall Street now that's a completely different angle that I don't think a lot of people have considered too widely this is this is part of the broader issue so this is this is the philosophy of markets which I've studied a lot of actually this is part of the broader issue with how financial you know you know financial education economics education is taught we're taught from day one of any college course either undergraduate or graduate course that markets exist with a random walk and Brownian motion is the key governor of you know price movements what is Brownian motion Brownian motion is the idea of a random motion of of atoms or cells or any you know almost any entity in a what's called a non dynamic system in physics so just one quick admin note this is we're talking about a theoretical con because obviously we would know",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "Brownian motion is the idea of a random motion of of atoms or cells or any you know almost any entity in a what's called a non dynamic system in physics so just one quick admin note this is we're talking about a theoretical con because obviously we would know that markets markets exhibit geometric Brownian motion tendencies at points but it also has things like drift right positive drift so that's not Brownian motion that's long term drift is highlighting for the audiences they're listening that there's like different levels to the to the concept yes obviously but the problem is the theory of markets like the EMH for example right a thick efficient markets have all sits that's based on Brownian motion being valid and true at all points continuously across all asset classes and it's also based on you know some things are nonsensical equal and true information given to all participants simultaneously infinite liquidity infinite like these the seven tenants when i was in college and the professor laid out the seven tenants of the EMH and he had a study it i i looked through it on the first day on the first day of that class and i was like what the fuck all these are wrong like literally there's not a single one here that's correct exactly how are you teaching like it's it's irresponsible you're lied to us how how is this right that this market isn't efficient and the more I've",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "that class and i was like what the fuck all these are wrong like literally there's not a single one here that's correct exactly how are you teaching like it's it's irresponsible you're lied to us how how is this right that this market isn't efficient and the more I've read the more research right oh our our stock market is duly portray Brownian motion and cycle what you said maybe at certain points they do but for the vast majority they do not and the issue is when you build all your mathematical models around Brownian motion and a geometric mean and normalize data that's safe and easy to understand use you create you know algorithms you create trading patterns you create things that work you know 98 of the time but then absolutely blow you out of the water two percent of the time and those times it blows you out of the water and if it does so in a big enough way it can cause a systemic crisis there's a really great book on the 1987 crash called when genius failed i believe it is yeah yeah yeah yeah definitely but but in that book they described right like how this crash happened right how that portfolio insurance and you know the derivatives and the the the interplay between the spy futures and the portfolio insurance were kicking in and they were shorts and then the short arb would come in and short the underlying stocks",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "described right like how this crash happened right how that portfolio insurance and you know the derivatives and the the the interplay between the spy futures and the portfolio insurance were kicking in and they were shorts and then the short arb would come in and short the underlying stocks but then buy the futures and then as the futures tanked after some more of the futures and keep short in the stock it's like it was a negative feedback loop right or say a positive feedback loop that worked negatively to drive the market down and cause a you know wherever it was an eight sigma event and the mathematicians who went back and used those normalized distribution bell curve brownian motion models they found that the chance of black monday happening using those models was one in 10 to the one sixtieth now there are 10 to the to the 80th atoms in the universe so 10 to the one sixtieth is a number that's so astronomically high it's not even possible so that's why no one had had had hedge for it no one thought that a 22 percent decline in the spy could happen on a monday they said that's impossible mathematically but it was so well just literally the just another yeah just another admin note on that like the stuff like efficient market hypothesis is a framework for thinking right it's like institutions aren't actually building models off of that they they know better",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "monday they said that's impossible mathematically but it was so well just literally the just another yeah just another admin note on that like the stuff like efficient market hypothesis is a framework for thinking right it's like institutions aren't actually building models off of that they they know better it's the same thing with like black sholes and option pricing if we look at option pricing black sholes martin model assumes volatility is uniform across us strikes we know that's not true so and so forth it provides like a framework by anybody that's interacting with markets at a professional level they're not going to actually build models off the framework now to your point they were still completely off sides for that move for sure no doubt and I completely agree with you there but well post that they talk about this in the book but post 1987 that's when people started to doubt the image and serious concerns were raised about this and then they you know obviously there was that I don't know if you read the last one of the last chapters called volatility smile ever since 1987 they've seen a uptick in the convexity curve of volatility so it's like at the very extremes there's for extreme movements you have to pay more than for a middle extreme movement if that makes sense right so there's this there's this convexity with options or with futures or with swaps or whatever it is so it's",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "curve of volatility so it's like at the very extremes there's for extreme movements you have to pay more than for a middle extreme movement if that makes sense right so there's this there's this convexity with options or with futures or with swaps or whatever it is so it's like you might it would cost more to hedge a 20 downside move you know then a 10 downside move even though the 10 downside move might be more probable and it's exactly yeah and it's it's also a big big reason why we see you know volatility risk premiums or variance risk premiums you know for those that trade options you'll you'll be familiar with that term where we essentially oh we especially in the indices this is a little more dynamic with respect to individual securities but we essentially always overestimate implied versus realized volatility it's literally for the same stuff because it's like if you read tellerbs work he talks a lot about the the probabilistic outcomes of things and actually in my undergrad and grad I focused on stats just because I'm fascinated by perceiving the world that way but markets are interesting to that know that improbable events happen all the time literally all the time and it's why we see things like fat tails, kurtosis and the overall skews so like we we know for a fact we're not looking at a normal distribution curve right it's definitely not normal distribution when we're modeling",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "that improbable events happen all the time literally all the time and it's why we see things like fat tails, kurtosis and the overall skews so like we we know for a fact we're not looking at a normal distribution curve right it's definitely not normal distribution when we're modeling things which is always curious to me especially if you look at like gm e price movements that's I modeled the price movements in gm e out of curiosity and it's it's insane like how skewed it is it's fascinating to me yeah but that again this goes back to the argument of static versus dynamic systems the stock market as a dynamic system all the factors affect other factors and the and the the coefficient between those two factors changes over time and it's in relationships yeah yes it's these complex systems are impossible to model my dad is a or he's retired now but he was an atmospheric scientist and he worked for a time at Noah yeah to model Oji and it's yeah exactly and he was doing climate modeling and they were trying to predict what the first climate would be like in 20 to 30 years and he was telling me that there's literally like 50,000 variables and after after just a few years the the variable the error bars and the variables grow so long as that it becomes useless to predict and this is the same reason why for example weather prediction models",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "years and he was telling me that there's literally like 50,000 variables and after after just a few years the the variable the error bars and the variables grow so long as that it becomes useless to predict and this is the same reason why for example weather prediction models can only predict the weather for accurately for a week or less and you can't predict the weather out for three weeks why is that well it's because the weather the climate is a dynamic system and all the all the factors impact other factors and the relationship between them changes constantly so it's it's literally impossible to model like mathematically we need infinite computing power to literally yeah literally that's yeah that's so cool what a cool job and did he travel a lot for that yeah he um he did work in Chile um and he also he also worked in the uh in the North Pole in the Arctic he did some some climate research up there and like did he bring you back like letters from Santa and shit no no no but he was up there I think in like 1994 doing uh doing research on ice crystals and uh prehistoric you know air bubbles trapped in the ice trying to model what was the climate like back then I literally was just telling you before we actually went on the livestream how much I like old shit so as you're talking about prehistoric ice",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "on ice crystals and uh prehistoric you know air bubbles trapped in the ice trying to model what was the climate like back then I literally was just telling you before we actually went on the livestream how much I like old shit so as you're talking about prehistoric ice bubbles you have no idea how I'm gonna talk to your dad sometime because that stuff is yeah sure you can do we can do we can send that up that's so fucking cool I love that stuff um but yeah the it's funny because Chile we I beyond investing like in the stock market I'm I got into real estate over the last like decade or so so I work with a couple partners and we actually scooped up a couple skewers or it's in Chile specifically um there is through like a a trio mountain range and we just grabbed a second resort that we're gonna combine into like a a bigger joint resort which looks really cool you bought a whole resort yeah yeah it's not just me we we have like a partnership that works in them um but yeah skewers is a big thing that the partnership does we do a lot of odds and ends so like we just grabbed a couple golf courses last year that was like a first ad to the portfolio never did those before I'm even like golf um but my buddy does so I just like yeah yeah",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "the partnership does we do a lot of odds and ends so like we just grabbed a couple golf courses last year that was like a first ad to the portfolio never did those before I'm even like golf um but my buddy does so I just like yeah yeah I'll I'll ride with you as long as I can drive the carts like fucking blackout drunk and be super irresponsible then I'm there for it and then we have like some general staples like um apartment complexes student housing stuff like that um wow that's really interesting yeah so a couple other questions from the chat because brillian says less Eric more bull so I gotta shut the fuck up um obviously I don't give a fuck what they say but wow yeah funny line nonetheless um but this is super interesting so Jerry says why would retail want to give the brokers market maker liquidity wouldn't retail want buyers to want what we are selling instead of creating fake liquidity to move the stock in the direction they want it to be do you follow that you want me to post it in our chat yeah it's a lot don't fully well I don't fully understand what he means but how would retail create liquidity on the sell side is that what he's arguing like I'm yeah so uh Jerry could you could you clarify your question a little bit Jerry says DRDRS takes liquidity from financial terrorist",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "lot don't fully well I don't fully understand what he means but how would retail create liquidity on the sell side is that what he's arguing like I'm yeah so uh Jerry could you could you clarify your question a little bit Jerry says DRDRS takes liquidity from financial terrorist broker market maker yeah I love that um yeah I'm trying to follow the question but why would retail want to give the brokers market maker's liquidity wouldn't retail want buyers to want what we are selling so I assume they're talking about DRSing specifically like if they if you DRS then you're reducing the ability for people to buy those and move the price I don't know if that's fully accurate that's my best interpretation yeah that's I mean so that was the thesis behind the push for DRS right is you know market makers are dipping into shares and the DTC is allowing them to dip into shares at brokerage accounts so if you own and this also became with a bunch of revelations around there's Goldman and J.B Morgan and you know B.A.V. all Merrill Lynch all these brokers were found on multiple violations from the early to mid 2000s where they allowed they allowed their own traders and other institutions to dip into the personal accounts of their clients and even if they were cash accounts which are technically not supposed to allow you know stock lending right so this this problem quickly became concerned because",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "to mid 2000s where they allowed they allowed their own traders and other institutions to dip into the personal accounts of their clients and even if they were cash accounts which are technically not supposed to allow you know stock lending right so this this problem quickly became concerned because the question was right if we're buying GME and we're putting them in our fidelity we're putting them in our you know Roth 401k managed by Merrill Lynch or managed by B.A.V. or whoever are they just turning around and lending out our shares then not telling us and then using those shares to short our the stock that we own right we don't know because again they're not supposed to but they've been caught doing this many many times and again I would point you to the House of Cards D.D. by out of it he lists out like a lot of the infractions that these companies have done and then there's I think there's another one he has that that specifically goes into this this problem but yeah so with that concern people started postulating that D.R.S. was a way to remove the shares from the brokers or from the intermediary right if it's fidelity or if it's B.A.V. or Merrill and take them back into your own custody so transfer them to a transfer agent have it registered in your name and not be able to be lent out and so that's what we've been what the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "from the intermediary right if it's fidelity or if it's B.A.V. or Merrill and take them back into your own custody so transfer them to a transfer agent have it registered in your name and not be able to be lent out and so that's what we've been what the push has been for last what three years now and that one point did D.R.S. 25 of the float which was significant and from what I've seen a lot of the liquidity indicators on GME have fallen quite a bit like trading volume everything so it has had an impact now the question is can we get to 100 that remains to be seen right is there enough buying power and staying power to get all the way to 100 we don't know and then even then if we do like what will happen we don't know because no one's ever D.R.S. to 100 of the float as far as I know right well there's also yeah because I was I was trying to follow that metric too out of curiosity but what do you think of the the role of the at the markets because it didn't look like it won it didn't look like they those drops were like being heavily bought but I can't tell like I don't know like what the retail slash broader ape sentiment is right now specifically with respect to not whether or not it's good or bad don't care about that but",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "it won it didn't look like they those drops were like being heavily bought but I can't tell like I don't know like what the retail slash broader ape sentiment is right now specifically with respect to not whether or not it's good or bad don't care about that but more so like accumulating those shares is that still the idea or is it after those at the markets it's kind of like difficult to get back to where they were um I think it's the community is all over the place honestly some people are um for what I've seen some people are just holding what they have and they're just like I'm waiting for the squeeze and Ryan Cohen's built up 4.6 billion dollars I'm excited to see what he's going to do other people uh which are understandably other people are mad about dilution and they don't want it to happen they say look even though you diluted obviously at high prices and and profit it from this it we still don't like it we don't want you to do it at all and then there's a third group that's like doesn't give a fuck and they're just buying every every two weeks and DRS and with their paycheck so I see I think I think people are all over the place yeah interesting um Willie has a question for you Willie says um your take on price stabilizing at the 20 handle after two at the",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "just buying every every two weeks and DRS and with their paycheck so I see I think I think people are all over the place yeah interesting um Willie has a question for you Willie says um your take on price stabilizing at the 20 handle after two at the markets I mean I think that that's it's indicative of probably where the the new floor is for the stock so with 4.6 billion dollars of cash you know the hard floor which is cash per like their cash on hand per shares like I think 10.74 now so that's like a very hard floor where literally they could buy back they they themselves could buy back all their shares with the cash they have on hand at that level um but the obviously the delta between that the cash level the cash value of all the shares and the current market price is probably where the enterprise value of the company comes in so um you know those two combined probably are putting this 20 hard cap on the on the on the price and like like we said earlier right like to say that inf- that market makers have infinite powers incorrect and I again I'm just saying that this idea of infinite liquidity is or maximum liquidity is faulty but it's absolutely true that they don't have infinite power I mean or else no stock that they that they ever wanted to not rise would never rise",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "have infinite powers incorrect and I again I'm just saying that this idea of infinite liquidity is or maximum liquidity is faulty but it's absolutely true that they don't have infinite power I mean or else no stock that they that they ever wanted to not rise would never rise right so if they had that much power so they clearly do have to follow market market structure market demands if there's excess of buyers they have to sell it's just that they have a lot of wiggle that they can move in and they've a lot of things they can do um but this could also be indicative of market makers reaching the end of the rope and being able to if they are complicit in driving the price down continually or if other entities are doing it you know they could be running down on their ability to do it right because again fundamental factors do matter Ryan Cohen buying 12 of the float in august 2020 and then changing the board and re you know reimagining the the business plan caused the stock price to rock it from five dollars to four hundred so um yeah clearly there's there's fundamental factors here that can affect price so this can be one of them I think 20 probably be the hard hard floor for it for a while interesting yeah because one of the things I I took pretty strong note of is when the at the markets",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "there's there's fundamental factors here that can affect price so this can be one of them I think 20 probably be the hard hard floor for it for a while interesting yeah because one of the things I I took pretty strong note of is when the at the markets were going we didn't like collapse down right so that I think is very essentially confirmatory of your point where it seems like we we start finding wherever the current price is because what was the latest I forgot um somebody from the child will probably know like what the what the latest cash value was I haven't I don't remember cash value is four points six billion no per share I said I think it's around 1074 what's I think it got it sorry yes yeah I got a 10.74 yeah okay got it yeah because the cool part there I think is it starts to also show how people are starting to value the intellectual property the branding of the business so because if the if the floor does start coming in around there that's pretty powerful um cool I will ask one or two more and then I'll get you out of here I don't want to keep you on forever but obviously absolute blast chat with you man it's it's really helpful for me from a learning perspective to pick up just more and more of the story plus I'm just fascinated by it so really",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "I'll get you out of here I don't want to keep you on forever but obviously absolute blast chat with you man it's it's really helpful for me from a learning perspective to pick up just more and more of the story plus I'm just fascinated by it so really appreciate it for sure um so our friend Vladimir off Putin not to be confused with Vladimir on Putin if Vladimir might have been on put I don't know maybe I don't think Vladimir the vampire was gay he might have been and that would put him on Putin I'm not sure but um share price was 10 an April Ryan Cohen's basis is 261 on almost 37 million shares coincidence don't forget about BBBY I don't know the share price was 10 and okay sorry why is that a coincidence I don't understand the connection between his average share price and the stock price yeah same so off Putin if you have a follow on to that um let me know I'd love to I'd love to get further oh he's saying he has an escape hatch oh in terms of I see he's just saying essentially that he's on a good basis that makes sense yeah um he is on a good basis for sure so Captain Chris says do you think swaps expert is heavily correlated to spikes it can be again so here's the issue with swaps and this is what I if you go back",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "on a good basis that makes sense yeah um he is on a good basis for sure so Captain Chris says do you think swaps expert is heavily correlated to spikes it can be again so here's the issue with swaps and this is what I if you go back on my youtube channel so search proving bull um I did a long-form video like a 30 minute video on the swaps and I explained this in that video like look we have some dead on the swaps the issue is and some of them were like huge rollovers right we're talking you know hundreds of millions of dollars billions of dollars for some of them uh in total but the issue is that's the size of the the the the noional size of the swap how much of that is hedged and how much of a is unhatched you don't know right whatever the counterparty is so like let's say this swap was archa goes and credit Swedish and the credit Swedish now passed off to UBS so UBS if they have a swap open for five million shares of gme if they already have three million shares somewhere then a lot of their exposures hedge and they don't have to worry about the rest of it or if they're able to hedge it through options or or another swap what if they open up a swap with another kind of party that hedges you know passes this hot",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "then a lot of their exposures hedge and they don't have to worry about the rest of it or if they're able to hedge it through options or or another swap what if they open up a swap with another kind of party that hedges you know passes this hot potato so this is the issue with this what we talked about in really the opacity of the market is you don't know you know the exact details of the swap we don't know how much is hedged we don't know exactly where the counterparties are even in even in the in the data sheet that I uh linked in that youtube video i think i linked it but i i discuss it you don't you obviously don't see the counterparty so it doesn't say you know counterparty one nomura counterparty two archa goes doesn't say that it just says here's the swap like you know this 200 million you know basket swap entered at this time edited at this time you know and he hears like five takes sometimes they say here are five takers that were in the basket and sometimes they don't even say that so you don't even know so that's the that's the issue like i i would say look you can try to trade off the swap data but i it's not a guarantee because if it was i'd be a much richer man than i am right now and i'd be living in",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "don't even know so that's the that's the issue like i i would say look you can try to trade off the swap data but i it's not a guarantee because if it was i'd be a much richer man than i am right now and i'd be living in mansion but i have seen i've seen massive swap role of a so i'm sure you have to i've seen massive ones happen and the stock price not really move like maybe it jumps exactly three or four percent i think yeah exactly because i i ran there was so many in my community that was piecing together the swaps and they they grabbed like a whole list of them and this is also what i was working on with newton with um and i looked at a correlation between all of them the problem is when we look at a lot of the relationships we tend to focus on the ones that align with what we're trying to see so for example if we want to see or think there is a relationship between swap expiration and then stock price movement we are mine naturally claims on those instances but when we look across like the broad breath just completely looking at all of the swap expressions and the follow week price performance it's not super indicative now the following question i would have for you there though that i'm really interested in because i i haven't found a",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "but when we look across like the broad breath just completely looking at all of the swap expressions and the follow week price performance it's not super indicative now the following question i would have for you there though that i'm really interested in because i i haven't found a good source for me to test and i'm trying to find something is in terms of correlated correlation so is there any other factor that you're aware of with if big swap comes up and other factor we think there's a strong relationship with price moving so i've tried it with FTDs and it was inconclusive in terms of like the relationship and i'm wondering if there's anything else that i don't know of that i could test if you looked at ETF FTDs specifically okay because i was going to say that's the one that's the one that i found was the strongest ECF FTDs but the problem is obviously with the lag reporting in data like exactly it's a it's a backwards looking thing again if if if i was able to find to accurately predict gm e which i would argue is probably the hardest stock to predict in the world um if i was able to accurately predict it i would i would be a multi multi-millionaire because i would be killing it and i would probably be able to find the same thing true for every other stock so unfortunately no i would say you",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "predict in the world um if i was able to accurately predict it i would i would be a multi multi-millionaire because i would be killing it and i would probably be able to find the same thing true for every other stock so unfortunately no i would say you know the best what i found is gm e trades really strangely around major events so usually before earnings the stock price will grind lower for a few weeks and then it will pop up up until earnings and then it'll be slammed down after earnings and get you know being the dumps for a few weeks so do this is no guarantee but like from the data i'd looked at it was a pretty common occurrence for the stock price to fall so if you want to go long before sell it before earnings buy in a week later after earnings after the stock price is tanked that could be one strategy but again it's no guarantee because there's also been earnings where not much has happened so we just don't know yeah for earnings i have a data set actually that i can talk about it super fast that'll look through the last um if you use think or swim you can actually look at i think that you show you the last eight and the price performance leading into and then post earnings but there's another data set that i have that goes back a lot further",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "that'll look through the last um if you use think or swim you can actually look at i think that you show you the last eight and the price performance leading into and then post earnings but there's another data set that i have that goes back a lot further but the one of the main things i think for game stop specifically that i can accurately point to literally every single time before it has a big movement and it's not always positively predictive of big movement but i've seen it and it's the only thing i've ever seen uniform across every single big move is a volume expansion before the big move it typically starts a few days out that you can see it um and it's a multiple of preceding volume it's not like double it's typically triple plus so yeah and there will be instances again for everybody it's not like this magic cheat code because there will be instances that volume will triple plus and then price doesn't move but it's one of the the few things that i've found a very strong correlation with with respect to price movement have you talked to six days about a heat lamp theory i don't know who that is okay this is another interesting rabbit hole you could start pulling down six days one week he wrote a really great dd called heat lamp um back in 2022 and he's expanded on the theory and added to",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "days about a heat lamp theory i don't know who that is okay this is another interesting rabbit hole you could start pulling down six days one week he wrote a really great dd called heat lamp um back in 2022 and he's expanded on the theory and added to it quite a bit um but another thing is he noticed around drs record dates massive jumps in volume like we're talking the average of volume traded going from five million to 60 or 70 million in a day and then falling back down to five million a few days later interesting right around a drs record date which is like indicative of something going on with the ball and not not all these obviously were were coincident with price increases like the price might have stayed the same but the the someone was furiously trading gm e shares in the background to cause 60 million share volume in a day and and then the price just doesn't move and then drs record date passes and somehow drs numbers don't move so it's there's a lot of weird shit going on with the stock let's just say that yeah dude i'll have to i'll have to take a look at that if um i'll shoot you a message or something see if you can send me a link to it so i'd love to read through it um cool well i guess the the last thing i'll hit you with",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "i'll have to i'll have to take a look at that if um i'll shoot you a message or something see if you can send me a link to it so i'd love to read through it um cool well i guess the the last thing i'll hit you with before you wrap then is just looking at game stop now what do you think about it going forward i know it's a big question but i i get really engaged by all the different theories in terms of how game stop might use the money and i find a lot of that just very very interesting so super super interested in your thoughts on that sure yeah no i so going back to that that earlier tinfoil right there's a couple different theories of what what they could be doing they could be just going you know they could be trying to reinvigorate all their and rehabilitate all their stores and or they could be trying to build out a totally new online platform all those 4.6 billion that doesn't point to just uh an internal um you know optimization of their siftims or whatever it points to acquisition so likely i think they're going to acquire someone and acquire someone large now question is who and the bbby people will tell you they're going to that ryan koan's going to come and buy bbby out of bankruptcy other people will tell you that why do they think that",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "so likely i think they're going to acquire someone and acquire someone large now question is who and the bbby people will tell you they're going to that ryan koan's going to come and buy bbby out of bankruptcy other people will tell you that why do they think that because ryan like i said earlier ryan koan's listed as a creditor on on on on the bbby cap table um there's also correspondence between him and i think uh some judge really in the case like there's um yeah i think you'd have to ask them again i don't follow the bbby crowd that deeply because it's not just on the stock i trade but um there's some people who think it's that some and i think the more likely is that game sop would want to acquire someone that's in a similar category to them and just expand right um and just continue to fall down this path of of re revitalizing retail brick and mortar so i think this is likely likely option but right now with 4.6 billion in cash and making 5 of that they're sitting pretty so they don't need you know they're fine i mean they're also profitable right and their store footprints down by 22 their sqna expenses are down by like 29 and they uh yeah even though the revenue has fallen overall they're much healthier business than they were three years ago so i think ryan koan is in a",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "i mean they're also profitable right and their store footprints down by 22 their sqna expenses are down by like 29 and they uh yeah even though the revenue has fallen overall they're much healthier business than they were three years ago so i think ryan koan is in a good job of turning around the internal fundamentals of changing the the functioning of the business to actually be effective and profitable and he's been working on now what are the next steps to do with his cash and whatever you do with it you have to make sure like all the you know eyes have to be dotted the teeth have to be crossed because you don't want to mess up an acquisition like this this might be a one shot at a valid acquisition that can help a rocket you out of this um you know kind of stagged quagmire that he said yeah not to say that it's like he's not in a position where things are going downhill but it's like now okay he stopped the bleeding game stops no longer losing money they've eliminated a lot of their stores they've cleaned up you know they're act they've they've eliminated a lot of the old board for example now the question how do they really make turn this into a revolutionary company which is you know potentially could could compete with amazon so we'll have to wait and see what he does i i don't i",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "act they've they've eliminated a lot of the old board for example now the question how do they really make turn this into a revolutionary company which is you know potentially could could compete with amazon so we'll have to wait and see what he does i i don't i don't have a a solid answer for you on on what i think he's gonna do yeah um last clarifying question on that though do you have any thoughts on kind of a timeline that you would expect to see movement i would say i mean just personally within you know six to nine months i mean usually if you get this level of cash you wouldn't sit on it for more than a year that's what i would assume literally exactly my thought from a general perspective but i didn't know if there was any specific nuances with game stop because i i find it interesting a lot of people are like oh like they're making you know interest on their money and like it's good to make interest but it's you don't raise that money to make interest you raise it to do something yeah exactly so no they're going to have to yeah they have to figure out what they're doing um so or they probably already know but they're just not telegraphing it obviously they don't want it it's a bad business practice um but yeah i think i think uh in within the next six",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "they're going to have to yeah they have to figure out what they're doing um so or they probably already know but they're just not telegraphing it obviously they don't want it it's a bad business practice um but yeah i think i think uh in within the next six to nine months we should get a clear answer on what they're actually going to do with all this cash because you know sitting on this for forever doesn't really make sense i have seen other companies raise money and hold it for six months or a year but i've never heard of a company raising this level of money and holding it for like two three four years and just never doing anything with it yeah yeah yeah yeah last wait we will dude super super interesting thank you so much for coming to hang out for a little bit sharing what you know um before we wrap obviously you're on youtube at ruvian bull um people can find you on twitter it's the same handle yes yeah proving underscore bull and look for the one with the verified trademark or the verified blue blue check mark has a lot of clones that we'll try to they might try to get to join some telegram group or some discord like i don't i don't have any of that all i have is the website i've website a substack a youtube and then my twitter so beautiful yeah and i'll",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "lot of clones that we'll try to they might try to get to join some telegram group or some discord like i don't i don't have any of that all i have is the website i've website a substack a youtube and then my twitter so beautiful yeah and i'll grab the links to you and then i'll throw them in the video notes so that people can find it pretty easily but dude thanks for hanging out well definitely have to do it again it'd be fun to take a look i'm in the process of finishing going through all of roaring kiddie's old trades i think we're on like part five of the series so his reddit profile we went down to the bottom and i essentially tracking the differences between the trades and the way that he's trading them which has been fascinating so once i get that under my belt and i have a slightly better understanding of him i'd actually love to tap into your understanding of him just as an actor because he reminds me of like the the joker from batman you like really don't know what the dude's gonna fucking do and it's hilarious yeah that's why this whole thing has been like like i said it's it's something that's like a meme it's like a glitch in the matrix it breaks again it breaks all the traditional financial dogma right you should sell your winners when you're up when you make",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 108,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "it's hilarious yeah that's why this whole thing has been like like i said it's it's something that's like a meme it's like a glitch in the matrix it breaks again it breaks all the traditional financial dogma right you should sell your winners when you're up when you make 40 million dollars in a week like roaring kiddie made in the first week of 2021 you should sell and then he's just like no i'm not selling you gotta stop or anything yeah no no he's just like what's an exit strategy and then he comes back in may of 2024 three and a half years later and somehow he has fucking like 200 million dollars it's like what the how did he where did he come up with all this money like what has he been doing and he'd no answer he's just like oh by the way i bought you know i bought five percent the float of gm e in options uh expiring for next month like let's go yeah the absolutely classic yeah it's it's been understanding his movements has been really really interesting except first i thought maybe the value investor normal to have like price targets clearly not that then the way that he even manages his options trades i found that to be really interesting that he sometimes would sell his in the money options and hold the out of the money options which i also find that super interesting it's like",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 109,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  },
  {
    "text": "like price targets clearly not that then the way that he even manages his options trades i found that to be really interesting that he sometimes would sell his in the money options and hold the out of the money options which i also find that super interesting it's like a series of just questions i'm just like i don't fucking know what's happening it's epic yeah it is epic it's probably the best you know story and finance in the last two decades at least if not more couldn't agree more yeah definitely the most interesting so thanks for sharing your information with me man and we'll definitely reach back out and look to chat with you again yeah for sure list this again this was really fun thanks for having yeah awesome see you everybody",
    "metadata": {
      "video_id": "PwoEFKVQvSQ",
      "title": "GameStop Analysis with @peruvian_bull",
      "url": "https://www.youtube.com/watch?v=PwoEFKVQvSQ",
      "upload_date": "",
      "duration": 7363.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 110,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PwoEFKVQvSQ&t=0"
    }
  }
]