[
  {
    "text": "What's up, outliers? Quick market update. We're going to talk a little bit about Siga and this new monkey box public health concern that's going on. We're going to talk a little bit about some upcoming earnings in stuff like Cisco, Baba. And that probably get us pretty good throughout the video today. So let's get straight and we'll talk about GameStop. My bad at the end, we will absolutely take a look at GameStop. Mostly just because I started a cadence on it. And once I start something, I just kind of keep doing it. So that will be here as well. But let's start with Siga. If you'll notice, Siga is up 26.9 on the day, massive massive move. This popped up on a couple of my scans. And why did it pop up on some of my scans? What really has to do with this uptick in Mpox, so which is monkey pox, by the way? So if you take a look, this came out earlier and it's essentially talking about what this whole monkey pox thing is about. I'm going to read because I don't know exactly what it is. I have an idea, but I'll read to you exactly what it is. It's an infectious viral disease that can occur in humans and other animals. Symptoms includes rash that forms blisters, crusts over fever, swollen lymph nodes. It says the illness is usually mild. And most of the infected will recover within a few weeks",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=0"
    }
  },
  {
    "text": "read to you exactly what it is. It's an infectious viral disease that can occur in humans and other animals. Symptoms includes rash that forms blisters, crusts over fever, swollen lymph nodes. It says the illness is usually mild. And most of the infected will recover within a few weeks without treatment. Symptoms include rash, fever, exhaustion, swollen lymph nodes, muscle aches, sore throat. And the medication is, okay, let's see how bad antivirals, that's the easy one to say. The one that's not easy to say is teco-virumat. See, I'll write that is. I don't feel super confident there, but essentially it looks like chicken pox, small pox, much less infectious and it doesn't seem quite as deadly. Now, interestingly enough, though, if you take a look at the company's siga, it produces an antiviral for it. So that's why it's flying up and off to the races today. This is one of the really cool things about markets is I just got a refresher in what monkey pox is. I got a refresher on a company that is performing because of the new concern that's coming up. And it's all tradable events. So you can see this isn't new news, right? You can see that going back to the first that there's been some early conversations about it specifically on the fifth, the World Health Organization warns on a deadly or strain of monkey pox. And you can kind of see that it's been building over time. The",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:01:06",
      "start_timestamp_seconds": 66.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=66"
    }
  },
  {
    "text": "new news, right? You can see that going back to the first that there's been some early conversations about it specifically on the fifth, the World Health Organization warns on a deadly or strain of monkey pox. And you can kind of see that it's been building over time. The eighth, it shows plans to declare regional monkey pox outbreak and emergency. And you can kind of see the way that the stock moves with this news. And then today, it was declared as a public health emergency. And a coordinated international response is essential to haul outbreak. So tradable events. These are tradable events to me. I always look for stuff like this because it's a catalyst. There's movement. It's super unfortunate. I don't want to see monkey pox going crazy. I don't want to see people going through viral infections and having to endure that. That sucks. But there's a reality here from the market perspective. And this company builds a potential cure slash solution for it. And you can see that being reflected here today, the volume was insane at 13 million volume, where it's 20 day average volume is just what 1.2 million shares up and off up and off to the races. So this is something you could play a bunch of different ways for something like this. It looks like a lot of the move probably has happened. If you got into late, for me, when I first start looking, it's kind of when",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:02:18",
      "start_timestamp_seconds": 138.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=138"
    }
  },
  {
    "text": "off up and off to the races. So this is something you could play a bunch of different ways for something like this. It looks like a lot of the move probably has happened. If you got into late, for me, when I first start looking, it's kind of when it breaks above this 10 handle, it looked really interesting. So that's when I started nibbling. And it's just because I was looking above recent resistance, at least as far as I could perceive it. This would be a much shorter term trade for me. And I'll just kind of follow it up. But that's really all there is to this one. It does have options, although they are grossly illiquid. They're not great. But they can get the job done. If you need some options in here, you can trade stuff like a ratio diagonal on the call side. That's what I did. And it's not very liquid, but there's enough to get the job done. That's one of the cool parts about being a poor retail trader is that you're small enough that you can make stuff like this work sometimes. So yeah, overall interesting breakout, I guess you could say pun partially intended. And that is just one idea off of this, but I think it's something to keep an eye on. Now, specifically, if the deadlier strain starts to take hold, that's really important because we just went through a global pandemic not too long ago.",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:03:35",
      "start_timestamp_seconds": 215.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=215"
    }
  },
  {
    "text": "you could say pun partially intended. And that is just one idea off of this, but I think it's something to keep an eye on. Now, specifically, if the deadlier strain starts to take hold, that's really important because we just went through a global pandemic not too long ago. We know how that goes. So again, it doesn't seem so far. Like this is anything like that. I'm not here to try to fear monger. I'm just saying it's something I personally would watch, depending on how the deadlier variant emerges and what that looks like. In the meantime, you can just play the initial response here. And that's kind of the way that I look at it. So that is say go now we have to take a look at Cisco. And they just reported earnings and they came in at 87 cents against 77 70 cents estimate. So they topped expectations pretty well. And after the market here, they're running 48 bucks when it closed at 45. So this is just a standard earnings play for me. Nothing sexy in here. I did have a slight bullish skew just because I don't fear the downside in something like Cisco as much as I fear the upside because if for whatever reason, this thing decided to really start taking flight, it can get terribly painful. And I mean, based on where we close today, again, like the open tomorrow, if it stays around where it's at, the opens",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:04:37",
      "start_timestamp_seconds": 277.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=277"
    }
  },
  {
    "text": "like Cisco as much as I fear the upside because if for whatever reason, this thing decided to really start taking flight, it can get terribly painful. And I mean, based on where we close today, again, like the open tomorrow, if it stays around where it's at, the opens up here. So it's a pretty big gap up. But not terrible. Definitely overall manageable position here. Now the overall earnings though looked decent. I didn't get a chance to go through all of it, but we can take a look at some of it together here. And let's see. So product sales came in at 9.86 billion. And it looks like revenue came down just a little bit and it plans a workforce reduction of 7. Typically, don't like to see that, but it's typically favorable for the following quarter. Everything else remaining the same. It does help cut costs. So this isn't awfully surprising to see here because it is, I mean, if you look at the path of Cisco, it doesn't look as good as pretty much everything else that's been flying along with this broader tech headwind. A lot of things, especially in the AI space, have been flying off the charts here. So when Cisco kind of has this kind of chart configuration, it does cause some questions. I don't want to necessarily go as far as to say that it gives Intel vibes because this is a whole other story, which this is again,",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:05:50",
      "start_timestamp_seconds": 350.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=350"
    }
  },
  {
    "text": "have been flying off the charts here. So when Cisco kind of has this kind of chart configuration, it does cause some questions. I don't want to necessarily go as far as to say that it gives Intel vibes because this is a whole other story, which this is again, another really interesting trade that I like down here for a whole other thing. But Cisco looks like it needs to do something. So the fact that they're looking at cutting some workforce doesn't holistically surprise me much at all. So it says revenue for the quarter ending 27 July 13.64 billion, which is down from 15.2 billion year earlier. And they expected 13.54. So came in a little bit better than expectations. And then it expects fiscal 2025 non-gap EPS of 352 to 358 and revenue falling between 55 bill and 56.2 bill. And right now the expectation is 355 and 55.68 billion. So kind of like right in there. So yeah, that's that. All right, let's now take a quick look at Boba because Boba reports more morning. And it closed down 2 on the day after hours trading right around 80 so up about 50 cents. And this one I'm kind of eager to see this is not one I'm trading. And it's primarily because the last view that I saw, I mean, look at this. This is like just parabolic chop around the earnings. Look at all of these. It's just kind of madness. If you",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:06:57",
      "start_timestamp_seconds": 417.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=417"
    }
  },
  {
    "text": "this one I'm kind of eager to see this is not one I'm trading. And it's primarily because the last view that I saw, I mean, look at this. This is like just parabolic chop around the earnings. Look at all of these. It's just kind of madness. If you wanted to go long-vall, this wouldn't be a terrible spot to do it. I don't think. But long-vall isn't really like through earnings is not my typical go to. But this does have earnings coming up tomorrow before the open. So it'll be another one I'm taking a look at because Boba is kind of a good representation just of broader economy and specifically for China. So I'll use it just for a general proxy on like what they're seeing how things are going. So that is that for Boba. All right, now let's take a quick pivot to kind of the broader market. I really want to highlight one specific thing. We don't have to spend a bunch of time taking a look at this stuff. But let's grab our standard flexible grid here so we can see what's going on. And again, divergence. That's what I see. Russell rotating down, down day, cues slightly down. S and P500 up divergence. So what does this mean from a tradable scenario? To me, it's kind of like watching it unfold until it gets to a point that it starts to become even more appealing. And the appealing part would be",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:08:24",
      "start_timestamp_seconds": 504.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=504"
    }
  },
  {
    "text": "rotating down, down day, cues slightly down. S and P500 up divergence. So what does this mean from a tradable scenario? To me, it's kind of like watching it unfold until it gets to a point that it starts to become even more appealing. And the appealing part would be something like short large cap, long, short, long small cap. I was going to say short cap. I don't know why it doesn't really make sense. So, but being short large cap, long, small cap. It's been a okay trade, but it's taken a long time to come in. That's why I'm being a little more cautious in terms of my timing. And I still have my long, teachable cues position. So it wouldn't be like I'm overall gross short, the large caps. It would just kind of be a small pair of straight specifically between something like IWM and Spy. But the relationship between the two of them has been fairly defunct for a while now. So what this means for me is as I'm watching small caps, it's eyes on small caps. I want to see if it can start breaking above these levels here. And I just want to see if it can catch a bit. And if it can start just getting some sort of strength underway because I do still find it interesting that we have a rate cut that's still projected at 100 coming up and small caps are still just not playing ball",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:09:21",
      "start_timestamp_seconds": 561.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=561"
    }
  },
  {
    "text": "want to see if it can catch a bit. And if it can start just getting some sort of strength underway because I do still find it interesting that we have a rate cut that's still projected at 100 coming up and small caps are still just not playing ball here. I can't help but find that interesting. The other thing I can't help but find interesting is the fact that the sale volume today was massive. Buy volume was 7.8 million. And the sale volume was 17.38 million. So that tells me that there's just a lot of repositioning happening by these larger funds in these really short term time frames, which is kind of crazy. Typically you don't see it necessarily go down like that. So yeah, I mean, that is part of what's going on here. Bonds are still ticking up and up and up. So I see them at 124.13 here on ZB. So broad market is kind of in this weird spot starting to see more divergence is kind of the main call out here. Now the other thing I want to highlight is this. This is really interesting to me. So if I take a look at QQQ, which is the NASDAQ at a tiny little bit of a down day today, volume was mostly by volume 65. But then take a look at net highs lows. Net highs lows still negative trending right around negative 56s. Essentially unchanged over yesterday. It was like",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:10:34",
      "start_timestamp_seconds": 634.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=634"
    }
  },
  {
    "text": "a look at QQQ, which is the NASDAQ at a tiny little bit of a down day today, volume was mostly by volume 65. But then take a look at net highs lows. Net highs lows still negative trending right around negative 56s. Essentially unchanged over yesterday. It was like negative 59 yesterday, negative 56 today. And the gross highs is growing and went from 80 to 101. Gross lows is also growing from negative 139 to negative 157. This is not super common that you'll see this. So for me, this is the kind of thing that I will watch and see how net highs lows pans out specifically in the cues before I start doing a whole lot because again, like this is an abnormal divergence in the indicator. And it's something that I would want to see how it resolves. Is it that the general pack of stocks is starting to uplift with just a smaller group of lingering stocks rotating under could be. But I also care about the change. So day over day, we added 21 highs and a little under 20 lows. So that is starting to capitulate towards the high side. So I have to wait and see how that pans out. So what does all this mean from a broad market? It's a weird one. I still have my cues position on as I already said. Still trading zero DTEs, all that kind of stuff standard programming there. But I think you",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:11:43",
      "start_timestamp_seconds": 703.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=703"
    }
  },
  {
    "text": "have to wait and see how that pans out. So what does all this mean from a broad market? It's a weird one. I still have my cues position on as I already said. Still trading zero DTEs, all that kind of stuff standard programming there. But I think you kind of have to be careful here. This clearly isn't looking like some sort of straight parabolic V-shape recovery back up to highs still could be. But it doesn't necessarily look like that. And again, one of the things I would point to for that specifically in the NASDAQ is that the majority of the volume today was by volume and it's still closed down. So it tells me that the buyers aren't super strong here. And it does tell me that we're starting to see enough larger size selling stepping in to push price at least a little bit. And also that I've heard from the indices. I don't like seeing spy and cues moving quite so differently. Not crazy to see small caps moving as they are just because they kind of been on a different program for most of the year, but seeing the divergence between all of them makes me interested. So right now I'm playing shorter term thesis. I'm playing earnings. I'm playing things like I kind of talked about in the beginning of the video. Playing just shorter term velocity style movements. Not so much drift right now. And it's because I'm waiting to",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:13:00",
      "start_timestamp_seconds": 780.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=780"
    }
  },
  {
    "text": "of them makes me interested. So right now I'm playing shorter term thesis. I'm playing earnings. I'm playing things like I kind of talked about in the beginning of the video. Playing just shorter term velocity style movements. Not so much drift right now. And it's because I'm waiting to see how things set up. All right, let's take a quick look at GameStop. Gotta be honest, it's been quiet in here. It's been quiet in GameStop. And today it is again. So if we take a look, it is just trending sideways. We've gone from like 2154 to 2190 for like the last five days. We are just grinding sideways here. From a volume perspective, we are still anemic. Volume is super, super low. We are still light years away from the 20 day average, which is 8.3 million. Today's average was three today's not average. Today's total volume was 3.46. So very light transactions going on in here. It does still look like when I look at the options chain that the activity in the near term expiration is is surprisingly as as spicy as it tends to be. So the 16 aug expiration is pretty built out here. Now again, I'm trying to keep an eye on this 20 step expiration to see how the build out is going there as we're getting closer and closer. And it's not that crazy. Neither is the build out in 23 aug or 30 aug. So what that tells me",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:14:06",
      "start_timestamp_seconds": 846.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=846"
    }
  },
  {
    "text": "here. Now again, I'm trying to keep an eye on this 20 step expiration to see how the build out is going there as we're getting closer and closer. And it's not that crazy. Neither is the build out in 23 aug or 30 aug. So what that tells me is I'm actually not positive where people are going to reposition. Once we come up at the end of this week. So we can see some of the volume for today. And we can see some of this is moving out into 23 aug. That's what these are. And you can see a little bit. This looks like moving out to 30 aug. That's what these are. So there's some rotation happening today. But it's not a lot. 82,000 traded today on the call side versus 20,000 puts. So right now from specifically game stop perspective, it kind of does look like we're in a bit of a holding pattern still. I'm eager to see how things start getting busy around earnings. I'm still not seeing earnings expiration cycle. IV is high as I would expect it. My guess is this will start to jack up more and more as it gets a little bit closer. But it's not massively high. The other thing I want to look at quickly is what is the expiration cycles look like coming up? So 16 aug there's 295,000 calls, 100,000, 100, 6000 puts. 23 aug is 41,000 to 11,000. 30 aug is 37",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:15:21",
      "start_timestamp_seconds": 921.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=921"
    }
  },
  {
    "text": "it gets a little bit closer. But it's not massively high. The other thing I want to look at quickly is what is the expiration cycles look like coming up? So 16 aug there's 295,000 calls, 100,000, 100, 6000 puts. 23 aug is 41,000 to 11,000. 30 aug is 37 to 10. 6 step. Wow, that's actually really surprising. It's 12 to 2. So just super quiet, super, super quiet. 13 step 48, 100 to 2, 6, 100 and then 27, 49 to 27. So overall, the front expiration as per usual with game stop is the busy spot. But it does look like very quiet after this expiration cycle. So really what this means for me is I still have my shares. I'll just keep holding those. But when it comes to trading options or playing options, I'm selling calls against the shares because we're just trending sideways. And that helps support the position a bit. And there's still good IV in the product overall. So if we take a look at the out of the monies, we took a look at the vol, you can still see like there's really decent out of the money call volume or volatility. Sorry. So this is still heavily appealing to me from an option selling perspective to take something and get against the long shares because again, the long shares are just kind of grinding sideways. They're not really doing anything super fun to look at. So that is that as",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:16:30",
      "start_timestamp_seconds": 990.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=990"
    }
  },
  {
    "text": "volatility. Sorry. So this is still heavily appealing to me from an option selling perspective to take something and get against the long shares because again, the long shares are just kind of grinding sideways. They're not really doing anything super fun to look at. So that is that as always, there's any questions. Let me know the outlier pros. We have a live stream later today. And then the GME live stream will be this coming Saturday Newton. We don't know if he's going to be there. He's starting to feel a little bit better, but it might be a lot, you know, depending on how he's feeling on the weekend. So we'll probably make a game time decision for him if he's able to join, but if not, we'll definitely reconnect soon enough. And we he and I have a lot to talk about. We've been texting a bunch just kind of throwing some ideas around that we both want to talk about. So looking forward, hope you still feel better, my dude. And then for everybody else, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "PzWLuzDBN6k",
      "title": "Market Recap | mpox, SIGA, CSCO, GME",
      "url": "https://www.youtube.com/watch?v=PzWLuzDBN6k",
      "upload_date": 20240814,
      "duration": "00:18:41",
      "channel_name": "Outlier Trading",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:17:43",
      "start_timestamp_seconds": 1063.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=PzWLuzDBN6k&t=1063"
    }
  }
]