[
  {
    "text": "you you you you you you you you you you you you you you you you Lauren with you I want to So this looks like it just happened a little while ago. Yeah, so this is essentially must saying that he hopes the US and the EU will have no tariffs. Okay, so let's take a giant step back. What's happening right now is Trump is clearly using the tariffs as a way to start dialogue. And it's super important to understand this. Now the way that we arrived at these various relationships, and if you haven't read this, you should because this document is really interesting because a lot of what it talks about raises a lot of questions on how are we even calculating what the total tariffs are because it's not just the direct tariffs. It's also fiscal policy that gets involved in that which starts to get kind of weird. But beyond that, it seems like the broader intent here is to use tariffs as a method to start gaining attention and let me show you why I have a, oh yeah, I posted it on X. Oh no, in the discord these. Oops, open this one. Open this one. Open this one. Open this one. So what I'm showing you is a stream of different, different tariffs as they sit right now. And the reason why this matters is because if we take a step back and we try to actually understand what's going",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "this one. Open this one. Open this one. Open this one. So what I'm showing you is a stream of different, different tariffs as they sit right now. And the reason why this matters is because if we take a step back and we try to actually understand what's going on. It's important to try as I remind you, well, it's the same thing when we look at stuff like GameStop. It's really important to try and strip away your bias, your preference, the things that you want to see, the things that you would prefer to see. And we look at this in the context of what it is. And so far, Trump has done several things seemingly in an attempt to gain more traction quicker on different issues, different things that he's taken issue within campaign on. Okay, I'm not going into pro or con whether the stuff is good or bad. And I'm trying to do a set of baseline for what the current context is and what this can look like going forward. This is to answer the questions that I was getting. So we have to start by understanding the context though. The reason why this matters is because there are people right now that are freaking out, crying all sorts of things. They're saying, well, tariffs are terrible, tariffs are bad. We shouldn't do tariffs. And again, I'm not weighing on that one way or the other. But the fact of the matter is",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "this matters is because there are people right now that are freaking out, crying all sorts of things. They're saying, well, tariffs are terrible, tariffs are bad. We shouldn't do tariffs. And again, I'm not weighing on that one way or the other. But the fact of the matter is in a lot of these other countries, there are tariffs. So whether they're good or bad, we like them or we don't, there are absolutely our instances where there are not only trade differentials that are massive, surpluses and deficits, typically slightly disadvantages to the US. But there's also existing tariffs in these other places and duties, not straight tariffs. The reason why all of this matters is because I think it partially gives some insight as to why we would come out with a sludge hammer where everybody thought it was going to be a scalpel. I was duped too to be clear, the entire stock market was duped because the way that it was messaged coming into this was that it was going to be way more scalpel, but coming out with a blank, 10 tariff on everything, that immediately shook everybody because that becomes like, whoa shit, this is completely different than what we thought it was going to be. That matters. Now there's this side of the argument that is completely hinging on the trade agreements between countries. And that's more so how Trump looks at it. It's not so much as individual items. I noticed",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "this is completely different than what we thought it was going to be. That matters. Now there's this side of the argument that is completely hinging on the trade agreements between countries. And that's more so how Trump looks at it. It's not so much as individual items. I noticed that he'll use different items for examples, but you could tell he's talking about it at the country level, whatever the trade disparity is there. Then there's the reshoring element of this, which is also a thing. And the reason why this is so important is because we have a couple of questions again as traders to ask ourselves now to figure out what we think may or may not happen because again, this is how we position ourselves. And I will show you what I mean. If we have this issue, let's this issue here, we call it tariffs. The issue was split into two pieces. There's trade, which is our relationship with different countries, and then there's reshoring. These issues do not behave the same. Example, if one of our reshoring priorities is domestic chip production. If this is one of the key things that we're trying to accomplish, which has been said multiple times, well, what does that tell us? That even if Taiwan says, yo, and to be clear, I don't even know if Taiwan has current tariffs or duties on us. That was one country I don't know. I just know that a lot of",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "accomplish, which has been said multiple times, well, what does that tell us? That even if Taiwan says, yo, and to be clear, I don't even know if Taiwan has current tariffs or duties on us. That was one country I don't know. I just know that a lot of chips are made there using it as an example. I am very against spreading bum scoop on shit that I don't know. So this one I don't know easy to find out, but it doesn't really matter right now for this example. So let's say Taiwan does have duties on the US, whatever they are. And let's say Taiwan says, yo, we're going to take hours down to zero. Right. If we and let's just say, again, I don't know what the US tariff on Taiwan is, but let's say the US currently is at 10. There's now a competing interest because if the US then chooses to say, well, thank you Taiwan. I'm stoked that you guys will take years down to zero. But if the US takes theirs down to zero, then what happens then this incentive starts to fall away because Trump is also said he doesn't like the chips act. So he's also he's using tariffs to do two things at once, which is super important to pay attention to. There's another element here because when we hear things like tariff revenue, this is a thing. This is absolutely a thing. But when we think about",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "like the chips act. So he's also he's using tariffs to do two things at once, which is super important to pay attention to. There's another element here because when we hear things like tariff revenue, this is a thing. This is absolutely a thing. But when we think about something like GDP, this isn't talked about enough. GDP, gross, domestic production, gross domestic production. The D matters as I like to tell my wife. Okay, so the tariff revenue side of things in the beginning with all of these tariffs is going to be high at a high level. Right. So if we have this level, this is zero tariffs. This is 100. This is the revenue generated. It's going to be filled up. So the amount of revenue that we're going to get from tariffs will be higher in the beginning. And then a lot of people are saying, well, how does this make sense then? Because Trump is talking about all of this tariff revenue. But if the tariffs then get negotiated down, then what happens to that tariff revenue? This hope, this opens a really important point that hopefully you're following at this point. And it's that there's a handoff. As more reshoring occurs as from the original tariffs, there's a handoff. You have tariff revenue over here. And then this is an accurate, but we'll call it reshoring revenue. What happens here is as the tariff revenue starts to slow down because more stuff is",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "that there's a handoff. As more reshoring occurs as from the original tariffs, there's a handoff. You have tariff revenue over here. And then this is an accurate, but we'll call it reshoring revenue. What happens here is as the tariff revenue starts to slow down because more stuff is built in the US. Because the amount of revenue we're generating from tariffs naturally decreases. But there's a compensatory element, which is the amount of revenue that's generated now from reshoring, which maybe it starts here, actually starts to increase. So you start making more money from this side of the equation. I am in no way suggesting it is as simple as this because it isn't. But at a high level, this is a big piece of what's going on here. And the reason why this matters so much to you is because the entire market right now is in a wildly dangerous place. A wildly dangerous place. And because of this danger. The way that this new news and any developments comes from this is going to directly affect the market in a pretty big way as you've seen the last couple days. That's things like if other countries start increasing their tariffs and this turns into a tariff war, that's destructive. That's literally going to hurt literally everybody. And if you take a look, one of the interesting things I've found so far just kind of poking through this is if we hide this so you can",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "countries start increasing their tariffs and this turns into a tariff war, that's destructive. That's literally going to hurt literally everybody. And if you take a look, one of the interesting things I've found so far just kind of poking through this is if we hide this so you can see. You can see Israel, who funny enough is supposed to be one of our really big partners, but somehow there are tariffs there for whatever duration. But then all of a sudden, there's now movement. When did this happen on the 1st of April? Interesting. So this is obviously people looking to make a change. So this is Israel. Next, there's Argentina. Argentina is now in talks with, I don't know how you couldn't have a successful talk with sideburns like this. But they're having talks right now again to attempt to get rid of this tariff picture. This came out on the 1st of April. Next is Vietnam. Vietnam is trying to figure out how to decrease the tariff picture. What I'm trying to highlight is right now, whether you like it or not, doesn't matter. Again, try to look at it objectively because to be clear, there are plenty of instances right now where I don't like the way that we're treating some of our friends like my opinion. I wish that it was more collaborative, but what I wish doesn't matter what matters is what is. So right now, as these tariffs are being launched, you",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "are plenty of instances right now where I don't like the way that we're treating some of our friends like my opinion. I wish that it was more collaborative, but what I wish doesn't matter what matters is what is. So right now, as these tariffs are being launched, you can see that there are a lot of instances where there are countries saying, oh shit, this is actually happening, need to do something about it. And this is why for a lot of people that were very, very, very curious what was going on in Nike is this. A lot of shoes are built in Vietnam. So countries, I'm sorry, for companies that do business in countries that are looking to reduce their tariffs and there is a probability that it might happen. The shares are appreciating pretty significantly. So this here is really interesting to see. And you can see that it's happening in a lot of different places. It's not just happening in primary trade partners or countries that were close with like Israel. It's starting to occur in other countries. So now we have a really, really delicate problem in front of us. How long do the tariffs stay in place at what rate? Because if the tariffs stay in place for a long time at this rate, when I say a long time, I literally mean a couple months. There's going to be massive, massive damage done, massive damage done. But right now it's essentially",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "the tariffs stay in place at what rate? Because if the tariffs stay in place for a long time at this rate, when I say a long time, I literally mean a couple months. There's going to be massive, massive damage done, massive damage done. But right now it's essentially trying to negotiate through strength. Again, whether you like it or not, just look at it objectively. That's what this is. The only reason why you slap on tariffs like this, rather than trying to come to an agreement before you put the tariffs on. This is essentially showing the bite before the bark and then trying to have some sort of dialogue afterwards. We do not know if this will promulgate because again, this issue that I showed you earlier, I don't have a sense of this yet. I don't know. But this becomes if this is weighted by Trump 51 on the scale versus trade. That means that the negotiations and the discussions that you see around trade are not inherently going to move the needle if we're trying to use tariffs to drive reshoring. So at this point, from my lens as a trader, what I'm doing is paying hyper close attention. I've been listening to stuff all day today because I like this is the kind of thing that can move very quickly. So I'm trying to at least understand what's going on and to stay as close as I can possibly because like you saw",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "is paying hyper close attention. I've been listening to stuff all day today because I like this is the kind of thing that can move very quickly. So I'm trying to at least understand what's going on and to stay as close as I can possibly because like you saw in the last couple days. As new information is priced in and price was dislocated previously, you'll see huge opportunities, huge trading opportunities. So that's effectively what I'm seeing right now with this whole tariff conversation. Dark Mark says any good listens. Yeah, give me one second. So the anything with Scott Bessent is been good. I've listened to a few. He's been on a few things pretty recently. I think listening to Ludnic has been on Forbes. I try to avoid listening to the commentary on either CNN or Fox. Just because it's like it's too polar. But as you all know, all of these new stations every single one of them has a tilt of some sort. The only reason why I'm mentioning that here is it is something you should be aware of as you're listening because it's going to change the kind of questions that are asked and then the answers that you get and then the narrative that you walk away from. So what I do is try to listen to this information through financial media because typically financial media cares a lot more about the financial impact. But then I will literally go back",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "asked and then the answers that you get and then the narrative that you walk away from. So what I do is try to listen to this information through financial media because typically financial media cares a lot more about the financial impact. But then I will literally go back and listen to it on CNN, Fox, just other style interviews about this stuff because it's important to get some different ideas like for example, one of the one of the things that I did not know is that. And this has not been covered on the right side of the equation is that there are some things from China that are essentially going to have over a 70 tariff, not the whole kit, not everything from China. But some things because there are some items that had a prior classification that now additive with all the rest of this stuff. There's more so that was an interesting thing that I didn't catch elsewhere and from the other side of the equation, there are different elements that you can capture like some of these pieces of news, these conversations that are happening. I'm not seeing a lot of that from other places. I'm also not seeing a lot of the left side of the news so far talking about this relationship between revenue because we're essentially just saying tariff revenues, the cost of the consumer. And this is effectively all bad, which again, there are absolutely is an argument there,",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "other places. I'm also not seeing a lot of the left side of the news so far talking about this relationship between revenue because we're essentially just saying tariff revenues, the cost of the consumer. And this is effectively all bad, which again, there are absolutely is an argument there, but it's important to note that as this happened, there is there is no tariff on domestic production, he's made that clear. Even with automotive's if a car has parts from other countries, but then is assembled in the US, there's no tariff on it. So like piecing together all of these little details takes a lot of time and effort because you have to go to all these different news sources because everybody's a fucking agenda and you can't just hear information. It's super annoying. I would love to just see a list of information, but alas, we do not have that anyways, this relationship super important to pay attention to. Okay, so before we pivot away from the whole whole tariff thing, the first thing is I want to see if what I just talked about connected doesn't make sense. Do you have follow on questions about what we just looked at. Yeah, the main things to look for going forward from here is any news about tariff negotiations or tariff retaliations. If you see any of these things, then you can start trading it literally. So the move that you saw in Nike easily traded easily traded",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "we just looked at. Yeah, the main things to look for going forward from here is any news about tariff negotiations or tariff retaliations. If you see any of these things, then you can start trading it literally. So the move that you saw in Nike easily traded easily traded because everything right now is in a way that you can see. In a wildly, wildly jacked up level. So what I mean by that is if you think of maybe we'll do a pendulum. So here's the pendulum. Let's say. Oh, geez, I can't draw straight line with this thing for my life. It's because I have it at an angle. Hold on. That's better. So here's our pendulum. Maybe as like spikes and shit on it to be cool. And let's say that our pendulum angle normally is like this. What I mean by this is as we get new news, new information, the pendulum swings one way and then it swings back this other way, but maybe it stays within this general range defined here. Well, right now what you see in Nike is this. The pendulum is now going way out here and way out here and imagine this being the price of the stock. So Nike obviously got smashed and sent this way on news of the tariffs. Then there is a monochrome of hope. Notice that these aren't they're not even saying the tariffs are gone. They're not saying that the they're in good",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "and imagine this being the price of the stock. So Nike obviously got smashed and sent this way on news of the tariffs. Then there is a monochrome of hope. Notice that these aren't they're not even saying the tariffs are gone. They're not saying that the they're in good conversation right now. They literally just said we are trying to reduce the tariffs. That's effectively what they said. And if you look at the movement in Nike, it's like, oh, yeah, we are back. We are back bit to high, baby. And you had better believe that if these conversations don't go well or if Trump decides at that point now, you know, I understand, but I still want to reshore. Yes, where Nike goes back this way. So this is one of the environments where typically when I'm trading this kind of this kind of stuff, it's like day trades. It's very short term durations the overwhelming majority of what I do as a trader is much longer term, not much longer than a day much longer. But typically like two to eight weeks, something like that. But right now with how wild everything is and how much this pendulum is swinging, everything is really shortened up a lot for me. So if you pay attention to those things, there can be really cool trade ideas, which is really easy to do. All right, there was a couple of things I saw pop in. Dark Jen says, but",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "this pendulum is swinging, everything is really shortened up a lot for me. So if you pay attention to those things, there can be really cool trade ideas, which is really easy to do. All right, there was a couple of things I saw pop in. Dark Jen says, but how long does it take for companies to reshore? How much reshore does a company have to do before they are exempt? How long is reshore and take if it's going to take four years, wouldn't it? Where's the rest of your thing? Make more sense just to wait for the next administration to great question. And that's actually something we talked about the past week is we don't know how different organizations and different companies are thinking about it yet. Because the reality is that's exactly correct. However, there's likely going to be different incentives for different places to reshore. There's a there's again, the ability to look at stuff objectively is super important. And let me ask you a question. When you think about COVID, what kind of what kind of thought do you have about COVID? Like do you think that it was a good thing? Do you think it was a bad thing? What's the general sentiment you have towards COVID? Because the vast majority of people will say, COVID was bad. COVID sucked. A lot of people died. Both my grandparents on my mom's side died of COVID. So from that lens sucked. Not ideal.",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "you think it was a bad thing? What's the general sentiment you have towards COVID? Because the vast majority of people will say, COVID was bad. COVID sucked. A lot of people died. Both my grandparents on my mom's side died of COVID. So from that lens sucked. Not ideal. There's still good stuff that came out of COVID. COVID was useful. One of the things COVID identified is that right now America is overly dependent on people that we don't necessarily have the best total relationship with some of which are our direct competitors. And if there is some sort of conflict escalation, having really important things like medicine, chips, technology, built or largely built by these competitors is fucking dangerous. That's the reality. And that's something that we got too comfortable with with respect to just globalization and trying to become overly efficient. Because there's a relationship. There's a relationship between robustness again back to our teeter totter that's apparently not connected. There we go. Got like a little ball in there. So we have robustness. And we have a lot of people who are efficient. When we talk about globalization, this is what we are focusing on efficiency. We're essentially saying Taiwan for an example. They've built the infrastructure. They have the expertise. They have the facilities. It is so much more efficient for Taiwan to build chips in Taiwan. During COVID, what happened? We noticed a egregious lack of robustness because so much stuff that we",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "efficiency. We're essentially saying Taiwan for an example. They've built the infrastructure. They have the expertise. They have the facilities. It is so much more efficient for Taiwan to build chips in Taiwan. During COVID, what happened? We noticed a egregious lack of robustness because so much stuff that we use now depends on chips. And we couldn't get them. So from COVID, we learned that for something like chips. We need to sacrifice some of this efficiency in order to prioritize a little bit more robustness. Now, like most things, this is not binary. This does not mean that you can't be purely robust or you have to be purely robust or purely efficient. It's not that at all. But what it does mean is that there has to be some production changes in order to strike a balance here. So this is relative to chips. This will happen across the board. So going back to dark Jen's point is how long does it take? It depends entirely on the company. There are a lot of like think of auto manufacturing auto manufacturing. They literally need to come back in dust off a bunch of these plants rehab them a bit and they can easily get back online. If we're talking about chips where you have to build literally state of the art facilities with insane tolerances in order to produce what you're supposed to produce that's going to take longer. But that's also why the incentive structure will",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "a bit and they can easily get back online. If we're talking about chips where you have to build literally state of the art facilities with insane tolerances in order to produce what you're supposed to produce that's going to take longer. But that's also why the incentive structure will probably be different for them. So that's it really is industry and company dependent and it's a really important thing to pay attention to because again going back to the trader's lens. You'll notice I do this all the time when we're talking about broader concepts like this. My brain always goes back. Where's the tradable part of this? Is there a tradable part of this? How can this inform trading? And there is an informative function here because what would you think about the probable performance of chip companies in the near term even if they do agree to reshore we already know it's going to take a long time for them to do it. So unless the ins in the incentives are maintained which I imagine they would be literally from a global security perspective. They're probably going to struggle. So you can come up with different ideas like this again automotive manufacturers right now you can start doing pairs trades and think about long domestic producers short. Non domestic producers there's even non domestic producers that are looking to build plants here or to begin manufacturing here picky backing off of existing plants to avoid the tariffs.",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "like this again automotive manufacturers right now you can start doing pairs trades and think about long domestic producers short. Non domestic producers there's even non domestic producers that are looking to build plants here or to begin manufacturing here picky backing off of existing plants to avoid the tariffs. So all of that means it really takes taking the time to do a pretty thorough analysis of the exact industry you're looking at to see how long does it take and what is the existing incentive structure there and does it make sense for them to reshore. But I think for a lot of these places there's actually probably going to be pretty steady pressure on reshoring and the other thing is how much reshore is a company have to do before they are exempt it's really about domestic production. So like again for automotive for example they can use parts from other countries but if the car is put together and actually built and produced here then that would be exempt. So it's also industry specific like most things unfortunately there's not a simple blanket answer for all of it. Bull says anyone you know of a community working to track details like China banned rare metals export to USA read on that but want to dig in and confirm hard to know it's accurate. Um I mean I don't know a ton of that myself I guess it would depend on I mean I would just do",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "working to track details like China banned rare metals export to USA read on that but want to dig in and confirm hard to know it's accurate. Um I mean I don't know a ton of that myself I guess it would depend on I mean I would just do general research personally I mean we could take a look at it if you want. We'll such as narrator this is when Eric started is objective news channel that's the last fucking thing I want to do in order to find objective information it takes such an obnoxious amount of effort you just want to like punch everybody in the face and be like just say what it is leave everything else out I don't give a fine fuck about your opinion I don't care about you I just want to know the information that you have access to that I don't. But maybe that could be a cool media company name like. Fuck me media or we'll think on it. Bull says supply chain disruption on tariff events and how they impacted local manufacturing ability to redesign redisaurus combat drop and sales volume due to price impact and current buyers seems to be mispriced in short term. It's again it's really hard I think to call it. Miss priced oh I like that one Lauren that's way better shut the fuck up media kind of like shut the fuck up Fridays but I mean that would be so sick",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "buyers seems to be mispriced in short term. It's again it's really hard I think to call it. Miss priced oh I like that one Lauren that's way better shut the fuck up media kind of like shut the fuck up Fridays but I mean that would be so sick if there was just. Just straight information trump did blank leave everything else out Pelosi did blank leave everything else out just say whatever it is because I mean the sensational side piece will always be there but. Again anytime I see stuff like this I don't blame the media I really don't I blame us us on the consumer side is exactly what causes all of this if we as consumers stopped watching Fox stopped watching CNN guess what they would have no views they would have no ad revenue they would have no business they would fucking die they would weather and die slow deaths but no because apparently especially if you are a. The older slightly older the middle age white man apparently Fox has some sort of kinetic force on you and all of a sudden you can't not watch it then it continues the cycle so yeah it's and I think it just requires such an amount of effort from the consumer standpoint and that's the quote that's one of my favorite things about financial markets I said that a few times but it is the absolute truth. The fact that markets care about money",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "so yeah it's and I think it just requires such an amount of effort from the consumer standpoint and that's the quote that's one of my favorite things about financial markets I said that a few times but it is the absolute truth. The fact that markets care about money what's moving and what's the impact that's always pretty nice. But yeah back to bulls I think that's also going to be really industry specific what you're highlighting but yeah I think the misprice in common is difficult I don't know how you I don't know how you price it how do you price it I definitely would be open to learning about it I mean I can think that I'm not going to be. I mean I can think of obviously a bunch of conceptual ways to price it but my broader point is to accurately price it is a straight crap shoot. Is that Benian or Ben Benian that's a hell of a name Benian what do you think of the VIX closing at 45 did not see that happens in 2020 should we expect way more downside not inherently so the cool part when VIX is here is that there's a ton of trades that you can. So I think that's what VIX is doing with VIX at these levels the VIX again doesn't tell us downside or upside the VIX tells us one key thing uncertainty that that's what VIX is uncertainty and right now this",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "is that there's a ton of trades that you can. So I think that's what VIX is doing with VIX at these levels the VIX again doesn't tell us downside or upside the VIX tells us one key thing uncertainty that that's what VIX is uncertainty and right now this is the funniest thing is last week. So I'm saying oh we just need the tariffs to come out so that we know what's going on and the argument that I made last week during multiple live streams is that when this shit comes out everybody's going to lose a fucking minds and then there might be a little bit of known in terms of the tariffs are turned on but now everybody's questioning a million other things how long are they on how. So what you're seeing here is exactly that you're seeing the market being hyper uncertain now there is one thing I'm pretty confident here if Trump came out with the tariffs and the tariffs came in more in line with general expectations across the board not a 10 tariff across everybody you wouldn't likely have seen this move it would have been very unlikely to see that move but the reason why you see this kind of massive run is because the tariff is going to be a lot of money. The tariffs came out heavier way heavier than expected so that led to the near term price dislocation that we talked about last week as",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "that move but the reason why you see this kind of massive run is because the tariff is going to be a lot of money. The tariffs came out heavier way heavier than expected so that led to the near term price dislocation that we talked about last week as that near term price dislocation is rapidly being priced in during a volatile environment you're going to see things expand right it's it's the rubber band thing and when things start to get super far out of whack like they were expectations positioning versus what happened that move gets magnified so I don't inherently think that there's going to be you know plummeting. Downside just because of this now again to give you Eric's opinion I do think there's likely more downside because the positioning for larger entities takes time as I've mentioned and the overall move has been pretty quick and severe but it would not surprise me if it's not done it's probably going to take a little bit more time take a look at the move on Friday it was a 3.6 standard deviation move. Huge absolutely huge standard deviation. Joseph says I heard from a financial professional impossible to price uncertainty yeah I actually think that's a really dumb statement to be honest with you like the stock market is really good typically at pricing uncertainty right like a lot of what the stock market does is price uncertainty and that's through things like volatility and",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "professional impossible to price uncertainty yeah I actually think that's a really dumb statement to be honest with you like the stock market is really good typically at pricing uncertainty right like a lot of what the stock market does is price uncertainty and that's through things like volatility and volatility we know that's a lot of the standard behaviors of volatility so I actually don't agree with that at all I think it's difficult to price uncertainty and I think you're not always going to get it right that's for sure but I think that the that the sentiment of you know not being able to price uncertainty honestly is just kind of silly the market does it all the time that's what the market that's one of the primary things that the market does do it's just that when there's a lot of uncertainty and then there's a dislocation it gets a ton of the price like the same thing you saw with all the airplane crashes which you know pray for me because I'm flying soon so hopefully we we have a successful series of flights but the main thing is we become hyper focused on these plane crashes and it leads everybody to believe that there's plane crashes happening all over the place all the time everybody's dying in these plane crashes and then if you actually look at the statistics is really not that bad still sucks and every single one of them really is",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "plane crashes and it leads everybody to believe that there's plane crashes happening all over the place all the time everybody's dying in these plane crashes and then if you actually look at the statistics is really not that bad still sucks and every single one of them really is a lot of the same thing that's going to happen. So it's terrible right you don't want to see it but it's still not really that severe given the number of flight hours that's occurring so it's kind of like the same thing is that yeah I don't I don't really buy the I don't really buy not being able to price uncertainty I think the market does actually really good job at it I just think when it's wrong is often during really high impact environments like we're seeing now probably a big part of it. So dark gents as another point of discussion is that even if reshoring happens assuming other the costs are fixed by virtue having more expensive labor in the US versus a third country then wouldn't margins just by default increase in earnings go down not inherently no not inherently it depends on the company and it depends on how they're structured it depends on what they do I absolutely would expect cost in general to go up but it doesn't inherently mean that margins have to contract in that revenue is going to go to shit. The reason for that is because there",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "company and it depends on how they're structured it depends on what they do I absolutely would expect cost in general to go up but it doesn't inherently mean that margins have to contract in that revenue is going to go to shit. The reason for that is because there are massive efficiencies gained when for example components are near production there there are efficiencies there and if the infrastructure is built successfully especially with all of the automation and what not that's coming that's one of the coolest things actually is that the amount of automation that's coming and how it can be powered by artificial intelligence it's likely going to lead into a many industrial revolution. And it's because yeah labor in China is cheap labor in China is so cheap that they have to put fucking nets around the buildings to prevent people from committing fucking suicide that's crazy so because of shit like that it's super cheap but even with it that cheap there with the just wild advancement of technology and production. It'll be even cheaper than that even for stuff that's produced domestically it just takes a little time to come online so yeah I think one of the things that you know with certainty is any sort of short term theme that's going on is there's definitely going to be a negative short term impact there's no avoiding that that is for sure but beyond the short term impact how it bears out",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "I think one of the things that you know with certainty is any sort of short term theme that's going on is there's definitely going to be a negative short term impact there's no avoiding that that is for sure but beyond the short term impact how it bears out in the moderate term that's a little more open. Open ended I think I have no idea how to say that name Joshua J no there's because there's no age Rodriguez so Hispanic. Oh, Zui how the fuck do you say that somebody phonetically hook me up here how do you say that. John. Oh. Oh, so. Oh, wait. Is it Jose or so. H hooked it up with the phonetics. Yeah, you just said your name again that didn't help me. Dark Jens says yeah that's true of production shifts towards more efficient centric focus more animation yeah and that's exactly what's going to happen. The other thing is I have to be honest with you the fact that people are sitting here freaking out about trying to and the disruption that it causes to move companies like Apple more to domestic production. I really lament the fact that Americans are so coddled they're so entitled and so sheltered that we prioritize being able to buy an iPhone for 2000 I don't even know what to cost 2000 dollars versus 35 hundred bucks and because we care so much about that we really fail to appreciate the human side",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "Americans are so coddled they're so entitled and so sheltered that we prioritize being able to buy an iPhone for 2000 I don't even know what to cost 2000 dollars versus 35 hundred bucks and because we care so much about that we really fail to appreciate the human side of this. And what again like the human element of what's going on there with the actual people building these fucking phones so. That's a complete opinion piece anyways. I'm just clearing out some of these tabs so I can see what the hell we're doing. James says I get that tariffs are causing big big spike but how much is Powell driving this isn't that a big big spike in August his. One of the things to remember is that again just just to remind everybody like discrete attachments is a fool's errand I really would get out of the habit of doing that immediately because like saying that this big spike is from tariffs and saying that the August spike is from Powell I don't think you can attribute it that way now I understand your point fully by the way that we're trying to. Assign at least a dominant. Cause and I think it's okay to do that but I just think it's very common for people to then habitually try and come up with the that you know news article headline on why this happened even what you're seeing now again like if it was the",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "a dominant. Cause and I think it's okay to do that but I just think it's very common for people to then habitually try and come up with the that you know news article headline on why this happened even what you're seeing now again like if it was the tariffs and it was just the tariffs then I would have expected to see more of the big spike on the third. Why did it happen on the fourth the tariffs were generally launched on the third we knew all the second so we knew on the third what it was. So there's a little more to it than that so it's just important to always remember that now again tariffs primary driver here completely agree now in terms of Powell I don't really see how Powell I would be interested in your perspective on how you tie Powell to this. In what way because I mean realistically Powell doesn't have a dog in this current fight with respect to what what tariffs are and the immediate fiscal response from the fed on tariffs I guess I should say policy response not fiscal response out right. So yeah I'm curious what the what the perspective is there because I think Powell is done so far literally exactly what I would expect him to I think when we look at the market movement right now it's not just the impact of tariffs I don't think I think that you're also seeing",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "what the what the perspective is there because I think Powell is done so far literally exactly what I would expect him to I think when we look at the market movement right now it's not just the impact of tariffs I don't think I think that you're also seeing a lot of people trying to discount. Into the future what this can turn into which we don't know and I think that's a big part of what's going on here. If you'll recall last week during a couple of the live streams I mentioned actually pretty carefully that we could see record amounts of money coming out of the market and moving into different money. So for funds just really short term cash and I told you exactly why that was happening that's one of those instances that there is a pretty clear reason is to what's happening and the reason was there was a lot of people that were unsure what was going to happen to what magnitude. So then they moved cash they moved to cash to wait and see because they there's no sense in being a hero there and taking on the risk and hoping shit works out so because of that kind of behavior I think a lot of what you're seeing here is also defensive positioning and the tariff side of stuff isn't I mean that's part of this equation we haven't even mentioned the word recession. I haven't even mentioned it yet",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "shit works out so because of that kind of behavior I think a lot of what you're seeing here is also defensive positioning and the tariff side of stuff isn't I mean that's part of this equation we haven't even mentioned the word recession. I haven't even mentioned it yet but that is another thing that is looming the current rate environment is still a thing the current inflation coming into this still a thing. So there is a lot going on in addition to just the tariffs that really exacerbates in compounds a lot of the broader dialogue that we're looking at here it becomes really really difficult to successfully price this and then to position appropriately now a lot of people have been talking about like is this the next loss decade and stuff like that to which on my opinion on that is I just don't see it and it's because the amount of technology that's going to be launching and especially if there's a really strong driver for faster adoption I think that starts to become incredibly powerful so so yeah anyways James the synopsis of all that is I don't think that you can directly attribute any of this to any one thing especially Powell I think Powell is part of this but Powell has been one of if not the most consistent in messaging that I could think of to be honest it has been he's been so consistent in his messaging which is",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "attribute any of this to any one thing especially Powell I think Powell is part of this but Powell has been one of if not the most consistent in messaging that I could think of to be honest it has been he's been so consistent in his messaging which is absolutely worth noting because that helps the market tremendously because again the market does struggle when things are uncertain but right now we can see elements of what called certainty but we can absolutely see elements of just consistency and his policy coming through so I got to pop the door for Thor and grab another cell to repair back you you you you you had a grab couple apple slices defense instinct says you think it's possible to get a black Monday I wouldn't call that problem could it happen yeah I think that's what I consider that probably not so much I think when we look at like that kind of broad move and like what the driver was for it I think so much of the information is already being baked in a lot of the positioning is done not all of it and there's going to be like this right take a look at consumer discretionary let's take a look at d hi for example why why were they up Friday the rest of the market was down like 6 yet here these guys are up for in a half why happen well let's take a",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "be like this right take a look at consumer discretionary let's take a look at d hi for example why why were they up Friday the rest of the market was down like 6 yet here these guys are up for in a half why happen well let's take a look I'm actually curious what these guys say the airlines definitely are going to struggle the thing to remember about airlines is that they're pretty pretty narrow margins naturally I don't even see where d hi was mentioned I'm actually kind of interesting here what is going on here give me a second the interesting thing here is I don't know it's got to be something with their supply chain I'm just not sure what element thores at the door it's close to his dinner time so he thought I was feeding him but I wasn't so terrified exemptions on Canadian and Mexican lumber that's it makes sense and then obviously the yield side of the equation but that again you can typically tell that there's generally a reason right so in this case the reasons actually pretty easy to see obviously has to do with the not additional tariffs going on lumber and whatnot dark Jen says with the rapid increase of VIX suggests that the market was not sufficiently hedge the rapid downside perhaps could lead to margin calls coming Monday but I don't have sufficient knowledge I think I think a few things related to that it's",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "going on lumber and whatnot dark Jen says with the rapid increase of VIX suggests that the market was not sufficiently hedge the rapid downside perhaps could lead to margin calls coming Monday but I don't have sufficient knowledge I think I think a few things related to that it's really difficult to say like what is sufficiently hedged right but because there was so much lead in coming to this again I already talked about the ETF flows and the massive outflows that we saw just across the board so I mean could we argue that there was some sort of change in terms of total investment picture yeah definitely I think that that's pretty fair the at least costually but one of the things that causes really broad market friction is when like for example margin calls might happen but if they're occurring across the board and there's a lot of them and they're all coalescing together right like that's where it becomes really difficult but I think that's really good really difficult but there wasn't really a massive surprise here in the sense of like the market knew something was coming up the market knew and they we obviously didn't know what it was going to look like and how bad it was going to be in that kind of stuff but it's not like everybody went into that just you know hoping everything was okay I mean if you did that's just probably a retail trader",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "we obviously didn't know what it was going to look like and how bad it was going to be in that kind of stuff but it's not like everybody went into that just you know hoping everything was okay I mean if you did that's just probably a retail trader mistake because going into the event I had long straddles just playing the volatility and then I also you all have seen the coverage strangle allocations that I've had coming into this it's been 30 or less of an equity position in them and it's again for this exact kind of shit. So I think a lot of the market probably had a idea that something was going on now this does lead to an interesting question though that we can speculate which is if we take a look let's take a look at options behavior leading into the second and we can answer this actually a little bit. So here's the second let's look at the prior week so we'll do March 24th and we'll go into now I don't want to go into the second so why would I click it again you idiot I was about to click it a third time and let's see. So this is looking at the VIX and then we'll take a look at SP or spy probably after this versus SPS let's see. But that's like dead center don't know. It's also like dead center don't know. This is closer to",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "click it a third time and let's see. So this is looking at the VIX and then we'll take a look at SP or spy probably after this versus SPS let's see. But that's like dead center don't know. It's also like dead center don't know. This is closer to the offer so this is probably buying. Pretty close to the center tough to tell but this is probably. Fine. Interesting let's take a look first I guess at a broad. At a broad angle. So here's the second. Yeah I mean the options activity you can definitely see. An element of call buying but it's really not that strong you can definitely see the call buying pick up here leading into the second so the market definitely was picking up on elements of that. That's a pretty big change. But this is just looking at an individual company let's take a look at VIX now. And let's see what VIX was seeing. Yeah. Mark had an idea. Sneaky suspicion. Take a look at that. Huge. Absolutely huge. The let's go back further I'm actually curious when the when even the closest reference day might have been. Yeah man. Literally for the last month. There is nothing even close take a look at the VIX activity these are just buying calls these are people expecting a spike. With certainty so I actually would think that the market seemed to be pretty well positioned for it. I would say that. Man'scape",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "for the last month. There is nothing even close take a look at the VIX activity these are just buying calls these are people expecting a spike. With certainty so I actually would think that the market seemed to be pretty well positioned for it. I would say that. Man'scape says is black money even possible with circuit breakers well. No not the same move at all but I mean the what is it 20 down that's still pretty significant. And when the market is lock limit like that a lot of times the future still trade so you'll actually see a lot of a lot of that. So yeah I mean I it wouldn't look the same that's for sure but again the other thing remembers just the conditions of black Monday they were obviously just enormously unique. Compared to what we've seen now always reminds you that the worst days are ahead of us. It's just important to have that mindset you don't have the mindset of the worst days are ahead of you then you step into a pretty precarious position worth avoiding I would say. I'm making sure I'm all caught up on the chat it is. Rootabagas says VIX should drop relatively quickly right puts our crazy expensive not inherently so VIX can cluster and that's one of the key properties of VIX is that it does cluster now how long it clusters is another question but for example. Let's go back I have to",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "is. Rootabagas says VIX should drop relatively quickly right puts our crazy expensive not inherently so VIX can cluster and that's one of the key properties of VIX is that it does cluster now how long it clusters is another question but for example. Let's go back I have to open this up a bit more let's do this be enough. Just enough let's go a little further. So let's just do some eyeball in here so periods where VIX touched above 25 here that was nine days two days. Two. Six days. And then we need to go back. Back in time yeah where's the year mark that would be really nice to see. I mean I guess I can deduce pretty sure this is 2020. So let's see look at 25. Across above 25 here. And it didn't go below it until and here really let's call it here. So that's 163 days. So the point is VIX can remain elevated it is entirely dependent on the actual market condition and what's going on but one of the things to remember is that volatility does cluster and when it clusters that means it can stay in a specific range again typically for a list of reasons a lot of it. Has to do with expanding uncertainty so yeah. Lauren says what do you think about Jamie going up 11 yeah stick like it game stop now. So I think it's a lot of time to go back and",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "range again typically for a list of reasons a lot of it. Has to do with expanding uncertainty so yeah. Lauren says what do you think about Jamie going up 11 yeah stick like it game stop now. So I think it's a lot of time to go back and see what's going on here. So for game stop it had obviously a really interesting move and it looked to be for a few reason. So first thing. And again you guys probably know some of these reasons better than me to be honest. That's oh in I'm trying to find the thing we know that Cohen box shares. Ryan Cohen. Which is important by the way. Here. So interesting. There's new news on this. So it looks like he moved 22.3 million shares into a Schwab account. Interesting. So a really funny comment that I've seen people saying in different ways because. Buffet sitting on 300 million is like as a percentage of really small amount. People are making it like oh this is why it all makes sense. Buffet is so pressient because he's been sitting on so much cash because you knew something bad was going to happen. This is not the smurching Buffet at all he's super smart. And he's sitting on so much fucking cash is that he has a hard time using it. He's talked about that. And if you look at like it's not like Buffet was sitting in 40 cash in Berkshire",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "happen. This is not the smurching Buffet at all he's super smart. And he's sitting on so much fucking cash is that he has a hard time using it. He's talked about that. And if you look at like it's not like Buffet was sitting in 40 cash in Berkshire is still a small amount of cash relative to the total size of Berkshire. So. People this is this is an artifact of people's simple brain and it's that they see a big number. And I'm not saying Ryan Cohen is simple he's doing this just kind of you know doing his standard bit. But I've seen other people saying this that's why I'm talking about it. We see 300 billion and everybody thinks like oh my god like that's just an insane amount of money to be holding in cash. But as soon as you put it into context of like the size of the portfolio really isn't much. So and let me not leave you without at least an answer there so Berkshire. Path away current value. Um. Well I guess I'll just do the math. I just got three different answers which made me mad. Wait what are his current holdings actually. All right holdings because I know he unwound some of his apple. Apple position. Let's see. So first things first this is saying that he's sitting on 267 trillion dollars. And we're saying he is 300 billion. So let's see. Let's see where we're at",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "are his current holdings actually. All right holdings because I know he unwound some of his apple. Apple position. Let's see. So first things first this is saying that he's sitting on 267 trillion dollars. And we're saying he is 300 billion. So let's see. Let's see where we're at so that's 300 million. What's your guess. What's what's the percentage of cash that he has right now. Any guesses big numbers big numbers are kind of fun to guess in this way. This is saying 267 trillion dollars. I'm sorry 267 billion what am I saying. Hold on I am super confused. I just got myself all in a tizzy. Is this now doesn't make sense. I can way more cash than I thought. Hold up. So this is saying 260. Hold on. Let's now we do it to fact check this because this got me fucked up. So the holdings is of 31d24 which I think is a little too late. Okay so the Berkshire market capitalization. Is 1.064 trillion. This seemed way too small. What is this portfolio currently worth. I'm using another website. This is 267 billion as well. I'm so confused. This says 255 billion. 255 billion on 334 billion. And then one trillion is the market cap. This is just his basis. What is this much money is this fucking guy have. How much money you got. Let's see what this says. Although Berkshire's stockway stock away. What is this. What is the total",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "255 billion on 334 billion. And then one trillion is the market cap. This is just his basis. What is this much money is this fucking guy have. How much money you got. Let's see what this says. Although Berkshire's stockway stock away. What is this. What is the total market cap. Total value. 1.07 trillion. Yo I'm getting fucking grumpy with these. I definitely think it's over trillion dollars. I know it's not just hundreds of billions. And this is 334. Do. Let's just do it on this really quick out of curiosity. Yeah 31 31 cash. So using the 1.06 trillion from here. That shows him 30 cash. So if you think about that even in context, right? Like 30 cash is heavy for a fund. But it's not like he's sitting again like I said, like 40 plus and cash. 40 is when you're really like guarding money that objectively. When you're looking at a fund this size that's trying to put on positions. Because again, take a look at the size of the positions. This is the difficulty and I've mentioned this before. Here we literally have a 5.2 billion dollar position in DVA. And it's 2.1. It's difficult enough to find the liquidity to put on a 5.2 billion dollar position. And it's only making up 2.1 of the portfolio. That's a bit challenging. So that's one of the main reasons why you'll see. I mean, the first thing that I've seen is the fact",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "2.1. It's difficult enough to find the liquidity to put on a 5.2 billion dollar position. And it's only making up 2.1 of the portfolio. That's a bit challenging. So that's one of the main reasons why you'll see. I mean, the first thing that I've seen is the fact that you see here. I think that the fact that you see here is the fact that Cohen had bought in. The other thing that was going on here is that there was more news about Trump's discussing of Bitcoin. And his use of it. This is going back a little ways. And Friday was actually one of the first periods that we saw. Bitcoin serving as an alternative asset for the broader market. So if we take a look at Bitcoin, which now. GameStop is discussed building a position. And so now that's relevant. So you can see Bitcoin actually had a little bit of a positive day on Friday. When the rest of the stuff was going down pretty heavy. And again, it's showing a slightly different behavior and relationship. So when I look at GameStop, it's still in this really, really, really. Broad decline. And this is the first sign that we've really gotten. About approaching a potential bottom. The fact that we had a low posted here, a low posted here. And then it's kind of still rallying sideways against this 20. And a half handle. So the pricing of GameStop right now is actually not",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "the first sign that we've really gotten. About approaching a potential bottom. The fact that we had a low posted here, a low posted here. And then it's kind of still rallying sideways against this 20. And a half handle. So the pricing of GameStop right now is actually not too bad. I don't think now funny enough. This is another ticker that I might do the thing that I was explaining to you all. On yesterday. I think it was yesterday we're talking about it, which is moving between equity and option position. Because right now I have 41 invested for the coverage triangle in GameStop at a basis of 2575. So the open PNL on that is not bad. What is that 900 loss with GameStop at 2349? Yep. So it's about a 900 loss that's sitting on the open stock. Let me show you the existing position so that you can follow along with me. Here. Maybe it's easier for just. There we go. So right now this is what the GameStop position looks like. We're short three of the 26 strikes in 16 May. We have two short calls at the 29 and 16 May. And we have this 400 shares at 2575. So right now there's a thing that I'm looking at doing, which allows me to take the shares off and move back into a short put position. And again to recap what that looks like, I will show you here because it's actually",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "we have this 400 shares at 2575. So right now there's a thing that I'm looking at doing, which allows me to take the shares off and move back into a short put position. And again to recap what that looks like, I will show you here because it's actually kind of an important maneuver for me. It's one of the primary ways that I can navigate changing markets like this. And then we have the current price here. And then we can reflect the current P and L here. 905 bucks. And the other thing that we care about. And then we have the current value of the position is. Which is now. 93 96. So here's likely what I will end up doing. It kind of depends again. And the reason why I haven't done it yet is because again, I'll be moving around a little bit. So I'm not going to be on top of the market. Quite as much. And but what I will do is I'm going to move this out of the way for now. And I'm going to look for opportunities to probably move it back into an options position. So using around 93 96. And then we have a lot of options. And then we have a lot of options. Here, it will look something like this. So we have expiration. We have strike. We have premium. We have lot size. So let's take a look at the 16 May. Strike will",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "93 96. And then we have a lot of options. And then we have a lot of options. Here, it will look something like this. So we have expiration. We have strike. We have premium. We have lot size. So let's take a look at the 16 May. Strike will start with something like the 22. Maybe the 23. 5 ish. And let's take a look at like a four lot. And I'll show you what's going on here. This will be cost. And then cash secured amount. This would be premium. So what we do is we have. This premium times the lot size times one. And we're going to make 980 bucks here. And the total to cash secure this position. Equals. And the price times lots. Times 100. 92 hundred bucks. So this becomes a bit of a no brainer for me. So effectively what I would do is this. If I sell to close these shares. At a loss. I would take it down and I would book a 905 losing position. And then I would go out to the 16 May 23 strike. I get 2.45. I do a four lot. The total premium utilized here now is 900. I'm going to get 980 bucks, which covers the cost of this loss. And then the overall position is now going to be an improved basis of 23. That's if I'm assigned. If I'm not assigned, then I just keep this premium. Now I have two",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "here now is 900. I'm going to get 980 bucks, which covers the cost of this loss. And then the overall position is now going to be an improved basis of 23. That's if I'm assigned. If I'm not assigned, then I just keep this premium. Now I have two different courses of action I can follow. The first one is either just simply rebuy the stock. I generally will set an alert to do that. The second thing is just by calls. Now the whole purpose for this maneuver is because when you buy shares, your basis is fixed. It is what it is. But when you're in options, I can do things like roll the short puts. So that if GameStop does unfortunately continue some sort of downward move. I have places I can go. I have things I can do. Whereas if your basis is 25.75 and GameStop goes to 20. Well, your basis is just 25.75. And keep up is at 20. There's just nothing going on there. So this here is actually a pretty useful maneuver. The other thing that you'll notice is that it actually reduces my total risk. Because even right now losing 905, the value of the position is 9400. I'm only going to use 9200. So it's not that much, right? But it's a 200 difference. So I would have 200 less in this position than I would otherwise. Which again can be used to buy shares if I just want",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "905, the value of the position is 9400. I'm only going to use 9200. So it's not that much, right? But it's a 200 difference. So I would have 200 less in this position than I would otherwise. Which again can be used to buy shares if I just want to get into it as it's starting to move. So there's actually two tickers that I'm looking at doing this in right now. One of them is this and one of them is I bet. And it's again just for the for the broader moves that I've seen there as well. So that's kind of the latest with with GameStop. At least with respect to the position with respect to the stock. I haven't seen a ton of movement. It's obviously still digesting the Bitcoin news, which I think my honest opinion is I think the Bitcoin news is more of I don't want to call it like a visual act. It seems a little bit more for branding and publicity in my opinion than something that will meaningfully enhance the business. Yeah, I mean, it's not bad. I don't think it's bad for it to hold some Bitcoin. But the thing I will continue to remind people in general is it's a company. It needs to have revenue. Bitcoin is not revenue. Bitcoin can appreciate Bitcoin can also depreciate. So I'm bullish in Bitcoin, by the way. So I don't think it's a bad add to the balance sheet.",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "the thing I will continue to remind people in general is it's a company. It needs to have revenue. Bitcoin is not revenue. Bitcoin can appreciate Bitcoin can also depreciate. So I'm bullish in Bitcoin, by the way. So I don't think it's a bad add to the balance sheet. But I do think that we still need to see the company pivot. And it's actually starting not to concern me, but I am starting to look at this as. When are we going to do this pivot? Because right now they're showing small things along the way, but nothing that I would consider too massive. Let's see what we got. I tend to agree about Bitcoin would love to see investments in based on their filings. I thought RC wanted to function as holding. What do you make of volumes in GameStop? Well, I think the volumes in GameStop have to do with first earnings. And then I think the announcement. About the debt offering impacts it. I also think Cohen's purchase obviously impacts it. So I think it's a few things that you'll see driving the movement in GameStop broadly and then also the volume. So I think the problem with GameStop is a holding company. I struggle to see that angle because if GameStop, again, like in my opinion, if GameStop was going to be a holding company, I don't know why they would not just unwind the physical locations then just close them. They're closing the",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "the problem with GameStop is a holding company. I struggle to see that angle because if GameStop, again, like in my opinion, if GameStop was going to be a holding company, I don't know why they would not just unwind the physical locations then just close them. They're closing the unprofitable ones. But if that's the ultimate angle that they're going to go and do a spin off, the other thing is I don't know why you would do it with GameStop outright. Maybe it's easier for a logistical reason. But to me, there would be nothing wrong with, again, Google and alphabet, building a parent company that holds GameStop, let GameStop continue to be what GameStop is. It has good branding, good brand loyalty, good consumer side. And then if you want it to be a broader holding company that sits over it that's born essentially out of it, then you could do that. But I don't see the actual benefit here in like turning GameStop into a holding company because it still is a brick and mortar institution. And while it is that, and it does have obviously an online presence, but being a brick and mortar institution has its own whole list of things. This is the same thing with Berkshire. Berkshire is a great example. Berkshire owns a bunch of companies and it has controlling stakes in a lot of companies. But the individual companies are still the companies, not like progressive or one of the",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "has its own whole list of things. This is the same thing with Berkshire. Berkshire is a great example. Berkshire owns a bunch of companies and it has controlling stakes in a lot of companies. But the individual companies are still the companies, not like progressive or one of the other insurance companies that Berkshire owns turned into Berkshire. So I think that path is a little interesting. Although admittedly, there are very clear hints of it. People have sent comparisons between what is it the investor relations website between Berkshire and GameStop and there's a change there. So I do think that they're hinting towards there could be some version of that. But in my mind, that would look more as launching a parent company that then GameStop would be a component of versus turning GameStop into the holding company itself. It's my broader guess. Dartshen, what are your thoughts on Soxel? Do you mind taking a quick look? Seems like once in a lifetime dip. I don't think it's a once in a lifetime dip. And stuff like this can go down and it can continue going down. And I actually think this is probably in one of the more like really one of the more difficult areas. Meaning industries. Because if you think about again, reshoring cost building chips is super expensive and it requires super tight tolerances yada yada yada. So I actually think this is a harder industry to make that move more quickly. So",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "the more like really one of the more difficult areas. Meaning industries. Because if you think about again, reshoring cost building chips is super expensive and it requires super tight tolerances yada yada yada. So I actually think this is a harder industry to make that move more quickly. So I think that it's very likely that you'll see these struggle for longer. That doesn't mean that it's going to stay down at eight and that doesn't mean that I can't triple quadruple quintiple and go up into the 40s 45s. Like it definitely could do that in a moderate term potentially. But here's the broader problem. It never even got back to all time highs following the massive spike from 2020. It peaked out here and it hasn't gotten back. So this is the problem with three times leverage and this is also why when you see me trading things like T triple cues. I have a very specific approach that heavily relies on the ability again to move in and out of the equity position. And it's because you can get moves like this where it just recently recaptured highs. So for a comparison just to give you some context. If you look at QQ and you look at T use and let's zoom these out. Let's do five year weekly in both. What do you notice difference here? Difference is QQ, smashed. It absolutely smashed. Now the difference between these and this is a common issue that",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "some context. If you look at QQ and you look at T use and let's zoom these out. Let's do five year weekly in both. What do you notice difference here? Difference is QQ, smashed. It absolutely smashed. Now the difference between these and this is a common issue that a lot of traders make is they make the high to high comparison. They'll say, oh, QQ, essentially posted new highs back here in January of 24. If we take a look at January of 24 here. It's not even. It's about halfway. It made it about halfway back. But the difference is is that and this is why having a mobile basis is so important because yeah, if you top ticked it and just held you are essentially getting chewed up here. If you didn't top tick it and hold or if you did top ticket and you have like I do a specific momentum following approach that naturally start scaling you out in your highs like this. And as it's rotating down, you start nibbling on the way down, you use short puts. Then you start rolling the short puts to get as good of a basis as you can before finally choosing to take assignment. Then all of a sudden rather than your basis being up here at 91, your basis might be down here at like 38. So then even when this makes the substandard recapture of the drop, you're still out essentially at the same",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "you can before finally choosing to take assignment. Then all of a sudden rather than your basis being up here at 91, your basis might be down here at like 38. So then even when this makes the substandard recapture of the drop, you're still out essentially at the same time. So the way you trade it matters a lot that can be extended to something like S O X L. But I think S O X L in general is going to be in a really challenging environment because of the industry writ large. So I wonder GME time horizon for that type of visit I guess that's the measure. Well, and it's also whether or not that is the pivot right for GameStop. We we actually don't know if that's the angle we think it's going to go based on you know us generally guessing. But we really don't ultimately know if that's the the route that they're going to take. It's just picking up little clues here and there and making educated guesses. So it's very much TBD. All right, gang, I got to go pack good hanging out. If you need anything, you can always drop in the discord even if I'm not going to be as around as I typically would be. There's plenty of people in there that are happy to help however they can and plenty of folks that have been around for a while. So they can pick it up. Be an",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  },
  {
    "text": "in the discord even if I'm not going to be as around as I typically would be. There's plenty of people in there that are happy to help however they can and plenty of folks that have been around for a while. So they can pick it up. Be an outlier. Don't let the market get you pay attention out there. See you guys later.",
    "metadata": {
      "video_id": "qO34tGS8e3o",
      "title": "Market Recap & GameStop Update | Outlier Options Trading",
      "url": "https://www.youtube.com/watch?v=qO34tGS8e3o",
      "upload_date": "",
      "duration": 5606.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 57,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qO34tGS8e3o&t=0"
    }
  }
]