[
  {
    "text": "What's up everyone? How is everybody doing out there? What's going on to the outliers? We have another options trading for beginners segment on the docket for today. So the goal for this session I have for us right now is to take a much closer look at the end-to-end process of building a trade. So excuse me, we got a bunch of Celterwater. Right now we're doing, what is this one? Strawberry watermelon, this one's pretty good. I like this one. I guess I'm just on a watermelon vibe because my backup one is just regular watermelon. We go through Celterwater here pretty much perpetually. Tons of it. As for always, I'd say hello to who we have. Hang in out. I see Jim, Paulo, Jay, and Elon's songs great to see all of you. And let's do a quick overview of what this is going to look like. So so far with this entire options trading segment for beginners, we've gone through a lot of different things. And I want to talk about the broad context first. We're not going through this whole deck, but I just want to talk to you about a couple of pieces. So here's the deal. There's a bunch of things that go into trading options. First, we need to understand the economy to a degree, the stock market. We need to understand how options behave, the fundamentals behind options. And then we have to start getting to a point where we're pulling",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "here's the deal. There's a bunch of things that go into trading options. First, we need to understand the economy to a degree, the stock market. We need to understand how options behave, the fundamentals behind options. And then we have to start getting to a point where we're pulling together this information into a comprehensive, I guess deployment of them. You have to pull a lot of things together to make this whole thing work. So the goal behind this is to spend a little bit of time going through what that looks like, what the actual process is to come up with an idea and then to start trading it. Because over the course of a trading career, it very infrequently, some people they do hit these one-off wonders that change their entire lives straight from the jump. And then that's essentially what they're using for their primary wealth going forward, meaning essentially hitting the trading lottery is what that's equivalent to. But for most of us, it's not like that. Most of us, it is a long process. And for some of us, at least like me, I want it to be a long process. Not so much I'd love to have, you know, dozens of millions of dollars right now. That would be pretty sick. But I think I also enjoy markets in the process of trading. It's very engaging and it's one of the coolest ways, genuinely, that I have found to learn about the",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "much I'd love to have, you know, dozens of millions of dollars right now. That would be pretty sick. But I think I also enjoy markets in the process of trading. It's very engaging and it's one of the coolest ways, genuinely, that I have found to learn about the world around us. So that is in a nutshell what I want to spend most of our time on today is working through this broader context of how to essentially build a trading plan and how we can find ideas, build strategies. So taking a quick step back from that, though, with all of the stuff that we've talked about so far, there's been a lot of details. So I do want to offer an opportunity if there are any specific questions or if there's any specific topics that we've covered up to this point that you want to talk about. And I am happy to start there, do a quick catch up. And it looks like we had a couple more people hopping in. I see doku doku doki. That's a fun name. Pat Hader, Jim Reese, Ruta Bega, Bean Gaming, that's a fun one. Pat says not to be that guy, but saw RKDFV type options by 719 Siri. We could do that towards the end. Yeah, I have no problem taking a peek at that. But I want to keep the beginning session a little more focused on the fundamentals. I also think it's really difficult to",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "be that guy, but saw RKDFV type options by 719 Siri. We could do that towards the end. Yeah, I have no problem taking a peek at that. But I want to keep the beginning session a little more focused on the fundamentals. I also think it's really difficult to actually identify like the RK, which is Roryn Kitty for those that don't know, like his buying habits, right? So it could be him. It could not be him. I haven't looked at Siri at all. I have no idea at this point. I looked at it last weekend. But happy to either take a look at it later today and see what we can maybe piece together. Ben Waz here, fly high and enjoy. That's a fun one. And then Jaden, sweet. All right. So I'm not seeing a bunch of catch up questions. So I think that that means that we can get more into, oh, there we go. Reese, perfect timing. Daniel, good to see you as well. Reese says how important is margin? It's a great question. And in terms of importance, margin is what I would consider to be a force multiplier. So Reese, what you're talking about there, there's two different things. There's trading with margin trading on margin. However you want to phrase it, there's kind of different utilization of margin. And options utilize a specific type where we're not actually borrowing money. So let's take a look at an example. If we",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "you're talking about there, there's two different things. There's trading with margin trading on margin. However you want to phrase it, there's kind of different utilization of margin. And options utilize a specific type where we're not actually borrowing money. So let's take a look at an example. If we take a look, maybe at spy. And we take a look at the options in spy. Here is a nutshell of trading with margin. If I want to open and let's say I want to sell a put, it's a cash secured put. So if you don't remember, a cash secured put is where you sell a put option. And you're putting up the capital to cover the options position. So in this case, that means that you would have to buy 100 shares of spy at 5.52. So if you're to cash secure the position, it's 55,200. That's if you want to essentially cash secure the position. Now, if I go to actually put this trade on, and again, this is in a pass through account for me. So I don't have any positions on in here. But I think this one is standard margin. If I'm not mistaken, we'll see. If we sell a put, let's see what this asks of me. Just this. Yeah, so this is for this is a pass through retirement account. So the margin required here essentially is full margin. It wants. So this isn't this isn't using really any leverage at all.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "we'll see. If we sell a put, let's see what this asks of me. Just this. Yeah, so this is for this is a pass through retirement account. So the margin required here essentially is full margin. It wants. So this isn't this isn't using really any leverage at all. That's like an example of a cash secure put. Now if we go on on demand really fast, and we look at spy, yeah, this is a great example. Let me get me out of the way. I'll go top right. And if you take a look at the margin required for this trade now, that we are outside of a retirement account, which requires essentially posting the full trading capital for the position in that example, you'll notice that the margin requirement for the position is only 16,800. So what that means is the broker is saying this position, it knows what this position is worth in its entirety. The broker knows the reason why it's moving, by the way, is because this is on demand. I don't want you guys thinking something squirrely is going on after hours. It's not. But so what this is saying is in this example now, the broker requires 17,300. So even though this position is controlling 55,000 of spy, the broker is only asking for 17,300. So you're not actually borrowing any money from the broker, and you very well might have the 55,000 to cash secure this position. But in this",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "this example now, the broker requires 17,300. So even though this position is controlling 55,000 of spy, the broker is only asking for 17,300. So you're not actually borrowing any money from the broker, and you very well might have the 55,000 to cash secure this position. But in this world of trading options, you're not borrowing money. Your broker is just not requiring you to set aside the maximum value of a position. They're asking for what we would call a margin requirement, which is just a smaller subset of the total value of that position. And once that's satisfied, then the broker is chill. They have what they need to cover their risk. It's important to know that margin moves. So as the market goes up and goes down, as the broker perceives their risk moving, your margin requirement will also change. It's not a static figure. So margin is important for a few reasons. It's the primary modality that leverage is afforded to you in options. So let's give another example not using puts now. And let's take a look at calls. So in this example, if I wanted to buy these calls here, the 551, I just picked a random one. Right now, these are at a 70. So if you'll remember, every single options contract moves in 100 share lots. So this is a one lot, and it comprises up to 100 shares. Essentially, with this being a 70 delta, that means that this position",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "just picked a random one. Right now, these are at a 70. So if you'll remember, every single options contract moves in 100 share lots. So this is a one lot, and it comprises up to 100 shares. Essentially, with this being a 70 delta, that means that this position currently is behaving similarly to 70 shares of spy. So if we were to buy 70 shares at, let's just use the strike price for example, which in this case is 551 times 70, 38,570. That's what it would cost. If you were to buy the share equivalent of this position, you have to put up 38,570. However, if you were to buy the option, it costs 1,531. So again, you're not borrowing money here, but this is the leverage afforded to you through options. So there's a difference to recap between trading on margin or trading with margin. When you are on margin, you are borrowing money actively, and you have to pay a rate to borrow the money. If you're trading with margin, which all options positions do, in that instance, you're essentially benefiting from the leverage provided to you, but you're not actually borrowing any money. Reese says if you don't have cash in your account, can you specify you want to sell a cash secured put and unmargin and not cash secured? If you do have the cash, it's a great question. So Reese, the follow up to your question and for anybody else wondering what",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "says if you don't have cash in your account, can you specify you want to sell a cash secured put and unmargin and not cash secured? If you do have the cash, it's a great question. So Reese, the follow up to your question and for anybody else wondering what we're talking about now, Reese is asking, can you tell your broker if you want to sell your cash secured put on margin and not cash secured? The broker is going to default to unmargin. So if I have a marginable account, again, this is a pass through IRA, so it automatically requires full cash secured. So if I go into on demand and we look at this position, what day are we? I'm actually just curious what this is. Oh, this is looking at the first of July this month. Cool. I don't know why I find that cool, but I do. So if we're to look at this fake trade, the, let me, might still out of the way. Yeah, okay, I'm still top right good. So if we're a little look at this fake trade, margin requirement to put this trade on is 15,477. That's the default. So if you have a marginable account, the broker, depending on the permissions you have, I should clarify because there's different levels of options permissions. So if you have like the highest tier, I honestly don't even know what they go up to anymore or what those actually look like.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "So if you have a marginable account, the broker, depending on the permissions you have, I should clarify because there's different levels of options permissions. So if you have like the highest tier, I honestly don't even know what they go up to anymore or what those actually look like. And I just realized this is like now. One second. I just realized this thing like totally cut my head off. There we go. There we go. I think we're getting back at it, team. I think we're getting back at it. All right. How did the back of the computer look like, by the way? I had to like reroute the cable really fast. Back to the question though, the broker will automatically essentially just use the margin requirement for the position. They do not care if you want to cash secure it. You would have to notify them yourself that you want to cash secure the position. That's essentially how it would work. So the beautiful part about that is the broker is automatically giving you the benefit of the doubt. The negative side to that is then you have to have good accounting. If you're looking to track cash secured positions versus non, the broker doesn't do that for you automatically. So Reese, let me know if that answers your question. Ruta Bega says, how do you tell if an option is currently cheaper, expensive to buy? That's another great question. So for this one, there's a",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "track cash secured positions versus non, the broker doesn't do that for you automatically. So Reese, let me know if that answers your question. Ruta Bega says, how do you tell if an option is currently cheaper, expensive to buy? That's another great question. So for this one, there's a couple different assessments you can use in terms of determining if an option is cheaper, expensive. There's one primary input we care about, which is volatility. So there's a couple of things you can do to look at that. So let's take a look at, let's find a random stock, something that we don't know much about. I'm just going to go into the scan and pick something. Walmart. Most of us know about Walmart. I don't really know what's going on in here. We'll get a sense of it. And let me zoom us out to like a six-month daily something like that. And Reese says, thanks so much, Margin. Sounded like running up a credit card and as a fellow poor kid, always seemed like a trap to me. It's actually hilarious, you say that because I always struggled massively with the concept of borrowing money from a broker to put on more trades. Like that kind of leverage terrified me. So I essentially would very rarely, very rarely use Margin. It's, I totally identify with you. Rude of Aiga back to your question. So let's figure out if these options are expensive or not. What do you",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "broker to put on more trades. Like that kind of leverage terrified me. So I essentially would very rarely, very rarely use Margin. It's, I totally identify with you. Rude of Aiga back to your question. So let's figure out if these options are expensive or not. What do you guys think the first thing I'm going to look at now on the platform? You guys have any ideas? There's a couple things that I will look for. And the goal is to figure out how expensive these options are. So what can we do to figure that out? We can start with a broad assessment, which is what we're going to start with. And then we can get more into specifics. Pat says, oh, I, it's a great idea, but that's not correct. Oh, I, which is an option's open interest, that's not actually going to tell us if something is expensive or not. Benoit and Reese are on it as well as Eddie, both, both of those groups are on it. So you guys are right on top of it. Peter says implied volatility, which is good. What a hell of a name. I am now the biggest fan of this new name, which is overmoicin't meat loaf. It's fantastic. Is the golden shower crossover? No, that, you know, I tell you what, that sounds like a hell of a crossover though, but that sounds also like a crossover between trading and some other endeavors. But no, it's",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "fan of this new name, which is overmoicin't meat loaf. It's fantastic. Is the golden shower crossover? No, that, you know, I tell you what, that sounds like a hell of a crossover though, but that sounds also like a crossover between trading and some other endeavors. But no, it's not that either. So we have a couple ideas stemming from implied volatility, which is perfect. Benoit is on it. Reese is on it. Eddie is on it. Those are all correct answers. So Reese is saying versus HV, I would delete that part Reese because that doesn't help you. The first answer of IV is much closer to being correct. So let's take a look at it. If we go back to our options pricing model, I started building this like deck for you guys, which is funny because I never use slides. I don't like them very much, especially for my time as a consultant with Deloitte. I don't really like to spend a lot of time in them, but this thing is starting to become a bear. I'm using it to kind of have all of the stuff we need in one single spot. So anyways, if we go back somewhere in here, we have pricing models. Here. So when we look at an option pricing model and let me maybe make this bold, maybe underlines what's a little easier to see. There's a very important input, which you could tell I have highlighted, which is volatility",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "we go back somewhere in here, we have pricing models. Here. So when we look at an option pricing model and let me maybe make this bold, maybe underlines what's a little easier to see. There's a very important input, which you could tell I have highlighted, which is volatility because all of these things are kind of known and they're relative to the underlying at a point in time. If we're assessing if an option is expensive, this is what we care about, volatility. This is the primary input that will change beyond other kind of known standard effects, how relatively expensive an option is. So if we move this over here, and let's take a look first at the implied volatility. So for Walmart, the implied volatility is up here, 26.24. Is that expensive? Is it cheap? We don't really know. That's why I frame it that way. It's just a number. Implied volatility in this sense is just telling us the expectation of price movement. That's all. So we can't really tell. We can't decipher from this. If that means that the options are cheaper expensive, we don't know yet. What we can use is something like implied volatility percentile or implied volatility rank. I much prefer implied volatility percentile. It is much less prone to skew. I think that that matters. So going off of that thread, and I think in here, actually, if I'm not mistaken, we have something in here about implied volatility percentile.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "implied volatility percentile or implied volatility rank. I much prefer implied volatility percentile. It is much less prone to skew. I think that that matters. So going off of that thread, and I think in here, actually, if I'm not mistaken, we have something in here about implied volatility percentile. Valtuity. Yeah, here we go. Look at, see, I told you, this thing is becoming like the ultimate reference guide for most things. So here, I'm showing you the difference between implied volatility percentile calculation and implied volatility rank. The problem with implied volatility rank is based on the way that it's calculated. It is very prone to remaining skewed when there's a really large move. IV percentile is much less prone to skew. Because what we're doing is we're taking the current implied volatility and we're seeing how high it is relative to a reference time frame. And as you guys always know, I dime out any time YouTube wants me to insert an ad to which we say, nay, we do not insert ads for YouTube. They probably have not a big fan because I'm not making them as much money, but whatever. I think ad here would also be annoying. It is funny, though, it literally does this giant pop up and it asks you a million times when you're doing these. It's always like, do you want us to insert the ads for you? Do you want us to insert the ads for you? I bet",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "also be annoying. It is funny, though, it literally does this giant pop up and it asks you a million times when you're doing these. It's always like, do you want us to insert the ads for you? Do you want us to insert the ads for you? I bet they would like to insert the ads for us. So to recap so far, we can start with implied volatility. Things with high implied volatility will tend to be more expensive. Even on a, I'm like a broad basis. Ben Wants says there's got to be an extension to auto dismiss those. I bet the problem with that extension, though, is it probably also tracks every single personal detail that I have, which is not worth me not at least making a small comment about the thing when it pops up. Manscape Goat says, wait, what's the flavor of the day? Oh, right now we're drinking. This is actually my wife's preferred one so far. We have a straw, I don't know why that would be difficult for the camera to see. This one is strawberry watermelon and then our backup for today is standard watermelon. This guy, the standard watermelon is admittedly my favorite, but this strawberry watermelon is pretty good. Still a fan. Overmoistened meatloaf, this is the hottest stream I've ever seen. That's also. Well, I'm really, really glad overmoistened meatloaf that this is really getting your juices flowing because I tell you what, anybody that gets",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "watermelon is admittedly my favorite, but this strawberry watermelon is pretty good. Still a fan. Overmoistened meatloaf, this is the hottest stream I've ever seen. That's also. Well, I'm really, really glad overmoistened meatloaf that this is really getting your juices flowing because I tell you what, anybody that gets stoked about options like to that, you're my kind of person to be honest because this is, yeah, I mean, this is, this is my deal. This is what I do. So any chance to talk about options with somebody else that even potentially gets turned on by them. I'm here for it. So back to this implied volatility on our gross level. If it's high, the options are going to be more expensive. So if IV in this thing is let's say 15 then if that's compared to something with IV that is 54, the 54 IV options are absolutely going to be more expensive. Now, when you're comparing within an individual product, so in this case, we're looking at Tesla. If we compare the price of Tesla relative to itself, this means that the implied volatility percentile gives us that metric and it lets us know how expensive IV is relative to just Tesla. And in this case, the options would be relatively expensive in general. We're still in the macro view, the higher level view. So quick recap. If IV is high, in general, as a gross figure, cross products options become more expensive. Implied volatility percentile",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "IV is relative to just Tesla. And in this case, the options would be relatively expensive in general. We're still in the macro view, the higher level view. So quick recap. If IV is high, in general, as a gross figure, cross products options become more expensive. Implied volatility percentile gives us a relative understanding of a products IV relative to itself. If implied volatility percentile is high, then its options are correspondingly going to be more expensive. That's the macro level view. Now to get into the micro level view, I guess we'll just use Tesla to keep the example going. Wow, and it's even better now. Check this out. IVP is 98. This is actually kind of a cool example. Let's bring this back over real fast. So in this timeframe when I looked at it, IV was 54 with IVP of 58. Now it's 68.4 with IVP of 98. So now options are really expensive on a relative basis. Interesting. So if we come in here, and we take a look at the options, let's go first at the expiration cycles. So this is, and if you've been watching any of the GME videos I've been doing, which again, even if you're not necessarily super into the GME story as I am, obviously, there's still a lot of really good information about options analysis in general in there. So I recommend that you check them out. They're not that long. It's like 10 minutes and I'm launching",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "which again, even if you're not necessarily super into the GME story as I am, obviously, there's still a lot of really good information about options analysis in general in there. So I recommend that you check them out. They're not that long. It's like 10 minutes and I'm launching almost one a day at this rate. But one of the things you've seen me look at in a lot of them is this. This is the implied volatility for each expiration cycle. So we can see, for example, that this 12 July, which was today, had 81.66 vol. The expiration cycle for 19 July is down to 63.62. But then the next expiration cycle is back up to 83.55. So what can we infer from here? That these options, this chain on a relative basis to the product, and specifically to these other options chains is cheaper. So this is another click down on assessing the expansiveness of an option. So we now know the macro picture from the underlying itself. We now know based on expiration cycles where I can find cheaper options. So in this case, we see these options out here are 60.09. They're relatively cheap. I think I clicked the, yeah, I got the right one. So now there's one final layer we can click into, which is the individual option. You can find where where options are relatively cheap or more expensive. Now what you'll find first is typically speaking, the IV will expand",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "I think I clicked the, yeah, I got the right one. So now there's one final layer we can click into, which is the individual option. You can find where where options are relatively cheap or more expensive. Now what you'll find first is typically speaking, the IV will expand as you go further out and in the money. So generally speaking, there will be cheaper volatility at the money. So with this, you can look for slight anomalies and see if there's a period where you can go a little further out in time and actually find cheaper IV like this one right here. So as I look at this 25 delta put, notice how the volatility leading into that put, I see 56 and a quarter, 56, 21 and then 56, 18 and then it bounces back up to 56, 32. So these are relatively cheap in this product where the expiration cycle writ large is looking at 60 vol. You can find 56, I'm sorry, 60 vol. You can find 56.18 vol. So this is where volatility is cheaper. So a bit of a long answer, but I wanted to give you guys a bunch of different ways of looking at this. So let me see. Reese says seems odd to have less vol and longer dated expiration. The high IV of September should appear in October. No, not necessarily. It's all based on expectations. The other tool that you have is this and we can look",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "ways of looking at this. So let me see. Reese says seems odd to have less vol and longer dated expiration. The high IV of September should appear in October. No, not necessarily. It's all based on expectations. The other tool that you have is this and we can look at the implied volatility for either the average of the options. Let me get rid of this near-term expiration because it's skewing everything and all these crazy lines being all kinked like this. This actually, that's a ton of trading opportunities from a vol traders perspective, especially this blue one, that 19 July, that's nuts. If you got here to 19 July, that's super tradable. All that's super tradable. There's relative values there, but I don't want to get too far in the weeds there. I just caught my eye. So you can look at the relative cheapness or expansiveness of maybe out the money options versus in the money options. You can look at relative pricing, but this is more for a different style of trading. I just want you to know it exists. But what you're looking here is a volatility surface. It's not as pretty as the 3D models, but it gives you the same information. Seeing things that include crossovers, like this 19 July to 26 July, I can see that pretty clear as day. So if I clear everything out and just show you those, this right here, that's a tradable event. This entire thing",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "3D models, but it gives you the same information. Seeing things that include crossovers, like this 19 July to 26 July, I can see that pretty clear as day. So if I clear everything out and just show you those, this right here, that's a tradable event. This entire thing is a tradable event. So there's a lot of different opportunities with trading vol directly, but that's not what your question was. It was more about the expansiveness of options. So give me a random ticker, and then I will run through this whole process because I know that that seems like a lot, but it takes less than two minutes. So if you give me a random ticker, something not that we look at all the time, I will pull it up and then I will assess the options for you real time. SMCI game. Let's take a look at SMCI. SMCI. All right. So the first thing I notice is we are trending sideways. So the reason why that matters to me is because if we have big drops in price, I inherently know volatility tends to be higher. So I scouts honor. I haven't looked at the top corner yet, but when I look at this, I see something that went through a drop and has been trending sideways. So I would expect volatility to be low. However, it is earnings coming up. So my expectation of vol in that case would be actually much higher. So",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "top corner yet, but when I look at this, I see something that went through a drop and has been trending sideways. So I would expect volatility to be low. However, it is earnings coming up. So my expectation of vol in that case would be actually much higher. So IVP 71. So that doesn't surprise me. So what I'm doing is quickly using the chart to get a sense of how price is moving that will inform a little bit of where how volatile or how expensive options can be. Now I looked at IV in IVP. The other thing I notice is IV and this is 88. On a gross amount that is a relatively high number. If I give you a comparison really quick, like GE, 38. And look at this. The IV and GE is 38. The IV percentile is 97. So what this is telling you in GE, even though IV is only 38, that's crazy expensive for what this is on a relative basis. Okay, so back to SMCI. First thing, price down tells me vol typically a little bit higher. Trending sideways would tell me vol probably contracting. Earnings coming up tells me vol probably higher. Now I can skip all of that. I'm just walking through my actual thought process out loud. Now I look at IV, 88 gross number is high, tells me expensive. IVP 71 tells me expensive. Go into the options chain. I look at the expiration cycles. I",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "vol probably higher. Now I can skip all of that. I'm just walking through my actual thought process out loud. Now I look at IV, 88 gross number is high, tells me expensive. IVP 71 tells me expensive. Go into the options chain. I look at the expiration cycles. I see front is cheap. The next two cycles expensive, slightly cheaper, more expensive all the way out until we get about here. And I notice this is actually a slight anomaly. These options in this expiration cycle being this low relative to the others, same with the 68. These tell me these two on a relative basis are quite cheap. So if I wanted to buy options, I might look at something a little further out and then you have to go into liquidity and all that shit. But I'm just letting you know from IV perspective, I can see what's expensive versus what's not. Like this in here is expensive. It's essentially the top end of the options chain. So depending on what kind of trade I'm looking to put on, I either might want them to be expensive or I might want them to be cheap. Depending on what scenario I would either go there or here. So now going out here to the 20 December and a quick assessment of the options, I see that there's actually very, very slight call skew in terms of all. So when I look at these and it's also because of",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "what scenario I would either go there or here. So now going out here to the 20 December and a quick assessment of the options, I see that there's actually very, very slight call skew in terms of all. So when I look at these and it's also because of Delta, actually. So let me redact that and look at seem to seem comparison 75. Yes, still there. So what I'm doing now is I'm comparing the same Delta options. I see a 31 Delta put here and I see a 31 Delta call way out here. The 31 Delta call has 75.6 vol. The 31 Delta put has 72.99. Very often you'll see the inverse. The market tends to price in the downside way more heavily than the upside. But when you're looking at individual tickers like this or even if you've been following what I've been looking at with GameStop, they tend to be skewed actually quite a lot. So if I now have a pretty comprehensive picture of how expensive volatility is. So let me know specifically I think Reese that was originally your question. Let me know if that answers your question. I hope that going through that exercise is useful for you. Let me take a quick look at some of these other questions and then by the way, if you drop a question further up and I miss it, don't feel for don't don't be bashful. Drop it back in. I kind of just",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "through that exercise is useful for you. Let me take a quick look at some of these other questions and then by the way, if you drop a question further up and I miss it, don't feel for don't don't be bashful. Drop it back in. I kind of just try to keep up with what's flowing through so that I'm not flipping all the way up because it takes time. But Mr. Squish mellow, AMC Squish mellow, that's a hilarious name. How do you identify the delta of a contract when you are swapping only fans pages in the open up market? That confused me. But I would probably direct most of your attention to the only fans pages and not worry so much about the delta. That would be my guess. Ben Wallace says what is expensive really mean here premium paid per delta? You could look at it that way. It essentially just means how expensive the balls are. Right? Like that's at the end of the day when you're trading options, you're trading vol to some degree or to another. That's really you're seeing how expensive the ball is that you're transacting at. That's the easiest way to think about it. Carlos says what platform? This is think or swim. I still find that so novel that so many people aren't really used to looking at think or swim. It's fascinating to me. It's not a dig at anybody. It's just because obviously it's telling me",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "way to think about it. Carlos says what platform? This is think or swim. I still find that so novel that so many people aren't really used to looking at think or swim. It's fascinating to me. It's not a dig at anybody. It's just because obviously it's telling me that I'm becoming an old head at my right page of 33 because when I look at like primary trading platforms, this is so popular. But I guess most people are used to use and stuff like Robin Hood now in Wee Bowl. Very interesting. Ben Wallace says so the price per expected tick change. I wouldn't even think of it as in terms of expected tick change. It's okay to look at that right because that's what delta is telling you. It's literally just telling you how expensive the balls are that you're trading. That's essentially it. Rolando says but if you do a little TA, you can see that a chart is really looking. Oh, I think I missed a I have to go back up. Rolando says I have a question. Why did you sell your options today? I understand your strategy is more conservative and you swing trading. But if you do a little TA, you can see the chart is looking really good for next week. Mac, D cross. Yeah, so a couple things. And he's referring to the GME trade. I still have a position on. As I said, like I still have right",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "swing trading. But if you do a little TA, you can see the chart is looking really good for next week. Mac, D cross. Yeah, so a couple things. And he's referring to the GME trade. I still have a position on. As I said, like I still have right now. I still have long shares and I do have options in it still. I just wasn't able to establish the position I wanted out here in 18 October. I have exposure now in 20 September. So the only thing I did was take in my 16 augs. And the reason for that is because they're starting to get to a point where on a relative basis on the remaining value of the options, it's going to decay much faster. So it means that I need bigger moves in order for this to stay essentially where I want. So I had a pretty decent price accommodation from where I entered the trade. It's for me, like I said in the video, like I'm a trader, right? And my job is to make money. So I look at something that is made money. It's slowing down. It's up move. And I do have kind of the rest of the exposure that I want at the time. So yeah, that's literally exactly why. What you don't want to do with options is wait too long, especially if you're buying them. If you're buying options, it's really, really difficult to strike a balance",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "do have kind of the rest of the exposure that I want at the time. So yeah, that's literally exactly why. What you don't want to do with options is wait too long, especially if you're buying them. If you're buying options, it's really, really difficult to strike a balance in terms of an expected return, which we can talk about that a little bit. But it's important to remember that you literally are holding a decaying asset, right? It's something that's disappearing in your hands. And if you hold on to it for too long, you lose a decent amount of the value. Even though I tend to go in the money, there's still extrinsic value in those options that's decaying away. So for example, if we go out here to the 20 steps, you can see that even really high delta options, let's use something like this. The 20s, they're, you know, bid 730 offered at eight. But of that, you know, whatever, seven and a half or three, I don't know where you would get filled in here. I noticed that the markets tend to be pretty liquid, meaning you're not going to get hit at the mid, especially if you're buying, you're probably going to be a little more offer heavy. That's what I've noticed at least. And in that, if I'm looking to gain exposure to GameStop and I'm buying calls, let's say I take them in for seven 80 something like that. And of",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "mid, especially if you're buying, you're probably going to be a little more offer heavy. That's what I've noticed at least. And in that, if I'm looking to gain exposure to GameStop and I'm buying calls, let's say I take them in for seven 80 something like that. And of that seven 80, at least a dollar 20 or so is extrinsic value that's going, that's bleeding out of the position. So that means as time is passing, this is slowly coming out of my, that's adding drag to my returns. So that means I need GameStop to move more to compensate for what I'm losing on Theta decay. That starts to accelerate as you're closer in time. I actually have neat little again, I told you like this thing is becoming like the, the everything reference with that is showing you though is this. As we start getting within 60 days on a relative basis, Theta decay really accelerates as extrinsic value approximates to zero as we get nearer the expiration. So that is in a nutshell why I adjusted the position I did. So if there's any follow on questions to that, let me know. Bryce asked, have a question about GME options. So let's say the market has a huge squeeze to the upside next week and the option is for October. Wouldn't this create difficulty for selling since it's far out? Nope. The a couple things. The first thing is if we, there's some sort of",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "a question about GME options. So let's say the market has a huge squeeze to the upside next week and the option is for October. Wouldn't this create difficulty for selling since it's far out? Nope. The a couple things. The first thing is if we, there's some sort of like really big move, all options will become slightly less liquid. So volatility is lifeblood. You need volatility. Volatility is what brings people in to even create a baseline liquidity. But if volatility expands a lot, let's say based on really big moves in GameStop, if that happens, volatility will, the market makers are going to widen the markets. And this is largely to protect themselves. Otherwise, they can get ran over. I know a lot of people want to look at the market makers and make them out to be the bad guy. And I'm not saying that they're all angels. They definitely have their motivations. But they still have pretty difficult periods to manage risk, especially in like really hyperbolic markets. So if vol starts skyrocketing, whether because the market is flying up or the market's crashing down, the market makers are going to widen those bit-ask spreads and everything will become wide. Now to your point, if you go further out in time, it naturally is less liquid. So if we look at these seven day options, let's find us 80 delta I see them here at the 24s and I see them bid 244 offered 260.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "and everything will become wide. Now to your point, if you go further out in time, it naturally is less liquid. So if we look at these seven day options, let's find us 80 delta I see them here at the 24s and I see them bid 244 offered 260. If I go out here to the same 81 delta ish, this is an 80 delta, their bid 795 offered at a 20. That's actually really that's tight on a relative basis. So this actually looks pretty good now. But the further out in time you go, the wider those markets tend to get. So this is another great example. If we go out now to the 20 junes, you'll see that the 79 delta closes to 81 that we have bid 1040 offered 11 and 75. So you will fight some level of liquidity to answer braces question, but it's not like that's going to murder your ability to make any money. It just means you're going to take a bigger haircut getting out of the position and we can go back. I mean, we literally we have time. We can go into on demand. Let's go to the 14th and let's check out like maybe midday. Let's go to on demand. This is of May. May 14th about midday take us to like 11. And let's see. Let's see what these options we're looking like. And this is crazy. Notice how crazy that looks right now they get",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "14th and let's check out like maybe midday. Let's go to on demand. This is of May. May 14th about midday take us to like 11. And let's see. Let's see what these options we're looking like. And this is crazy. Notice how crazy that looks right now they get the ball just fucking jacking up here nuts. All right. I guess it would have been better if I showed us a comparison. Yeah, that's shame on me. Let's do like, oh, God, these options are so weird. There we go. Yeah, so let me take us a couple days back to for a comparison. Let's go to 30 April. So what I want to do is show you guys on a relative basis what happens even if the underlying jacks to the upside. I want to show you what happens to the options in terms of liquidity. So in this case, let's update this to that. So in this case, if we go to the at the money, the elevenths right now, they're bid at 102 offered at 110. So that's eight cents wide. Now the first thing I want to inform you guys on is that this is actually really wide for such a cheap product. But these options are also really, really elevated for such a cheap product. It's actually like completely fascinating. It's one of the reasons why this thing is so fun for me to look at because it does a lot of very strange",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "actually really wide for such a cheap product. But these options are also really, really elevated for such a cheap product. It's actually like completely fascinating. It's one of the reasons why this thing is so fun for me to look at because it does a lot of very strange things. So even though this is only eight cents wide on a relative basis for an 11 product, that's a big bid-ask spread. I, so now we go back to me. What was I said? The 14th and we'll look at the at the monies. And then I think they were, I just want to use like a solid comparison. We'll go to the 21 June's that are 38 days out. And then let's grab like 25. Okay, so we're not seeing anything here that's kind of annoying. Maybe 31's. No, that's kind of annoying. Let me see. So you can already tell how weird this is, right? Like I can't even find out of the money options to look at with you guys. I'm trying to find options that are around like 55 delta. But it's behaving so crazily. Let me see if I get it closer to the open before it went through all of this madness. Let's do like 0900. That's still already went through the madness. Maybe I'll go one day before. And I know that it shows up in the 17 Mays so we can look at those two if we have to. I wanted",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "open before it went through all of this madness. Let's do like 0900. That's still already went through the madness. Maybe I'll go one day before. And I know that it shows up in the 17 Mays so we can look at those two if we have to. I wanted to give you guys a, yeah, this is fine. This will work. So here are your 51 delta's. They're down here. And it is the 50 choose. And their bid 780 offered 805. So in this case, damn it, they moved. Here we go. So the 34's. And the 35's. The 35's are crazy wide, right? So right now if we look at the 34's, they're 5550 to 575. So 25 cents wide. So even though price went up pretty significantly, the value of the same delta option is skyrocketed. And if you look at this next option, it's bid at 355 offered at 635. So this is the market's widening their liquidity. So if we go further out in time, let's do like these 19 July's, you'll see that they're also wide, but they're not like not tradable wide. They're just wide. So in this case, the 25's, their bid 1070 offered 1165. So you're taking a dollar haircut essentially. That's not insignificant, but this doesn't necessarily decrease your ability to transact here. So that is that's that. I forgot who asked that question, but let me know if that answers it to the shadow, quite man, this is",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "bid 1070 offered 1165. So you're taking a dollar haircut essentially. That's not insignificant, but this doesn't necessarily decrease your ability to transact here. So that is that's that. I forgot who asked that question, but let me know if that answers it to the shadow, quite man, this is crazy. The volume here is just so it's literally incredible to look at. It's nuts. Let me know if that answers your question. Nick says, Reece says, do you have core investments you plan to hold indefinitely? No, I do not have that. I am a trader. So I trade everything. Even the retirement accounts I have, I trade those. Yeah, I trade everything. I have no attachment to individual products. And I actually care a lot about trying to maximize the return potential, which holding indefinitely doesn't do that for me. So no, not for me. MK says, can you give an explanation on how it is better to understand option premiums? I'm trying to deconstruct how notorious, ripy, see, I don't know who the fuck that is. Is there something market makers do on premiums on specific strikes? I'd love to answer, but I don't understand your question. When you say better understand option premiums, I don't know what that means. Do you mean like how they're built or something else? Rama says, thank you for the content, learning a ton. That's awesome. Feel pretty comfortable with the first order Greeks. That's great. Rama says, I've been selling",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "When you say better understand option premiums, I don't know what that means. Do you mean like how they're built or something else? Rama says, thank you for the content, learning a ton. That's awesome. Feel pretty comfortable with the first order Greeks. That's great. Rama says, I've been selling covered calls, selling cash secured puts and it's been profitable. What would you suggest suggest as my immediate next steps in learning do need to learn iron condors, etc. Great question. So this is what I would do. Literally, I would follow this guide. And I will share it. This is available literally for everybody for free. There's nothing paid in here. But I wanted to give people a something you can follow along. So this is what I would do. If you know a couple of those strategies, so it looks like you're in here, this you can see what I like to do. So these are, this is the direction that I would go personally. But yeah, that's the short answer to that one. Rama says, how do you think about diversification? Yeah, that's a great question. So diversification is super important, but too much of it's also not good, which I think is kind of a slept on concept. The reason being is because there are people that I know and I've come across quite a lot of them that they'll have a bunch of positions on, but each position is worth 1 of the portfolio. So",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "not good, which I think is kind of a slept on concept. The reason being is because there are people that I know and I've come across quite a lot of them that they'll have a bunch of positions on, but each position is worth 1 of the portfolio. So sure, they're hell of diversified. However, if you're too diversified, even if you get a nice big move in your favor, you don't make any money. So in my opinion, the concept of diversification really, really, really comes down to striking a balance, making sure that you have enough diversification to make sure that you align with your objectives, but you're not too diversified and you're not making any money if you're getting moves. So yeah. Ruta Begas says, since they did a case exponentially, should you just move your position further in, in every time it starts accelerating? So first, I take your question to mean under the assumption of your buying options. And if you're buying options, you can institute kind of a structure so that when theta starts eating too much of your lunch, you move your options out. It's literally exactly what I did today in the 16 augs. I could have waited another few days, like we're not within 30 days, which is my specific window where I really want to start doing something, but it lined up well with the price movement. So that's it's not like a discrete, always do it a set",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "the 16 augs. I could have waited another few days, like we're not within 30 days, which is my specific window where I really want to start doing something, but it lined up well with the price movement. So that's it's not like a discrete, always do it a set kind of way. And it's because it's market dependent on what the market's doing. But yeah, absolutely. If you gain exposure in the 90 ADT, 70 DT, the 49, whatever you want, you could pick a time frame that as it starts getting closer to that, you want to get out. Now, again, there's a million ways to do this. And I want to make sure that you guys understand that I'm talking to you from my perspective, because there's also something to be said for coming within 30 days. And you can still trade options in this time frame. I do periodically. It's just not my go to. So when I'm talking to you guys from like this broader sense of generalities, that's what I'm sharing. But there's absolutely nothing that's going to break you. If you come in here to a 14 day trade, 14 DTE, if you think your move is going to occur in 14 DTEs, and you can go super deep in the money. You can buy these 87 Delta's, or most of these are not super liquid. I don't love them. Maybe these 22 Delta, the 22 strike calls that are bid for 20",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "think your move is going to occur in 14 DTEs, and you can go super deep in the money. You can buy these 87 Delta's, or most of these are not super liquid. I don't love them. Maybe these 22 Delta, the 22 strike calls that are bid for 20 gigat, and they're offered at 465. But on these, you're literally just paying like 30 cents, 35 cents. So you're not on a relative basis that's pretty high theta decay for what's going to come out of them. But it's still as a gross dollar amount that's not going to kill you. So that's why this game of picking strikes or selecting explorations is so cool. Is because you have the ability to really structure positions that align with what you're trying to do. So I just dropped another video in there about buying call option smarter. It uses GameStop as a reference, but it's not limited to GameStop. It's about kind of this process. How to strike a balance between DTEs, Delta's, because as we talked about before, we know that if you pick up a higher Delta, your option is going to be more expensive. So how do you figure out how high you want to go? The neat part about it is you literally can develop a pretty simple system that looks at what makes sense based on your objectives for the position. That's the way to think about it. At least I think that's the way",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "you figure out how high you want to go? The neat part about it is you literally can develop a pretty simple system that looks at what makes sense based on your objectives for the position. That's the way to think about it. At least I think that's the way that I try to think about the decision. Ruta Vegas says since they did a case, oh, I already answered that one. That's cool. All right, cool. Oh, yeah. Paul says, do you build Delta neutral portfolios? You use some other portfolio strategy. No, I do not build Delta neutral portfolios. I think the concept of Delta neutral portfolios sounds so appealing because people get nervous about risk and they like the idea of being able to make money in all markets and shit like that. But the way I think about building like the portfolio disposition is 100 tied to what I think about the market. So I actually have, as you guess, I think I built a slide in here about it. Let's find that bad boy. Uh, nope, not that one. You like that, you like that pink though or that purple, whatever that color is? I think it's pretty legit. Where is this here? And here. So when I look at the idea of setting up a portfolio, it's going to be aligned to this stuff. So what this means is, let's say, for example, I think the market is going to go up. Why would",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "think it's pretty legit. Where is this here? And here. So when I look at the idea of setting up a portfolio, it's going to be aligned to this stuff. So what this means is, let's say, for example, I think the market is going to go up. Why would I want to have a Delta neutral portfolio if I think the market is going to go up? Well, the benefit to doing that is if if the market goes down, you can make some money on those other positions. But from my perspective, I would rather just adjust the portfolio as the market goes down and then switch. That's the cool part about being a retail trader is that I don't have a mandate. I don't have any rules placed on me on how much money I have to use at a specific point in time or what kind of drawdown I can sustain or literally anything like that. I have complete autonomy over what I choose to do. So for example, T triple cues. I literally had a full exit yesterday and I reentered the majority of the position today. It's a complete pivot. And there's nothing that stops you from doing that as a retail trader. You just have to be careful not to go too far down that rabbit hole and whip sawing around. You lose a lot of money that way. So you don't want to do that. Rese says keeping a trade long a",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "stops you from doing that as a retail trader. You just have to be careful not to go too far down that rabbit hole and whip sawing around. You lose a lot of money that way. So you don't want to do that. Rese says keeping a trade long a journal, what a difference can't follow a game plan that you don't have. Yeah, that's awesome. I'm really glad that you're doing that. In my opinion, that's probably one of the most transformational aspects of trading literally is that exact process. So I'm super, super stoked that you're doing that. All right. Any other questions that we want to hit? Rolando says they sent you a question. It's above. I don't know where it is, man. Okay. See it. Another question. When is it best to roll options? Is it better to roll or selling them by another contract? I see. So I have a couple videos for you on that that you can take a look at. And funny enough, I have another video dropping tomorrow on rolling. So and I think we actually talked about that. Why in depth during one of our recent live sessions? So that first one is about rolling kind of a broad concept. The second one is about a bunch of common myths about rolling. And then this third one is coming out tomorrow. So I don't think you'll be able to access it via that link because it's scheduled. But when it",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "first one is about rolling kind of a broad concept. The second one is about a bunch of common myths about rolling. And then this third one is coming out tomorrow. So I don't think you'll be able to access it via that link because it's scheduled. But when it launches tomorrow, you'll be able to see it. And it's coming out at zero seven, fifteen, specific time. So yeah, there's a couple of resources there for you. All right. Let's talk about this idea of building strategies. When I think about the concept of building a trading strategy. And again, I'm not going to spend much time in this slide deck. I just want to show you a couple guiding concepts. And then really what I want to do for this section actually is look at your ideas and walk you through how I would think about building trades. That's the intention here. So when I think about the idea of building strategies, one of the most important concepts is maintaining some sort of edge. And there's different ways you can access edge, which I will give you some ideas. But I want to show you this. So this slide, let me see if I can large make this a little bit larger so that the people in the back can see. Let me know if that's visible enough. If it's not, I honestly have no nothing I can do to help you. So I will make a fake",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "slide, let me see if I can large make this a little bit larger so that the people in the back can see. Let me know if that's visible enough. If it's not, I honestly have no nothing I can do to help you. So I will make a fake gesture as if I can do something about it, but I cannot. So if it's not visible, then I feel bad for you. Because otherwise you're not really going to be able to follow along at all with what I'm going to say. Hi, this is an overview of how I think about building a strategy. You can see that there are a few steps. This here is essentially the process that I would look to follow, to kind of build a strategy and the way it would work. I don't know why that would be at that crazy of an angle. That's just silly to me. There we go. So the idea would be you would flow through this literally just like this. And what I try to think about is a process that's replicable over time. And it can deliver consistent results. Because that's going to be one of the largest aspects of building a successful trading strategy is finding a way to build ideas that you can then deploy and optimize over time. Because it's not that easy. And one of the biggest mistakes that you can make in doing this is to have this really haphazard",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "of the largest aspects of building a successful trading strategy is finding a way to build ideas that you can then deploy and optimize over time. Because it's not that easy. And one of the biggest mistakes that you can make in doing this is to have this really haphazard bullshit approach that it doesn't allow you to actually test ideas. So let's talk about these kind of in a general sense. And then like I said, we'll literally dive directly into an example. The first thing I'm going to do is define the purpose of the strategy. So that's predicated on this. So if we go back to the way I think about really the world of trading, it's in this light up here. Notice how I take a very hierarchical top down approach to this whole thing. I'm looking at big picture items and then boiling them down to smaller things. So when I look at the portfolio, I split my portfolio into a core allocation and a speculative allocation. I now know that I need to have a couple ideas that can work in all of these. And I've already given you kind of the cheat sheet for the stuff that I do, which is this right here. This is essentially the comprehensive breakdown of the overwhelming number of trades that I put on at a given point in time. You literally can find them all here. And there's really what I consider to be a lot",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "for the stuff that I do, which is this right here. This is essentially the comprehensive breakdown of the overwhelming number of trades that I put on at a given point in time. You literally can find them all here. And there's really what I consider to be a lot of beauty in simplicity in what I'm doing. So when I'm thinking about when I'm thinking about building strategies, I want stuff that is robust. And I want stuff that allows me to trade most market conditions. So the way to answer this first part, purpose of strategy for me, I would outline a strategy that allows me to trade every single market condition. That's the first thing I would be looking for. And I think I have a slide in here. Do I? I think I do. Yeah, this one. This shows you like exactly the stuff that I'm looking to trade. I'm looking to have things that allow me to trade directionally up and down. I'm looking to trade volatility. And all of its individual little quirks, whether it's the clustering, the variance risk premiums, whether it's relative value plays, whether it's skew, there's a million things you can trade. So these are the broad buckets of what I'm looking to trade. So why does this matter? Why do I go through the effort of explaining this to you guys? Well, it's pretty simple. It's because I think one of the easiest things you can do to simplify",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "can trade. So these are the broad buckets of what I'm looking to trade. So why does this matter? Why do I go through the effort of explaining this to you guys? Well, it's pretty simple. It's because I think one of the easiest things you can do to simplify this whole process for yourself, which is all the way back here is don't think about having to build a strategy and just build 10 million of them. You can get to that point if you want. There's nothing wrong with it if that's your approach. But I would literally start by just defining a you need a strategy to trade things that are going up. You probably want a strategy to trade things that are going down. If you want to trade both sides of direction, I do. Like those are completely reasonable places to start right there. You don't necessarily have to go further than that to start. It's totally up to you, but that's a reasonable starting point to take. So capital gains is this idea of making money as direction occurs. You can trade things for income. You can want to have a strategy to hedge a portfolio. You have to start with what you're trying to do. Then we need to isolate the profit mechanism. Simply put, this is how the trade supposedly makes money. So what you'll find is people all the time want to put on. They just what they say like I",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "a portfolio. You have to start with what you're trying to do. Then we need to isolate the profit mechanism. Simply put, this is how the trade supposedly makes money. So what you'll find is people all the time want to put on. They just what they say like I want to trade something like I want to trade verticals or I want to trade calendars. And I'm always thinking like why? Who cares? Like you're just naming structures. What you need to do is think about what the thing is that you're trying to build. What are you trying to take advantage of? That is the entire purpose of this. Rama, hey, thank you so much. Rama, I really, really appreciate that. Rama says showing appreciation for me and objective, sharing learnings without pushing in gender, you are a true educator. I appreciate that very much. Thank you. That is literally that's the entire goal. And I'll happily take a second to give another shout out to this dude right there. That's the guy that essentially told me in high school that I should look into investing. And then I did. And he with that recommendation completely changed quite literally the entire trajectory of my life. That's why I do what I do now. Because this dude that's not part of my family that really has no other vested interest in me other than the fact that I was in ROTC with him as you could tell by our",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "literally the entire trajectory of my life. That's why I do what I do now. Because this dude that's not part of my family that really has no other vested interest in me other than the fact that I was in ROTC with him as you could tell by our cool uniforms here. For no other reason than that, he told me to go look into investing. He thinks he would be a good idea for me. He was showing me what's called a Goppe love. He was just trying to take care of me. So because of him, my life went down a very different path. And it's literally why I do this stuff right now on a Friday evening with you guys is because one, I love teaching. But two, I think it's so important to share those kinds of gifts with other people. So always shout out to Colonel. All right, back to this though. Profit mechanism is how something makes money. How can you find a profit mechanism? How can you determine what makes sense? Easy. It is easy. You can look for things and trends around price direction up or down. You can look for things relative to volatility. How does it behave? What does it do? What are some of its traits? You can look for market inefficiencies. There are a lot of ideas. You can literally start by jotting down a bunch of ideas. Another idea is to go onto a website like",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "things relative to volatility. How does it behave? What does it do? What are some of its traits? You can look for market inefficiencies. There are a lot of ideas. You can literally start by jotting down a bunch of ideas. Another idea is to go onto a website like SSRN, which is this. And you can type in different things. This is the social science research network. It gives you access to tons of peer-reviewed papers. That's where the majority of these are from. But what I'm showing you in this are all different kinds of profit mechanisms that I literally come across from different studies, all different kinds of ideas. So what I'm doing is I'm looking at academic information and studies and I'm using it as inspiration. It's important to know that when you use academic research, it is not as simple as they say there's post earnings announcement drift, I trade post earnings announcement drift because academic research has a lot of nuances to it, and it's not perfect. So you still have to be a thinking human being and interpret that market research or whatever paper you're reading or whatever else and still test it. But notice how I said it gives me inspiration. It gives me ideas. We are officially out of Strawberry Watermelon, but that's okay. We have our backup of regular watermelon. Love us a good filter water. Oh, that one's so much better. So much better. Teaching says quantpedia is pretty",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "But notice how I said it gives me inspiration. It gives me ideas. We are officially out of Strawberry Watermelon, but that's okay. We have our backup of regular watermelon. Love us a good filter water. Oh, that one's so much better. So much better. Teaching says quantpedia is pretty good as well. Yeah, that's actually a great, great, great add-in. I do not use it a ton myself because the way that this looks at things is slightly different, but it is absolutely still worth checking out. I'm thankful teaching that you brought this one up. Good call. There's quantpedia. All right. So strategy, what's the purpose? What are we trying to do with this individual strategy that we're looking to build? Then we need to determine from that what kind of profit mechanism are we trying to take advantage of? So again, I give you several ideas right here. From there, Reese says, do you have the link to retail trading habits pitfalls? Yeah, that's on my website. So on my website, good ol fashion, esnvests.com. If you go here and to here, all of those studies are available here. So you can literally just drop those in and I cite kind of the key takeaways from all of them. Why do I have this here? Because I think it's freaking important for people to know what the landscape looks like. So Reese, yes, you can access it there. So we now know that we need a specific",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "and I cite kind of the key takeaways from all of them. Why do I have this here? Because I think it's freaking important for people to know what the landscape looks like. So Reese, yes, you can access it there. So we now know that we need a specific profit mechanism and again, I give you multiple ideas to determine what that could look like. From there, this is this is the important step. We should outline a list of perspective strategies that allow us to take advantage of the profit mechanism that you are interested in. That is the entire point of that step. So what that means in a practical sense is, for example, Jay says, damn, without couch potato buying you dinner, are you going to, are you going hungry tonight? Yeah, I know, man, I'm like, shit, I'm supposed to order Greek and I'm about to be on the hook for it. We might starve. I'll be honest, maybe doing a little bit of a fast isn't the worst thing ever. I'm still pretty fat. So I could stand to lose a few more pounds and maybe just do some salsa water. Maybe that's the future for me here. The structure list is where you just jot down different structures that allow you to take advantage of whatever it is that you're trying to trade. So for example, if I'm trying to trade things to the upside, can you guys come up with some ideas?",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "future for me here. The structure list is where you just jot down different structures that allow you to take advantage of whatever it is that you're trying to trade. So for example, if I'm trying to trade things to the upside, can you guys come up with some ideas? What structures or what things could I do that allow me to trade to the upside? You guys have any ideas? Throw them in the chat as many as you want. Calls puts, yep, chewies on it so far. What else can we do? That's two. Diagon calls, sure, can do that by shares. Roin titty. Love me some Roin titty by shares. That's perfect. Yeah. Those were all fine. You can do other stuff on top of those, but it starts to get more complex. And I'm actually really, really, really glad. You guys started with that approach. And it's because one of my biggest recommendations is when you're going through this process is to start as simple as possible. And the reason being is because it gives you the purest sense of what works. And it really decreases the propensity to start overfitting things grossly. So this link here is how to create a consistently profitable option strategy. It goes through what we're talking about now, very specifically in in depth, but you guys did the exact right thing there. So the structure list is literally just that. I'm not worried about what I like. I'm not worried",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "here is how to create a consistently profitable option strategy. It goes through what we're talking about now, very specifically in in depth, but you guys did the exact right thing there. So the structure list is literally just that. I'm not worried about what I like. I'm not worried about what I think might work best. I'm literally writing down what I think can work. That's it. From there, I'm going to test all of them. Now, before I test all of them, I can naturally exclude some of the strategies. If forward ever reason for a broader structural reason, it doesn't fit what I'm trying to do. So for example, let's say I already have a long option strategy that I like to trade to the upside. If I like it, I already tested it. There's not an inherent need for me to duplicate having another long option strategy to trade to the upside. That's not saying that there's others that couldn't work, not even saying that there are others that could work better. But I would go through that process as I'm trying to build the long option strategy to the upside. So you can naturally exclude things if you already have suitable strategies that do what you want them to do from the jump. So we take all of these and then we test them. We test them with a large data set. We then segment the data into smaller components. We test it and then",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "things if you already have suitable strategies that do what you want them to do from the jump. So we take all of these and then we test them. We test them with a large data set. We then segment the data into smaller components. We test it and then we evaluate the robustness. How well does it work? How consistent is it? How do the path of returns align with what I'm looking for? Am I comfortable with things like the maximum drawdown, those kinds of ideas? How do you test? You can either purchase access to back testing software. You can run it in Python yourself. You could probably ask chat GPT or another tool like that to help you. You can use something like on demand in thinker swim. And you can go back in time and you can manually test your ideas. This is a much slower process. This isn't the way that I would start personally. If you're trying to look through a bunch of different things, there is absolutely nothing wrong with starting to do this. If you're not even sure how to test, this will teach you a lot going through this specific process. So next, after that, let me slide that there. Come back out on demand. After we go through that testing, we have a selection process where we see what structures make sense for us. So I guess this should actually say select structures. So you can find the structures",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "process. So next, after that, let me slide that there. Come back out on demand. After we go through that testing, we have a selection process where we see what structures make sense for us. So I guess this should actually say select structures. So you can find the structures that work well for what you're trying to do. And then you can codify a rule set around them. This is where we're taking a structure and we're turning it into a strategy. So for example, a structure is long call. You can now parameterize that long call and you could say, well, maybe I'll buy it when the moving average slope for 14 day and seven day moving averages, they're positive. Okay, that's a criteria you can use. You can tinker with as many criteria as you would like. My recommendation is to go through a process where you evaluate the efficacy of signals stand alone. So what that means is if I want to use moving averages, if I want to know, if moving averages are an effective tool for me to evaluate this long bias directional thing I'm trying to trade the first thing I'm going to do is go to SSRN type in moving average. This is what I see. So the first thing I'm going to do is leverage other people's research and piggyback off of it. Okay, let me read all of these and see what they come up with and see what I",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "do is go to SSRN type in moving average. This is what I see. So the first thing I'm going to do is leverage other people's research and piggyback off of it. Okay, let me read all of these and see what they come up with and see what I think. Based on that, I will refine the signal itself. And then when I'm baking it into a strategy, I will see how aligns with the strategy. So I guess maybe we can do something like this to make it easier. And we'll include a thing in there for testing a signal. So we marry up the structures, we marry up the signals, we marry up our management approach, then we determine what fits best into our portfolio and then we start testing it live. So that's like a super broad overview of what this process look like. I'm going to take a pause there before we get into an example and what questions do you guys have about this process? What do you guys think about it? Do you, it doesn't make sense? Are there specific components to it that are unclear or things that you want to dive more into detail on? Other than Alper who's stoked on Tesla, which is cool. I'm stoked that you're stoked on Tesla. Okay. So let's take a look at something not to do. This is a great example of what I wouldn't seek to do with any sort of live trade.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "more into detail on? Other than Alper who's stoked on Tesla, which is cool. I'm stoked that you're stoked on Tesla. Okay. So let's take a look at something not to do. This is a great example of what I wouldn't seek to do with any sort of live trade. So you can see that we have this person asking if they should roll options to extract profits on a trade that they have on. This is quite literally the absolute worst time on planet Earth to attempt to figure out what to do. Literally about is bad is it can possibly get? So I would absolutely recommend not doing that with literally without a doubt. I would not do that. Policies how do you choose data providers? That's a great question. So for market data and options data, I use SIBO, but they're not the cheapest choice. So I do have a couple companies I'm affiliated with. They're typically in the description to my videos. Literally the reason why I affiliate with anybody is to get people discounts on things. Most of them don't really pay me anything worthwhile, but the products that I'm affiliated with that I think are genuinely good are things like Orats, Options Omega, Benzenga, BarChart. They all have different options data available to you depending on what you're trying to do. But for me personally, I literally go through SIBO and I buy their market data directly. It's expensive. So if you're not what",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "are genuinely good are things like Orats, Options Omega, Benzenga, BarChart. They all have different options data available to you depending on what you're trying to do. But for me personally, I literally go through SIBO and I buy their market data directly. It's expensive. So if you're not what I would consider to be like a much more serious trader, I think using some of those other tools probably be a little more economically viable. Nathan asks, when you use Python scripts to test new strat, you ever use LLM type script to forecast as well? Definitely. Yeah. And there's no reason not to. So there's a component about forward testing that's a slightly different bucket than back testing. I think it's really important to back test first to see what you can get to work, to see what kind of aligns with the objectives that you have and what fits well with the portfolio. And then you can absolutely start looking at forward testing ideas using either some sort of generator or like a random market sampling technique that's another really effective one to create like a new path, stuff like that. Ian says, trailing stops are they picked at the underlying price or to the option position price either or it depends on your broker, but you can set a trailing for either. Good question. Cool. All right. Retired. I love that. Ridley Truthor. I'm glad to know that you are retired. Big fan. If you have",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "picked at the underlying price or to the option position price either or it depends on your broker, but you can set a trailing for either. Good question. Cool. All right. Retired. I love that. Ridley Truthor. I'm glad to know that you are retired. Big fan. If you have a call option that doesn't expire for a few weeks months, but you hit your take profit early or just an extremely good run goes, do you sell early or is that too vague? No, it's not too vague at all. In those instances, I typically use like some sort of trailing stop. That's my approach. So for example, T triple queues. I've been buying into this for the majority of the year, but definitely a depth of the position started going on as we came out of this drop and kind of scaling up towards the end of April beginning of May. So the original price target that I had essentially was taking it from 60. And what I do for these kinds of price targets is I go further out in time. So like two years, I have to go even further. Let's go to five years. So what I do is I say, what references do I have to other perspective support and resistance? So you can see that there's some congestion here. I like the 68 handle. You can see some congestion here at the 75 handle. So what I did in this case is as",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "what I do is I say, what references do I have to other perspective support and resistance? So you can see that there's some congestion here. I like the 68 handle. You can see some congestion here at the 75 handle. So what I did in this case is as I was buying in, I already had an existing position from down here. I took it to the downside got stopped out in this space, waited for recovery, started to see a recovery here beginning of May and of April. And then I set the initial profit target of 75 bucks. So that's the give me an idea of where I'm trying to take this thing to, how I'm trying to ride it. And then when it hits 75 bucks, I don't just take the trade off because it's doing what I want as long as it continues to do what I want, I absolutely would not take the trade off. But what I do is I start setting stops. So in this case, the initial stop that I use specifically in T triple queues was when either I had a greater than 3 drop within an individual day or if price fell below the 14 day MA and a 20, I think this one's a 20, let me see this one, 22. And or price falls below a 14 day MA with the 22 negative sloping. So this one stopped me out on the severity of the entry day",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "if price fell below the 14 day MA and a 20, I think this one's a 20, let me see this one, 22. And or price falls below a 14 day MA with the 22 negative sloping. So this one stopped me out on the severity of the entry day move. And that's why I accident. And that's why I ended up re-entering today because it started essentially behaving as it should yet again. So I would not arbitrarily take the position down though. I think that that kind of does you a disservice. And for me, like I said, I typically like to use something like a like a 10 day 11 day 14 day, there's a million combinations. I'll get rid of this seven though, just so it's a little less noisy to give you an idea. The other thing I do like to use though is the the slope of moving averages. So the fact that that seven day MA essentially turned negative, let me go back and add it back in. I just want to show you specifically what I was looking out there. So I want this to be seven. And then I'm going to make this bad boy red. So the reason by the way that I do like red for this is because since I have like multiple moving averages, it literally helps me track a little more cleanly like Roy G bib. That's the old Roy G bib. So in this case,",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "make this bad boy red. So the reason by the way that I do like red for this is because since I have like multiple moving averages, it literally helps me track a little more cleanly like Roy G bib. That's the old Roy G bib. So in this case, you can see that this had a big negative day. But the seven day MA slope was still positive. Then you can see that this also had a pretty big red day, but the MA seven day MA slope was still positive. In this case, the seven day MA slope literally flipped negative. So that is not something that I take lightly. There's other tools that I use, but in this case, that's essentially a big part of the trigger. That's also why up here, as you can tell, like I actually have the various MA slopes. And you can codify this in essentially however you want. Let me see if I can find it. This one. So I have MA slopes for all different periods. So like I can add the seven day back in. And then essentially, I would add it down here as another input into this. But that's the idea at least behind using the moving average slopes. So yeah, long answer with a little bit of specifics around this example. But if I hit the profit target early, I do not immediately take the trade down. The trade is doing what I want. I want",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "But that's the idea at least behind using the moving average slopes. So yeah, long answer with a little bit of specifics around this example. But if I hit the profit target early, I do not immediately take the trade down. The trade is doing what I want. I want to let the trade work for as long as I can, as long as it continues to do what I want. That's the idea. Dr. Zayah says, what effect is price movement in the underlying have on each expiration cycle of the option chain nearest expiration will experience more change relative to the longer data, right? Sort of. Not inherently. So what example would I give you that would qualify the not inherently part? Do you have any ideas? And in the meantime, I'll pop this open and see if I can't add that that other slope in here. So what other criteria can you guys think of that would lead what they're talking about to not always be the case? Dr. Zayah says, I didn't have a ticker in my no, no, no, it's not specific to a ticker. What I'm actually talking about is a broader topic. It's definitely not something that's specific to a ticker, actually literally at all. So yeah, you don't have to worry about that. That's not what I'm referring to here. Volume? Nope, not volume. Good guess, but that ain't it. Earnings? Nope, not at either. Interesting. Very interesting. So no, the way",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "definitely not something that's specific to a ticker, actually literally at all. So yeah, you don't have to worry about that. That's not what I'm referring to here. Volume? Nope, not volume. Good guess, but that ain't it. Earnings? Nope, not at either. Interesting. Very interesting. So no, the way to think about it is I want you guys to think about Delta. And I want you guys to think about gamma. So where is Delta and where is gamma? How would those impact the decision on where we would see this example where I'm talking specifically about longer dated options, actually seeing potentially more of a move as compared to the shorter dated options. It is tied completely to Delta and to gamma. So what do you guys think? There's a specific time frame that we would see the options move a lot more on a relative basis as compared to other time frames, but it can flip when we look at something like Delta and gamma. Any ideas you guys? And in the meantime, we got our script back up so that you guys can see those other slopes. So you can see the 7-day, 22-day, 50, and 200. Intrinsic value is not correct. Benoit is the closest so far with closer to add the money. So let's take a look at an example. Let's pick a stock. Pick a stock, any stock. And let's go back in time. Roaring Titty says I'm not sure I understand the",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "200. Intrinsic value is not correct. Benoit is the closest so far with closer to add the money. So let's take a look at an example. Let's pick a stock. Pick a stock, any stock. And let's go back in time. Roaring Titty says I'm not sure I understand the question. Yeah, let me clarify. So I have to go back up. I lost the question. So Dr. Zeyes asked, what effect does price movement in the underlying have on each expiration cycle? The nearest expiration will experience more change relative to the longer dated. So what he's asking is if the price in, we got to pick something else, let's look at Lulu. So if the price in Lulu moves either direction up or down, they're postulating that that movement will impact the shorter term expiration more than the longer term expiration. And it's partially correct, partially incorrect. So I'm asking you guys to decipher the difference. What element of it is partially correct and what element is partially incorrect? Carlos speculates theta, which would be a great example of an incorrect answer. Re says via gamma, yes, percentage wise, closer. Closer. Dr. Zeyes says thank you for deep diving this love. And yeah, this is, it's a great question. This is, again, this is how people learn. So let's take a look at an example. If I buy this 350 call, and let's pretend we're in an alternate universe, where Lulu catches a bid and it goes up.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "diving this love. And yeah, this is, it's a great question. This is, again, this is how people learn. So let's take a look at an example. If I buy this 350 call, and let's pretend we're in an alternate universe, where Lulu catches a bid and it goes up. Right now, I buy these for 3.90 at the mid. Okay. What happens if I go out 431 days and I buy these 200s? And I buy these for 160, a 83 way more expensive. If we get a dollar move in Lulu, which one of those positions make more? Is it the 200 call that's out 431 days? Or is it, I forgot why expiration were in? Or the 350s that are at a 46 delta with four days to go. These are about as close as you can get before expiration. Which one of those would move more? Delta J Bingo. That's the first part of the equation. Right? Delta. Go back to the basics. Delta tells us the rate of change of in options premium. Reese says front expiry. Bad timing because you are wrong. And that it sucks. It sucks to be wrong. Now, actually, we can we can make Reese partially right here on a relative basis in terms of the cost of the option. They might make more money. That could be. But not in terms of a gross dollar amount. So these would make less money. Why? Well, they have a 46 delta.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "can we can make Reese partially right here on a relative basis in terms of the cost of the option. They might make more money. That could be. But not in terms of a gross dollar amount. So these would make less money. Why? Well, they have a 46 delta. So if Lulu goes up 1, let's just say that these are 4 for ease. Let's say you bought them at 4. If it goes up 1, these would give you 46 cents of profit. So your 4 are now worth 4.46. You've made 46. We go out here 431 days back into the 90 delta to the 200s. If Lulu goes up a dollar, you've made 90. Your way further out in time. But it is a 90 delta. So that means is Lulu moves up by 1. These options make 90 cents. The front expiration in that example, you've made 46 cents or 40 whatever since it was. So that is a prime example of how going further out in time, you can actually make more money than the near term. Benoit says, but those are hugely different position sizes on an equally on an equal equity basis sooner x-rays would always have a larger move. If you were to isolate it in that sense in terms of a percentage gain, yes. Well, it also would depend on how far out you go, right? It's a bit of a sliding scale. So for example, you can have a",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "sooner x-rays would always have a larger move. If you were to isolate it in that sense in terms of a percentage gain, yes. Well, it also would depend on how far out you go, right? It's a bit of a sliding scale. So for example, you can have a smaller variance between the options between the explorations. But yes, absolutely. Your point is correct on a percentage gain. You will see larger percentage gains on shorter data options. But again, this is the important part of being a thinking trader, right? Because the name of the game at the end of the year isn't what is the percentage gain on the portfolio? Would you want a 100 gain on a 1 portfolio or a 10 gain on a 100 portfolio? I would absolutely take the lower percent return on the larger principle yielding a larger dollar amount. So that's what I look for, even when I'm structuring things like my GameStop trades that I'm putting on. That's why I'm going further out in time is I'm going further in the money. I'm not going far out in time and then hanging out here in the ether because to a lot of your guys' point, which you're seeing very well, these will have a lower gamma. So these won't move as much. But if you have a high delta, you don't care so much about gamma. Because once delta gets to one, that's all it can do. So gamma only",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "lot of your guys' point, which you're seeing very well, these will have a lower gamma. So these won't move as much. But if you have a high delta, you don't care so much about gamma. Because once delta gets to one, that's all it can do. So gamma only starts to hurt you at that point if it goes against you, meaning if the underlying goes against you and gamma builds. But you might pay a larger principle up front, but it's also a little bit of a deductible because you're going really far in the money. There's a lot of intrinsic value. So if the underlying doesn't move, let's say it stays flat or goes up slightly, your extrinsic value, your cost of holding that position is not that high. Now you are paying a larger gross amount. So if the underlying is a big sweeping move against you, you do stand to lose more money. But again, that's the nature of being a trader. If you have an option that's at a one delta and you let it become a 30 delta, you've grossly fucked up. You've not done your job as a trader. So the way to think about aspirations is it's part of the equation along with deltas. But you can have longer expirated options that make more money than near term expiration options entirely possible. And you can have vice versa. You can have the inverse. You can have a near term option that",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "to think about aspirations is it's part of the equation along with deltas. But you can have longer expirated options that make more money than near term expiration options entirely possible. And you can have vice versa. You can have the inverse. You can have a near term option that makes a larger gross dollar amount than a longer dated option, also entirely possible. So delta is going to be one of the primary inputs you need to look at. Gamma is the next input that matters a lot. Benoit says, how do you think about capital allocation then? I generally try to be almost completely allocated. So I'd rather have the larger percent move if I have all my funds allocated. Do you? Is that actually what you would want? Which scenario would you make more money? So if we put equivalent size positions on and there's a specific tradeoff and the point emerges sooner or later that you'll notice. Let's go back to Lulu. And let's pretend we're structuring a trade to the downside because Lulu cannot catch a bid quite literally to save its life. So let's say you want to trade Lulu to the downside. And you want short term dated options because they expand more, but we're going to buy puts. And let's say, let's just pretend that this was more liquid. It's kind of super illiquid, but let's just pretend it was liquid. And let's say that we want to buy these 280s. We'll",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "you want short term dated options because they expand more, but we're going to buy puts. And let's say, let's just pretend that this was more liquid. It's kind of super illiquid, but let's just pretend it was liquid. And let's say that we want to buy these 280s. We'll analyze that with our risk profile. And then let's say that we want to go 98 days out and rather than those 280s, we buy the trifitties, analyze that. So now the first thing you could do to your point is you can say, well, I would want to put on the same size position. Okay. So then I'll let the dog in one second. I'll let the dog in one second. Here he is. In all his glory, I literally have to change this so that you guys can get a peek. All right. So here he is. He's ready to teach about options. He's well versed. Thank you. And he's ready to talk about shorting. Hey, attention. He's all right. So he yawning. The reason why he's yawning is because he's used to this. He kind of knows all this stuff. So he's a little bit bored. That's what I think. But we'll proceed anyways. So you could say, I want to structure these same size position. And you can do that. But let's talk about that in a second. Let's see what size move. If you just look at them at a one to one basis first,",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "what I think. But we'll proceed anyways. So you could say, I want to structure these same size position. And you can do that. But let's talk about that in a second. Let's see what size move. If you just look at them at a one to one basis first, and you'll see why I'm doing this. Let's see what size move you need in order for these near dated out of the money puts in order to make more money than the in the money puts. So in order to help us visualize that, I'm going to add a few different standard deviations. I'm going to use plus one and minus one. And this is just standard deviation move of the underlying price plus two minus two plus three minus three. Okay. So let's see. At a minus one standard deviation, you make three 17. At a minus two standard deviation, you make 1058. And at a minus three standard deviation, you make 2042. Let's go back to this one. If you make a one standard deviation down move, you make seven 84. So seven 84 compared to three 16 317, you make more here. 1777 on a two standard deviation move compared to 1053. So you still make more here. And then on a three standard deviation move, you make 2800 here versus 2000 here. So on a non similar size position in terms of capital outlay, but on a one to one basis, you can see how",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "standard deviation move compared to 1053. So you still make more here. And then on a three standard deviation move, you make 2800 here versus 2000 here. So on a non similar size position in terms of capital outlay, but on a one to one basis, you can see how the short dated option will compound much more given in a accommodating move. However, it won't outpace the profit side. So let's take a look at the next component then, which is you have the ability to size this trade up. Right. So if this cost me 6,345 bucks for this one individual position, you could put on like 63 of these. You could put on a ton. So that starts to look really good, doesn't it? Because then you can say, well, well, shit. If I get a one standard deviation move in my favor, I make 20 grand on the same size position. That seems fantastic. Does it not? Not so much. Why is that? Well, there's a really, really important difference here. Take a look at my theta on this trade, 4.99. That's on my one lot. If I do the same size trade, my theta is 1,144. So you can make way more money if you get your move in the correct amount of time. If you don't or if it's not a big enough move fast enough, theta will completely eat your lunch. And as time passes, so let's say your move doesn't happen on",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "1,144. So you can make way more money if you get your move in the correct amount of time. If you don't or if it's not a big enough move fast enough, theta will completely eat your lunch. And as time passes, so let's say your move doesn't happen on the first day, notice what just happened. If we look at, I want to see if I can keep that highlighted. If you have your 20,000 profit there, it just turned to 18,355 one day later. One day later, your max profit on that one standard deviation move just went down 1700. If it's two days later, it just went down another 4,000. This is exactly the issue and this is exactly the trade off. So going back to your question, Benoit, for me, I focus more on what kind of risk makes sense for my thesis and then structuring a position around that. So Benoit, if you take a look at that video that I made or the video I shared earlier, it walks through how I think of this. So Benoit says this is just another rehash of the buy better calls video. That's exactly correct. Yep, that's exactly correct. And it's because the way I think about it is it's not saying that further out in time is better. I don't want anybody to think that that's the conclusion I'm trying to draw with you guys because it's not, it's genuinely not what I'm trying to summarize",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "exactly correct. And it's because the way I think about it is it's not saying that further out in time is better. I don't want anybody to think that that's the conclusion I'm trying to draw with you guys because it's not, it's genuinely not what I'm trying to summarize to here. What I'm trying to summarize to is that based entirely on your expectations in disposition as a trader, you need to build and structure a corresponding trade that makes sense for you. That's the entire idea. So that is the punchline, at least to that question. Benoit, let me know if that makes sense. I have to turn off my house's air because it's blowing like crazy. You know, chill house. Any other questions on that? That was a great question, by the way, though. I'm really, really stoked. Okay, cool. So it sounds like that connected. Great. Sweet. So let's go back and kind of finish a quick walk through then of this example of this year building a strategy. So let's say that I want to trade stuff to the upside. If I'm looking for some sort of breakout idea and let's say you do a bunch of homework and you identify, you know, as you're going through SSRN and you're looking at all these different kinds of things. Let's say that you find that stocks that are making 52 week highs tend to have a drift component to them and to continue to make relative",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "bunch of homework and you identify, you know, as you're going through SSRN and you're looking at all these different kinds of things. Let's say that you find that stocks that are making 52 week highs tend to have a drift component to them and to continue to make relative highs. And if you're kind of picking up what I'm putting down, that's, it is an effect. I know it exists. It's a momentum effect. It's called a momentum premium. There's different ways to capitalize on it. So I'm giving you an example of a already baked profit function, which is what what this is. So from there, the first step here, let me see if I can like shrink this and keep it as we look through this. This might be like really difficult for you guys to see. So I'll kind of like talk about it as we look at stuff. But the purpose of the strategy in this case is we're building something that allows us to capitalize on upward price movement. We don't care yet if it's long premium, short premium, it doesn't matter. We just want something that allows us to make money if stock goes up. The profit mechanism that we're talking about, the direction is up. And we're looking for something that exhibits momentum premium. So we now need to, I guess we need to do like this is really where signal test would make sense, wouldn't it? I think that makes way",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "goes up. The profit mechanism that we're talking about, the direction is up. And we're looking for something that exhibits momentum premium. So we now need to, I guess we need to do like this is really where signal test would make sense, wouldn't it? I think that makes way more sense. Yeah. And then this would be more like a signal alignment. So Ridley says, so identify catalysts first, definitely. So the very well kind of the second step for me is to identify a profit mechanism. What do I think I can make money from? So again, in this case, we're talking about trying to trade something to the upside. So I would need to test that signal and there are different ways I can think about qualifying and quantifying that profit mechanism. So I can look at again, this one is kind of already done for the sake of time. But you can look at the performance of stocks. Let's say that have the highest PE ratios or the lowest price to book ratios or the lowest price to earnings growth ratios. If you wanted to use some fundamental tools, you could use stocks that are trading above 50 moving averages. So what I'm highlighting there is you can gain exposure to a lot of different things. And depending on how you want to quantify it, you can access it in slightly different ways. So in this case, like I said, I'm kind of giving you a",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "above 50 moving averages. So what I'm highlighting there is you can gain exposure to a lot of different things. And depending on how you want to quantify it, you can access it in slightly different ways. So in this case, like I said, I'm kind of giving you a already baked concept. And it's really just so that you can have an idea of what this looks like. So if I'm looking up this momentum premium idea, there's a couple of things that matter a lot to me. So do I still have this open? And we don't hear. We can use what I'm doing is I'm going through like my litany of studies. And I'm finding examples of momentum premium like this here. So this is an example of momentum premium. You can look for things that have specific parameters for an earnings release. And then you can essentially trade it in a bunch of different ways. I'm texting my wife real quick. She's hungry. So I just ordered her dinner. So in this case, you can look at host earnings. And there's a bunch of different criteria that can be met. And that becomes your signal. So things that have a gap up, things that tend to be smaller market cap stocks, meaning not mega cap stuff like that becomes part of your signal. And then you can test that any way that you want. So now let's use the next part of this example. We want",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "things that have a gap up, things that tend to be smaller market cap stocks, meaning not mega cap stuff like that becomes part of your signal. And then you can test that any way that you want. So now let's use the next part of this example. We want to trade things that go up. We know that we're trying to do some sort of momentum premium play. And in this example, rather than P, we're using the 52 week high criteria. We now can build a list of structures that allow us to trade to the upside. You guys already did this actually. So if you think about this kind of thing, what structures can apply here? Walk me through what you think what you think makes sense. And then in the meantime, Roindtiddy says, how do you do that for mergers acquisitions? You literally can test. You can find, you can create an entire list of companies, public companies that have undergone MA. And then you can look at price behavior pre post volatility behavior pre post. It's exactly what I would do. It's another very tradable thing, by the way. And also you can very frequently detect when there is a perspective MA process underway. If you take a look at the options chains, which are mega mega informative. So to recap the other structures that you guys already listed, there are things like long calls, buying shares, short puts. All of those can make sense",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "detect when there is a perspective MA process underway. If you take a look at the options chains, which are mega mega informative. So to recap the other structures that you guys already listed, there are things like long calls, buying shares, short puts. All of those can make sense if we're trying to trade something directionally to the upside. Okay, cool. So now we need to test them. So this is where I would run it through a series of back tests. The first thing I would do is say, okay, maybe for this 52 week high, I would look at sorting all stocks that are optionable. And in this case, I'm using weeklies just for liquidity measure. I'm going to sort them by those making the highest 52 week highs at a given point in time. And I'm going to essentially simulate purchasing the top 10 of them, the top desioli if you're selling client or really whatever number you want. And I'm just going to focus first on using the underlying itself, meaning buying shares. Or if I wanted to trade it to the downside, shorting shares. Why would I do that? If I'm testing kind of the profit potential and the ideally testing a bunch of different structures, why do you guys think I would do it that way? Starting with just the shares. Any ideas? There's a very specific reason. Because it's at the high, so it's uncertain. It's a good question, but no, that's",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "the profit potential and the ideally testing a bunch of different structures, why do you guys think I would do it that way? Starting with just the shares. Any ideas? There's a very specific reason. Because it's at the high, so it's uncertain. It's a good question, but no, that's not it. If it will break out, better risk management, another great guest, but also not correct. It's because I'm starting with this simplest concept. That's it. Shares are the simplest ways to trade this. So right now, I'm just trying to understand based on this profit mechanism that I think exists that I've tested with a couple different signals. I want to see how it performs if I just use the underlying, because remember, options essentially are just amplified versions of the underlying with a bunch of additional rules. So for example, if I buy shares and I make money with this structure, well, that already tells me something. It means that if I use options, it'll make money. It means that if I sell puts or buy calls, it'll make money. I already know what makes money because it makes money if the underlying goes up. But it becomes an assessment of quality. So for example, if I test long shares and I want to test holding for a week, two weeks, a month, two months, three months, six months, 12 months, something like that. I'm going to look for trends across all those different time frames. And",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "becomes an assessment of quality. So for example, if I test long shares and I want to test holding for a week, two weeks, a month, two months, three months, six months, 12 months, something like that. I'm going to look for trends across all those different time frames. And then I'm going to say, okay, well, it seems like based on this smattering of underlying that I bought, I would run literally overgrussian to see one with the correlation is in terms of what time frames make the most sense to hold and what kind of traits tend to perform the best. And then I can overlay and build some sort of option equivalent to that. It's harder to back test. Now, if you have the savvy, it's not that difficult. But you can absolutely use that as a starting point. And if you notice that your long shares make money and let's say that on average, you see a 5 drift over the following month. Well, now you have something to work with because if I know that there's a 5 average drift over the course of the following month, now I can say, well, does it make more sense to buy calls or more sense to sell puts? And you can do a simple comparison. So let's use this as an example. Let's say that we want to use VRT. And if I know that over the month, it's probably going to go up by 5. I",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "more sense to buy calls or more sense to sell puts? And you can do a simple comparison. So let's use this as an example. Let's say that we want to use VRT. And if I know that over the month, it's probably going to go up by 5. I could sell puts, let's say that I want to postulate selling like a 30 delta put here, collecting like 435 ish. And then let's say I want to buy a 70 delta call or I'm sorry 70 DTE, a 70 delta makes sense here, like 75 delta maybe, to like a 72 delta call. And it's 1555. So here's the first thing I need to determine. Based on the position here, which one do I like more? Do I want to outlay 1555 bucks? Maybe there's nothing wrong with that if your portfolio has room for it. Or you'd have to see what the margin requirement is for the 42.5 put, which in this case, it's 8,250 bucks. So in terms of capital utilization, you actually can use more from the long calls. And again, maybe it doesn't matter to you. Maybe you have the margin in there and you just don't care. But now we can then assess, well, if we get our 5 move, how does my short put do? I make 119 on my 82.5 outlay. If I get my 5 move to the upside on the calls, I get 336. And there's no margin requirements because",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "just don't care. But now we can then assess, well, if we get our 5 move, how does my short put do? I make 119 on my 82.5 outlay. If I get my 5 move to the upside on the calls, I get 336. And there's no margin requirements because you're going to pay for it in cash, which is 1555. So if you get your 5 move, which one of these is actually better? Well, if it moves in your favor, unequivocally, you make more money with the long calls. This is how you back into what makes sense. So now I would overlay the risk management. Let's say that I'm going to manage risk here at 8560, just because I think if it drops below that, it looks like it would probably head towards 8224 and I don't want to take it that far. So let's call it if there's a close below 85. So now what we can do is we can say, all right, well, if price goes to my stop point of 85, how do these perform? The long call, if it goes to, I guess I should wait, oh, duh, I'm an idiot. Sorry. My bad. If it goes to 85, in this case, you lose 325 bucks. And in this case, you lose 165. So you lose more money here if you get stopped out, but you also have the potential to make more money. So this is looking closer to a one",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "My bad. If it goes to 85, in this case, you lose 325 bucks. And in this case, you lose 165. So you lose more money here if you get stopped out, but you also have the potential to make more money. So this is looking closer to a one to one risk to reward profile. This is looking like a sub one risk to reward. This is the risk profile tab. Mrs. Royantity. This is a sub one. So now we have to take the next step, which is what's the probability of us getting this 5 up move versus this 85 or I'm sorry, this 85 price point stoppage. So now we can go to probability. And we can look at the probability of a touch. And we can look over the next month for like a normalized time frame. So using like the 16 aug maybe. And what's the probability of us being stopped out to the downside at 85? It is 83. And then what's the probability of us hitting that 95 handled to the upside? It's about 78. So now guess what? You literally have just created the input to a very important calculation, which would then be codified across all of the different strategies that you use, which is expected return, which is somewhere in here. I just don't know where. Where is that pesky expected return? Oh, I think it's up here more. Aha, finally, sorry. It took us a second to get",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "would then be codified across all of the different strategies that you use, which is expected return, which is somewhere in here. I just don't know where. Where is that pesky expected return? Oh, I think it's up here more. Aha, finally, sorry. It took us a second to get to this right here. So you now know what your win price would be. You now know the probability of getting that win. You now know what the loss would be. And you now know the probability of that loss. So you literally have all of the tools to answer this exact question of which of these strategies makes more sense in this individual trade. Now this is evaluating it against the concept of an individual trade, which ideally you would apply the structure, then strategy way more broadly. And you would have much more of a codified approach. But that's literally an overview of this process, kind of from start to finish. So I will take a pause there and see what questions you guys have. Anything in there that you want to dive a little bit deeper into. I am getting ready to order my dinner now, but it's not going to be here for at least a minute. So we can take a look at anything else that you guys would like to hit. We're doing I'm doing old spaghetti factory tonight. That's the move. Cool. Well, it looks like there are no questions popping up. I'm",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "it's not going to be here for at least a minute. So we can take a look at anything else that you guys would like to hit. We're doing I'm doing old spaghetti factory tonight. That's the move. Cool. Well, it looks like there are no questions popping up. I'm happy to hang out for a couple more minutes. If you guys have anything that does pop up. Yeah, let's take a look. A count guy to says, could you look at my question above about the parameter? I didn't see it. Can you post it again for me down here? I totally missed it. And then in the meantime, Banovaire Plains, I like your plans to you. Is can you talk about cash secured puts? Yeah, sure. What about cash secured puts? Let me know what you want to dive into. Chewie says does that work with your DTE? Of course. The process is agnostic to everything. It's again, it's a probabilistic assessment. But yeah, the process itself is essentially standardized. So that's the point of building an approach like that is you don't have to go through a lot of different stages realistically. You can kind of codify what works well to test a lot of different concepts. So a fan of airplanes, what's your approach for using CSPs? Really, I only use them as part of the coverage triangle. And that's if I'm looking to accumulate positions. It's less so as a method to acquire shares. It's",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "what works well to test a lot of different concepts. So a fan of airplanes, what's your approach for using CSPs? Really, I only use them as part of the coverage triangle. And that's if I'm looking to accumulate positions. It's less so as a method to acquire shares. It's more so a method to try to capture risk premium in something that I fully anticipate to build out. However, I do not in general run a lot of CSPs. I'm even finding myself more and more as of late with the way that the market is behaving recently. Spending way more time trading things like the ratio called diagonals. I'm not like fully out of using something like the coverage triangle, obviously. But what I'm doing in a pretty big way is trying to use the indices more and more. And a lot of that is to just be more tax efficient. And when you're trading the indices themselves, they do not have options or an underlying that you can trade. So yeah, I think I think that's kind of like the long and short of it. Accounting guy, wondering if you've tried estimating parameters for a Heston model for option pricing. I'm trying to build a money carless in but not getting real estate results. Yeah, that's the problem that you likely will have if you're going through the process and trying to estimate your own wall. Heston is okay, but it misses a ton of stuff. So",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "for option pricing. I'm trying to build a money carless in but not getting real estate results. Yeah, that's the problem that you likely will have if you're going through the process and trying to estimate your own wall. Heston is okay, but it misses a ton of stuff. So I think I think most people that are trying to estimate their own wall are using some sort of variation of a garsh model. But even those you need to include some sort of jump diffusion because accounting for gaps is really, really, really, really important. So something you can tinker with is this website from New York University Stern. And you can take a look at a bunch of different kinds of wall models that they tinker with. And you can see what seems to represent the world a little bit better for you. And then you can essentially see what you want to replicate from this, at least as a starting point. But the Heston, it's too simplistic. It misses too much. So yes, I have used it, but it does not surprise me that you're not getting real estate results. Dr. Zayas says, I'm wondering about IRA accounts, pros and cons of IRA account for trading options. Yeah, that's totally fine. I trade options in an IRA account. There are slightly different rules that go along with it. I actually literally think I have videos on trading options in an IRA. You see, I do a little",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "accounts, pros and cons of IRA account for trading options. Yeah, that's totally fine. I trade options in an IRA account. There are slightly different rules that go along with it. I actually literally think I have videos on trading options in an IRA. You see, I do a little bit old, but I think it's still probably, probably right. So there's that video that is, yeah, it's definitely much older. But yeah, you just have to change the approach a little bit is what it boils down to. But I use I use a IRA literally all the time for trading. It's less frequent, but I'll still look at it every couple weeks, week, every other week, something like that. And the only broader concept there is less so like if it makes sense to trade in an IRA, because of course it does, especially if it's a Roth IRA, something that's tax deferred, depending on what your tax footprint looks like going forward. I'm obviously not a tax professional, not a financial professional, nothing I say should be taking his financial advice. I don't know what the fuck I'm talking about. But you can look at how an IRA fits into your life because a big drawback to IRAs is when you want to access it. And there's kind of a liquidity cost to it because you can't get into them. Now going further down the IRA, but hold there's a lot of gaps you can take advantage",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "IRA fits into your life because a big drawback to IRAs is when you want to access it. And there's kind of a liquidity cost to it because you can't get into them. Now going further down the IRA, but hold there's a lot of gaps you can take advantage of. There's different rules you can exploit that are perfectly legal. But like for example, with an IRA, if you want to access it early, you can use it to buy your house if it's your first house. Like towards your first house, there's more rules to it. I don't know, because I never got to use it myself. But that's just a way you can tap into it a little bit early. So the tricky part with IRAs is it pertains to being a trader is if your aspiration is to retire early, which I think that's the whole point of doing this, then an IRA is kind of tricky because you definitely want the money there for when you get older, but you also can't access it quite as much. TG says I found the Black Sholes Model EM expected move numbers for your DTESPX options are very misleading. I don't see how they're misleading. And that's I don't understand how the Black Sholes Model in there fits in for you unless you just mean using Black Sholes to derive what the expected move is or how you're arriving at the expected move. I'm not sure you have",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "misleading. I don't see how they're misleading. And that's I don't understand how the Black Sholes Model in there fits in for you unless you just mean using Black Sholes to derive what the expected move is or how you're arriving at the expected move. I'm not sure you have to give me more detail than that. Happy to take a look at it, but I do not know exactly what you're referring to. Back up to the top paper cut. Tell me why I shouldn't go deep in the money calls three months out for Sophie. Seems really good for those right now. Let's see. Let's take a look at some so five. So five. I mean, the short answer is because it's going down. If you buy calls, you want the underlying to go up. And right now the underlying as you see it here is not going up. So that is the short answer on why going deep in the money three months out for Sophie may not make sense is because it's not going up. And idea. Roryntitty says what about using Otoco? That's actually this sounds like a dance. That's fun. I like that and using my limits and stops it. Yeah, I think that's okay. You can use those kinds of orders. So you just have to be really, really careful. And what she's referring to, by the way, is a complex order type. And she's linking two of them. So there's a trigger",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "using my limits and stops it. Yeah, I think that's okay. You can use those kinds of orders. So you just have to be really, really careful. And what she's referring to, by the way, is a complex order type. And she's linking two of them. So there's a trigger order. And then there's a cancel. So the idea there is to set up kind of a string of things that automatically executes her wishes with respect to an individual position that's on. And there's nothing wrong with it. You just have to make sure that it's structured really well and it makes sense. And you have to understand the liquidity impacts of it. I actually talked about a liquidity impact for something as simple as a stop limit on zero DTEs that I run. And I think I talked about that during the live session Monday, maybe something like that. But yeah, there's absolutely nothing wrong with it. Ries says, would you ever take a bullish stance on hood? Fuck no. Fucking hate Robinhood. I hope like this is just before the down move. Like this is all just stupid noise before Robinhood goes bankrupt down to zero. That's the only direction that this thing can go. It is the dumbest looking stock. I hate its face. I hate the fact that it thinks it can go up when it can't. Look at this. Look at this. 10 years ago. Well, it's not that long ago. When was this?",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "the only direction that this thing can go. It is the dumbest looking stock. I hate its face. I hate the fact that it thinks it can go up when it can't. Look at this. Look at this. 10 years ago. Well, it's not that long ago. When was this? 21 high 85 down to the dirt to nothing. Stupid stock. It's so dumb. So everything about it is stupid. Look at this negative. It's got price that yeah, it's just it's I hate it. Stupid stock. 7 to 24. It wishes. So now there's no way I can ever be bullish on Robinhood. That's one of my very few things that I've decided I will always perpetually hate. And this is now gained my eye which I hate this period. So stupid. Nick says Robinhood turned off the buy button. Yeah, I hate that they did that. I hate the way that they manage their margin. I hate the way that they route their options. I literally hate their face. So yeah, dig it. Back up. Shared where says can you review AMD 19 July Xpery does 180 straight look like strong support. I don't know what that means. If like the options themselves serve as support. I don't really know the I don't know your question shared where's happy to talk about it, but I don't really know what it means. Michael says do you see shares of Nvidia lower by options. I also don't know what that",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "If like the options themselves serve as support. I don't really know the I don't know your question shared where's happy to talk about it, but I don't really know what it means. Michael says do you see shares of Nvidia lower by options. I also don't know what that means. You all are asking fucking questions that I cannot interpret. Let's see. Do you see shares of Nvidia lower by options? Yeah, I've no idea what that means. Do you mean do I. I'm super confused. Yeah, sorry, Michael, if you can restate your question, I'm happy to answer it, but I have no idea. Okay, that's completely different. Can you review options chain AMD July 19 Xpery does look bullish? Okay, so the first thing is that the options chain itself isn't what I would worry about looking bullish. It's the stock options are derivatives and their value is tied to the stock. So in this case, right now in general, it looks like AMD is going through a little bit of a cycling period. And it looks like it's still ascending, which is good news. But it looks like it's rotating over. I do like the moving averages. Those look good. Six month timeframe. It's definitely declining. Three month timeframe. It's got a nice pop here, but before that, it was relatively static. Yeah, so it very cleanly broke above that 171 handle. So this looks like, yeah, it looks like it's kind of rolling over and",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "averages. Those look good. Six month timeframe. It's definitely declining. Three month timeframe. It's got a nice pop here, but before that, it was relatively static. Yeah, so it very cleanly broke above that 171 handle. So this looks like, yeah, it looks like it's kind of rolling over and consolidating a little bit from just like a technical perspective. It does look like it's starting to catch a bid probably with the broader tech picture, but it's still in a general downslope, which I don't love. That's kind of like wind in its face as I would consider it. And then looking at the options in general, I really, really slight call, oh, I skew very slight though, not much. Much more active call trading on the 12 July's really short term. It has earnings coming up on the 30th. I think that'll be pretty important. We can see how it's done on its previous earnings. Down on the last one down on the one before there up, down, down, up, down, up. So kind of a general split. Earnings has been coming down though, which I don't love. What is this January? So January to January though is slightly up. So you're over year there, that's not bad. And then April. Yeah. So Cliff Notes version is, it looks kind of like a mixed bag. It looks like it's going through a little bit of a consolidation period here. And it looks like it's kind of following along",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "slightly up. So you're over year there, that's not bad. And then April. Yeah. So Cliff Notes version is, it looks kind of like a mixed bag. It looks like it's going through a little bit of a consolidation period here. And it looks like it's kind of following along with what tech is doing. So Dr. Say is says, do you think it's really in a downtrend? I see that downtrend is people taking their profits and then finding a temple bottom. It could do that. But again, like, it doesn't matter why it's in a downtrend, right? Like a downtrend is a downtrend. It's a thing for a reason. Now in a long-term timeframe, it's very clearly in an uptrend. So like this is okay. But like this here is a downtrend, whether it's because they're selling to take profits and it's going to form a bottom here if they're selling because they're sad and they want to buy a puppy. It doesn't matter. What matters is if you want something to go up and it's going down, you lose money. So the origin of the downtrend doesn't matter until it's not a downtrend anymore. So when I look at something like this, it's starting to pivot, right? Like this on a six-month daily is a downtrend. It's going down. But it did base heavily here and it is absolutely starting to go up. But it has some near-term resistance to break through still. It's facing expanding, selling",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "look at something like this, it's starting to pivot, right? Like this on a six-month daily is a downtrend. It's going down. But it did base heavily here and it is absolutely starting to go up. But it has some near-term resistance to break through still. It's facing expanding, selling volume, which really supports your thesis in terms of people kind of taking profits and unwinding positions. But in that short-term timeframe, it very much is in a downtrend. In this case, three months, uptrend, for sure. And I think the broader component is it really depends on the timeframe that like the trade is being looked at for. And in this case, short-term timeframe, it does not look like this is going to the moon. It looks like it had a really large sympathetic move with broader tech. That's a lot of what I see here. And it does have earnings coming up on the 30th. So Dr. Zayah says, yep, I was looking at it at a longer timeframe. Yeah, yeah, yeah, definitely. On a longer time frame, it for sure has an uptrend. But that question really goes back to like, what's the trade or trying to do? If you're trying to trade this thing to the upside-long term, then yeah, that's totally cool. If you're trying to trade it shorter-term time frames, then this looks like it's trying to go up and it looks like it wants to and it looks like it's starting. But again,",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "do? If you're trying to trade this thing to the upside-long term, then yeah, that's totally cool. If you're trying to trade it shorter-term time frames, then this looks like it's trying to go up and it looks like it wants to and it looks like it's starting. But again, depending on the time frame, it's flattening out here, starting to turn over. And then on a six-month time frame, it's again, just starting this breakout phase. So a lot of it will depend on how it behaves in here. My expectation would be that it would probably base in this level a little bit like 171 to 186 until it can get a break above 186. And then my guess is it would want to run up towards here like the 213 to 15 handle, something like that. So we will see. Rointit says, can our strategy be do whatever Nancy Pelosi does? How do you back test that? Yeah, that is literally an ideal strategy as I think about it. And her timing, I mean, she's just literally a, you know, she's just so good at timing. It's the kind of like, look at it and you're like, man, how are you doing so good? And she continues to do just so great. Inspiring really, one of the best traders of our lifetime, we think it might be Rointitty, little did we know it's Nancy Pelosi and her husband. But you know, that's just because of all the",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "man, how are you doing so good? And she continues to do just so great. Inspiring really, one of the best traders of our lifetime, we think it might be Rointitty, little did we know it's Nancy Pelosi and her husband. But you know, that's just because of all the hard work and dedication that they put into the craft that is probably nothing to do with information availability or anything like that. There's no way. Impossible. Literally an impossibility. All right, you guys. I think this now is my next longest live stream ever. This is almost two and a half hours, but I love this stuff. I love connecting with you guys. I love talking about this all. I do have a live stream tomorrow with my boy Newton, where we are going to talk more game stop. We want to get a little bit deeper into some more of the structural components behind it. And then we also want to spend a bit of time getting into kind of current state analysis of what it's looking like. So that is the game plan right now for tomorrow. As always, you guys know what to find me? I'm in our discord. You guys should absolutely join if you're not in there. It's completely free to get in. And then I will see you guys at the live stream tomorrow. I'll see the outlier pro members during the live stream on Sunday. And then I'll see everybody else on",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  },
  {
    "text": "in our discord. You guys should absolutely join if you're not in there. It's completely free to get in. And then I will see you guys at the live stream tomorrow. I'll see the outlier pro members during the live stream on Sunday. And then I'll see everybody else on the live stream on Monday. We got all sorts of shit coming out all the time. So as always, being outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "QQ5DeQdx0yo",
      "title": "End to End Trade Building | Options Trading for Beginners Pt6",
      "url": "https://www.youtube.com/watch?v=QQ5DeQdx0yo",
      "upload_date": "",
      "duration": 8477.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 103,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=QQ5DeQdx0yo&t=0"
    }
  }
]