[
  {
    "text": "Let's talk about the wheel versus my favorite the coverage triangle. I wanted to show you an example of why I tend to prefer the coverage triangle, not saying that the wheel is bad, but for the way that I trade, the coverage triangle tends to be a little more optimal. Now first, let's start with level setting. What's the difference between the two? It's really my new. The primary difference between the wheel and the coverage triangle is when we're selling additional short puts. So they both start with a cash secured put. You can manage this cash secure put however you like to manage puts. So for me, I have different profit and loss taking metrics, normally around 60 credit received, or if I'm within a certain time frame, I might look to manage the trade kind of like I have outlined in my main video on the coverage triangle. Now let's say we continue to deploy the cash secured put until we're assigned at that point, we would look to sell a covered call. That's the same in both strategies. However, this is where the difference emerges. Once we sell that covered call, in the wheel, we stay there. We continue to sell short calls against our long stock position that we were assigned on until it goes away. In the covered strangle, while that covered call is working, we would sell additional cash secured puts. And this is the primary reason why I like the coverage",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 18,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=0"
    }
  },
  {
    "text": "stay there. We continue to sell short calls against our long stock position that we were assigned on until it goes away. In the covered strangle, while that covered call is working, we would sell additional cash secured puts. And this is the primary reason why I like the coverage triangle because it allows us to remain a little more sensitive to price. It also allows us to be more active and get more trades on to realize more profits. So let's take a look at an example. What I did was I went into think back. This is December 2nd of 2015 right here. So that's what this chart is. And then this is where I just neutralized the position. It definitely would have gone on longer. I just made an assumption in terms of the short calls being assigned and coming off so that we could just kind of talk about it. Now, what I want to walk through is why I chose this time frame. One, it was random. I literally picked a random time frame because I think that's helpful. But I did look for something that I knew that there was a drop included because that's really where the risk lies in the strategy. So if I had just picked a scenario where you know, the price was just going up, we would just be essentially selling the same short puts. So I wanted to walk through when we're actually managing the trade taking stock",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 18,
      "start_timestamp": "00:01:36",
      "start_timestamp_seconds": 96.88888888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=96"
    }
  },
  {
    "text": "that's really where the risk lies in the strategy. So if I had just picked a scenario where you know, the price was just going up, we would just be essentially selling the same short puts. So I wanted to walk through when we're actually managing the trade taking stock and things like that. So this was the outcome. I will go through the details of the trades and whatnot in just a second, but I thought I would give you what happened up front. And as you can see, the total PNL for the covered strangle is 952 bucks. This is assuming a 30,000 account. And that walks out at around a 3 return on invested capital from December 15 until about May 16, 2016. And then this is the wheel. And they came out at about 788 and a 2.63 return. So not a big difference. But again, there's a really significant limitation in this study in that I didn't actually wait until the trade was neutralized. I just neutralized it at the end. So what that means is this strategy would have had additional cash secured puts tied on to it that this one didn't, but I didn't want to have this really long study that nobody could really have the attention span a little walk through. So this will serve the purpose for now of really displaying the point I made earlier in terms of being more active. So what we have here is the very",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 18,
      "start_timestamp": "00:03:13",
      "start_timestamp_seconds": 193.77777777777777,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=193"
    }
  },
  {
    "text": "didn't want to have this really long study that nobody could really have the attention span a little walk through. So this will serve the purpose for now of really displaying the point I made earlier in terms of being more active. So what we have here is the very first trade. So let's take a look at what this actually was. So what I did again, I went back to December, I think first or second, let's just go to the first. And this is on demand. So I'm literally flipping through time. So this is the day that we entered the position. And this is the first position that was entered on both sides. I WM was trading what around one, call it 119. And on both sides, I sold one of I'm sorry, on the coverage strangles side, I sold one of the 8 Jan 16 116 puts collecting 1.38. And then the only difference on the wheel side is I did two. And the reason for this is that's kind of one of the primary differences between the wheel and the coverage triangle is we're going to use more capital up front because we're not necessarily planning on adding more short puts as the trade continues. So in order to really have any sort of near peer comparison here, you would need to use more money in this this strategy up front. Otherwise, it will just get completely blown away by what you can do with",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 18,
      "start_timestamp": "00:04:50",
      "start_timestamp_seconds": 290.66666666666663,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=290"
    }
  },
  {
    "text": "planning on adding more short puts as the trade continues. So in order to really have any sort of near peer comparison here, you would need to use more money in this this strategy up front. Otherwise, it will just get completely blown away by what you can do with the coverage triangle. So that's why I went with a two lot there compared to the one lot that you see in the coverage strangle because on the coverage strangle side, we are anticipating part of our management plan is to scale into the trade as it goes against us via those additional cash secured puts. Okay, so this is the first trade. Now I am going to fast forward time. What I did since we have no existing position on right now, I literally just went straight to expiration. Now what I will mention is we could most certainly have a discussion around when we would manage the puts, how many of them we would get on and things like that. But again, just for the nature of the study, keeping it relatively simple for at least this iteration, I went to expiration on the first short put. So that led us immediately to getting assigned because again, we entered that trade before that drop as you will remember if we take a look here, right? So we enter here and then we go through a drop. So that's why we are already getting assigned. Now I'm going to",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 18,
      "start_timestamp": "00:06:27",
      "start_timestamp_seconds": 387.55555555555554,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=387"
    }
  },
  {
    "text": "that led us immediately to getting assigned because again, we entered that trade before that drop as you will remember if we take a look here, right? So we enter here and then we go through a drop. So that's why we are already getting assigned. Now I'm going to bring over kind of my working Excel sheet that I made just for this. Like I said, it's kind of simple, but I didn't want to overcomplicated here for the sake of the conversation. So here's where we originally started and that was selling those short puts at this point, we just fast forward to 11 Jan, this is the week of expiration of or I'm sorry, this is after expiration. So our puts expired on 8 Jan, which was that weekend right here. And essentially, we would have been assigned on the 9th on Saturday and then this is the next trading day that we could take a look. So what we're going to do now is literally go through the trade essentially as I was comparing them. So now it's 11 Jan first trading day at this point in time, we are going to have 100 shares on the coverage strangle and then we're going to have 200 shares on the wheel. Now on the wheel side of things at this point in time, we would be looking to sell short calls, same thing for the coverage strangle. But what you'll notice is we're trading down at 102.",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 18,
      "start_timestamp": "00:08:04",
      "start_timestamp_seconds": 484.44444444444446,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=484"
    }
  },
  {
    "text": "the coverage strangle and then we're going to have 200 shares on the wheel. Now on the wheel side of things at this point in time, we would be looking to sell short calls, same thing for the coverage strangle. But what you'll notice is we're trading down at 102. So let's take a look at what possible short calls we have better at our basis, we're at the 116, we're going to get 9 cents. There's no short call to sell here in my opinion. If you wanted to make 9 on that short call, you could, but I do not think it's worth capping the upside, especially limiting what you could sell it for. If you get a move in your favor, it's just too little money. So in this instance for both, I chose not to sell a short call. Now it's worth noting, my protocol for selling short calls is essentially the same in both of these. I'm applying the same paradigm, the main difference here is I can sell two of them over here, and I can only sell one of them in the wheel, because I only have 100 shares. Alright, so that is this trade has now come off the table because we were assigned on those. And at this point in time, we have 100 shares here, 200 shares on the wheel, which is purple. Now what I had on was this, I added on 11, Jen, so that would be the",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 18,
      "start_timestamp": "00:09:41",
      "start_timestamp_seconds": 581.3333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=581"
    }
  },
  {
    "text": "this trade has now come off the table because we were assigned on those. And at this point in time, we have 100 shares here, 200 shares on the wheel, which is purple. Now what I had on was this, I added on 11, Jen, so that would be the day that we're looking at right now, I added the 26, fab 100 puts collecting 2.50. So the reason why I'm doing this is multiple fold. The first one is if I get assigned, we will reduce our strike significantly. We're going to come from 100 shares at 116 to 200 shares at 108. So we get a pretty good reduction in our basis, if we're assigned as compared to this scenario. The other thing is we're collecting another 2.50. We're continuing to realize profits, not just yet obviously if we sell that put it's open. But once we get to the point where we're going to realize the profits, you'll see what I mean. Alright, so now I'm going to fast forward to 26, fab. I'm going to go straight to the expiration here. Now the reason why I'm going straight to the expiration on this is because I before I did this video, I flipped through each week to see if there was a place to sell short calls against the positions and there wasn't. And you'll see why it continues to stay pretty much suppressed. So I'm just saving you all time by telling you, I looked",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 18,
      "start_timestamp": "00:11:18",
      "start_timestamp_seconds": 678.2222222222223,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=678"
    }
  },
  {
    "text": "before I did this video, I flipped through each week to see if there was a place to sell short calls against the positions and there wasn't. And you'll see why it continues to stay pretty much suppressed. So I'm just saving you all time by telling you, I looked each week, but there wasn't a great opportunity to sell short calls. And again, you'll see that in just a second. So we just fast forwarded now it should be 26, fab. So we got assigned originally over, let's double check the date just to be sure we got a sign on the 9th of January is where we saw the first. So somewhere in here. And as you can see, we didn't have a short call that looked good there. We definitely didn't have a short call that looked anywhere in here. It went lower and literally went lower. So this is now expiration of our short puts that we sold on the coverage stringle side. And on this day, they were trading, essentially, I could have let them expired, but I didn't I just decided to take them down for a penny. So at this point in time, quick trade recap, we are sitting on 200 shares at 116 in the wheel. There is no short call available to us. So nothing to do here on the wheel. We now just secured profits on our second cash secured put. So this takes our realized gain, we have the",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 18,
      "start_timestamp": "00:12:55",
      "start_timestamp_seconds": 775.1111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=775"
    }
  },
  {
    "text": "quick trade recap, we are sitting on 200 shares at 116 in the wheel. There is no short call available to us. So nothing to do here on the wheel. We now just secured profits on our second cash secured put. So this takes our realized gain, we have the 250 realized as well as the 138 from when we were assigned again. And that's where we're at right now. Quick caveat that I didn't go over before on the wheel side, we would have realized the 276 profit from those two short puts that we sold. So overall realized PNL in the wheel up until this point is 276. And then realized PNL is on the coverage stringle side is 387. So I just did the math right there real quick for you all. So we have 387 realized here 276 realized here 200 shares out the door on the coverage stringle. Okay, so we've just realized the PNL there. Now I am going to scoot us forward to the next trading day. So that would have been Friday expiration. We're just going to fast forward real quick to 29 Feb. And on 29 Feb, I sold another cash secured put. So this time we put out the 8 April 100s again collecting a 1.82. And now what I'm going to do is just show you what I'm looking at for selling covered calls because we still don't have any covered calls out. Now again, we're at the 116",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 18,
      "start_timestamp": "00:14:32",
      "start_timestamp_seconds": 872.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=872"
    }
  },
  {
    "text": "secured put. So this time we put out the 8 April 100s again collecting a 1.82. And now what I'm going to do is just show you what I'm looking at for selling covered calls because we still don't have any covered calls out. Now again, we're at the 116 basis. So let's say we're going out 46 days. We got to go to the 116 to see what we can get. And you can get a nickel. That's to break even on the stock. And then you would collect obviously the premium there again, simply not enough to make it worthwhile. So what I did was I did the same thing as before. I looked at when we could kind of have a viable point to add short calls, which I found on the 21st of March. So let's go to the 21st. And then I want to walk you through my thought process here. So now we're fast forward to the 21st of March. We were assigned at 116 on the 9th. So again, somewhere right in here. And now we're finally starting to get kind of improved on our underlying to our basis. The underlying at this point, trading for like 109 and change. So let's pause this and take a look. Let's say we got 60 days. And let's take a look at our 116s. At our basis, we could sell a call against our position for 51 cents, something like that. In my opinion, if",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 18,
      "start_timestamp": "00:16:08",
      "start_timestamp_seconds": 968.8888888888889,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=968"
    }
  },
  {
    "text": "point, trading for like 109 and change. So let's pause this and take a look. Let's say we got 60 days. And let's take a look at our 116s. At our basis, we could sell a call against our position for 51 cents, something like that. In my opinion, if I was deploying the strategy, I would not offer calls here yet. They are still very far out of the money. If I was trading the wheel, I might send these calls out because I'm not making any money at this point in the wheel. I'm just holding on to long stock, not the end of the world, but not making a bunch of money. Whereas on the on the coverage strangle, I'm still generating returns via the cash security put side of things. So I would be even less inclined to add short calls out because you're getting pennies on the dollar. Essentially, this is at our basis. There is an opportunity cost to be holding the stock for this period of time even so far. So in order to make any money here, we would essentially have to sell right at our basis. So what that means is on the wheel, you would make 100 and you would make no money on the stock. To me, that's not a great payout. I would prefer to wait. And this is one of the reasons why I trade something like I WM because I don't care about waiting. It's a",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 18,
      "start_timestamp": "00:17:45",
      "start_timestamp_seconds": 1065.7777777777778,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1065"
    }
  },
  {
    "text": "on the wheel, you would make 100 and you would make no money on the stock. To me, that's not a great payout. I would prefer to wait. And this is one of the reasons why I trade something like I WM because I don't care about waiting. It's a good product. It has inherent diversification. So that is what I chose to do in this example is wait. So now I'm going to fast forward to eight April, which is the expiration for those short puts. Again, I did not see any really attractive short call offerings. And just to show that I'm not, you know, just picking and choosing random dates that look good, I will show you the chart. It went down afterwards. So the short calls that we just evaluated and we did got worse essentially. So let's take a look now at what we have going on. So it's eight April, we're going to collect this 182 because our short put is at 100 and the underlying is trading at 109. Again, you could conceivably just let them go into go to expiration, keep it all, but I closed them out. So now what I'm going to do is I'm going to move to the next trading day, which would be Monday. The 11th. So here I'm looking to see if I'm going to sell more short puts or if there's a covered call offering. Again, we already evaluated the covered call scenario. There isn't",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 18,
      "start_timestamp": "00:19:22",
      "start_timestamp_seconds": 1162.6666666666665,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1162"
    }
  },
  {
    "text": "going to do is I'm going to move to the next trading day, which would be Monday. The 11th. So here I'm looking to see if I'm going to sell more short puts or if there's a covered call offering. Again, we already evaluated the covered call scenario. There isn't anything here that looks good to me. So what I did was add more short puts. So I did the 20 May 105 short puts for 1.29. So at this point in time, I essentially will have realized profit on three rounds of short puts totaling 568. I have another 2128 out. And notice that all of these short puts that I'm doing would offer me the ability to lower my basis if I was assigned on the wheel. We are still waiting for a good point in order to sell short calls. So what I did was as I found a time to start looking at some short calls. So on 11 April, we already took a look. So let's go to 9 May. So again, what I did was as I just fast forward time before I did the video to look for a period where selling short calls started to look attractive. That turned out to be 9 May. Again, you'll see the chart reflect that in the first and second. As soon as it updates. All right. So the chart is taking an eternity to update. This is kind of one of the plagues of doing",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 18,
      "start_timestamp": "00:20:59",
      "start_timestamp_seconds": 1259.5555555555554,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1259"
    }
  },
  {
    "text": "calls started to look attractive. That turned out to be 9 May. Again, you'll see the chart reflect that in the first and second. As soon as it updates. All right. So the chart is taking an eternity to update. This is kind of one of the plagues of doing think back or on demand. That's okay. Because we can see where it's currently trading out, which is 117. So what I did was is actually evaluated some short call options. And I think let's see what I actually went with for both of them. I won with the 30 June's. So what I did was is I went out 52 days. And then again, our basis right now would be giving us a dollar and change. So I went out 2 to get 58 cents. Now I know what you're saying. You said you're saying Eric, you could have gotten 50 cents before. Why didn't you do it? But you're doing it now. It's because I'm giving the stock appreciation room. So when it was trading at 50 cents before, it was at our basis. We would make 0 on the stock. In this scenario, we're going to be able to collect 50 something bucks. But then also we have two dollars of capital gain space for the stock. So it's exactly why I chose that scenario. Now to kind of wrap this thing up, I just went fast forwarded to 20 May and essentially neutralized everything assuming best",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 18,
      "start_timestamp": "00:22:36",
      "start_timestamp_seconds": 1356.4444444444446,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1356"
    }
  },
  {
    "text": "able to collect 50 something bucks. But then also we have two dollars of capital gain space for the stock. So it's exactly why I chose that scenario. Now to kind of wrap this thing up, I just went fast forwarded to 20 May and essentially neutralized everything assuming best case scenario. So let's say we go to 20 May and what happened, what would have happened here if this was expiration for everything is I would have made the money on the short puts on 20 May. That is definitive. It's simply because that's where I went and these would have expired out of the money. So that leaves us overall a short put PNL of 696. Now I went with the assumption that on 30 June, these would have expired for a profit. We can take a look right now. I'm pretty sure that they would have expired in the money or close to it. And let's see. So it looks like it was at 114. So we would have been slightly out of the money. Essentially all that would have happened is we would have collected money on both of these short calls, realized that profit offered new short calls at a higher point as well as offered additional short puts. But again, I didn't want to go too crazy with the example here. It's already a 20 minute long video. But I wanted to show you a really important aspect, which is by trading the coverage",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 18,
      "start_timestamp": "00:24:13",
      "start_timestamp_seconds": 1453.3333333333335,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1453"
    }
  },
  {
    "text": "new short calls at a higher point as well as offered additional short puts. But again, I didn't want to go too crazy with the example here. It's already a 20 minute long video. But I wanted to show you a really important aspect, which is by trading the coverage strangle, we can be a lot more active in realizing profits and we offer the ability for us to reduce our overall basis once we're assigned on subsequent short puts. Now the one potential upside for something like the wheel is let's say we're trading around where we are right now in the example and it's 114. You could choose to only sell one short call at your basis. So you could say I'm going to sell one short call at 116. I'm going to leave 100 shares open. And then you have the ability to appreciate more on the upside than you would on the coverage strangle example. So there are ways to optimize both of them. But again, just based on my experience trading both of these strategies, the reasons why I explained to you are explicitly why I gravitate to the coverage strangle because bear markets are when we crash tend to last for a pretty long period of time. It's something like 290 something days. I just did a video on it not too long ago. So they allow me to stay more active, reduce my basis more effectively. And overall, I am a big advocate,",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 18,
      "start_timestamp": "00:25:50",
      "start_timestamp_seconds": 1550.2222222222222,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1550"
    }
  },
  {
    "text": "when we crash tend to last for a pretty long period of time. It's something like 290 something days. I just did a video on it not too long ago. So they allow me to stay more active, reduce my basis more effectively. And overall, I am a big advocate, really, of either of these strategies. But I think that the coverage strangle slightly edges it out for the reasons I share. As always, if there's any questions or anything that you all want to see me go over, let me know. Hit me up in the contact info in the video description. And until next time, be an outlier.",
    "metadata": {
      "video_id": "qufmMwkEKho",
      "title": "The Wheel vs Covered Strangle Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=qufmMwkEKho",
      "upload_date": "",
      "duration": 1247.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 18,
      "start_timestamp": "00:27:27",
      "start_timestamp_seconds": 1647.111111111111,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qufmMwkEKho&t=1647"
    }
  }
]