[
  {
    "text": "As a retail options trader, you really have very few advantages in the market. However, compared to what you're typically probably told, it's not zero. There are a few strengths that we have. So through this video, we're going to talk about five of them. And the goal behind this is so that unlike other areas of life where it typically makes sense to work on your weaknesses and strengthen them up, trading is all about exploiting your strengths. And part of that is understanding even what some of our strengths are. I want to start with a few areas that retail does not have an advantage. So one of these is pretty straightforward, something like short-term timeframes and latency dependent ideas. And it's really because if you think about things like high frequency trading firms, they are executing in millisecond timeframes. This fully automated stuff, they literally have gone through phases where they were buying up real estate closest to the exchanges to decrease the length of their cables. And then the exchanges had to come to a point where they mandated minimum cable lengths to then try to equalize it a little bit. Like that's the game that they're playing. There's absolutely no competition in that space for retail traders. And this is why when retail traders are talking about things like, oh, I scalp. It's like, yeah, you might intraday trade. You might trade shorter-term timeframes. But again, you're competing against things that you really don't stand",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=0"
    }
  },
  {
    "text": "they're playing. There's absolutely no competition in that space for retail traders. And this is why when retail traders are talking about things like, oh, I scalp. It's like, yeah, you might intraday trade. You might trade shorter-term timeframes. But again, you're competing against things that you really don't stand a chance. So that's not to say that you can't scalp, but it means you probably have to modify it a little bit because you're not really going to be able to scalp in the pure sense of very, very short-term transactions, especially once you include things like fees. So that's one example. Another example is custom products. Now, this might not make a lot of sense up front, but if you've ever watched a couple movies Wolf of Wall Street as one of them, but another great one is the big short, there's a series in the big short where essentially the funds goes into a large bank and they say, I want to create these specific swaps that are against mortgage-backed securities. They're based on mortgage bonds, credit default swap that will pay off if the underlying bond fails. You went about against the housing market. Why? Those bonds only fail if millions of Americans don't pay their mortgages. That's never happened in history. If you'll excuse me, Dr. Berry, it seems like a foolish investment. Based on prevailing sentiment, the market, banks, and popular culture, yes, it's foolish investment, but everyone's wrong. The world of creating swaps,",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:16",
      "start_timestamp_seconds": 76.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=76"
    }
  },
  {
    "text": "bonds only fail if millions of Americans don't pay their mortgages. That's never happened in history. If you'll excuse me, Dr. Berry, it seems like a foolish investment. Based on prevailing sentiment, the market, banks, and popular culture, yes, it's foolish investment, but everyone's wrong. The world of creating swaps, custom derivatives to a specific need really isn't something that retailers access to. It's kind of frustrating because if you think about trying to trade something like variance risk premiums in the market, which is something like this. If we grab the platform really fast and we look at this, we look at the term volatility and we say, okay, it looks like in this company there's a lot of opportunity for trading the persistence of variance risk premiums. Well, the problem is from a retail trading perspective, you can't actually create something that fully isolates this effect, the difference between implied and realized volatility. You have to trade something like a short straddle or a short strangle and then you have to continually delta hedge it, which costs money. And it's really an imperfect play against the idea that you're really trying to capitalize on. However, institutions are able to literally build custom products to exploit or explore very specific ideas that they have. Another example, volatility pricing. This is about as straightforward as it gets, but this is why for retail traders, we use things like implied volatility. We're extracting the price of volatility from the market and",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:02:30",
      "start_timestamp_seconds": 150.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=150"
    }
  },
  {
    "text": "to literally build custom products to exploit or explore very specific ideas that they have. Another example, volatility pricing. This is about as straightforward as it gets, but this is why for retail traders, we use things like implied volatility. We're extracting the price of volatility from the market and it's because our ability to come up with forecast volatility that exceeds something like virtue is about zero. They have literally armies of PhD at market making firms like this or other financial institutions that are going to the process of creating what we refer to as forecast volatility. This is figuring out what the volatility is that we should plug into a pricing model so that we know what the option be priced at. Again, from a retail trading perspective, we typically will extract out implied volatility, which is fine in most cases. Now, this doesn't mean that you don't get to develop some sort of opinion on volatility. You can use other tools, but the game of us thinking retail that we're going to price volatility better than these kinds of places. Again, it's just a complete fool's errand. It's not going to happen. Next example, information availability and processing. This kind of goes off of this very first one, but I wanted to expand it a little bit to give you a specific example. So if you think about something like a Bloomberg terminal, it costs around 24 grand per user per year. It's like 27K if",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:03:47",
      "start_timestamp_seconds": 227.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=227"
    }
  },
  {
    "text": "and processing. This kind of goes off of this very first one, but I wanted to expand it a little bit to give you a specific example. So if you think about something like a Bloomberg terminal, it costs around 24 grand per user per year. It's like 27K if you're only using a single terminal. Now this is the base starting point for any sort of serious institution. They're going to have a suite of these and it's going to cost them hundreds of thousands of dollars to maintain, but they're willing to accept that cost. This is just one example. There are other platforms like Icon and so on and so forth, but the reality is for most retail trading news sources, you're not really going to get cutting edge news or information. And that's actually not the end of the world. Because again, we're not really attempting to compete with these kinds of places in the ultra short term time frame, so we'll get into it a little bit later when we get to one of our strengths. Now this also doesn't even get into the world of the relationships. These institutions will have it with people at other places in the general world to get information that may not even be widely dispersed yet. Now that's not to accost the potential for insider information being passed around between friends to me and make some money. Sure, that doesn't happen. But beyond that, there's even a reality",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:05:00",
      "start_timestamp_seconds": 300.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=300"
    }
  },
  {
    "text": "at other places in the general world to get information that may not even be widely dispersed yet. Now that's not to accost the potential for insider information being passed around between friends to me and make some money. Sure, that doesn't happen. But beyond that, there's even a reality for information that might be more widely available. That's not widely distributed yet. That's being passed around between these closed channels. So it's just another example of a space that you really don't stand much of a chance. Now, let's talk about one of the places you do stand a chance, which is your trade sizes. If you haven't seen, there's a couple versions where Warren Buffett effectively talks about like the potential returns that he would get if he only had one million in Berkshire Hathaway. And the reason why he's using this idea of only having one million is because Berkshire Hathaway sits on such a massive amount of cash, not because they really just want to sit on this amount of cash. It's because the fund has been so successful that it cannot find opportunities that are attractive enough at a reasonable cost for them to get into a position that provides accurate sizing for what the portfolio would need, that it's literally just more effective for them to sit into cash. And what he's saying is that with the smaller portfolio and the ability to put on smaller positions to get into things and not move",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:06:03",
      "start_timestamp_seconds": 363.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=363"
    }
  },
  {
    "text": "into a position that provides accurate sizing for what the portfolio would need, that it's literally just more effective for them to sit into cash. And what he's saying is that with the smaller portfolio and the ability to put on smaller positions to get into things and not move the market on himself, he would actually be able to perform much better. So our world of trading in single lot, five lot, ten lot, 20 lot trades is an advantage in the sense that we aren't really going to move the whole, the market a whole lot on our own accord. And it also opens up the ability for us to trade other kinds of options specifically that institutions can't even find their way into because there's not enough total open interest to support their volume. That is not so much the case for us as retail traders. We can pretty easily navigate into those things, especially if you are really small trader trading single lots. Another example is trading activity requirements. There are a lot of imperatives for institutional traders depending on what institution we're talking about to actively engage in the markets. A great example of this is a market maker. They have to make markets and there's certain constraints on how often they have to make markets, which is a really high percentage of the time. Well the problem for market makers in that sense is if the market starts being bid in one direction and",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:07:16",
      "start_timestamp_seconds": 436.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=436"
    }
  },
  {
    "text": "is a market maker. They have to make markets and there's certain constraints on how often they have to make markets, which is a really high percentage of the time. Well the problem for market makers in that sense is if the market starts being bid in one direction and they have to keep taking the other side of that trade, they're actively disadvantaging them. They know they don't want to be on that side of the trade. And the other problem is as the other line going is going up, there's not an opportunity to offload the contracts that they're buying. So they're just building this massive inventory that they really don't want to hold and they're actively selling options in this case, maybe selling calls into something that's just persistently going up. That sucks. Now, don't worry, you don't have to break out the violence for them, they're doing just fine. But one of the best assets of a retail trader is the ability to do absolutely nothing. There are plenty of instances where there can be days, multiple days, even weeks where you might choose to abstain. And you always have that choice. There is no imperative for you to maintain a certain activity level that is a benefit that you have that is not the same across the board. Another is entry timing. Going back to that example with Warren Buffett, if he's trying to put on and use his over 100 billion of cash, the",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:08:30",
      "start_timestamp_seconds": 510.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=510"
    }
  },
  {
    "text": "for you to maintain a certain activity level that is a benefit that you have that is not the same across the board. Another is entry timing. Going back to that example with Warren Buffett, if he's trying to put on and use his over 100 billion of cash, the time that he gets into things is super important because he knows it's going to take him a while to build the entire position that he wants. And as he's trying to build his position, retail traders like us can see it. And we know that there's a high likelihood of a continuation of the build out based on the order flow proceeding. So what this means is as a retail trader, we never have to be the bottom tick or the top tick. We can follow the broader institutional momentum and literally ride the coattails. You do not have to pick the top or bottom, which is really difficult to do if you've ever tried it. We get to just follow the trend, follow the waves produced by the large institutions. That's a benefit. Another portfolio level directives. If you take a look from the CFA and we explore something like an investment policy statement, a lot of institutions, again, and varying capacities will have specific rules about what they can and cannot do. Going back to the market, make a example. They have to make markets and certain amount of names for a certain percentage of the time.",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:09:36",
      "start_timestamp_seconds": 576.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=576"
    }
  },
  {
    "text": "something like an investment policy statement, a lot of institutions, again, and varying capacities will have specific rules about what they can and cannot do. Going back to the market, make a example. They have to make markets and certain amount of names for a certain percentage of the time. If you're talking about a hedge fund, they're going to have a certain approach that they can take that their investors essentially sanction when they're putting their money in the fund. All traders don't have that. The portfolio directive is whatever you want it to be, whenever you want it to be it. Let's say, for example, with the recent market, things are going down. Let's say you were long tech for a long time. Guess what? Q, Q, Q. The ETF cannot do right now. It cannot become short tech. It's essentially long, not just tech, but dominant. They don't just get to change what they're doing. Now that's the ETF provider. But again, depending on the institution, almost all of them have certain rules. Now there are close end funds and stuff like that that really have a complete open world available to them. But in general, this is one of the benefits you have as a retail trader. And the last one, this one's actually pretty interesting if you think about it. It's the fact that really there's no evaluation criteria for you. Your job isn't dependent on your ability to earn a certain sharp ratio. This",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:10:48",
      "start_timestamp_seconds": 648.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=648"
    }
  },
  {
    "text": "is one of the benefits you have as a retail trader. And the last one, this one's actually pretty interesting if you think about it. It's the fact that really there's no evaluation criteria for you. Your job isn't dependent on your ability to earn a certain sharp ratio. This is also why you see things like hedge funds and mutual funds commonly slightly underperforming the market. It's not because they don't have the skill setter the capacity to outperform the market. It's because that in order to outperform the market, the risk that they take is not worth it to slightly outperform the market as compared to if they grossly underperform, then they look terrible. So they're actively evaluated against those kinds of performances. And this allows retail traders to actually trade things that might have an ugly path, might have big drawdowns along the way. For example, Nvidia's down pretty big right now. And let's say that you bought it at the top. Well, if you are a fund manager trying to get clients and you're coming up on a quarterly out brief of your performance or a monthly out brief, that puts you in a pretty disadvantaged spot because you're like, well, you have to explain that to people. Whereas you can just say, man, I'm actually just going to buy more and video might go down for the next year. Who knows? But I think with AI in the long run, it's going to make sense.",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:11:56",
      "start_timestamp_seconds": 716.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=716"
    }
  },
  {
    "text": "spot because you're like, well, you have to explain that to people. Whereas you can just say, man, I'm actually just going to buy more and video might go down for the next year. Who knows? But I think with AI in the long run, it's going to make sense. So this is another benefit you have. Now the key component here, those that you have to come up with your own, because if you don't evaluate yourself at all, the probability of you underperforming is very high. You still have to be your own boss, but you get to decide the rules that you're going to play by and how you're going to evaluate your own performance. So maybe you don't really care that much if you have super volatile returns as long as the max in the total return is overall strong. That's a choice you have. So there are not a lot of advantages. There are some and you got to lean into them. Be an outlier. See you later.",
    "metadata": {
      "video_id": "qWIQLqjiSUk",
      "title": "The (Few) Advantages of Retail Option Traders",
      "url": "https://www.youtube.com/watch?v=qWIQLqjiSUk",
      "upload_date": "",
      "duration": 841.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:13:06",
      "start_timestamp_seconds": 786.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qWIQLqjiSUk&t=786"
    }
  }
]