[
  {
    "text": "leveraged ETFs can literally supercharge your returns, but it's not without risk. You're going to see higher overall volatility of the portfolio. So the goal of this video is to walk you through how we can trade something like my favorite strategy, the covered strangle, in something like a leveraged ETF such as T-T-Tribal Qs, and how we can build a system around it to strike a balance between our return potential, but then also managing our risk side of the equation. So let's get right in. This is what we're going to run through. We're going to go end to end. I'm going to walk you through some high-level concepts, and then we are going to get into some details on how to think about and form this kind of thing for yourself. So let's get right to it. Very first thing is the covered strangle for those who are unfamiliar. I'll throw a link in the notes below, but it's a bullish trade. We're going to be long shares, sell cash-secured puts, and have ratio short calls against the long shares. We'll have more details on that in a little bit. But that's the overview for the strategy. Now, the whole idea of a leveraged application is to amplify your returns through additional beta. What does that mean? Let me show you. If we pop over to the platform and we take a look at QQQ on the left hand side here, this is a five-year weekly chart.",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=0"
    }
  },
  {
    "text": "Now, the whole idea of a leveraged application is to amplify your returns through additional beta. What does that mean? Let me show you. If we pop over to the platform and we take a look at QQQ on the left hand side here, this is a five-year weekly chart. I want you to notice the move that happens here. It goes from 402-ish down to 261-ish. This is from 2022 into 2023. This is actually during the bear market that we had that year. If you look at QQQ compared to T-triple cues, T-triple cues went from 91 down to 17. Notice the difference. Qs is about a 36 drop. T-triple cues is an 80-plus percent drop. If you have 100,000 through here, at the end of it, you have 20. That's difficult for people to manage. Most people bail on this during the worst possible time, which is as it's in this free fall. We're going to talk about how we can manage this additional beta so that we can actually take advantage of the leverage without taking on excessive portfolio volatility. What does that mean for best practices? We're going to have to pay attention to because something like T-triple cues is three times leveraged the daily returns of QQQ. So it's essentially behaving as three times the number of shares on an intraday basis. Now, volatility decay refers to how leveraged ETFs behave. To summarize this at a high level, it essentially means volatility is going",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:00:58",
      "start_timestamp_seconds": 58.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=58"
    }
  },
  {
    "text": "something like T-triple cues is three times leveraged the daily returns of QQQ. So it's essentially behaving as three times the number of shares on an intraday basis. Now, volatility decay refers to how leveraged ETFs behave. To summarize this at a high level, it essentially means volatility is going to be exacerbated during prolonged consecutive down periods because of the sequence of returns. So if we take a look at this quick example here, you can see I'm showing you a perspective return sequence for QQQ versus T-triple cues. And T-triple cues were calling it three times the daily return of QQQ. This doesn't take into account the fact that there is a discrepancy between these. It's not going to be perfectly matched. Sometimes it will be slightly more. Sometimes it will be slightly less. But just for the example of volatility decay, I'm using one to one. So for QQQ, if we have a one percent day, a negative two percent day, followed by a negative five percent day, followed by a negative two percent day. That's what this math is showing us. This is day one, day two, day three, day four. So the required move to get back to break even here is 8.52 percent. If we have this sequence of returns, if we do the same in T-triple cues three times levered, the required move becomes 29.27 percent. What does this mean? This is volatility decay because now if QQs shows that 8.52 percent move,",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:13",
      "start_timestamp_seconds": 133.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=133"
    }
  },
  {
    "text": "get back to break even here is 8.52 percent. If we have this sequence of returns, if we do the same in T-triple cues three times levered, the required move becomes 29.27 percent. What does this mean? This is volatility decay because now if QQs shows that 8.52 percent move, QQs is now back to break even. But T-triple cues is not because that only translates to a 25.56 percent move in T-triple cues. So then we still have another several percent to go to get back to break even. And for a quick visual of this, this is exactly why if we compare this period from Qs to T-triple cues, take a look. Qs already passed and started making highs off of this period in here. T-triple cues still hasn't gotten back the highs. This is volatility decay because of this period here. So what that tells us is we have to be very, very thoughtful about avoiding that volatility decay. Otherwise, it can be a problem for us. So now let's talk about the strategy. I already have a series that I'm building around this. I have two videos that I've done outlining this kind of pretty far in depth. So I'll link to those below. And I'm also going to start reviewing this on the Monday night YouTube live session. So you can check in for updates on it there. I'm using real money. It's for an example. So let's take a look at how to build",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=197"
    }
  },
  {
    "text": "in depth. So I'll link to those below. And I'm also going to start reviewing this on the Monday night YouTube live session. So you can check in for updates on it there. I'm using real money. It's for an example. So let's take a look at how to build a strategy around this. We use the outlier strategy process. So we're going to analyze the profit mechanism, the mechanism indicators. We're going to find structures that fit. We're going to build a strategy. In this case, we're coming into this problem set, knowing the structure that we want to use. We want to use a covered strangle. Why do we want to use a covered strangle? For a bunch of different reasons. But in this case, this is designed to be a little bit more of a hands-off approach to trading leverage. So this is something that I might run in an IRA account that I'm not necessarily trading a ton or a 401k account. Or if I was on active duty in the Marine Court and I was going to be deployed for a while, something like that. So this is not designed to purely optimize best possible return and risk profile. We have the added injunt of wanting to be a little more hands-off less babysitting. So what does this look like? Well, the profit mechanism here is pretty simple. It's going to be capital gains via trend drift and beta. This is essentially how we're going",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:04:26",
      "start_timestamp_seconds": 266.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=266"
    }
  },
  {
    "text": "return and risk profile. We have the added injunt of wanting to be a little more hands-off less babysitting. So what does this look like? Well, the profit mechanism here is pretty simple. It's going to be capital gains via trend drift and beta. This is essentially how we're going to use something like T-Triple Qs to outperform, buy and hold, and QQQ. So the profit mechanism traits and indicators are pretty simple. We know as traits that we're looking at something that's very volatile, it's three times the daily leverage, which is really important to track. And it's going to have excessive beta compared to, again, the non-leveraged counterpart. So it's going to move around a lot, and it's going to have options that have good volatility in them, which is why the covered strangle is a great fit for this. For signals, in terms of determining if we want to get in, if we want to get out, if we want to scale up, if we want to scale down, we can use things like moving averages, standard deviation channels, RSI, kind of my standard technical analysis tool suite, which I'll link to a video in below that goes through that in detail. But most of this is going to be stuff that I'm going to look at to make adjustments relatively and frequently. This isn't going to be something I'm day trading. So our signals have to match the overall time frame. The strategy, as we already",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:05:19",
      "start_timestamp_seconds": 319.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=319"
    }
  },
  {
    "text": "goes through that in detail. But most of this is going to be stuff that I'm going to look at to make adjustments relatively and frequently. This isn't going to be something I'm day trading. So our signals have to match the overall time frame. The strategy, as we already discussed, is going to be a covered strangle. Other things that could fit into this are ratio called diagonals, buy and hold, buy and hold with different kind of exit protocols, instead of just holding through things, that kind of stuff. So what does this strategy itself look like in this case? Well, we're going to make sure that we're long at least 100 shares to preserve upside potential and to allow us to sell calls against the longs at a ratio. And again, if you're unfamiliar with what that is, check out that video below. We're going to sell cash secure puts. Both of these are going to be within the 50 DTE window to maximize theta decay, but we're not doing super short terms so that we're having to adjust it all the time. We're going to focus on rolling to maximize profit over basis adjustments. So we have to pay attention to when we choose to roll because we want to make as much money as we can in the scenario versus worrying about updating our basis. Risk is going to be managed primarily via size. I already showed you, and I will show you additional draw",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:06:27",
      "start_timestamp_seconds": 387.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=387"
    }
  },
  {
    "text": "have to pay attention to when we choose to roll because we want to make as much money as we can in the scenario versus worrying about updating our basis. Risk is going to be managed primarily via size. I already showed you, and I will show you additional draw downs, but in a recent example, we had a 82 drawdown. I don't want to do that. So we're going to have to find different ways to navigate around that drawdown so that we're not experiencing that. Moving averages to set entrance and exit triggers completely viable. We'll talk about some different variations of that. It can help a lot. Otherwise, you can use sizing as another method to decrease your overall risk. And then for me, I'm going to use a 5 move as my scale window. So if something moves down 5, I'm going to decide scale in scale out, stay the same, but I'm going to use that as a trigger to modulate how much money I'm using when because one of the most important things during this kind of down move is to have enough money to scale into the trade as it's plummeting so that you can improve your basis so that you can hit your recovery point much, much sooner. Because if we take the example of top taking it, you bought it here, for example, at 90 you take the crash down here to 16, you're still not back to break even. But",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:07:19",
      "start_timestamp_seconds": 439.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=439"
    }
  },
  {
    "text": "you can improve your basis so that you can hit your recovery point much, much sooner. Because if we take the example of top taking it, you bought it here, for example, at 90 you take the crash down here to 16, you're still not back to break even. But if you were just 35 invested here and then every 5 drawdown you added a little bit up until it you added three times in the course of two weeks, then you stretch that out to maybe adding on 10 drawdowns until you're fully invested towards the bottom here, you already hit break even and you're making money again. The scaling element of this is going to be very, very important. So quick overview. This is from Portfolio Visualizer. This is just showing the difference between T-Triple Cues and Cues for total returns, annualized standard deviation, which is really important, and then also drawdowns. Again, this is not fully correct because I'm showing you on the chart there what it actually looks like, but it's pretty close. So this is showing you that if you buy and hold T-Triple Cues, you can have some really great ears. However, you're going to have potentially really bad times. He's a real bad times, bro. So now let's talk about how this overall system performs. So what I did is I just ran through Python and I plotted a couple different moving averages, a 22 period, a 50 period, a 150 period, and",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:08:21",
      "start_timestamp_seconds": 501.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=501"
    }
  },
  {
    "text": "to have potentially really bad times. He's a real bad times, bro. So now let's talk about how this overall system performs. So what I did is I just ran through Python and I plotted a couple different moving averages, a 22 period, a 50 period, a 150 period, and then I looked originally at buy and hold performance in T-Triple Cues versus Cues from 2010, comparing the maximum drawdowns, which we already knew this. This is just a visual representation of it. So what my mind is thinking maybe we can use moving averages to cut this. And if we take a look at something like this where the number of touches, or a 22 versus 50 versus 150, you can see that the shorter term the moving average is, the more frequently it's going to be interacted with. Some of these other numbers down here are not accurate. You can ignore those. This is literally just for the touches. So at a quick eyeball of just using a very basic straight entry-exercretaria, you can see that we can manipulate a T-Triple Cues strategy to very much outperform Cues. And we can also decrease the maximum drawdown if we're really thoughtful about these levels, which again, this is not, this is just a dumb system. So there's a viable approach here if we can manage these drawdowns. So now the name of the game is seeing how do we participate in these 3,270 gains over these time frames without",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:09:17",
      "start_timestamp_seconds": 557.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=557"
    }
  },
  {
    "text": "really thoughtful about these levels, which again, this is not, this is just a dumb system. So there's a viable approach here if we can manage these drawdowns. So now the name of the game is seeing how do we participate in these 3,270 gains over these time frames without giving up too much upside profit potential by getting out using different moving averages without going through these 82 style drawdowns. So one of the first things you'll notice is that the 50-day moving average works really, really well. So if we use a three year daily chart, you can see that if you use a 50-day moving average, it would get you out much, much, much sooner in the lifespan of the trade so that you don't have to go through this really drawn out nasty drawdown. So for example here, using three year daily chart, you can see that let's say you got in here, it would keep you in, you might get out somewhere in here, get back here, get out again here at a small profit, you take it all the way to the downside, come back up, get back in here, get kicked out again here for a small loss, then you're not back in. So you can see that there's still quite a few interactions with the 50-day moving average. So there's a couple choices we can use. We can either use a 200-day moving average, which is going to be much slower. You're",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:10:21",
      "start_timestamp_seconds": 621.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=621"
    }
  },
  {
    "text": "here for a small loss, then you're not back in. So you can see that there's still quite a few interactions with the 50-day moving average. So there's a couple choices we can use. We can either use a 200-day moving average, which is going to be much slower. You're going to have a bigger drawdown before it kicks you out, but in this case, let's say you top-ticked it again at 91, this might kick you out instead at 68. So it's not a great move, but it's not going from 91 down to 16, and if you use a 200-day moving average, you get in here, bad timing, top-ticked it, gets you out here at 68, and then you don't get back in until down here. You get chopped up a little bit, then you get chopped up again a little bit here, but then you're essentially off to the races into here. The downside is that this move would have caught you in full from 85 down to 59. So what we can tinker with is using a combination of these different moving average strategies so that we can maintain some sensitivity and strike a balance. But this is the introduction to using coverage strangle in a leveraged ETF. If you're interested in following along, check out those Monday night YouTube live streams, and then the other thing is, if you're interested in another follow-on video that talks about the specific relationships with these moving averages that",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:11:25",
      "start_timestamp_seconds": 685.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=685"
    }
  },
  {
    "text": "this is the introduction to using coverage strangle in a leveraged ETF. If you're interested in following along, check out those Monday night YouTube live streams, and then the other thing is, if you're interested in another follow-on video that talks about the specific relationships with these moving averages that I'm going to use, let me know, and I can share with you what I'm going to do and why I'm going to do it. As always, if you have any questions, let me know, be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "qZCwehXEWys",
      "title": "Covered Strangle Strategy for Leveraged ETFs: A High-Reward Approach",
      "url": "https://www.youtube.com/watch?v=qZCwehXEWys",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:12:19",
      "start_timestamp_seconds": 739.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=qZCwehXEWys&t=739"
    }
  }
]