[
  {
    "text": "Hey everyone, Eric here wanted to do a quick update on the small stacks portfolio. So in short, this is relatively going to be a quick video, not much going on, but I'm doing my best to try to make these videos as I'm making adjustments, hopefully at least same day or within a few days. So let's jump over the screen and take a quick look. So big change from today is essentially just took down the BAC short puts. So in there, I was short the 24 puts. I got a 1.22 and I closed them today for a nickel. That was more or less a no brainer. I was essentially going to take it to expiration, but once I started seeing a couple down moves after it's gap up, you know, just took it down, took the profit in and we'll replay the capital once I see something. And then if we take a quick look at the diagonals, this is also essentially status quo. So let's take a quick look at these products just so that you can kind of see an idea of what I'm seeing in Bank of America as you can tell we've had this gap up and then kind of more inside day here, starting to come down a little bit here. So really what I was just trying to do is ride out as long as I could to collect as much premium out of it as I could and taking",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=0"
    }
  },
  {
    "text": "had this gap up and then kind of more inside day here, starting to come down a little bit here. So really what I was just trying to do is ride out as long as I could to collect as much premium out of it as I could and taking it down for a nickel today. Like I said, it's essentially no brainer. So really just after this kind of big up move, I wouldn't want to stay in there. My basis was, you know, down here. So that was relatively simple, straight forward trade. And then we look at take a look at Kruger right now in there. If we pull this back up, I am short the 35 calls. So we're still way up here on those short calls with my basis, which obviously is an ideal. I'd rather be a little closer to the money, but it's just kind of how it goes sometimes with the diagonals. You might get a move that slides again. She a little bit like we're seeing right here, but that's okay. So what I'm doing is essentially just leaving those on until either they expire in the money, which looks extremely unlikely or until I can take them down for 90 plus prop 90 percent plus profit. And that's really all there is in here. Now the one thing I will highlight in Kruger is the fact that I do have two leaps and I'm short only one right now. So",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:01:33",
      "start_timestamp_seconds": 93.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=93"
    }
  },
  {
    "text": "unlikely or until I can take them down for 90 plus prop 90 percent plus profit. And that's really all there is in here. Now the one thing I will highlight in Kruger is the fact that I do have two leaps and I'm short only one right now. So it's still an uncovered position and I still have the ability to add another leap. I'm sorry, I had another short call. If we start to get some sort of rebound and I can get some additional premium, but right now for me, it just makes the most sense to hold on to having it at a ratio so that I can experience a little more upside. That's what I'm prioritizing in this. And then if we take a look at Intel, this trade is still doing well. That's kind of the good thing about these diagonals is that things that remain range bound like this tend to stay healthy for us. So right now the leap that I have is trading at 10. We got in at 10.35, so we're essentially at par there. And we're short the 20 no 47 call against and that's trading about at parity right now. So same price as when I put it on, nothing really to be done in here just yet other than simply waiting and allowing I just realized my face is in the way. There you go. And allowing the trade to just run its course, see some theta",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:03:06",
      "start_timestamp_seconds": 186.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=186"
    }
  },
  {
    "text": "right now. So same price as when I put it on, nothing really to be done in here just yet other than simply waiting and allowing I just realized my face is in the way. There you go. And allowing the trade to just run its course, see some theta bleed out and then kind of going forward from there. But with Intel, obviously, I still really like this product long term. And the other thing that I'll definitely note is that we still have a really, really good basis in here for our critical strike, which is 46 right now. So that puts us right in the mix. If we take this short call in and look to add another, we're really well positioned to collect a bunch of premium being able to sell right at the money. So those are the main positions we have right now. Let's close this off and take a quick look at the macro view. So right now, total PNL, the portfolio is 11.56, which is almost a 19 return. The account is doing really well. Capital total is 6156, like I said, just essentially adding on to the 5K. So that's where we started for those of you that might be joining in. And then utilization, we're only consuming 2392 right now, which is less than 40 utilized. So we got cash to use. So right now, I'm essentially just going to go shopping. The reason why I haven't found something just",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:04:39",
      "start_timestamp_seconds": 279.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=279"
    }
  },
  {
    "text": "we started for those of you that might be joining in. And then utilization, we're only consuming 2392 right now, which is less than 40 utilized. So we got cash to use. So right now, I'm essentially just going to go shopping. The reason why I haven't found something just yet is with the market making the moves it has the last few days, I'm not really rushing to get into anything, especially because this is, if I stop right now, making 19 over the course of a year is a good return. So I'm not again in any rush to just throw risk out there trying to chase something. I'm going to continue to pick my shots carefully. And you can see the breakdown from which is returning the most diagonal still outperforming, which makes total sense. It's way more capital efficient. And with the credit outstanding as it is right now, we stand and make another 121 bucks, which is about 2. Return on, return on the count. So overall, again, it's still looking to be pretty healthy. And when we take a look at, when we take a look at where we're going forward, essentially for the rest of the year, I'm going to continue to try to find longer term plays that I really like and just offering those out, whether it's the cash that you're put or the diagonals. And if you'll notice, I'm not trading any verticals whatsoever. None of those have come out.",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:06:13",
      "start_timestamp_seconds": 373.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=373"
    }
  },
  {
    "text": "rest of the year, I'm going to continue to try to find longer term plays that I really like and just offering those out, whether it's the cash that you're put or the diagonals. And if you'll notice, I'm not trading any verticals whatsoever. None of those have come out. I'm not really trying to swing trade anything. I'm not sitting here trying to scalp in here. And the reason is, is just smaller accounts struggle with that. It's really difficult for smaller accounts to maintain a healthy risk profile in those scenarios. So that's why I continue to beat this drum of doing our best to trade this small account in a similar way to when you grow your account. Because right now, the most important thing is practicing and developing a skill set. This 5,000 is not going to turn into a bunch of money. Now again, if we take a look at the return that we achieved in this account, if this instead of being a 61, 56 account in terms of overall capital, as soon as you start expanding that out, if we had something closer to, let's say, a million dollars, all of a sudden that return starts to mean a hell of a lot more. Instead of it just being, you know, 1,000 in this account, it immediately starts to grow. And now you're talking something over what, 185,000, something like that. So the, again, what we're focusing on here is the skill set.",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:07:46",
      "start_timestamp_seconds": 466.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=466"
    }
  },
  {
    "text": "that return starts to mean a hell of a lot more. Instead of it just being, you know, 1,000 in this account, it immediately starts to grow. And now you're talking something over what, 185,000, something like that. So the, again, what we're focusing on here is the skill set. And then as you continue to save, find, you know, compound returns in the account, find other sources of income, that's really what makes this whole investing thing pretty powerful. So that about wraps up this session. If anybody has any questions or anything, let me know. And for, I'm probably going to take this through into the new year, but I probably will stop this somewhere in January. I think most folks more or less get the point now. So it's not really anything earth shattering, but with that in mind, if there is anything that you want to discuss with this, you know, with kind of the January being the end, make sure you let me know because I'll end up developing another portfolio like this, maybe, you know, like mid size or a large size, but that's kind of TBD. I'll chat with you all and see what you would like to see what would be more helpful for you. I think for me, what I would like to do is, you know, just pick a larger account, maybe open up a portfolio and just move maybe like one, maybe one mill or like 5,600,000, something like",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:09:19",
      "start_timestamp_seconds": 559.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=559"
    }
  },
  {
    "text": "what you would like to see what would be more helpful for you. I think for me, what I would like to do is, you know, just pick a larger account, maybe open up a portfolio and just move maybe like one, maybe one mill or like 5,600,000, something like that. And I think that would be helpful because that really is a completely different skill set when you're trading with a larger amount of capital. So I think that would be really helpful to take a look at one of those style accounts as compared to just the micro accounts. So if there's a preference there, obviously let me know and we'll catch everybody later.",
    "metadata": {
      "video_id": "r_B4edd6-eU",
      "title": "BAC adjustment and path forward - Small Stacks Pt15",
      "url": "https://www.youtube.com/watch?v=r_B4edd6-eU",
      "upload_date": "",
      "duration": 582.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:10:53",
      "start_timestamp_seconds": 653.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=r_B4edd6-eU&t=653"
    }
  }
]