[
  {
    "text": "What's up, outliers? Today's video is all about GameStop because we had a couple things happen today. I will do the standard market update later today during the options trading for beginners workshop. But yeah, there was just a couple of things in here that I think we need to spend a few minutes looking at. And for those interested tomorrow Saturday at 5 p.m. Pacific time, still have the standardized GameStop livestream. The game plan actually was to look through roaring kiddies old trades. So this seems to fall in line with it. So what's going on today? Well, at there's two time frames that I think are most important. The first thing is I got an alert and these are Pacific time, but I got an alert at 842 that there was some really massive size trades that came through in GameStop. So there was 6,399 of the 22.5 calls expiring 13-sep. The spot price at these at the time was 1.75 got in there for 1.12 mil. And then right below that essentially a second off. So I would absolutely consider these to be the same trade. There was 3660 of the 22.5 calls, same expiration for 1.69 giga-dee for 619,000. So this takes us over 10,000 contracts essentially. And there's some just really, really, really, really interesting behavior going on here. So 088, 42, 37, and 38. That's when these trades come through. Then we take a look at roaring kiddies Twitter. This happened at 0.9",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=0"
    }
  },
  {
    "text": "1.69 giga-dee for 619,000. So this takes us over 10,000 contracts essentially. And there's some just really, really, really, really interesting behavior going on here. So 088, 42, 37, and 38. That's when these trades come through. Then we take a look at roaring kiddies Twitter. This happened at 0.9 on the nose today. So these trades came through. This came out. Then the stock started to move. So if I slide this out of the way, and then let's just take a look at like a today, let's do it today one minute. So it's clear. Take a look. So roaring kiddie post this again, 0.9. We see these two trades come through big block orders, 0.842. So let's take a look. What happened at 0.842? You can see that the market saw it. And absolutely bit up on that movement. That's very likely a mix of hedging behavior because those are big trades, hedging behavior coming on by market makers. Then we wait a few minutes. 0.9 on the nose, roaring kiddie posts that meme. So what do we see here? Massive volume spike immediately, all by side, all by side, massive volume spike. And for those that obviously are kind of one or what's going on here, the idea is this is what he originally posted on June 27th. And then we saw, I think the filing was for like the 26th or something like the day before. I don't remember. It doesn't matter that much, but",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:01:13",
      "start_timestamp_seconds": 73.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=73"
    }
  },
  {
    "text": "obviously are kind of one or what's going on here, the idea is this is what he originally posted on June 27th. And then we saw, I think the filing was for like the 26th or something like the day before. I don't remember. It doesn't matter that much, but you can throw it in the comments if you know which day it was because I don't recall. The point being though is notice green eyes. We were obviously flipping out about the blue background and all these different kinds of things. But the green eyes. Then I notice red eyes. I notice eyes pointing to the stage right eyes pointing, well, I guess stage left stage right, my left in this case. The main thing I see is green by red cell. Like that's what it looks like. And obviously the meme looks like the kid from toy story, dropping his toy. He's, you know, moving on from the toy. That's when he went and played with Buzz Lightyear like a chode and then he came back and realized that Woody's the homie. And he liked hoodie. Woody. I don't know if people are reading that far into the story. I personally don't think that's what's being inferred here. As in, you know, he's putting down Chewie and then like the movie actually, he's going to go back to Chewie because that's what he does with Woody. I don't see that personally. To me, this is just representative of",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:02:52",
      "start_timestamp_seconds": 172.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=172"
    }
  },
  {
    "text": "story. I personally don't think that's what's being inferred here. As in, you know, he's putting down Chewie and then like the movie actually, he's going to go back to Chewie because that's what he does with Woody. I don't see that personally. To me, this is just representative of him putting down Chewie. And the red eyeballs look like cell, right? Green by red cell. That's my tinfoil hat. That's my guess as what's being inferred here. So obviously a lot of the market also made that same inference because we see this massive skyrocket in GameStop shoots up. And it's trading around like this 22 handle that shoots up like 10 to 24. It was up like over 8 when I made that first video a little bit earlier. And then it started coming back down. But we can see definitely kicked off a strong movement. What I cannot help but find curious. And I don't know what this means. And I don't want to pretend like I know what it means. I just have to point it out. I see 5,000 blocks of the 22 and a half calls in 13 September being sold. So my inference. And again, I'm highlighting inference because is closely related as everything might point at something going on being somebody bought these and then sold them essentially a half hour later, which we're going to talk about in a second. That's what the immediate inference would be. And to me, that",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:03:50",
      "start_timestamp_seconds": 230.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=230"
    }
  },
  {
    "text": "And again, I'm highlighting inference because is closely related as everything might point at something going on being somebody bought these and then sold them essentially a half hour later, which we're going to talk about in a second. That's what the immediate inference would be. And to me, that does seem likely. But that doesn't mean that's what happened. We don't know. And I always want to remind people that it's okay to have ideas on what we can reasonably conclude happened as in this case. But until we know for certain, I don't think it's smart to essentially take our idea as truth because here's what looks like what happened. I see 0842. These come out 0900. We see that tweet. I see 0919 and 0922 both 5,000 lot of the 22 and a half calls same expiration being unwound. So if we look at this, we can see, okay, well, on this block here, he got he being whoever this is because again, even taking a step back, we don't know that this is roaring kitty. We don't know what I guess that it is personally. I would guess that it is. It seems very likely. But does that mean that it's him? No. And I don't know neither does anybody else until he posts a yellow update until he says something. Just want to drive that point home. So when I'm talking about he, I really am talking about whoever this is. I have who I",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:05:02",
      "start_timestamp_seconds": 302.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=302"
    }
  },
  {
    "text": "does that mean that it's him? No. And I don't know neither does anybody else until he posts a yellow update until he says something. Just want to drive that point home. So when I'm talking about he, I really am talking about whoever this is. I have who I think it is. And I'm sharing that openly so that it's not like this cryptic message. There's enough cryptic messages going on. But it's not to taint your analysis of things. That's why I'm specifically calling out my bias in what I think this is. So I see these go through and I see this happens at 1.75 and then this one unwinds. Let's call it 225, right? Let's just use that as a general guesstimate. Do I think if it were roaring kitty? Do I think roaring kitty would come in here at 1.75 and then after a move from let's take a look. 42, 842 to 919. Let's see what that looks like. 842 here. So right down here to 919. Over here is big red candle. Do I think that's his move? Personally, not unless something else is going on. We've seen this dude hold his position up over a quarter billion dollars, not a quarter million, quarter billion dollars. He has more money than he could ever need. So if this was him that bought here and if this was him that sold here, although it's going to come out in force because it does look",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:06:22",
      "start_timestamp_seconds": 382.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=382"
    }
  },
  {
    "text": "up over a quarter billion dollars, not a quarter million, quarter billion dollars. He has more money than he could ever need. So if this was him that bought here and if this was him that sold here, although it's going to come out in force because it does look like somebody pumped and dumped. Again, I'm not trying to cause chaos here. It's just that this is a quintessential style of that that behavior because typically this is what a pump and dump is where somebody front runs a move. We gain a position. We do something that we know is going to move something and then we exit after the move, typically in a really short term time frame. That's generally what it is. Do I think that that's what he would do? No, I genuinely don't. And do I think that's what he would do for this amount of money again for most mortals like us for thinking like shit, dog. That's like two million bucks, two point two ish, two point three almost like, yeah, I mean, I might do it, but joking aside, hundreds of millions of dollars. He doesn't care. He doesn't care that he made a few thousand dollars, tens of that hundreds of thousand dollars. He doesn't care. I've seen this do hold positions that again, we're up over 250 million dollars and just do nothing. So if this was him, I would be surprised for a few reasons. The first reason",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:07:42",
      "start_timestamp_seconds": 462.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=462"
    }
  },
  {
    "text": "he made a few thousand dollars, tens of that hundreds of thousand dollars. He doesn't care. I've seen this do hold positions that again, we're up over 250 million dollars and just do nothing. So if this was him, I would be surprised for a few reasons. The first reason is again, I just don't think that's his behavior. I think it would take a lot more for him to do. Again, unless he's trying to do something else on the back end that we might not be privy to. The other thing that I could see that's slightly different is this is a really short term entry, seven days. I haven't seen based on what he's done previously, which again, tomorrow on that live stream, the goal is to go through this exact thing in detail because it's very interesting. But I haven't seen him go through these really short term trades like this. So not saying that he never could, but I that's just not the behavior I've seen from him. So I personally am left with a massive, massive question mark. I really, as per usual, don't really know what's going on here. So the other thing that I did to take a closer look at this is I looked at the 22 and a half specifically. And rather than just look at today, I want to look back over the last week and see what kind of behavior I saw going on in there. And there's",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:08:54",
      "start_timestamp_seconds": 534.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=534"
    }
  },
  {
    "text": "that I did to take a closer look at this is I looked at the 22 and a half specifically. And rather than just look at today, I want to look back over the last week and see what kind of behavior I saw going on in there. And there's just nothing. There's nothing even close to this magnitude in this time frame. So then the other thing I thought is, okay, I've seen we're in Kitty Do these before. A lot of times he does it like almost a month out is when he'll start building his position. So same, same. Go all the way out to August, come all the way into here. And let's take a look at these 22 and a halfs. Same exact thing. Being there's no activity before here. And obviously there's some activity, but this is all super small stuff compared to these. So the fireworks were today that obviously we can see pretty clearly what this all means and what it looks like. I really don't know, but my guess is if this is the case here, we will see an updated filing from him because he will have to share it within 10 days of this if it was today. If it was prior to today, whatever day it happens that he drops below that 5 threshold, he owes an amended form. So we'll see that at some point if that means he's sold enough to drop below the 5 threshold.",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:10:05",
      "start_timestamp_seconds": 605.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=605"
    }
  },
  {
    "text": "within 10 days of this if it was today. If it was prior to today, whatever day it happens that he drops below that 5 threshold, he owes an amended form. So we'll see that at some point if that means he's sold enough to drop below the 5 threshold. Then the other thing I imagine what happened is we would see another yellow update at some point. Who knows when, why or how? No idea. That's kind of the tricky part about our friend, we're in Kitty. Is he's kind of there? He's kind of gone and you never really know which way he's moving, which is obviously part of his game. So just an absolutely firework day. I am, as you could tell, very engaged because this stuff is fascinating to me. It is so fun to look at and try to figure out what's going on with the thought pattern is behind it. Today I was able to trade the move in GameStop up a little bit and I was hot on the button because I saw this happen with Choui and I was not going to essentially try to ride the super far just yet. I still have my long shares all those positions, but I was trading it with options today in a much smaller sense because it's just too much movement to not pay attention to it. But man, what a day. So as always, any ideas that you have what's going on, any",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:11:06",
      "start_timestamp_seconds": 666.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=666"
    }
  },
  {
    "text": "still have my long shares all those positions, but I was trading it with options today in a much smaller sense because it's just too much movement to not pay attention to it. But man, what a day. So as always, any ideas that you have what's going on, any theories, anything you think we should take a look at during the live stream tomorrow, let me know because I am keen on it. I want to dive further into this stuff and try to figure out what's going on because it is just too interesting not to. As always, be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "RG_ZzRP4mNM",
      "title": "Roaring Kitty Update - CHWY & GME",
      "url": "https://www.youtube.com/watch?v=RG_ZzRP4mNM",
      "upload_date": "",
      "duration": 755.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:11:59",
      "start_timestamp_seconds": 719.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RG_ZzRP4mNM&t=719"
    }
  }
]