[
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "What's up, Alias? Today we're going to talk about managing an options trade. Seems pretty simple at face value, but there's a little bit more detail that goes into doing this successfully long term. So we're going to talk first about what we should not do and why we should not do it this way. And then I'm going to show you some concepts on a different way to approach this. Now one really important overarching concept here is that when we trade options, it's very easy to get sucked into each individual trade. What I mean by that is sometimes we forget that our trades should be treated as a process, where we start to value the way that we adhere to the process as compared to the outcome of individual trades. That might not sound like much if you're a new trader, but it goes something like this. If you put on a trade and you see it going against you, you might think to yourself, oh, I could fix this. I could do these different kind of management things in salvage this trade. But if you don't manage everything in that strategy that way, you realize that you don't have anything to control for to figure out what actually makes sense over the long run for your strategy. So the underpinning concept here is that we acknowledge the fact that we need to treat the way that we manage trades in the context of this is a",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 85.56,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "you don't have anything to control for to figure out what actually makes sense over the long run for your strategy. So the underpinning concept here is that we acknowledge the fact that we need to treat the way that we manage trades in the context of this is a process that we're expecting to do over the long run, not something that we're just doing this one-off instance to make a few bucks. That doesn't work well long term. Okay. What not to do? What about the percentage at 50%? Never risk more than one percent of your account on an individual trade. Cell half and keep half. What should I do now? Always roll for a net credit. Why are these things you should not do? Any one of them might be completely fine. Well, really accept this one for sure. But the thing that I'm highlighting here is that all of this shit is advice that you probably heard in different places that is completely random. In reality, the reason why this doesn't make sense is the specific profit mechanism that you're trying to trade behaves differently. Let's look at an example to make the point clear. If you focus on these bottom two charts, I have X on mobile and Tesla. If I was trading some sort of bullish strategy in both of these, would I want to manage it the same way, meaning would I want to not risk more than one percent or would",
    "start_timestamp_seconds": 64.64,
    "end_timestamp_seconds": 157.28,
    "start_timestamp": "01:04",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=64",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "If you focus on these bottom two charts, I have X on mobile and Tesla. If I was trading some sort of bullish strategy in both of these, would I want to manage it the same way, meaning would I want to not risk more than one percent or would I want to sell half and keep half after it hit a certain profit level? The reality is absolutely not. Why is that? Because if I look over the last six month lifespan for X on mobile effectively, it's moved about 8%. If we look at the total range high to low, that represents 16.76%. If I do that same exercise and I look at the high low range in Tesla, it's 82.5%. So what am I highlighting? I'm highlighting the fact that these two things move so unbelievably different that if I did the same exact strategy in terms of managing my long call or my short put, it wouldn't work well. You have to make things specific to what you are attempting to capture what the specific profit mechanism is. So let's talk about what to do. We should start with the outlier strategy process. I have a video, I'll link to that in the notes below. The reason why I think this is the place to start is because this provides the framework. Most traders begin trading options by learning some sort of random option structure. You learn verticals, you learn iron condors and whatever structures you",
    "start_timestamp_seconds": 145.72,
    "end_timestamp_seconds": 237.48,
    "start_timestamp": "02:25",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=145",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "video, I'll link to that in the notes below. The reason why I think this is the place to start is because this provides the framework. Most traders begin trading options by learning some sort of random option structure. You learn verticals, you learn iron condors and whatever structures you come across. Then the way traders start is they say, oh, I'm going to figure out how to use this vertical spread. I got to figure out how to manage this vertical spread. Warren reality, it's completely backwards. The correct place to start with stuff like this is to look at a profit mechanism to assess the profit mechanism. So again, going back to this example, if I was looking at price direction up, meaning I think the thing is going to go up. And I'm analyzing the behavior of X on mobile versus Tesla. The profit mechanism looks different in these two types of names. How so? Clearly, Tesla is way more volatile. And we can see that represented in some really simple volatility metrics, like average true range or average daily range, where it's two to three times what you see in X on mobile. So because of that and because of analyzing the specific profit mechanism that I'm trying to capture, that will directly inform how I might want to manage my trade. So let's take a look at an example. I'm going to take a look at zero DTE index volatility risk premium. So this is",
    "start_timestamp_seconds": 224.8,
    "end_timestamp_seconds": 313.84,
    "start_timestamp": "03:44",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=224",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "that and because of analyzing the specific profit mechanism that I'm trying to capture, that will directly inform how I might want to manage my trade. So let's take a look at an example. I'm going to take a look at zero DTE index volatility risk premium. So this is like zero DTSPX options and stuff like that. The first thing I need to do is take a look at SPX options. I need to take a look also at SPX on zero DTE timeframes. And I need to look at how does it behave. So let's go to a chart. Let's throw in SPX and let's just see eyeball. What does it look like to me? Well, I can clearly see some standard tendencies across the size of these candles on an intraday timeframe. I can see that every once in a while there are these really big candles. Those are going to be difficult to manage. What I'm doing down here is I'm actually creating a standard deviation price spike plots. They'll help me understand how frequently do we have moves that are outside one standard deviation two, three, four, plus and so on. So what I'm doing is I'm quantifying in qualifying. How does this thing tend to behave on an intraday basis? Then I can do the same for volatility. Now again, you have to remember to match volatility to what you're looking at. All of this is like seven day vault, 30 day vault that",
    "start_timestamp_seconds": 295.48,
    "end_timestamp_seconds": 380.28,
    "start_timestamp": "04:55",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=295",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "is I'm quantifying in qualifying. How does this thing tend to behave on an intraday basis? Then I can do the same for volatility. Now again, you have to remember to match volatility to what you're looking at. All of this is like seven day vault, 30 day vault that doesn't match zero day vault. So the way that I can sample zero day vault is maybe by looking at the straddle for zero days. And I can compare that against the prior moves to have an understanding of what is the current vault compared to recent history. Maybe I can assess variance risk premiums off of that. So once I understand the profit mechanism, notice how I haven't even talked about attempting to trade as specific strategies. It doesn't matter yet. I need to understand the profit mechanism. Then after doing that exercise, I say to myself, well, short straddles or strangles seem to be appropriate here in some capacity. So what I need to do now is test. I need to think about the different ways I can manage these positions. I can close it for a loss. I can roll it in some capacity. I can define the risk. I can take it to expiration. There's effectively only a handful of things you can do with your options. So you can shrink the universe that you're exploring by starting by outlining those things. Then I test what I want to do is understand what works, what doesn't",
    "start_timestamp_seconds": 364.28,
    "end_timestamp_seconds": 447.8,
    "start_timestamp": "06:04",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=364",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "the risk. I can take it to expiration. There's effectively only a handful of things you can do with your options. So you can shrink the universe that you're exploring by starting by outlining those things. Then I test what I want to do is understand what works, what doesn't work, and what holds up over time. So this is a plot where I'm analyzing different delta straddles and strangles entered at different timeframes managed in different methodologies, changing specific parameters at each step. I do this for a broad timeframe, and then I shrink it into smaller timeframes. This is how I test how robust the concept is. And at the end of this exercise, I now have an understanding of what management style makes sense in guess what it isn't, managing it at 50%. Or managing it at some arbitrary timeframe. I know what works for this specific profit mechanism that I turn into a strategy. And then I optimize. It's not building the plane as you're flying it where you're in the trade, and then you're like, oh, what should I do now? If you go through Reddit, you'll see a hundred of those posts. It's so common. But it's the exact wrong way to do this. You start profit mechanism, then you fit structures to see what might make sense. You turn those into strategies. You test those strategies, and you tinker with different management approach. Then you codify. That's the way you manage an option",
    "start_timestamp_seconds": 433.48,
    "end_timestamp_seconds": 530.2,
    "start_timestamp": "07:13",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=433",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 536.0
  },
  {
    "video_id": "RH4ctx9rHno",
    "title": "Options Trade Management Rules I Wish I Knew Earlier ",
    "text": "common. But it's the exact wrong way to do this. You start profit mechanism, then you fit structures to see what might make sense. You turn those into strategies. You test those strategies, and you tinker with different management approach. Then you codify. That's the way you manage an option straight, not randomly being outlier, see all that.",
    "start_timestamp_seconds": 511.08,
    "end_timestamp_seconds": 530.2,
    "start_timestamp": "08:31",
    "video_url": "https://www.youtube.com/watch?v=RH4ctx9rHno",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=RH4ctx9rHno&t=511",
    "chunk_index": 7,
    "word_count": 58,
    "upload_date": null,
    "duration": 536.0
  }
]