[
  {
    "text": "What's up outliers? I've got three things on the docket for us today. I want to talk about AVGO and kind of the tech sector as a whole because AVGO is reporting earnings right now and it's not going great. Then I want to take a look at a couple market scans to help give some context about the broader market picture that we're currently in. And then I want to take a look at GameStop at the end of the video. I mean, quick preamble. I did a quick stroll through. I didn't see anything like jumping out at me, but there are a couple things that I think are worth highlighting. So I'll spend a little time taking a look at that towards the end. All right. So first things first right now, Broadcom AVGO is in the process of reporting its earnings. We can see that they beat on EPS. They came in at 124 versus 95 cents expected and they're down. They're down 10 points from 152 trading right now at 142. Now it's still unfolding. So there is a chance that this might bid up a little bit, but it's struggling in a couple different areas. So when I was looking through the earnings to get a sense, you can see here it says Broadcom boost AI revenue outlook, but it falls after mixed earnings. So it's kind of talking about the rest of the operation of the company. And I haven't gone through all",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=0"
    }
  },
  {
    "text": "areas. So when I was looking through the earnings to get a sense, you can see here it says Broadcom boost AI revenue outlook, but it falls after mixed earnings. So it's kind of talking about the rest of the operation of the company. And I haven't gone through all the way through in detail. So there's going to be tons of better information with respect to the nuances of the qualitative components of their release itself, but from a high level overview as it's unfolding right now, what I can tell you is the market doesn't like it. So I think this is topical because Broadcom is another really large company. And when we look across the broader tech sector right now, it was just starting to grab just anything it can hold on to. So we can see in the cues, it's have these two days side by side consolidating which looks okay. Until you look at the tech sector specifically, and you can see it's had this big, massive drop off, come the third, and it's just holding on for dear life right here. Now from a broader market perspective, what I don't love are the things that I've been highlighting that are showing strength are starting to rotate a little bit. So for example, XLF, big drop down here, don't like that, XLV, big drop down from the high that it posted yesterday, XLU is still hanging in there. It posted a high did close down",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:02",
      "start_timestamp_seconds": 62.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=62"
    }
  },
  {
    "text": "that I've been highlighting that are showing strength are starting to rotate a little bit. So for example, XLF, big drop down here, don't like that, XLV, big drop down from the high that it posted yesterday, XLU is still hanging in there. It posted a high did close down a little bit lower so I don't love that, but it's still showing highs. XLRE still hanging out near highs, XLP, near highs, XLB continuing that downtrend, XLC, starting to level out a little bit, XLE down to the floor. So we're still seeing this broader capitulation which I continue to point out because if you're trading broad sectors like the SP 500, it's very tech heavy. Tech right now is not doing a lot to prop up this index, so it's these other, it's the combination of these other sectors that are generally keeping us alive here. As soon as they start falling off a cliff too, then there's really nothing holding this up, which I just don't love. It goes back to this tentative point I continue to highlight. The percentage of SP 500 stocks above a 50 day moving average is now dropped to 66. So it's not abysmal yet, but this is not good. I don't like seeing this below 75 for these really aggressive down moves. Sometimes it'll dip below 75. That's not abnormal. If I zoom this out to a longer term time frame, it'll happen, but you'll see that it also spends massive",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:02:09",
      "start_timestamp_seconds": 129.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=129"
    }
  },
  {
    "text": "not abysmal yet, but this is not good. I don't like seeing this below 75 for these really aggressive down moves. Sometimes it'll dip below 75. That's not abnormal. If I zoom this out to a longer term time frame, it'll happen, but you'll see that it also spends massive amounts of time above that 75 when it's in these broader accumulation phases, obviously. Nothing really revolutionary there, but I don't like how steep this is starting. And the reason why I care about this is because again, this is the percentage of stocks within the SP 500 above a 50 day moving average. So if the percentage of stocks above the moving average is contracting, it tells me the breadth underneath the surface is starting to rotate over. Now this again, isn't all doom and gloom. I don't think that the market is necessarily clearly heading lower yet, but I also don't think that it's not. I think that we are still at a very, very tentative time when I look across the markets. We can see that the moving averages, the shorter term are all rotating over on spy. And now we're just about to bump into this 50 day moving average. I don't have the 200 days on here right now. We have that on the main chart, but it just looks rough is the way I look at it. Now the VIX is not confirming a lot of this. So that gives me a little bit",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:03:22",
      "start_timestamp_seconds": 202.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=202"
    }
  },
  {
    "text": "50 day moving average. I don't have the 200 days on here right now. We have that on the main chart, but it just looks rough is the way I look at it. Now the VIX is not confirming a lot of this. So that gives me a little bit of interest that the market isn't necessarily super concerned about this down move, but even down to momentum indicators, they're all starting to flatten out, rotate over. I already have my maximum exposure right now in SP futures. I intend to not add anything more until we start to stabilize. It doesn't look bad here again. We're still well within striking distance of highs. Term highs here is 565 against where we're at right now 549, but this kind of rounding top just isn't my favorite. So that's the market at large. Now I want to show you two different scans. This scan is looking at the stocks that have options. So this isn't the entire stock universe. These are stocks that have options that are within 5 of a 52 week high. And I just want to show you the number of returns here. There's 1719 that are 5 off 52 week highs. Now if I change this now, 5, but I'm going to update the script so that we look for 52. He lows. Remember, it was just over 171719 is what you saw before. You see 426 in the same population. So looking across this quickly, it",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:04:25",
      "start_timestamp_seconds": 265.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=265"
    }
  },
  {
    "text": "off 52 week highs. Now if I change this now, 5, but I'm going to update the script so that we look for 52. He lows. Remember, it was just over 171719 is what you saw before. You see 426 in the same population. So looking across this quickly, it still tells me that there are lots of companies that are doing absolutely fine here. And when I look across the things that are near lows, again, this is filtered by optionable, which is important because this isn't everything in the the universe. This isn't representative of everything. This is just closer to what I would trade. But I see energy and materials and industrials. This makes up a significant bulk of what we see here. Information technology isn't really the bulk of what I'm seeing in here. So it tells me that there are some companies that are obviously falling off and approaching towards lows, but even stuff like Nvidia that has had a bit of a down move. It's clearly not hovering near lows. So now if I change this again, one more time, and I want to filter it again by the sectors so that you can see for the high part of this equation what that looks like. And you'll get a sense of how things are broadly performing. So just give this a seconds run. We'll filter it again by sector. I have a bunch of custom scripts in here like a lot of these",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:05:30",
      "start_timestamp_seconds": 330.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=330"
    }
  },
  {
    "text": "see for the high part of this equation what that looks like. And you'll get a sense of how things are broadly performing. So just give this a seconds run. We'll filter it again by sector. I have a bunch of custom scripts in here like a lot of these are custom. That's why you see it like slowly trickling in because I'm asking it to do actually kind of a lot. And let's take a look. So I see a few in energy, few in industrials, not much. I still see financials really leading this. And again, this is what I've been talking about for a while while the strength. I see information technology. I see two companies within it that have options that are near highs. So it tells me that we're in a bit of a distribution phase for things that dominate fall within tech. So it's just none of this is like massively game changing information, but hopefully it provides a little bit of context on how we can look at the market in a couple different levels and look for confluence of information or look for divergences in information. So now the last thing I want to take a quick look at with you as I promise in the beginning is game stop. Now again, there isn't a whole lot that I wanted to dive into on this. I actually am saving a lot of the material that I want to look at for the",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=394"
    }
  },
  {
    "text": "want to take a quick look at with you as I promise in the beginning is game stop. Now again, there isn't a whole lot that I wanted to dive into on this. I actually am saving a lot of the material that I want to look at for the game stop live stream, which is scheduled for Saturday at 5 p.m. Pacific time. And that one I want to spend quite a bit of time going through roaring kitties, old options positions using on demand to go back in time and like actually look at the markets when he was placing those trades to really help me understand some of the decisions he's making and stuff. Now that part side looking at game stop as it sits today, we continue this sideways trend. It is down trending again from this recent slight peak high here, but again, I see a higher low so far. So this is our low kind of just looking at the small range window here, see a low here. Now I see a higher low being built. So hopefully that's sustained and then kind of turns into a bit of a rally point. But again, we have earnings coming up. So it's always a crapshoot whenever you have earnings involved. Now the main thing I wanted to show you is from the options chain. I still see that two to one ratio calls to puts total. And I see the call side growing a little",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:07:42",
      "start_timestamp_seconds": 462.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=462"
    }
  },
  {
    "text": "we have earnings coming up. So it's always a crapshoot whenever you have earnings involved. Now the main thing I wanted to show you is from the options chain. I still see that two to one ratio calls to puts total. And I see the call side growing a little more aggressively than the put side. Now this still is moderate enough that like I'm not thinking anything massive is happening here. It's a little too early to decide anything like that. But it does tell me that there's still at least a bit of bullish activity going on in here, although we're just not seeing a lot of movement at a game stop. So my game plan remains the same as per usual. I am very eager to see earnings come out. I know that we have some ideas on what it will look like, but I'm eager to see the way that the options markets position before earnings. I'm really eager to see the way that markets move after earnings comes out. I'm eager to see if there's some sort of read into the way that we're going to use the money that game stop has. Again, I've been told a few times by folks to kind of not expect that. So I'm reeling that forward. So that my eagerness doesn't turn into other people's disappointment. But it looks like based on what I've been told it's unlikely that they'll share anything like that. I still hope they",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:08:40",
      "start_timestamp_seconds": 520.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=520"
    }
  },
  {
    "text": "been told a few times by folks to kind of not expect that. So I'm reeling that forward. So that my eagerness doesn't turn into other people's disappointment. But it looks like based on what I've been told it's unlikely that they'll share anything like that. I still hope they do because I want to know. So yeah, there's some of those things coming down the pike, but otherwise relatively quiet in here as far as I am concerned. And the other thing that I do want to highlight though from the options picture itself is that if we take a look specifically at exploration that includes earnings is it's quiet. Yeah, it's three to one ratio calls to puts, but the reason why I'm eager is because I think we need to get through this week. I think we need to see these 100,000 and 27,000 roll off and then move into the next front exploration, which will be earnings. Now what I want to know is will the earnings expiration get more spicy than what we see in this non earnings weekly expiration and success? Because that tells me if there's people actually playing the earnings. So I'm going to monitor this 13 step expiration and see if we start expanding above 100,000 pretty quickly because then that tells me that yeah, there's people not only rolling over into the next front exploration, but also trying to play earnings. So I am very interested to see how that",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:09:43",
      "start_timestamp_seconds": 583.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=583"
    }
  },
  {
    "text": "going to monitor this 13 step expiration and see if we start expanding above 100,000 pretty quickly because then that tells me that yeah, there's people not only rolling over into the next front exploration, but also trying to play earnings. So I am very interested to see how that goes. The way I'm looking at markets right now is taking very interest premium opportunities as they emerge. I'm tentatively looking to trend follow the indices with futures, but very, very light right now because they are not trending. And I'm looking for directional plays using things like ratio called diagonals and stuff like that because there are a lot of opportunities to find strength. It's just in smaller groupings right now. So it takes a little more research to come across those and build a portfolio. But the one thing I can say is this is not a place where I'm looking to use and deploy a ton of capital because I do not like when the market is hanging out near all time highs and starting to stall. I never like that. That again does not mean that we crash, but it means I don't want a top tick. Start getting long at the very top before we have some sort of pullback because then again, there's an opportunity to cost to that capital. So name of the game, agile, fast on the feet, even though you boys have herniated this. So I'm not really fast at all.",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:10:47",
      "start_timestamp_seconds": 647.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=647"
    }
  },
  {
    "text": "tick. Start getting long at the very top before we have some sort of pullback because then again, there's an opportunity to cost to that capital. So name of the game, agile, fast on the feet, even though you boys have herniated this. So I'm not really fast at all. Maybe my thumb will be super fast. Something like that. As always, anything you want me to take a look at, let me know, be an outlier, and I'll see you all later.",
    "metadata": {
      "video_id": "rjj0k0T0384",
      "title": "AVGO Earnings, Tech, GME Options | Stock Market Update",
      "url": "https://www.youtube.com/watch?v=rjj0k0T0384",
      "upload_date": "",
      "duration": 727.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:11:44",
      "start_timestamp_seconds": 704.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=rjj0k0T0384&t=704"
    }
  }
]