[
  {
    "text": "We're going to dive into option liquidity. What it is, what to look for, how to assess it. I'm going to give you a checklist. I'm going to give you some real examples along the way. So that you understand what it actually looks like in a practical scenario, what things impact it and how. So at the end of the video, you should have a really good understanding of how to assess and find liquid options. What's up, everyone? Eric here. Welcome back to all the outliers. Shout out to the Patreon family. Let's get right in. So what is option liquidity? It's essentially the ability to transact at a fair price when you want. The vast majority of instances where retail traders are putting in orders, we are consuming liquidity because we're replacing an order. It gets filled. You've just taken an order off the market that somebody else could have used. And somebody gave you the ability to transact there. That's liquidity. Now, if you submit an order and it's resting, well, then actually you're giving somebody else the ability to trade. You're providing liquidity with that position. So just some nuance. Now, I want to talk about some of the massive mistakes people make with respect to liquidity. And this is the biggest one. There are two key components of an options trade. The entry and the exit. Traders are really good at analyzing liquidity when we're trying to get in. Once we know we should,",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=0"
    }
  },
  {
    "text": "about some of the massive mistakes people make with respect to liquidity. And this is the biggest one. There are two key components of an options trade. The entry and the exit. Traders are really good at analyzing liquidity when we're trying to get in. Once we know we should, what most traders are not good at is conceptualizing liquidity when we're looking to exit the trade. What this could look like when we're ready to get out because these different forces can impact liquidity. And at the end of the video, you'll be able to have a much better idea what liquidity might look like when you're getting out. Because what's really frustrating is if you put on a trade, you struggle to get in. Then you have this big fat profit that you're sitting on. And then when you try to get out, you can't exit at a fair price. So then you start giving up your profits because you have to adjust your price in order to try and exit. We want to avoid that. So there's a few metrics that we care about. This isn't really a holistic list. There's a few more things that you'll hear throughout the video. But these are kind of the primary ones we can start with. The number of expiration cycles is a really simple test of liquidity because they only offer more expiration cycles when there's demand for them. Meaning there's enough volume in people transacting to drive liquidity.",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:01:36",
      "start_timestamp_seconds": 96.44999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=96"
    }
  },
  {
    "text": "hear throughout the video. But these are kind of the primary ones we can start with. The number of expiration cycles is a really simple test of liquidity because they only offer more expiration cycles when there's demand for them. Meaning there's enough volume in people transacting to drive liquidity. That's why if we take a look at something like QQQ, you can see that it has a bunch of these extra expiration cycles. Standard expiration cycle is just the third Friday of the month. So right here is a standard expiration cycle. You'll notice that there's a ton of additional ones around this. If you take a look at CNX, you'll notice that this is a product that only has standard expiration cycles. And this is very common. We are now just seeing options becoming more popular in things like spy being able to offer essentially daily expiration cycles, which is very cool. But that's the first thing you can look for to see if something's liquid or not. Does it have weekly expiration cycles? And if so, it's probably slightly more liquid. And for me, that's a primary filter I use just because it's easier. You can look. It's about 550 products that will have weekly expiration cycles and they're typically more liquid than those that don't. We care a lot about the bid-ask spread, which we're going to talk a lot about in this video. Now, a quick cliff notes of that. If you look at any",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.89999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=192"
    }
  },
  {
    "text": "It's about 550 products that will have weekly expiration cycles and they're typically more liquid than those that don't. We care a lot about the bid-ask spread, which we're going to talk a lot about in this video. Now, a quick cliff notes of that. If you look at any option, right? So let's look at this at the money call. The bid-ask spread tells you essentially where you have to transact that if you want to get a fill this instant. So what that means is the bid is the most somebody is willing to pay for something right now. The offer is the cheapest somebody's willing to sell something at. This is the bid-ask spread. This is what market makers and other market providers are typically trying to capture. And it's kind of the same thing if you go to an airport and there's a currency exchange. They typically will buy lower than what they'll sell at and they capture that difference. That's what's happening here. So if you want to get a fill this instant, they're showing you where you have to go in order to get there. Now, smart traders will try to play what we call the mid price, the difference between these. And you can typically get a fill in there, but it's not guaranteed. And sometimes you have to move it around if you pennies to find your fill. But if you want to get a fill right now, you have to go",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:04:49",
      "start_timestamp_seconds": 289.34999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=289"
    }
  },
  {
    "text": "call the mid price, the difference between these. And you can typically get a fill in there, but it's not guaranteed. And sometimes you have to move it around if you pennies to find your fill. But if you want to get a fill right now, you have to go to the bid or the offer or you can submit something like a market order. But that's typically a worse fill, meaning you don't get a great price. You don't get a good bargain, which we want to avoid. You can then also look at things like the volume for the options chain, for the individual strike you're looking at. Those matter quite a lot. We also care about the total open interest. What delta your option is the days to expiration? We didn't tell all of these impact your options liquidity, but they all do. So let's talk about these. When we think about the impact of an underlying price on liquidity, one of the effects that you'll notice is that if we look at more expensive underlines, they will naturally have wider bid-ask spreads. So if I grab something like MSTR, which is a 1,500 product give or take, you'll notice that the liquidity here, it's much wider. So if I'm looking at an at the money, 49 DTE, out of the money, but it's at the money call, the bid on this is 196.30, and the offer is 212. So it's a pretty big bid-ask spread. It's",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:06:25",
      "start_timestamp_seconds": 385.79999999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=385"
    }
  },
  {
    "text": "take, you'll notice that the liquidity here, it's much wider. So if I'm looking at an at the money, 49 DTE, out of the money, but it's at the money call, the bid on this is 196.30, and the offer is 212. So it's a pretty big bid-ask spread. It's like 16 points, but it's a 1,500 product. If we take a look at something like Spy, which is still pretty expensive, it's 5.32, but you'll see that these for the at the money, they're 16.86 by 17.39. So much smaller of a bid-ask spread than what you just saw on MSTR, but it's also much cheaper. And then you can look at something even cheaper still, like maybe QLD, which is 86. And you'll see that this kind of varies a little bit, but this is 6 by 690. This is actually a less liquid product because do you notice how many expiration cycles there are? There's just not that many. And then if we take a look at the overall open interest across a different series of expiration cycles, there's 9,000 options. But then if we take a look comparatively to Spy, look at all these different expiration cycles, and then take a look at the open interest, there's 8.8 million options. So there's a few things you should have picked up from what I just shared. The first thing is that the price of the underlying impacts the liquidity of your option. More expensive underlines will typically",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:08:02",
      "start_timestamp_seconds": 482.24999999999994,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=482"
    }
  },
  {
    "text": "cycles, and then take a look at the open interest, there's 8.8 million options. So there's a few things you should have picked up from what I just shared. The first thing is that the price of the underlying impacts the liquidity of your option. More expensive underlines will typically have wider bid-ask spreads, less liquid options, on a relative basis. As volatility expands, that will impact your options liquidity, which we'll take a look at. The type of strike also impacts your options liquidity. So what does that mean? Well, if we take a look at something like Jimmy, and we take a look at these 14 DTE options, let's take a look at the open interest for some of these options. Let's take a look at these 21.5. Notice that it's 21.5. The liquidity on those options of the current OI is 204 options. But if I look at the 21s, there are 1,033, or if I look at the 22s, there are 2,590. So what I'm showing you is a standard strike price is going to have more liquidity, more often than not, than half strike prices or other kinds of strike prices. The other thing you'll notice is that round numbers, things like 20, 25, 30, will tend to have more open interest in tighter options. Let's take a look. These 20s, there's 9,000 options. Then if we take a look at the 21s, there's a 1,000. If we take a look at the 22s, there's",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:09:38",
      "start_timestamp_seconds": 578.6999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=578"
    }
  },
  {
    "text": "notice is that round numbers, things like 20, 25, 30, will tend to have more open interest in tighter options. Let's take a look. These 20s, there's 9,000 options. Then if we take a look at the 21s, there's a 1,000. If we take a look at the 22s, there's 2,500. And then let's see what happens when we get to 25. There's 17,800 options. This is just human psychology at play. We like round numbers, and that's all this is. So now you know the price of the underlying impacts it and how you know that the strike type impacts it and how, meaning if it's a weird strike or if it's a standard strike or if it's a round number or not. We also know things like further out of the money or in the money can impact our options. So let's take a look what that looks like. If we take a look at these deep in the money options, you'll see that they're bid 16, 70 by 17, 40. But then if you take a look at these at the money options, their bid 92 cents offered 1. Much tighter than the in the monies. And then typically as you get further out of the money, the same thing will happen. Why is this? Because the market is more liquid when more people are transacting at those levels and the majority of instances, people transact at two points. Options that are nearer in expiration. So typically",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:11:15",
      "start_timestamp_seconds": 675.1499999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=675"
    }
  },
  {
    "text": "then typically as you get further out of the money, the same thing will happen. Why is this? Because the market is more liquid when more people are transacting at those levels and the majority of instances, people transact at two points. Options that are nearer in expiration. So typically within 30 days, you'll see more options activity and options that are closer to at the money tend to be more active. So as you go further out in time, you'll notice that options become less active. And I'll show you, again, using GameStop. Right now the average open interest is 556,000. So if we take a look, let me just do it as all really quick. So it'll be a little easier to see. Let's take a look at two different expiration cycles. This is a standard expiration cycle, which is the third Friday of the month. This will typically be more liquid than other weekly expiration cycles. So as I said before, I like to look if they offer weeklies, but I still try to stay in the standard expirations because they're going to be more liquid. So if we take a look at this 16-OG, you'll see that we have 228,000 calls against 107,000 puts. So about 330,000 ish. If we go further out in time to this 18 October, which is a standard expiration, but there's 90,000 and 62,000. Way less options. And this is standard. This is not unique to GameStop. This is very, very",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:12:51",
      "start_timestamp_seconds": 771.5999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=771"
    }
  },
  {
    "text": "that we have 228,000 calls against 107,000 puts. So about 330,000 ish. If we go further out in time to this 18 October, which is a standard expiration, but there's 90,000 and 62,000. Way less options. And this is standard. This is not unique to GameStop. This is very, very common for pretty much any other product that you'll find. So we now know that as you go further out of the money or in the money, and if you're using longer dataed expiration, you're going to see less liquidity. So then how does volatility impact it very simply? As volatility expands, bid-ask spreads widen. And I'll have a specific example for you to take a look at. But if you take a look at something like QQQ, as volatility has been expanding, that's what these yellow lines represent, the options have become wider bid-ask spread. And that serves as a natural breaking function for crazy runaway markets. Now again, I'll show you an example of that in a minute. So let's talk about how can you conceptualize liquidity? How do you know if something is liquid or not? You can create a benchmark. So what I would do is take a look at the underlying that you want to trade. We need to know what the DTE, what the Delta, what the type of option, whether it's a caller or put. And then we take the bid-ask spread as a percentage of the strike price. This creates a bid-ask",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:14:28",
      "start_timestamp_seconds": 868.05,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=868"
    }
  },
  {
    "text": "take a look at the underlying that you want to trade. We need to know what the DTE, what the Delta, what the type of option, whether it's a caller or put. And then we take the bid-ask spread as a percentage of the strike price. This creates a bid-ask ratio. I'll show you what it looks like. And then find the same option in Spy and Compare it. So in this example, if I want to compare McDonald's and I want to use the 49 DTE expiration first strike out of the money, this is a 47 Delta, something like that, I'll take that down and then I'll look at it. And then I'll come over to Spy, I'll find that same 49 DTE. I'll find something that's right out of the money. In this case, it's a 54 Delta. So you could also compare the actually same Delta, which in this case is a 47 Delta. So if I grab that same 47 Delta 49 DTE option, so that I'm comparing the same thing across the board, I grab QQQ Spy, MSTR and MCD for your reference. And for those that are in the outlier Pro Patreon, I'll have a download for this just as a template. Super simple to make. All you do is take the same strike to make sure you're comparing the same thing, take the bid-ask, make sure it's the same type of option. You figure out the bid-ask spread and then you take",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:16:04",
      "start_timestamp_seconds": 964.4999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=964"
    }
  },
  {
    "text": "have a download for this just as a template. Super simple to make. All you do is take the same strike to make sure you're comparing the same thing, take the bid-ask, make sure it's the same type of option. You figure out the bid-ask spread and then you take a ratio of the bid-ask by the strike price. And this will help you understand what's liquid. So in this case, we can see Qs are actually even more liquid than Spy. And we can see that MCD is pretty liquid and we can see on a relative basis, MSTR, is not super liquid. Now you'll get a feel for what actually is liquid and isn't. But in this case, something that's less than a percent of bid-ask spread, I'm not super concerned about it. That's about okay. However, go back to this point. This is to enter the position. So we know right now that the market is a little bit more volatile, things are selling off. So if I think it's going to be less volatile in the future, then this should be about as bad as it's going to get in terms of liquidity. Now, if I think it might be even more volatile when I'm exiting, I have to expect this to guide up. And if it guides up too far, then I have a problem. So here is a quick checklist you can use. I typically am going to stick to things that are above",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:17:40",
      "start_timestamp_seconds": 1060.9499999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=1060"
    }
  },
  {
    "text": "think it might be even more volatile when I'm exiting, I have to expect this to guide up. And if it guides up too far, then I have a problem. So here is a quick checklist you can use. I typically am going to stick to things that are above 5 is an underlying, just for general best practice. I like weekly explorations. You can make this comparison just like I showed you. And there's one other component. Based on how often I'm planning on transacting matters. So for example, if I'm trading something like a covered call where I'm not really expecting to do anything once I sell the option, it'll either be out of the money and expire or be in the money and I'll be assigned. I don't actually care quite that much. Because I'm not transacting that much. But if I'm trading something like a ratio diagonal, which has more options legs that I'm moving around a lot or if I'm trading zero DTEs, I need a lot of liquidity because I'm transacting a lot. So what this means is the more you transact, the more liquid you need the underlying to be. Now, there's one other example I want to show you. And this is looking at a stop. And I'm looking at two different time frames for a comparison. Take a look at the periods I'm going to show you. Here, which is the second of May and here, which is the seventh. What",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:19:17",
      "start_timestamp_seconds": 1157.3999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=1157"
    }
  },
  {
    "text": "other example I want to show you. And this is looking at a stop. And I'm looking at two different time frames for a comparison. Take a look at the periods I'm going to show you. Here, which is the second of May and here, which is the seventh. What do you think the difference in liquidity in just this is after this move? Notice how I'm not using an extreme. I'm not using any of these days. I'm comparing the liquidity between this day and this day. What do you think you're going to see throughout in the comments? And then I'll show you. I looked at two different time frames, the 15 and 50 DTE on second May. And I looked at the same aspirations. So then they became 10 DTE and 45 DTE, which, as you know, these are getting closer to expiration. So these should actually be more liquid. So let's see what this looked like. I'm comparing the call and the put side, the bid as the bid as spread. And then I'm looking at a delta here. I tried to normalize closest. So most of these are not perfectly 75 or 50 delta. But they're definitely less than 0.05 off. So it's the closest I can find to these. And you'll see that, again, in kind of that 2 May period, that for the at the monies, we typically see better bid as spreads, meaning they're tighter. That's standard fare. And we also see",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:20:53",
      "start_timestamp_seconds": 1253.85,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=1253"
    }
  },
  {
    "text": "they're definitely less than 0.05 off. So it's the closest I can find to these. And you'll see that, again, in kind of that 2 May period, that for the at the monies, we typically see better bid as spreads, meaning they're tighter. That's standard fare. And we also see that the closer DTE has tighter bid as spread, which is also standard fare. You know all of that now. Now let's see what happened on the 7th of May. If we take a look at the options, take a look at how massively the bid as spread changed in this scenario. The reason why I'm highlighting this scenario, and that should be a 1.11. Got that doctor right up for us. And you'll notice across the board that the bid as spreads widened. And you can see some of them widened by a lot. If we look at this 0.5 delta, we went from a 0.07 spread to 0.29, a massive change. So what I'm highlighting to you is in this example, this isn't even that big of a move. And it's up typically when things are going up, volatility declines, and spreads would be a little bit more favorable to us. But in this case, you can see during this up move, it's a different scenario. Valtility actually expanded, and that widened the bid as spread. But what I'm highlighting is this isn't even an extreme. This is a relatively mellow move for something like GameStop. It went",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:22:30",
      "start_timestamp_seconds": 1350.2999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=1350"
    }
  },
  {
    "text": "favorable to us. But in this case, you can see during this up move, it's a different scenario. Valtility actually expanded, and that widened the bid as spread. But what I'm highlighting is this isn't even an extreme. This is a relatively mellow move for something like GameStop. It went from 11 to 16, big move, but not crazy. And definitely not something like from 17 to 80 pre-market. So you have to consider what you're trading and the lifecycle of the trade to make sure that it is liquid for you. If you have any questions, as always, let me know being outlier. See you guys later.",
    "metadata": {
      "video_id": "RJPIDB___YE",
      "title": "Option Liquidity and Bid Ask Spread Explained: A Complete Guide",
      "url": "https://www.youtube.com/watch?v=RJPIDB___YE",
      "upload_date": "",
      "duration": 1052.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:24:06",
      "start_timestamp_seconds": 1446.7499999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RJPIDB___YE&t=1446"
    }
  }
]