[
  {
    "text": "Hey everybody, Eric here with the super riveting topic of tax section 1256, which is also known as kind of a 6040 tax treatment. So what actually inspired me to do this video now, it's been on my to do list like literally for months is I saw somebody posting on one of my posts on Reddit that essentially, you know, that they're making quote unquote six figures on long term call options in the spy, which you know, if it's true, good for them. But I was really surprised to hear that just because that is just grossly inefficient. One, in order to generate that capital from long term options, you would need to be trading multiples of contracts on long dated options, which tend to be less liquid. And then more over than all of that, they're missing this entire possibility, which is super important, especially for, you know, folks with larger accounts, this starts to matter a lot. So not necessarily the funnest conversation on planet earth, but I'm going to do my best to get through it quickly. And efficiently so that everybody can move on with their lives and not worry about taxes quite as much, but nonetheless, super freaking important. So let us take a look. So section 1256, there's actually a form from 2020. It's formed 6781 from the IRS's web page. I'm going to link to that in the description so that if you want to check it out, essentially, it's the",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=0"
    }
  },
  {
    "text": "much, but nonetheless, super freaking important. So let us take a look. So section 1256, there's actually a form from 2020. It's formed 6781 from the IRS's web page. I'm going to link to that in the description so that if you want to check it out, essentially, it's the form that you would fill out with the 1256 information. But if you scroll to the bottom, it has this section right here. And it tells you exactly where to go to understand what they consider a section 1256 contract. The punchline is there are certain products that are classified differently than other products. So options, securities, bonds, all of those different products have certain classifications and a handful of those kind of roll up underneath the section 1256 contracts. So what is the 6040 tax treatment? Well, I'll tell you what it is. It's this right here. So essentially, 60 of that trade will be taxed at your brackets long term capital gains tax. And then 40 is going to be at the ordinary rate, whatever that is. And this should be 37, not 27. So that's just a little error. Let's just real quick come in here and go, 37. As if it was like that the whole time, except now, you know, it kind of like lines up here. That's compared to everything else, which is just like really nice straight across, really clean that up. I bet. But joking aside, there's really a pretty significant benefit",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:01:07",
      "start_timestamp_seconds": 67.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=67"
    }
  },
  {
    "text": "go, 37. As if it was like that the whole time, except now, you know, it kind of like lines up here. That's compared to everything else, which is just like really nice straight across, really clean that up. I bet. But joking aside, there's really a pretty significant benefit to this. So for those of us that trade shorter time frames, normally you are taxed at whatever your ordinary rate is, whatever your tax bracket is. So as you can see, I pulled the top three. And this is whatever your ordinary tax rate would be. So the top three tax brackets in 2020, 32, 35, 37. There's obviously more tax brackets than that, but not to say they don't matter, but for this conversation, they are slightly less pertinent. And then this column right here, I can clear that out. So it's easy. Oops, made a mistake. It should be this. There we go. So this is the long term capital gains brackets. So this means essentially up until the 37 tax bracket, you're going to get charged at a 15 long term capital gains tax for products that you hold over a year. And if you're in this 37 bracket, it's 20. So what happens with these 60, 40 tax treatment is kind of magical for the higher tax brackets. You can see that at this 37 tax rate, it gets reduced essentially to a 27 tax rate. So that's only for section 1256 contracts. So again,",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:02:32",
      "start_timestamp_seconds": 152.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=152"
    }
  },
  {
    "text": "this 37 bracket, it's 20. So what happens with these 60, 40 tax treatment is kind of magical for the higher tax brackets. You can see that at this 37 tax rate, it gets reduced essentially to a 27 tax rate. So that's only for section 1256 contracts. So again, for the person that I read the post on Reddit, this would be massive for them. Because essentially they have the chance to lower their tax rate around 10. That's a big deal, especially for bigger contracts. That's why I was surprised to see if they're trading that size in the spy and they're only trading long calls. To me, it would be mindless not to trade something like this. Really be an additional reason on top of the tax treatment is just the leverage of the product. The spy is a tenth the size of the SPX. So you have to trade 10 times the number of contracts equal one contract size on the other. So then you just run into the efficiency issues of getting a bit asked spread for 10 separate lots. So if you move to something like the SPX, you can essentially trade the same exact product with less contracts, same size, and also receive preferential tax treatment. Seems like a pretty straightforward answer to me. So what are the products we can trade now this down here publication 550 and section 1256G to give you a list of what you can trade. This is",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:03:51",
      "start_timestamp_seconds": 231.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=231"
    }
  },
  {
    "text": "exact product with less contracts, same size, and also receive preferential tax treatment. Seems like a pretty straightforward answer to me. So what are the products we can trade now this down here publication 550 and section 1256G to give you a list of what you can trade. This is not a comprehensive list. This is just what I imagine is applicable to most people. So futures options on futures, those receive 6040 tax treatment. It's mostly because a lot of them are are broad based commodities or indices as is. Then this next section is kind of a really important differentiation. Broad based index as compared to securities. This is a really confusing point for a lot of people. Broad based indices are things like the SPX, the NDX. So the larger bigger brother of the smaller ETFs notice how ETFs is considered a security. They are not part of this 1256 contract tax treatment bucket. Really important to differentiate that because again, depending on what your strategy is, a lot of people ask me why I trade so much I WM. And the primary reason is because taking assignment and holding the underlying is a key part of my strategy. So these broad based indices are cash settled. They don't have an underlying to them for any sort of position that I'm trading at size that I'm not expecting to take assignment. You would better believe I'm trading the bigger brother indices so that I can enjoy the",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:04:59",
      "start_timestamp_seconds": 299.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=299"
    }
  },
  {
    "text": "my strategy. So these broad based indices are cash settled. They don't have an underlying to them for any sort of position that I'm trading at size that I'm not expecting to take assignment. You would better believe I'm trading the bigger brother indices so that I can enjoy the 6040 tax treatment. But the only reason why I spend so much time in I WM is because being able to take shares in is an important part of the primary strategies that I employ. So in summary, 6040 tax treatment is super dope for people that are in higher ordinary tax brackets that are trading less than trading within a year. So you're exposed to that ordinary tax rate for your trades. It only applies to 1256 contract products, which this is a small list here, not comprehensive, but this is the general bucket. So 4X, not on here, things like that, securities, not on here. If this is for most traders, the products that you're going to have to move into if you want to have this sort of tax advantage. The downside, like I mentioned, for some of the broad based indices is there, there's their cash settled. So it can be difficult if your strategy relies on taking the underlying in at some point might be difficult for you to deploy that. So might not be right for some of your strategies, as is the case for me. But for the strategies that you don't need",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:06:21",
      "start_timestamp_seconds": 381.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=381"
    }
  },
  {
    "text": "settled. So it can be difficult if your strategy relies on taking the underlying in at some point might be difficult for you to deploy that. So might not be right for some of your strategies, as is the case for me. But for the strategies that you don't need to touch the underlying, this is way more efficient than trying to size up in a smaller ETF and get killed on taxes. So all in all, I hope this session was helpful. I do have a couple bonus points to share for those interested. You can find out a lot more about the 6040 tax stream in in the section 1256. But really one other thing to keep in mind that's kind of nice is their market to market daily. So what that means is PNL is essentially reported daily and then you're unrealized PNL settled at your end. Wash sales don't apply here. So for people that kind of have to hold products until the end of the year to taxed harvest on products that they will otherwise are trying to avoid wash sales, it's not really the case for these kind of products. So another fun fact. There's some more good information on the IRS's website for those interested and really diving into the detail. But for a nine minute video, as much as I could pack in, is efficiently as possible. So if you can trade these, highly recommend it. It's good to know that they",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:07:50",
      "start_timestamp_seconds": 470.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=470"
    }
  },
  {
    "text": "There's some more good information on the IRS's website for those interested and really diving into the detail. But for a nine minute video, as much as I could pack in, is efficiently as possible. So if you can trade these, highly recommend it. It's good to know that they exist, but I wouldn't necessarily try to trade these if it's not part of your strategy. And you know, just for that tax treatment because you only get taxed on profits. And if you switch to a bunch of crazy strategies just to try to trade these things and you start losing money, the taxes don't fucking matter anyways, you're losing money. So folks, I'm making money first. If you can be efficient, obviously it's the way to go. All right, I hope this was helpful and I will talk to you all later.",
    "metadata": {
      "video_id": "Rlw_-sR5jm0",
      "title": "Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "url": "https://www.youtube.com/watch?v=Rlw_-sR5jm0",
      "upload_date": "20210724",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "2020 Form 6781: https://www.irs.gov/pub/irs-access/f6781_accessible.pdf\n2020 Pub 550: https://www.irs.gov/pub/irs-pdf/p550.pdf\n\nStay in touch!\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/tt9Z5dmSAF2wWaBM9\nFB Group: https://www.facebook.com/groups/esinvests\n\n#investing, #trading, #options, #tradingoptions, #daytrading, #stocks, #stockmarket, #markets, #risk, #derivatives, #futures, #ETFs, #howtotrade, #howtoinvest #iinvestingforbeginners, #investingtutorial, #investing101, #investingtips, #investingrules, #investingguide, #tradingbasics, #stockstoinvestin, #stocksportfolio, #stockschool",
      "content_summary": "Content about Tax Section 1256 and 60/40 Tax Treatment | Investor Dojo",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:08:52",
      "start_timestamp_seconds": 532.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Rlw_-sR5jm0&t=532"
    }
  }
]