[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you edge in my system. How to measure. Super interesting question. And the reason why it's so interesting is because it hits at the heart and soul of what this whole trading thing is about. It's actually why I want to open with this question. And it's because there really is absolutely nothing at all that matters in trading until you arrive at a point where you have some sort of edge. And sans edge effectively means that there's nothing for you to do until you find a way to create an extract edge. So there's no point in dealing with all of your discipline issues, trying to figure out what forecasting method works the best. Like all of that is secondary to the concept of edge. And this is why I very regularly introduce and reinforce the outlier strategy process. Here. And this is really just a way to think about finding and extracting edge. That's it. Notice the first thing that we talk about is a profit mechanism or a market effect. That that is where edge is from being able to monetize some sort of market effect. And if you're unable to identify a market effect to monetize, then you're like you're genuinely pretty much dead in the water. There's nothing for you to do",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 59,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=0"
    }
  },
  {
    "text": "profit mechanism or a market effect. That that is where edge is from being able to monetize some sort of market effect. And if you're unable to identify a market effect to monetize, then you're like you're genuinely pretty much dead in the water. There's nothing for you to do at that point. So in a way that's actually kind of cool because it gives you myopic initial focus. There's nothing else that matters. It doesn't matter if you're going to trade options. It doesn't matter if you're going to trade stock. It doesn't matter if you're going to trade futures. Literally none of it matters. Those are all just different assets. What ultimately matters here is how do we think about edge? So there's a couple ways to consider edge. Now a lot of people will talk about it in the context of alpha. Defectively there's different versions of this as well, but it's just outperformance of the market. This is stuff like risk adjusted returns, typically especially if you're looking at it in the context of an institution, although from a retail trading lens, it doesn't matter. If you take on more risk, but you outperform, right? You're not beholden to some sort of client that has risk parameters. So this is one way to think about edge. Another way to think about edge, I think, is a little more appropriate is essentially to be able to get what you want. Now, that sounds a little nebulous, but",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 59,
      "start_timestamp": "00:08:23",
      "start_timestamp_seconds": 503.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=503"
    }
  },
  {
    "text": "not beholden to some sort of client that has risk parameters. So this is one way to think about edge. Another way to think about edge, I think, is a little more appropriate is essentially to be able to get what you want. Now, that sounds a little nebulous, but the point of framing it this way is I can think of people that I've chatted with before that effectively are just trying to trade for income, for example. And they're not necessarily trying to outperform the market in terms of their percent return, but they might be trying to outperform the market in terms of reduction of draw downs in maintenance of their income. So most people might look at that and say, well, that's not alpha because you're not outperforming on a risk adjusted basis. However, it's still a completely reasonable goal for somebody to have. And if you're able to consistently hit that goal, I think it's fine. So those are the couple different ways that I think people would think about edge. And the outlier strategy process is designed to give you a lens to look for edge. And that's when we're talking about these things I refer to as profit mechanisms. And you've heard me use that term a million times and we talked about them actually in depth. So I'm not going to rehash them if you have follow on questions. Now it's the place to have that conversation. But the main thing here",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 59,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=591"
    }
  },
  {
    "text": "I refer to as profit mechanisms. And you've heard me use that term a million times and we talked about them actually in depth. So I'm not going to rehash them if you have follow on questions. Now it's the place to have that conversation. But the main thing here is being able to look at the markets and to find different ways to monetize them. If you're able to do that, then that's effectively the way of finding edge. And again, I wouldn't limit yourself to something like having to be risk adjusted returns. I would say you should define what you're trying to do and then work off of that. So that's the first question. Let me open the door for a throw real quick and then we'll get back. All right. So I saw a couple comments come in. So let's talk about those recess. So probably because I'm small stacks, but I only get margin treatment on purchase shares not cash secure puts margin treatment. I don't know what you mean by that here. So it often makes more sense to do a buy right. Did you have this issue? I don't follow your question fully. When you say margin treatment, you just mean it's when you're selling a put, it doesn't allow you to sell a naked put, but is cash secured? Because then I don't know how you make the comparison fully cash secured got it. So then I guess I don't understand the",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 59,
      "start_timestamp": "00:11:12",
      "start_timestamp_seconds": 672.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=672"
    }
  },
  {
    "text": "When you say margin treatment, you just mean it's when you're selling a put, it doesn't allow you to sell a naked put, but is cash secured? Because then I don't know how you make the comparison fully cash secured got it. So then I guess I don't understand the comparison you're making between the margin treatment on the shares versus the cash secured puts because on the shares, it's the same thing. When you buy shares, you have to use your cash first. So it's effectively the same amount of cash that's required. So I don't follow that one totally. H says getting run over on short calls and game stop versus what I sold them for. Happy on the shares side though, trying to average in but pull the trigger early. There's edge and selling ball there moves quick though. Um, yeah, I mean, there's definitely without a doubt edge in selling ball in general and also in really highly volatile names like game stock. But what you're coming across is what I actually regularly talk about in terms of not capping your upside. If you're holding stock, one of the silliest things you could do in my opinion is cap your upside. You're holding all of the downside risk. So if I draw you a risk profile for a stock position, this is the zero line. Your stock position looks like this. It's linear, right? As it is price goes up. So this is spot price. This",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 59,
      "start_timestamp": "00:12:30",
      "start_timestamp_seconds": 750.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=750"
    }
  },
  {
    "text": "opinion is cap your upside. You're holding all of the downside risk. So if I draw you a risk profile for a stock position, this is the zero line. Your stock position looks like this. It's linear, right? As it is price goes up. So this is spot price. This is PNL. As price goes up, you make money linear and then as it goes down, obviously you lose money linear. When you run and this isn't necessarily for age because age is saying, been selling the 40s against a third. So they're already doing ratio, which is good. Now for those that are unfamiliar, what I'm talking about, the concept of a ratio is simple, right? So if I have 500 shares of whatever stock XYZ, it doesn't matter if it's game stock, it's literally whatever you're holding. If you sell to open five calls at whatever price, this is effectively what happens. You cap your profit potential above your short strike. Whatever your short strike is plus the credit you receive. Your cap now. So a massive difference is instead of doing five, maybe you do two or three. What happens is if you have 500 shares, and in this case you have 500 short delta, 500 long delta, your delta is net out to zero. Once you get to the 500 delta, because remember if you're selling a 30 delta call, it's starting at 30 delta. So you're effectively making money on this short call until it's",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 59,
      "start_timestamp": "00:13:33",
      "start_timestamp_seconds": 813.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=813"
    }
  },
  {
    "text": "in this case you have 500 short delta, 500 long delta, your delta is net out to zero. Once you get to the 500 delta, because remember if you're selling a 30 delta call, it's starting at 30 delta. So you're effectively making money on this short call until it's so far in the money, it has a delta of one. That's when your profit goes away up to the upside in terms of like exceeding whatever it is above that short strike. So now if instead of this scenario, you have this scenario where you're long 500 deltas, but then you're only short 300 deltas. What this means is you have 200 deltas that are uncovered that do not have any overhead from the short call side of the equation. So then you can enjoy your profit potential based on that. So instead of this scenario, it looks more like this. You're still not going to profit as much as if you were uncovered, but you will profit way more than this scenario. And the way to think about that is pretty easy, right? We just think about it in terms of how much money do I want up front versus what do I want my profit potential to be? And this comes down to whatever you think about the underlying. If it's something that you think is going to go up a lot, then you want to lighten up this ratio. You want to maybe do one or",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 59,
      "start_timestamp": "00:15:01",
      "start_timestamp_seconds": 901.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=901"
    }
  },
  {
    "text": "front versus what do I want my profit potential to be? And this comes down to whatever you think about the underlying. If it's something that you think is going to go up a lot, then you want to lighten up this ratio. You want to maybe do one or even zero and not put any on. But then if it starts to slow down and it's kind of migrating sideways, but you still want to hold it longer term. It's just not moving as fast. That's when you can up the ratio a little bit and maybe go to two or go to three, something like that. So the ratio component is super important because even in H's scenario where they're saying that they're selling the 40s against the third of the portfolio or the third of the position, the cool part there is if you're not using much, then you can always add more short calls to increase your total profit potential. And I'll show you what that means. So let's say that we use the scenario here where we're long the 500 shares. And let's say that our basis on those 500 shares is 25. And I'm just spitballed stuff. So this is basis. This is size. And let's say that we get some short calls out there. So then let's do the strike for the short calls. Let's do the lot size. Let's do credit. I'll do premium. And then we'll have our exit trades. And",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 59,
      "start_timestamp": "00:16:06",
      "start_timestamp_seconds": 966.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=966"
    }
  },
  {
    "text": "just spitballed stuff. So this is basis. This is size. And let's say that we get some short calls out there. So then let's do the strike for the short calls. Let's do the lot size. Let's do credit. I'll do premium. And then we'll have our exit trades. And then we'll have a couple calculations here. So we'll have max profit potential. We'll have credit received. And I think that's probably fine to start. I'm going to move all this over. So that we can make these the correct size. Okay. So now let's say that you have a too lot that you sold. And let's say that your, I mean, we can literally do a live example, but be a little faster if we don't. So let's say that your basis is there. Let's say your strike price is 30. You have your too lot. Let's say you collected a dollar and premium. Okay. So the first thing we know is the credit we receive is simply the premium times the lots times 100. So you collected 200. We can calculate what the current cash secured put requirement or cash secured to maintain the position, which is simply the number of shares you have times the basis. So you're using 12,500. We can look at our credit return on invested capital here and see how much you're making. Again, I didn't put in like DTE or anything. So it doesn't really matter. And we can figure out what",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 59,
      "start_timestamp": "00:17:13",
      "start_timestamp_seconds": 1033.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1033"
    }
  },
  {
    "text": "the number of shares you have times the basis. So you're using 12,500. We can look at our credit return on invested capital here and see how much you're making. Again, I didn't put in like DTE or anything. So it doesn't really matter. And we can figure out what our max profit is for the short calls. Now you can absolutely do a more complex formula, which is super simple, but for the sake of simplicity, all I'm going to do is I'm going to figure out what the max profit is for the number of shares that I have using only the share side of the equation, not including the credit. And I'll show you what I mean. So what we're going to do is take our strike price less the basis, which is 25, that gives us our five point move times the lot size times 100. And this shows you how much money you would make on your position. In this case, using just the 200 shares at this point. Now again, you can make this more accurate if you're so inclined by adding in the credit here. And then you can also add if you're so inclined, the residual 300 shares at this price versus this price. But again, that's not the point. The point of this is just to visualize what the max profit might be on those short calls. Okay, so now let's go back to the scenario where the underlying goes up",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 59,
      "start_timestamp": "00:18:45",
      "start_timestamp_seconds": 1125.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1125"
    }
  },
  {
    "text": "so inclined, the residual 300 shares at this price versus this price. But again, that's not the point. The point of this is just to visualize what the max profit might be on those short calls. Okay, so now let's go back to the scenario where the underlying goes up and we have to adjust these and let's figure out how to do this. So we're only using a two lot and our premium is a dollar. So let's say that we have to close these for a dollar 50. And this is for the sake of the role. So now we'll figure out what our PNL is for the position. And this is only the option position, by the way. So our PNL exit plus whatever we got to start times lot size times one Hyundai. So we lost a hundred bucks there. So now let's say that we decide that we want to roll these calls. And let's say that the option is super far in the money at this point on a relative scale. And let's say the underlying trading at like 35 or something like that, whatever. So if you try to roll an option on something that's really far in the money, it's very difficult to collect a credit. And I'll literally we can look at an example so that you can visualize it. Take a look at Palantir. So let's say that when Palantir is around a hundred bucks, let's say that you sold",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 59,
      "start_timestamp": "00:20:05",
      "start_timestamp_seconds": 1205.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1205"
    }
  },
  {
    "text": "something that's really far in the money, it's very difficult to collect a credit. And I'll literally we can look at an example so that you can visualize it. Take a look at Palantir. So let's say that when Palantir is around a hundred bucks, let's say that you sold like the 105 call. Again, I'm just giving you an example. And let's pretend that your 105 call is coming up on expiration next week. And we can literally figure out what it traded at. We can do all the actual math, but again, it doesn't matter so much for the sake of the conversation. I just want to show you what this could look like. So let's say that you have those 105 calls that are set to expire next week. Those 105 calls right now, they're trading for 17, let's just call it 18, 18 and change. So if we go out and we say, well, I want to roll these, these 105s, I'd have to close them for 18 bucks. Maybe let's just call it 1850. I have to close it for 1850. If I go out 28 days, and I know I have to close those 105s for 1850, can I roll these 105s to the 110s and move them further out of the money? I can't because if I have to close those for 18, these are trading for 16 and change. It means you're on a net debit on that roll. Now again, for",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 59,
      "start_timestamp": "00:21:26",
      "start_timestamp_seconds": 1286.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1286"
    }
  },
  {
    "text": "105s for 1850, can I roll these 105s to the 110s and move them further out of the money? I can't because if I have to close those for 18, these are trading for 16 and change. It means you're on a net debit on that roll. Now again, for those that are familiar with the more advanced approach to rolling options, there's nuance you could technically depending on what it all look like. The point that I want to make here specifically though is as these short calls get buried, it becomes more difficult to roll them and increase your basis. But there's an interesting scenario here. So let's just use the Palantir numbers since they're up. And I'll show you. So we just said to close out those other options, it was going to be 18 bucks. And these were for the 105s. Right now, we're trying to get to the 110s and the 110s are trading for 1630, whatever, it doesn't matter. 1630. So we can see we're not going to make it, right? We're going to we're going to have a debit on this roll. And let's say that we had that same too lot, but we had 500 shares. So that means that we still have a bunch of uncovered shares right now. That's going to be useful because if we look at closing this trade, it's going to take us the 18 bucks. Here's your total cost. And let's say that you're trying to",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 59,
      "start_timestamp": "00:22:40",
      "start_timestamp_seconds": 1360.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1360"
    }
  },
  {
    "text": "we had 500 shares. So that means that we still have a bunch of uncovered shares right now. That's going to be useful because if we look at closing this trade, it's going to take us the 18 bucks. Here's your total cost. And let's say that you're trying to do same lot size. So you're trying to go to the two lot and you're trying to do the same thing. So the net here, whatever the original sale was, let's say that the original sale was three bucks. And let's say it was a two lot. This way, we can actually look at probably something that's close to the hypothetical. So you originally got 600 bucks. This one, you're going to have to close for 18. So let's say instead of three bucks, let's say that you sold these for two. And let's say maybe you sold it for like 150. I'm trying to make it so that we get a negative. I'm cherry picking the numbers more for the sake of the example because what I'm going to show you is the benefit of being able to use dynamic lot sizing. So we still have these 500 shares right now. We're only covering two of them. And in this scenario to get that 5 basis adjustment where we're going to collect 1630, get in 30 to 60, you're still going to be in the red in this very hypothetical cherry pick scenario, which still is reflective of reality,",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 59,
      "start_timestamp": "00:23:48",
      "start_timestamp_seconds": 1428.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1428"
    }
  },
  {
    "text": "right now. We're only covering two of them. And in this scenario to get that 5 basis adjustment where we're going to collect 1630, get in 30 to 60, you're still going to be in the red in this very hypothetical cherry pick scenario, which still is reflective of reality, by the way. This isn't like making a worst case scenario. This absolutely happens. I'm just cobbling it together super fast for the example. So now instead of this trade, let's look at a different trade. Let's say instead of a two lot, let's say we do a three lot. Well, if you copy the rest of this stuff using a three lot, I'm going to slide this one out of the way for now. What do you notice? Well, now we can make actually decent money. We're going to make a decent amount of money on the total rolls. But what if instead of just going five points, maybe we try to go a little further. So instead of going from the 105 to the 110s, maybe we go to something like the 115s. Those are trading for 1290. Can we make that trade? So if we go to the 115s and we get to 1290, do we still make money? We do. Now what just happened here? Again, we have to remember what the max profit was for the stock. And again, let's say that we got into this when it was 95 bucks. Again, I'm just grabbing",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 59,
      "start_timestamp": "00:25:35",
      "start_timestamp_seconds": 1535.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1535"
    }
  },
  {
    "text": "the 115s and we get to 1290, do we still make money? We do. Now what just happened here? Again, we have to remember what the max profit was for the stock. And again, let's say that we got into this when it was 95 bucks. Again, I'm just grabbing random numbers. So your max profit in this scenario from the original position is your 105 less your 190 times your lot size times 100. And again, this is for going the credit that you get. So your max profit here was going to be two grand. And that's on the shares that you're holding. Now what happens if we change this? Even though we added more short calls in capped our profit potential on an additional 100 shares, we were able to adjust the basis on these shares by 10 points. So by adding that additional trade here, you'll notice that your max profit on the covered shares went up, but it's also because there's another 100 shares in there. So then if we normalize this and we do it on a per share basis, which is this times 100, you're getting 10 bucks per share profit here. You're getting 20 bucks per share profit here. So this is a slightly longer than intended example. Maybe hopefully not too detailed. I don't want to lose you. But the stuff that I want you to take away from here is by selling your calls at a ratio, you give yourself",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 59,
      "start_timestamp": "00:26:43",
      "start_timestamp_seconds": 1603.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1603"
    }
  },
  {
    "text": "getting 20 bucks per share profit here. So this is a slightly longer than intended example. Maybe hopefully not too detailed. I don't want to lose you. But the stuff that I want you to take away from here is by selling your calls at a ratio, you give yourself way more choices to do different things based on what your overall plans are. So this is just an example of that. Okay. Next. Lauren says, if you hit your yearly goal, do you move it or try to sustain it? Lauren, can you explain a little bit more? When you say move it, do you mean for that year or do you mean in general? Because there are two very different things. If I hit my profit target for a single year, I just keep trading, but I become more selective. I'm trying to find the best possible opportunities that I can identify. If it's a different scenario where I hit my profit and I'm not going to start changing my general annual return target until I have enough repetitions with the portfolio to see what I'm capable of producing. So the summary to that is, let's say it's May. This is a perfect example, right? My annual target is really conservative now for a bunch of different reasons I've talked about. And I surpassed it within the first month. So does that mean that I stop trading or that I change my target? No. The way that I",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 59,
      "start_timestamp": "00:28:20",
      "start_timestamp_seconds": 1700.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1700"
    }
  },
  {
    "text": "May. This is a perfect example, right? My annual target is really conservative now for a bunch of different reasons I've talked about. And I surpassed it within the first month. So does that mean that I stop trading or that I change my target? No. The way that I think about that target is that that's just my planning factor. And the reason why that it's my planning factor is because I'm coming up with what is the minimum target I need to consistently hit in order to grow the portfolio where I want it to be. Now, if I have a year where I'm hitting it hot and I'm doing a good job, then I can absolutely scale. I can put more on if I'm so inclined. But the main point here is that there's no part of me that would like stop, slow down. That doesn't happen. But I become really selective. And I wouldn't change the goal. The goal is just a planning factor for a minimum viable product to keep me on my longer term path of developing wealth, right? Like that's the broader intention. So to show you what that looks like in context, on the website, you know, that I have a compound growth calculator for literally for you to play with these kinds of numbers. So let's say we have 25,000. Let's say we're saving on average, 1500 per month. And we do this for 20 years. This is longer term timeframe.",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 59,
      "start_timestamp": "00:29:49",
      "start_timestamp_seconds": 1789.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1789"
    }
  },
  {
    "text": "on the website, you know, that I have a compound growth calculator for literally for you to play with these kinds of numbers. So let's say we have 25,000. Let's say we're saving on average, 1500 per month. And we do this for 20 years. This is longer term timeframe. And let's say my target is 15. So the way that I look at it is I'm trying to hit at least the 15. If I hit at least the 15. It puts me on track for my longer term goal. If I essentially outrun that and I have a higher return, well, then great. It just means I'm accelerating the overall timeline. But I wouldn't guide the goal up because then you're absolutely taking more risk to get it. And as long as I'm actively moving towards the goal that I planned and reconciled myself with, that's the main point of that target. So I wouldn't adjust it. I would just keep trading, but be selective, like be more selective for sure. Shahzad says, what are your thoughts on going entirely variance risk premium profit mechanism? I think what the tasty folks preach, they're definitely not trading the RP. What tasty does is very different than that actually because they do take a lot of directional bets. They just prefer to be on the sell side. But there's a different, like if you sell premium, you're not inherently attempting to capture risk premiums. Now that might be a subtext.",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 59,
      "start_timestamp": "00:31:00",
      "start_timestamp_seconds": 1860.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1860"
    }
  },
  {
    "text": "What tasty does is very different than that actually because they do take a lot of directional bets. They just prefer to be on the sell side. But there's a different, like if you sell premium, you're not inherently attempting to capture risk premiums. Now that might be a subtext. But a lot of times they're trading actually very directionally, which is not risk premium at all. It's just a sub factor part of that. So I would say depending on what your goal is and what your skill set is, if that gets you to your goal, there's nothing wrong with that. It's definitely not what I would do. I don't see any benefit to just hobbling yourself as an options trader and just doing one thing. I think that's one of the biggest mistakes that an options trader can make because depending on what kind of toolkit you're able to build, some of my most profitable trades have been with long options. So if I only sold premium, I would never see those. Now that being said, I absolutely think there's nothing wrong with if you're constrained by time or constrained by effort, energy, and you're willing to make concessions on what you're doing. And effectively being comfortable saying like, yeah, I might not be able to earn the return that I wanted to. But it's easier for me to do this. I can more reliably consistently do this. Then that's okay. But you just have to acknowledge",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 59,
      "start_timestamp": "00:32:23",
      "start_timestamp_seconds": 1943.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=1943"
    }
  },
  {
    "text": "make concessions on what you're doing. And effectively being comfortable saying like, yeah, I might not be able to earn the return that I wanted to. But it's easier for me to do this. I can more reliably consistently do this. Then that's okay. But you just have to acknowledge the trade-offs. So summarized the answer for Shahazad would be there's nothing wrong with doing that. But there's an associated opportunity cost. And me personally, I wouldn't give up on that opportunity cost. It's not worth it to me. I'm happy to try the other things as well. And they typically do well. Shahzad says, while chatting to Tom Saazn, if you guys talked about percent utilization, if you're using 70 and you calculate your returns on this money investor, the overall portfolio, always the overall portfolio. Because it's still what's in there, right? You're taking 70 of something. So the only reason there's a difference between rock and roick. This is on capital, which is Spanish for your account. And then this is on invested capital. This is how much is being used. So if you'll recall the example I gave back here when we were doing the Palantir trade or whatever the GameStop would, whatever the example is I was giving you, I did roick. And effectively what I'm saying is if I have a portfolio of 10,000 and we're using 12.50 in this individual trade, I'm not going to calculate the return on the entire portfolio in",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 59,
      "start_timestamp": "00:33:45",
      "start_timestamp_seconds": 2025.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2025"
    }
  },
  {
    "text": "trade or whatever the GameStop would, whatever the example is I was giving you, I did roick. And effectively what I'm saying is if I have a portfolio of 10,000 and we're using 12.50 in this individual trade, I'm not going to calculate the return on the entire portfolio in that context, although I absolutely do in general, there's nothing wrong with that. But I want to see how efficiently the capital is being used. That's why I'll look at roick. So when you were talking about deploying the entire portfolio, right, how we're using the whole portfolio and the utilization of it being 70, that 70 represents the roick, the invested capital. But when we're talking about end of year returns, when you're looking at this metric here, this is on the account because again, you're taking 70 of that total number. If your account is smaller, this 70 you're taking as smaller. So we care a lot about that whole the entire size of the portfolio. So that's what we use ROC for. So ROC return on capital for the account. And then roick is typically related to individual positions, although even for individual positions, you can still calculate the return relative to a larger bucket of money. There's nothing wrong with that either. There are just different ways to analyze the utilization of capital. Now one thing I will note is that it's really, really important to avoid vanity metrics. So what that means is a lot",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 59,
      "start_timestamp": "00:35:22",
      "start_timestamp_seconds": 2122.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2122"
    }
  },
  {
    "text": "calculate the return relative to a larger bucket of money. There's nothing wrong with that either. There are just different ways to analyze the utilization of capital. Now one thing I will note is that it's really, really important to avoid vanity metrics. So what that means is a lot of times, especially options traders will focus on the roick of like really cheap option, right? And they'll tell some sort of ridiculously stupid number because they bought a really cheap option and it compounded a lot. So here's what I mean by that. If we buy a nickel option and let's say that the underlying shoots up and now that nickel option is trading for 3.50. If we look at a one lot, this nickel option obviously costs you your five bucks. And then if we take a look at what it turns into based on your big move, 350. So then if we look at what the actual return is on this trade, it's obviously massive. Huge percent return. But it's because it's a super cheap option that happens to compound. And a lot of retail traders will get wrapped up on bullshit numbers like this. And it's actually why it is so, so, so important to understand the differences between using percentages and raw numbers and when to flow in between them because you do need to flow in between them, right? So in this case, that's a great percent return. But you literally made 345. Who",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 59,
      "start_timestamp": "00:36:44",
      "start_timestamp_seconds": 2204.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2204"
    }
  },
  {
    "text": "actually why it is so, so, so important to understand the differences between using percentages and raw numbers and when to flow in between them because you do need to flow in between them, right? So in this case, that's a great percent return. But you literally made 345. Who gives a shit? 345. Doesn't matter. So think of it in the context of rock is ultimately what matters. At the end of the year, that's what matters. You have X number of dollars in your account. This is what you were able to produce leveraging that account. However you so chose, that's the ultimate number that matters. It's a good question. Ricky says, what profit mechanism do you think is the hardest to capitalize off? Well, it depends on when we say hardest because like there's tons that are literally just not accessible to retail traders. So to be, to take that literally, I think those, right? So things like dispersion, not doing that. Retails not doing dispersion. Another one is scalping. Flash high frequency trading. I don't mean scalping in the colloquial sense that you'll hear thrown around in retail trading circles. I mean like the actual term scalping. And this is stuff that's like moments of holding something. Another one, another profit mechanism that's essentially not going to happen for retail traders is market making. Now this is on standard markets, equity markets. You can absolutely make money as a retail trader and other markets. I've actually",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 59,
      "start_timestamp": "00:38:16",
      "start_timestamp_seconds": 2296.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2296"
    }
  },
  {
    "text": "scalping. And this is stuff that's like moments of holding something. Another one, another profit mechanism that's essentially not going to happen for retail traders is market making. Now this is on standard markets, equity markets. You can absolutely make money as a retail trader and other markets. I've actually talked about this through things like the new event based markets. That's not saturated yet with market makers. So you can literally make markets. I was working with a couple of buddies actually on models to do that. So, but that's another side of the things, right? Like we're talking about a different market than equity markets and equity markets. Retail traders not, you're not, you're not market making. It's not going to happen for you. So when I think about like the most difficult profit mechanisms, it would be stuff like this. And again, these are like things that are just essentially not going to happen. Now, if I were to advance us one level into things that are more generally accessible, but still things that I personally would avoid or things like day trading. The reason why day trading is so difficult is because when we look at really, really, short-term market behavior, it's based on things that you really can't forecast very well. And it's why I always get a kick when I see these different YouTube shorts or like TikToks about order filled. And then it's somebody trying to trade some like intraday thing and they",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 59,
      "start_timestamp": "00:39:44",
      "start_timestamp_seconds": 2384.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2384"
    }
  },
  {
    "text": "really, really, short-term market behavior, it's based on things that you really can't forecast very well. And it's why I always get a kick when I see these different YouTube shorts or like TikToks about order filled. And then it's somebody trying to trade some like intraday thing and they make 36,000 on their individual trade. The reality is, is I know full well that even if they make a good amount of money on that first one, there's probably so many other losers that have happened or are going to happen that it is hands down the most difficult time frame. Hands down, the most difficult time frame to trade. And it's because market effects are so fickle in that short term of a time frame that it is so difficult to do that effectively. This is why other things that are more well researched are typically good places to start, stuff like momentum, variances premiums like you heard earlier. Stuff that's generally persistent. The other thing to always keep in mind from a retail trading perspective is transaction costs are always against you. And do not let the illusion of no commissions trick you into thinking that your transaction costs are good or cheap. They're not. It's just that it's hidden from you. So what happens from that lens is you are trader and I forgot we have to actually have to draw our favorite trader. Here. That's their head, by the way. And because the markets have",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 59,
      "start_timestamp": "00:41:04",
      "start_timestamp_seconds": 2464.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2464"
    }
  },
  {
    "text": "transaction costs are good or cheap. They're not. It's just that it's hidden from you. So what happens from that lens is you are trader and I forgot we have to actually have to draw our favorite trader. Here. That's their head, by the way. And because the markets have been good, we have a big ol' dripped out chain with diamonds all over it. And you guys already know who this is. Hold on, we need the arms. Those are the arms. And then for scale reference. This is Empire State. Building. And then as always, we have the cell phone. We're slaying in trades. Okay. So I literally forgot what I was even talking about when I started making this. Oh, order and where the costs are. I remember now. So as our crowd favorite submits a trade to the broker. Maybe the broker. And this is for Palantir. The broker might say, yo, don't worry, it's on the house. It's full of free. I'm just that nice of a person. But they're not. They don't care about you. They're actually little gremlins. I don't really know how to draw a gremlin other than having like a little fucked up back. So these are the brokers. They're little gremlin backs. And they're not, they're not going to do it for free. What they do is they sell your order flow. Market makers. So when your order for Palantir comes in, goes to your broker, your broker will then",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 59,
      "start_timestamp": "00:42:18",
      "start_timestamp_seconds": 2538.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2538"
    }
  },
  {
    "text": "fucked up back. So these are the brokers. They're little gremlin backs. And they're not, they're not going to do it for free. What they do is they sell your order flow. Market makers. So when your order for Palantir comes in, goes to your broker, your broker will then bundle a whole bunch of orders like this. And then they'll submit that order to a market maker. The market maker is literally paying money for this. Why would they do that? You can derive their incentives. Then the market maker will either internalize the order, take care of it here. They might route it to an exchange out here. But the overwhelming majority of instances, your order is going to go to these people. Why does this matter? It means that the fill that you get on your trade is effectively completely different than what it would be if it was done on an open competitive exchange where people are actively competing for each order. But they're not. Your order flow is being bought. So anyways, to take this all the way back to the day trading example, if you have a ton of cycles on your trades, even though you think, even though you think that your trading might be cheap, it's not. It's just that the cost is hidden from you. That's all. But it's still there. Do not forget. Okay. Shahzad says in the past six months, I started and stopped trade log four times. I",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 59,
      "start_timestamp": "00:44:38",
      "start_timestamp_seconds": 2678.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2678"
    }
  },
  {
    "text": "though you think, even though you think that your trading might be cheap, it's not. It's just that the cost is hidden from you. That's all. But it's still there. Do not forget. Okay. Shahzad says in the past six months, I started and stopped trade log four times. I feel like I tried to capture too much and it's up being too much. What would you think are the minimum things that should be captured? How do you track options? Meaning you track by expiration date, date closed? That's awesome. That's a great question. It's actually one that we work through in detail with the pro community because it's something that we talk about a lot. So I'm really, really glad you asked that. The answer is very simple. So you already know the outlier strategy process. Oops. Yeah, where the fuck did that go? Hey here. Okay, great. So how do we answer this? What do we track in a trade log? Let's say that we're trading something like variances premiums. Do I care about a price breakout? Maybe, maybe not. How do I know? I will know by completing these two steps. The way that this second step works is I say to myself, I'm researching variances premiums. I have no idea what really matters to this and what doesn't. The first thing I'm going to do is read. I'm going to go to places like SSRN and I'm going to look for existing research on the",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 59,
      "start_timestamp": "00:46:11",
      "start_timestamp_seconds": 2771.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2771"
    }
  },
  {
    "text": "step works is I say to myself, I'm researching variances premiums. I have no idea what really matters to this and what doesn't. The first thing I'm going to do is read. I'm going to go to places like SSRN and I'm going to look for existing research on the market effect for a starting point so that I'm not just guessing. There's no reason to just blindly guess. Do homework first. As I read about variances premiums, I might find things like the relationship between implied volatility and realize volatility matters a lot. I might find things like vol regime matters a lot. I might find things like implied vol and realize vol durations and trends matters. This is just from reading. This isn't from looking. This is just from reading. Then I'm going to say to myself, okay, based on peer reviewed research, this is the stuff that they find that matters. I'm going to use that as a starting point because I don't know. On top of this, what else do I think might matter? What other stuff do I think could matter for something like a risk premium? Well, maybe something related to liquidity. Maybe something related to industry. On fact, things like biotech, for example, super high-vol, why? Because they experience binary events non-stop. Things like earnings, economic releases. So as I just brainstorm other stuff that might to the profit mechanism, I'm going to track these next. So the idea in the beginning is",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 59,
      "start_timestamp": "00:48:13",
      "start_timestamp_seconds": 2893.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2893"
    }
  },
  {
    "text": "related to industry. On fact, things like biotech, for example, super high-vol, why? Because they experience binary events non-stop. Things like earnings, economic releases. So as I just brainstorm other stuff that might to the profit mechanism, I'm going to track these next. So the idea in the beginning is to this isn't with respect to a strategy at all yet. This is literally just measuring it so that you can determine what actually matters because this is the only way to figure out what actually matters is by looking at it. You're not going to be able to just guess it into existence. So then from here, the next steps are pretty simple. When we then understand the behavior here, we understand these different things, the different values, how they behave, then we start going into building a strategy. So then if I'm trading variants for previous and I'm relegating it to an earnings release for this specific subset of that strategy, a verper, that's actually kind of a really fun verper. So if I'm trading verper, then I know things like earnings release matters. I know things like prior earnings releases matter and so on and so forth. So what I'm going to do is as I'm building the strategy, I'm going to list out the inputs that matter to the specific strategy that I'm building and then I can figure out how to track important inputs. This is how you solve that question. So it's literally just",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 59,
      "start_timestamp": "00:49:42",
      "start_timestamp_seconds": 2982.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=2982"
    }
  },
  {
    "text": "So what I'm going to do is as I'm building the strategy, I'm going to list out the inputs that matter to the specific strategy that I'm building and then I can figure out how to track important inputs. This is how you solve that question. So it's literally just following the process. It's that simple. So it's a great question. And fortunately, there really isn't a much not a whole lot to it. It starts with it's one of those things where there's not a whole lot to it just to do it. That's it. Roryng Clity, Ayo, what up? It says in your podcast with Mr. Saznoff, you talked a bit about account utilization and the numbers surprise me. Tom said their account is usually around 30. How might we figure out what utilization we should target for a specific trader, the whole account? What would change the equation to increase the decrease utilization? It's a good question. So the reason why you find his utilization is so low, because you're using options. They're levered. That's the point. You don't have to use anywhere near as much of your account. And as your account grows, you'll find you'll typically use less and less of it. Now, this is another thing we actually discussed in the pro livestreams because again, it's like a really pertinent point. So I'm very glad that you asked it. And what this comes down to is not so much utilization per cent. But I",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 59,
      "start_timestamp": "00:51:31",
      "start_timestamp_seconds": 3091.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3091"
    }
  },
  {
    "text": "typically use less and less of it. Now, this is another thing we actually discussed in the pro livestreams because again, it's like a really pertinent point. So I'm very glad that you asked it. And what this comes down to is not so much utilization per cent. But I think of it as how many trades should we have on? And the answer to this is super simple. We use the reverse engineering path. So we start by developing our goals. And we say, okay, I decide based on me playing with a compound interest calculator, reconciling what my savings rates might be, reconciling what my initial amount that I'm going to trade with might be against my investment horizon against my first three years of trading performance to get a sense of what I'm capable of returning. And you pick your number, whatever that number is, then we essentially say, okay, I'm going to target 15 percent. Okay, great. So now what we do is we say, if I have that 25,000 account, and I'm looking for 15 percent, I know over the course of a year, I'm looking to make 30, 750. I now know if I break this 3750 into a monthly target, I need to make 312.50, this is not including taxes. Taxes you can pat it a little bit. Or if you're trading in a retirement account, don't pat it, because it doesn't matter, because you ain't got to be worried about it. So",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 59,
      "start_timestamp": "00:52:46",
      "start_timestamp_seconds": 3166.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3166"
    }
  },
  {
    "text": "break this 3750 into a monthly target, I need to make 312.50, this is not including taxes. Taxes you can pat it a little bit. Or if you're trading in a retirement account, don't pat it, because it doesn't matter, because you ain't got to be worried about it. So now you have a target. So then when we're thinking about how much money to use the way that I approach it is I do this math. And then I say, what's the minimum amount of money that I need to make this month in order to hit my target. Now again, what you can't do is say, I'm going to put on three trades. Each one of them is going to be worth 105 max profit. And if I do these three trades and they all hit max profit, I hit my number. Why can't you do this? Because they're not all going to be a max profit. The market's going to move. So what you can do is calculate it on an expected return basis. We trade options. Options give you probabilities. It's a beautiful thing. So you can say, well, there's a 60 chance of this trade making money. There's a 62 chance of this trade making its max profit. And there's a 35 chance of this trade making its max profit. So then what's the actual expected return on these trades? Now we realize we ain't there. We have more to do in order to get",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 59,
      "start_timestamp": "00:54:01",
      "start_timestamp_seconds": 3241.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3241"
    }
  },
  {
    "text": "making money. There's a 62 chance of this trade making its max profit. And there's a 35 chance of this trade making its max profit. So then what's the actual expected return on these trades? Now we realize we ain't there. We have more to do in order to get on what we need to have on in order to figure out how many trades we need to have on. So the first part of the answer here is to figure out how much you're trying to make. It's not a random number. We don't just say, oh, I'm going to use blank percent of my account. It literally doesn't mean anything. We have to make sure that what we're doing is aligned with our broader game plan. So then you have to do the additional exercise and figure out what the drawdown risk is here and so on and so forth. Then for the other part of the question, how do we figure out how much we should target for a specific trade or the whole account? It's a great question. And again, it's very simple. This is for the entire account. Now for the individual trades, it's going to depend on the strategies that you've built in how they perform. And here's why that matters. Let's say that I'm trading my breakout approach. And let's say my breakout approach has a 35 hit rate. It means that I'm making profit targets 35 of the time, which somebody might",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 59,
      "start_timestamp": "00:55:20",
      "start_timestamp_seconds": 3320.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3320"
    }
  },
  {
    "text": "to depend on the strategies that you've built in how they perform. And here's why that matters. Let's say that I'm trading my breakout approach. And let's say my breakout approach has a 35 hit rate. It means that I'm making profit targets 35 of the time, which somebody might hear that and they might say, well, man, that's trash. That's like real bad. Not great, but it doesn't matter. Because let's say on the 35 of instances, I'm making 5,000. And let's say on the 65 of instances, I'm losing 300. If we calculate the expected return of this system, it's super profitable, super profitable. And this is why people who focus on winrate are literally, they're so mistaken. It's not funny. They're so focused on the wrong thing. It's amazing to me to be that far off target, but people will do that. So in the context of this kind of strategy, I know how I need to size things. Because based on the thing that I observed, based on how I think I can trade it based on my paper trading results, I can say, well, I can really tightly control my risk. And I can size this appropriately to the portfolio. So then if we say that I'm losing 300 on average and let's say that we have 5,000 portfolio, it means per trade, you're still at a pretty decent size position. You're at 6 of the portfolio. So then if this is the case, it",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 59,
      "start_timestamp": "00:56:43",
      "start_timestamp_seconds": 3403.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3403"
    }
  },
  {
    "text": "this appropriately to the portfolio. So then if we say that I'm losing 300 on average and let's say that we have 5,000 portfolio, it means per trade, you're still at a pretty decent size position. You're at 6 of the portfolio. So then if this is the case, it might mean you need to size these things down so that on each one of these instances, you're not losing 6 of your portfolio. You might have to cut this down so it makes sense. So the way to think about it here is based on the actual strategy that you're trading and the performance of it, how it behaves, that's going to inform how much of the account it should get and what the total risk should be in it. Otherwise, again, if you're just picking random numbers like some people will say, never more than 1 of your portfolio in a trade. Well, why would that make sense? Because if I put, let's say 10 of the portfolio to buy the position, but I'm going to control risk at 3 or 2 completely different scenario. So to summarize all of that, it's a complete at the portfolio level, it's this exercise, essentially reverse engineering based on what you're trying to do. This down here is based solely on the strategy that you're trading based on the strategy. How does it behave? What does that mean? If I have a high losing rate strategy, it means that I'm going",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 59,
      "start_timestamp": "00:58:12",
      "start_timestamp_seconds": 3492.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3492"
    }
  },
  {
    "text": "it's this exercise, essentially reverse engineering based on what you're trying to do. This down here is based solely on the strategy that you're trading based on the strategy. How does it behave? What does that mean? If I have a high losing rate strategy, it means that I'm going to have to make sure that the risk is controlled. If I have a high win rate strategy, it means I'm going to accept slightly lower winners size and I'm going to accept slightly bigger losses because that's how the probabilities are going to bear out. That's a great question. Shahzad says the only thing I noticed is that when the markets are down, I do better is option premium offset the losses, but when the market runs up, I underperform. That could be the case. It just means that you're not doing a good job adapting to the market. That's what I would consider there. One of the main jobs you have as a trader is being able to move in between things. Again, if you choose to stick to a fastball, meaning one specific market effect or one specific approach, that's fine, but it means that there's going to absolutely be periods where you're sitting out or where you're not doing anything and that's going to be normal. Now, for me, the way that I typically would try to trade is just to be a little bit more adaptable. Now, it doesn't mean that you have to be",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 59,
      "start_timestamp": "00:59:38",
      "start_timestamp_seconds": 3578.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3578"
    }
  },
  {
    "text": "to absolutely be periods where you're sitting out or where you're not doing anything and that's going to be normal. Now, for me, the way that I typically would try to trade is just to be a little bit more adaptable. Now, it doesn't mean that you have to be like sitting in front of the computer. That's at least the last thing I would ever want to do. Trading is one of those things where the vast majority of the work is done now. It's done on the Friday evening when the market's closed and you're going through conducting research. Then the amount of time that I would spend trading during the day, I mean, you have to think, I spent a long time on active duty in the military. Effectively, no time. There's very little time during the day to sit on check out the markets that effectively would very rarely happen because even the spots that I were on base, I didn't get sell service. So what that means is you have to figure out what your approach to trading is going to be. For me, it was to try and be able to take advantage of different market conditions. So because of that, I need to have a slightly more varied toolkit to be able to do so. It's a good question. Cool. If you guys have anything else, please throw it in the chat. There was a couple other questions that I did want to",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 59,
      "start_timestamp": "01:00:56",
      "start_timestamp_seconds": 3656.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3656"
    }
  },
  {
    "text": "different market conditions. So because of that, I need to have a slightly more varied toolkit to be able to do so. It's a good question. Cool. If you guys have anything else, please throw it in the chat. There was a couple other questions that I did want to get to from the email and Thor's scratching at the door, BRB. Here he is. He heard that there was a QA going on. So we opted to come say hi to everybody and come check it out. Oh boy. I can't get his vibe. He looks a little reserved. He's grown, he's grown tired and weary based on you guys. That's what I'm getting. Let's see. He's still hooking it up with the paw. Oh boy. Oh, bad. Okay. So one of, this was another one that I literally couldn't identify more with. Here. So this is something that takes a really long time to get your arms around. So essentially they were asking like, why would they emphasize consistency and iteration over trying to get better returns? And it's such a funny question because I entirely understand where they're coming from. But the ultimate troll in this question is the fact that if you emphasize consistency and iteration, that's ultimately what yields. I returns. It's literally comical in that way. But that's exactly the case here. So the reason why it's such an important thing to follow along with is because think of anything that you've ever tried",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 59,
      "start_timestamp": "01:01:53",
      "start_timestamp_seconds": 3713.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3713"
    }
  },
  {
    "text": "is the fact that if you emphasize consistency and iteration, that's ultimately what yields. I returns. It's literally comical in that way. But that's exactly the case here. So the reason why it's such an important thing to follow along with is because think of anything that you've ever tried to get better at in your life. Anything. The first thing that you will be told is that you need to practice. And the point of practice is to build repetitions. Then the concept during those repetitions is to slowly refine the movement or the exercise of whatever you're doing so that you can become better at it. More efficient, whatever the thing is, if you're into music and you play instruments, I never did other than whatever that thing is you playing like fourth grade, the recorder, whatever it is that nobody ever sounds good at that thing. I did that and I sucked with everybody else. But if I ever wanted to get good, does anybody ever actually get good at the recorder? Are there like people that are banging with the recorder? Because I feel like I've never heard of any sort of music that slaps that somebody's rolling with the recorder. But maybe I'm just not well versed enough. That would be a fun exercise at some point to figure that out. But that exact thing is what carries over to trading is your ability to iterate your ability to take information to refine what you're",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 59,
      "start_timestamp": "01:03:51",
      "start_timestamp_seconds": 3831.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3831"
    }
  },
  {
    "text": "somebody's rolling with the recorder. But maybe I'm just not well versed enough. That would be a fun exercise at some point to figure that out. But that exact thing is what carries over to trading is your ability to iterate your ability to take information to refine what you're doing and to attempt to improve again and again and again and again. I use basketball a lot because I like basketball. Same thing with Jiu Jitsu, I like martial arts a lot. I like the same thing if you're in Moitai and the first time you try to throw a tip that's going to be trash. The way you develop a sound tip is by doing tons in tons of tips. It's the same thing in trading. So the way that you get better as a trader is the same way you get better at anything else, which is by putting in really robust practices and the way that we practice is very different. The way that we practice as traders is again, for me, typically it's when markets are closed, do a bunch of research. It's understanding how things move, behave, understanding trends so that I'm more able to read what's going on and then adapt to things. That's the idea. So this is an interesting one because I understand the question, but the funny part is it's consistency and iteration that literally yields the higher returns that most people are pursuing. Ricky says, what are the most",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 59,
      "start_timestamp": "01:05:19",
      "start_timestamp_seconds": 3919.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3919"
    }
  },
  {
    "text": "to read what's going on and then adapt to things. That's the idea. So this is an interesting one because I understand the question, but the funny part is it's consistency and iteration that literally yields the higher returns that most people are pursuing. Ricky says, what are the most effective ways to manage risk as a trader without being too restrictive? That's super easy. It's the size, trades logically before you put them on and then following whatever that rule set is that you defined. So again, going back to why the outlier strategy process is so important because if I decide myself that no matter what, I'm going to close all trades at 8 of the portfolio drawdown. So if I have a trade that is losing more than 8 value of the portfolio, that trade comes down. It just doesn't make sense. And it's because things need to be put on in a size that reflects what the strategy is. And they should be all put on together in a way that aligns with the broader portfolio risk. Tolerance. So the way to manage risk is to spend more time planning trade entries than most people probably do, like without a doubt. For sure. Roaring says, you talk to Tom about utilization during the tariff pullback. He said his account utilization went up to 60. Why would that be expected? Unutilized dollars to buy the dip? To me, it was actually slightly unexpected. I thought that he",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 59,
      "start_timestamp": "01:06:38",
      "start_timestamp_seconds": 3998.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=3998"
    }
  },
  {
    "text": "do, like without a doubt. For sure. Roaring says, you talk to Tom about utilization during the tariff pullback. He said his account utilization went up to 60. Why would that be expected? Unutilized dollars to buy the dip? To me, it was actually slightly unexpected. I thought that he would have scaled up a little bit more. So I would have expected him to be deeper in like the 70 80 handle, which I think he ended up saying that it was like close to 70. So that ended up being in line with expectations. And that's simply because when things are going a right, your margin requirement is going to go up naturally. So that's how much money you're going to have to set aside for margin requirement from the broker. And then there's the amount of adjustments, especially for somebody like in his style, what he's going to have to do. So during those kinds of periods for options traders in general, you tend to increase utilization. I do as well, but the way that I increase is slightly different than he does. So the reason why I was expecting something close to 70, a lot of it is just intuition based on having a general sense of like what the portfolio looks like leading into the drop, what the drop look like. And then just intuiting my way through what I think it likely looked there. But the short answer to that is it's simply because",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 59,
      "start_timestamp": "01:07:54",
      "start_timestamp_seconds": 4074.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4074"
    }
  },
  {
    "text": "it is just intuition based on having a general sense of like what the portfolio looks like leading into the drop, what the drop look like. And then just intuiting my way through what I think it likely looked there. But the short answer to that is it's simply because the portfolio is going to be more utilized when markets are going down both from a defensive posture, but then also from trying to capture more opportunities. That's what I would think. Where Enclity says maybe snake charmers do they use recorders? What do snake charmers use? Actually, I don't know. What do snake, what instrument? I think it's like a flute. What instrument do snake charmers use? Oh, shit. They use a pungi also known as a bin bean when instrument made from a gourd with two read pipes inserted one for melody and one for drone. The pungi is played with continuous droning melody which snake charmers use during performances. Yo, that is so cool. That's so cool. Learn something new. All right, let me move you guys here so I can keep a better eye. James says, I've heard other people base risk on wing width. What are your thoughts on this for evaluating risk? I feel like it's the nice way thinking about it, but really don't know how to refute it. No, I think that's completely fine. There's plenty of times where I'll put on a trade and use the width of the wings to",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 59,
      "start_timestamp": "01:09:29",
      "start_timestamp_seconds": 4169.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4169"
    }
  },
  {
    "text": "are your thoughts on this for evaluating risk? I feel like it's the nice way thinking about it, but really don't know how to refute it. No, I think that's completely fine. There's plenty of times where I'll put on a trade and use the width of the wings to define the risk. That's kind of the point of putting on a vertical of some sort, whether it's in iron condor, in iron butterfly, a butterfly, anything that has the protective wings that's literally the point of those wings is to define your risk. So I don't think it's naive at all. Now, the thing I would keep in mind though is that the width of the wings and whatever that max loss represents still has to make sense. Right? So if we're trading a 5,000 account and we're trading something that's 10 wide and let's say that we're getting 2.30 we're not really getting a whole lot and we calculate our max risk as 7.70 and let's say we start with a one-log. What did I miss out on this? You're risking 770 here. This is a percentage of the portfolio is 15 of the portfolio. Huge risk. So just because there's a wing doesn't mean that you don't size it, still has to be size logically. So on something like this, obviously the 10 wide isn't that you're at the smallest size you can get. So there's no scaling down the trade size. So you have to tighten",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 59,
      "start_timestamp": "01:11:04",
      "start_timestamp_seconds": 4264.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4264"
    }
  },
  {
    "text": "just because there's a wing doesn't mean that you don't size it, still has to be size logically. So on something like this, obviously the 10 wide isn't that you're at the smallest size you can get. So there's no scaling down the trade size. So you have to tighten the wings. That's your only choice here. So yeah, there's absolutely nothing wrong with using wings to define your risk. That's actually the literally the point of adding the wings is to define the risk. A shot that says how, why and when you move from IWM to leveraged ETF. How was just by trading a different ticker? Why is because small caps used to be way higher performing relative to large caps for a really long time? And that ended up changing. So because that changed especially during COVID when the rate environment when hey, wire will really post COVID I should say. But let's take a quick look. So if we look at all of the major indices and I'm going to zoom these out far, we'll go max time frame weekly. One of the things you'll notice is that if we look at essentially price behavior between the mid teens and mid to late teens and definitely earlier. So I should say like up to the mid to late teens. Growth stocks use to generally outperform large cap. Now after tech started really taking off that all changed. And a big part of that is because tech",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 59,
      "start_timestamp": "01:12:23",
      "start_timestamp_seconds": 4343.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4343"
    }
  },
  {
    "text": "the mid teens and mid to late teens and definitely earlier. So I should say like up to the mid to late teens. Growth stocks use to generally outperform large cap. Now after tech started really taking off that all changed. And a big part of that is because tech is still a very big part of large caps. So it's led to a strong outperformance of these. So that's the purpose behind the switch from IWM. And it was about that time frame. It really started phasing out in like I would say the late teens. And then definitely by the early 20s, it was out. It was into other stuff like spy cues and trading leverage ETFs there as well. But it has to do with identifying different market regimes and adapting to them. Charles that says, but why but then why leverage ETF you didn't use TNA but you're using TQs. Oh, you mean why didn't I, is the question why didn't I rotate from IWM into a levered ETF instead of making the changes into cues and spy or are you asking why didn't I use TNA back prior? Is what makes sure I answer the correct version of the question. For those that don't know, there's a really tasty water thing. I think it's called liquid IV super good. And while Shahazad is clarifying for me, James says I thought it would be more important to consider probability expected return, etc. Well, that's that's way",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 59,
      "start_timestamp": "01:14:20",
      "start_timestamp_seconds": 4460.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4460"
    }
  },
  {
    "text": "correct version of the question. For those that don't know, there's a really tasty water thing. I think it's called liquid IV super good. And while Shahazad is clarifying for me, James says I thought it would be more important to consider probability expected return, etc. Well, that's that's way more to do with the strategy. So that always has, yeah, that always has to matter. But yeah, that like I consider using the width to define the risk of very, very different process than deciding like what gets the spread, right? Because that's still a reflection of whatever the overall approaches that you have. So I would view them as very, very different things personally. So yeah, like even with the vertical spread, you need to without a doubt pay attention to all of those other factors. To me, that's a given behind putting the trade on. Shahazad says why from IWMTQ's why not Q's also why not TNA back then? Yeah. So I absolutely have used without a doubt leverage ETFs from effectively when they're around. But if we go back to when TNA was launched, what do you notice? TNA didn't have the track record early on because it was new. It was very, very new. TNA was launched essentially what like, oh, eight, I think like late, oh, eight. So there was no real good data sample to go back on on the operation of it. But I absolutely use leverage ETFs on and off. There's",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 59,
      "start_timestamp": "01:15:57",
      "start_timestamp_seconds": 4557.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4557"
    }
  },
  {
    "text": "because it was new. It was very, very new. TNA was launched essentially what like, oh, eight, I think like late, oh, eight. So there was no real good data sample to go back on on the operation of it. But I absolutely use leverage ETFs on and off. There's a difference between talking about the coverage strangle is a reflection of like the core allocation in the way that I typically would run those versus using it as a speculative allocation, which is typically the case for me. It's still the case today when I'm trading a core allocation of a levered ETF that's done in the context if I'm essentially sizing it as if I was trading the same size with a non-levered ETF. But there's another approach with the coverage strangle where I trade it as a speculative play. And there's way more of a momentum following approach attached to it. So for TNA, the reason why not so much back then, I definitely did trade it, but not anywhere near as much is lack of track record for sure with the underlying itself. And then the reason why I switched to Q's and you pro or SP 500 levered is two reasons. And it's because like I was telling you earlier, post 2000 large cap has been outperforming massively. So I'm not going to trade the underperforming index compared to the others. So that's the main reason for the switch. And then with respect to why",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 59,
      "start_timestamp": "01:17:46",
      "start_timestamp_seconds": 4666.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4666"
    }
  },
  {
    "text": "SP 500 levered is two reasons. And it's because like I was telling you earlier, post 2000 large cap has been outperforming massively. So I'm not going to trade the underperforming index compared to the others. So that's the main reason for the switch. And then with respect to why the levered stuff, that's really, I mean, from the core allocation, that's only part of it. The main reason why I started those examples that I run for the sample portfolio that I share with you all is to just show different things. So I was actually just talking about switching, I think out of you pro into something else. Oh no, it was using you pro still, I think, but doing like a dollar cost average example. So I'm just literally showing a live example in that portfolio. That's only a subset of like what my actual portfolio looks like, which still absolutely has just the base ETFs without a doubt. So those are the main reasons why I do think about and expect a time where growth stocks will look better again, but for the time being just not seeing it. It's such a restrictive environment for them. Super, super, super difficult. Lawrence says, what do you think about the large amount of money recently added to the tech sector? Not surprising at all. I think especially with the recent drawdown that we saw in the broader market, you almost can't, I couldn't see anything else happening logically.",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 59,
      "start_timestamp": "01:19:03",
      "start_timestamp_seconds": 4743.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4743"
    }
  },
  {
    "text": "Super, super, super difficult. Lawrence says, what do you think about the large amount of money recently added to the tech sector? Not surprising at all. I think especially with the recent drawdown that we saw in the broader market, you almost can't, I couldn't see anything else happening logically. And it's also because tech has become especially like really stable tech almost becomes safer than things like bonds and whatnot, which is kind of crazy. Microsoft, for example, effectively started behaving like a bond, especially during like post COVID when yields were going all over the place. So I think in general tech is still likely to be the bell of the ball. I think it's going to be a primary driver of growth. I think most places will see that and likely position themselves. So if we take a look at sector flows really quick. And let's take a look. Zoom out. We'll do like six months. So if we take a look at like what's been happening. Well, let's keep calm services. We'll get rid of the rest. So you can also see a pretty significant bifurcation between tech and calm services in terms of net flows into them over the last month. But you can see that there was a massive outflow. So the money that you see moving into and out of, I also think is reflective of a bit of a correction from this phase, right? Because we saw general funds starting to flow",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 59,
      "start_timestamp": "01:20:35",
      "start_timestamp_seconds": 4835.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4835"
    }
  },
  {
    "text": "into them over the last month. But you can see that there was a massive outflow. So the money that you see moving into and out of, I also think is reflective of a bit of a correction from this phase, right? Because we saw general funds starting to flow out towards the end of Fed. So yeah, I think that's a primary driver is to why you're likely seeing some of that activity going into tech. But I think it makes sense to go into tech because even for longer term positioning now that it does look like the tariffs are likely to chill out and likely to continue the extension process of not having them with that is the case. I would imagine they would continue to do well. One says any upcoming earnings place you'd recommend for a 40k account. I don't recommend shit. That is all up to you to decide for yourself. Now earnings plays in general. I think they're completely viable. We review a lot of those actually during like the market prep stuff on the Sunday streams. And it's because for me, there are a really simple way to gain access to non correlated returns. But the way that I just essentially apply the standard approach, there's a video I think on the YouTube channel that you might have seen. If you just go to the channel and you like search like keyword search earnings, like just the term earnings, you should see",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 59,
      "start_timestamp": "01:22:18",
      "start_timestamp_seconds": 4938.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=4938"
    }
  },
  {
    "text": "correlated returns. But the way that I just essentially apply the standard approach, there's a video I think on the YouTube channel that you might have seen. If you just go to the channel and you like search like keyword search earnings, like just the term earnings, you should see it. Let me see if I can I can find the video really quick. But I want to see if I can find a way to show you guys how to search the channel well because I think there's I'm not mistaken. There's like literally a search box now. Yeah, perfect. So if you go to the channel and you just pop into this thing, you can literally search the channel for keywords, right? And bingo, there you go. So you can watch something like this to get a sense of some of the basics that I would apply. But those are very much the basics. And it's because it's like anything else, right? Like there's no way that I could distill down everything that goes into building an earnings trading approach in 20 minutes. It's there's just so much context. But it's the cradle principle. You can definitely get the bulk of it. And like the major muscle movements. Now the other thing to note though is that earnings is winding down. So you are coming up at a point where at least for me, I absolutely like I slow down massively with what I'm trading now because there's",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 59,
      "start_timestamp": "01:23:39",
      "start_timestamp_seconds": 5019.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5019"
    }
  },
  {
    "text": "the bulk of it. And like the major muscle movements. Now the other thing to note though is that earnings is winding down. So you are coming up at a point where at least for me, I absolutely like I slow down massively with what I'm trading now because there's just not there's just nowhere near as much stuff that's interesting to me coming up. So like PDD, Octa, those are like maybe we can take a look at one of them really fast at a curiosity. Yeah, I mean, this does not look good. It looks interesting from a long wall, but I very rarely would trade long wall. There's like three ways that I would trade earnings. There's the expansion of all into earnings. There's the contraction post earnings, whether it's done via entry before after completely context dependent. And then there's the directional move pre and post earnings. So depending on the stuff that I'm looking at, I effectively apply those filters to sort that out. But yeah, Lauren says, how did I not know? There was a search bar. There is a search bar. Yeah, which is super useful, right? Because you can get through because the channel is a ton of right is 600 fucking videos. How many videos can I possibly have a ton? So you can literally just drop different keywords in the search bar, which is a little bit easier. A yo, Mr. J. W. H. I think I know who that",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 59,
      "start_timestamp": "01:24:51",
      "start_timestamp_seconds": 5091.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5091"
    }
  },
  {
    "text": "the channel is a ton of right is 600 fucking videos. How many videos can I possibly have a ton? So you can literally just drop different keywords in the search bar, which is a little bit easier. A yo, Mr. J. W. H. I think I know who that is. Happy birthday, my friend. I should be heading down to you guys pretty soon. I'll probably wrap this up in like the next five minutes or so. And then I'll head down. I was going to see the Mel probably ain't making it, but I should be able to make it down. Happy birthday, though. It is his birthday. So Shahzad says, do you prepare your zero DTE to outside more everything? Literally everything. The big, literally the biggest thing, the most time intensive thing that you do as a trader is not clicking the button that that's not the time any decision making is really done. Like that's it. There's nothing that's not a thing. Because when the market's open, you get a completely different information set. But all of the work is done when the market is closed. That's again, when you're following that research process that I talked about with respect to the outlier strategy process, right? That's like that's the time consuming thing. You have to do the fucking homework to know what exists, how it behaves. And then when you're going to place trades, it's super easy. It literally takes seconds because you already",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 59,
      "start_timestamp": "01:26:12",
      "start_timestamp_seconds": 5172.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5172"
    }
  },
  {
    "text": "I talked about with respect to the outlier strategy process, right? That's like that's the time consuming thing. You have to do the fucking homework to know what exists, how it behaves. And then when you're going to place trades, it's super easy. It literally takes seconds because you already know what you're doing because you did all the research ahead of time. But that's where all the work is done is in the research. So yeah, like, like literally everything is done when the market's closed for me. When the market is open, it's looking at things, seeing what's going on. And for the like the total amount of button clicking is so true, it's minimal because it doesn't take that long to click buttons and put stuff on. All of the work is done when markets are not running. James says, is there a tool that shows historical price movement leading up to an after earnings? Well, this does. I think our swim does. I use a few tools that are a little more effective, I think. So one of them, as you guys see me regularly use unusual whales, they have a pretty cool tool. So if we take a look at PDD and we go down to earnings, you can see effectively what the move is preimposed earnings. This isn't the lead up right away, but this shows you the lead up in a table. So there's that. There's also bar chart has one. And so",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 59,
      "start_timestamp": "01:27:32",
      "start_timestamp_seconds": 5252.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5252"
    }
  },
  {
    "text": "we take a look at PDD and we go down to earnings, you can see effectively what the move is preimposed earnings. This isn't the lead up right away, but this shows you the lead up in a table. So there's that. There's also bar chart has one. And so does O rats literally all the ones that I typically use. Let's go to here. So you can see like pretty easily here. The other thing you do is literally just have Chatchy PT build it for you. You can download the market data for something then download when the earnings releases are and then just calculate it off of that. So yeah, between unusual whales, I like this one probably more than the others O rats is another really good one big fan of that one. And then like this is cool, right? Because this gives you the ability to look across different time frames and to analyze what the average moves are leading into earnings over different time frames. Like that kind of stuff is useful. But from a data analysis perspective, this actually isn't that useful, right? Like this is a cool visual, but I'm applying way more of a data analysis approach. So I like to download the data and all of sweet. Any other last minute questions or anything that you guys want to hit on? I'm going to try to do maybe like one of these QA's like once a month, but I thought",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 59,
      "start_timestamp": "01:28:38",
      "start_timestamp_seconds": 5318.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5318"
    }
  },
  {
    "text": "more of a data analysis approach. So I like to download the data and all of sweet. Any other last minute questions or anything that you guys want to hit on? I'm going to try to do maybe like one of these QA's like once a month, but I thought doing it after the prior series, hopefully was useful. And then for those that I didn't get a chance to cover all like honestly, most of the emails, I'll probably try to bake those into a couple of the upcoming live streams on like Wednesday and stuff like that. So wait, all right gang, well that wraps me up then. I'm going to go hop in the cool vet and drive down, go see my buddy for his birth day. As always, if you guys need anything, hit me up, be an outlet. See you guys later.",
    "metadata": {
      "video_id": "RRBduDJPEt8",
      "title": "Options Trading Q&A - Outlier Options Trading Foundations",
      "url": "https://www.youtube.com/watch?v=RRBduDJPEt8",
      "upload_date": "",
      "duration": 5473.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 59,
      "start_timestamp": "01:30:13",
      "start_timestamp_seconds": 5413.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RRBduDJPEt8&t=5413"
    }
  }
]