[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you these entire energy sector right now that otherwise is very clearly sucking wind. So if we take a look at, let's do the six month performance. If we take a look at the energy sector, this is within the SP 500, there are how many names in here? 22 and of those 22, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, half of them have a greater than 0, 6 month percent change performance. And you can take three of them off so that we can get to the number that are at least up 10 percent plus. So the energy sector right now is struggling, but there are very clear pockets of strength. And it's important to continue identifying those pockets of strength. And we'll see again, if any of this budget offload that we're finding and is going through doge might bleed into incentives that Trump could put in place for incentivizing some of his broader initiatives that he has discussed so far, some of which are obviously drilling more oil and things like that. So that's one of the key themes that I definitely keyed into. And then I want to go back and take a",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 42,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=0"
    }
  },
  {
    "text": "put in place for incentivizing some of his broader initiatives that he has discussed so far, some of which are obviously drilling more oil and things like that. So that's one of the key themes that I definitely keyed into. And then I want to go back and take a look through this CPI thing. Now, if you were called on the Sunday stream, and then I think I also reiterated it on the Monday stream, the reason why CPI is really important is because, sorry, my dog was breathing really weird. And it's because his head is like hanging off the bed. So his neck is at like a 40 degree angle. Clearly making breathing difficult. But the strength of the consumer right now is super important. So when we see CPI starting to tick up, and then we also still have a couple other metrics that were me, I assume you might be too, but that we are talking about are not just you're over here CPI, but here. So you can see retail sales. And I don't know why there's German stuff in here. There shouldn't be German stuff. I was like, why am I looking at stuff from Germany? I mean, I like our German friends, but I don't really care about their markets right now, to be honest with you. So core CPI and then tomorrow, we'll have month over month, or PPI and PPI were also going to have retail sales. So retail sales",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 42,
      "start_timestamp": "00:15:21",
      "start_timestamp_seconds": 921.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=921"
    }
  },
  {
    "text": "stuff from Germany? I mean, I like our German friends, but I don't really care about their markets right now, to be honest with you. So core CPI and then tomorrow, we'll have month over month, or PPI and PPI were also going to have retail sales. So retail sales tomorrow will be the next big look we have at seeing at least how the consumer is doing and what this might mean for the market. And this all goes back. I was going to say Harkins back because I've heard that word before, but then I stopped myself because I actually don't know what Harkins means, but I wanted to say it because it sounds fun. I think it makes sense to say it, but it's just a fun sounding word. This Harkins back to the conversation from yesterday and the day before, which is the market clearly is in a bit of a holding pattern. So let me move this back to the market overview. And if we take a look at the market performance over the last three days, it's essentially unchanged. And I think a lot of this is because the market right now is trying to figure out what direction we break and if so how strong and as I will continue beating the strum, I do think the pot odds still favor a downside move. Now, when I say that, when I say pot odds in this perspective, it's in terms of the risk",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 42,
      "start_timestamp": "00:16:46",
      "start_timestamp_seconds": 1006.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1006"
    }
  },
  {
    "text": "to figure out what direction we break and if so how strong and as I will continue beating the strum, I do think the pot odds still favor a downside move. Now, when I say that, when I say pot odds in this perspective, it's in terms of the risk we take. So if I were to give straight probabilistic assessment, I would have to continue to gauge and prioritize probabilistic move to the upside simply because of drift. But in the near term, and the way that the market is currently setting up to me, it feels like the better return on risk potential play here is actually to the downside. So we talked about handing or we talked about building a couple bearish style trades. We actually looked at some of them yesterday. And I added a few to the book in general because I do think again, just from a probabilistic standpoint, I'm still net positive deltas and I still will continue to be that until there's a broad regime change, which we're not in yet, in my opinion. There's still a little time for that. But I think right now with the market generally stalling out, this also goes back to when I gave you guys the last update on the covered strangle allocations. Most of the allocations there are pretty light on the equity side of things. Most of them are 20 and less of the total current cash utilized. And they're much heavier on",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 42,
      "start_timestamp": "00:18:03",
      "start_timestamp_seconds": 1083.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1083"
    }
  },
  {
    "text": "this also goes back to when I gave you guys the last update on the covered strangle allocations. Most of the allocations there are pretty light on the equity side of things. Most of them are 20 and less of the total current cash utilized. And they're much heavier on the cash secured put side. And it's because cash secured puts right now we're still making money. I actually dropped this in the discord earlier today because it's a fun case study where if we take a look at T triple cues and I forgot the position. I actually think I might have managed it today. I'll tell you what the position was so that you guys can take a crack at the case study. So what I had asked was I said that I'm short the 21 Feb. Let's get rid of the let's go to 21 Feb. I was saying that I'm short the 21 Feb 78 puts. And today the market was down but the puts were profitable meaning the puts actually contracted in value. So typically when the market goes down, we expect puts to go up in value. So there is a really key series of changes that happen that led to the puts actually being profitable on the day, even though that the market opened down. And I gave a brief overview in the discord, but it comes down to a couple key factors. Now there were a couple guesses. I know people were",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 42,
      "start_timestamp": "00:19:19",
      "start_timestamp_seconds": 1159.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1159"
    }
  },
  {
    "text": "of changes that happen that led to the puts actually being profitable on the day, even though that the market opened down. And I gave a brief overview in the discord, but it comes down to a couple key factors. Now there were a couple guesses. I know people were in there talking about things like Delta decay. And Delta decay is part of it, but that's actually not one of the primary drivers that you saw here. And that's obviously talking about like charm. And the third order, second and third order Greeks, some of them, I think people were thrown around like Van Eyes on there, which is good that we're talking about the third order Greeks. But we can simplify because remember the third order Greeks, they just help us understand what's happening, right? That's the way that we measure things. And we can see even on the day, the Delta for these puts is now 13 cents. So we can assume that when the market opened earlier today in T triple Q's and the market was down at 82, which is essentially 3 less than where we are now. So we can do the surrogate strike game. We can essentially pretend that our 78s were actually looking like similar to the 81s. So they ended up looking much better throughout the day because of the rally. So what happened here? Well, we can see that we would have lost on a Delta perspective because the directional",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 42,
      "start_timestamp": "00:20:24",
      "start_timestamp_seconds": 1224.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1224"
    }
  },
  {
    "text": "game. We can essentially pretend that our 78s were actually looking like similar to the 81s. So they ended up looking much better throughout the day because of the rally. So what happened here? Well, we can see that we would have lost on a Delta perspective because the directional move would have gone against us. We can see gamma would have been actually ramping against us. But take a look at theta and Vega. Right? So theta took out 10 cents day over day and it would have been more if we were closer to at the money earlier today. And then Vega. So today was a really interesting example of where the market actually had a bit of a down tick. But the corresponding volatility relative to the cycle that we're in did not have that drastic of a corresponding volatility uptick. So let me show you this. What I'm going to do is add another volatility line. I typically keep them off for you guys just because the way that I look at this in case you were ever wondering what it actually looks like for me. It's like this, which is I normally don't do this because I know that it's like insanely overwhelming to the standard looker. But like this. So it's a very noisy chart. But what I can do is I can isolate volatility behavior for different time frames. So if I close this off for now and we start seeing how volatility",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 42,
      "start_timestamp": "00:21:36",
      "start_timestamp_seconds": 1296.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1296"
    }
  },
  {
    "text": "because I know that it's like insanely overwhelming to the standard looker. But like this. So it's a very noisy chart. But what I can do is I can isolate volatility behavior for different time frames. So if I close this off for now and we start seeing how volatility behaved for various time frames, you'll notice that it didn't behave the same on the day. So to make this easier to see, let's move this into like a three month daily. Let's go even further. We'll do like a 30 day that's going to flatten it out too much. I'm trying to find like a really effective view for you guys that makes it easier to see. I think this one's probably the best, the three month daily. And you can see that even just eyeballing the ends of these yellow lines here, which is implied volatility. We can see that some of them are slightly upward sloping. And we can see some of them are slightly downward sloping. So to make this a little cleaner so that it's not quite as noisy for you, what I normally show you here is literally just 30 day vol. And then I show you the VRP, which simplifies the plot quite a lot for a one day and then normally a seven day period. So there would be two VRP lines in here. So anyways, back to what I want to show you, which is the seven day vol. If I",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 42,
      "start_timestamp": "00:22:50",
      "start_timestamp_seconds": 1370.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1370"
    }
  },
  {
    "text": "I show you the VRP, which simplifies the plot quite a lot for a one day and then normally a seven day period. So there would be two VRP lines in here. So anyways, back to what I want to show you, which is the seven day vol. If I show you seven day vol. And make sure that there's no others. Oh, yeah, we want 365 out of here. Notice what happened to seven day vol. That's this one. What happened to seven day vol day over day, 11th and 12th? Seven day vol contracted. Seven day vol contracted nearly a point. So even though we saw an expansion in 30 day vol, we saw a contraction in seven day vol. Now that contraction in seven day vol can be I can be visualized in a few different ways. So what I'll do to try to make it a little easier. I don't know how how difficult that is for you guys to see. I'm trying to make it so it's the difference between these is a little more pronounced between seven and 30 day vol. So I'm making this one much darker 30 day vol versus seven. Let me know if that helps. Meaning seven day vol is here. And you can see seven day vol actually contracted on the day. And now we can use the Greeks to see why would seven day vol have contracted relative to 30 day vol. If we're in this bigger down",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 42,
      "start_timestamp": "00:24:05",
      "start_timestamp_seconds": 1445.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1445"
    }
  },
  {
    "text": "me know if that helps. Meaning seven day vol is here. And you can see seven day vol actually contracted on the day. And now we can use the Greeks to see why would seven day vol have contracted relative to 30 day vol. If we're in this bigger down move. And again, it was an up move on the day. So I'm talking earlier in the day. Okay, cool. Thank you, Tommy wanted to make sure that I wasn't like just fucking talking about something. You guys are like, what the hell is this guy on about the end of the day? Obviously, it was a big rally. So all of this conversation is rooted towards the beginning half of where we gaped down to 82 and then slowly started rallying. So there's a specific Greek that explains this to us. And do you know what that Greek is? And then we're at 520. So then I will pivot us after this who are skilled development sessions. But I'm curious if you guys know the Greek. Let me grab. I'll give you the answer too. It'll take you a second to find it anyways. So you could poke through there. I'm going to open the door for Thor. What do you guys see? So right now we should be trying to understand the rate of change of volatility, not from Vega, which is just from a raw move in volatility. That's part of it. But there's another Greek that",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 42,
      "start_timestamp": "00:25:28",
      "start_timestamp_seconds": 1528.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1528"
    }
  },
  {
    "text": "there. I'm going to open the door for Thor. What do you guys see? So right now we should be trying to understand the rate of change of volatility, not from Vega, which is just from a raw move in volatility. That's part of it. But there's another Greek that helps us understand essentially Vega decay, which is Veda. Kind of like Darth Veda. Darth Vader Veda. Close enough. Darth Veda. So Darth Veda is effectively your volatility, your Vega decay. So Veda tells us rate of change per one rate of change in premium for 1 move in IV. Veda tells us Vega rate of change when there's a move in VAL and passage of time, which is what happened here. And that's exactly why you see what you see here. Now a couple other answers that I saw, let me see that were pretty close. One of them was charm. And again, this this actually wasn't charm. So for those that don't know charm is just delta decay. And again, it's essentially the change in delta from the passage of time. And it's not charm that led to this. And Vanna is close to it. Vanna is close to it. But it's not exactly it either. The more direct impact is from Veda. And again, those are really just different ways that helps us measure it. I actually think, let me take a look real quick. I think I might have built a reference for you guys. Where",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 42,
      "start_timestamp": "00:26:30",
      "start_timestamp_seconds": 1590.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1590"
    }
  },
  {
    "text": "to it. But it's not exactly it either. The more direct impact is from Veda. And again, those are really just different ways that helps us measure it. I actually think, let me take a look real quick. I think I might have built a reference for you guys. Where would I have put it? Give me one sec. So I think it might be useful. Is it in this? Sort by date. No. Damn it. Let me see if I can find it really quick. Because I literally just built this not that long ago. And what I was building was like a really, really basic chart that helps you visualize the various Greeks and their impact on this is not it. I will look for it. And then once I find it, I'll put it in the discord. Oh, it might have been, hold on, it might be on the phone. I think that might have been what happened. I think it might be in here. Aha. Found it. So what I'll do is I will drop this in the discord for you guys. But essentially what I did is I made like a really, really simple table that allows you to understand the difference in all of the different Greeks and what they measure. The one that I use in the screenshot that I showed you, it's kind of by design. It's supposed to be a little more noisy. But the whole point of it is to",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 42,
      "start_timestamp": "00:28:19",
      "start_timestamp_seconds": 1699.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1699"
    }
  },
  {
    "text": "that allows you to understand the difference in all of the different Greeks and what they measure. The one that I use in the screenshot that I showed you, it's kind of by design. It's supposed to be a little more noisy. But the whole point of it is to be more specific, meaning, you know, include the formulas and the actual movement of things. Whereas this one that I'm going to upload right now is just like a word picture that helps you understand. So this is Greeks overview. So I'm uploading that to Google Drive and then I'll be able to share that with you guys. Let me see if you guys have any questions on that. Haters says the seven day volvertured evolved put option with seven days left. Yes. Not to the vol of the put option though. Seven day, seven day vol just refers to implied volatility for a seven day time frame. We can segment implied volatility. When you look at the implied volatility for a stock, this is annualized. So we can essentially use the square root of time to determine for a bunch of different time frames. What we think volatility might be either as a raw number as an expected move. So when I'm talking about the different period of volatility, it's literally looking at this. This difference in volatility that you see here. I forgot I can draw on this. And while we're doing a volatility recap since we're here",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 42,
      "start_timestamp": "00:30:12",
      "start_timestamp_seconds": 1812.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1812"
    }
  },
  {
    "text": "be either as a raw number as an expected move. So when I'm talking about the different period of volatility, it's literally looking at this. This difference in volatility that you see here. I forgot I can draw on this. And while we're doing a volatility recap since we're here already, what is this called? This over here. The fact that 14 Feb is 62.6 vol. And the fact that 14 Feb and then 21 March is 62.1 and then let's do 15 Jan. 27. This is 55.1 vol. Term structure. So this shows us the volatility relative to different periods in time. This is your term structure. Now, James, who's speculating on contango versus backwardation, contango or backwardation is just the classification of term structure. So contango is what we tend to see markets in. This is actually in backwardation right here. This is a great example of backwardation. So contango is the propensity for further out volatility to be higher than near term volatility, which is lower. So this would be DTE. This would be zero. This would be N plus one. I guess T plus one. T plus one dot dot dot. So generally speaking, this is the configuration you'll have. The further out in time you go, the more volatility you expect to see over that time frame. This is contango. Backwardation is actually what this is configured as right now, where this 14 Feb expiry is 62.6. And this is actually 55.1 backwards. Backwardation. Tweet.",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 42,
      "start_timestamp": "00:31:38",
      "start_timestamp_seconds": 1898.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=1898"
    }
  },
  {
    "text": "the configuration you'll have. The further out in time you go, the more volatility you expect to see over that time frame. This is contango. Backwardation is actually what this is configured as right now, where this 14 Feb expiry is 62.6. And this is actually 55.1 backwards. Backwardation. Tweet. All right, we are at 530. I don't want to chew up too much time on volatility. We actually just did a session on this. And I want to make sure that we have enough time to do our case study. But honestly, great questions. As you know, always happy to talk about volatility. Volatility is super, super important. Re says isn't contango backwardation using reference of interest rates? Not really. You can, but that's it's more in reference to the yield curve. So if you're talking about interest rates, specifically the yield curve than yes. But contango and backwardation. And again, that's essentially the same thing that you see here. Right. So for yield curve, yeah. So Reese, that's the way to frame what you're asking now is in reference to a yield curve. And this is a volatility curve. The way to think about these different curves is it just looks at a relative level at different points in time. That's how we create a curve. So if we take a look at, if I turn this into a time series, which would be easier for you to see like this. And then this would be T zero.",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 42,
      "start_timestamp": "00:33:36",
      "start_timestamp_seconds": 2016.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2016"
    }
  },
  {
    "text": "it just looks at a relative level at different points in time. That's how we create a curve. So if we take a look at, if I turn this into a time series, which would be easier for you to see like this. And then this would be T zero. And then again, this would be T plus one dot dot dot, meaning just further out in time. But to make this easier, we'll just do T zero. This will be seven day. This will be T plus 30, T plus 90. So these are different explorations. You can sub in anything for these. This can be the sofa rate. This can be a two year note. This can be 10 years. This can be 30 years. So then if we have a 30 year, I actually have no idea what they're trading for right now to be completely honest. Let's see. Where is it? So the 30 years at 4.828. So put that here. 4.828. And then we'll just do one more of them. Because I think you guys get the example at this point. 10 year 4.6, 1 year 4.3, 4.6. And then this is I think a 1 year actually, which is 4.3. So the curve here looks like this. Just like that. And for those that have checked out the box spread video, I literally show you exactly how to make a yield curve. And I'll give you what it actually is. Because the tool that",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 42,
      "start_timestamp": "00:34:57",
      "start_timestamp_seconds": 2097.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2097"
    }
  },
  {
    "text": "1 year actually, which is 4.3. So the curve here looks like this. Just like that. And for those that have checked out the box spread video, I literally show you exactly how to make a yield curve. And I'll give you what it actually is. Because the tool that I built really, it's super simple to use. All we do is copy all of this stuff in to my sheet. It auto updates the curve. And then I'll show you what the curve is right now. Where to go? I'm going to paste it in here. Aha. Great success. This is the curve right now, the yield curve. So notice the name of this. This is from a sheet that I made. And again, those that are in the the proside, you guys have this template. So what this is is it shows us the relative yield for all these different time frames. So then we can visualize where things might be relatively expensive, and I 180 days for sure. And then we can see where they're relatively cheap, essentially one year. That's relatively cheap way too cheap. And again, whether it's the yield curve that we're talking about, these are just different words. Yield curve. This can be volatility curve. You can have gamma curves, theta curves, etc. And when we're talking about curves in this context, what we're talking about is a time series plot. And then a relative value. That's all. So then when I'm showing",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 42,
      "start_timestamp": "00:36:46",
      "start_timestamp_seconds": 2206.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2206"
    }
  },
  {
    "text": "these are just different words. Yield curve. This can be volatility curve. You can have gamma curves, theta curves, etc. And when we're talking about curves in this context, what we're talking about is a time series plot. And then a relative value. That's all. So then when I'm showing you tools like this, this is a delta and DTE curve. This is a theta decay curve. This is a Vega curve. This is a gamma curve. So the context of curve as we're talking about it here is simply a time series plot of the input value, whatever it is that we're talking about. And I think that's the, that's the gist. Does that all make sense? You can put a ton of stuff on a curve. And then again, contango versus backwardation just refers to the structure, what we're observing on the curve. I don't know if silence is good, meaning you guys are all locked on. Okay, cool. Thank you, Tommy. Tommy, you're the man. Because after I finished explaining some of this stuff, sometimes I genuinely am like, I have no idea if that Helter did not help at all. So thank you, Tommy. Very useful feedback from me. Okay, now we got some work to do. The case study, which is what are we at? We're at 4020. And this, oh, this isn't the case study that I'll be tomorrow. Skiz, skills dev, creating an option trade exit, strategy. Beautiful. Let me open up the",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 42,
      "start_timestamp": "00:38:33",
      "start_timestamp_seconds": 2313.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2313"
    }
  },
  {
    "text": "feedback from me. Okay, now we got some work to do. The case study, which is what are we at? We're at 4020. And this, oh, this isn't the case study that I'll be tomorrow. Skiz, skills dev, creating an option trade exit, strategy. Beautiful. Let me open up the door for Thor. We have a ritual now where he runs out for his dinner and then he runs back in immediately, post dinner and gets back in his heated blanket. It's actually fucking hilarious. So the session for today for the skill development is about creating an exit strategy for options trades. And the reason why I'm talking about this is because for most people, we know that this is a purely random effect. This is something that we kind of just try to figure out as we go. As promised, here's a video about risk management with respect to this broader conversation that we're going to have. And here's, here's where things start to become more important. So let's take a look at this. We're Joe McFatguy, which is obviously absolutely epic name. Joe McFatguy. They have a 200 loss on their calls. Do they hold or do they sell? What's the answer to this? Now the easy answer to this is, well, it depends. Right? Because it obviously does. It depends on the strategy. It depends on what their idea was. It depends on a lot of stuff. So the very first step when we're considering in",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 42,
      "start_timestamp": "00:40:13",
      "start_timestamp_seconds": 2413.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2413"
    }
  },
  {
    "text": "they sell? What's the answer to this? Now the easy answer to this is, well, it depends. Right? Because it obviously does. It depends on the strategy. It depends on what their idea was. It depends on a lot of stuff. So the very first step when we're considering in exit strategy is very simple. There are going to be core concepts. These core concepts are going to apply to literally everything. And then there's going to be strategy specific. And these strategy specific concepts, as you probably can guess, they're relative to the actual strategy. Let me grab the chat here. I want to be able to hang out with you guys. Reese says, are they naked or covered? These are, well, you answer it based on what you can see in this, because you can answer that for yourself for the contracts here. So your terminal learning objective for the session today, what you should walk away with, is an understanding of how to create an effective process for determining exit points in a strategy. That's your terminal learning objective. And then for those that are in the pro-patrion, tomorrow, when we will do our case study, we're actually going to use some of your strategies to figure out what's optimal for your strategy and how we can build it in a natural practical sense. So here, this homey bought 10 of these calls. He bought 10 for 6.5, bought them on the 6th of Feb, and now",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 42,
      "start_timestamp": "00:41:55",
      "start_timestamp_seconds": 2515.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2515"
    }
  },
  {
    "text": "actually going to use some of your strategies to figure out what's optimal for your strategy and how we can build it in a natural practical sense. So here, this homey bought 10 of these calls. He bought 10 for 6.5, bought them on the 6th of Feb, and now they're currently trading at 315. So this represents a, essentially, 50 decline. I actually don't know what they're talking about with 200 calls lost. This is way more than that. Okay. Well, they're also very confused about the relative size of their own risk, which is actually kind of fucking crazy. So anyways, let's take a look. I want to talk about, and I want to add some common misconceptions that we're going to talk about. And as always, with the common misconceptions, the goal is at the end of the video, you should have the correct answer for all of these. So let's take a look. Misconceptions. One of them is never, never. Risk more than X percent. The second one is always lock-in profit. Third is green. Is always, I don't know why I got all fucked up. Always better than red, which is both should anyways, because red is my favorite color. And then the last one is take profits at X percent. Okay. So from a high level, have you all heard of at least one of these? Or did all of these things that I throw up here, does this all sound kind of crazy?",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 42,
      "start_timestamp": "00:43:47",
      "start_timestamp_seconds": 2627.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2627"
    }
  },
  {
    "text": "red is my favorite color. And then the last one is take profits at X percent. Okay. So from a high level, have you all heard of at least one of these? Or did all of these things that I throw up here, does this all sound kind of crazy? Or does this generally make sense? Meaning this is at least something you might have heard at some point. Any question? Okay. Resets heard them, but not from you. Oh, definitely. I'm glad you haven't heard them from me, because I won't say stupid shit like this. This doesn't make sense. And 54 says you have heard it. They swags this three quarters. Okay. Great. So these are things that you've heard to varying degrees before. These are things that typically sound smart. And I'm going to show you, not going to tell you directly, but I'm going to show you why literally all of these are misconceptions. So now let's go back up and let's get back into the core concepts for an exit strategy. So the very basis of an exit strategy starts from the most basic point. What is the most basic point? If we're thinking about an exit point that always makes sense, regardless of the strategy you have on, what could that be? Any guesses? Res says when do you cut losses? Nope, that's not it. Because remember, exit strategy is not just for losing trades. Exit strategy is also for winning trades. So we",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 42,
      "start_timestamp": "00:46:16",
      "start_timestamp_seconds": 2776.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2776"
    }
  },
  {
    "text": "an exit point that always makes sense, regardless of the strategy you have on, what could that be? Any guesses? Res says when do you cut losses? Nope, that's not it. Because remember, exit strategy is not just for losing trades. Exit strategy is also for winning trades. So we can talk about winning trades and losing trades separately for sure. But your scenario, Res, of when do you cut losses is important. I want you to zoom up one click from that. When would we make when would we cut a loss? Res says just thought, risking the main thing we can control. It's a great guess. You're not wrong, by the way. You're not wrong at all. I just want to zoom you up one more level. Because when we get into the actual point where we cut losses, that's actually where we become more strategy specific. Okay, Impala is heard of all four. Great. This is good. So then by the end of this, you guys should have a pretty good sense of why these are all nonsense. So, Res, zoom your answer up one level. You're saying when to cut losses, why would we cut losses? Pop-a-proper is very close. Ah, there you go. Ryan's got it. Nice job, Ryan. So Ryan is saying when the thesis is proven or disproven. This is literally the root of every single trade that goes on on when we should exit the trade or begin looking to exit at",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 42,
      "start_timestamp": "00:47:50",
      "start_timestamp_seconds": 2870.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2870"
    }
  },
  {
    "text": "Pop-a-proper is very close. Ah, there you go. Ryan's got it. Nice job, Ryan. So Ryan is saying when the thesis is proven or disproven. This is literally the root of every single trade that goes on on when we should exit the trade or begin looking to exit at the trade. Is when our idea is either validated or invalidated that has nothing to do with an arbitrary percent move in the underlying, it has everything to do with what your thesis is. Because let's say for example, let me hide all that stuff. Let's say for example that you're in Nvidia. And let's say that you're an investor and your vision in Nvidia is that in a one year time horizon, it'll be worth more than it is right now. But let's say you also have a rule in place in your portfolio because you heard that this was smart, that at any point the ticker has a 10 drawdown from wherever, let's just pick a level, 10 drawdown that you should get out. Well, what would have happened here? In something like Nvidia, when it was 136 up here, and traded down at 91, guess what would have happened? You would have gotten out. But even if we look at the movement from here to here, it's been in profit since for sure. So the point is if you pick an arbitrary number, it might not align with the actual idea. The idea in this case is",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 42,
      "start_timestamp": "00:49:25",
      "start_timestamp_seconds": 2965.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=2965"
    }
  },
  {
    "text": "have happened? You would have gotten out. But even if we look at the movement from here to here, it's been in profit since for sure. So the point is if you pick an arbitrary number, it might not align with the actual idea. The idea in this case is an investment, a longer term idea. So if we go back now to this and we add our second core concept, it's that exit must fit thesis. The exit has to fit the thesis. If you use an arbitrary exit that doesn't align with your thesis, you are at a natural crossroads that don't make sense. Okay, so now let's talk about some strategy specific concepts. This has everything to do with expected return. The expected return of the strategy is what will guide where our exits should be. So now let's talk about the two elements of an exit strategy. The first one has to be what we talked about up here. So predefined targets. This can be P and L. This can be stock. Again, this will be based on the strategy. The second element of an exit strategy is the method. This is do we use a mental stop? Do we scale? Do we have a resting stop? These are the two primary elements of an exit strategy. The first thing is you need to define it. And then the second thing is you have to determine the corresponding method that makes the most sense. So I've",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 42,
      "start_timestamp": "00:51:20",
      "start_timestamp_seconds": 3080.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3080"
    }
  },
  {
    "text": "mental stop? Do we scale? Do we have a resting stop? These are the two primary elements of an exit strategy. The first thing is you need to define it. And then the second thing is you have to determine the corresponding method that makes the most sense. So I've given you examples before about making sure that the exit strategy itself fits the opportunity. And then for the strategy specific side of things that the expected return is still positively expected. So I'm going to clear all this off. I don't want to get rid of the misconceptions though. So I'm going to take a screenshot of these. Here. And now I can delete them. So now let's hypothesize a little bit. Let's say that what's one of those rules that you've heard? Do you have you guys heard specific percentages? Like always take your profits at blank or never risk blank. Have you guys heard of any of those kinds of things? I'm specifically asking like specific percentages or numbers that you've heard relative to those. 50 max profit. Okay. Now that's a tasty trade artifact, which obviously I'm familiar with. And this is on short options if we've sold something. So the idea here is 50 max profit. So to illustrate this one, I'm actually going to grab a website and we're going to take a look together. Let's do. This is all good. Let's do two of these. I'm running a test really quick. Paul says",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 42,
      "start_timestamp": "00:54:03",
      "start_timestamp_seconds": 3243.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3243"
    }
  },
  {
    "text": "we've sold something. So the idea here is 50 max profit. So to illustrate this one, I'm actually going to grab a website and we're going to take a look together. Let's do. This is all good. Let's do two of these. I'm running a test really quick. Paul says does 50 apply to all DTE? Well, it's based on the broader tasty trade methodology, which they're going to sell typically at 45 DTE and then it'll be 50 or closest to 20 or 21 days, I think. But the reality is that that actually is not the correct answer. That's just a simplified answer. That answer is designed to make it easier for you to synthesize and figure out, you know, like what you should do and what you shouldn't do. But it's not the correct answer. And I'll give you an exact example of why this is. So let's take a look on short term strategies. So let's take a look on why Day Swag is completely wrong on his idea. So what I'm looking at is trading zero DTE options in SPX. And I want to show you two different scenarios. So for these two different scenarios, you can see this one has a higher win rate. This one up here is managing at 50 max. You can see the actual return is much better. This is no exit to X-PRI. So the performance goes from a 2.4 Kagger to a 11.8 Kagger. Let me move my",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 42,
      "start_timestamp": "00:55:59",
      "start_timestamp_seconds": 3359.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3359"
    }
  },
  {
    "text": "you can see this one has a higher win rate. This one up here is managing at 50 max. You can see the actual return is much better. This is no exit to X-PRI. So the performance goes from a 2.4 Kagger to a 11.8 Kagger. Let me move my head out of the way. There. So this is an example where just defaulting to 50 max profit literally doesn't make any sense. And it's way more nuanced than that. So the art of developing the actual exit plan comes down to understanding the strategy that you're using. And then what periods functionally make sense to get out at. And the way that we figure that out is by actually looking at the strategy. If you don't look at the strategy, you will not know. There's no way for you to know. So if we take a look at the misconceptions, the first one is take profits at X percent. Well, we know this isn't true. The reason why we know it's not true to set a fixed take profit at blank percent is because it's going to be highly relative to the strategy. So as always, we can display this. We can illustrate this with an example. And it'll be done through the expected return formula. So we have an average win. We have a win rate. We have an average loss. We have a loss rate. So let's take a look at a couple simple scenarios. Let's say",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 42,
      "start_timestamp": "00:58:15",
      "start_timestamp_seconds": 3495.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3495"
    }
  },
  {
    "text": "this. We can illustrate this with an example. And it'll be done through the expected return formula. So we have an average win. We have a win rate. We have an average loss. We have a loss rate. So let's take a look at a couple simple scenarios. Let's say our average win is one Hyundai. One Hyundai dollar. And let's say our win rate is 90. Let's say our average loss is 2000. Then loss rate 10. The expected return here, pretty simple formula, average win times win rate plus average loss times loss rate. You have a negatively expected strategy. Even though you are winning a shit ton of times, you are winning 90 of your trades. 10 of your trades are wiping you out. And this goes even further than that. So let's take a look at one other thing. Let me see. This is okay. Give me one sec. I want to grab another example. I just have to find it for you. I did like a series of examples with this. I can't find it. Annoying. Well, anyways, let me continue with a little bit more of the example. And then I want to give you a wave forward. And then for those that are in the pro livestream tomorrow, this is where we're actually going to lift this and use this to create the actual steps for the case study. So the key takeaway here is that you cannot apply a random approach. The",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 42,
      "start_timestamp": "01:00:18",
      "start_timestamp_seconds": 3618.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3618"
    }
  },
  {
    "text": "you a wave forward. And then for those that are in the pro livestream tomorrow, this is where we're actually going to lift this and use this to create the actual steps for the case study. So the key takeaway here is that you cannot apply a random approach. The approach has to be based on the strategy because now let's take a look at a couple different scenarios. Let's say that you have a system. We'll do it down here. Let's say that you have a system that has 10 winning trades and two losing trades. Actually, we'll do eight and two to keep it at 10. Let's do the same thing here. Let's see what the numbers do. Let's just have a little fun and tinker a little bit. I know that it might be weird that this is the idea of fun, but this is and it is fun. Let's have these inputs instead. What I'm going to do is have number of wins, number of losses, and then I'm going to calculate this. So this will be this divided by this plus this. And then I'm going to calculate this is this divided by this plus this. The reason I'm doing it via formulas so that we can play around a little bit because what do you notice? What just happened in these two different systems? They represent literally the same thing. But if we have these slight changes in a system where the win rate",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 42,
      "start_timestamp": "01:02:47",
      "start_timestamp_seconds": 3767.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3767"
    }
  },
  {
    "text": "this. The reason I'm doing it via formulas so that we can play around a little bit because what do you notice? What just happened in these two different systems? They represent literally the same thing. But if we have these slight changes in a system where the win rate is 90, the loss rate is 10 9 and 1. We come to our expected return of negative 110. So then as we start blowing up these samples a little bit, you'll see provided that we stay exactly in the same sample size, the expected return will still show obviously the same rate. But the difference is that it very rarely is going to show the same exact expected return as the sample size changes because slight differences are going to enter into the system. So now there's a really, really important way we need to be able to identify one of the most important traits with respect to a strategy. I'm actually going to build a standalone video on it. The thing I'm going to show you all is how you can figure out the number of trades you need to determine once you have a set confidence interval. So I use like a 95 confidence interval in the number of trades required so that you know that the strategy that you're using again with the 95 confidence interval is actually representative of the expected return because what we don't know in this strategy here or this strategy here",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 42,
      "start_timestamp": "01:04:39",
      "start_timestamp_seconds": 3879.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3879"
    }
  },
  {
    "text": "So I use like a 95 confidence interval in the number of trades required so that you know that the strategy that you're using again with the 95 confidence interval is actually representative of the expected return because what we don't know in this strategy here or this strategy here is have we put on enough trades to know that this expected return is accurate or not. Does this actually reflect the performance of the strategy and the reality is we don't know because there's a simple way to calculate that which that will be a time, a lesson for another time since we are pretty much at time here. So let's finish out these misconceptions. The never risk more than x on an individual trade. This loses all nuance in a strategy. So let's say that in this case we're using a 100,000 portfolio. And what are some of the common numbers that you that you're told to never risk more than anybody have one that comes to the top of your mind? Never risk more than 1 recess. Great. So 1 risk. We can again do the math. Obviously you can just do the mental math here, but so on a 1 max loss, let's see what happens here. Let's see that if our average loss is negative 1100. Interesting. So in this sample so far we see that if we risk more than 1 this looks to hold. Right. Well, what happens if our average win isn't",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 42,
      "start_timestamp": "01:06:07",
      "start_timestamp_seconds": 3967.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=3967"
    }
  },
  {
    "text": "so on a 1 max loss, let's see what happens here. Let's see that if our average loss is negative 1100. Interesting. So in this sample so far we see that if we risk more than 1 this looks to hold. Right. Well, what happens if our average win isn't actually 100? What happens if our average win is 150? Serious. Now it's fine. So the point that I'm making is that these blank rules of never risk more than blank percent are it's just ignorant because it doesn't take into account the nuance of a strategy. In this strategy, you win 90 of the time at 150. You lose 10 the time at 1100 which exceeds the maximum allowable risk. You make money. This is not bad. This is completely okay. So when we think about never risk more than blank percent, that comes down to a personal decision based on your risk tolerance. I can give you examples of some of my friends that are traders that trade actually very concentrated portfolio of three tickers and their portfolio will go through 30 40 drawdowns. They still make good money because when the trades come online, they make a lot of money. But that's based on the performance of their broader system. Right. So when we look at this here and this here, the only time to set some sort of risk percent protocol is based on yourself, what you prefer to risk. That's it. Nothing else. So this",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 42,
      "start_timestamp": "01:07:40",
      "start_timestamp_seconds": 4060.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4060"
    }
  },
  {
    "text": "lot of money. But that's based on the performance of their broader system. Right. So when we look at this here and this here, the only time to set some sort of risk percent protocol is based on yourself, what you prefer to risk. That's it. Nothing else. So this next idea of always lock in a profit. The reason why this makes, again, no sense is because if we overemphasize the idea of green being better than red or locking in a profit, what happens? Our average wind size is going to go down. And it's because a lot of trades will have periods where they're losing money before they make money again. So then if you have a trade that's showing a 10 gain and you want to never let anything go from profit to loss so then you take it off when it goes to zero. You have a 0 gain once you include fees. Obviously you lost a little bit of money, but then that trade started to roll back up and actually make money. It doesn't make sense. And if you're doing something like selling premium, this essentially will never, this will never make sense because short options tend to take a bumpy path to profitability. Take some time for them. So it's just another example on why that in a broad sense doesn't really apply holistically. It's just not good advice. And the idea of green being always better than red is pure foolishness",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 42,
      "start_timestamp": "01:09:32",
      "start_timestamp_seconds": 4172.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4172"
    }
  },
  {
    "text": "because short options tend to take a bumpy path to profitability. Take some time for them. So it's just another example on why that in a broad sense doesn't really apply holistically. It's just not good advice. And the idea of green being always better than red is pure foolishness because it focuses on the outcome of individual trades and it does not emphasize the overall profitability of the system, which is extremely important. The overall profitability of the system is way more important than if we're green or red on an individual opportunity. And that's just the reality. So any questions on what we talked about here with respect to creating an X-Strategy for an option straight. The way we create an X-Strategy is very simple. We first design a couple core concepts that apply to literally everything we do. Then we set up a rules-based approach where we might have overarching risk management protocols for the entire portfolio, but each individual strategy needs to have its own defined levels based on what the strategy is. If you're trading something like a zero DTE strategy that has a ton of trades, the expected return formula for that is going to look a lot differently than if you're trading something on a quarterly basis. So it has to be made relative to the strategy. It cannot be these just blank sweep rules. They don't mean anything. There are things that sound smart that are not smart. They're misleading. Joseph says,",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 42,
      "start_timestamp": "01:10:58",
      "start_timestamp_seconds": 4258.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4258"
    }
  },
  {
    "text": "to look a lot differently than if you're trading something on a quarterly basis. So it has to be made relative to the strategy. It cannot be these just blank sweep rules. They don't mean anything. There are things that sound smart that are not smart. They're misleading. Joseph says, one case most ideal and options on a 100,000 account. Again, that's kind of going off what I was just talking about. It's not ideal. What is ideal? Technically, what's ideal can be determined by Kelly Criterion, but realistically, what's ideal is highly relative to the strategy. So if we're trading strategies that are more speculative in nature, then maybe not risking more than one, two, three percent on an individual trade can make sense. It could make complete sense. Or if you're trading a strategy that's typically more profitable in the long run, then one percent might be literally way too tight. Because if you're going to size things off of that, then you're going to either have to put on a ton of different things in order to make money. Or you're going to have to find different names to put on that are not correlated because otherwise you end up putting on the same total risk if you have to find a bunch of trades so that you're not risking more than one percent in any one trade. So this also doesn't account for any sort of correlation risk. So the idea of one percent in, again,",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 42,
      "start_timestamp": "01:12:45",
      "start_timestamp_seconds": 4365.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4365"
    }
  },
  {
    "text": "you end up putting on the same total risk if you have to find a bunch of trades so that you're not risking more than one percent in any one trade. So this also doesn't account for any sort of correlation risk. So the idea of one percent in, again, just like a blanket rule, loses way too much nuance. Yeah. Paulus says, the Stagwit Kelly criteria is that you really don't know the P. Well, you can know the probability. You certainly can. Again, you can look at your historic probability for a strategy. You can either hypothesize what it is. And the thing to remember about the Kelly Criterion and for people that talk bad about it, that they don't understand it is that the Kelly Criterion does exactly what you want, which is optimized for growth. So if you have something that optimizes for growth, what is that tell you? Well, it's going to throw risk management into the wind, meaning it's going to purely optimize for growth. So with Kelly Criterion, what a lot of people do in a practical sense is we use what's called a fractional Kelly sizing. So you can take any fraction of the total Kelly sizing to fit within your risk tolerance. So some people do half Kelly. Some people do quarter Kelly. Whatever that number is, it gives you some like a general starting point. But the whole point of the Kelly Criterion is to optimize for growth. And in",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 42,
      "start_timestamp": "01:14:16",
      "start_timestamp_seconds": 4456.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4456"
    }
  },
  {
    "text": "of the total Kelly sizing to fit within your risk tolerance. So some people do half Kelly. Some people do quarter Kelly. Whatever that number is, it gives you some like a general starting point. But the whole point of the Kelly Criterion is to optimize for growth. And in the pursuit of optimizing for growth, it's absolutely going to push you to some uncomfortable levels. Now, to solve for the probability component, you can either use the probability of options when you're entering the trade or more appropriately, you can use the probability based on drum roll, your fucking trade log. And on your historic interactions with that strategy that you've carefully logged. Policies have you used Kelly for formula for multiple outcomes, of course. So what you're referring to is the difference between discrete and industry Kelly. If you use standard Kelly formula in options markets, it makes literally no sense. Because there's a continuum, you need to use continuous Kelly. If you use discrete Kelly, that's based on binary outcomes that's using the exact wrong tool for the wrong job. That's good for binary outcome propositions. The only way to use Kelly in trading is through a continuous variation of Kelly. If you don't use continuous Kelly, then again, it's just not really not really doing you any good. You're applying a tool that's meant for another kind of system. So yeah. But I mean, for me, I don't use Kelly anyways. There is, and I have",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 42,
      "start_timestamp": "01:15:30",
      "start_timestamp_seconds": 4530.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4530"
    }
  },
  {
    "text": "continuous variation of Kelly. If you don't use continuous Kelly, then again, it's just not really not really doing you any good. You're applying a tool that's meant for another kind of system. So yeah. But I mean, for me, I don't use Kelly anyways. There is, and I have a calculator for Kelly. So I pay attention to it. It's absolutely part of my input. But I wouldn't size something based on Kelly. And the reason why I don't size things based on Kelly is because you have to take the entire portfolio into account. So there's a reality that we need to monitor things like correlation risk, incising risk between some of the different names that we're trading. And Kelly loses that sensitivity. And it's again, just focused on optimal sizing with respect to growth. So it can be a useful tool for sure. And I like Kelly to be clear. Kelly is one of those things that's widely misunderstood by most traders, just because they're used to seeing it in sports betting or gambling binary outcome. Same thing like Martin Gale. Martin Gale gets such a bad rap. Martin Gale can be completely, completely profitable if it's adapted correctly for the circumstance. But most people don't do that. Because they lazy, bro. Most people don't do that because it's not an easy question to answer and you have to do a lot of research. So anything else? Any other questions? Great questions. Great conversation. I really like",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 42,
      "start_timestamp": "01:16:49",
      "start_timestamp_seconds": 4609.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4609"
    }
  },
  {
    "text": "adapted correctly for the circumstance. But most people don't do that. Because they lazy, bro. Most people don't do that because it's not an easy question to answer and you have to do a lot of research. So anything else? Any other questions? Great questions. Great conversation. I really like the topics that you guys brought up. And I hope that the overarching message is at least useful from a skilled dev perspective. The key takeaways here in creating your own approach to creating an exit strategy for all of your options trades is that it should be predefined and it should be within the bounds of your broader risk tolerance. And it should be custom sized to the individual strategies and what the strategies back in. Another reality is if you have a strategy, for example, and by the way, the only reason why I'm still going is because I got to note that my call has canceled. We've been working on a bunch of stuff on one of the properties that I invest in with a few of my friends. And we were working on a bunch of stuff earlier today, but we apparently don't have to have a call now, which is good. But based on the strategies, you need to look at things like the standard deviation and the coefficient variance. And between both of those, they can help you understand how varied your strategy is so that you can come up with better guidelines on",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 42,
      "start_timestamp": "01:18:13",
      "start_timestamp_seconds": 4693.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4693"
    }
  },
  {
    "text": "a call now, which is good. But based on the strategies, you need to look at things like the standard deviation and the coefficient variance. And between both of those, they can help you understand how varied your strategy is so that you can come up with better guidelines on how to manage it. And again, that's also why the nuance of all of this is really, really important. So for those that are in the pro side of things, if you have a strategy that you want us to talk about in the case study tomorrow, in the discord, give me the metrics. I essentially just need the average win, average loss, win rate, loss rate, number of trades. And then I can walk you through how to optimize the exit strategy for that specific strategy. And then we can talk about some of those broader core concepts and developing like a fundamental respect for other portfolio level inputs, like correlation, which is a big thing. If you have a bunch of strategies that are all risk sized at 1 total risk, but you have 30 positions that are the same thing, well, really, you're kind of sitting at 30 risk way more than otherwise you thought you were having simply because it's divvied up between individual positions. So that correlation, relationship is super, super important. All right, looks like we good. All right, everybody, is as always, if there's anything that you need, hit me up. I'm here",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 42,
      "start_timestamp": "01:19:30",
      "start_timestamp_seconds": 4770.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4770"
    }
  },
  {
    "text": "30 risk way more than otherwise you thought you were having simply because it's divvied up between individual positions. So that correlation, relationship is super, super important. All right, looks like we good. All right, everybody, is as always, if there's anything that you need, hit me up. I'm here for you. I hope that the session's useful. If you have questions or if you have follow-ups, feel free to throw it in the discord. Happy to chat with you all and see if we can help get everybody on target. Be in outlier. See you guys later.",
    "metadata": {
      "video_id": "RWkSHmI9QqI",
      "title": "Building an Exit Strategy for Options Trades | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=RWkSHmI9QqI",
      "upload_date": null,
      "duration": 4892.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 42,
      "start_timestamp": "01:20:51",
      "start_timestamp_seconds": 4851.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=RWkSHmI9QqI&t=4851"
    }
  }
]