[
  {
    "text": "I believe we're up and well, sorry about that everybody. I gotta say, the humor in this is so unbelievably massive because right before we started this, I literally, I literally said the dastardly words to Newton. I said, this one should be good. I like, I like went through everything to make sure that this was seamless to get onto. And now this was probably the latest livestream I've ever started. So thanks everybody for hanging in there with us. And Richard, great to see you again. Thanks for hanging out. Likewise, it's always fun to talk. Let me mute this other video here. I'm just pulling up the chat. What's up? What's going on, everybody? It looks like we have the gang in the house. And yeah, sorry about that, everybody. I typically try to make this a little more smooth getting launched, but I, you know, it got me, it got me good. So we know what it is for next time. That's what I'll leave it at. All right, so a couple of things we have to talk about. I figure we can start really quick with any new Pokemon cards that you want to share with us, any new polls that we like. Oh, you know what, I didn't come ready for that, but I, I did get this box here. I'll show you guys. Got a box of Paldae evolves from GameStop. This is it. It looked like emojis. It kind of do. So",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 65,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=0"
    }
  },
  {
    "text": "with us, any new polls that we like. Oh, you know what, I didn't come ready for that, but I, I did get this box here. I'll show you guys. Got a box of Paldae evolves from GameStop. This is it. It looked like emojis. It kind of do. So my idea was, you know, there's no way I'm going to collect all the Pokemon that's literally impossible. That's why I limited it to Pikachu's and EV's. How many are there now? Like a thousand. Oh, yeah. And then, but I wanted to collect a elite trainer box from each box in the current life. Like rotation, which is Scarlet and Violet. So we're working on that kind of fun. Yeah, that's awesome. So when you're opening these with your daughter, does she have a preference for like all graphics, non holographics, like what kind of stuff does she like to see in the cards? I know that you said that you guys both like EV, but is there anything beyond that? She's really looking for like a secret rare, a double secret rare. I don't know all the rarities, you know, but like a V or a V star or something really exciting. So she'll come running up to have we got a good one today because typically the thing is is around six or seven we play and then post playing then we can open one pack. Got it. Okay. So that's like, that's a big event. Yeah.",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 65,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.64615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=98"
    }
  },
  {
    "text": "or something really exciting. So she'll come running up to have we got a good one today because typically the thing is is around six or seven we play and then post playing then we can open one pack. Got it. Okay. So that's like, that's a big event. Yeah. So, you know, sometimes we get a hit. Sometimes you get to Max Payne, you get a charm. You know, that's perfect. Yeah. Well, a little bit of old Max Payne, eh? What did you make of the glorious clothes on Friday? You know, having experiences for so many years, this is why I said the May 3rd cycle was so important. The cycle hit on a Friday that never happens, right? So the the eternity that goes from a Wednesday into a Friday or from even a Thursday into a Friday is enough time for the stock to get back to Max Payne. So I think that's why we saw everything we saw. If you go back to May 3rd, stock ran up like crazy that day on 36 million volume and that was a Friday that never happens. So we saw action happen on a Wednesday and then the duration between Wednesday and Friday all the way back to Max Payne. So yeah. Yeah. Yeah. I got to say, especially for also quick note shout out to Roaring Titty. I think it's like my favorite name that I ever see in the chat. I always look for Roaring",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 65,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.2923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=197"
    }
  },
  {
    "text": "the duration between Wednesday and Friday all the way back to Max Payne. So yeah. Yeah. Yeah. I got to say, especially for also quick note shout out to Roaring Titty. I think it's like my favorite name that I ever see in the chat. I always look for Roaring Titty because what a fantastic handle that is. Yeah. It's the the movement this past week was really interesting and I actually made a standalone video about Max Payne because as you know from our conversations, I approach most things as a skeptic, right? I want to make sure that there's data and I want to make sure that there's some sort of support for the thesis and or especially for what we saw on Friday. That is now there's one specific thing I'm looking for. What I saw on Friday is very interesting to start with in terms of how price moved and where it landed. Very interesting. And when I say interesting, that's me kindly saying I think there was very clear manipulation. That's what I think. It's in a complete opinion. Actually. There we go. I had to go run and go grab my hat. But I definitely think that there was manipulation on Friday. Now that I got the hat on, I can speak plainly. And one of the things that I think about is the overall instances that this occurs into what degree. So I'm in the process of running a study on that now.",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 65,
      "start_timestamp": "00:04:55",
      "start_timestamp_seconds": 295.9384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=295"
    }
  },
  {
    "text": "definitely think that there was manipulation on Friday. Now that I got the hat on, I can speak plainly. And one of the things that I think about is the overall instances that this occurs into what degree. So I'm in the process of running a study on that now. And the video that I shared, it shared a couple of papers that I kind of referenced on stuff like SSRN and whatnot. Bell people become a little more familiar with the topic because it still stands for something like Max Payne. You can't move something super far. It's like the market makers just they don't have that leeway with their book. But something where Max Payne's at 25 and it ends at 24.97. Can they move it three cents? Yeah, bully. Absolutely. You don't believe they can move it three dollars. And it's three dollars. Like if it's at 30 bucks for them to move, it's a 10 move. Now I wouldn't put it outside the realm of possibility. Like especially if it lines up really well. But I also don't personally think it's quite as simple as people maybe think it is because they're fighting order flow. So for example, if Max Payne is down at 25 or whatever and it's up at 30. So them to move it down the, you know, in that case, five bucks. So maybe we'll do 27. In that case for them to move it down three bucks, they need specific market",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 65,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.5846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=394"
    }
  },
  {
    "text": "for example, if Max Payne is down at 25 or whatever and it's up at 30. So them to move it down the, you know, in that case, five bucks. So maybe we'll do 27. In that case for them to move it down three bucks, they need specific market conditions to allow them to be able to do that. Because for example, if there's a lot of people buying options, there's not an opportunity for them to essentially move things south. They would have to be buying shares in order to hedge the positions that are coming in. So it creates a natural conflict for their ability to move price down that far. Now if we're talking about a scenario kind of like this past week where there's broad weakness, there's a lot of selling. The options chains are slowing down a lot towards the end of the week. Could they move it more than three cents? Yeah, I absolutely think so. To what degree can they move it? I genuinely don't know the answer to that. It wouldn't put it, like I wouldn't put it past that 10 move in a lower flow product like this. That's not, that's not crazy. Like if somebody said, I think they moved it three bucks, I wouldn't be like, there's no way, not at all. Now if somebody says, well, we were up at 35 and they put it down to 25, then I would probably say in my opinion, there's",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 65,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.2307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=493"
    }
  },
  {
    "text": "that's not crazy. Like if somebody said, I think they moved it three bucks, I wouldn't be like, there's no way, not at all. Now if somebody says, well, we were up at 35 and they put it down to 25, then I would probably say in my opinion, there's probably more forces at play than just that. Could it still be a contributing factor in that kind of scenario? I think so. But would it be the dominant move for something moving, you know, again, from 35 down to 25, probably not? I agree with what you're saying in a sense because we've seen historical, there'll be days where days or weeks where games stop just tracks the spine, right? The spine moves up on a wave formation, 1, 2, GameStop does 3, 4, 5 in the exact same wave formation or kind of downward as well. So we've long seen that correlation. So with a broad market sell off like we saw over the last three days, GameStop just, like it was interesting though. The first day GameStop didn't move as strongly. I would say as by or the VTI told market index, but then it was day two that like GameStop went down to like 8, broader market sold off and GameStop went down like hard, right? So but I don't know, I'm going to diverge from your opinion though. I'm going to say I think they have much more control over overflow because they can route",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 65,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.8769230769232,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=591"
    }
  },
  {
    "text": "two that like GameStop went down to like 8, broader market sold off and GameStop went down like hard, right? So but I don't know, I'm going to diverge from your opinion though. I'm going to say I think they have much more control over overflow because they can route off exchange, like right away if you're routing any buys off exchange and it's just all downward pressure, then you could sink this thing really fast. It's going to cost them right in the long term. They're going to go to there, they're going to be internalizing and have to buy back later. So could we see upwards move next week, right? From them having to pick up shares, like maybe they paid the piper, they pay the piper next week to save some money on premium this week or make some money on premium I suppose. And then they can use ETFs, right? So I know I think ETFs is huge behind all things. So there was huge creation, a redemption of ETFs going on all week and the last couple weeks. So I feel like that gives them a lot of capacity in the short term, but I'm going to be like the price. Yeah, I agree with you. I think this study is a must read for people on the concept of Max Payne. It specifically looks at stuff like this and to your point, it's funny enough. The exact thing that you're highlighting in terms of",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 65,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.5230769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=690"
    }
  },
  {
    "text": "going to be like the price. Yeah, I agree with you. I think this study is a must read for people on the concept of Max Payne. It specifically looks at stuff like this and to your point, it's funny enough. The exact thing that you're highlighting in terms of the movement the next week, the following week is well documented. So it says we find these returns reverse after the options expiration week. So that's one of the cool things I really love talking about you and with you about. Because you pick up on a lot of these trends and sometimes like, I don't know if you've seen the study. My guess is you might not know. So maybe naively, kind of just and from a single one stock. But from but from your observations, you're picking up like really interesting factors that are absolutely there. So I actually fully agree with that that sentiment. I think the part that we probably just diverge in is likely the impact of incoming order flows impact on the ability to do so. Because even the scenario that you outline there, I actually still fully agree with you, provided that there's not some sort of counter order flow that slows them down. But yeah. Well, I mean, to mention there was huge sell off of calls, right, on especially Wednesday. So if people holding options, I'm assuming I've never done it, but you could tell me, you're probably going to be",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 65,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.1692307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=789"
    }
  },
  {
    "text": "not some sort of counter order flow that slows them down. But yeah. Well, I mean, to mention there was huge sell off of calls, right, on especially Wednesday. So if people holding options, I'm assuming I've never done it, but you could tell me, you're probably going to be monitoring those positions, have stop losses in place. You're going to be really, especially if you're holding into expiry, which I don't think you typically do. So we're going to see big movement on the stock into such a big expiry like this naturally, if things start to sell off. And they did. There was a big sell off on GameStop and Broadway. So for people to not expect the price to go down with these conditions, I think, you know, it's not all manipulation. They're selling going on here. And that curiosity to follow up on your comment regarding the correlation, I grabbed this chart kind of messy, but it lets me look at the correlation of the product across different time frames, just for conversations standpoint. So right now I'm comparing it to the spy. And a three day correlation is like 98 five day, 88 10 day, 56 30 day negative 30 2 and so on. So it's kind of a bit of a shock on blast. The other one I wanted to compare it against that curiosity was IWM. That's a good one. Yeah. And it's definitely more correlated to IWM. I can see that. Definitely.",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 65,
      "start_timestamp": "00:14:47",
      "start_timestamp_seconds": 887.8153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=887"
    }
  },
  {
    "text": "56 30 day negative 30 2 and so on. So it's kind of a bit of a shock on blast. The other one I wanted to compare it against that curiosity was IWM. That's a good one. Yeah. And it's definitely more correlated to IWM. I can see that. Definitely. Yeah, no doubt. It's interesting because GameStop's always had a negative beta. I don't know if you know about that. So it inverts the market pretty consistently, but there's a lot of days where people will be like, yeah, we're just tracking the spy. I don't know if it's interesting. Which is interesting. Does it sell any negative beta? It shows the fast beta to 11, but this is kind of like a moving average on the beta. So this is saying what it's behaving recently. So to your point, that was two years ago to I don't know if it still does on I guess to do like a slower beta longer form. Yeah. The other thing I want to show you this doesn't really show us too much. I'm in the process of building like a broader data set that's looking at the daily percent returns. And I'm taking it, I'm going to take it back the kind of before we had the original squeeze, which is in what 21. And I'm kind of creating a data set that lets me look at when we start to have larger daily returns, what are the corresponding conditions around it",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 65,
      "start_timestamp": "00:16:26",
      "start_timestamp_seconds": 986.4615384615386,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=986"
    }
  },
  {
    "text": "taking it, I'm going to take it back the kind of before we had the original squeeze, which is in what 21. And I'm kind of creating a data set that lets me look at when we start to have larger daily returns, what are the corresponding conditions around it in terms of some other indicators that I tend to look at. But from a statistics perspective, which I'm always happy to share with people because whenever I try to talk to my dog about it, he doesn't listen. And there's massive clustering that happens at periods of times. And that's interesting, the fact that it clusters like this. So this is something that's very much in its infancy, but there are some really interesting trends that I find here, even these random offshoots that are popping up like this. So I don't know if that's something that you've spent a lot of time looking at. I know that a big focus is on like the big moves, obviously. But part of me is curious about the frequency and the severity of like the smaller, quote, unquote, big moves because these are still big moves relative to the periods. Do those are those like part of your tracking process or are you mostly looking for like the really big? Yeah, I was thinking I was trying to think of even a better way to do it because I've got, you know, the gaps are indicated on there. But maybe looking",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 65,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.1076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1085"
    }
  },
  {
    "text": "those are those like part of your tracking process or are you mostly looking for like the really big? Yeah, I was thinking I was trying to think of even a better way to do it because I've got, you know, the gaps are indicated on there. But maybe looking at something like previous day, close to the next day's higher low, something like that because I want to, because you've seen with GameStop, it doesn't weird. I wish I'd after hours extended market highs and lows too, because we've seen now how much it could move in the extended market. But tracking those big moves, like you said, I think could tell you, I don't know, just here, here is where to look. I'm curious, can you pull that chart up again? I just want to look at something really cool. Yeah, I'm actually in the process of downloading the extended hours data for you, because I have it. Oh, that'd be great. Yeah. Yeah, on that chart, it's kind of showing a lot of activity happening. Do you want to pull that other one up again that when you had on hanging? Yeah, sorry. You're good. What the, what was I showing you a different? Oh, the chart. Like a volatility chart, essentially. Yeah. Sorry, because I think some of that's explainable. Yeah, so that's like basically 2009, 2010, right? Is when it's having kind of that blip up there in the middle, it looks like there's a",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 65,
      "start_timestamp": "00:19:43",
      "start_timestamp_seconds": 1183.7538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1183"
    }
  },
  {
    "text": "what was I showing you a different? Oh, the chart. Like a volatility chart, essentially. Yeah. Sorry, because I think some of that's explainable. Yeah, so that's like basically 2009, 2010, right? Is when it's having kind of that blip up there in the middle, it looks like there's a lot more activity in the long-term. Yep. Yep, this section. Yeah, that would have been coming off of the companies doing really well right there. Like real, it's this is post console cycle with the PlayStation 3 and Xbox 360. They were released in 2006 and the company's just kind of going bang gangbusters has its best year in 2010. So it's on like an up run going into that. So coming off of like a pretty decent low. And then so really every console cycle is a big deal for GameStop. So you can see like right in the middle there, like right in the middle there. The next console cycle is 2013. So you're going to probably see some pickup and volatility between 2013 to 2015 as they realize those are next big batch of good years because their cash flow picks up so substantially with the consoles. And then it's just the next console cycle was 2020. So cash flow again picks up again. So it's very cyclical long long. How has it behaved with the console cycles moving forward? Is it still just people are buying it through the store and then and then like they",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 65,
      "start_timestamp": "00:21:22",
      "start_timestamp_seconds": 1282.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1282"
    }
  },
  {
    "text": "And then it's just the next console cycle was 2020. So cash flow again picks up again. So it's very cyclical long long. How has it behaved with the console cycles moving forward? Is it still just people are buying it through the store and then and then like they go pick it up? I'm curious if like what the people just buying consoles directly from wherever the manufacturers and shipping it to them. Is that green them or is it still we're seeing hardware is a growing portion of their cattle or their sales. It's up to 57. Would you guess that? It just keeps going up hardware just keeps going up year after year after year. Let me go back historically so you can see just how low it really was back in the day. And hardware is only 8. Hardware was only 18 back in the day. So even as low as 15. So to go all the way up to 57. There's some of the consoles themselves, but a lot of peripherals. I think there's like peripherals now for consoles in their ever worse. So controllers, sensors, cords, all kinds of stuff. And why what's the like what's the driving function there? Why do people procure it that way as compared to you know just going and grabbing it from Amazon or something else? I don't know. What does chat think about that? I don't own a console. So I can't say, but I mean, they",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 65,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.0461538461539,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1381"
    }
  },
  {
    "text": "like what's the driving function there? Why do people procure it that way as compared to you know just going and grabbing it from Amazon or something else? I don't know. What does chat think about that? I don't own a console. So I can't say, but I mean, they did pick up what was it here? By my trot. No, that was self unrefirmishing trying to figure out what it was that they picked up. But they're a whole thing where they're refurbishing because they do a lot of inhouse refurbishing. Like this mouse I'm using is a refurbished mouse from GameStop. So they never did that in the past. So you can go into GameStop and you can get a lot of stuff. It's like cheap computer peripherals and system peripherals. So I don't know what the draw is to go to GameStop. Maybe it's just close by so people just go, they need a controller. They don't want to wait. Just drive over to GameStop, pick it up. That's sick. I love it. It's way up though. 15 for hardware and accessories. 15 to 57 over a decade is crazy. All sales are way down. Game sales were like 60 and they're down to 27. Interesting. So that was that was where in kiddies, these are number one, by the way, was with the console cycle approaching with what he typically saw in their balance sheets was cash flow positivity for several several years off of the",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 65,
      "start_timestamp": "00:24:39",
      "start_timestamp_seconds": 1479.6923076923078,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1479"
    }
  },
  {
    "text": "were like 60 and they're down to 27. Interesting. So that was that was where in kiddies, these are number one, by the way, was with the console cycle approaching with what he typically saw in their balance sheets was cash flow positivity for several several years off of the console cycle. And then so he was like, yeah, it's in a real low right now. They could pay off all their senior notes right away by getting all this cash from selling all this hardware, which is exactly what they did. They repaid all the senior notes through the end of 2020 and early 21 really helped out their balance sheet. The share offerings obviously helped a lot too. So we've got another console cycle coming up here in probably, I think the next Nintendo Switch is coming out next year. And then follow. Are those like big releases? And Nintendo Switch, so the Wii was not that great, Wii U was not that great, but the Switch did really well for, I'd say for everybody, especially the game stuff, but because Nintendo is big on physical game sales as opposed to the other ones, they do digital downloads too. But I think the Switch was just a long lasting, very successful system. I think Switch 2 is going to be highly anticipated. The Wii U flopped because I think the name wasn't well understood, but it was a whole successor system. So people will be like, I love",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 65,
      "start_timestamp": "00:26:18",
      "start_timestamp_seconds": 1578.3384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1578"
    }
  },
  {
    "text": "too. But I think the Switch was just a long lasting, very successful system. I think Switch 2 is going to be highly anticipated. The Wii U flopped because I think the name wasn't well understood, but it was a whole successor system. So people will be like, I love my Switch, I want the Switch 2, I think it could do really well. And it's coming mid phase. So rather than syncing up with the other side with the other consoles, the other consoles will be a while. So I think it could be a big release, honestly. And then the next PlayStation and Xbox will probably be 2027. So we're two or three years out, which is kind of like exactly where, roaring kitty bot in like 18 months out from the console cycles. So we're early compared to when he bought in. Got it. So something to think about though, with three upcoming over the next couple of years here, consoles, that's the cash flow for game stop. Got it. And there's a question from Reese and the chat. You're saying, do you think our case shares have been delivered yet? I think that they've been delivered by the market maker through ETFs. I think now the authorized participants are in a period where they're going to create some units of whatever their ETF is, I WM, you mentioned, maybe VTI. And they're going to look for an opportunity to pick up some shares. I think we",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 65,
      "start_timestamp": "00:27:56",
      "start_timestamp_seconds": 1676.9846153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1676"
    }
  },
  {
    "text": "by the market maker through ETFs. I think now the authorized participants are in a period where they're going to create some units of whatever their ETF is, I WM, you mentioned, maybe VTI. And they're going to look for an opportunity to pick up some shares. I think we might have seen a bit of that over the last, with those sandworm kind of lips. Yeah. Coming in early in the morning, but I think that they're going to run up against the time crunch. I think they do have a time limit on when the farthest they can push it out to it. So I think it's in a settlement cycle right now. It's just longer than people think because as soon as one participant passes it to another, they get a little bit more time. Got it. I think they could even push it again too. Like if they go out and put, if APs go up in large demand, buy orders on the market, other APs could swoop it up, take that order and then shuffle it into another creation cycle on another batch of ETFs. I think we've seen that with SRT where it bounces from XRT over to IWM, back to XRT. So I think a shuffling of this size of position could take a while to settle out. Got it. That makes sense. I wanted to pivot to another question that I had for you. As you know, a big part of what",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 65,
      "start_timestamp": "00:29:35",
      "start_timestamp_seconds": 1775.6307692307694,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1775"
    }
  },
  {
    "text": "from XRT over to IWM, back to XRT. So I think a shuffling of this size of position could take a while to settle out. Got it. That makes sense. I wanted to pivot to another question that I had for you. As you know, a big part of what I'm trying to do here is learn. I'm trying to learn more about the context. I'm trying to learn more about the company, the story and the community. And you're kind of like, I view you as like the historian. You're kind of like, who are the, I feel like there was a, there's an actual AP historian just so you know, so I want to take his title. Oh, sorry, sorry, sorry. Maybe like a scribe then. Would that be a fair? There we go. The spread cheater is a game stop spread cheater. Yeah. Okay. So yeah, it's kind of like a scribe function. It reminds me of like the, the priests way back in the day that used to like transcribe things. And then my descendants, mostly the Vikings would like come and you know, just pillage everything. That's, you know, I hope, I hope to redeem us. I hope to have a different interaction here. So with that though, I've been seeing a lot of people having, thank you very much. Got a, ultra water reload man. You know how to, got us to hydrate it. It's funny too, because this is like, this is the",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 65,
      "start_timestamp": "00:31:14",
      "start_timestamp_seconds": 1874.2769230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1874"
    }
  },
  {
    "text": "us. I hope to have a different interaction here. So with that though, I've been seeing a lot of people having, thank you very much. Got a, ultra water reload man. You know how to, got us to hydrate it. It's funny too, because this is like, this is the time of day that I consume the most food and liquid. So yeah, it goes like that. But I see a lot of people talking about Moas, right? Obviously, that's the, that's the big thing is Moas and where is it going? And like I try to understand how people think about it and how people frame it. Because for me, like, my, I'm a trader. My job is to try and identify perspective moves and then to trade them as best as I possibly can. And I've used recent examples, even of some of the things I've been doing in GameStop, specifically with respect to like this recent price movement. I know for a lot of people, this has been like broadly unexciting. But for somebody like me, I'm looking at something that's moved 20. And that's a move that I played. I actually flattened a lot of my options here on the 17th. I still have the shares and I've already kind of told people my, my, the, I call them participation shares. I think I've told you this before. I have like a position on also in AMC. It's not that I know anything about it. It's",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 65,
      "start_timestamp": "00:32:52",
      "start_timestamp_seconds": 1972.9230769230771,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=1972"
    }
  },
  {
    "text": "options here on the 17th. I still have the shares and I've already kind of told people my, my, the, I call them participation shares. I think I've told you this before. I have like a position on also in AMC. It's not that I know anything about it. It's because I made a bet with somebody on a live stream like two years ago that I would just always hold the position. So now I'm literally going to have AMC in my portfolio until I die. And it's kind of like what I'm doing with, with GameStop, at least part of the shares is it's just to be involved and try to show some solidarity for the movement. But anyways, the options is completely different. I'm trading in and out of these things. I'm trying to make money here. So going all the way back to the MoAS concept, where do people come up with their ideas of like what that number is? And how do people expect to behave around it? Because there's a lot of people that go through like these really big rides and then they come back down, go through another ride, come back down, that kind of thing. Right. I would say maybe one of the biggest things that sticks out in people's mind is probably Thomas Petr-Fees interview when he was on CNBC, I believe. And he talked about what happened with GameStop. And I'm sure you've watched that clip. And he's basically",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 65,
      "start_timestamp": "00:34:31",
      "start_timestamp_seconds": 2071.5692307692307,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2071"
    }
  },
  {
    "text": "that kind of thing. Right. I would say maybe one of the biggest things that sticks out in people's mind is probably Thomas Petr-Fees interview when he was on CNBC, I believe. And he talked about what happened with GameStop. And I'm sure you've watched that clip. And he's basically saying there were more calls in the money that existed in the outstanding of GameStop and had those been exercised and demand for shares that actually come in. The market makers would have had to deliver those shares by the nature of the rules. And would have broke the whole system because the market makers would have pushed that to the clearing corporation, the clearing corporation would have not been able to handle that trade. And basically everyone's margin accounts would have been blown up. Everything would have been liquidated. And it's right there you go. And yes, and it would have collapsed the whole system because they're, you know, just the system was not designed for this kind of a trade imbalance essentially to occur. And what was the VIX at back then? The VIX went crazy. Brought our market really was shaky. I remember like kind of everything was was dipping. The theory was lots of collateral was being sold off. So when was 2021? Here. Yeah, so big move on the VIX. I think the overall indices kind of kind of tumbled a bit. And then this the events happened in March, right? Where we saw a",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 65,
      "start_timestamp": "00:36:10",
      "start_timestamp_seconds": 2170.2153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2170"
    }
  },
  {
    "text": "was was dipping. The theory was lots of collateral was being sold off. So when was 2021? Here. Yeah, so big move on the VIX. I think the overall indices kind of kind of tumbled a bit. And then this the events happened in March, right? Where we saw a game stop shoot up to 350 looked crazy as it did. It was doing that fluttering thing that we talked about where it's just running like crazy when well beyond gamma maximum, right? Entire change in the money again. And everyone's like something's going on here. And I think that they're they're just like the story to them is incomplete because the buy button got turned off. They basically see all of this is like it was basically put on hold. So they could figure out how to handle this trade. And it's been kind of all kicked into derivatives. And you know, if the theory is true, credit swiss collapse because of this trade. And UBS is attempting now to continue to manage it. Then they're like, well, what happens if UBS blows up? Right? What if they can't contain the trade then who's who's next up above that? And it would be the Swiss central bank, right? And then the European central bank and then the DTC and the the Fed, right? I think what people got to understand is each of those is a much bigger enemy with a lot more capacity to manage a trade of",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 65,
      "start_timestamp": "00:37:48",
      "start_timestamp_seconds": 2268.8615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2268"
    }
  },
  {
    "text": "And it would be the Swiss central bank, right? And then the European central bank and then the DTC and the the Fed, right? I think what people got to understand is each of those is a much bigger enemy with a lot more capacity to manage a trade of the size. Deep way deeper, Martin, margin, counts and facilities and the rules have changed. There's been a lot of rule making to go on to. I'm not anti MOS. I just don't know how much liquidity can come through the system. And I know that they don't like to lose, you know? So I don't know, they kicked the can hard here for a year and a half and then suddenly the can is shown up again really strongly. And so, you know, they're not, they're not impervious and the position can be held forever. So I think that's the history behind the MOS sentiment. Does that does that kind of make sense? I don't know, people agree. It does to a degree. So the other thing while I would say is from the chat perspective, what do you guys think? And then I got to let my pup in real fast. He does this thing where he literally just sits at the door and scratches it. One thing at a time, super cadence, slow, but just one at a time. Very patient. Yeah. And now he's happy. Oh, there he is. He's down to be, he's down to",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 65,
      "start_timestamp": "00:39:27",
      "start_timestamp_seconds": 2367.5076923076927,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2367"
    }
  },
  {
    "text": "in real fast. He does this thing where he literally just sits at the door and scratches it. One thing at a time, super cadence, slow, but just one at a time. Very patient. Yeah. And now he's happy. Oh, there he is. He's down to be, he's down to be with the boys and girls talking about some game stop. He's like a big champion. He is a mohawk. Like it alone. And I think I think a big part of it is going to be whatever people are in it for and what they want out of it. So for some people, Thomas Petrified was going into the thousands, right? So they're waiting for that four digit number, like you can kind of see. Now, that's free, free ATM, right? Yeah. It would have been in today's dollars after a four to one split and some offerings, you know, like two, three hundred dollars a share would make it two a thousand free split. Got it. So we were on our way. I mean, it went to eight, like in what, three days in early May, mid May, 80s, almost there. Right. So, and I think a lot of people are basing about Volkswagen too. So Volkswagen became the highest market cap company briefly in the world in 2008 when Porsche did like essentially like a hostile takeover via options actually is super interesting options and shares and ended up controlling most of the company in shorts brand",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 65,
      "start_timestamp": "00:41:06",
      "start_timestamp_seconds": 2466.153846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2466"
    }
  },
  {
    "text": "of people are basing about Volkswagen too. So Volkswagen became the highest market cap company briefly in the world in 2008 when Porsche did like essentially like a hostile takeover via options actually is super interesting options and shares and ended up controlling most of the company in shorts brand for the X. It's the, both a Porsche leadership actually made a deal with the shorts. I don't know if you know the history on all this. Like basically made a deal, Porsche made all like bandits on the whole thing, but it went up into the thousands. So I think people are basing it off of, you know, a combination of expectations from 2021, seeing previous squeezes and what they can do. And then kind of frustration too. I think a lot of it is like they deserve to pay. They cheated. You know. So, looking at it realistically in 21, they turned off the buy button because they said, this is going to destroy potentially a significant part of the financial system. So where would they let it go before that kind of thing happen again? Would you guess? Because to me, it seems like the probability of it getting up to a thousand based on what happened previously is low based on what they've done. Yeah. So that's why I think they, they short up the rules so that all the market participants have to have much more margin. So that's, that's one right. So it can",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 65,
      "start_timestamp": "00:42:44",
      "start_timestamp_seconds": 2564.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2564"
    }
  },
  {
    "text": "it getting up to a thousand based on what happened previously is low based on what they've done. Yeah. So that's why I think they, they short up the rules so that all the market participants have to have much more margin. So that's, that's one right. So it can actually go higher now with the system because people have the capacity to pay. I think we've seen that over the last couple of weeks and months is it goes up to 80. The VIX didn't really seem to respond. I was surprised by that. Went up to 47 again and then 67. And overall, the other market, aside from the basket moving, right? We saw cost move. We saw chewy and AMC move. That behavior still happens. But the broader market, well, Berkshire did its Berkshire. You know, Berkshire had its weird glitch. Glitched out, fell down to 185 and bounced up to almost 800,000. And then I don't know if you know the volume on Berkshire has been weird ever since. Artegos collapsed. So Artegos collapsed. Berkshire A volume went really crazy and it's been crazy ever since roaring kiddie's live stream. And then the Berkshire went back down. So outside of those anomalous things, the broader market doesn't seem to care about GameStop as much anymore and have as much turbulence. So maybe they're rule making and their expectations on participants that are involved in GameStop has insulated maybe the NSCC and the bigger part of the",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 65,
      "start_timestamp": "00:44:23",
      "start_timestamp_seconds": 2663.446153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2663"
    }
  },
  {
    "text": "down. So outside of those anomalous things, the broader market doesn't seem to care about GameStop as much anymore and have as much turbulence. So maybe they're rule making and their expectations on participants that are involved in GameStop has insulated maybe the NSCC and the bigger part of the system from the troubles that some of their subsidiaries are having. That's kind of what I imagine. And maybe they needed time to allow those people to build up a cushion to handle a trade coming in. That's actually pretty cool though with some of the changes in the policy that essentially it allows them to experience more pain as they should. That's one of the fun part about this whole thing that we were talking about is it's kind of really nice to have a just really, really easy to hate common enemy. It's always fun to have that. And I think that this is a pretty good example of that. So that's really helpful and it makes a lot of sense to me to be honest now hearing that context. So thank you very much for explaining some of that because one of the things that I've thought about before is like I see people throw numbers out like GameStop to 10,000. And I think it, it's just like, man, it just feels like the probability of that happening in a way that somebody could capture profit on that would be low. But I understand at least better",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 65,
      "start_timestamp": "00:46:02",
      "start_timestamp_seconds": 2762.0923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2762"
    }
  },
  {
    "text": "about before is like I see people throw numbers out like GameStop to 10,000. And I think it, it's just like, man, it just feels like the probability of that happening in a way that somebody could capture profit on that would be low. But I understand at least better now how people might be thinking about it. So thank you. No problem. And something to think about my brother has this concept of like relative market cap. So what's the market cap of the biggest company right now in the world? It's like Nvidia or I think it is. So one of those two are Saudi or Amco. Right. So it's like three, it's like 3.5 trillion, right? I think that they're like at four. Let me see. I'm curious. So remember that. Yeah. Yeah. So when GameStop started three years ago, it was like 1.5 or two. So these companies are growing and getting huge. So let's say it's 3.5 trillion, right? Divide that out by a GameStop's outstanding shares. If GameStop were to become the biggest company by market cap briefly in the market like Volkswagen did with a squeeze, you're looking at 8,000 a share, 8,215 a share. So that would be like the brief peak, right? Where those top trades would come in because the idea is again, going to the petrophy, when the computer systems take over and they say these positions must be closed. Like we see with that fluttering that happens in",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 65,
      "start_timestamp": "00:47:40",
      "start_timestamp_seconds": 2860.7384615384617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2860"
    }
  },
  {
    "text": "a share. So that would be like the brief peak, right? Where those top trades would come in because the idea is again, going to the petrophy, when the computer systems take over and they say these positions must be closed. Like we see with that fluttering that happens in the pre-market of 80, it's completely price insensitive. It's just buying because the accounts been liquidated. So it's not to say that 3.5 trillion is going to change hands. It's just that if the shorts must be purchased, it's going to pay what they're going to pay. So I think that's why people are saying maybe the 8 to 10,000 range. I see. Could be a peak. It couldn't sustain, right? It would immediately get hit with not just, I think people need to understand too. It wouldn't just get hit with people selling and out of their accounts. It would get hit with short selling like crazy. People are going to enter puts, shorts, everything's going to pile in. And that's something that people maybe need to think about now. Going to Wednesday, right? Imagine a lot of short interest probably piled in on GameStop. Puts and shorts hitting it hard at 29 when they saw it start to falter and waver. And then they just, now they made a quick 16 on the trade trading it to the downside. So it doesn't have to be people paper handing or selling. It could just be a big sell action.",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 65,
      "start_timestamp": "00:49:19",
      "start_timestamp_seconds": 2959.3846153846157,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=2959"
    }
  },
  {
    "text": "it hard at 29 when they saw it start to falter and waver. And then they just, now they made a quick 16 on the trade trading it to the downside. So it doesn't have to be people paper handing or selling. It could just be a big sell action. Right. And then they're going to trade in both sides. Yeah. One of the other questions that I saw come through. I think this is from someone, Esoteric was their name. And they're saying, do you think that Rory and Kitty is potentially trying to build like essentially a case like evidence that there's some sort of corruption or collusion going on in the back end? Do you think he's working that angle at all? Or do you think he's kind of just focusing on trading what he can see? I think that, I mean, he was put under incredible scrutiny for a household trader granted. He was YouTube and he was meaming. He was doing a lot. I mean, he really was. He had a Reddit account, YouTube account, Twitter account. He was sitting there from three angles, making the best trades ever and doing entertaining content. But to drag him into Congress and blame him when his YouTube channel, his live streams have less people on them. We have on now, right? Which is his early ones were pretty light. Also shout out to you guys, by the way. And so, you know, he got investigated and his",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 65,
      "start_timestamp": "00:50:58",
      "start_timestamp_seconds": 3058.0307692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3058"
    }
  },
  {
    "text": "drag him into Congress and blame him when his YouTube channel, his live streams have less people on them. We have on now, right? Which is his early ones were pretty light. Also shout out to you guys, by the way. And so, you know, he got investigated and his previous employer got fine, right? Mass mutual. And I think if he's building a case, I don't know that the case is about market manipulation in games, not specifically, but definitely about protecting his self himself, right? Which is he revealed his position and then just held it through crazy volatility could have been worth 900 million, did a live stream stock on hammered off of his live stream. He's proving that everything he's doing affects the stock negatively. You know, he's not doing a pump and dump. And in fact, I would, you know, if throughout it, he just keeps increasing his share count. He's not dumping on anybody. So I would say, I don't know that he's building a case to go after manipulation. The SEC and FINRA and so forth have got to do something though, because it just seems like there's too much going on here. It's going to be natural. I mean, it's even getting the attention of people like John Stewart. I think he did like a piece on it. I think he's doing another one. Is it any or something like that? He definitely did one or two. I think he might be",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 65,
      "start_timestamp": "00:52:36",
      "start_timestamp_seconds": 3156.6769230769232,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3156"
    }
  },
  {
    "text": "It's going to be natural. I mean, it's even getting the attention of people like John Stewart. I think he did like a piece on it. I think he's doing another one. Is it any or something like that? He definitely did one or two. I think he might be doing a follow up. Yeah. I think the video basically touching on what I think are the key points. I think he should. That's right. You're the one that's I forgot. I forgot anything that I know about GameStop. I probably learned from you. I was trying to think I was like, where the hell did I hear this from? But that must have been it. But that's the other things I feel like as it gets enough attention for stuff like that, part of me again, going super tinfoil hat, it does make me curious though when I see, for example, in Congress right now, they're just getting to the point where they're, oh, it's all crooked. Look like I'm like ridiculous. They're just now getting to the point where they're trying to move a bill that stops them from trading individual stocks. It's like the most common sense shit on earth and that still hasn't been passed. Almost like the daylight savings thing, like stuff that's almost universally accepted by the people it's not moving through. So it does make me curious if there are some other incentives that we may or may not be aware of that",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 65,
      "start_timestamp": "00:54:15",
      "start_timestamp_seconds": 3255.3230769230768,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3255"
    }
  },
  {
    "text": "shit on earth and that still hasn't been passed. Almost like the daylight savings thing, like stuff that's almost universally accepted by the people it's not moving through. So it does make me curious if there are some other incentives that we may or may not be aware of that lead to this being slow rolled so heavily. Have you come across anything like that in your research? Well, I think your question that you're asking me, I just want to make sure you're clear on it is like, would there be a reason for this to be taking as long as it is? Because basically there's this steady buildup of attention on it by the public, by John Stewart. People keep contacting their representatives, contacting computer share, the company could be pursuing litigation in the background. We don't know. And I think that short selling in general is getting a lot of attention. I think that could be the case. I don't know. Congress seems to move quickly sometimes. Like they moved very quickly in 2021. That very much surprised me. I've said that a lot because they don't move quickly on anything to get ahead of the story, kind of shut it down, get it off the public radar. But then here we are. It's happening again. So I don't know. I'm never very optimistic about politics because like you said, it's such a common sense thing to do is political representatives that have access to committee information,",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 65,
      "start_timestamp": "00:55:53",
      "start_timestamp_seconds": 3353.9692307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3353"
    }
  },
  {
    "text": "kind of shut it down, get it off the public radar. But then here we are. It's happening again. So I don't know. I'm never very optimistic about politics because like you said, it's such a common sense thing to do is political representatives that have access to committee information, which is going to be incredibly impactful. Like think about like, for example, just a really easy one, like solar policy, right? How much that could move markets in the solar industry in just a whim or anything dealing with like automobile manufacturing or I don't know, chip, anything to do with chips, right? Or healthcare or anything like that. You have the access or energy policy. Anything going on in those committees is going to move markets. And the fact that they don't have trading restrictions put on them is just completely absurd. So because they're all becoming millionaires. The number of millionaires in Congress on both sides of the aisle is way over the per capita number of percent of millionaires in the background in America. And that's troubling, right? It's just, I mean, I say this to my friends all the time, it's just like what happened in Rome, right? So in Rome, the senators all became these oligarchs, incredibly powerful families. They were all extraordinarily wealthy, legacy families. And I don't want to see that happen to the United States of America. So we got to put restrictions on them. I couldn't agree with you more",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 65,
      "start_timestamp": "00:57:32",
      "start_timestamp_seconds": 3452.6153846153843,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3452"
    }
  },
  {
    "text": "in Rome, right? So in Rome, the senators all became these oligarchs, incredibly powerful families. They were all extraordinarily wealthy, legacy families. And I don't want to see that happen to the United States of America. So we got to put restrictions on them. I couldn't agree with you more than that. Oh, we got somebody that chatted in. I'd rather be seeing what a great name. They're happy with the tin fall hat. I'm glad. Yeah, I feel like I can't see it. But there's actually pebbles in it too that make like the little thing around the crown. So, you know, I would never equate myself to Jesus. The whole crown of thorns doesn't seem come, but this is not super comfortable either. So, but I have to give myself a shout out because this doesn't breathe at all. I mean, at least for the thorns, you get to vent, right? It vents the atmosphere a little bit. Get a little bit of a break out here. Thank you very much. I'd rather be skiing. But to pivot to a couple other questions, I noticed that the community seems to really set itself up for a miserable experience because there's a lot of people that look at, you know, these dates, right? There's the Bloomberg terminal guy. He talked a little bit about that. That stuff. From a trading perspective, I know that that's honestly silly. Like there's nothing that you can see on a Bloomberg terminal that",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 65,
      "start_timestamp": "00:59:11",
      "start_timestamp_seconds": 3551.2615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3551"
    }
  },
  {
    "text": "because there's a lot of people that look at, you know, these dates, right? There's the Bloomberg terminal guy. He talked a little bit about that. That stuff. From a trading perspective, I know that that's honestly silly. Like there's nothing that you can see on a Bloomberg terminal that is magical. That's not already disseminated into the market. So they were apparently looking at swap data and maybe misinterpreting the swap data because as you know, from data, the trade's going to come in and then that swap can be modified repeatedly. Right. So, that's the reason why I haven't dug into the swap data. It's just painful. It's thousands of entries. And there's, it's like the same traits. Modified, modified, modified. So getting any eyes on what, when those are due, and then it could come to due date and they could, they could probably roll it or do whatever with it. So it's like, you don't even know what the impact is going to have on the stock either. That's interesting though. If that's like a manpower issue, you and I can talk about that because if, if you think that there's something interesting in there, I think there's a few things we could do to make it a little more digestible to speaking of breathable top, to make it more digestible to get through. But yeah, I agree. Well, the other problem with swap data too is that you can always make new ones. Like as",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 65,
      "start_timestamp": "01:00:49",
      "start_timestamp_seconds": 3649.9076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3649"
    }
  },
  {
    "text": "think there's a few things we could do to make it a little more digestible to speaking of breathable top, to make it more digestible to get through. But yeah, I agree. Well, the other problem with swap data too is that you can always make new ones. Like as long as you have somebody that's willing to be a counterparty, you can only have since 24 hours a day to that market and never sleeps. So we don't know and it's a little bit vague too in the data on what the position actually may entail. It could be a swap that's not, it could not be a total return swap. It could be a basket. It could be a volatility swap. So they're just betting on it, staying in a channel, breaking out of a channel, moving up to some degree, down to some degree. It's just an enormous data set to dig into. It's seen sort of like, I don't want to say a fool's errand, but just beyond my powers, for sure. But I think there's people digging and I would just encourage them to dig and maybe they could use tools to get more insight on it. I think the ETF flows are much more easy to digest at the moment. So that's what I've been kind of digging into. Got it. Yeah, I think that makes a lot of sense. But going back to the origin of that thought is what did you make",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 65,
      "start_timestamp": "01:02:28",
      "start_timestamp_seconds": 3748.5538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3748"
    }
  },
  {
    "text": "on it. I think the ETF flows are much more easy to digest at the moment. So that's what I've been kind of digging into. Got it. Yeah, I think that makes a lot of sense. But going back to the origin of that thought is what did you make of the upacts the past week? Well, I thought something you said was really interesting was you said the community sets itself for this date, hope, you know, this is a three year story though. We've been hyping dates forever and people get mad and then they want more dates. And then so people start suggesting possible dates. And but that date actually did some stuff. Like you said, the price moved up to Wednesday, the date for unknown reasons, hit a high of 29, 90 or whatever. That's a 20 mover, whatever in two weeks. That's a good date. I would actually say it didn't move to whatever price target they had said, but they were probably one of the better trust me bros we've had in recent times. So but as far as the up X goes, then you know, hit that relative peak on the day. And we saw the whole I mean, the whole market sold so much, right? So how are you going to fight that and keep moving upwards without some kind of like big, big event happened. And right. And I wasn't really looking for something big. So I think it's a perfectly",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 65,
      "start_timestamp": "01:04:07",
      "start_timestamp_seconds": 3847.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3847"
    }
  },
  {
    "text": "we saw the whole I mean, the whole market sold so much, right? So how are you going to fight that and keep moving upwards without some kind of like big, big event happened. And right. And I wasn't really looking for something big. So I think it's a perfectly fine move for unknown variables. We don't know what drove it, maybe settlement, maybe T plus 35, maybe something to do with a mid month swap. I can't worry. It could be, I mean, options could have just like charged it up. And then people took profits and then it just ran it down with the whole market. And so, you know, I just feel like it's kind of like whatever blip on the radar, keep looking forward. Fundamentally has the has the circumstances with game stop changed 16 in three days. That's what I always ask myself. No, like nothing's changed in a month. Like company has, you know, 4.2 billion in cash, no debt, blah, blah, blah. You know, company hasn't changed in all this time, but the stock moves around like crazy. So you got to kind of take it for what it is. Got it. I would say to something that we talked about before this was, you know, Moas is a topic of interest, you know, like how big could it be? People always ask me like, what do you think it's going to go up to or turn? It's like, I really don't know.",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 65,
      "start_timestamp": "01:05:45",
      "start_timestamp_seconds": 3945.8461538461543,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=3945"
    }
  },
  {
    "text": "would say to something that we talked about before this was, you know, Moas is a topic of interest, you know, like how big could it be? People always ask me like, what do you think it's going to go up to or turn? It's like, I really don't know. There's so many, it's a confluence of variables and time whites, right? If all of a sudden the company comes out and announces like some kind of crazy partnership with Nintendo where you can only get the switch to through game stop, that's going to have enormous impact in the short term on the stock, right? Would that cause Moas? Who knows? Would some big player finally decide, you know what? We're just buying all the game step we can right now. We're down 30 million shares. Get a buy order for 30 million shares. That's going to cause a lot of activity on the stock. I don't know. It's someone else then does someone else come in and say, well, we're willing to take the other side of that trade and keep going negative on game stop. So it's like we never know with all the different forces of work when it's going to happen, how big it could be or what the top one is. But on these little cycles, I think that they're fun to try to figure out because to me, it's just a puzzle. Right. And I think that's the same how your mind goes",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 65,
      "start_timestamp": "01:07:24",
      "start_timestamp_seconds": 4044.4923076923073,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4044"
    }
  },
  {
    "text": "work when it's going to happen, how big it could be or what the top one is. But on these little cycles, I think that they're fun to try to figure out because to me, it's just a puzzle. Right. And I think that's the same how your mind goes to it as well. We saw a big 30 midweek, like why, you know, and then do we see something on August day? If so, that's amazing, right? If not, why? You know, and we're just, I'm just trying to approach the scientifically. I say repeatedly not trying to get people excited, but deep, high p.m. can be frustrating for sure. Yeah. Yeah. It's, well, and it also looks like there's a lot of people trying to take a stab at it, right? Because everybody wants to be the one that cracks the puzzle. So it seems like that creates a cycle of people kind of throwing stuff and seeing what sticks. Now. Now that you have to bounce out of here in a few minutes, I thought that maybe we could spend the last couple minutes talking about exactly to your segue, actually, like forward looking. So based on what you're seeing now, what's interesting to you, what are you looking at? And then I thought I can run through the options chain at some point during it because there's some interesting stuff going on there. But I want to hear what you're seeing. Yeah. So I'll share my",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 65,
      "start_timestamp": "01:09:03",
      "start_timestamp_seconds": 4143.138461538461,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4143"
    }
  },
  {
    "text": "what you're seeing now, what's interesting to you, what are you looking at? And then I thought I can run through the options chain at some point during it because there's some interesting stuff going on there. But I want to hear what you're seeing. Yeah. So I'll share my screen with you. I can't prepare this time. That's good. So it's honestly, our faces have been centered on this too long anyways. Don't like that. We don't. Can you see? She'll. Sure can. All right. Cool. So what I'm really looking forward to is June option settlement was right here on the 21st. And it was a big one because not only is it a monthly standard option settlement, right? But Roar and Kitty had purchased his 20s for that date. And it just created a ton of interest, more interest on GameStop in terms of options than we've seen in years. So and we did see the characteristic ETA fails to deliver around that time period. That you want to see if you're hoping for a cycle to follow like the cycle that we saw on June 6, just two weeks prior. In case you didn't know, the chat is enamored by your crosshair. This day. Yes, they appreciate both its size and its girth. So so we had big options, quarterly settlement. And this is also going to because this is a quarterly, this means that there was huge creation redemption. This is obvious in the flow",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 65,
      "start_timestamp": "01:10:41",
      "start_timestamp_seconds": 4241.784615384615,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4241"
    }
  },
  {
    "text": "chat is enamored by your crosshair. This day. Yes, they appreciate both its size and its girth. So so we had big options, quarterly settlement. And this is also going to because this is a quarterly, this means that there was huge creation redemption. This is obvious in the flow on ETFs on that same period, not related to GameStop, but just related to ETFs probably washing capital gains. So huge settlement activity on GameStop and other stocks from the 21st. So if you go six trading days forward, that would take you to July 1st. So conceivably what happened was a market maker went to an authorized participant and said on July 1st or somewhere around here, hey, we need a lot of GameStop. They then failed the creation of a whole bunch of units of either XRT or other ETFs. And then now they've got 35 days to settle. So that'll lead us into August. So I've got the 35 days indicated there on red. Those are calendar days. And then the trading day happens because they go out and they're going to go buy those shares. And then so that's what leads me to August 8th. So people might be like, what, how does that work? But we can look back. Historically, I'll give one other example. April 19th was again a monthly option settlement. So big activity on the ETFs, big fails to deliver on GameStop. You go out six trading days and you go out",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 65,
      "start_timestamp": "01:12:20",
      "start_timestamp_seconds": 4340.430769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4340"
    }
  },
  {
    "text": "people might be like, what, how does that work? But we can look back. Historically, I'll give one other example. April 19th was again a monthly option settlement. So big activity on the ETFs, big fails to deliver on GameStop. You go out six trading days and you go out 35 trading days. I don't think I've counted. There's one. Here's 32. We need 33, 34, 35. And you go to the three more settlement days. Boom. Here's our infamous day June 6th that I was personally looking forward to because we hadn't had one of these ETF settlement cycles in a long time. But we did see one on May 3rd, which came off of March options in the same exact way back here. So we've now seen two of them. We saw March, the May, we saw April, we just we did June. Will we see June, we do August? So that's what I'm that's what I'm looking at. And based on what you're seeing like the breadth of evidence, what do you think? Well, we saw the ETF fails happen here on the 21st as you would expect, especially XRT. We saw the creation or redemption activity go on. So especially because it's a quarterly, like I said, every quarter they wash their capital gains. I'm now looking at that very closely. And August, August is pretty consistent. So June usually hits like 67 of the time. July like never hits. But August hits pretty often like",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 65,
      "start_timestamp": "01:13:59",
      "start_timestamp_seconds": 4439.076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4439"
    }
  },
  {
    "text": "go on. So especially because it's a quarterly, like I said, every quarter they wash their capital gains. I'm now looking at that very closely. And August, August is pretty consistent. So June usually hits like 67 of the time. July like never hits. But August hits pretty often like 50 of the time. So, you know, could be could be people will remember in 2022 August 8th was when GameStop and BBBY ultimate to like 50 bucks or GameStop into 50. I forget what BBBY went up to, but they ran in tandem because they were in the basket together. The basket tends to move in correspondence on these events. So you could just look back at the basket, but basket. So we had a drought of these for a year, for a year, somehow they were able to defer. And like after UBS took over credit Swiss, we didn't see any of this stuff happen since June of 2023. And now we've had May and June and just feels like a season for ETF settlement to me. I don't know. So that's, that's what I'm really helpful for. We didn't get our July. Well, we'd say we saw something happen here, right? Little baby cycle. Now, yeah, that's actually another question I had for you is how would you classify the move? What happened on July. Yeah, because I know that that's that's part of your tracking is to kind of. There were some. There were some things",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 65,
      "start_timestamp": "01:15:37",
      "start_timestamp_seconds": 4537.723076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4537"
    }
  },
  {
    "text": "something happen here, right? Little baby cycle. Now, yeah, that's actually another question I had for you is how would you classify the move? What happened on July. Yeah, because I know that that's that's part of your tracking is to kind of. There were some. There were some things that tell me it was a force settlement event because. The biggest part of the move was in the pre market. It went up to 29, 98 or whatever in the pre market. I was doing that fluttering characteristic like forced buying kind of like. I mean, it was balanced on like a lot like 50 cents at a time. Boom, boom, boom, boom. It was like it didn't care. It just needed the shares. So this tells me that like some number of trading was getting forced through CNS for some reason. And then we just saw it. Characteristically just plummet like boom. Hard to climb, right? And to me, that's always what these look like. Look at look at June 6th. They did not care about the price after hours was going crazy. And it just drops off a cliff into the morning, especially with the 8K saying that there would be a share offering. Same thing with May 3rd actually. So running like crazy didn't care. The problem was there was a floor of options here. They had been built up and notice how it landed on a Friday. So uncharacteristic, right? This one's happening on a",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 65,
      "start_timestamp": "01:17:16",
      "start_timestamp_seconds": 4636.369230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4636"
    }
  },
  {
    "text": "that there would be a share offering. Same thing with May 3rd actually. So running like crazy didn't care. The problem was there was a floor of options here. They had been built up and notice how it landed on a Friday. So uncharacteristic, right? This one's happening on a sixth. So potentially happening on a Thursday. Give some time to get it back closer to Max Payne. They did not have that capacity here in the landed way above like 5 above Max Payne on May 3rd. So I think the reason that I think the reason that happened was because. Why did that happen? This April's a 30 day month. It's a little bit shorter. I'm not sure why it ended up landing on a Friday at that time. I think it just worked out that way. Super fortuitous. I think I think that was very impactful. And when you look out into August. It seems like yeah, how do you think about the date that you're specifically looking at against. The op-ex does that matter to you at all? It's better because like the fact that people are banking on a cycle happening during a week of a standard op-ex. That's like never good to me because it's like okay. They don't want to let a cycle come through into a huge options. X-ray, right? That's that'd be terrible. If you're you're managing this whole situation and you know when these elements you're going to do everything",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 65,
      "start_timestamp": "01:18:55",
      "start_timestamp_seconds": 4735.015384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4735"
    }
  },
  {
    "text": "a standard op-ex. That's like never good to me because it's like okay. They don't want to let a cycle come through into a huge options. X-ray, right? That's that'd be terrible. If you're you're managing this whole situation and you know when these elements you're going to do everything you can. To make sure a land somewhere other than here like on the 16th of August that be terrible, right? Because like you know that this is going to be a hype date in the community. You know that the 19th was going to be high. Right? Right. So don't run a cycle into that. Do everything you can to delay a cycle like I think that's why people are saying something to that next week. I see. Because they're like all right, we got it past a pile of what 44 of the calls were all front dated all the way up to here. Now those are all gone. Some have enrolled like you know so the fact that this is not the third week. It is actually encouraging to me because I'm like all right, even though lands pressed up against an op because it's a weekly and I don't think there's hardly any interest. Oh, I for August 9th right now, right? It's tiny. The ninth is very small. So the ninth has 15,000 calls against 5,000 puts the what I find actually kind of interesting those 16 aug has 171k calls against 97 puts. That's",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 65,
      "start_timestamp": "01:20:33",
      "start_timestamp_seconds": 4833.661538461538,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4833"
    }
  },
  {
    "text": "and I don't think there's hardly any interest. Oh, I for August 9th right now, right? It's tiny. The ninth is very small. So the ninth has 15,000 calls against 5,000 puts the what I find actually kind of interesting those 16 aug has 171k calls against 97 puts. That's not topical really what I find interesting about that though is that that's higher than the 26 July, which is at 126,000 to 54,000. It doesn't surprise me in terms of a standard op X versus a weekly, but just the front expiration cycle has been so heavy in game stop typically. Yeah, we saw the fact last time you said yeah, the 19th was very heavy. And the last August 16th, yes, and now, but now the 16th is out weighing the 26th exactly exactly correct. And I think people are maybe picking up on the idea of being way more discerning like we talked about last time right pushing it out to like build a base position out here. Because these cycles can be deferred right pretty obviously they deferred may in June for a long time. And then they were very explosive. So potentially people are spreading out their options more to further dates and quarter or monthly standards rather than going weekly. Yeah, I definitely see them in the standards that's kind of standard fair. And it looks like out in 16 aug the busy strikes are the 30s. And as per usual the 125s and",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 65,
      "start_timestamp": "01:22:12",
      "start_timestamp_seconds": 4932.307692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=4932"
    }
  },
  {
    "text": "out their options more to further dates and quarter or monthly standards rather than going weekly. Yeah, I definitely see them in the standards that's kind of standard fair. And it looks like out in 16 aug the busy strikes are the 30s. And as per usual the 125s and then the puts are are pretty active, but yeah, the. I mean, I'm really, really eager to see just in terms of how the market is positioning into this week, especially with game stop like I'm very eager for Monday actually because I'm just so curious how people are going to transact this week if it's going to be really light or. And they're going to wait until it gets closer to the all expiration or if people are going to start positioning early. I'm curious to because earnings week will be over here right so. Games up earnings should be the fourth of the fifth we don't have a date yet. Right now it looks like it's going to be September fourth. Okay, there we go. And what's kind of cool about that is if there's a September cycle, it would be coming in off of our op x we just have right so you go six trading days out you go 35 ever to go map on my sheep yourself just hold the sheet. It would be like the day of earnings. Did you say the I have it so I have the cycle coming in the next",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 65,
      "start_timestamp": "01:23:50",
      "start_timestamp_seconds": 5030.953846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5030"
    }
  },
  {
    "text": "we just have right so you go six trading days out you go 35 ever to go map on my sheep yourself just hold the sheet. It would be like the day of earnings. Did you say the I have it so I have the cycle coming in the next day. That could be that could be exciting right we're doing cycles here and. Because typically they want to slam the price down part. And so the earnings call occurs in the after hours on Wednesday they tank the price no matter what. It's like a very rarely moves positively on an earnings call for game stop but then if you hook off like a rocket the next day. That would just be like kind of fun and September cycles aren't unheard of there. When you told the noise said I have to go and then I'm just hanging out. I was literally I mean I'm here for it but yeah I was. Let's see how often so August is like 42 and September is like 42 but you can see like July never happens. You don't want to be so cool to add to this. I mean I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 65,
      "start_timestamp": "01:25:29",
      "start_timestamp_seconds": 5129.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5129"
    }
  },
  {
    "text": "sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. I'm not sure if I'm going to be able to do that. They definitely go with seasons though. Yeah, seasonal. Yeah, seasonal. But I'm just so confused for the July that's one of the December make sense. I understand why that might have more seasonality based on holidays and deferrals. That one I get. July confuses me. I still don't feel like I understand why this one is. Here's my other recent thought is you can see. Talk to me. Check this out. So looking at the data This has been like my big Thing for the last couple weeks on my channel and talking about ETF shares outstanding Sorry, this person, but and then turning it into flows of",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 65,
      "start_timestamp": "01:27:08",
      "start_timestamp_seconds": 5228.246153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5228"
    }
  },
  {
    "text": "other recent thought is you can see. Talk to me. Check this out. So looking at the data This has been like my big Thing for the last couple weeks on my channel and talking about ETF shares outstanding Sorry, this person, but and then turning it into flows of creation and redemption So we can see XRT just had huge redemption. I love that So XRT was going through like a bit of a creation cycle and then redemption just happened and price got tanked, right? So I'm building a model for this, but what stands out right away is every Quarter on opx you can see huge creation and redemption happening across all the ETFs like it the magnitudes way scans out so it's on March and Then it's on June opx as well Right up here And these are like huge huge creation and redemption events and they typically are the same amount created over Couple days and then redeemed over a couple days and what that would be is capital gains washing on the ETFs because they're basically trying to Make it so someone does it sells an ETF They get preferential capital gains treatment and especially the associated What's it called what's mutual fund with that ETF that they share the same pool with so what I'm looking at now is on these cycles So they do that in June right? So June opx sees lots of creation or redemption across the whole market for",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 65,
      "start_timestamp": "01:28:46",
      "start_timestamp_seconds": 5326.892307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5326"
    }
  },
  {
    "text": "especially the associated What's it called what's mutual fund with that ETF that they share the same pool with so what I'm looking at now is on these cycles So they do that in June right? So June opx sees lots of creation or redemption across the whole market for the ETFs the cycle then would be for August off of June So that's why you would have something here and then they're gonna do it against September. That's why November is pretty common For having these cycles then they're gonna do it again in When would be the next time they do it it just set September right are they're gonna do it in December end of your wash So you go out two more months. That's why February is pretty common and Then you're gonna go out to march is gonna be the last time they do it and that's why in May is pretty common for having some One of these hot that common but like July July is responsible opx is May and they're not washing in May And how do we decipher when they're washing and why then well they do it quarterly You can see it let me go back to Great here here's opx For September you can see they create this many shares of VXF and then they immediately redeem them two days later They do it on FMDA create and then redeem almost the exact same number of shares They don't",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 65,
      "start_timestamp": "01:30:25",
      "start_timestamp_seconds": 5425.538461538462,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5425"
    }
  },
  {
    "text": "see it let me go back to Great here here's opx For September you can see they create this many shares of VXF and then they immediately redeem them two days later They do it on FMDA create and then redeem almost the exact same number of shares They don't do this any other time Well, they do it here actually but yeah But this is the this is so much bigger this is 9 million shares this ridiculous number of shares yes Yeah, and I agree with you in terms of the magnitude, but it the two things is I'm not sure that Like PL washing is the only I'm just trying to isolate the different reasons why they do this Yeah to try and then to say for a signal because I see what you're seeing there and I So this one was June what was the other one? September So it's every quarter Right here it is in March And then it'd be in December Okay, yeah, I mean that lines up About as good as you could expect it would right So everything's gone through earning seasons right profit Price is kind of is this Do you know if this corresponds with rebalancing at all because that's also they would be rebalancing then yeah So it could be rebalancing as well because now the pricing is all changed yeah And some are some have different rebalancing windows, you know, so it's it could just be something",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 65,
      "start_timestamp": "01:32:04",
      "start_timestamp_seconds": 5524.184615384615,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5524"
    }
  },
  {
    "text": "you know if this corresponds with rebalancing at all because that's also they would be rebalancing then yeah So it could be rebalancing as well because now the pricing is all changed yeah And some are some have different rebalancing windows, you know, so it's it could just be something that has to do a vanguard These are my Vanguard ones These are State Street and these are Black Rock Yep, so they might do it in a different cadence than one another But I'm noticing that this grouping of small caps tends to kind of doing totally Around the March, June, September and December, up X's Which makes sense like, you know See right here, this is March I don't have these colors schemes like perfect or anything So yeah, it kind of makes sense that like if they do a big shuffle around through all their mutual funds and ETFs in June And then they have that six days and then 35 days then you get a cycle that pops off And the cycle is going to land in August Right now they got to go buy the shares Fill up the ones that are that are short shares and then if they do it again in September So you can November sorry quick question on the lead and then to the August cycle based on Based on them Going through the the creation process would you then postulate GameStop would see an expansion in volume And then",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 65,
      "start_timestamp": "01:33:42",
      "start_timestamp_seconds": 5622.830769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5622"
    }
  },
  {
    "text": "shares and then if they do it again in September So you can November sorry quick question on the lead and then to the August cycle based on Based on them Going through the the creation process would you then postulate GameStop would see an expansion in volume And then if so how does that correspond with the ETF volume Yeah, so here's gameStop Possible tailwind event. I've got an indicated right on here right it's got the I put green here. I think volume will be big On that day, okay on the eighth and the next day just like we saw in the sixth Right it'd be derived from the events here of June obnox We did see Characteristic fails to deliver on XRT Not a lot on the other ETFs But we saw some games not fails There's nothing really going on here except for obnox they're roaring kitty about in Six days prior so it's T plus six office trade that matters Okay Volumes not crazy even though it's a very big obnox 28 million Not the most exciting volume for that period Um, and then we go to the flows. So let's look at the flows on six 21 per So we can see on this day There was huge creation On the day prior and the day of And creation of ETFs is going to demand shares of games up That's what I'm seeing makes perfect sense to Even XRT everything's being created in",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 65,
      "start_timestamp": "01:35:21",
      "start_timestamp_seconds": 5721.476923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5721"
    }
  },
  {
    "text": "flows on six 21 per So we can see on this day There was huge creation On the day prior and the day of And creation of ETFs is going to demand shares of games up That's what I'm seeing makes perfect sense to Even XRT everything's being created in mass And then you see them all hit like a peak Over here on number of shares FNDAs at a peak iwb's of the peak Everything's literally peaked out because they've created a ridiculous number of units But then they go into a redemption cycle right away Lots of redeeming happening Go ahead No, I'm just I'm trying to understand because I see what you're saying I'm trying to understand Like the mechanics of specifically what they're doing and why I get the the profit washing that makes sense to a degree rebalancing makes sense to a degree Well, you need to create like let's say you've got There's a lot of these like a billion shares of VTI right here Yeah, but what the outstanding is right and they create 6 million shares Well, they're going to actually a lot more over these over these days here um Yeah, 8 million shares so they create 8 million shares And then they're going to then redeem another 8 million shares that are the old ones that are unbalanced Does that right? Yeah, so you have to create the new ones with a new formula the new balanced formula And then",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 65,
      "start_timestamp": "01:37:00",
      "start_timestamp_seconds": 5820.123076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5820"
    }
  },
  {
    "text": "8 million shares so they create 8 million shares And then they're going to then redeem another 8 million shares that are the old ones that are unbalanced Does that right? Yeah, so you have to create the new ones with a new formula the new balanced formula And then redeem the old ones and get the shares back I see Now How does this feed into then like the availability because to me one of the things I would find curious about this is if the availability of something like GameStop is limited It seems like going through this process would be really painful for them Exactly that speaks right to this paper by Evans we were talking about earlier before we And he's talking about when the ETFs are more liquid Than the underlying Which is happening with small caps a lot and that's exactly the problem with GameStop is look at the flows here Sorry, go back to the data The the flows on these things is crazy you're talking about 8 million shares of VTI well how much GameStop do they need? right And so they're going to have to delay settlement is what his papers talking about and that's what they see because this was 6 years ago And ETFs were only 10 of the market capitalization, but they were 20 of the short interest and 78 of the fails to deliver So they're failing the underlying To create these units right what he talks",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 65,
      "start_timestamp": "01:38:38",
      "start_timestamp_seconds": 5918.769230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=5918"
    }
  },
  {
    "text": "talking about and that's what they see because this was 6 years ago And ETFs were only 10 of the market capitalization, but they were 20 of the short interest and 78 of the fails to deliver So they're failing the underlying To create these units right what he talks about is Um, I love the paper. It's so good is they basically talk about So if there's a big order in balance like someone comes in and buys a huge number of shares Well, then you go to an AP you request to shares the creation of the shares of the ETF That's going to then dry up the volume that's hitting the market That's going to suppress price in the short term So the ETF makers could actually get a better deal on the underlying Because all of a sudden the price dips So I think we could be seeing exactly that If they created a ton of units of ETFs for the last week And then now the delayed settlement gives them time Then there there could be a dip and they could get a good deal even though it costs them a lot of money To do all this I think is kind of your question right Yes, they're paying a fee to do this They're tracking down all the underlines But if everything goes through a cooling off period Then they could get the underlying for cheaper And it's actually works out okay for them",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 65,
      "start_timestamp": "01:40:17",
      "start_timestamp_seconds": 6017.415384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=6017"
    }
  },
  {
    "text": "do all this I think is kind of your question right Yes, they're paying a fee to do this They're tracking down all the underlines But if everything goes through a cooling off period Then they could get the underlying for cheaper And it's actually works out okay for them I see Yeah, I think it's Also Fking fascinating Right so I'm fascinated with this data someone provided it to me They provided me all the historical outstanding shares For all these ETFs And then I can just go through every day and update it now In real time a little bit painful But gives me perfect visibility on On what the flows are how much how much games stop they need day to day Right Yeah, I was going to say for some like that you just use like a web scraper And grab it from like Alcoo Finance and have it auto Yeah, I'm terrible Me too my dog's the brain of the outfit so I I commiserate with you Dude Fking fascinating All right, homie well it's playtime for you. Yeah, I'm gonna go play some Pokemon Yeah, it's time for you to get out of here Um Thank you for hanging out and walking me through a bunch of this stuff I Would Love to catch up with you again Again, I'll shoot you a text wing coordinate But I'd love to catch up with you again next weekend or whatever Yeah, let's play it by",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 65,
      "start_timestamp": "01:41:56",
      "start_timestamp_seconds": 6116.0615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=6116"
    }
  },
  {
    "text": "Um Thank you for hanging out and walking me through a bunch of this stuff I Would Love to catch up with you again Again, I'll shoot you a text wing coordinate But I'd love to catch up with you again next weekend or whatever Yeah, let's play it by ear and see when a good day works out I don't know if I'm available next weekend, but Perfect definitely very enjoyable. I always learn a ton. Thank you so much for having me Yeah, man, it's always a good time. Thank you everybody for coming to hang out I think for a while I thought we're over 400 people Shillin so thank you guys also for being a part of the whole story I feel like a lot of the community is what makes a lot of this so interesting on top of Everything else going on. So I'm super appreciative of everybody being a part of it and at least letting me Observe and learn so thank you guys Richard you're the man. Thank you for chilling for a bit everybody else. Thank you for hanging out We will keep you up to speed on one. We're doing our next one. We're kind of keeping a regular cadence on the updates So we'll figure out a time that works for everybody and then we'll catch you all on the next one You guys later. Thanks everybody. Thanks sir",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 65,
      "start_timestamp": "01:43:34",
      "start_timestamp_seconds": 6214.707692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=6214"
    }
  },
  {
    "text": "our next one. We're kind of keeping a regular cadence on the updates So we'll figure out a time that works for everybody and then we'll catch you all on the next one You guys later. Thanks everybody. Thanks sir",
    "metadata": {
      "video_id": "S1f1zIfXVh8",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis Ep3",
      "url": "https://www.youtube.com/watch?v=S1f1zIfXVh8",
      "upload_date": "",
      "duration": 4531.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 65,
      "start_timestamp": "01:45:13",
      "start_timestamp_seconds": 6313.3538461538465,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=S1f1zIfXVh8&t=6313"
    }
  }
]