[
  {
    "text": "Chances are you're leaving money on the table as an options trader, especially if you don't carefully differentiate between buying premium and selling premium. At the end of this video, you're going to have a really solid understanding of the trade offs between both of them and to see what is a better fit for what you're doing. What's up everyone? Eric here. Welcome back to the outliers. Let's get right to it. So, buying versus selling options, you'll hear all sorts of stuff. If you are familiar with theta gang, you'll hear theta gangers convinced that theta in and of itself is an edge, which fun fact, it unequivocally is not. And then you'll have the people from Wall Street bets that are yoloing on cheap options that swear their lotto that ended up luckily hitting for them is the way and its way better than selling premium. So how do we get to the bottom of this? Well, we need to understand in detail the difference between buying and selling premium as you can see on the y axis here. I broke it out across a bunch of different metrics. So that at the end of the video, once I go through an example with you, you'll be able to follow along pretty close in detail and see exactly how to come to the correct decision for what you're doing, whether you want to buy or sell premium. So, first let's start with some general practice admin stuff.",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "once I go through an example with you, you'll be able to follow along pretty close in detail and see exactly how to come to the correct decision for what you're doing, whether you want to buy or sell premium. So, first let's start with some general practice admin stuff. It's kind of real simple upfront to buy premium versus selling premium, the entry and exit trades. Just for those that don't know, if you're buying premium, you're buying to open. And then if you are selling premium, you're selling to open and then to close, it's the inverse. Now let's get into the important stuff, the risk profile. Now when you buy premium, you are defining your risk. Your risk is going to be defined as whatever you bought your option for. Let's look at an example. If we pop over to the chart and we take a look at Palantir, let's say that you're an enterprising trader and let's say that you saw Palantir had a really good earnings and a gap up and you're like, ah, post earnings announcement drift looks like it might be an order here. Let me speculate with some long calls. Well, let's say you go in and you buy a handful of the long calls and you pick the 50s that are out in 17 Jan 25, pure hypothetical. And you got those for 5.43 at the time. And if you're curious what the time was, that would have been on the",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "say you go in and you buy a handful of the long calls and you pick the 50s that are out in 17 Jan 25, pure hypothetical. And you got those for 5.43 at the time. And if you're curious what the time was, that would have been on the 5th of November. And notice though, the downside risk is capped. This line here levels off and it can go no lower. It shows you that your risk is defined. That is very different. Then for example, if we sold a put, if we switch that and now you take a look, you'll actually see that your profit now is capped and your loss is now uncapped. So that's a really big difference between buying and selling premium. This is probably one of the biggest differentiators. This is probably one of the things you should really pay attention to because as we come back later to figure out tips on how to decide between buying and selling premium, that's going to be one of the major decisions. It's going to be based on the risk and reward profile. Now, let's talk about the break even point and what that means. So if you buy premium, it requires an accommodating move in order to make money. If you sell premium, you have a built in buffer. So what does that mean? When you buy premium, you have a slightly lower probability of profit depending on where you choose to buy. And",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "So if you buy premium, it requires an accommodating move in order to make money. If you sell premium, you have a built in buffer. So what does that mean? When you buy premium, you have a slightly lower probability of profit depending on where you choose to buy. And if you sell premium, depending on where you choose to sell, you will have a higher probability of profit. So what does that actually look like? Well, let's go back to this example. And if we look at selling a put today as it sits in Palantir, you can see that right now this is current price. Our max profit is anywhere above 55 and our break even is down here at 5247. Meanwhile, Palantir is trading at 5985. So that means that it literally can move all the way from 5985 down to 5247 and you can still be profitable. Now this always sounds better than it actually behaves and it's an important note. A lot of people get twisted up on this because take a look at this purple line. This purple line represents today and then this blue line represents at expiration. So yes, at expiration, as long as it's above 52 and change, you would essentially walk out at a break even up until that point though, you're losing money. And in this case, you would be losing 304. That can be really painful if you have a bigger trade. So you might be thinking, oh,",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "long as it's above 52 and change, you would essentially walk out at a break even up until that point though, you're losing money. And in this case, you would be losing 304. That can be really painful if you have a bigger trade. So you might be thinking, oh, okay, great. I have such a big buffer. It starts to feel a lot different when that buffer is getting eaten up. It moves down to your break even. You're holding a big loss and now you're looking at a choice. You're like, well, crap, if I hold this, it would be a profit. If it doesn't go down lower, but if it goes down lower, now we're getting into the nasty part of the undefined risk aspect of the trade, which is again, not inherently good and bad, but it's something a lot of traders mistakenly give themselves a false sense of confidence and they think they have this big buffer and sometimes they don't. Now the other admin note from a pedantic standpoint is for selling a put, a stock can only go down to zero. So if we swoosh this all the way in and then we slide all the way down as like you can see that there's actually a defined loss all the way down here. And it's just because it can only go down so far until it gets to zero at which point you're done. Now that's not the same for short calls,",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "slide all the way down as like you can see that there's actually a defined loss all the way down here. And it's just because it can only go down so far until it gets to zero at which point you're done. Now that's not the same for short calls, stuff that is to the upside, there's no cap. So the way to think about these two is it really depends on the movement factor, but it's really important to remember that the built in buffer for selling premium comes at a cost. The cost is undefined risk and sometimes that can sneak up on you a little faster than you think and it can cause a little bit more of a problem in terms of an expected return. What does that mean? Take a look in this same example, if we sell this put, we're collecting 260. Let's just say that balance your tanks for whatever reason it goes down to 40. Well now we've just lost 1,270 in pursuit of making 260. Right? So it's a big loss for a very small game. And this is the pennies in front of a steamroller analogy you'll hear from Thadigang where we're playing a delicate game and a lot of traders rely a little too heavily on their expected probabilities and they're not managing the trade which still needs to happen. So so far you can see that there's some very clear differences between these. Let's talk about the relationship",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "where we're playing a delicate game and a lot of traders rely a little too heavily on their expected probabilities and they're not managing the trade which still needs to happen. So so far you can see that there's some very clear differences between these. Let's talk about the relationship with volatility. So volatility when you buy premium, it helps you if it goes up, hurts you if it goes down. As volatility increases in an underlying, all options appreciate in value and inverse if it goes down. And then obviously the inverse will help if you sold premium because when you're selling premium, the game is you want to sell premium whatever you're selling it at higher and you want to buy it back lower, whether you sell a put sell call doesn't matter in terms of the premium outlay. So if we have volatility that contracts that decreases the premium that benefits our trade. Now from a capital requirement perspective, it's a little bit different here because for buying premium, the capital requirement is going to be whatever you purchase the option for. Meanwhile for selling premium, there's going to be a margin requirement and the margin requirement is going to depend on if you have a margin account, what margin positions you permissions you have. In this case, I'm using a pass through IRA. So what that means is there's nothing in the account, but more importantly than that, you'll notice that the margin requirement for this",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "is going to depend on if you have a margin account, what margin positions you permissions you have. In this case, I'm using a pass through IRA. So what that means is there's nothing in the account, but more importantly than that, you'll notice that the margin requirement for this 55 put is 5,500 because in the IRA account, you can't have negative puts has to be cash secured. If you have a margin account, then maybe you have regulation T or if you have a slightly bigger account, you can have portfolio margin. The one thing to note about this specifically, the margin requirement for selling premium is that it changes as the broker perceives more risk. They are going to expand the margin requirement. They're not going to take the risk for you. So they're going to give you the leverage, meaning you can control, excise position, putting up a smaller amount of money, whatever that margin is, but they're going to adjust it based on their risk and they're going to pass that onto you. That doesn't happen when you buy options. Buying options is whatever it is right from the jump. In a quick note, just on the Greeks for those that are curious, when you buy premium, your short data. The simple means as time passes, your options lose value in the form of theta decay. When you buy premium, your long gamma. That means that moves in your favor, if you buy a call",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "on the Greeks for those that are curious, when you buy premium, your short data. The simple means as time passes, your options lose value in the form of theta decay. When you buy premium, your long gamma. That means that moves in your favor, if you buy a call and you get a move up, it helps your position compound quickly. I have a trade that I recently did in DJT. I'll throw a link below that is actually built around what we call building units. It's a gamma play. Then long row is already what we talked about in terms of volatility. I just wanted to add it there for a general note in case you were wondering. Now for selling premium, you are long theta. That means you're collecting the theta decay from somebody else. However, you're also not long short. That sounds like a bit of a tough position to put on. I guess you could put it on, but you're short gamma. That means big moves tend to hurt you. Again, it does depend on if you're short of single option or short, like a straddle or strangle in those instances. The way to think about the gamma relationship is if you're long gamma, you want a big move in your favor. If you're short gamma, you want little movement. Now, you also understand already the relationship with volatility. Now let's get into some of the tips here for you to onboard. At the end",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "about the gamma relationship is if you're long gamma, you want a big move in your favor. If you're short gamma, you want little movement. Now, you also understand already the relationship with volatility. Now let's get into some of the tips here for you to onboard. At the end of this, you should actually have a really clear way and framework to think about do I want to buy premium here or do I want to sell premium? The first one is use both. There's no inherent advantage to either one of these. Buying has a use case. Selling has a use case. I'm going to show you an example in a second of this. I used to think selling was better than buying, like a lot of enlightened traders as they go through a few years of trading, they really think that selling has an edge and it can, but it's not because of selling in and of itself. It's because of other factors that have to be carefully tracked. I actually find really great success using both of these. This is why my overall approach to trading, which I'll throw a link to that below as well, I actively use both and it's because they each have a use case for many. Now, what's the next primary tip here? It's don't default. One of the things that I find people will do is they will automatically think, oh, I'm going to sell premium here. I'm going to",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "I actively use both and it's because they each have a use case for many. Now, what's the next primary tip here? It's don't default. One of the things that I find people will do is they will automatically think, oh, I'm going to sell premium here. I'm going to buy premium. What I think about instead is fitting the profit mechanism in your risk preference. This is part of something I call the outlier strategy process. I have a video as well that I'll link to below on this, but the thing I really want to focus on here is this idea of outlining fitting structures. This is step three. Let's take a quick look at an example together. If we pop over into here and we take a look at Palantir, if for whatever reason we had that position we talked about that perspective trade that came in on the fifth and we think that Palantir is going to have a big move. If we think that there's going to be a big move, would we rather have defined or undefined profit potential? In that case, I would rather have undefined profit potential because if it's going to be a big move, I don't want to be limited by just getting the credit that I received. I'm building a broader portfolio and I'm being aware of the impacts of Greeks on the portfolio. I realize I have a bunch of long options. I'm losing money every day in",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "be a big move, I don't want to be limited by just getting the credit that I received. I'm building a broader portfolio and I'm being aware of the impacts of Greeks on the portfolio. I realize I have a bunch of long options. I'm losing money every day in theta. Maybe I want to try to sell some options in order to offset some of that theta decay. The idea is don't default to buying or selling. Use both of them in the context that it makes sense. Let's take a look at another example quickly. If we take a look at something like Qualcomm, which essentially has been trending sideways for the past three months straight even through earnings, doesn't really look like it's making big moves to the upside or to the downside. Well, I don't want to buy options because it's not moving enough. Maybe this becomes an instance where selling options can be a great add to the overall portfolio, add to diversification in terms of different profit mechanisms, and it offsets some of the theta. It gives me positive theta. So if we take a look at some of the common misconceptions, we already talked about one not being better than the other, but the other thing we have to highlight here is overweighting volatility. There are a lot of traders that will automatically default to selling premium if implied volatility or implied volatility percentile is high and they will default to the inverse",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "talked about one not being better than the other, but the other thing we have to highlight here is overweighting volatility. There are a lot of traders that will automatically default to selling premium if implied volatility or implied volatility percentile is high and they will default to the inverse if it's low via buying. And that's a mistake. The reason why it's a mistake is because unless you are actively delta in gamma hedging to truly isolate volatility, delta is still the more important input to your formula. What does that mean? Well, let's take a look. If we take a look at Qualcomm, we might say implied volatility percentile is 54. Let's just say that this was really low. Let's say implied volatility percentile was 10. If you're an option seller, you would look at that and say, oh, well, that's super low. I don't want to sell volatility there. It's too cheap. And if volatility expands, it'll hurt my position. It will. However, it's temporary because as long as Qualcomm remains range bound, if we sell a strangle, for example, even if your position temporarily hurts because volatility has gone up, data is still going to decay. And as long as it remains range bound, you're going to have a full profit at the end of it. So volatility is a massively important consideration when you are looking to buy or sell options. It's a massive input as a decision factor. However, it should not be the",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "And as long as it remains range bound, you're going to have a full profit at the end of it. So volatility is a massively important consideration when you are looking to buy or sell options. It's a massive input as a decision factor. However, it should not be the decision factor. It shouldn't be default to selling or buying based on volatility alone, unless again, you're deploying a specific volatility trade. That's different. Of course, volatility then becomes the primary input. That is your actual profit mechanism. So that is exactly how I think about buying versus selling premium. The main decision it's going to come down to is what kind of risk profiles do I want. I'm going to manage it whether it's bought or sold. So it doesn't matter quite that much. And then the second is how do I feel about the profit potential given the corresponding trade-offs? If I have something that's an undefined profit, I know I'm going to have a lower probability of profit. I'm going to have to be better at picking direction. And it's going to have to move in my favor within the expected time frame. And I have a video down below on buying options smarter that shows how to balance some of these things. Or inversely, if I'm fine defining the profit, I'm not necessarily expecting a big move. And I just want to benefit from the passage of time. Then selling premium can make a lot of",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  },
  {
    "text": "video down below on buying options smarter that shows how to balance some of these things. Or inversely, if I'm fine defining the profit, I'm not necessarily expecting a big move. And I just want to benefit from the passage of time. Then selling premium can make a lot of sense. So as always, if you have any questions, anything you want me to go over, let me know. Be an outlier. Thank you.",
    "metadata": {
      "video_id": "SAAznQCMSco",
      "title": "The Ultimate Guide to Buying vs Selling Options (Long vs Short Options)",
      "url": "https://www.youtube.com/watch?v=SAAznQCMSco",
      "upload_date": "",
      "duration": 977.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 15,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=SAAznQCMSco&t=0"
    }
  }
]