[
  {
    "text": "you you you you you you you you you you you you you you M is spend a little bit of time piecing together when he got into these other positions, which I actually think is a really important process that we went through because it highlights a few things to me, but one of them primarily being he had like this really heavy scale day on the 22nd that then tailored off. And this almost seems like happenstance that ends up going on here. This is what 35,000 contracts, like I don't know, it's just these seem weird to me. I haven't really been able to get to the bottom of that from at least a perspective standpoint. So I am very curious here. Where we left off, we had gone through, we understood his stock position when he added what the residual basis was that he needed to add all that stuff was in here. I also went through and I took a look at the time, the time distribution of entries, which I do think this is kind of interesting. If, oh no, I don't want that, want it inserted chart. So what I did is, I don't want a line chart, I want like a frequency. No, that's not it either. Aren't what I want. I'll deal with this later. What I noticed when I was looking at his entries is that there was a lot of frequent entries at the same time frames, right? So",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 70,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=0"
    }
  },
  {
    "text": "don't want a line chart, I want like a frequency. No, that's not it either. Aren't what I want. I'll deal with this later. What I noticed when I was looking at his entries is that there was a lot of frequent entries at the same time frames, right? So you can see this 12 handle, which is right before the market closed, is really dominant in his entries. And we can see a couple stuff near the morning, but not many. So if we were to eyeball this, get rid of this stupid chart. So let's do like 11 o'clock in past. This is a count of eight, nine, 10, 11, 12, 13, 14, 15, 16, out of 24. So the majority of his entries occurred in that 11 and past handle, which is really interesting. Like I said, thanks again for doing this. Eric, this is actually an awesome series, how you're statistically analyzing the trades. It's amazing. Yeah, for sure. Happy to do it. Part of this is I am genuinely, I'm just super fucking curious. This is the kind of thing that I actually really enjoy spending the time looking at this with you guys because it's such a, there's so many elements of it that are so fascinating. I was actually, I was texting with Newton. What? He and I were talking earlier today. He was telling me about the PSA grading thing, which is really interesting. Oh, he just texted me again. Hold on.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 70,
      "start_timestamp": "00:08:22",
      "start_timestamp_seconds": 502.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=502"
    }
  },
  {
    "text": "it's such a, there's so many elements of it that are so fascinating. I was actually, I was texting with Newton. What? He and I were talking earlier today. He was telling me about the PSA grading thing, which is really interesting. Oh, he just texted me again. Hold on. He's telling me about his next hype date. And I'm asking him if we started a tracker. I really want to see how these different hype dates work out. Especially from Newton, because I know like on on Reddit and stuff, I see like a lot of people are just kind of take pot shots at stuff. Citrix says seventh, no. Yeah, so I see he told me it's seven, no, and he says, I'm asking him for some details around it. Like what's the general thesis behind it? And then I also am asking if we have a, if we have like a tracker, because that would be really cool to keep an eyeball on. All food says I love the clip he posted. You know what you're going to do. I don't know what that's in reference to. Misty. Really? Not a real name. It's almost like diaper. Oh my God. What is with the fucking handles in here today? So we got, we got misty growing. Would you and Newton consider opening an escape room franchise to get? I don't think so. I've never really been in the escape room. I've done like two of them in",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 70,
      "start_timestamp": "00:09:52",
      "start_timestamp_seconds": 592.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=592"
    }
  },
  {
    "text": "Oh my God. What is with the fucking handles in here today? So we got, we got misty growing. Would you and Newton consider opening an escape room franchise to get? I don't think so. I've never really been in the escape room. I've done like two of them in my life. So I'm not so sure that I would go into the escape room franchise business, but Viam Pyrrduce says having joined the stream. He's always welcome. Yeah, it's an open door. I asked him a couple of times and he said that he was busy. So I haven't been asking him just because you know what that's like. You don't want to make somebody feel like you're, you're pastoring them. But the last time I invited him on, I told him it literally, I do these every single Saturday and he's welcome to join me quite literally whenever he feels like. I'm going to make it. And then I told him as well, if he ever wants to try to set up another period in time, that works better for his schedule. Like if it's something earlier in the morning or whatever, like I'm cool with that. But right now, I think he's kind of happy with his production schedule. And I also, I remember when he and I first started speaking, one of the first things he told me is that he actually doesn't really do like collaborations, quote unquote, that it kind of does his own",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 70,
      "start_timestamp": "00:11:28",
      "start_timestamp_seconds": 688.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=688"
    }
  },
  {
    "text": "right now, I think he's kind of happy with his production schedule. And I also, I remember when he and I first started speaking, one of the first things he told me is that he actually doesn't really do like collaborations, quote unquote, that it kind of does his own thing typically. So yeah, that's my guess is that he's just kind of like enjoying doing his thing. I think the live streams, he enjoyed, you know, when we spoke about it, but I didn't get the sense with the competing interests that he has now, you know, that it fits in well. But yeah, like I said, he and I, we literally text almost every day. So we'll find something at some point, but it's, I know what it's like to be super busy and I wouldn't want him to feel any pressure whatsoever, because that just kind of sucks. Because one of the worst things is like sometimes I'll have friends that invite me to do something and it's like two or three times in a row that I can't do it. It starts to make me feel like shit to say no. It feels like like I'm letting them down. So I don't like putting other people in that circumstance. But yeah, definitely always, always down to chat with the dude and seem thing with Praveen Bull. He and I have kept in touch via text and I'm working. Well, I like we don't really have anything",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 70,
      "start_timestamp": "00:12:33",
      "start_timestamp_seconds": 753.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=753"
    }
  },
  {
    "text": "letting them down. So I don't like putting other people in that circumstance. But yeah, definitely always, always down to chat with the dude and seem thing with Praveen Bull. He and I have kept in touch via text and I'm working. Well, I like we don't really have anything lined up, but we're working on a couple other things for now, but we'll do something else again in the future because he and I both get along really well on top of that. That's another thing that I've noticed so far is like most of the people and it's people that you've all put me in touch with, by the way. It's not people that like I've found because I don't know the folks in the space as well as a lot of you do. But when I first started doing the GME videos, I've had a handful of people reach out to me be like, oh, you should talk to Richard Newton. I obviously I had no idea who he was. And then I connected with them and enjoyed like all of our conversations. He and I have even gotten into some like philosophical stuff, which has been cool. And then even with Praveen Bull, you guys put me in touch with Praveen Bull. Like a lot of you said, like, hey, reach out to him. He would be another cool guy to talk to. And he and I, we spoke very briefly before the live stream. Like",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 70,
      "start_timestamp": "00:13:29",
      "start_timestamp_seconds": 809.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=809"
    }
  },
  {
    "text": "cool. And then even with Praveen Bull, you guys put me in touch with Praveen Bull. Like a lot of you said, like, hey, reach out to him. He would be another cool guy to talk to. And he and I, we spoke very briefly before the live stream. Like the last time, the first time I actually like spoke with him was on that live stream. And then he and I had another phone call, I think like last weekend where we spoke for a bit just about other stuff. And he's another just really solid dude. I like him a lot. So you guys have put me on, like put me in touch with some really, really cool people, which I'm thankful for. Ruvian Bull's fascinating because of his broader background. I like, I don't know how much, I'm not familiar with his content. That's not out of like any disrespect to him. I literally just do not watch like trading content typically. But I so I'm not familiar with it. I don't know how much he talks about like his own trading and stuff like that. So I'm not going to dox him. That's one of the things that he and I spoke a little bit about that was really interesting to like understand the background he has from like a studies perspective versus the practical perspective. So he has a lot of really interesting perspectives on things, which is fun to, fun to dive into. So",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 70,
      "start_timestamp": "00:14:30",
      "start_timestamp_seconds": 870.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=870"
    }
  },
  {
    "text": "things that he and I spoke a little bit about that was really interesting to like understand the background he has from like a studies perspective versus the practical perspective. So he has a lot of really interesting perspectives on things, which is fun to, fun to dive into. So yeah, you guys haven't missed yet with the recommendations. I'm super appreciative because one of the things is I actually find, I find I really like collaborating a lot with people like a ton because it's also like the same thing. This doing the live streams is way more fun for me than making videos like hands down. It's if there was like a better trading presence on like Twitch or something like that, I probably would just do that versus YouTube because most of my stuff on YouTube, like I built a lot of the core content as it sits. But like the process of like making videos, I don't care about. I like sharing information. So the collaboration side of things have been super, super fun. Dipper King says the collapse bring different perspectives in a single combo, which makes them very fun and interesting. Yeah, definitely. And the other thing is I think, I think collaborations, well, like the first one we did was a lot of me understanding his perspective and kind of picking his brain on the broader context. So that's one of the things I wanted to do in the future is have one",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 70,
      "start_timestamp": "00:15:33",
      "start_timestamp_seconds": 933.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=933"
    }
  },
  {
    "text": "the other thing is I think, I think collaborations, well, like the first one we did was a lot of me understanding his perspective and kind of picking his brain on the broader context. So that's one of the things I wanted to do in the future is have one where it's kind of more of an open dialogue about different ideas and stuff, just to kind of probe a little bit. I don't like when I'm first getting to know somebody, I much prefer to like shut the fuck up and listen and understand them as much as I can. But I think he'll be another kind of person that will be fun to kind of go back and forth and explore ideas I completely agree. And Purita says you could do a react of Richard's new video, which goes over his seven November theory. Oh, yeah, maybe I could do that. I'll text him and see if he's cool with that. I don't really know how that works in terms of like YouTube if it's going to turn us off. I'm texting really quick. Pull up your video and watch it with the stream. VityK if YouTube has an issue with that. But want to check with you first. If you're okay with that. I just texted him to see if he's cool with it. I wouldn't I wouldn't just watch somebody else a shit on mine without at least asking them first. Misty grunt. I can't get",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 70,
      "start_timestamp": "00:16:42",
      "start_timestamp_seconds": 1002.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1002"
    }
  },
  {
    "text": "an issue with that. But want to check with you first. If you're okay with that. I just texted him to see if he's cool with it. I wouldn't I wouldn't just watch somebody else a shit on mine without at least asking them first. Misty grunt. I can't get over that fucking name. Misty grunt is wild of a name. What if Trump and Harris revealed they have common interest of scrabble and wine and a nation heals big Lee that would be on fleek would love that. And it's not even like Donald Trump and Harris. I think it would be cool if like all of them like just Democrats and Republicans were just fucking chill with one another. That would be dope. Dr. Z says we'd be kind of interesting to see Eric on the P.P. show. They are true degens though not sure if the vibe would be right. However, they do have extreme deep knowledge of the saga. I yeah, I've heard you guys mentioned the P.P. show a couple times. I don't know I literally don't know anything about them though. So yeah, you guys would have a much better sense if it's like a good fit to connect with them. Hmm. I think at one point somebody said that there was a stream going on not recently like a few weeks ago and I popped on the stream and I I reached out to them there. But I think the audience was not",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 70,
      "start_timestamp": "00:17:57",
      "start_timestamp_seconds": 1077.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1077"
    }
  },
  {
    "text": "a good fit to connect with them. Hmm. I think at one point somebody said that there was a stream going on not recently like a few weeks ago and I popped on the stream and I I reached out to them there. But I think the audience was not having that. I think the audience was I think they went right down thinking that well, just saying that I'm a shale and all that kind of stuff. So I don't know. Yeah, maybe it's maybe it's not a good fit. But I did reach out to them on one of their live streams at one point, but I never heard anything from them. I told them, you know, I tried to do it not not. I didn't want to interrupt the stream, but I don't think they had like an email or something. I don't remember. That might be them or somebody else. I can't fuck a remember. That was somebody I tried to reach out to. I fucking I reach out to a lot of people. I get rejected by the most most of them. I mean, it's I say that partially and just people are just fucking busy, man. So I totally get it. I unfortunately, I'm not as responsive as I would like to be. So I totally get it. Cedric says Eric don't go to P.P. Why not? The impurities says they're shady. Oh, okay, got it. Yeah, see, that's the thing is if it's",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 70,
      "start_timestamp": "00:19:11",
      "start_timestamp_seconds": 1151.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1151"
    }
  },
  {
    "text": "busy, man. So I totally get it. I unfortunately, I'm not as responsive as I would like to be. So I totally get it. Cedric says Eric don't go to P.P. Why not? The impurities says they're shady. Oh, okay, got it. Yeah, see, that's the thing is if it's if it's something that wouldn't be good, I don't want to do it. But if it's something that if it's something that you guys think would be fun, I'm always down. Yeah, like I don't like working with I don't like doing fanatical stuff like people that are too into their own theories and stuff. I don't do well with and people that aren't willing to have like an open conversation about ideas. Like I prefer to align and work with people that are pursuing like truth and actual information. That's what I care about. There are some people that are good at doing that and there's some people that are not doing good at that. So yeah, I don't I don't really. Cedric says avoid P.P. Like to play diapers as wild tin flow and speculation. I see. Okay. Yeah, and I mean, a little bit of tin foil school, right? Like I have my tin foil hat. I actually really love exploring some of the crazy ideas. At least from my perspective, I think it's just important to be able to acknowledge when we're going out on a fucking limb and just having a good time going out",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 70,
      "start_timestamp": "00:20:04",
      "start_timestamp_seconds": 1204.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1204"
    }
  },
  {
    "text": "school, right? Like I have my tin foil hat. I actually really love exploring some of the crazy ideas. At least from my perspective, I think it's just important to be able to acknowledge when we're going out on a fucking limb and just having a good time going out on a limb versus what our rational brain can quantify, qualify and prove. I keep those two deeply partitioned in my brain and I wait what I can prove or disprove light years more heavily than what I think feel might think could be those kinds of things. So yeah, I don't really, I don't really go that route. All right. Oh, and it looks like Vampyrdus gave out five outlier training memberships. Thank you so much for doing that. Looks like Vampyrdus hooked a few people up. Make sure that if you hooked you up, you say thank you. That would be super nice of them. Thank you very much. I so let's let's pick up somewhere where we left off here. We had just finished getting through these. We understand this trade. So now let's go back here and then let's start working through these other updates. I say. And then oh yeah, that's the other thing we were doing. That was kind of a bigger. We got all the way through here. Didn't we? Yeah. So we got all the way caught up with the positions. So then on to June. This is where we start. And",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 70,
      "start_timestamp": "00:21:18",
      "start_timestamp_seconds": 1278.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1278"
    }
  },
  {
    "text": "say. And then oh yeah, that's the other thing we were doing. That was kind of a bigger. We got all the way through here. Didn't we? Yeah. So we got all the way caught up with the positions. So then on to June. This is where we start. And I oh, yo, you guys didn't even fucking, how could you guys betray me like this? I rely on you all to keep me on task on hand doing the right things at the right time. And you guys didn't tell me to pull up our fucking eight map. Any new ads to this? So we still don't have anything from Papa New Guinea. Or Madagascar. We're missing those for sure. We're still missing Iceland Greenland. What's this little place? The Faulkland Islands? Oh, no, I mean this one. South Georgia and South Sandwich Islands. Do you guys even know that this was a place? Is this? What do you guys think? Magnum says you have to have thick skin for the PP show. That's hilarious. That's good. I mean, but yeah, I mean, I spent most of my adult life in the in the Marine Corps dog. So I think thick skin is essentially all that I have. Why my skin is so fucking ugly. I need Google maps though. Google maps. And we need to go to this place, which is what? South Georgia and the Sandwich Islands. Is there anywhere that we can see from here? There",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 70,
      "start_timestamp": "00:22:40",
      "start_timestamp_seconds": 1360.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1360"
    }
  },
  {
    "text": "think thick skin is essentially all that I have. Why my skin is so fucking ugly. I need Google maps though. Google maps. And we need to go to this place, which is what? South Georgia and the Sandwich Islands. Is there anywhere that we can see from here? There is. Okay. Okay. So let's see. This looks like a little city. Let's see what they got going on here. Oh, god damn. Yo. This is like. Okay. Okay. This is, uh, this is next level, nothing. This looks like nothing, nothing. Wow. Oh, shit. We're inside. Okay. Dude, Google maps is so fucking cool. The Larsden. Yo, this is so sick. I love these kinds of things. Those kinds of places. All right. So they have a lot of rust. What are these people? Oh, this is like a tour. I don't, I'm not about to try to be like super racist or anything. I'm not a racist, but I'm guessing that these are Asian people. Where'd they all go? The reason I say that is more often than not, whenever I travel and I see people in like the same kind of raincoats like this, it's super frequently as Asian people. I'm guessing that they came in off this cruise ship and like a boat dropped them off. Whoever it is. But yeah, when we were in Iceland, we came across this massive tour group of Asian folks that were, let's see, hard to tell. I think people",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 70,
      "start_timestamp": "00:24:02",
      "start_timestamp_seconds": 1442.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1442"
    }
  },
  {
    "text": "as Asian people. I'm guessing that they came in off this cruise ship and like a boat dropped them off. Whoever it is. But yeah, when we were in Iceland, we came across this massive tour group of Asian folks that were, let's see, hard to tell. I think people there. This is crazy. Okay. I mean, that looks Asian to me. I think I'm on point. Yeah. When I went to Iceland and when I went to Norway, we came across two really big groups of like tour groups. And they were Asian people. And they all had like really nice kit and it was all the same color. Not red though. They were yellow and the other one. They don't look Asian. That's definitely not Asian. I love it how this dude has his face blurred out. And then they're just like fuck, fuck both of you. That's hilarious. Yeah, definitely not Asian. See, this is why like validating hypothesis is you can, yeah, definitely not Asian. That's a, that's a old white dude. See, perfect. Had a hypothesis, clearly disproven. She's thrown up gang signs. Who knows where she's from? I don't. EOS 70D. For 60D. I have one of those. Where are y'all from? Can't see. I want to know where you people are from. We're going on a tour with them though. This is kind of nice. It's that symbol. I don't know that symbol. Damn. This is crazy. This place is nuts. Very, very",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 70,
      "start_timestamp": "00:26:39",
      "start_timestamp_seconds": 1599.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1599"
    }
  },
  {
    "text": "have one of those. Where are y'all from? Can't see. I want to know where you people are from. We're going on a tour with them though. This is kind of nice. It's that symbol. I don't know that symbol. Damn. This is crazy. This place is nuts. Very, very cool. So that's grit to grit to grit to grit to whatever in. Oh, it's the red people again. These are different red people. Oh, I see what's going on here. They make them wear red so they don't fucking lose them. That's exactly what this is. This is so that they keep eyeballs on them. That's hilarious. Wow. So they literally, they put them in red so that you can fucking, you can fucking see them. Where's this? This is like a little loop trail. Now these people are in blue. Uh-huh. Fascinating. Very, very cool. All right. So what we need is to find somebody from here though. Is what that looks like to me. We need somebody from South Georgia. It looks like somebody said they had England here. I I'm in nook, Greenland. Misty groin. Is that true? Misty groin. Are you being honest or are you just, are you trying to get my hopes up? Don't play with my heart, Misty Island. Misty groin. Nook. Don't play with my heart. Hey, it's Roy Titty. What up, Roy Titty? I need to know if Misty groin is, is fucking with me or not. Because if we",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 70,
      "start_timestamp": "00:28:59",
      "start_timestamp_seconds": 1739.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1739"
    }
  },
  {
    "text": "you just, are you trying to get my hopes up? Don't play with my heart, Misty Island. Misty groin. Nook. Don't play with my heart. Hey, it's Roy Titty. What up, Roy Titty? I need to know if Misty groin is, is fucking with me or not. Because if we have somebody from Greenland, that's like a massive win in my world. But I'm scared to get my hopes up. Let's see what it looks like around. Nuke's crib. Yo, look at everybody. Wave. Make sure you take the time to wave to Misty groin. Misty groin says, do I sound like a jokester to you? No, I don't think so. Hey, yo, somebody hooked us up. Somebody said this on the last stream. That homie from there was, I forgot fucking homie's name. But they said that they were going to hook us up with somebody from the Middle East. So we got Ali from Iraq. Fuck yes. Ali, where in Iraq are you from? Don't say bagged that because we're going to start having fucking flashbacks and shit. But hopefully another town in Iraq. Where in Iraq? Roaring clitty says Misty groin, yo, I can't even say these fucking names anymore. Some people, they don't really like sometimes when I curse. But as I'm sitting here saying these names, I'm realizing that it's just out of control. Like I'm talking about Roaring titty, Roaring clitty, Misty groin, like we are. We're all over the map here. Babylon? Got",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 70,
      "start_timestamp": "00:30:58",
      "start_timestamp_seconds": 1858.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1858"
    }
  },
  {
    "text": "fucking names anymore. Some people, they don't really like sometimes when I curse. But as I'm sitting here saying these names, I'm realizing that it's just out of control. Like I'm talking about Roaring titty, Roaring clitty, Misty groin, like we are. We're all over the map here. Babylon? Got it. Cameron, thank you so much for the 5 Canadian that will go to the door to ash tonight. And we got Winnipeg. Winnipeg wrapping the set. All right, do a quick. See what's, see what the deal is in Winnipeg. All right, let's pick somewhere that looks cool. This looks like it would be rich people. Where are the homeless people here? This is where the homeless people are. Let's see if we can spot some homeless people. Okay, this looks like it just a nice little, this little park looks super gray. Don't love that for you. Super gray. Looking for the homeless people. Bet you there's one in there. Aha. I fucking told you. You knew it. Listen, I grew up, I grew up spending a lot of time in the Bronx, New York. I know exactly where the fucking homeless people are. Can always tell exactly where they would want to. Oh, now it's sunny. Here we go. Oh, now it's gray. Damn. Those are just people living their best lives. All right. So now we know what it's like around Cameron's crib. We visited Cameron. Got a tour right through here. We. All right. We",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 70,
      "start_timestamp": "00:32:50",
      "start_timestamp_seconds": 1970.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=1970"
    }
  },
  {
    "text": "where they would want to. Oh, now it's sunny. Here we go. Oh, now it's gray. Damn. Those are just people living their best lives. All right. So now we know what it's like around Cameron's crib. We visited Cameron. Got a tour right through here. We. All right. We can shut this down. I think we can shut this map down because I didn't see. Lycaster England. I think we have somebody from England, but I don't know where. Lychester, Kester, Lycaster. Oh, you fucking say it. Let's see. Oh, yeah. Maybe. Lester. Thanks, Nick. Nick, illo, who is this? Who fuck is it? Sneheel. Sneheel from Lester. I mean, it's not fucking Lester. Let's let's let's lie. Sester, lie Sester. There's fucking extra ease and shit. No, it's not Lester. I mean, I'm sure it's Lester. I'm sure you're correct, but I just I fucking absolutely hate when we disrespect letters like that. In the English language is terrible that way. I'm not saying English is good because English is not. Well, we're just disrespecting let we're literally disrespecting letters, right? Because Lester, there's a fuck what about this E? Even if we're going to pretend that this C is an S sound fine. Okay. Less Sester. There's a fucking E. I would be down if we said less Sester. That's okay. But Lester is just straight bullshit. It would be Lysester. So I'm petitioning to call it Lysester. But speaking of England, what's the beef between England",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 70,
      "start_timestamp": "00:34:48",
      "start_timestamp_seconds": 2088.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2088"
    }
  },
  {
    "text": "C is an S sound fine. Okay. Less Sester. There's a fucking E. I would be down if we said less Sester. That's okay. But Lester is just straight bullshit. It would be Lysester. So I'm petitioning to call it Lysester. But speaking of England, what's the beef between England and like the UK? Why do you guys? Why is it like such a big, big breakdown when we look at South and North here? What's the problem? I think y'all should just get along. Hey, Isle of Man is cool because there's a big motorcycle race that goes on there that's fucking crazy. Those dudes whip around these on 600 CC bikes. I think it's, I don't know if it's actually on this island, but it's called the Isle of Man, which is nuts. Okay. So we have a good, we have a good covering of this map. We have Greenland added. We still need a Madagascar, Papua New Guinea, something like this would be good. But we're filling in here. This is good. All right. Then let's close our map down and let's get to work. I feel like it's time to start getting to work here. Okay. Let's see what we have on the agenda. This we need to zoom out super far. And we have our workbook. Okay. So this will go here. This will go here. And what I'm going to do now is pick up from here and pick up with what trades he",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 70,
      "start_timestamp": "00:36:33",
      "start_timestamp_seconds": 2193.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2193"
    }
  },
  {
    "text": "Let's see what we have on the agenda. This we need to zoom out super far. And we have our workbook. Okay. So this will go here. This will go here. And what I'm going to do now is pick up from here and pick up with what trades he has. So at this point, we, I'm just going to put hold because I don't know when he bought to open. Right now he holds 120 K of the 21 June, 24, 20 calls. And when does he post this? Well, we know he started getting into these in the 20th of May. So 20 May, 20 May to what is that 21 June, 32 DTE. These are shorter term. These are much shorter term when he started getting into these. This is very, very different than most of his other entries from the time that he posted this. So he holds 120 K of the 21 June, 20 calls. He did that for 5, 6, 7, 5, 4. And this is when he started entering, started entering 31, 32 DTE. I already forgot because I'm an idiot. What was it? 32. Damn it. I knew it was a 50, 50 chance. It's the good old 50, 50, 50, 50 chance, 90 chance. I'm going to pick the wrong one. So this is, I consider this to be actually quite noteworthy. So if we plot out of curiosity, how can I do this simply? I could do it like this.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 70,
      "start_timestamp": "00:38:05",
      "start_timestamp_seconds": 2285.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2285"
    }
  },
  {
    "text": "50 chance. It's the good old 50, 50, 50, 50 chance, 90 chance. I'm going to pick the wrong one. So this is, I consider this to be actually quite noteworthy. So if we plot out of curiosity, how can I do this simply? I could do it like this. So this is, 495, 52, 107. Make this easier. 498, 458, 3. Better care my list with me. 94, 168, 229, 229, 138, 137, 138, I already got that one. I already got that one. 32. Fascinating. What do you guys think of this? This this to me looks like he fucking knows something. I have to be completely honest. That's what that looks like to me. That looks like he fucking knows something. Average is 180 DTE. There's literally two, there's two entries here that are sub 50 DTE. If this was 50 DTE, I would have bought it. Like that would be okay. Meaning it would fall more in line with this. This we know we can see back. This was clearly in earnings play. That's what this one was. So we can see that this is a one. That's fucking something man. I believe. I believe it's something. This I don't know though. Roryntady says yes, but what did he know? We'll take a look. I think we'll be able to have some ideas. But the reason I so let me be clear. I look at this and it's an orange in my mind. This is a",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 70,
      "start_timestamp": "00:40:12",
      "start_timestamp_seconds": 2412.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2412"
    }
  },
  {
    "text": "something. This I don't know though. Roryntady says yes, but what did he know? We'll take a look. I think we'll be able to have some ideas. But the reason I so let me be clear. I look at this and it's an orange in my mind. This is a it seems more likely than not. That's something is known. That's it seems like it. And I'm emphasizing the fact that it seems like it versus saying something like it is because it's still 32 DTE from when he started scaling in. So I do believe that that's topical. So let's go on to on demand. Let's go to this year. Let's go to 20 May. Pause it. You know what this looks like to me? This is 19 May. You know what this looks like to me? This man. I wonder. I'm going to have to grab the tinfoil hot though because I don't know. I can't prove this. I can't prove this. Wish that I could fucking filter it by what I want. 17 0 5 2 0 2 4. Doesn't let me do this. Oh no. Damn it. The tens. Let's do tens from the strike. And and 426. 426. 425. 424. 1. Yo. Yo. 424. This is. This is interesting. This is really, really interesting. 24 25 26. Dude. This. This looks like he tested a position. This looks like he tested a position and then replicated it once it worked. So if we go. The",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 70,
      "start_timestamp": "00:44:01",
      "start_timestamp_seconds": 2641.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2641"
    }
  },
  {
    "text": "and 426. 426. 425. 424. 1. Yo. Yo. 424. This is. This is interesting. This is really, really interesting. 24 25 26. Dude. This. This looks like he tested a position. This looks like he tested a position and then replicated it once it worked. So if we go. The 24 April. 1000 of the tens. We go. 25 April. Then there's 1 2 3 4 1000 more. We go to 26 April. 1 2 3 4 5 6 1000 on top of that. This looks like he was testing an idea. And this looks like. He started testing the idea. On the 24th of April. And then. It looks like his idea worked. So if we go to April 24th. This is where. Now I can't I'm not sure if he started testing it before this and this is when he started scaling. But the fact that this started on 24 April. Let me take a look at another reference period super fast. Let me go to the 20 or the 20 March. March. Go somewhere in here. More trades. More trades. This. This is fascinating. So. My best. My best assumption right now of what the cat. Of what the cat is doing. Is this looks like. He. Had an idea. I don't know why the idea started with an entry here. But it started with a light entry on the 24th. So let's see what happens is we move from the 24th to the 25th. That goes",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 70,
      "start_timestamp": "00:47:20",
      "start_timestamp_seconds": 2840.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=2840"
    }
  },
  {
    "text": "what the cat is doing. Is this looks like. He. Had an idea. I don't know why the idea started with an entry here. But it started with a light entry on the 24th. So let's see what happens is we move from the 24th to the 25th. That goes up. 25th. If he. He. I want to be super clear. He is in big air quotes. This person. Teams. To then add. And it looks like they add. Up to one, two, three, four thousand more contracts. That's the 25th. Let's go to the 26th. Up again. 26. We scale. One, two, three, four, five, six. These are in the money at the time now. Dude. Exactly what I think happened here. I can't prove it. Oh man. My fucking. My head is spinning right now. There's like a million things going through my mind. This looks like. This exit here. Looks like a test. So this is. One. Two, three, four, five, six, seven, eight, nine, ten. Comes down. This could be a fucking mistake too. Because then we buy right back in 30 minutes later. Huh. So. There's. This is so interesting to me for a lot of reasons. The first one is there's obviously something around this time frame that led to interest. So. I have to understand more around this time frame what was going on. But I think that this was testing an entry, meaning starting with a much smaller position and seeing how",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 70,
      "start_timestamp": "00:51:25",
      "start_timestamp_seconds": 3085.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3085"
    }
  },
  {
    "text": "of reasons. The first one is there's obviously something around this time frame that led to interest. So. I have to understand more around this time frame what was going on. But I think that this was testing an entry, meaning starting with a much smaller position and seeing how the market would react to the size and to the liquidity and most importantly seeing how the stock would react. My hypothesis here is starting to believe more and more that in this time frame, he didn't think or didn't know or didn't. It wasn't at a larger scale of how much he was influencing the price of GameStop. I think here he comes in fully knowing how much he can influence the price of GameStop. I think he knows that here. And I think what he's doing in this instance is testing the market response to this specific trade. Then I think he's testing the market response to scaling in at a much smaller size. And then I think he's testing the perceived movement of it from that point forward. So. Dr. Zayah says, how can a single trade influence the entire stock? It's a great question. So the way that this can influence the stock is on the 24th when he entered those were at the money. These tens were at the money. And if we look at the volume, let's take a look at a curiosity. The volume here was 4.8 million. The volume the day before",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 70,
      "start_timestamp": "00:54:43",
      "start_timestamp_seconds": 3283.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3283"
    }
  },
  {
    "text": "way that this can influence the stock is on the 24th when he entered those were at the money. These tens were at the money. And if we look at the volume, let's take a look at a curiosity. The volume here was 4.8 million. The volume the day before was 2.5. My guess is when this 1000 lot came through that triggered a few things to happen. The first is they likely were starting to hedge some of the calls. The second thing is I think that between the buying activity and the hedging of the calls that probably led to other market participants starting to think, oh, there's something going on here. Again, this is how I personally find trades as well. That's why I think this. So it's not that I know what's going on, why it's going on. I have no idea. But this looks like testing an exit on this and then buying in more because these were bought when they were in the money it looks like. So the really interesting part about all this is that my big assumption as it sits now before we go further into the rest of this, which will be informative for me. But my current hypothesis is at this point, he knows how impactful his trades can be. And I think he knows that his movements can move the stock. That's what I think. And it looks like there's a lot of little testing going on here.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 70,
      "start_timestamp": "00:56:19",
      "start_timestamp_seconds": 3379.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3379"
    }
  },
  {
    "text": "will be informative for me. But my current hypothesis is at this point, he knows how impactful his trades can be. And I think he knows that his movements can move the stock. That's what I think. And it looks like there's a lot of little testing going on here. If this is him, if this is him, I cannot confirm that this is him. But I find a couple really interesting components to this, where we start on the 24th of April and we're getting into 17 May explorations. And then if we take a look at the follow on trades when he did come back and post a yellow update, it's a very similar DTE on the original entry. So very interesting to me. Very interesting to me because there was none of this activity prior to this point in time and then the activity started at this point in time. So that's why I believe they're linked. Again, can't confirm it, but that's what I believe. So now let's see what happens to these. Let's go into May and they get unwound. 15th, 16th, let's actually track these now at a curiosity. So I'm going to move these down here. And I'm just going to do some scratch math. We'll put this over here. So then we have 24 April. This was at 121429. We don't have to worry about GME size was 1000. 3M is 114. This will be in thousands. Then we have 25 April.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 70,
      "start_timestamp": "00:57:41",
      "start_timestamp_seconds": 3461.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3461"
    }
  },
  {
    "text": "these down here. And I'm just going to do some scratch math. We'll put this over here. So then we have 24 April. This was at 121429. We don't have to worry about GME size was 1000. 3M is 114. This will be in thousands. Then we have 25 April. I see 0819. I see 1000. And then this looks like he all floated 145k worth. Then that happened at interesting. So 25 April. So that's what I'm going to do. So I'm going to do a sale order. A sale order comes in here. And then 25 April. Again, we buy back 082030. That movement's interesting. Because it looks like. Oh, this should be 19. This looks like he tested like a day in entrance before exit the next day in the beginning. And then entered right back in after it. So this looks like he's testing how the markets responding to these transactions. 25 April. Then 094833. That's here 1000 again. This is 140k. Then there's 25 April. 1232. 46. 1021. 25 April. 12. 46. 43. 1000. 146. This is scaling here. 25 April. For whoever this is. I think it's him. But 1249. 17. 1165. Then we have 26. 26. It's so 26 May. 07. 16. 16. 1000. You're okay. 08. 106. 25. 1000. 05. 0839. 56. 1000. 05. 220. 0857. 32. 1000. 25. 09100. 24. 1000. 227. 0908. 06. 1000. Minus 235. 09. 33. 31. 1000. 260. Nuts. Absolutely Nuts. And then let's take a look",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 70,
      "start_timestamp": "00:59:19",
      "start_timestamp_seconds": 3559.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3559"
    }
  },
  {
    "text": "have 26. 26. It's so 26 May. 07. 16. 16. 1000. You're okay. 08. 106. 25. 1000. 05. 0839. 56. 1000. 05. 220. 0857. 32. 1000. 25. 09100. 24. 1000. 227. 0908. 06. 1000. Minus 235. 09. 33. 31. 1000. 260. Nuts. Absolutely Nuts. And then let's take a look at here. Let's take a look at these on lines. 5 May. Verse 6. Wait, I'm in, I'm in it. This is April. 07. Then here we have 6 May. 07. 11. 10. We took down 5,000. And we took in 3 mil. 07. So this is our sale. 15 May. 07. There's 4 trades. So let's do this. 08. And this is. 08. 24. 4. 01. This is 1000. This is 2.38. 08. I'm just going to do minus 0. 08.27. 52. 1000. 2.3. 08. 30.20. 1000. 2.35. But 8.32. 1. 1000. 2.3. So this looks. It looks. Really, really interesting. Because what I'm seeing here. Is he tested. Selling a 1000 lot here. Then on the 6th he opened with trying to sell. 5,000. And my guess is he didn't get a price that he wanted. So because he didn't get a price that he wanted. He then scaled down into 1000 lots and tried to exit on these smaller sizes. That's my guess here so far. Let's all 15 May and then we have 16 May. The thing I'm going to do after this is take a look at all of the actual numbers and see. How",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 70,
      "start_timestamp": "01:03:40",
      "start_timestamp_seconds": 3820.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=3820"
    }
  },
  {
    "text": "scaled down into 1000 lots and tried to exit on these smaller sizes. That's my guess here so far. Let's all 15 May and then we have 16 May. The thing I'm going to do after this is take a look at all of the actual numbers and see. How they line up. So this is 16 May. So this is 12 16 49. 1000. 1.9. And. This is the same. 12 31 28 1000. Minus 1.91. Now I don't know what to make of these last two. These last three are a little weird. Let's do size at least 50 or something like that. I'm just going to make the assumption. I don't know how true it is. I'm going to make the assumption that each of these is actually tied to essentially 1000. I. I can't. Well, let's just do the math really quick. Let's see. So. Here. There's 6000 at the end of this. Here. There's 6000 again. This is a total of 12,000. And then. This is. Less seven. No, it's more than that. Oh, I'm an idiot. I was doing count. I'm so stupid. This is 11,000. We have to count this again really quick. Oh, it fortunately worked out because these are all 1000. So this is 11,000. So far. I guess it's just one of these is him somehow. I don't know which one. We could just make the assumption that there was another 1000 somewhere that we didn't track and there was",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 70,
      "start_timestamp": "01:09:44",
      "start_timestamp_seconds": 4184.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4184"
    }
  },
  {
    "text": "Oh, it fortunately worked out because these are all 1000. So this is 11,000. So far. I guess it's just one of these is him somehow. I don't know which one. We could just make the assumption that there was another 1000 somewhere that we didn't track and there was 13 and both of these represent the remainder of that. It doesn't really matter that much. Man. This is fucking interesting. Yeah, okay. So Dr. Zayah says that there's a meme spree. So we have to pull up those memes now. I definitely think we need to take a look at that. I'm going to grab another salt-sour water really quick because this is about to get busy. All right. We are back up. Vladimir says those are 17 May and 24. Why would you told them together? Yeah. So I'm just I'm eyeballing numbers. I'm not because I can't tell what's discreetly him, what's not him. This to me like moving in these 1000 lots, this all looks like more likely than not him. I just can't tell what's what. So I was trying to see if they work out in the aggregate and realistically they actually kind of do. Right. So if we looked at the total size for all of these, using all of them combined from the jump and we look at the exits in May, we can see that essentially what adds up here is what's here. So this to me looks like using two",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 70,
      "start_timestamp": "01:12:11",
      "start_timestamp_seconds": 4331.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4331"
    }
  },
  {
    "text": "do. Right. So if we looked at the total size for all of these, using all of them combined from the jump and we look at the exits in May, we can see that essentially what adds up here is what's here. So this to me looks like using two different expressions. That's my that's my current guess here. Now again, it's all this stuff is always open to interpretation and what we have to break through. I think the next big step here is for us to actually go through his, his posting. I want to see if we can glean anything from there because my guess is there will actually be some messages in there. That's the current guess. So. Vladimir says Gil was never on record buying anything other than monthly op-ex contracts. Yeah, I don't think that matters. Him being on record for like I guarantee you Gil is done a lot of things that you haven't seen. I understand using it as a reference and I think it's a smart way to think about references because I agree with you in general. That's the same way that I personally would look at it as well. The part that I'm departing is because I just, it looks like to me that even with this other trade here when he scooped some 3DTE options. Like this is a pretty stark departure as well. So just as this 3DTE and this 30 DTE is a departure, I don't",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 70,
      "start_timestamp": "01:15:08",
      "start_timestamp_seconds": 4508.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4508"
    }
  },
  {
    "text": "The part that I'm departing is because I just, it looks like to me that even with this other trade here when he scooped some 3DTE options. Like this is a pretty stark departure as well. So just as this 3DTE and this 30 DTE is a departure, I don't see why there couldn't have been a departure in expiration cycle. So, but I agree with you again, all of this is a guess. We don't even know if this is him. Blancwayze says maybe because weeklies are more likely un-head, no, that's not it, that's not it at all. He's disincentivized from going into the weeklies. In general, it looks like the weeklies themselves they're less liquid. So he would prefer those other contracts because he was building into bigger sizes longer ideas. So I generally agree with Offputin that he hasn't done non-monthlies before. I just don't think that necessarily he is relegated to them. So Offputin says look at 12, 15, and 20 strike he typically buys out of the money, not in the money. I think the problem there is you're getting too locked into a reference and I think that you're not adapting to the data as it fits. Because for example, he going off of like what he did before, he also never bought anything other than one isolated occasion options that were less than 50 DTE. This in here looks like a, and this is genuinely part of what I was expecting to",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 70,
      "start_timestamp": "01:16:29",
      "start_timestamp_seconds": 4589.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4589"
    }
  },
  {
    "text": "data as it fits. Because for example, he going off of like what he did before, he also never bought anything other than one isolated occasion options that were less than 50 DTE. This in here looks like a, and this is genuinely part of what I was expecting to see. This looks like a different overall approach. That's what I see here. This looks like somebody that's playing the overall value change in something. This looks like testing an idea. That's what I think this is. Don't know what, but I think the him typically buying stuff that's out of the money is completely fair. But I think the way that he traded in this period is different than what I see so far from this period. It literally looks like a general change in approach. So at least that's again, just loosely part of what I'm seeing so far is a general change in approach. Let me, I have to grab some drugs real quick. I forgot I skipped my dosing. Give me one sec. All right, we're back. Getting hot in here. I was to take top off soon. So, yeah, this looks like that. Now, let's take a look at the breakdown now between these. Look at April. I'm just going to color code them. So, this is one. Well, here's a 500 in here in a 798. So these are, so there's definitely some other positions that were built out that got split up. So",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 70,
      "start_timestamp": "01:18:07",
      "start_timestamp_seconds": 4687.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4687"
    }
  },
  {
    "text": "take a look at the breakdown now between these. Look at April. I'm just going to color code them. So, this is one. Well, here's a 500 in here in a 798. So these are, so there's definitely some other positions that were built out that got split up. So there's definitely more in here. But I see one, two, three, four, five, six, seven, eight, nine, 10 of these there. And then this is probably another one. And then one, two, three, four, five, the 15. Yeah, I mean, that's kind of a clean number as well. But it looks like 15. Fascinating. And that's fast. So, oh, the old, uh, so I know that amount of money he doesn't care about. Like, this would be, this would be inconsequential. Which is why I think this is him testing something. And then he unwinds a thousand here. It's hard to tell which thousand might have been unwound. It's essentially impossible. Well, let's just, let's make the assumption that he had, um, FIFO accounting because most people do. So that would be this minus, this, the, oh, I guess plus because it's a negative this plus this. What is it if I do negative out of curiosity? Creative, uh, yeah, okay. Absolute value of that minus that I visa them You know, I just want this to be scalable for whatever this ends up turning into. I don't know what yet. Let's almost 200 grand there. And then these are",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 70,
      "start_timestamp": "01:19:56",
      "start_timestamp_seconds": 4796.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4796"
    }
  },
  {
    "text": "if I do negative out of curiosity? Creative, uh, yeah, okay. Absolute value of that minus that I visa them You know, I just want this to be scalable for whatever this ends up turning into. I don't know what yet. Let's almost 200 grand there. And then these are all these are all eggs. So 3 2 3 8 2 3 5 2 3 5 2 3 5 2 3 5 1.9. And then these are all negative. Oops. I'm just going to kind of loosely eyeball what the rest of this looks like. This is five of them. So this would be not this one, but one, two, three, five, all these. Hey 32 damn you would have made a lot of money here. You made a whole lot of money here. That's not so bad. I'm just turning all these into the same format so I can. Newton's cool with us watching his video. So I'll pull that up in a little bit. Damn. I'm so fucking. I'm so curious now. This these I can get rid of. Let me start exiting here. So this equals this minus not this one, but this one one, two, three, four, five. I'm just going to build these in super fast. So it's easier for me to track. And this equals this minus this name here. One, two, and it's right. So this. This looks like almost 11 million. And I think it's a little bit more than that, to",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 70,
      "start_timestamp": "01:22:51",
      "start_timestamp_seconds": 4971.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=4971"
    }
  },
  {
    "text": "four, five. I'm just going to build these in super fast. So it's easier for me to track. And this equals this minus this name here. One, two, and it's right. So this. This looks like almost 11 million. And I think it's a little bit more than that, to be honest. So this looks like a test run to me. That's what this looks like. Let me take a look. I want to take a look now at his Twitter. I want to see if there's anything. That sticks out there. I forgot how to like quickly get to the bottom of this thing. Oh, the other thing. I'm going to take a look at this. Can you guys take me to work 24 April is please. On 16 April 21 is DME shares cost basis was 5518. Yeah, maybe I don't know. It could be. This we're looking for 24 April 24. They removed a couple for copyright. The last one with ET. Okay, where's ET? It's always hard for me to tell like how much he tweets. ET. I'm in media. The guy in the seat is the start. Okay. Oh, that's right. Wait, this is when he came back. I'm going to do anything before this. This was on 12 May. So this looks like take a look. We're getting in here 24 April. Had a couple test exits here and here. And then on six May, he made 2 million. And realize that this thing",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 70,
      "start_timestamp": "01:26:37",
      "start_timestamp_seconds": 5197.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5197"
    }
  },
  {
    "text": "he came back. I'm going to do anything before this. This was on 12 May. So this looks like take a look. We're getting in here 24 April. Had a couple test exits here and here. And then on six May, he made 2 million. And realize that this thing works. 12 May made this post. When is 12 May? The Sunday six May was the was the Monday before. I don't know what to make of any of that if anything. So to me, this looks like he was testing an idea. Yeah. And it lines up. Very, very well with the timing of these trades. The thing that doesn't line up well. Are the entry times. He has a lot more morning stuff here, which I can't explain. That's a hole in the theory compared to these. But my guess is I don't think he's weighing the time that heavily. I think he's generally trading early morning towards the close. That definitely holds true. And then I think the rest of it is probably just when he happens to be logging on. Like I don't think he's purposely trying to get on it like a specific time. I don't see why he would. I don't think he'd care. I mean, that looks pretty fucking clear to me, to be honest. That is some shit. Now what the fuck? 24 April. What happened on 24 April? I'm going to ask perplexity. Let me go into a new thing. I'm",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 70,
      "start_timestamp": "01:30:58",
      "start_timestamp_seconds": 5458.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5458"
    }
  },
  {
    "text": "don't see why he would. I don't think he'd care. I mean, that looks pretty fucking clear to me, to be honest. That is some shit. Now what the fuck? 24 April. What happened on 24 April? I'm going to ask perplexity. Let me go into a new thing. I'm going to ask all key news and events around GameStop. And it's stock on 24 April. I'm going to say why are you so surprised? I don't understand. I'm surprised for a couple of primary reasons. The biggest reason why I'm so interested now by this is I see a massive shift in approach. Massive shift in approach. This entire time frame is somebody that's trading this thing on a value perspective, thinking that something is going to grow in value, get bigger, just overall up kind of idea. That's what these trades all mean to me. The way that we're entering longer term positions, the way that we're scaling in and out, we're holding them for typically long duration of the trade. All of those things really lead me to believe a very specific approach, which is based on expected value in the future. This is a quite literal, complete departure from that complete departure. And it signifies between this time frame, a complete change in approach has occurred. Don't know what, but I can tell you that based on the trades I see coming back from 24 from his departure 2021 and 2024, assuming, and this is a",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 70,
      "start_timestamp": "01:33:23",
      "start_timestamp_seconds": 5603.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5603"
    }
  },
  {
    "text": "complete departure from that complete departure. And it signifies between this time frame, a complete change in approach has occurred. Don't know what, but I can tell you that based on the trades I see coming back from 24 from his departure 2021 and 2024, assuming, and this is a big assumption, assuming that this is him, which it fucking looks like it is to me, all of those conditions being the case indicate a significant change in overall approach. That's why I'm really, really surprised, slash interested in this change. GrowingTitty says it's kind of devalue, just short-term swing trading, not at all. I mean, I get your point, but it's not. And the thing is, is that we know he changes from being a value investor. He talks about it. So value doesn't materialize in a month. Value is the kind of thing that takes years. And again, signified by his first option is trade that we can trace back to being 495 days. So this is absolutely a value play. But then you can see as we start getting near and near in time, even to these trades in 2020, like as we look across this latest entry of trades, they come in massively in time, 168 DTE, 137 DTE. So the overall trend actually starts to contract in overall time here as we get near and near in his overall time for him doing this. Up here, he's doing, he did a stupid small little play",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 70,
      "start_timestamp": "01:35:37",
      "start_timestamp_seconds": 5737.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5737"
    }
  },
  {
    "text": "entry of trades, they come in massively in time, 168 DTE, 137 DTE. So the overall trend actually starts to contract in overall time here as we get near and near in his overall time for him doing this. Up here, he's doing, he did a stupid small little play with his, this was an earnings play. We already know that. But like, when he bought in here on 14 Jan 2020, 450 DTE, 190 DTE, then as we get into July, he start coming down 137 DTE. So the time frame started contracting a little bit. I think part of that just has to do with what options were open as time was passing, right? So the first time we were in the next primary exploration was that's far out in time. But this is a complete departure from that. This is literally a different approach. So that part is real interesting because then for me, it begs the entire question of what is the approach? We'll be able to see a little bit more detail of like what the approach is because there's something going on here. Ricky says, I mean, are we surprised his most recent trades are a lot more pump and dumpy? I mean, to be completely honest, they are. I don't think it's with the idea of. I don't think it's the idea of like trying to dump on retail. I don't think you do that. But I do think it's him understanding he",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 70,
      "start_timestamp": "01:37:18",
      "start_timestamp_seconds": 5838.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5838"
    }
  },
  {
    "text": "are a lot more pump and dumpy? I mean, to be completely honest, they are. I don't think it's with the idea of. I don't think it's the idea of like trying to dump on retail. I don't think you do that. But I do think it's him understanding he can move the market and playing the movements that he can do in the market. That's what I think. Because this is out here. Yeah, it's like 32 DTE and then when he, these are what? 20 made a 21 June. These other ones came in 24 April. Yeah, so those are also about a month. So I cannot help but find that also completely completely different. Because if you look at all of his trades here, he had one that was 52 DTE. And he had one that was three. And I actually think that the one that was a 52 DTE. Where is that one? This one. That looks like playing something. I don't know what. But he had one there. And then again, this three, we know exactly what that is. So all of this. They're typically trades that are greater than 100 DTE. Then we get two back to back series of 30 DTE trades. That's real interesting. That's completely different than the rest of the modus operandi that we see here, completely different. Which again, it harkens back to the idea that we have a change of approach. And this, this looks like measuring the",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 70,
      "start_timestamp": "01:38:45",
      "start_timestamp_seconds": 5925.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=5925"
    }
  },
  {
    "text": "two back to back series of 30 DTE trades. That's real interesting. That's completely different than the rest of the modus operandi that we see here, completely different. Which again, it harkens back to the idea that we have a change of approach. And this, this looks like measuring the impact. What happened on 6 May? Let's do this. Let's go to May. Ricky says like to everyone that isn't a blind diamond hands holder, I thought it was obvious. He was profiting off manipulating G, GME in his most recent trades. I don't it's hard to say with respect to like the manipulation that starts to get into like that terminology, a specific meetings and stuff. And that part, I'm not personally positive of. But I do see your point and I do broadly agree. Yeah. Patrick says, is it manipulation if there are a lot of un-hege calls and he is using that? There's not going to be a lot of un-hege calls. So. Another thing to keep in mind is I actually, and I think I talked to you guys in the discord. This isn't loading for some reason. I'm going to put you guys over on the second screen so I can close out and log back in. Sometimes that helps. So I'll put you guys over on the screen. I'm talking with one of my buddies, well, he is one of my friends, but he's much older. He's been in the market making business and",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 70,
      "start_timestamp": "01:40:20",
      "start_timestamp_seconds": 6020.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6020"
    }
  },
  {
    "text": "the second screen so I can close out and log back in. Sometimes that helps. So I'll put you guys over on the screen. I'm talking with one of my buddies, well, he is one of my friends, but he's much older. He's been in the market making business and options trading business for a really, really long time. And he, I, we spoke briefly a couple times and I spoke with him a couple of weeks ago about a couple things that I was finding as I was doing different research on the cat. I asked him about a meme stocks in general in how meme stocks have changed the market making space and how they react to stuff like that and whatnot. And essentially that boiled down to him saying that like in a broad perspective, market makers have gotten a lot more calculated with the risk that they'll take. Yeah, it looks like thinkorswim is being updated because it's trying to log in right now and it can't. So that's that other goes. So yeah, I that goes back to sad, Drake, I don't think that there is a lot of un hedged calls in something like game stop. I think that they would have they would have been hedged if they thought that there was some sort of risk there. Blancwaysy says he's not manipulating on low volume under the right conditions, a reasonable sizeables position has some decent impact. Yeah, but again, Blancwaysy, this goes",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 70,
      "start_timestamp": "01:42:12",
      "start_timestamp_seconds": 6132.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6132"
    }
  },
  {
    "text": "game stop. I think that they would have they would have been hedged if they thought that there was some sort of risk there. Blancwaysy says he's not manipulating on low volume under the right conditions, a reasonable sizeables position has some decent impact. Yeah, but again, Blancwaysy, this goes back to like what are we defining as manipulation because that that that is like if that's the thesis for the trade that's not trading something under the guys of like a change in fundamental value. That's obviously trading the expected movement of something based on a broad market effect and impact. So yeah, I don't I don't know what people call or define manipulation as personally, but I think that that's part of the effect here. So it looks like it looks like this is down. So what I'm going to do is grab good old I'll actually use trade view because I'm trying to get a little bit better with using trade view. Really or trading view maybe I should call the right name first that could be a good start. I definitely need to change this settings though. How do I change the settings so that it's dark. There we go. Better and then let me go to game stop. How do I change the settings on this so that the this is dark in the background like burning my retinas. This. No, you guys know I don't know how to use this thing right click got",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 70,
      "start_timestamp": "01:43:18",
      "start_timestamp_seconds": 6198.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6198"
    }
  },
  {
    "text": "dark. There we go. Better and then let me go to game stop. How do I change the settings on this so that the this is dark in the background like burning my retinas. This. No, you guys know I don't know how to use this thing right click got it. Thank you. Right template. Click the settings top right settings. Canvas. Black. Much better. Thank you. Ridlines. Where are the grid lines there we go. That's cool. That's great. Fantastic. Thank you guys. That's super helpful. All right. So now let's go back. Is it not display of day we have to change all those things don't you. Text needs to be white. Line should be like that. Okay. So now I can see there we go. I'm going to get caught up. Ricky says. I'm not using manipulation in a negative context he knows the post making impact on this. That's right. That's a lot of things. I don't think that that's a poor thesis. The honest. Roy and Clint East says if you buy a shit ton of in the money calls the market maker whoever sold him is probably going to hedge that's correct. That's definitely correct. It's also if you buy stuff that's like at the money they typically will start hedging a little bit. Lonzo as he says if he was testing if they are hedge I don't think he's testing if they're hedged. I think it's really important to like decouple the different",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 70,
      "start_timestamp": "01:44:46",
      "start_timestamp_seconds": 6286.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6286"
    }
  },
  {
    "text": "correct. It's also if you buy stuff that's like at the money they typically will start hedging a little bit. Lonzo as he says if he was testing if they are hedge I don't think he's testing if they're hedged. I think it's really important to like decouple the different participants here. I don't think the market makers are the main people that he's trying to test here whether or not they're hedged or not. I think that he's probably seeing what broader positioning looks like. That's my guess. I don't think that he's playing a bunch of games with market makers. Market makers have a pretty defined purpose and it's not that expansive. But other institutions that might be systemically short something like GameStop that's a completely different story. I think at least. I need to add. How do I add some shit? I just need to add. Moving averages at least. Do they have no I don't want that ribbon might be fine. Normally they'll have like an envelope which is away from me to do to. Because I think I only get like a certain number of indicators or whatever. On this intercolon of the ribbon. Yeah, okay. This will work. And then I need to change. So we want a 10. 20. 50. Probably one 50 or 180. 150 is fine. The colors are inverted which is the worst. So now I have to flip these. And. 50. 50. Perfect. So. Francis says I do think",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 70,
      "start_timestamp": "01:47:18",
      "start_timestamp_seconds": 6438.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6438"
    }
  },
  {
    "text": "okay. This will work. And then I need to change. So we want a 10. 20. 50. Probably one 50 or 180. 150 is fine. The colors are inverted which is the worst. So now I have to flip these. And. 50. 50. Perfect. So. Francis says I do think that those are tests for his Algo maybe cooking his own Algo to beat the head. I don't think he's running an Algo that's not what that looks like to me. Algos would be so fast. And he's also not going to be able to essentially create an Algo that would outpace the like what a purpose of an Algo is. So I think. The movement that we saw in April. That looks like him. Expecting something to happen here. Or expecting the impact of his trades to be something. So. I don't know what. If how what the thought was around this 13 May 14 this time frame. Is that part's interesting because if we look at the unwind the unwind for the positions is actually like not good in with respect to that it's it's quite mistimed. So the unwind started six May. Which would have been here. And then we see the next unwind was on 15 May. So he would have done the same of most true apes which is hold through the peak. Start unwinding on the 15th and then the 16th take the rest down on the on the decline that's it that's that's",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 70,
      "start_timestamp": "01:48:45",
      "start_timestamp_seconds": 6525.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6525"
    }
  },
  {
    "text": "And then we see the next unwind was on 15 May. So he would have done the same of most true apes which is hold through the peak. Start unwinding on the 15th and then the 16th take the rest down on the on the decline that's it that's that's what that is. So. From that perspective it's really interesting because it's clear. Again, this is not a perfect time thing. Like that's what I see here. This is not a perfectly timed system. I don't think that this is some sort of. You know, understand that the tea leaves. And projecting some sort of. And then you know, you know, the specific date like that's not what this is because if that's the case even with him building the position on 24. The 26. He wouldn't have sold anything on the sixth and he sold a good bit of it on the 6th. The other thing is he wouldn't have sold on the 15th on the 16th. If again, that is the case where he knew something was going to happen on the 14th or whatever it is. And then he would have sold that at all. I think that. He thought something could happen from his trades. I think something did start to happen from his trades. I don't know. Do we know when I think we started looking do we know when he bought those shares. That would be highly informative here actually when the 5 million",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 70,
      "start_timestamp": "01:50:47",
      "start_timestamp_seconds": 6647.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6647"
    }
  },
  {
    "text": "that. He thought something could happen from his trades. I think something did start to happen from his trades. I don't know. Do we know when I think we started looking do we know when he bought those shares. That would be highly informative here actually when the 5 million shares came online. I think that we have like windows and stuff, but do we know the specific dates. Let me look at the dark pool. Okay, we're looking. Let's look in April. Okay. Let's sort this by premium. So this. We had 5 million shares here on two June. Based on what I see here to June. Let's go to March. Okay, so quiet in March. Generally quiet in April. Very busy in May. Hmm. Very busy. So one of the things I was trying to test here. I was very curious if he bought shares before he bought those options. The reason why I wanted to test that is because one of the theories I've heard I've heard thrown around is that he kind of is using the the share buying or the option buying to cause a wave that he's then using for the other side of the transaction. And I don't. I don't see that from April at least before those April trades. Because these are very small. So I don't think. I don't think he did that here. Now for his. May trades that started on the 20th. And I think that's the argument to",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 70,
      "start_timestamp": "01:52:06",
      "start_timestamp_seconds": 6726.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6726"
    }
  },
  {
    "text": "the transaction. And I don't. I don't see that from April at least before those April trades. Because these are very small. So I don't think. I don't think he did that here. Now for his. May trades that started on the 20th. And I think that's the argument to be made. That he could have been participating in this time frame when it got busy. Let's go to the beginning though. Well, it's kind of annoying. This is let me go to the next page. Let me close this window down. What did I say the 20th? So let's look at this before the 20th. Yeah, so this doesn't look like. Nothing on the 17th. Let's take a look at the. 16th. I know of. May. I think it's interesting. Super, super interesting. So what? This doesn't look like he bought shares at least who knows, but it doesn't look like he was sizing into shares massively leading into this period. So I think this was through options. I can again also see and confirm that this is not if this is him. This is not perfectly timed. So I think that the reason why I highlight the timing thing is because so many people. I think really are of the opinion that like he has this crazy calendar that's like mapped out these dates. And that's I don't see evidence of that. I don't see evidence of so far at least in this comeback period is I feel",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 70,
      "start_timestamp": "01:54:54",
      "start_timestamp_seconds": 6894.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=6894"
    }
  },
  {
    "text": "thing is because so many people. I think really are of the opinion that like he has this crazy calendar that's like mapped out these dates. And that's I don't see evidence of that. I don't see evidence of so far at least in this comeback period is I feel like he knows he has an impact on the market. And I think that he's assessing the impact and trading the perceived impact there. Because for a stock that's completely quiet to start having the options chain built out like that is is pretty detectable. I told you guys this is where I first caught wind of GameStop from my scanners was the beginning of man. I think it was the third or the fourth something like that. So this is when I started looking at playing GameStop myself because I could just see that it was becoming activated right. And that's different though. Then what it was doing for significant periods of time prior like massive massive periods of time prior. So I. I don't think. I don't think that there's like specific. Specific dates though. I don't see that. Because the exit here again from like a specific date perspective is also mistimed. Now let's take a look. What time is it? Oh shit. I got to get my dinner order off. Whenever I'm doing this time is like a fucking like a fucking vacuum like a vortex vacuum. I'm stoked for dinner tonight. I'm purposely getting shitty",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 70,
      "start_timestamp": "01:57:14",
      "start_timestamp_seconds": 7034.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7034"
    }
  },
  {
    "text": "date perspective is also mistimed. Now let's take a look. What time is it? Oh shit. I got to get my dinner order off. Whenever I'm doing this time is like a fucking like a fucking vacuum like a vortex vacuum. I'm stoked for dinner tonight. I'm purposely getting shitty food. We're getting a place called crispy burger. So that I can get some burgers and then some chicken fingers. There's a barbecue place in New York that we used to go to and love called dinosaur barbecue. And I just found that you can get the dinosaur barbecue sauce online. So I ordered them and they got in yesterday. So I needed to get a meal that I could do a shit ton of dipping and all these different sauces. So I'm very excited for that. Off food says looks like you bought this 5 million shares on May 19 to 29 based on his cost basis. I don't. I think that's too hard to say because like the probability of him moving in and out of things is so high that I think it's going to be difficult to peg that down. So could be like I think your thesis is completely viable. I think it very well could be that but there's no way to confirm or deny it. It's kind of one of those things that I would earmark as an idea, but it doesn't really impact a whole lot. I don't think. Roy and Clint",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 70,
      "start_timestamp": "01:58:45",
      "start_timestamp_seconds": 7125.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7125"
    }
  },
  {
    "text": "your thesis is completely viable. I think it very well could be that but there's no way to confirm or deny it. It's kind of one of those things that I would earmark as an idea, but it doesn't really impact a whole lot. I don't think. Roy and Clint East is when you say mistime. Do you mean that perfect timing would be holding them right up to X free? No, no, no, no. I mean better timing would be essentially that the exits with respect to the movement of the underlying right like better timing would have been exiting on the 14th or even exiting on the 13th, 14th, 15th. Right because when I look at this, the first exit that happened here is 6 May and that was a 5,000 unwind. So if we take a look at 6 May that's here. So this is a little bit of a pop for sure right made a ton of money no doubt. But not is anywhere near as much as what would have been made if we had a date right like if we have some sort of date that we are super convicted in. Then we would play that date. So yeah, that's why I don't think that there's like a specific date that he's playing here. There's no artifact of that. Even the fact that we have two exits on the 15th and 16th reiterates the fact that there is no date because if there were",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 70,
      "start_timestamp": "02:00:22",
      "start_timestamp_seconds": 7222.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7222"
    }
  },
  {
    "text": "play that date. So yeah, that's why I don't think that there's like a specific date that he's playing here. There's no artifact of that. Even the fact that we have two exits on the 15th and 16th reiterates the fact that there is no date because if there were a date, let's say the date was supposed to be the 14th or the 15th. Then that's fine. But then whenever the move happened around that date, then the exit would happen, but it didn't the exit was spread over a couple days. My guess is he was waiting to see if it started to rebound back up it might have. So that's my that's my best guess as I look at this. Roing Titty says, how would we know how to follow black route? I don't think that's happening at all. Yeah, I don't think that's it. Again, I think I don't think Roing Kitty has like this crazy access to information that nobody else has or as like a super secret decoder ring that he's using like I really don't think that. I think based on what I'm seeing in his trades and at this point, I am starting to feel more confident in speaking about what I can see from again, not an opinion perspective, but like an evidence based perspective based on looking at we literally have looked at all of his old trades now. And it looks like he's playing movement now this recent change",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 70,
      "start_timestamp": "02:01:27",
      "start_timestamp_seconds": 7287.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7287"
    }
  },
  {
    "text": "starting to feel more confident in speaking about what I can see from again, not an opinion perspective, but like an evidence based perspective based on looking at we literally have looked at all of his old trades now. And it looks like he's playing movement now this recent change is interesting because before he clearly was playing value. Now he's playing movement. So. That's a little bit of a change. I don't think he's using F T D's. I really don't I think he knows about them. And I think that he's I think he probably integrates them. The problem with F T D's is that they don't work all the time. So I don't think he's basing it on F T D's for that reason. If he was using F T D's, there would have been a lot of other triggers that may or may not have worked. Yeah, I don't. I don't think the F T D's is the big thing here. To me says they work all the time, half the time. Yeah. That's the problem again. And that's one of the things like when Newton and I when we discuss things back and forth, I think sometimes Newton is a little bit too much in terms of confirmation bias in terms of trying to see what he wants to see. Even when we did a few live streams together, there were instances that I highlighted for the conversation of the live stream because it's very",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 70,
      "start_timestamp": "02:02:36",
      "start_timestamp_seconds": 7356.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7356"
    }
  },
  {
    "text": "think sometimes Newton is a little bit too much in terms of confirmation bias in terms of trying to see what he wants to see. Even when we did a few live streams together, there were instances that I highlighted for the conversation of the live stream because it's very easy historically to look back and say like, oh, yeah, you know, big volume here, big jump here. And obviously there was a move. But what I encourage him and everybody to do is when you're analyzing these things is to analyze the signal by itself and to assess the efficaciousness of the signal. Right. So we can look at either volume expansion, F T D's and we can run a regression to see how effective they predict the movement and I've done that and they don't. There's definitely a correlation to be clear with the movement a lot of times that there's movement. These other things do move. I don't think it's a causal relationship. I don't think that the F T D movement is now forcing the movement in GameStop. I do think there's a relationship and I think it can exacerbate it. I think it can start it. I think that there's a lot of relationship intertwined there. But I don't think when we've looked back at these other periods where either there was massive volume expansion for massive changes in F T D's. I didn't see a clear signal from those. So yeah. And Vladimir says",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 70,
      "start_timestamp": "02:04:18",
      "start_timestamp_seconds": 7458.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7458"
    }
  },
  {
    "text": "it. I think that there's a lot of relationship intertwined there. But I don't think when we've looked back at these other periods where either there was massive volume expansion for massive changes in F T D's. I didn't see a clear signal from those. So yeah. And Vladimir says this shouldn't be that difficult. His yellow account was under 204 million to June. What are you talking about when you say this shouldn't be that difficult. What is this? Just out of curiosity. The impure to says doesn't always work, but they're meaningful. Yes, I agree. They're very meaningful and they're important. I think they're very important. I think they're a part of this whole puzzle. The main thing I'm just highlighting is I don't think they're predictive. That's that's an important element. Now again, are they related to movement? Sometimes when they happen, I absolutely think so when we can see evidence of it. The problem is is when I'm assigning something predictive capabilities. It needs to have some sort of consistency in its ability to predict a future movement. And I don't see that. That's the main problem with using like F T D's as the like a predictable pattern, so to speak. Now I do think that we very likely. And I mean, this is the interesting thing going forward. We have to I'll have to check out that Newton video maybe tomorrow or something like that. I would like to go through and see what",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 70,
      "start_timestamp": "02:05:19",
      "start_timestamp_seconds": 7519.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7519"
    }
  },
  {
    "text": "a predictable pattern, so to speak. Now I do think that we very likely. And I mean, this is the interesting thing going forward. We have to I'll have to check out that Newton video maybe tomorrow or something like that. I would like to go through and see what he's thinking from his from his, you know, from his thesis, because what was his last date? I think he had a big date on like the eighth of August. Right. Wasn't there a big one in August that he was thinking. I don't remember what it was. Do you guys remember? I'm trying to see if it's that highlighted eight eight. Yeah, and it doesn't look like anything happened here. The prior day clothes was 20 83 and then the open was 21 with a high of 2188. So yeah, that didn't really do anything. Again, so even said, the way that you frame that right it jumped a little, I think that's that's confirmation bias that's looking for and perceiving. What you're wanting to see because I look at the clothes before it was 20 83. The open the next day was 20 2101. So if I look at the clothes to the high 20 83 and a hit a high of 2188, it moved a dollar. Right. So that's using the prior clothes from 87 to in a that's giving it the benefit of using the high of the next day, which realistically. You wouldn't necessarily use",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 70,
      "start_timestamp": "02:06:55",
      "start_timestamp_seconds": 7615.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7615"
    }
  },
  {
    "text": "at the clothes to the high 20 83 and a hit a high of 2188, it moved a dollar. Right. So that's using the prior clothes from 87 to in a that's giving it the benefit of using the high of the next day, which realistically. You wouldn't necessarily use the high there, but I mean, again, I would give it the benefit of the doubt for sure. So the main thing is, and again, like this is supposed to be an op x tailwind, which is supposed to have a thing. And then there's a bunch of the the T dates assigned to it. I think he has a calendar somewhere in terms of like how effective the different op x. That's actually one thing I would be interested to look at. Did this one. No. No. No. No. Well, on suesie says I don't think it's in the sheet anymore. Oh, damn it. It is. Is he had a whole thing tracking. I don't know why he would get rid of that. Why would he get rid of the. The prior movements. I don't know if it's just buried somewhere. Let me text them. Did you get rid of, I'm just going to ask him where is the table in the, what is this thing in the GME. I'm going to ask him where is the table in the GME. I'm going to ask him where is the table in the GME. Let's see. I'm curious about that.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 70,
      "start_timestamp": "02:08:37",
      "start_timestamp_seconds": 7717.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7717"
    }
  },
  {
    "text": "of, I'm just going to ask him where is the table in the, what is this thing in the GME. I'm going to ask him where is the table in the GME. I'm going to ask him where is the table in the GME. Let's see. I'm curious about that. Yeah, so we'll see if that's in here because I wanted a, I wanted to look at that. Oh, there it is. Never mind. Big dog. DAWG. So this was. August. So this is supposed to be. That's the problem. I just, I get. I struggle with that. I actually don't agree that that's like a op-ex tailwind here. Let's go to, because there's going to be a spike in volume. That's for sure. But that's because it's just in op-ex, right? It doesn't have a gap here. It's essentially within the same candle. I mean like a small gap. I wouldn't consider that anything. But. Yeah. I think is like I wouldn't consider this something necessarily like a, like a tailwind hitting volume actually contracted. Yeah. Interesting. Yeah, I just don't see it there. Oh no, that was in 888 of 22. He has an updated. Okay. I see. So he didn't count this one. I can look in 22 just out of curiosity. Where the hell is 2022? Here it is. I just want to see what he's looking at. August. And he said it was August 5th. Yeah, I got it. Yeah, this 100. I would consider",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 70,
      "start_timestamp": "02:10:41",
      "start_timestamp_seconds": 7841.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7841"
    }
  },
  {
    "text": "So he didn't count this one. I can look in 22 just out of curiosity. Where the hell is 2022? Here it is. I just want to see what he's looking at. August. And he said it was August 5th. Yeah, I got it. Yeah, this 100. I would consider that for sure. Not the fifth, but definitely the eighth, the following Monday. The fourth to the fifth. I don't think there was much of anything. But this, this into this there definitely was definitely an expansion and volume. No doubt. But not significant 17 and a quarter to 17.8. Like that's not a big change. So Jimmy says like I asked Chattu Pt to explain what a top op x tailwind is that's kind of like a, it's it's it's not really anything. The idea behind a op x tailwind is that when you go into an options expiration, there's going to be an amalgamation of trading activity that's going to move the stock price up. That's why he refers to it as a tailwind. But op x is just options expiration. Now whether or not options expiration is a tailwind or something else, you know, that's a that's a whole other whole other story. But this one I can totally see some elements of so that that I'm following, following along with. Interesting. Okay. That Lauren says quadwitching day did a thing that was hilarious, which is also funny because quad it's not even called quadwitching anymore for",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 70,
      "start_timestamp": "02:13:14",
      "start_timestamp_seconds": 7994.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=7994"
    }
  },
  {
    "text": "a whole other whole other story. But this one I can totally see some elements of so that that I'm following, following along with. Interesting. Okay. That Lauren says quadwitching day did a thing that was hilarious, which is also funny because quad it's not even called quadwitching anymore for anybody that's curious about it. I did a video talking about it, since like an options derivatives focus topic. Here's a video about quadruple whiching it's essentially just triple whiching now and it's because of the way that different expiration cycles have aligned. So it's still I mean, you could call it quad, but it's really not the other thing is with so many additional explorations now opened up the overall impact of triple whiching quadruple whiching is severely diminished. It used to be a much bigger deal when it would happen and there was only a handful of explorations available. That's a completely different story, but that's not so much what it is anymore. Alright, so let's take a look at. Were there any changes in his positions here. Not until here, so let's just skip to that. Actually, no, let's not get lazy. We're already here. Let's just do the thing. It's not even that many, I'm be lazy Eric. Let's do region, region, region, region, region, slide this off so I can easily see. Not too many left. I have a number five four six three one six one dot five five. So, is 2927 six four",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 70,
      "start_timestamp": "02:14:37",
      "start_timestamp_seconds": 8077.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8077"
    }
  },
  {
    "text": "do the thing. It's not even that many, I'm be lazy Eric. Let's do region, region, region, region, region, slide this off so I can easily see. Not too many left. I have a number five four six three one six one dot five five. So, is 2927 six four hundred dot five six. And then value is 289276. 400 dot five six. Okay. And then there's no change to anything here. Six June. We have a TG of three 82 five one three one six one dot five five. We have cash of 29409. Oh, five. Cash one. Interesting. Oh, I did it quite that much. And value is at five 86459. Oh, five. Okay. Okay. We have. EG is 31. That's fucking crazy. 31 513. This goes back. There are no fucking dates. I don't think man. You don't go from 382 million in gain down to 31. 409. Oh, five. Value to 35. 459. Oh, five. That's wild. And then let's go to 13 June. So TG now is 5136. 4654. 999. We're at six. Three. Four. Three. Seven. Two. Four. One. And then two. Six. Eight. Four. Five. Two. Four. Got a one. And then here. We had an exit. And then we also have ad. Here. This is bought to open. Four million. And then we have a couple of. And then we have a couple of. Okay. So. Let's see what happened to these. I have to get off in a minute. I don't",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 70,
      "start_timestamp": "02:16:34",
      "start_timestamp_seconds": 8194.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8194"
    }
  },
  {
    "text": "We had an exit. And then we also have ad. Here. This is bought to open. Four million. And then we have a couple of. And then we have a couple of. Okay. So. Let's see what happened to these. I have to get off in a minute. I don't want to rush through this. So the last thing that we're going to have on the agenda for this. Then is to analyze. I'm taking a note here. We're going to get a note here. It's going to be in the next. So, it's going to be in the next thing. R.K. 13 June. Options. Exit. But it'll be the next thing. Vim Pyridus says SEC and lawsuits would happen if it was an actual pump and dump. Hence, holding. And the meme about SEC coming. Yeah. The, in his case, I think the idea of pump and dump would be really, really blurred because like even the dudes at fucking whatever that penny stock trading pump and dump were the one dude pled guilty and was obviously convicted and like the other dudes fought it and they got out on some bullshit technicality even though they're fucking guilty, I think they, I don't want to say their name. They, to prove something like that is very difficult. And, but if you read through that case, it was pretty fucking clear that they were very purposefully trying to mislead people and manipulate people with somebody like the cat. The only",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 70,
      "start_timestamp": "02:20:04",
      "start_timestamp_seconds": 8404.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8404"
    }
  },
  {
    "text": "think they, I don't want to say their name. They, to prove something like that is very difficult. And, but if you read through that case, it was pretty fucking clear that they were very purposefully trying to mislead people and manipulate people with somebody like the cat. The only thing you could even attempt to say is that he knows if he posts a meme, which is true. I think so. If he posts a meme, GameStop is going to move. Like I think he knows that. So because he knows that, I think it opens up a different conversation then around, like ultimately what that looks like in terms of any sort of manipulation, but I think you probably will struggle to call that manipulation. So yeah, it's a, it's a tricky one. Ricky says, what are they going to do? He uses memes as evidence? Well, the funny thing about that stuff too is like sometimes I noticed like when they depose rappers and stuff, they, they'll use, they'll use like rapper lyrics as evidence, which is hilarious. So yeah, it's very interesting. I don't really know what to make of it. I'll make a video tomorrow about just kind of like the latest of GameStop and kind of where we're sitting now. Of note though, one of the things I wanted to do before we balanced is do you guys have a list of any primary thesis or DD or ideas behind like what people think",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 70,
      "start_timestamp": "02:21:44",
      "start_timestamp_seconds": 8504.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8504"
    }
  },
  {
    "text": "about just kind of like the latest of GameStop and kind of where we're sitting now. Of note though, one of the things I wanted to do before we balanced is do you guys have a list of any primary thesis or DD or ideas behind like what people think is going on here? Because as I'm doing this, I'm starting to create what I believe is going on. But I'm very curious if other people like what the most popular analysis is on what's going on because I want to take a look at those. I want to start pulling those out. Tellerbox theory, yeah, well, seller boxing is a thing. It's not even really a theory. But that, I mean, that's probably what was going on with GameStop in Cohen's intervention. That's for sure. A region on SuperSlanke has the cat error theory. Yeah. So for any of those kinds of theories, if you guys can either email it to me or just drop it in the discord outliertrading.io. So you guys can shoot me an email with a link to whatever it is so that I can take a peek at it because I want to start looking through them. Because once we wrap up the trade here, that'll be the next step, I think, is to better understand what's going on now. What happened between 21 and 24? That kind of thing. So we will see how that goes. All right, gang, that wraps me up.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 70,
      "start_timestamp": "02:23:03",
      "start_timestamp_seconds": 8583.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8583"
    }
  },
  {
    "text": "looking through them. Because once we wrap up the trade here, that'll be the next step, I think, is to better understand what's going on now. What happened between 21 and 24? That kind of thing. So we will see how that goes. All right, gang, that wraps me up. Awesome catching up. Always enjoy doing these sessions with you all. If you need anything, hit me up. Always around. And then if there's anything that you want me to take a look at for the GME, well, kind of it'll be a market outlook video tomorrow. But I'll include a piece on GME just because I haven't covered it specifically in a little while. So we'll take a look. Be an outlier, be an ape, be an outlier ape, whatever makes you happy. See you guys later.",
    "metadata": {
      "video_id": "Sb-2npBXR-A",
      "title": "Analyzing Roaring Kitty's Trades Pt7 | GameStop Analysis Live Ep15",
      "url": "https://www.youtube.com/watch?v=Sb-2npBXR-A",
      "upload_date": "",
      "duration": 8714.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 70,
      "start_timestamp": "02:24:27",
      "start_timestamp_seconds": 8667.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sb-2npBXR-A&t=8667"
    }
  }
]