[
  {
    "text": "I own a trading firm and operating. And how much did you make prior that you make this past year? Oh, you don't want to know. Down about three and a half million dollars. You've sent these in. These are fun to look at. So this guy's interesting. There's two things I want to point out. One, we're missing all context. We don't know that assets under management. So he said he's down three and a half million. But what does that mean as a percentage? Is he down 50, 80, 10, that matters a lot when we're assessing a hedge fund. The second thing is, there it is. He's just a dude. He's running a hedge fund. He has money. But he's still not doing well this year. There are plenty of retail traders that are up this year. Not saying that that means retail is better than hedge funds. But more often than not, you can just find your way into an index ETF passively invest in outperform these people without paying their fees, being outlier see all later.",
    "metadata": {
      "video_id": "sg-eeTeukYg",
      "title": "DOWN $3.5M",
      "url": "https://www.youtube.com/watch?v=sg-eeTeukYg",
      "upload_date": "2022-12-11T22:21:38Z",
      "duration": "PT51S",
      "channel_name": "",
      "description": "📩Join the Outlier Insights Investing Newsletter:  https://www.esinvests.com/contact\n🌍Shorten the Learning Curve and Create Your Edge. Join on Patreon: https://www.patreon.com/erik_esinvests\n\nRESOURCES:\n►Interested in 1 on 1 Coaching? Reach out! https://www.esinvests.com/coaching\n►Benzinga Pro - Get 35% Off using Promo Code esInvests35: https://benzinga.sjv.io/esin\n►Grab Some Outlier Merch: https://www.bonfire.com/store/the-outlier-store/\n\nSOCIAL:\n►Follow on Twitter for Investing News & Stock Market Updates. https://www.twitter.com/esInvests \n►Join the FREE Outlier Community Discord.  https://discord.gg/hYGZUEJpve\n\n VIDEO DETAILS:\n#investing #stockmarket #trading \n\nABOUT:\nMy name is Erik, I'm a Marine veteran and self-made millionaire investor. I've spent over 30,000+ hours honing my craft and outpaced the market for the last 14 years. My goal is to share quality information and connect others to resources - without the BS. \n\nThe Outlier Community is built to connect you with other driven people who are pursuing or have achieved financial outlier status. We get together to capitalize on the hive mind to share ideas, explore stock market news, cover investing basics, options trading, portfolio management, investing psychology, strategy, money management, live trading ideas, workshops, and more. None of us find success solely on our own - here we create it together. Welcome to the Outliers!\n\nI am not a financial advisor. All content is shared for educational and entertainment purposes only.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sg-eeTeukYg&t=0"
    }
  }
]