[
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "What's up, Alleyers? Take a trip with me to 4 November 2025. I want to walk you through a recent trade in RGTI and give you a walkthrough of what this thing was. What happened, why I did, what I did, we actually just did a deep dive for like 90 minutes on trade management in the outlier pro community. This is actually a good example, I think, to talk about some of the most important concepts of trade management in the broader context of natural trade and a trade review. So one of the strategies in my stable is breakdowns. What I'm typically looking for in these are things that have some sort of downside velocity can often be caused by post earnings move, stuff like that. But in this case, there was some really interesting behavior in RGTI. So again, this is back in 4 November and I want to show you a few things. The first thing is if we take a look at this move here, this move is like over 275% and like five trading weeks. Now underlines can have that kind of move, just because it went up a lot doesn't mean it's going to come down. It does mean I'm going to watch the move either for an upside player, a downside play. So one of the key things that I look for is consistency through a consolidation and how it behaves. A good example of a consolidation is this little zone right",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 97.06,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "to come down. It does mean I'm going to watch the move either for an upside player, a downside play. So one of the key things that I look for is consistency through a consolidation and how it behaves. A good example of a consolidation is this little zone right here. You can see very, very clearly that price has this leg up. It starts to digest the consolidate sideways during this consolidation very, very frequently. You will find that the bodies of the candles will get real, real small. That's volatility coming down. And then sometimes there will be a more aggressive style move up and out. This would be a break out. So this is an upside breakout. If we take a look at how price behaved during this breakout, broke out saw this individual chopping up. And what I mean by that is it wasn't really run inside ways. This was just absolutely running to the upside day over day. Even on the day that it was down up here, still maintains in upside trend. It then has this really aggressive continuation of the move. We see this red day and then we see this red day. This is where I'm starting to look or how does it behave. If it's going to behave normally for something that's going to continue in aggressive climb, I would expect to see it oscillate sideways like here and then move up. If not, then I pay attention. And I see",
    "start_timestamp_seconds": 81.1,
    "end_timestamp_seconds": 182.58,
    "start_timestamp": "01:21",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=81",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "This is where I'm starting to look or how does it behave. If it's going to behave normally for something that's going to continue in aggressive climb, I would expect to see it oscillate sideways like here and then move up. If not, then I pay attention. And I see how it behaves during these down moves. One of the things that I thought was really pertinent here is the fact that prior to all of this, it didn't really have much of a consolidation in there. So what I'm doing is I'm seeing where it is price start to grab a foothold. So we get this pretty aggressive move down. This would have been a completely viable spot or this to enter to the downside. I just hadn't. And it consolidates sideways. Then we see this red day and this beginning of a gap down that's rallinging that towards the end of this day actually got even weaker. So if I fast forward us to 1230 Pacific time, you'll see what I'm talking about. You see how it a little bit weaker on the day. It was accelerating down. This is where I entered. And the trade was in RGTI. This was an opportunity driven trade. What I mean by that is I didn't have some sort of specific portfolio need. Although I did generally want to find some short delta's, which is why I was looking for downside stuff, but it wasn't like an imperative. It is actually",
    "start_timestamp_seconds": 164.74,
    "end_timestamp_seconds": 255.46,
    "start_timestamp": "02:44",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=164",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "RGTI. This was an opportunity driven trade. What I mean by that is I didn't have some sort of specific portfolio need. Although I did generally want to find some short delta's, which is why I was looking for downside stuff, but it wasn't like an imperative. It is actually pretty okay. And the broader profit mechanism here, I just outlined for you, is breakdowns. And this is a near term driven price behavior. I already gave you an overview of some of the signals that I was using to measure. But that's essentially price volume moving averages and analyzing those in combination with one another. That led to this entry on four November when the underlying was at like 3577, I bought to open 95 of the 30 puts for $4.15. Now this trade was put on for a couple different reasons. The main thing is I wanted downside and I wanted to play it to the downside. But I actually wanted to put the position on in larger size. This is well less the total debit here was well less than one percent of the account. I was limited by liquidity. The market there as I was getting my orders through was starting to oscillate wide now. And in something like this, that can actually be a little bit of a Debbie Downer. And it's a reality, not even when you're trading like big sizes, like this is a moderate size trade. But even this becomes a little",
    "start_timestamp_seconds": 234.5,
    "end_timestamp_seconds": 330.82,
    "start_timestamp": "03:54",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=234",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "my orders through was starting to oscillate wide now. And in something like this, that can actually be a little bit of a Debbie Downer. And it's a reality, not even when you're trading like big sizes, like this is a moderate size trade. But even this becomes a little prohibitive as that spread wide is out. So the total size here is well within risk tolerance of the portfolio. But nonetheless, I don't define the risk in the trade by the size. I define it by where I'm going to manage it in this context, which is based on the stop. The spot that I was expecting to start scaling out is around in here, like this 43 and a quarter. This is what I consider a soft stop. This is where if there's not some sort of very specific reason for me to get out, I intend to get out. And the hard stop is effectively right above these highs. So it would have been right around like 44 or 75 something like that. But the way that I treat soft stop hard stop is really, really simple. The soft stop 85, 90 percent of the time I'm going to get out at that point. Unless there's a very strong reason for me to stay in. If you're a newer trader, you kind of have to avoid that because newer traders are really susceptible to this idea of the disposition effect, which is letting losers run too much.",
    "start_timestamp_seconds": 313.94,
    "end_timestamp_seconds": 391.3,
    "start_timestamp": "05:13",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=313",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "going to get out at that point. Unless there's a very strong reason for me to stay in. If you're a newer trader, you kind of have to avoid that because newer traders are really susceptible to this idea of the disposition effect, which is letting losers run too much. You want to avoid that. Now let's fast forward to 21 November. Over this time frame, I'll give you like a couple snap shots all fast forward like a week and a half. And I'll give you a quick play like play on what went down. So this is the day that I got in and it started a small little consolidation and then was gapping down, gapping down. All I'm doing in here is slowly starting to slide the metrics of the trade down. So what that looks like is the original hard stop is up here. The soft stop is in here. I just take those down here. And what I'm doing is I'm decreasing the total risk of the trade, but allowing it to stay on. Sometimes when stuff is moving like this, if the trade was at full size, I would have taken a partial profit, but because the trade wasn't at full size, it didn't make sense for me to take any sort of partial profit in it so far. But that's another way that I would manage specifically for this profit mechanism of breakdowns. We get this move to the downside and what I",
    "start_timestamp_seconds": 379.38,
    "end_timestamp_seconds": 460.18,
    "start_timestamp": "06:19",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=379",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "but because the trade wasn't at full size, it didn't make sense for me to take any sort of partial profit in it so far. But that's another way that I would manage specifically for this profit mechanism of breakdowns. We get this move to the downside and what I start asking myself is like, where is price likely to go? And we get through this consolidation right here at this point. There's a tiny little bit here, but not much at all. I wouldn't consider this a consolidation at all. So the next real spot that right now it looks like, which again, is on the 14th of November, is like in here. Let's fast forward another week really quick. And we'll go to the 21st November. You can see now that price started to build out a consolidation zone, actually in here. So now there's a new volume note emerging and the game becomes either I'm going to be wrong with a break above this new consolidation or it's going to be game on to the downside. If we get a downside continuation, which it started to look like it was going to run that direction. Now if we take a look at the 24th of November, you'll see that we start actually running the other direction. So this consolidation is now gone on for eight days. A little bit sloppy of a consolidation with the range, but still broadly there within kind of like this 23 and",
    "start_timestamp_seconds": 443.94,
    "end_timestamp_seconds": 535.46,
    "start_timestamp": "07:23",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=443",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "we take a look at the 24th of November, you'll see that we start actually running the other direction. So this consolidation is now gone on for eight days. A little bit sloppy of a consolidation with the range, but still broadly there within kind of like this 23 and a half up to the 27. And this near term strength signals to me that something is going on. So what I do at this point is actually close most of the trade. It take down about 85%. And I close those for $6.90. The total credit on those is about 55k and the realized P&L is 22k. I want to be very specific around the metrics here. The reason why I took down what I did was partially because these options are losing money through theta and decreasing volume as this is going on. So my thesis is still intact, but time is passing. That's the first factor. Now what I'm not doing is saying like, oh, let me leave a little bit on so that this is how smarty and then I'll just let it go. That's not how I trade at all. To me it actually makes no sense to do that because how money in this context is my money. I otherwise could have closed these these 15 for $6.90 since as well. I could have made way more money on these, but I chose not to because I wanted to see if we get a",
    "start_timestamp_seconds": 516.42,
    "end_timestamp_seconds": 617.7,
    "start_timestamp": "08:36",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=516",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "no sense to do that because how money in this context is my money. I otherwise could have closed these these 15 for $6.90 since as well. I could have made way more money on these, but I chose not to because I wanted to see if we get a continuation or if we end up moving in the wrong direction and I eventually have to get stopped out. But my stop doesn't move at this point and it's just a waiting game. My settle and monitor how this thing is going to behave. I'm going to come out of on demand now because actually the trade came down today on the 4th of December on this candle. We were previously looking in here and I continue to trend sideways. Then we see this very, very clear upside move and that's exactly where the rest of the trade comes down. So I take down the remaining 15 contracts. I realize a P&L of 435 bucks. None of that matters. The dollars for this individual trade don't matter. What I'm doing is I'm figuring out where I want to start scaling out where I want to take profit or loss is based on my thesis and it's based on the specific strategy. That's why I write strategy outlines that are very defined I scope out what I'm trading so that I can come up with ideas because this specific strategy for example has a win rate anywhere from 45 to 55%.",
    "start_timestamp_seconds": 596.26,
    "end_timestamp_seconds": 688.1,
    "start_timestamp": "09:56",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=596",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "based on my thesis and it's based on the specific strategy. That's why I write strategy outlines that are very defined I scope out what I'm trading so that I can come up with ideas because this specific strategy for example has a win rate anywhere from 45 to 55%. It's not a super high win rate. So what that means is I need to be very, very thoughtful about where I realize P&L because I need to keep at least a 2 to 1 in order for me to make a meaningful amount of capital on these. One to one would be fine. But again, that's effectively walking out at Breakeven. That's insufficient. So I'm really looking for at least 2 to 1 and that's why these get managed where they do because that feeds positive data samples into the strategy that if I continue to manage that way long term will ultimately make money. This walked me out up about 22k and it was not that long of a trade about a month, which is about a 57% return on a VESA capital. This individual position was a really, really simple downside continuation that breaks a couple normal themes. One of those is you know, take a some set of your profit down after a move or set a really, really tight stop loss. Like those kinds of things can be fine, but they need to be made in tailor to the strategy. Otherwise, what you're doing ultimately",
    "start_timestamp_seconds": 669.14,
    "end_timestamp_seconds": 769.62,
    "start_timestamp": "11:09",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=669",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 788.0
  },
  {
    "video_id": "SlisA7fCzRM",
    "title": "I Risked $40,000 on RGTI Long Puts - Here’s Exactly What Happened",
    "text": "themes. One of those is you know, take a some set of your profit down after a move or set a really, really tight stop loss. Like those kinds of things can be fine, but they need to be made in tailor to the strategy. Otherwise, what you're doing ultimately doesn't make sense. This is a breakdown profit mechanism. I have a strategy outline. It's defined very purposefully. So that's I can maximize profit when these conditions occur. You should do the same being out there. See you later.",
    "start_timestamp_seconds": 748.66,
    "end_timestamp_seconds": 783.86,
    "start_timestamp": "12:28",
    "video_url": "https://www.youtube.com/watch?v=SlisA7fCzRM",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SlisA7fCzRM&t=748",
    "chunk_index": 10,
    "word_count": 89,
    "upload_date": null,
    "duration": 788.0
  }
]