[
  {
    "text": "What is up everyone? Another GameStop update because the volatility won't quit. So this is from the 19th of June. I want to walk through what the volatility was yesterday. What it's looking like today. Take a walk through the options chain with you guys and then answer a few questions that I got in from a couple of the last videos that I think are great questions. And hopefully they will help us look at options more in depth and have a better capability to analyze markets with them. That's the idea. So 19 June volatility was at 207 85 after the close right now. We have about 13 minutes before the close. So markets not quite closed yet. And when I took this screenshot, maybe a little less than 10 minutes ago, the 20 June front expiration volatility was up to 247. Again, mine blown the fact that this is kind of scorching up that much is still absolutely wild to me. Look how far out the implied volatility is starting to increase. What I like to do is compare the previous chains and see how far out do I have to go before there's not much change. And realistically, you have to go out 365 days to the 20 June 25s. These are 103 65 against 102 43. So these went up marginally. But there's massive, massive, massive volatility expansion within these shorter term expectations. Again, this has gone from 207 to 247. This has gone from",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=0"
    }
  },
  {
    "text": "And realistically, you have to go out 365 days to the 20 June 25s. These are 103 65 against 102 43. So these went up marginally. But there's massive, massive, massive volatility expansion within these shorter term expectations. Again, this has gone from 207 to 247. This has gone from 161 to 189. We're seeing volatility expand. There's no if ants or butts about that. Now you guys had a lot of really interesting ideas in the comments of the last video, because I asked your opinion, why is this happening? I'm still trying to figure it out. I don't have a definitive answer for you. And I'm not going to pretend like I have one. I think that's a disservice to everybody. I have tons of ideas on what it could be. But my ideas don't really matter. What matters is what I can objectively see and share that with you guys. As you know, my goal is not to spread hype or fide. It's to share information and then let you interpret it. However you so choose. So sticking straight to the facts, massive expansion in volatility. No doubt about it. As I look at the volatility smile, there's another really interesting function. Here, you'll notice on the put side, the volatility cracked above 1300. Now it's over 1500 on the put side. Now a couple of people were talking about this question right here. Hey, something's going on 125 calls. Ivy just succeeded 900 great eyeballs. Unfortunately,",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:01:31",
      "start_timestamp_seconds": 91.73333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=91"
    }
  },
  {
    "text": "there's another really interesting function. Here, you'll notice on the put side, the volatility cracked above 1300. Now it's over 1500 on the put side. Now a couple of people were talking about this question right here. Hey, something's going on 125 calls. Ivy just succeeded 900 great eyeballs. Unfortunately, this doesn't mean as much as you think it might. I'll explain to you why when market makers are making markets, they have to make qualitative assessments about their risk. So when we look at really, really far out of the money options, we price those typically way more rich because there's way more risk in holding that position. So when we go all the way out here to the 125's that are bid at a penny offered at two, we're over 1000 Ivy now people are thinking, man, this means that we got to be going up right. It actually doesn't that's that's really not what this means. What it means is there's absolutely a perception of risk to the extremes. This is what we would call fat pales. And in kind of statistical terms, we have a normal distribution curve. Markets do not represent normal distributions. They have what we call skew in kurtosis. This is not a stats class. Not going to bore you with it. The fact of the matter is is we get extreme moves way more frequently than a normal distribution would project for us. So if I give you an example of the",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:03:03",
      "start_timestamp_seconds": 183.46666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=183"
    }
  },
  {
    "text": "what we call skew in kurtosis. This is not a stats class. Not going to bore you with it. The fact of the matter is is we get extreme moves way more frequently than a normal distribution would project for us. So if I give you an example of the really far out of the money puts here, notice the implied volatility on the super far out of the money put 1700. That is because there is a perception of way more risk super far out. And this is also one of the biggest problems with buying these really cheap far out of the money options is because they're so expensive. They are priced so rich for what they are. And I know that sounds weird because you're like, well, dude, it's a penny and a half. How rich is that on a relative basis? Super rich mega rich ultra rich cannot be more rich. Very rich. So what I'm highlighting is this is a pricing functionality of markets. The market makers are going to get their pound of flesh to take on what they perceive as risk. And that's exactly why you will see this in the far out of the money options. Now to be clear on a relative basis and something else that you guys may or may not know, when we come down here and look at the smile, it's exactly what I'm looking at. I know that some of you guys think that, you know,",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:04:35",
      "start_timestamp_seconds": 275.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=275"
    }
  },
  {
    "text": "of the money options. Now to be clear on a relative basis and something else that you guys may or may not know, when we come down here and look at the smile, it's exactly what I'm looking at. I know that some of you guys think that, you know, it's easier to see in the chain and maybe so. But when you look at this stuff enough, it's exactly what I'm seeing, right? Because if I go to these 125s, which are way out here, I can see what the IV is. It's a thousand and 38 right? I can see that that's what the smile shows me all in one spot. But the smile also shows me that the put side is way, way more rich. This still is noteworthy. And this is because of the way that game stop behaves. What that means is it does have the ability to pop to the upside. If you go back to some of the videos I did last week, the beginning of this week, the call side was way more rich than the put side. That means the market was anticipating significant upward movements. It was pricing them into the options. But we're seeing this kind of normalization where the put's are way more rich. And kind of to help maybe prove this point a little bit more, let's go to something like Apple. Apple, big company moves around, but not like a ton. And if we take a",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:06:06",
      "start_timestamp_seconds": 366.93333333333334,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=366"
    }
  },
  {
    "text": "the options. But we're seeing this kind of normalization where the put's are way more rich. And kind of to help maybe prove this point a little bit more, let's go to something like Apple. Apple, big company moves around, but not like a ton. And if we take a look at the super far out of the money puts, they're at 2000 IV. It's the same function. If we go to the super far out of the money calls in this case, it's only 250. Why is that? Because on a relative basis, the market fears the downside way more in carrying this position. So it's demanding a massive premium on how they're pricing the vols in these super far out of the money options. That's one of the down the downfalls of using super far out of the money options. Is on a relative basis. They are exceedingly expensive. So now as I take a look at the options chain, as I typically do with you guys, there's a few things I'm seeing. The very first thing I'm seeing is take a look at the number of calls traded today. However, this time it's different, especially from yesterday. Look at how many of those are being entered in at the offer and above. 39 this is bullish skew. Then if I look at the puts side and I see 33 of those puts came in at the bid. These are selling puts again, also bullish skew. So it's",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:07:38",
      "start_timestamp_seconds": 458.6666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=458"
    }
  },
  {
    "text": "Look at how many of those are being entered in at the offer and above. 39 this is bullish skew. Then if I look at the puts side and I see 33 of those puts came in at the bid. These are selling puts again, also bullish skew. So it's not easy to say again, definitively what this means to me. It just looks like people trying to really take advantage of this crazy high volatility. That's what I see as far as the reason for the volatility. We're still trying to figure that out. There's all these different ideas between the FDs, between these other ETFs that might be surrogately shorting, GameStop and that has a relationship here potentially. All sorts of ideas, which are kind of fun to track down and keep an eyeball on. Just right now there's no definitive answer as far as I can see. Now the last thing I want to mention is when I take a look at this other question, which was a good question is with all the options at 2025 and 30 expiring tomorrow. Do you have any guesses what will happen to the stock after hours if it closes above? It's a great question. And to me, there's enough liquidity in the market right now for market makers to be able to cover their positions. That's my guess. So as I look at the 20s, the 25s, we can see we're getting a bit of a rally right now.",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:09:10",
      "start_timestamp_seconds": 550.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=550"
    }
  },
  {
    "text": "above? It's a great question. And to me, there's enough liquidity in the market right now for market makers to be able to cover their positions. That's my guess. So as I look at the 20s, the 25s, we can see we're getting a bit of a rally right now. That's up a little over 3. But these are already at a 93 delta of one delta. So what that tells me is the market makers in these kinds of positions. They're already going to be essentially fully hedged coming into the expiration. Now this is if they're not playing the shell game, which they might. That's hard to say. But from a standardized procedure, my assumption would be that as these option getting further further further in the money, that the market makers have plenty of time, especially in this scenario with the recent equity offering to scoop up. Their protection as needed to fully hedge these positions as they would want. That's my guess. Shell game could be going on again, really, really difficult to tell. We have to wait and see exactly how the price behaves going forward. So another wild day, another really busy day for game stop in terms of volatility. We see again, this crazy expansion. So I'm going to be keeping a really close eye on it to see where we go from here. As always, if you have any questions or anything you want me to take a look at, let me",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:10:42",
      "start_timestamp_seconds": 642.1333333333333,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=642"
    }
  },
  {
    "text": "game stop in terms of volatility. We see again, this crazy expansion. So I'm going to be keeping a really close eye on it to see where we go from here. As always, if you have any questions or anything you want me to take a look at, let me know. I love looking at this stuff with you guys. See you all later.",
    "metadata": {
      "video_id": "sMmB3FoCwtI",
      "title": "GME Call Volatility Explained",
      "url": "https://www.youtube.com/watch?v=sMmB3FoCwtI",
      "upload_date": "",
      "duration": 534.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:12:13",
      "start_timestamp_seconds": 733.8666666666667,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=sMmB3FoCwtI&t=733"
    }
  }
]