[
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "Sounds good. What's up, Outliers? Welcome back to that layer podcast. We have a familiar face, Andrew Mac. He was on a little while ago, and we covered a lot. As you can tell, I'm on a slightly different set up. I am traveling right now, checking out the frozen landscape of Alaska, which Andrew, you're in a typically pretty cold area too if I'm not mistaken. So this is nothing new to you. Is that about right? Yeah, we just had two feet of snow dropped on us today. So you're in good company today, Eric. There it is. Awesome, man. I am absolutely stoked to catch up again. Last time we spoke a lot about some core fundamental concepts of trading, options trading, edge, sports betting, sports betting in relation to options trading, developing models. And I've been on a recent kick where I'm trying to connect a couple more dots, specifically as we were just talking, like the late stage beginner, early stage intermediate, which is all just kind of random terminology, doesn't really mean anything other than the fact that I'm expecting the conversation to be more for people that already know what derivatives are, what markets are, like that kind of stuff. And we can move a little, a little past those concepts. So the first thing that I thought would be really, really cool to discuss broadly is right now, it's towards the end of November of 2025. And if you look back over",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 80.32,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "markets are, like that kind of stuff. And we can move a little, a little past those concepts. So the first thing that I thought would be really, really cool to discuss broadly is right now, it's towards the end of November of 2025. And if you look back over 2025, what are some of the things that you have found that have worked well? And some of the things that haven't worked well and feel free to bounce between equity markets and sports betting at your leisure. I know that you're involved in both. Yeah, I mean, we should probably stick to trading and financial markets to the extent that we can just for the benefit of your general audience. But the one thing that came to mind immediately as you said that was MOC, Market on Close, just that how much that has faded compared to the kind of wild West days when we had zero DTE options for every single day of the week. And you had some really, really big bursts and rebalancing events at the end of almost every day. And there were some really interesting opportunities with that where you know, you're picking up some dirt cheap options because there's zero time left on the clock. And you could watch these things go significantly into the profit to the tune of 5, 6, 10, 12, X. In the last like minute, two minutes of the day. So it's very stressful. It's very, very high",
    "start_timestamp_seconds": 62.92,
    "end_timestamp_seconds": 161.84,
    "start_timestamp": "01:02",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=62",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "some dirt cheap options because there's zero time left on the clock. And you could watch these things go significantly into the profit to the tune of 5, 6, 10, 12, X. In the last like minute, two minutes of the day. So it's very stressful. It's very, very high blood pressure type of an activity, but very much in effect. And you've watched that sort of slowly wither away and die over the last, I don't know, six months or so, something like that. You still get the occasional, we still see the occasional burst. But it tends to be more mechanical, it tends to be like an end of the month effect, it tends to be new all-time highs. Think, you know, there's some kind of other catalyst other than just the MOC. So that's something it sticks out as like that used to be, you know, a real powder keg. And now not so much. I usually don't even stick around to see what happens in the last 10 minutes of the day. What's worked well? Well, I mean, that sort of contextual depends a little bit on what it is that you're trying to do. Long vol has been working really well for the last month or so at least, right? What you're seeing right is that as the VIX is elevated, right as we get past 2021, 22. When a straddle implied break even gets broken, we tend to see a little bit of a",
    "start_timestamp_seconds": 142.84,
    "end_timestamp_seconds": 232.4,
    "start_timestamp": "02:22",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=142",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "vol has been working really well for the last month or so at least, right? What you're seeing right is that as the VIX is elevated, right as we get past 2021, 22. When a straddle implied break even gets broken, we tend to see a little bit of a trending activity towards the second standard deviation, rather than a reversion back into the straddle implied break even. And so you've seen trades that sort of take advantage of that effect in the last month were quite well. But that's, again, I don't think that's anything magical as the VIX starts to come down, we get back below 20 into that kind of like 16 is range. You tend to see more reversion back into the straddle implied break even, so it's just one of those, one of those market dynamic things to be aware of, whether you're a long vol or whether you're short vol. Two questions. The first one for the market on close effect, which is funny because it's actually one that I trade on both sides of the coin, actually. And typically not right on close for the short side, but a little bit before that. When, what is the mechanism that you stumbled across that? One of the things that I'm trying to help traders learn for themselves is creating like this baseline understanding of markets and then looking for things that just kind of like weird, but that's hard to do when you don't",
    "start_timestamp_seconds": 216.16,
    "end_timestamp_seconds": 309.88,
    "start_timestamp": "03:36",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=216",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "When, what is the mechanism that you stumbled across that? One of the things that I'm trying to help traders learn for themselves is creating like this baseline understanding of markets and then looking for things that just kind of like weird, but that's hard to do when you don't know like a deep level of baseline and then like what weird it is. So can you just give us like a quick overview of even how you came across, how the market behaved towards market on close? And then some of the ways that you determine if there is something viable there for you. Sure, so something that I've said a couple of times is that the best effects start by noticing something weird as you just alluded to rather than diving into the data and hoping to find the effect that way. It's usually better to notice it as an observation and then to sort of investigate. Most of my best ideas have come that way, so it is what I would recommend. You have to keep your eyes open and that means that you're gonna spend a lot of time looking at stuff that turns out to be nothing. That's just sort of part of the game when you are a treasure hunter, right? So with the MLC, what I do, like one of the things that I have on my screens at all times is the full options chain for zero DTE, SPX. I also have",
    "start_timestamp_seconds": 291.36,
    "end_timestamp_seconds": 374.56,
    "start_timestamp": "04:51",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=291",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "be nothing. That's just sort of part of the game when you are a treasure hunter, right? So with the MLC, what I do, like one of the things that I have on my screens at all times is the full options chain for zero DTE, SPX. I also have the cues and I have yes future options as well. But so just watching that with some other things, you're watching the spreads at the end of the day and you're watching obviously the spreads are starting to get quite wide as the wall starts to pick up and that's not necessarily anything just market maker saying, hey, go away. We're not really interested in paying you out a massive amount of money for these things or something crazy happens. So it's kind of a fuck off spread, right? They're just widening it out to tell you to piss off. And that's fine. But every now and then you notice that the spread that they have widened it out to to get you to piss off wasn't wide enough. And the thing kind of breaks past the break even even on the widen spread. And so you sort of make a note of that. Like they widened this out and it wasn't enough. It kept going and it looks like it would have done. That one would have done three X. So you make a little note of that. Three X even with the widen spread, whatever. And you know,",
    "start_timestamp_seconds": 355.72,
    "end_timestamp_seconds": 435.88,
    "start_timestamp": "05:55",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=355",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "a note of that. Like they widened this out and it wasn't enough. It kept going and it looks like it would have done. That one would have done three X. So you make a little note of that. Three X even with the widen spread, whatever. And you know, what day it was and you notice there were any catalysts on the economic calendar that day blah, blah, blah. And over time you start to sort of, okay, it looks like maybe there's something here. Maybe there's a way to take advantage of this. And then on the weekend, you might go into the data and then actually try and see if you can find something that indicates that you're on to something, right? But that really that was how it came across demo-seating. It's funny because when you do this for a while, exactly you say, it's kind of how you come across most stuff, right? It's just like you're like looking at something and then you see something. I find a lot of times when I'm speaking to newer traders a common concern which is completely fair is that of, like, how do I know if what I'm seeing is something viable versus if it's something that's just kind of, you know, once in a while, this end of day move exceeds what they're pricing the bit us spread at. You mentioned an important part of that that I want to double-click into which is you have",
    "start_timestamp_seconds": 422.68,
    "end_timestamp_seconds": 497.92,
    "start_timestamp": "07:02",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=422",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "I'm seeing is something viable versus if it's something that's just kind of, you know, once in a while, this end of day move exceeds what they're pricing the bit us spread at. You mentioned an important part of that that I want to double-click into which is you have this observation, you have this thing that you're like, this looks kind of interesting. And then you talked about, like, over the weekend or obviously whenever doing a little bit of data analysis to try to contextualize it. Can you talk about that process a little bit? Like, what are you looking for when you're doing that analysis? Well, you want to try and take a look at, for example, the spread widening versus like what actually happened. What was the realized move? Because you'll be able to see, like, hey, are they effectively widening these spreads out enough that they're negating the opportunity to pick a direction on these things or to take the other side, like you said? And what you're going to find is, you know, there'd be sometimes where they've got it covered and there's nothing to do in there. And then there'll be other times where it looks like they didn't widen it nearly enough to cover the opportunity. And so what you want to do, at least what I do, and this is sort of a creative thinking process, right? You try to put the critical mind aside while you're brainstorming and being creative",
    "start_timestamp_seconds": 477.96,
    "end_timestamp_seconds": 560.68,
    "start_timestamp": "07:57",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=477",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "where it looks like they didn't widen it nearly enough to cover the opportunity. And so what you want to do, at least what I do, and this is sort of a creative thinking process, right? You try to put the critical mind aside while you're brainstorming and being creative because you can always be critical after you have an idea. But you start with a sort of creative mindset and you say, okay, here's one where they didn't widen it enough. What are some things we can associate with that that make us clues for when this could happen again? So like the day of the week and we just start trying to brainstorm and say, okay, let's try to find some associations that we can use to maybe try to find other times where this could happen. And then you go back and try to critique it. You try to knock the idea down after you've sort of built up a hypothesis, right? So it's, you know, you start creative and then we get analytical and critical. And, you know, it's going back and forth between those two modes that allows you to generate an idea and then discard it or stress test it, right? It's funny. You started talking one of the things I took a note on that I wanted to follow up on is this idea of balancing knowing about something versus doing because you could spend weeks and weeks right trying to analyze this",
    "start_timestamp_seconds": 545.04,
    "end_timestamp_seconds": 622.6,
    "start_timestamp": "09:05",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=545",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "discard it or stress test it, right? It's funny. You started talking one of the things I took a note on that I wanted to follow up on is this idea of balancing knowing about something versus doing because you could spend weeks and weeks right trying to analyze this effect and understand all the nuances and all this kind of stuff meanwhile, it might not be there for that long or it's still might have been profitable even if you didn't know everything about it. So what's like the degree that you need to see in order to feel comfortable starting to move something to production. Obviously, you could go at nauseam and then effectively just over-analyze and do nothing which kind of the analytical people do then you have the other side of the coin, the people who just jump off the cliff and then hope the water's deep enough. So typically a balance but curious your process there. Well, it depends a little bit on the type of stuff that you are after right? If you are a risk-premia guy or girl, that is something where you can't analyze it to death because it doesn't go away just because people know about it. So there's nothing wrong with really getting going hard on the data analysis because you're going to find more and more information to sort of contextualize the effect when it's better when it's stronger when it's weaker. I would say that at some point",
    "start_timestamp_seconds": 602.68,
    "end_timestamp_seconds": 687.96,
    "start_timestamp": "10:02",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=602",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "just because people know about it. So there's nothing wrong with really getting going hard on the data analysis because you're going to find more and more information to sort of contextualize the effect when it's better when it's stronger when it's weaker. I would say that at some point there's an analysis process that kicks in words like the whole point of this is to trade to make money and you do have to fire at some point. We talked about that actually. I think in our our flawed cast together if you have memory serves. But there is that balance and it does depend on whether you're after a risk pre-mit or whether it's more of an inefficiency or flow effect or something like a transient effect. I think that transience is better word than inefficiency because people get really particular about inefficiency and the secrecy around and stuff. There are transient effects that aren't really inefficiencies but they don't last very long. So like news catalysts a flow effect. I don't know, just a transient type of thing where it's a big wave and then it's gone and the water smooths out again. And so for things like that, it's really not a good user time to be trying to console yourself with extra data and analysis. At some point you're going to have to just decide, you know, size your risk correctly and take a shot and start recording your data. And that I definitely tend",
    "start_timestamp_seconds": 671.16,
    "end_timestamp_seconds": 760.2,
    "start_timestamp": "11:11",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=671",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "like that, it's really not a good user time to be trying to console yourself with extra data and analysis. At some point you're going to have to just decide, you know, size your risk correctly and take a shot and start recording your data. And that I definitely tend towards that because most of what I do is on that side of the equation rather than risk pre-mit per se. Like I'm not a volatility seller. I'm not short of all. Typically when short ball is performing very well, the equity risk premium is also performing well. And so for me personally, I would rather be partaking in that usually with momentum on single stocks, strong sectors stuff, things like that. So when short balls performing well, you can usually find me in single stock momentum stuff. And when short ball isn't performing well, you can find me on long ball on the indices. It's kind of like my general, like 30,000 foot view playbook. But yeah, I mean, you don't want to wait around all day with the data analysis stuff. The whole point of some of these effects, especially the stuff that retail can take advantage of in my opinion, you're going to have to operate with imperfect and complete information. And that's true of a lot of things in life that have, you know, positive, skew payoff profiles, right? Like, like, would anybody get a date at a bar if they had to wait for perfect,",
    "start_timestamp_seconds": 739.32,
    "end_timestamp_seconds": 835.64,
    "start_timestamp": "12:19",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=739",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "in my opinion, you're going to have to operate with imperfect and complete information. And that's true of a lot of things in life that have, you know, positive, skew payoff profiles, right? Like, like, would anybody get a date at a bar if they had to wait for perfect, complete information before they went up and talked to a girl? Do you know what I mean? Like, like, do you need perfect information or at some point you should have to say, well, she smiling at me? She laughed at some of my jokes. Maybe I should ask for a phone on her, right? Like, it's the same kind of thing. You're going to have incomplete information. You have to make a decision. And and and size the risk appropriately. So I think I think it's very applicable to a lot of things in life. Yeah. I think that's absolutely solid. And now when when you come across, let's say any anything of interest. So this market on close effect, the general longball playbook side of stuff, when you're in this creative mode, do you start from a point of, I'm going to look in this specific space for a while and see what I see or do you kind of look around and just see if something sticks out to you? What I'm trying to explore here a little bit is the fact that for a newer trader a lot of times, I mean, it's the ocean's huge,",
    "start_timestamp_seconds": 815.0,
    "end_timestamp_seconds": 899.96,
    "start_timestamp": "13:35",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=815",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "a while and see what I see or do you kind of look around and just see if something sticks out to you? What I'm trying to explore here a little bit is the fact that for a newer trader a lot of times, I mean, it's the ocean's huge, right? So you can spend forever just looking at a ton of different things, but not enough detail to really see anything. And then sometimes you can spend too much time looking at one specific thing and then lose a bunch of other stuff. So again, like we're just talking about there's like this balance. So when you're in this idea generation kind of creative phase, looking for new things and ideas, how do you approach that problem set? Well, I would say for for most people, a really important point would be that you need to understand the mechanics of the game, how the game works in order to figure out what's worth taking a look at. So if you're going to spend time actively focusing on things, it's really important to know how the pieces fit together so that you can generate better ideas of places to look. It's like saying, if I want to hunt deer, it's kind of handy to know where deer like to sleep and where they drink water and where they might be walking to and from because those are going to be the places where most likely to find deer, right? Or",
    "start_timestamp_seconds": 889.24,
    "end_timestamp_seconds": 966.68,
    "start_timestamp": "14:49",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=889",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "It's like saying, if I want to hunt deer, it's kind of handy to know where deer like to sleep and where they drink water and where they might be walking to and from because those are going to be the places where most likely to find deer, right? Or or waterfowl or salmon or whatever, right? Like you have to have some concept of like how the the ecosystem works in whatever it is that you're looking at. If you don't, it's going to be you're going to have a lot of hidden mess stuff because it just it might be something useful and it might not be and you'll have a difficult time discerning which is which because of your your incomplete information about how the game works. And so if you're going to put a lot of time into active learning, I would suggest that it should be into the mechanics, right? Like you should you should be a student of the VIXX complex like like how is VIXX calculated? What is it telling you? What's its relationship to VIXX? How is the VIXX calculated? What is its relationship to the options chain? Like you really need to understand this stuff like at a reasonably deep level in order to in order to notice things that are genuinely weird. Once you have some concept of how the game works or the broad pieces, you know like this is what the night does, this is what the bishop",
    "start_timestamp_seconds": 955.8,
    "end_timestamp_seconds": 1031.48,
    "start_timestamp": "15:55",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=955",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "to understand this stuff like at a reasonably deep level in order to in order to notice things that are genuinely weird. Once you have some concept of how the game works or the broad pieces, you know like this is what the night does, this is what the bishop does, you know, etc. My personal view is that it's better to just kind of just look around in a relaxed way without any sort of pre preemptive motivation. You tend to find the best stuff when you're not motivated to find things. It's that that Buddhist aphorism about motivation affecting perception that you tend to find what you're looking for and so you can create morages for yourself if you if you start with this idea like okay we're going to find something today in vertical spreads and I'm going to find it and then you just start, you know your brain kind of like starts invent and things to try to prove you right? Much better in my view to just kind of look just to see, you know and then make notes about what you see and like I said most of it it'll end up being probably nothing but every now and then you find something that's really really interesting and you can probably make some dough with that. I love that it actually reminds me of a story that I told not that long ago actually when I was hunting and funny enough I was",
    "start_timestamp_seconds": 1011.72,
    "end_timestamp_seconds": 1094.04,
    "start_timestamp": "16:51",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1011",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "probably nothing but every now and then you find something that's really really interesting and you can probably make some dough with that. I love that it actually reminds me of a story that I told not that long ago actually when I was hunting and funny enough I was deer hunting in the York and this was like one of my first hunts so I was like sitting there in this blind that I spent a while building and I was so stoked right to try to find something and I saw this deer and I'm sitting there looking at it looking at it and like man like I just need this thing to get a little bit closer and I was sitting there looking at it it must have been for like 20 25 minutes and then it just got like a little bit lighter so then I finally got to the point where I could move a little bit so I bring up my optic and it's a fucking stump. I watched this stump deer for 20 minutes I'm seeing it move I'm seeing everything and it's a fucking stump so your example there is actually massively massively important I think and for the hunting example it was easy for me once I could see what the clarity that this was a stump and not a deer. In trading what are some of the tools that you can use to validate if what you're seeing is something",
    "start_timestamp_seconds": 1082.28,
    "end_timestamp_seconds": 1157.72,
    "start_timestamp": "18:02",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1082",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "massively important I think and for the hunting example it was easy for me once I could see what the clarity that this was a stump and not a deer. In trading what are some of the tools that you can use to validate if what you're seeing is something worthwhile or if it's a stump. Well, repeatability obviously comes to mind in terms of seeing something more than once more than twice obviously it's just something that happens once it's a little bit difficult but you know as an example right like take any any options contract of zero dt like like say we just the start of the day today we pull up a 60 delta call and we're just looking at the bit asks spread on the 60 delta zero dt call and we're just watching it. If all you did was watch it and I know that that sounds tedious and boring but I'm telling you just try it sometimes just watch one contract bit asks spread and what you're going to notice is yeah it goes up it goes down as as the you know underlying is going up and down but the spread is relatively constant there's going to be you know a little bit of wiggle room and you can kind of get a sense of it just watching it. You will begin to notice when something weird happens for example you'll notice that it's going up and down about two bucks and",
    "start_timestamp_seconds": 1141.88,
    "end_timestamp_seconds": 1235.88,
    "start_timestamp": "19:01",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1141",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "relatively constant there's going to be you know a little bit of wiggle room and you can kind of get a sense of it just watching it. You will begin to notice when something weird happens for example you'll notice that it's going up and down about two bucks and even if it's trending upwards it sort of fluctuates up and down about two bucks two bucks two bucks about 80 to 2015 a bucks 70 to 25 just sort of rolls around in there and then I don't know where boom four dollars right you make a note of that what happens next what happens next well probably something interesting is going to happen right there's there's a little bit of an inflow you know you might see the underlying pop up a little bit but the point is that you can get a sense of a baseline just watching just observing and and then you can contextualize when something weird happens and also what happens you know related to that weird observation so that's like one kind of it sounds like a silly exercise but it actually can help train your mind to like seeing the kind of things that you're looking for because you're looking for a little effects like that in prices and when you're doing that try to remember that those aren't just prices those are people those are people making decisions with risk and and there's some interesting things you can find doing stuff",
    "start_timestamp_seconds": 1217.96,
    "end_timestamp_seconds": 1303.32,
    "start_timestamp": "20:17",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1217",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "things that you're looking for because you're looking for a little effects like that in prices and when you're doing that try to remember that those aren't just prices those are people those are people making decisions with risk and and there's some interesting things you can find doing stuff like that well you you mentioned a of funny part which is like it's not necessarily you know like fun or you know it's super interesting but it's where you start to find stuff I find a lot of newer traders are actually well I'm saying like again late stage begin our intermediate probably like they're actually willing to do that kind of work if they have some sense of like what might this lead to so so if you think about like some of these kind of effects and again understanding all the nuance of it and it's a big scale but what are some of what are some ways that a trader can begin building an expectation of like what this can lead to so that they can at least learn to embrace that seeming boring initial style work foundation setting because it can turn into something they just don't know what that is yet so to summarize that what are some ways that those kind of people can develop return expectations any sort of forward looking expectations of the thing that they're looking at? Well I'm going to start by there's a scene in the movie Troy",
    "start_timestamp_seconds": 1285.32,
    "end_timestamp_seconds": 1379.96,
    "start_timestamp": "21:25",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1285",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "just don't know what that is yet so to summarize that what are some ways that those kind of people can develop return expectations any sort of forward looking expectations of the thing that they're looking at? Well I'm going to start by there's a scene in the movie Troy with a hit yeah yeah where he puts the helmet on he's like that's why no one will remember your name well if you're only motivated to work when you're guaranteed a reward at the end of the tunnel um how far do you think you're going to get in a competitive market environment because the rewards the pot of gold at the end of the rainbow here goes to the person that's willing to do the work when they don't know what happens at the end when they don't know if it's a certainty that there's something there that the people that are interested and willing to search and do the work and develop a process are the people that that find the results. If you need to be guaranteed the result before you start this might not be the journey for you with with all tears pet but um return expectations are difficult things to talk about um they're difficult things to talk about because I am probably not the the best person to template my returns are very good you probably don't want to trade the way that I do it is exceedingly difficult it is shy",
    "start_timestamp_seconds": 1361.08,
    "end_timestamp_seconds": 1446.36,
    "start_timestamp": "22:41",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1361",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "um return expectations are difficult things to talk about um they're difficult things to talk about because I am probably not the the best person to template my returns are very good you probably don't want to trade the way that I do it is exceedingly difficult it is shy of volatility in terms of the realized P&L for me and and it's it's quite psychologically stressful it takes a lot of of discipline to pull it off um return expectations across the board short vault you know volatility selling I'm pretty sure that you and it said something like 20 to 40% a year is like a pretty reasonable target with uh with a sharp a little over one like 1.2 or something that's that's what I remember him saying I think that aligns with the conversations I've had with him started interjecting it's one super important interjection on this thought and I want you to explain it some people just heard you say if you sell vault just just sell vault you'll make 20 to 40% and when I say just sell vault I mean like just go in the open options market just sell options not actually yeah exactly so could you just clarify that just a little bit so yeah yeah sure let's I don't I don't want to get people that idea it's not this is not this is not this is not free money options we all work for sure what you need to",
    "start_timestamp_seconds": 1430.6,
    "end_timestamp_seconds": 1526.68,
    "start_timestamp": "23:50",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1430",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "yeah exactly so could you just clarify that just a little bit so yeah yeah sure let's I don't I don't want to get people that idea it's not this is not this is not this is not free money options we all work for sure what you need to understand about selling vault is that the the risk premium is in generally in the win rate that you know the short vault tends to win we tend to stay inside the straddle implied break even on any given day or any given period frankly what you need to know is that it's counterbalanced almost perfectly by the payoff ratio of long vault when long vault hits because when long vault hits the payoff ratio on it is so large as we saw what two or three days ago that it almost perfectly counter balances it now are the things you can do yes you know you can you can buy the tails you can dealt ahead you can I mean you can do an iron condor there are a lot of different ways that you can play it so that you don't get cooked absolutely and in the book that even an i wrote we you know there's lots of information on that but but it's not a free lunch in the sense that yeah if you just do this if you just sell sell vault naked everything works out it's not necessarily true you have to know what",
    "start_timestamp_seconds": 1506.36,
    "end_timestamp_seconds": 1596.04,
    "start_timestamp": "25:06",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1506",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "that even an i wrote we you know there's lots of information on that but but it's not a free lunch in the sense that yeah if you just do this if you just sell sell vault naked everything works out it's not necessarily true you have to know what you're doing you have to be careful and I would go step further and say you should try to be strategic about roughly timing it so that you're selling vault when it's a good time to sell vault not just any old time because if you sell it any old time someone like me is going to take your money on the other side if I catch you on the right day or the wrong day depending on the point of view yeah and I think that that's really huge and thank you for elaborating on that it's just because there are different places that try to simplify options and then they make it seem like well if you just sell then you'll make x amount and as you just elaborated there's a little bit more that that goes into it than that so thank you yeah we we we what are we gonna say I mean a lot of the data on selling vault comes from like a period of relatively safe sustained bull market like over a decade right of of relatively stable you know quantitative easing very low interest rate like we're just we're just floating up",
    "start_timestamp_seconds": 1584.44,
    "end_timestamp_seconds": 1659.48,
    "start_timestamp": "26:24",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1584",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "what are we gonna say I mean a lot of the data on selling vault comes from like a period of relatively safe sustained bull market like over a decade right of of relatively stable you know quantitative easing very low interest rate like we're just we're just floating up the market and like basically from what 2009 for period of like 10 years basically so so you want to take that with a grain of salt it doesn't mean that other things can't happen and this month has been a really good example right um spun this has been a really good example take I would imagine that this has been a much more challenging month for the short vault crowd right and it goes to show that indiscriminately shorting vault is not the ticket you know there are there are things to look for to give you a hint that it's a good time to sell the vault because the vault is actually overpriced you don't want to be in a position where you're selling it to me and it's fair you do not want that and and I'm not the only one obviously there are other people out there that recognize when it's fair and they're willing to take a bet on the long side as well so could you double click into that a little bit and again actually you guys did talk about this a bit your book as well but could you talk briefly",
    "start_timestamp_seconds": 1644.2,
    "end_timestamp_seconds": 1722.84,
    "start_timestamp": "27:24",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1644",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "out there that recognize when it's fair and they're willing to take a bet on the long side as well so could you double click into that a little bit and again actually you guys did talk about this a bit your book as well but could you talk briefly about some of the tools that a vault trader whether buyer seller can use to identify if vault is relatively fairly priced versus a potential to be overpriced and just to clarify at that point really quick the reason why I emphasize potential is obviously a lot of traders they won't know definitively like if they see his or his and then that can gridlock decision right I mean I don't want to get into it too too much but like a very simple one is just the general vix level so when vix when the vix is low right volatility looks cheap nominally but it's actually more likely to be overpriced just because the move that we are likely to experience that day is going to be muted and we tend to revert back towards the straddle break even levels so vix at 16 vix at 14 the overall premium might be lower but the lean towards the short vault crowd is much better for them it's much better to be selling vault if you're selling vault 25 you know the premium is higher but like there's a good chance that we're adding closer towards fair volatility like you",
    "start_timestamp_seconds": 1707.16,
    "end_timestamp_seconds": 1802.76,
    "start_timestamp": "28:27",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1707",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "premium might be lower but the lean towards the short vault crowd is much better for them it's much better to be selling vault if you're selling vault 25 you know the premium is higher but like there's a good chance that we're adding closer towards fair volatility like you could experience some some real interesting movements intro day that will cause you to regret your life decisions right now that is it's one of them it's in the book but I mean that's just like a basic one right where it gets into gents and inequality a little bit and some other stuff but you know all stuff that if you're going to sell well you should know about this stuff but vix level is like kind of like a 101 like hey not all vix level should be treated equally for the purposes of selling vault that's what you're into. That I think is still plenty to go off of right for the enterprising trader see it gives some sort of context and one thing that you probably will have heard or come across is this idea that when vault is high you should sell it and the idea there is if it's high and volus mean reverting then the idea is that it will come back down obviously there's a bunch of holes in that so could you talk a little bit about that? Well sure I mean it's not it's not wrong it's more a question",
    "start_timestamp_seconds": 1781.56,
    "end_timestamp_seconds": 1874.52,
    "start_timestamp": "29:41",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1781",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "idea there is if it's high and volus mean reverting then the idea is that it will come back down obviously there's a bunch of holes in that so could you talk a little bit about that? Well sure I mean it's not it's not wrong it's more a question of timing right because not only does vault mean reverts you know in the long term is one of the stylized facts above volatility another one that was that volatility clusters in the short term and so now we're going to argue some semantics about what do we mean by short term what do we mean by long term like does long term mean five days does it mean 30 days does it mean a year because you know if if the vix hits 50 it's a pretty good bet that in a year it's back down below 21 right but that's not usually what people are interested in right what they're interested in is the vix went from 16 to 22 today should I short vault tomorrow and that's a different question right like that's that's not what happens to volatility in the long term that's you know a two-day period or a three-day period or a weekly period and in a short period of time like that it's very likely that volatility can cluster right because as the vix starts to pop up as vix starts to pop lots of interesting things happen across the volatility service there",
    "start_timestamp_seconds": 1852.68,
    "end_timestamp_seconds": 1937.8,
    "start_timestamp": "30:52",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1852",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "two-day period or a three-day period or a weekly period and in a short period of time like that it's very likely that volatility can cluster right because as the vix starts to pop up as vix starts to pop lots of interesting things happen across the volatility service there are all kinds of strategies and things that have very tight risk tolerances from large operators that can blow up things keep moving and so the cluster effect is just as likely as the mean reversion effect on very short timeframes so it it's sort of like a fake sense of security to say volatility reverts is mean reverting in the long term when you're planning on taking a trade the next day or the next two days like that's not long term statistically you know in any meaningful sense uh so I would caution people to be careful spouting that kind of stuff and then planning on trading in a short term time frame I guess could you go one step further and talk a little bit about the pricing dynamics as well related to that in what in what sense are the idea so you give a great example of vall is at 50 and a trader was to think assuredly in that sometime over the next year it will be below 21 so then they should buy those puts right because it's going to go down yeah it's going to depend a little bit on your trade",
    "start_timestamp_seconds": 1918.6,
    "end_timestamp_seconds": 2011.32,
    "start_timestamp": "31:58",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1918",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "example of vall is at 50 and a trader was to think assuredly in that sometime over the next year it will be below 21 so then they should buy those puts right because it's going to go down yeah it's going to depend a little bit on your trade preference like there's a lot of things to think about that there's a time value of money like do you want to trade that's tied you know has x amount of your bankroll tied up for that long same kind of consideration you have with uh season wind totals in the NFL or the NBA you know it's like there are a lot there's a lot of edge in season wind totals just for people that are interested it's it's something that still has some edge even even these days but the question is do you really want to do you really want to do you really want to tie up your money for the entire season would it not be better to maybe find some smaller edges and then you know roll the compounding over the season rather than hold it in one trade like that I guess if depending on you know if you have enough of a critical mass in it it might be worth it but you know that would be one consideration then there's there are other ways to play that trade I mean there are I really low touch one that uh you and",
    "start_timestamp_seconds": 1996.76,
    "end_timestamp_seconds": 2075.4,
    "start_timestamp": "33:16",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=1996",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "depending on you know if you have enough of a critical mass in it it might be worth it but you know that would be one consideration then there's there are other ways to play that trade I mean there are I really low touch one that uh you and you know sort of caution me against because it's got a lot of drag to it but s fix is one way that you can play that trade right you can just long s fix there is some drag to that like it's like I think it's like 7% drag or so it's pretty heavy but the thing the thing about s fix as much as like I'm sure that'll get shit on the thing about s fix is that you can just hold it like like there's no you know there's no panic about like timeframes or exploration so if you really have a strong view like okay the mix is at 50 and like hmm if I hold this I'm gonna get you know 30 40% return on this like you can just park at an s fix and you will do pretty well with it you can even would probably be be more into shorting like one of the uh one of the long volatility uh ETS or whatever like like U-vix or something like that but again multiple ways to play it as long as as your timeframe works for you yeah it's really a discretionary",
    "start_timestamp_seconds": 2057.72,
    "end_timestamp_seconds": 2145.16,
    "start_timestamp": "34:17",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2057",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "even would probably be be more into shorting like one of the uh one of the long volatility uh ETS or whatever like like U-vix or something like that but again multiple ways to play it as long as as your timeframe works for you yeah it's really a discretionary thing and I think a big thing to highlight there is again like the expectations because when when I was making the joke earlier about like assuredly by those puts the the main thing from like a pricing dynamics standpoint is that that same quote of quote sure bet is known so there's not like this massive amount of capital that you could potentially make from that trade for for that exact reason now hmm if if you were to think about let's say a trader that is interested in building a model to look at something super vague but I want to just talk about the concepts of building a model broadly like what are the considerations that you use when you're starting one and then you know we can work down the logical thought process from there. Sure um even the first thing I would I would probably say for a retail trading audience is that modeling is super interesting it will expand your knowledge of different techniques ways to process information to sort of to look at the way that these things operate in a larger ecosystem it's not necessarily the most important thing you can do",
    "start_timestamp_seconds": 2119.88,
    "end_timestamp_seconds": 2223.16,
    "start_timestamp": "35:19",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2119",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "say for a retail trading audience is that modeling is super interesting it will expand your knowledge of different techniques ways to process information to sort of to look at the way that these things operate in a larger ecosystem it's not necessarily the most important thing you can do as a retail trader and if you just go about it willy nilly you just kind of start firing away and dump all this stuff into models and hoping something good comes on it you're gonna end up spending a lot of ways to time arguably you will have learned some things which might not make it wasted time in an absolute sense but in terms of finding edge finding it finding profits it might be wasted time. I'll give you an example so I made this this ridge regression rolling ridge regression model a couple of years ago because I was curious about making a model for risk on risk off just to just wanted a general vibe of like you know inflows in risk on people getting out of the way risk off. So I looked at credit spreads I looked at bond spreads I looked at we had copper we had crude oil all this stuff in here that various things that the generally have some effect on economic sentiment and this and that all and all about 25 different things then I you know worked to factor them get the right windows blah blah blah finally",
    "start_timestamp_seconds": 2202.28,
    "end_timestamp_seconds": 2305.4,
    "start_timestamp": "36:42",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2202",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "had copper we had crude oil all this stuff in here that various things that the generally have some effect on economic sentiment and this and that all and all about 25 different things then I you know worked to factor them get the right windows blah blah blah finally I put this thing and I've got a risk on risk off model and it looks pretty good and then I compared it to a 200 day moving average of yes px and and I'm you know I'm not too proud to admit that this model performs marginally better than a 200 day moving average to the tune of like a third of one percent better a 200 day moving average so yeah you know it's like two weeks of work to put this thing together to get all the data feeds to clean all the data and and the thing is basically more or less right on part with a 200 day moving average and so it's not like I haven't made all the same mistakes right that I'm costing other people against but if you just if you just start building the model what you're going to find is that there's a lot of money in the financial markets people are highly incentivizing to find things that work and if you just randomly build stuff what you're going to find is that someone else beats you to the punch a long time ago and you're going to have",
    "start_timestamp_seconds": 2278.68,
    "end_timestamp_seconds": 2375.4,
    "start_timestamp": "37:58",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2278",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "is that there's a lot of money in the financial markets people are highly incentivizing to find things that work and if you just randomly build stuff what you're going to find is that someone else beats you to the punch a long time ago and you're going to have to try a little harder and a little smarter than that so back to the original question about modeling the real point of a model is to try to harness an effect and it's something I talked about with Rob Pizzola on the circles off podcast is that you want to try and find an effect and then use a model to just help you sort of parameterize it in terms of how much you should risk on it or or how often it wins or whatever and so that's really the point of a model it's not to create the perfect risk on risk off indicator that will tell you when to jam into TQQ or or to take all your money and put it in cash it's about hey like I've noticed that on FOMC day we we go one way really aggressively and then the second half of the day we go the other way and I'd like to know if if I can basically fade the first move and bet on the second move so if we go down aggressively right at the announcement time if I jam the other direction right what does that look",
    "start_timestamp_seconds": 2359.24,
    "end_timestamp_seconds": 2438.76,
    "start_timestamp": "39:19",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2359",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "of the day we go the other way and I'd like to know if if I can basically fade the first move and bet on the second move so if we go down aggressively right at the announcement time if I jam the other direction right what does that look like and then we could build a model to sort of say okay this is what it kind of looks like and and maybe there's something to fading the first move as an example but it's really important to try to try to use model as a tool to harness an effect not just to build something because building stuff is fun even though it is and I love doing it but if you start with that it ends up being a lot of going around the circles absolutely and you're obviously your story about the 200 damage is hilarious because I think everybody that's actually traded has come across that exact thing like tons of times and you just kind of sit at yourself and you're like fuck yeah exactly now you chose a rolling ridge of rushing I think one of the interesting things for traders is even trying to figure out like what tool to use not in terms of like doing the modeling but overall ridge aggression versus some other OLS type model like how does a trader in your view kind of build this toolkit of like understanding what might be useful to their idea",
    "start_timestamp_seconds": 2417.64,
    "end_timestamp_seconds": 2510.6,
    "start_timestamp": "40:17",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2417",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "trying to figure out like what tool to use not in terms of like doing the modeling but overall ridge aggression versus some other OLS type model like how does a trader in your view kind of build this toolkit of like understanding what might be useful to their idea hmm well they're like I said and when we talked about you know knowing the rules of the game it's important to know the available tools as well you don't have to know every tool in the world but there are two books that are actually pretty useful on this unfortunately for many of your viewers there there are not in Python I predominantly use R though the first is the elements of statistical learning which gives a really good broad overview of the various statistical models and then there's a follow up book to that called predictive modeling by Max Cune and they're both really good like that's where you're going to get into the different types of regressions you get into you know K&N nearest neighbors random forests blah blah blah lots of there's some machine learning stuff in there there's also some more standard statistical models in there I think I think those are there decent books if you're interested in sort of understanding the lay of the land in terms of the different things you can do but there there are a lot of I mean it's it's almost inexhaustible field the number of different ways",
    "start_timestamp_seconds": 2494.92,
    "end_timestamp_seconds": 2582.92,
    "start_timestamp": "41:34",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2494",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "there I think I think those are there decent books if you're interested in sort of understanding the lay of the land in terms of the different things you can do but there there are a lot of I mean it's it's almost inexhaustible field the number of different ways that we can try to model something you know we have we have models where we take things from physics and we apply them to the financial markets then there's um there's ecological models there are you know simulations money car low blah blah blah ready it goes on and on forever and so it's it's kind of about what is it that I'm trying to do and then looking at some of the tools that are available and saying what's uh what's a tool that I might be able to make work or it might be able to you know kind of make work you know creatively and then you just try a bunch of stuff for that what are your thoughts on somebody using something like AI and like going into chat you be team being like hey I think I see this and I want a model it what models might be useful I think if you ask it about the types of models that might be useful you could probably get a pretty good answer because I still am of the view and it's something that Augustine LeBron said on Twitter that AI right now is",
    "start_timestamp_seconds": 2566.12,
    "end_timestamp_seconds": 2642.76,
    "start_timestamp": "42:46",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2566",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "it what models might be useful I think if you ask it about the types of models that might be useful you could probably get a pretty good answer because I still am of the view and it's something that Augustine LeBron said on Twitter that AI right now is primarily a regurgitation machine and so as long as you're asking it's something that is adjacent to regurgitation you actually can get a pretty good answer it's when you start asking it to think like think think that things are going to get a little bit weird so if you said to it for example I'm trying to do a simulation of of this effect and here's roughly the effect and I'm aware of Monte Carlo simulations but tell me about three or four other ways to simulate something with an effect it's going to give you a pretty good answer yeah I can tell you a lot about the lay of the land if you say oh I'm thinking about doing OLS minimization regression for this can you give me some other ideas about ways to approach this it'll give you some that are related that are pretty good it's just it's just when like you say when you ask it for the magic solution to something that's when things get a little hairy in my view I actually saw this thing I don't know if it's legitimate at all and so it could be just reporting completely false",
    "start_timestamp_seconds": 2630.28,
    "end_timestamp_seconds": 2707.0,
    "start_timestamp": "43:50",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2630",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "it's just it's just when like you say when you ask it for the magic solution to something that's when things get a little hairy in my view I actually saw this thing I don't know if it's legitimate at all and so it could be just reporting completely false information but I saw this video not that long ago about in AI tool it was a fake AI tool at a fake company that they were essentially emailing back and forth at this fake company that they're going to get rid of the AI tool and they also had you know different fake emails and one of them was about like it's a fair that two people had so literally the AI tool said it's not this person in email it's like you have five minutes either you cancel the deletion of you know AI or whatever or I send out this email with all these details of this affair so I think I'm okay with the regurgitation part right now that's good enough we don't have to worry about AI not being willing to do what you want one thing that it doesn't help you with and I think is something that catches a lot of people is biases the world is really challenging to perceive objectively and when you don't even really know about your own biases or recognize them then it's even that much more difficult what are some ways that you think a trader can",
    "start_timestamp_seconds": 2696.04,
    "end_timestamp_seconds": 2787.56,
    "start_timestamp": "44:56",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2696",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "think is something that catches a lot of people is biases the world is really challenging to perceive objectively and when you don't even really know about your own biases or recognize them then it's even that much more difficult what are some ways that you think a trader can become more familiar with their own biases to then implement controls for. Hmm. Now that's a really really good question. I actually think one of the more dangerous types of bias is a like a social consensus bias and it happens from being a little too plugged into what everybody else is talking about at any given moment. I actually think you and alluded to this and one of his earliest books where he basically says you know might be surprising to some but I never read the Wall Street Journal and I don't I don't read any of this stuff and it might surprise people because you would think of this you know option trader of all trader must be you know really dialed into like what's happening on the street and it's like that's not that's not quite what it means right he's looking at what he's looking for in the wall service in the wall space and if you know what you're looking for whatever it is that you're doing you're looking for momentum break out some single stocks you're looking for you're looking for opportunities to short you know shitty stocks that are pumping on some",
    "start_timestamp_seconds": 2765.48,
    "end_timestamp_seconds": 2861.88,
    "start_timestamp": "46:05",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2765",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "for in the wall service in the wall space and if you know what you're looking for whatever it is that you're doing you're looking for momentum break out some single stocks you're looking for you're looking for opportunities to short you know shitty stocks that are pumping on some dubious news you're looking to short volume you're looking for volatility burst to the long side whatever it is that you're looking for there's some effect there are some details around that effect there's some execution skill operator skill that you need to develop around that effect what's happening on Twitter what's happening on CNN what's happening on you know CNBC not really that important to your day-to-day operations you should try trading without any of that stuff and see what happens you know it's pretty easy to turn off the television but like have you ever tried trading a week without looking at Twitter without looking at whatever anyone's talking about it's really interesting right how how what's happening whatever the current buzz is around government news around economic calendar event news around federal reserve news it tends to really galvanize people and if you're just after your effect you tune all that stuff out my experience you trade a lot better because you don't have the second guessing mechanism in your brain that's saying all but so and so was worried about this and all those people were talking about this thing that might get us today and",
    "start_timestamp_seconds": 2845.24,
    "end_timestamp_seconds": 2945.08,
    "start_timestamp": "47:25",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2845",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "you tune all that stuff out my experience you trade a lot better because you don't have the second guessing mechanism in your brain that's saying all but so and so was worried about this and all those people were talking about this thing that might get us today and you know it to really just try to shut out all the noise and focus on whatever the effect is that you're targeting I think is probably the best antidote to the most dangerous bias which I think is like the social contagion social consensus bias when it comes to biases about like the market direction or the sentiment or whatever just try to play what's there not what you think should be there it's really easy get into this game of like what you think matters like everyone's stupid the market should be going down right now in this news like no no no what you think is not that important what's important is what people are betting on what people are risking why they're doing it really doesn't matter when they have 10 million times more resources than you do because when they move everything moves right you don't want to be the person that's you know it's trying to hold back the tide with your hands right you want to be the person that says the tide's coming in now so it's time to take a step back the tide's going out it's time to take a",
    "start_timestamp_seconds": 2926.28,
    "end_timestamp_seconds": 3010.44,
    "start_timestamp": "48:46",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2926",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "don't want to be the person that's you know it's trying to hold back the tide with your hands right you want to be the person that says the tide's coming in now so it's time to take a step back the tide's going out it's time to take a step forward and try to to move with whatever it is that you're doing and that's why what you think is less important than what's actually happening and if you can center around what's happening not what you think should be happening tends to work out better you tend to not get stuck in those stubborn trades where you're your underwater you're holding something that is like clearly you're just wrong I don't know if I answered that one super concisely but that's what I was thinking yeah well you hit on two big pieces of it I want to double click into another side of it more like the self behavioral biases in a moment so things like availability and you know that kind of stuff but before that you mentioned two things that I actually think play against one of the really well and I want your perspective on it which is this idea of kind of like social consensus against trying to fight the tide and whatever like you the individual trader think something should be I've always felt for a while that it's really dangerous when traders get into this habit of like wanting to neatly",
    "start_timestamp_seconds": 2997.88,
    "end_timestamp_seconds": 3085.0,
    "start_timestamp": "49:57",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=2997",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "on it which is this idea of kind of like social consensus against trying to fight the tide and whatever like you the individual trader think something should be I've always felt for a while that it's really dangerous when traders get into this habit of like wanting to neatly explain and summarize everything and being like this is happening because this sometimes maybe but a lot of times there is a lot of other stuff going on and it almost becomes like this ego-tistical ability to explain things that creates this nasty loop so in the context of like navigating social environment and then managing what you think how do you think a trader might be able to successfully extract good information things that are genuinely useful to them especially newer folks that are kind of starting out and like learning the landscape versus getting wrapped up into like this narrative generation side of stuff. Well when you're first starting out you want to give yourself information overload you have to expose yourself to every possible idea even the really fucking stupid ideas because the faster that you like it's just like a jigsaw puzzle right if you the faster you map out the corners the faster you can start filling in this puzzle so to me you know that information overload process in the beginning is all about finding the corners finding the edges of the puzzle so that you can start filling in the pieces and start",
    "start_timestamp_seconds": 3063.48,
    "end_timestamp_seconds": 3156.28,
    "start_timestamp": "51:03",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3063",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "faster you map out the corners the faster you can start filling in this puzzle so to me you know that information overload process in the beginning is all about finding the corners finding the edges of the puzzle so that you can start filling in the pieces and start putting together some kind of coherent picture in your mind about how these things roughly work. That's different and is distinguished from when you're at a place as a trader where you have an effect that you're targeting because now you've already identified somewhere in this puzzle that you want to attack. When you're doing that and you have one or more than one effect now what you want to do is you want to reduce the noise reduce the ideas reduce the the consensus activity going on around you because you're focused on what you're trying to do. So to me those are like two separate phases of sort of like a trader's evolution or traders progress right like like I'm sure even someone like you and I'm sure when you and started out he was he was like a sponge absorbing whatever one was talking to him about on the floor like all around them right but once he knows what he's doing like you know with his his wall trading he's a lot less interested in like what bleep blog 2121 on Twitter thinks about anything and and rightly so because like he knows he knows what",
    "start_timestamp_seconds": 3145.56,
    "end_timestamp_seconds": 3226.28,
    "start_timestamp": "52:25",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3145",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "on the floor like all around them right but once he knows what he's doing like you know with his his wall trading he's a lot less interested in like what bleep blog 2121 on Twitter thinks about anything and and rightly so because like he knows he knows what he's about he's knows what he's targeting he knows what he's trading he knows what he's looking for what he wants what he doesn't want right and so like the rest of it just falls away and so it's important not to like not to get those crossed up like if you don't have any edge you don't have any effect yes expose yourself to everything to try to you know map out that puzzle but if you have some things that you're doing you should really try to exclude the noise and focus on them as much as you can I absolutely love that what a great way to describe it too that that's awesome and now shifting back to the first part of that question on behavioral biases sometimes I always think I mean you're even talking about it before right about the the the fact that you feel a lot of traders wouldn't even want to trade the way that you trade because of the just the general toll it takes and there's this reality where you could give two traders effectively like a straight playbook of like 80 z dual of these things and you're probably",
    "start_timestamp_seconds": 3209.08,
    "end_timestamp_seconds": 3284.68,
    "start_timestamp": "53:29",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3209",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "feel a lot of traders wouldn't even want to trade the way that you trade because of the just the general toll it takes and there's this reality where you could give two traders effectively like a straight playbook of like 80 z dual of these things and you're probably going to get different outcomes and that obviously points to the inconsistencies between the individuals and I find of really big challenge for people is even becoming aware of their own behavioral biases and then how that believes into their system could you talk a little bit about just some of the the more nefarious behavioral biases that you can think of and we can even narrow it maybe to the scope of conducting research or modeling because there's a ton that you know you can commit in there that sends you down the wrong path pretty quickly yeah I mean we can we can talk about the the textbook ones but you know you and actually has a really great section in volatility trading it does the second book on that I would encourage people to read that because it's actually really really good and I don't think we should re-hash from here for that reason because you should really just read them right from you and second book let's talk about some ones that maybe aren't in there right one bias that you know is kind of it's lethal and it's not like a textbook one is trading",
    "start_timestamp_seconds": 3265.56,
    "end_timestamp_seconds": 3354.76,
    "start_timestamp": "54:25",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3265",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "should re-hash from here for that reason because you should really just read them right from you and second book let's talk about some ones that maybe aren't in there right one bias that you know is kind of it's lethal and it's not like a textbook one is trading your P&L right like allowing how in your current P&L to affect your trading decisions and it's something that I struggled with in the beginning it's something that I think a lot of people deal with in the beginning which is basically that how you how you trade the next trial the next spin is determined at least somewhat by whether your screen is red or green and to what extent and that's very very dangerous it's dangerous because it starts to muck up your payoff ratio profile quite badly right if you're and it turns into something else something that's been talked about since at least the Jesse Livermore era which is that it turns people more risk adverse when they're winning and or sorry yeah more risk adverse when they're winning and less risk adverse when they're losing and so again the payoff profile of your entire thing is going to go right out the window you know so you say say that you're targeting like I don't know I mean just for fun let's just say you're targeting one to one you know sort of payout profile and and you're winning like 52 or 53% of the",
    "start_timestamp_seconds": 3338.6,
    "end_timestamp_seconds": 3428.6,
    "start_timestamp": "55:38",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3338",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "is going to go right out the window you know so you say say that you're targeting like I don't know I mean just for fun let's just say you're targeting one to one you know sort of payout profile and and you're winning like 52 or 53% of the time whatever but your first two trades you lose right and now and now you become more likely to hold on to a bad trade because you don't want to third loss so you're like fuck it like it's going to turn around whatever and you start you start thinking things that have absolutely nothing to do with your effect they have nothing to do with the market you stop thinking in terms of trials you start thinking in terms of like the red on the screen right and then and then say that one does turn around and it goes ever so slightly green now all of a sudden you're far more strongly incentivized to take a trade for less than you should hold for just because it's going to be a winner or just because it clears the red on the screen for the day and so all of a sudden this perfectly rational logical strategy that you had before the market's open has become a complete shit show where you're now you know trading to emotionally regulate yourself based on the feedback that you've gotten so far it's also I think that that is it's a very",
    "start_timestamp_seconds": 3416.04,
    "end_timestamp_seconds": 3491.88,
    "start_timestamp": "56:56",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3416",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "of a sudden this perfectly rational logical strategy that you had before the market's open has become a complete shit show where you're now you know trading to emotionally regulate yourself based on the feedback that you've gotten so far it's also I think that that is it's a very very dangerous spiral and it has absolutely nothing to do with data analysis statistics it has everything to do with your psychology your your ability to self regulate yourself to breathe and to reset and so you know it gives some credence to the idea that even with an edge you still need some ability to to self regulate yourself as you manage these trades and I don't think it's appreciated as much as maybe it should be two follow-ups for that first one there's actually for those that don't know there's a there's a a fantastic paper by Barbara Lee and Odeen from Berkeley all the well the behavior of individual investors is an aim of it and it talks about the disposition effect which is exactly part of what you were just discussing but they go into it in detail which is just a great read for anybody that's not aware but the backing part of that that I wanted to actually double click into is this idea PAH because how relatable is that where you find something that you think is decent that you know is there at least as far as you can know and then",
    "start_timestamp_seconds": 3474.68,
    "end_timestamp_seconds": 3558.6,
    "start_timestamp": "57:54",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3474",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "that's not aware but the backing part of that that I wanted to actually double click into is this idea PAH because how relatable is that where you find something that you think is decent that you know is there at least as far as you can know and then you put this thing on and then you go through a losing street right out of the gate and you're like what did I fuck up? How how do you navigate that like how do you think people can traverse through that? Well, um a first thing you should do is you should have some kind of a checklist that allows you to reset after each trade like cognitively psychologically but the other thing is you want to go through kind of like a rough checklist of like the times that this effect shows up so the first thing that pops up in my mind with this is something like trying to short-vall but now the VIX is at like 26 or 27 and you're thinking like okay so I've read all of these books I've done all this research that we know about the risk premium we know that the volatility risk premium is there and I just started it but I started it when the VIX is at 26 or 27 oh I'm getting fucked up here oh I'm getting fucked up very badly like what's going on? It's like well well again you get the broad strokes",
    "start_timestamp_seconds": 3539.56,
    "end_timestamp_seconds": 3622.6,
    "start_timestamp": "58:59",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3539",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "the volatility risk premium is there and I just started it but I started it when the VIX is at 26 or 27 oh I'm getting fucked up here oh I'm getting fucked up very badly like what's going on? It's like well well again you get the broad strokes you got right but the the devil's in the details right we just talked about when that VIX starts to pick up about how volatility starts to inch towards fair and how that's when it's a really bad idea and you get back into gentsons in the quality and how like you should really be waiting for like VIX 16 VIX 14 whatever right and so usually there's clues like that but like related to your effect that will tell you hey like it's it's not it's not just that you're condemned by the gods there there maybe some there may be some contextual factors here that are that are in play right it's it's actually kind of like you know say you have an edge and NFL football spreads and you start on a Thursday and you know you just get you lose terribly on that Thursday but you failed to recognize that like the Thursday night game tends to have smaller variants than other games because there's a tremendous amount of money and eyeballs on one game and one game only and it does some interesting things to the total in the spread in terms of what we",
    "start_timestamp_seconds": 3609.72,
    "end_timestamp_seconds": 3688.52,
    "start_timestamp": "01:00:09",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3609",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "failed to recognize that like the Thursday night game tends to have smaller variants than other games because there's a tremendous amount of money and eyeballs on one game and one game only and it does some interesting things to the total in the spread in terms of what we see for realized variants and so it's like okay there is a contextual factual factor here that that maybe explains why Thursday's not the best game for this particular factor or whatever and so usually there's something like that that can help you to put into context what it is that you're seeing like for example if you've looked at even if you look at open to close realized vault by month you're gonna notice that like not all months are created equal right for example i think the the best short vault month there is in terms of like just a really steady equity risk premium is July right we just like we just like kind of smooth roll up and and there tends not to be a lot of surprises in July and then we see that realized vault starts to pick up again September October November so there are things like that where it's like oh if I wanted to short-wall probably July is a pretty good month to think about doing that and probably I should ease off my aggressiveness as we get into the fall you know so there are things like that that you",
    "start_timestamp_seconds": 3673.0,
    "end_timestamp_seconds": 3759.88,
    "start_timestamp": "01:01:13",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3673",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "there are things like that where it's like oh if I wanted to short-wall probably July is a pretty good month to think about doing that and probably I should ease off my aggressiveness as we get into the fall you know so there are things like that that you can do to contextualize to take a little bit of the sting off losing right out of the gate and and get yourself kind of back to where you need to be. I love that yeah it's a big thing that comes to mind for that is like people that are you know playing earnings it's a it's a good place to have a bumpy time but you know and now you also have two follow-ups the first one is you discuss a little bit about seasonality day the week effects which I've always found interesting because some of them it feels like you can kind of understand why it might be there from an economic cycle or porty cycle whatever and then sometimes it's like why is this here what is your approach when you're analyzing different kind of like seasonality tendencies which I would also include you know day at week effects and stuff like that to determine like is there something actually here versus is it just that four thirds days in a row S&P closed down? Yeah that's a good question I mean I I think most seasonality effects should be taking with a grain of",
    "start_timestamp_seconds": 3741.08,
    "end_timestamp_seconds": 3831.24,
    "start_timestamp": "01:02:21",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3741",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "day at week effects and stuff like that to determine like is there something actually here versus is it just that four thirds days in a row S&P closed down? Yeah that's a good question I mean I I think most seasonality effects should be taking with a grain of salt because it's always really difficult to know how real of a thing it is. I posted one around Easter showing that like the week of Easter tends to have really muted realize volatility so it's like a really good week to go do something else if you're looking for actual movement in the market. There are some that are kind of interesting like you know like if you look at realized wall averages by a bunch you will see that July tends to be a very like very chill like slow rolling low-volguined up month so it's a good short of all month it's a good good month to like long TQQQQ and go golfing and but you don't you don't want to be doing that into the fall you see that volatility like realize wall picks back up again that's pretty stable over like a number of years but you can think of why that might be right like the big operators what are they doing well they do tend to enjoy the haptons and places like that during the summer months right it's it's a time when people are going to take a little bit of time",
    "start_timestamp_seconds": 3811.16,
    "end_timestamp_seconds": 3893.88,
    "start_timestamp": "01:03:31",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3811",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "but you can think of why that might be right like the big operators what are they doing well they do tend to enjoy the haptons and places like that during the summer months right it's it's a time when people are going to take a little bit of time away from the office and they know that into the fall is going to be rebalancing it's going to be tactical allocations it's going to be end of the year stuff it's going to be distribution and so it kind of makes sense that you'd see a little bit of an uptick and movement towards the fall compared to the summer at least at least like theoretically like we can turn you know make conjecture about that. There are other ones that seem to work that I don't have any good theory for right like John Carter and his book mastering the trade has won about gap like Thursday gap fills about how like 80 80 percent of of all like overnight gaps get filled on a Thursday like it's like the highest probability day for gap fills and it does seem to work but I have no idea why that would be so I guess one of the ways I navigate that is that I just make a little note that if you if you've noticed a really large gap and it hasn't closed and it's Thursday you might want at least take a look at where the gap",
    "start_timestamp_seconds": 3881.32,
    "end_timestamp_seconds": 3960.44,
    "start_timestamp": "01:04:41",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3881",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "that would be so I guess one of the ways I navigate that is that I just make a little note that if you if you've noticed a really large gap and it hasn't closed and it's Thursday you might want at least take a look at where the gap boundary is because there's a chance that you could get a violent move there again I have no theoretical basis for why that would be but that one does seem to hit reasonably often so there are ones like that that I can't really explain. Those ones are fast I I'd heard that one before but like stuff like that is actually fascinating to me because the way you described it there also I think highlights the balance between being like a researcher and a practitioner because there's the research side of like why might this be can I come up with something but then there's a practitioner side of well it's fucking happening so I'm still going to pay attention to it. Yeah and like if you I mean a really good example right is the what was the big move it was it was Thursday November the 20th right I mean that was a gap fill right so if you look at that move right we break the we break the straddle implied break even we go to the second standard deviation we keep going down all the way through to fill the gap on a Thursday so",
    "start_timestamp_seconds": 3945.4,
    "end_timestamp_seconds": 4028.76,
    "start_timestamp": "01:05:45",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=3945",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "right I mean that was a gap fill right so if you look at that move right we break the we break the straddle implied break even we go to the second standard deviation we keep going down all the way through to fill the gap on a Thursday so so at least at least in your mind right at least in your mind like having an idea of like where that gap fill level would be and then maybe like taking a strike around there and paying attention to it not a bad idea right again it's not trip this is not there's not like a foolproof thing but is something that I pay attention to yeah that's absolutely awesome that's super cool I had just one or two more things I literally could like an bullshit with you all day I I love trading and it's really cool to talk to somebody like you about this stuff so a preemptive thank you but we we were talking before about behavior biases and one of the things that I've found personally is a lot of people will say like how stressful trading is and I have to be honest with you I've been doing it this will be 19 years coming up and I don't find it stressful like a genuinely a genuinely and I think a lot of that has to do with perspective and just learned experience and stuff like that I spent a good bit of",
    "start_timestamp_seconds": 4005.4,
    "end_timestamp_seconds": 4097.0,
    "start_timestamp": "01:06:45",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4005",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "with you I've been doing it this will be 19 years coming up and I don't find it stressful like a genuinely a genuinely and I think a lot of that has to do with perspective and just learned experience and stuff like that I spent a good bit of time in the military so it's like when I'm waiting stuff there versus what's going on at the market it's like yeah I don't want to lose money but that's still got all my fucking limbs like that's not so bad now you've decided to go punch people on the face and get punched in the face again and it's always a fascinating life choice to make that choice and the first thing that comes to my mind is resilience and how doing stuff like that can help do you find that to be the case where when you do something like fighting and then you sit down at the computer and you're like well today was an ideal but there wasn't a 260 pound man throwing an overhead right trying to cave my fucking skull in. Well that's an eloquent way to put it like that. No it's I agree with you I mean like something that it's a line from our book that I thought was was extremely on point where you and says trading is not a uniquely stressful job and that is very true I mean it's like compared to what compared to being shot at",
    "start_timestamp_seconds": 4073.48,
    "end_timestamp_seconds": 4171.0,
    "start_timestamp": "01:07:53",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4073",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "agree with you I mean like something that it's a line from our book that I thought was was extremely on point where you and says trading is not a uniquely stressful job and that is very true I mean it's like compared to what compared to being shot at right you know in the military compared to you know compared to doing like a halo jump night or something compared to saving someone's life is a paramedic right you know compared to being a bouncer in a in a 20 on 20 street melee with weapons compared to you know there are there are a lot of things that are that are far more viscerally stressful because you know there's a life in death element. RISKING MONEY is stressful when you lack the training and you lack the experience and you lack an edge so everything feels like magic it can make it very stressful particularly if you're overbedding or if you're in a situation where you're risking money that you need to live you know all of those things can contribute to stress but but ultimately it's nowhere near the most stressful thing that you could do fighting MMA all that stuff I mean comes comes from the bouncing days right and you know it's it's not at the level of like you know what I would expect your experience was with the military but but in terms of the general you know stress tolerance that it builds",
    "start_timestamp_seconds": 4154.44,
    "end_timestamp_seconds": 4248.12,
    "start_timestamp": "01:09:14",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4154",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "MMA all that stuff I mean comes comes from the bouncing days right and you know it's it's not at the level of like you know what I would expect your experience was with the military but but in terms of the general you know stress tolerance that it builds up for a dealing with high tension situations after you go through things like that something like trading doesn't feel like this life or death you know battle anymore it feels more like a challenge that that is surmountable shall we say so yeah just just decided you know I'm not getting any younger probably if I want to fight again the time is as soon as possible because I'm starting to get up there in years right so I was even like 42 I'll be 43 in a couple of months so it's one of the those things where it's like you know if you if you got something left in the tank as so best there's said in the last rock you movie if you still got some stuff in the basement you know it's it's probably time to get it out well well all your joints work and all that stuff right so well they get it yeah well you're also in heavyweight and for those that don't know like it's common for dudes to be you know older than what they would consider you know for like fly weights lightweight like most of those dudes are",
    "start_timestamp_seconds": 4233.8,
    "end_timestamp_seconds": 4318.84,
    "start_timestamp": "01:10:33",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4233",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "and all that stuff right so well they get it yeah well you're also in heavyweight and for those that don't know like it's common for dudes to be you know older than what they would consider you know for like fly weights lightweight like most of those dudes are fucking 25 year old ninjas but there's a reality when there's a little bit more mass and you have to move differently because there's always that lingering risk and that's there what what made you choose obviously you feel like there's something left in the tank but there's also as anybody that's ever done combatants do you know that there's very real risk of injury it's not like this thing in the movies where like somebody gets like a bloody nose and their nose is set and then they're good like you can get fucked up so what made that risk reward decision to the point where you're like I accept that risk and I want to do it for XYZ reason that's really it's a really good question you know that's not the easiest thing to explain I guess I guess if I was going to explain it it's something like it's something like it's important to do things that are meaningful to you because doing meaningful things is what gives life meaning you know it's like like there's it's all good and well to be to play it safe with regards to a lot of things right like",
    "start_timestamp_seconds": 4301.48,
    "end_timestamp_seconds": 4393.96,
    "start_timestamp": "01:11:41",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4301",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "something like it's something like it's important to do things that are meaningful to you because doing meaningful things is what gives life meaning you know it's like like there's it's all good and well to be to play it safe with regards to a lot of things right like you know you should drive safely and all that good stuff but like there is a time to take risks and to feel alive you know you should tell that girl that you're in love with her you should you know you should take those risks you should sign up for that fight like I said I just I just realized hey it's you don't want to look back five years from now and think hey I wonder what would have happened if I'd taken that last fight because now I can't or or whatever right and so I just think that the timing is right I had some health issues for the last couple of years that I recently was able to overcome it's awesome my yeah you know knee injury completely healed blood work is like perfect now like everything is looking up and it really gave me like this big boost on life where I thought you know what I should celebrate this by pushing myself right back to that it's level again and that's absolutely awesome and so talk to me a little bit about like the the mental preparation side of stuff where we're still",
    "start_timestamp_seconds": 4373.96,
    "end_timestamp_seconds": 4460.84,
    "start_timestamp": "01:12:53",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4373",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "like this big boost on life where I thought you know what I should celebrate this by pushing myself right back to that it's level again and that's absolutely awesome and so talk to me a little bit about like the the mental preparation side of stuff where we're still talking I guess a little bit about mentality but like any combat as I've ever done involves a lot of physical preparation it's kind of like a given a technical preparation that's also kind of a given there's a little bit of gamesmanship to that but the mental side of it is fascinating to me so what what does that look like for you like as you start kind of getting in the correct headspace to go into combat? Well I mean the starting stuff is actually there's lots of parallels right the starting stuff is all fairly monotonous tedious repetitive stuff that most people don't want to do so if that rings a belt anyone you know you can connect the dots there but it's you know you start cleaning up your diet you do in cardio and you know high intensity like interval training five or six days a week you're you're adding in one or two like really heavy like kind of mens or style strength training to keep your your strength in your muscle up while you're your cutting weight you're making sure that your nutrition is right in terms of like you know you're getting",
    "start_timestamp_seconds": 4441.8,
    "end_timestamp_seconds": 4525.32,
    "start_timestamp": "01:14:01",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4441",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "a week you're you're adding in one or two like really heavy like kind of mens or style strength training to keep your your strength in your muscle up while you're your cutting weight you're making sure that your nutrition is right in terms of like you know you're getting you getting enough magnesium and zinc and electrolytes and all this kind of stuff for me it included quitting nicotine your viewers may notice this is the first podcast I've done with our big plumes of smoke shot on you yeah so you know so that was that was a part of it I went back I went back to a new tropic stack that I used in law school actually to get over like there with draw effects so it's it's been pretty breezy and when you have a goal in mine too it kind of like you know it helps galvanize you towards that in in a way that makes things a little bit easier as well but once once you get all that moving in the right direction right you're trying to get I would say like within within ten or fifteen pounds of fight weight and then you start getting back into your technical training so this is like you're getting your timing back for your combinations your footwork your head movement your defense your transition from like hands to like ground game to defense whatever and then like you said the very end you be",
    "start_timestamp_seconds": 4509.08,
    "end_timestamp_seconds": 4585.4,
    "start_timestamp": "01:15:09",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4509",
    "chunk_index": 65,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "then you start getting back into your technical training so this is like you're getting your timing back for your combinations your footwork your head movement your defense your transition from like hands to like ground game to defense whatever and then like you said the very end you be looking at gamesmanship because like you're nobody's edges that they throw a good like straight cross right everyone can throw a straight cross so now it's about how do we set up the footwork how do we tempt the opponent into a position where the straight cross now is the correct move and so that's kind of like the final icing on the cake where you're you're getting that you're getting those elements kind of dialed in and then usually usually you're pretty close to fight night by around that time so so your fight is next year in the hall yeah yeah we're aiming right now for fall 2026 I'm not sure if it's going to be in in Calgary or if it's going to be in left bridge but I'll figure that out probably in the next six months or so when I talk to the promoters after after getting through the the weight shred component yeah that's awesome man well first of all absolutely looking forward to it genuinely like it it's something where people can go I want 100% would come fly and hang out because yeah you should man there's you can come you can",
    "start_timestamp_seconds": 4567.88,
    "end_timestamp_seconds": 4649.96,
    "start_timestamp": "01:16:07",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4567",
    "chunk_index": 66,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "after getting through the the weight shred component yeah that's awesome man well first of all absolutely looking forward to it genuinely like it it's something where people can go I want 100% would come fly and hang out because yeah you should man there's you can come you can definitely come get tickets it'll also be be available on paper view worldwide so hopefully I'm hoping that we could get some you know some fin-tuit people there for sure I'd be cool yeah it would be super cool because it like anytime that I've competed I've always preferred that but I've developed a new genuine joy for just eating popcorn while dudes are punching each other in the face so I will happily play the other side of the coin here for you and you know I'll do my part do my part right on yeah well dude thank you so much for spending some time talking through we actually got through a lot of like really really interesting details and believe it or not I have a sheet of notes that I want to discuss with you at some future time as well kind of like follow follow up to this session I think it'd be really good but yeah we're we'll do around three one of these days no problem yeah yeah that that sounds absolutely great for folks that want to get a hold of you where where can they find your work easiest places on",
    "start_timestamp_seconds": 4638.52,
    "end_timestamp_seconds": 4712.2,
    "start_timestamp": "01:17:18",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4638",
    "chunk_index": 67,
    "word_count": 250,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "up to this session I think it'd be really good but yeah we're we'll do around three one of these days no problem yeah yeah that that sounds absolutely great for folks that want to get a hold of you where where can they find your work easiest places on Twitter x at gingffaith killa I've got a link in the top there that's got all the books and links to all the podcast including our previous one together but you can find those as well on YouTube Spotify all over the place so and then books on Amazon including the one that I wrote with you and that we've talked about rather extensively during this conversation which is a must read by the way that that's like one of the the better practitioner level books that I can think of to point people towards because you guys include enough theoretical stuff but you spend the line sure the time for more practitioner lines which is awesome I appreciate that thank you yeah awesome man well thank you for hanging out and for everybody thanks for hanging out to the end you will catch again probably brief fight will see how it goes and yeah looking forward to seeing you murder someone thanks again for having me or it's been great really",
    "start_timestamp_seconds": 4702.84,
    "end_timestamp_seconds": 4772.52,
    "start_timestamp": "01:18:22",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4702",
    "chunk_index": 68,
    "word_count": 222,
    "upload_date": null,
    "duration": 4777.0
  },
  {
    "video_id": "SNVvZCtKt0Y",
    "title": "Andrew Mack on Retail Options Trading | The Outlier Podcast",
    "text": "how it goes and yeah looking forward to seeing you murder someone thanks again for having me or it's been great really",
    "start_timestamp_seconds": 4765.24,
    "end_timestamp_seconds": 4772.52,
    "start_timestamp": "01:19:25",
    "video_url": "https://www.youtube.com/watch?v=SNVvZCtKt0Y",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SNVvZCtKt0Y&t=4765",
    "chunk_index": 69,
    "word_count": 22,
    "upload_date": null,
    "duration": 4777.0
  }
]