[
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "Option Greek simplified today we're honing in on Delta and Gamma. Most of this will be about Gamma, but I have a couple fun things to show you about Delta that you may not know or at least intuitively. The session here, like the last session which a link to below on Theta, is designed to give you a better intuitive relationship with Delta and Gamma. And understand better how to integrate these functions to inform your decision making as you're putting on different positions. It's super important to understand how these work and we're going to get into it first. We will start with a quick overview of another video that goes through all of the Greeks in detail. I will link to that in the notes as well, but we will start here very very quick with both Delta and Gamma. Delta simply tells us the rate of change of an option's premium per 1.5 in the underlying. And then Gamma is actually a second order Greek because it's telling us how much Delta is going to change per 1.5 in the underlying. Fun fact, not really that fun or anything. It's going to impress anybody, but this is actually a second order Greek. Where is everything else in terms of the primary Greeks Delta Gamma Theta Vega and Ro lives here. It's just really not that impactful for most people. They're all first order, but Gamma is actually second order. All right, let's now talk about Delta",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 96.0,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "is actually a second order Greek. Where is everything else in terms of the primary Greeks Delta Gamma Theta Vega and Ro lives here. It's just really not that impactful for most people. They're all first order, but Gamma is actually second order. All right, let's now talk about Delta and Gamma. I want to talk about some of the actual practical ways to interpret in use both of these. So first, the way to think about Delta is it gives us an understanding of exposure and I'll show you. If we take a look at spy, I have the six 65 calls that are 39 days out highlighted. These have a Delta of 53. What that tells us is that if spy goes up by a dollar, the premium here will increase by 53 cents. Cetarist, Perivis, meaning everything else remaining the same, which isn't the case as we know multiple effects have counter counter effects that impact one another. You'll understand a couple of those with respect to Delta in just a few moments. So, I think that's not theoretically and to as a baseline concept. That's all this tells us. Another way to think about this, we know every single option's contract relates to 100 shares of the underlying that's the standard size. Right now, these 65 calls are actually behaving like 53 shares it moves just a little bit 53 shares of spy, not the 100. That's really, really important to understand. So what this means",
    "start_timestamp_seconds": 79.0,
    "end_timestamp_seconds": 196.0,
    "start_timestamp": "01:19",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=79",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "know every single option's contract relates to 100 shares of the underlying that's the standard size. Right now, these 65 calls are actually behaving like 53 shares it moves just a little bit 53 shares of spy, not the 100. That's really, really important to understand. So what this means is if you had 100 shares of spy and it moved to dollar, you get that full one dollar move in your P&L. If you have one call right now looking at the 65, you only get 53 cents if spy moves that full dollar. And there's a specific reason why this works, this has to do with convexity, which you will understand a little bit more in detail with gamma. Now, let's talk about some of the specific traits. The relationship with time is linear and nonlinear that might sound a little confusing, but I will explain why actually with a graph. This is showing you a plot of four days to expiration 39.95459. These are the deltas for the six 70 call. So we can see it four days to expiration. It has 28 deltas at 39. It is 47 deltas at 95. 52 deltas at 459. 59 deltas. The deltas for this six 70 call change in different expiration. This is the nonlinear aspect. You actually notice that delta de case as you get closer in time looking at the same option. So again, if I am looking at the 60 70 call out 459 days, it",
    "start_timestamp_seconds": 159.0,
    "end_timestamp_seconds": 282.0,
    "start_timestamp": "02:39",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=159",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "deltas. The deltas for this six 70 call change in different expiration. This is the nonlinear aspect. You actually notice that delta de case as you get closer in time looking at the same option. So again, if I am looking at the 60 70 call out 459 days, it is a 59 deltas. But if I'm looking at that very same strike at four days, it only is a 28 delta effectively half of what it is 459 days out. That's the nonlinear element to delta. And for those wondering, this decay in delta is known as charm, which the more in depth video on the Greeks goes over all of those in detail, but that's what you observe here. The linear element to delta has to do with raw deltas. So what this means is if I look at this 50 delta, the 6067 calls. If I look at a 50 delta option, it's 50 deltas no matter what time frame. So 50 deltas in 39 days is the very same 50 deltas. If there was a 50 delta here in four days. That means removing everything else, if the underlying moves up by a dollar, it doesn't matter if your 50 deltas are four days or four hundred days, you get 50 cents doesn't matter. So when we normalize it off of delta, it's the same regardless of expiration delta is delta. But when we normalize it off of the strike, that's when we see the nonlinear",
    "start_timestamp_seconds": 248.0,
    "end_timestamp_seconds": 357.0,
    "start_timestamp": "04:08",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=248",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "matter if your 50 deltas are four days or four hundred days, you get 50 cents doesn't matter. So when we normalize it off of delta, it's the same regardless of expiration delta is delta. But when we normalize it off of the strike, that's when we see the nonlinear function of delta. Let's talk about a couple other things. We already know the standard relationship with delta, which is as options go in the money delta approximates to one. And as delta's go further and further out of the money delta approximates to zero. Every single option at expiration has to make a choice. It's either going to be a delta of one or a delta of zero. Delta's of zero have no intrinsic value. They expire worthless. Any option with a delta of one has some amount of intrinsic value and is not going to expire worthless. That doesn't mean it's going to be a profit. It's just not worthless. That is probably one of the most understood elements. I don't think that's too crazy for anybody. Again, though, have a little bit of a basic video that you can check out. This is really designed to give you more of an intuitive understanding. But I now want to talk about these two things on the unique traits. The end of the money probability and volatility skew. I have a video that talks about the probability calculation itself so that you can understand how an option's probability is",
    "start_timestamp_seconds": 343.0,
    "end_timestamp_seconds": 434.0,
    "start_timestamp": "05:43",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=343",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "you more of an intuitive understanding. But I now want to talk about these two things on the unique traits. The end of the money probability and volatility skew. I have a video that talks about the probability calculation itself so that you can understand how an option's probability is actually calculated. But we often use delta as a quick approximation and I'm going to show you how that works. Let's start with these four day options. If I look at this 40 delta call, this is the 667 call. That would infer a 40% probability of being in the money at expiration and an 80% probability of a touch prior to expiration. The way this works is when you use delta as a proxy. If you look at the probability of a touch, if you look at the actual calculated probabilities, which is a different formula, very, very important to understand. It's close, but not the same. The probability, the actual probability is 39.6%. That's pretty damn close, like right on the money effectively. However, if I go out here now, further out in time, 459 days, and I find that same 40 delta option. This is now the 730s. The probability calculated here is 34.3%. That is now almost a 6 point variance between these two metrics. That's massive. This gets blown out even more when we look at really volatile names that are not like spying. For example, if I just go super far out in the",
    "start_timestamp_seconds": 419.0,
    "end_timestamp_seconds": 556.0,
    "start_timestamp": "06:59",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=419",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "730s. The probability calculated here is 34.3%. That is now almost a 6 point variance between these two metrics. That's massive. This gets blown out even more when we look at really volatile names that are not like spying. For example, if I just go super far out in the money, not even that far, but if we go to the 15G and 27G, I go to the 50 delta options here. Take a look. These are a 50 delta that would infer a 50% probability of being in the money. If I look at the actual calculated probability, it's 25.7%. That's a 25 point variance. That's massive. So this is why delta as a probability is okay to use in lower volatility names, and when you are closer in time. Once you start getting outside of the 60 day window, that relationship starts to break apart pretty bad. If we take a look in Tesla, this 49 delta is calculated at a 39%. That's still in same difference. It's a 10 point difference for something that's 67 days. That's because of the volatility. If we look in spy and we look at the same window, this 50 delta option here, that is a 47% probability. Much, much closer. So keep that in mind. Essentially, once you start getting outside of 60 days, the variance gets bigger. And if you're trading something that's volatile, the variance is massive. And we actually just talked a little bit about that volatility skew.",
    "start_timestamp_seconds": 504.0,
    "end_timestamp_seconds": 635.0,
    "start_timestamp": "08:24",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=504",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "here, that is a 47% probability. Much, much closer. So keep that in mind. Essentially, once you start getting outside of 60 days, the variance gets bigger. And if you're trading something that's volatile, the variance is massive. And we actually just talked a little bit about that volatility skew. This is why delta shifts the way it does, is because of the way that time is used in correspondence with volatility, which is the square root of time. This starts getting into some formulas, which again, that other video that I cited about the specifics on the relationship between delta is a probability and the actual calculation of probability of probability being in the money. I have those formulas broken out for you, so you can see them specifically. But this is part why you see the change that you do. And you can also see that charm or delta decay really accelerates as you get closer in time. All right, let's talk about gamma. Gamma is completely nonlinear. It's the highest or the at the money options. It gets lower when you're deep in the money or deep out of the money. Gamma is effectively what provides an option convexity, which is how much the thing moves per point move in the underlying. So here's how this works. I have the same delta, which is the x axis here. I used a 10 delta 30 delta 50 delta 70 delta 90 delta. I plotted those across different durations",
    "start_timestamp_seconds": 617.0,
    "end_timestamp_seconds": 725.0,
    "start_timestamp": "10:17",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=617",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "option convexity, which is how much the thing moves per point move in the underlying. So here's how this works. I have the same delta, which is the x axis here. I used a 10 delta 30 delta 50 delta 70 delta 90 delta. I plotted those across different durations for days 39 95 459. So take a look at the relationship here. This is all in spy, by the way. Looking at the four days to expiration notice how much gamma moves the at the money the 50 delta is quite high. And then as you go in the money, it almost cuts in half and it cuts more in half as you go super deep in the money versus out of the money. Notice how that flat ends out as you go further out in time. This is because gamma is the highest at the money and it's higher as you get closer in time. So for example, if we look in spy, we just look at the at the money numbers. You can see gamma is like 0.04 something for the at the money's. I go far out in time to 248 days just using the 50 delta again. Gamma is 0.004. Why is that? Why is it so low? Look at this chart or flip the page that also can happen. Look at this chart over here. Every single option here has to make a big decision as it gets closer to expiration. It's either going",
    "start_timestamp_seconds": 700.0,
    "end_timestamp_seconds": 799.0,
    "start_timestamp": "11:40",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=700",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "delta again. Gamma is 0.004. Why is that? Why is it so low? Look at this chart or flip the page that also can happen. Look at this chart over here. Every single option here has to make a big decision as it gets closer to expiration. It's either going to be in the money or out of the money. That is why you see gamma spike because all of these options have to make big changes before expiration either delta of 1 or delta of 0. Options that have more time don't have to make that big decision quite as fast. So how does this impact decision making? Well, we know then if we sell options that are near in time, your P and L is going to move a lot. And it's because gamma is going to move a lot, which impacts delta, which is the measure of the rate of change of premium. We also know that if you go further out in time, you're going to get less gamma. Why does that matter? Really, really simple. If we take a look at different options positions. I'm looking at the 671 call out in those different expressions that we were just looking at four days out to 400 plus. I want you to take a look at the really near term call the four day call. Take a look at the P and L at the extremes plus 15% move minus 15% move. Notice how cheap this",
    "start_timestamp_seconds": 780.0,
    "end_timestamp_seconds": 869.0,
    "start_timestamp": "13:00",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=780",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "that we were just looking at four days out to 400 plus. I want you to take a look at the really near term call the four day call. Take a look at the P and L at the extremes plus 15% move minus 15% move. Notice how cheap this option is a dollar 39. Take a look at the P and L if it goes up 15% you make 9200 bucks the most you can lose is 139. That is like the pure definition of an asymmetric profit opportunity. So why would this exist? Because this is highly improbable in this timeframe. This is what they call lot of tickets. Now let's take a look at roughly the 40 day option. Notice how the top side P and L looks about the same. You start losing a little bit. You start losing more the downside. Because your option is now more expensive. Why? Because the contract has more time. Let's go out again to like the 90 day options. Notice how your P and L now has come down over a thousand dollars. And compared to the short why? Because it has less gamma. What this means is every single time that spy goes up a dollar. This option is going to compound much faster. You can take a look at it multiplied out here. Your gamma is 3.758. This is multiplied out for 100 shares. So your gamma is going to absolutely skyrocket as you get a move",
    "start_timestamp_seconds": 850.0,
    "end_timestamp_seconds": 956.0,
    "start_timestamp": "14:10",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=850",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "single time that spy goes up a dollar. This option is going to compound much faster. You can take a look at it multiplied out here. Your gamma is 3.758. This is multiplied out for 100 shares. So your gamma is going to absolutely skyrocket as you get a move in your favor. If I go out to those 90 day options take a look at your gamma. This is again multiplied out for 100 options. It's 0.778. So as you deal with options that are further out in time, they're going to have less gamma overall. But that should be a massive decision point, especially if you choose to say for example, buy options. Because when you buy options that are further out in time, you're not benefiting from gamma anywhere near as much barely at all. You still have a leveraged play because it's cheaper for you to buy the by the option than 100 shares. But nonetheless, it's going to behave a lot differently. This is exactly why having an intuitive understanding of the Greeks is super, super important. We spend a lot of time in the outlier pro workshops building different ways to visualize this kind of stuff to make the decision making a little bit faster. So that when you're deciding to buy a vertical spread, sell a vertical spread, buy an option, sell an option. You understand how all of these different things impact your position very quickly. Doesn't have to be this massive",
    "start_timestamp_seconds": 930.0,
    "end_timestamp_seconds": 1026.0,
    "start_timestamp": "15:30",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=930",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 1064.0
  },
  {
    "video_id": "Sol_YuCGQmc",
    "title": "A Practical Guide to Option Delta and Gamma ",
    "text": "of stuff to make the decision making a little bit faster. So that when you're deciding to buy a vertical spread, sell a vertical spread, buy an option, sell an option. You understand how all of these different things impact your position very quickly. Doesn't have to be this massive sit down exercise once you learn it. But this is also why people light their money on fire. People will sell options that are really close in time. Just see them get wrecked because of gamma or people will buy options that are super far out in time to try and decrease your a theta decay. However, you don't benefit from gamma. So if you get a really low delta that's super far out in time because you're picking the strike you want it to hit. You might not make much at all even if there's a massive move and it's because delta is low, gamma is low. So your delta is not going to change that much. If you have any questions, let me know. Be an outlier. See you later.",
    "start_timestamp_seconds": 1008.0,
    "end_timestamp_seconds": 1061.0,
    "start_timestamp": "16:48",
    "video_url": "https://www.youtube.com/watch?v=Sol_YuCGQmc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sol_YuCGQmc&t=1008",
    "chunk_index": 12,
    "word_count": 182,
    "upload_date": null,
    "duration": 1064.0
  }
]