[
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "What's up everyone? Welcome back to Outlier podcast, Chris and I are in the middle of talking about a bunch of random bullshit about VOL and I would love to get back to that quickly. But before that is always awesome to chat with you. Welcome back on. Thanks Eric. It's a pleasure to be here as always. Okay. So we were literally just talking about risk premiums across the curve and you were saying in generally you would expect to see slightly fatter risk premiums for the longer tail. Does your understanding of that with that extent out is pretty much in a perpetuity or is the point that you think it actually starts to roll over? Well, I think for us in S&P typically the VOL term structure is in contango when you're sort of like normal level to evolve. So the back month falls will trade at a premium to the realized VOLs generally. I mean to the front month falls. So it just tends to be more risk premium as you go as you go out in time. And you're one of the only people I've seen actually discuss the difference between at the money and at the forward. And I actually had a couple conversations because it's something I actually came across in that book over there. It's kind of shaded out. But that's options is a strategic investment by Larry MacMillon. Good book. And it doesn't seem like it's normal of a conversation at",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 82.64,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "at the forward. And I actually had a couple conversations because it's something I actually came across in that book over there. It's kind of shaded out. But that's options is a strategic investment by Larry MacMillon. Good book. And it doesn't seem like it's normal of a conversation at least for retail. Like I think most of the time retail is completely unaware that there's a difference marginally depending on where you're looking. Could you talk about the difference between at the money at the forward? Yeah. So the, let's funny. It's been a topic I've been writing a lot about this year in general option funding and how that how that how interest rates and cost of carry plays into the value of option. So what that at the forward is doing is it's saying, so let's say you're your stock or your index is at a hundred dollars and the interest rates are four percent. Just assume no dividends. You're at the forward price is going to be 104. And that that's going to be a four percent premium to the spot price one year out. The reason is is, it has to do it's basically a no arbitrage reason. It's for example, if you wanted, if you were wanted to buy a one year, the S&P synthetic feature a year in advance, right, you could, it needs to trade at 104. Let's just say if it traded 100, there would be free money because if it",
    "start_timestamp_seconds": 67.08,
    "end_timestamp_seconds": 161.0,
    "start_timestamp": "01:07",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=67",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "no arbitrage reason. It's for example, if you wanted, if you were wanted to buy a one year, the S&P synthetic feature a year in advance, right, you could, it needs to trade at 104. Let's just say if it traded 100, there would be free money because if it traded for 100, you could buy the future, you could short the S&P at 100. You could buy the future for 100. And you would have no directional risk, you'd be long and short. And you would collect four percent interest on your short, assuming you're collecting able to collect four percent on your short proceeds on your S&P, you would basically be earning a free four percent. Because it takes almost no very little capital to do that trade, it's not infinite return, but it's like a really fat return, that four percent, because it doesn't take much capital to do it. Therefore, the price that makes it so that there is no arbitrage is 104. You would need to pay 104 for that synthetic feature. So the 104 price is the at the forward. And the at the forward price is also the price that a lot of people may be familiar with the approximation that the straddle is 0.8 of the wall. That is true at the forward, and that is where the derivation for that formula comes from the at the forward price. And generally speaking, there's multiple strikes that are of major interest to option",
    "start_timestamp_seconds": 140.68,
    "end_timestamp_seconds": 243.44,
    "start_timestamp": "02:20",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=140",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "people may be familiar with the approximation that the straddle is 0.8 of the wall. That is true at the forward, and that is where the derivation for that formula comes from the at the forward price. And generally speaking, there's multiple strikes that are of major interest to option traders, that the strikes are, excuse me, use your spot price, is you're at the forward price, which is the sort of like mean of the distribution that blacksholes prices, it's options are around. And then as you're 50 delta strike, because you're 50 delta strike will be a bit higher than you're at the forward price. And the 50 delta strike is important because it is the point at which the Vega in Gamma of an option are that that's where they're maximized. The maximum Vega is happening at the 50 delta option. So that's why those strikes are of special interest. So again, spot at the forward 50 delta. If I open the 20 fed in spy 160s out, walk me through what you're seeing here. So right now, I just, 675s on the call side are a 53 delta. And then we essentially get a 50 delta at the 60 80s. Okay, let me do this thing which I like to do before I look at the numbers, is I try to say, what do I think it would be? Like I've really just fucked that up for you, sorry. No, no, no, no, I didn't, I",
    "start_timestamp_seconds": 222.6,
    "end_timestamp_seconds": 319.84,
    "start_timestamp": "03:42",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=222",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "at the 60 80s. Okay, let me do this thing which I like to do before I look at the numbers, is I try to say, what do I think it would be? Like I've really just fucked that up for you, sorry. No, no, no, no, I didn't, I didn't know where I could get my perfect. I didn't hear you fast enough. So I was saying, what do I think it would be? So you say the 160s out. So that's about one, one third of the year. I know that a one year interest rate is about in the market right now in the yield curve. Is somewhere around 4%. I also suspect the S&P has a dividend yield of something in the one and a half percent to 2% ballpark. So 1.1. All right, I'm high. All right, so 1.1. So let's say you have a 4% interest rate, but you have to take out the dividend yield to get to the forward. So we're going to call that just 3%. So if the index, I would expect that the forward be 3% higher than the index for one year. But we're talking about a third of a year. So I would expect that the forward is 1% higher than the index and it be index is 670. Then we're talking about 6, almost 677. So that's what I would expect the forward price to be. And the forward price is where the call and the",
    "start_timestamp_seconds": 305.6,
    "end_timestamp_seconds": 385.36,
    "start_timestamp": "05:05",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=305",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "of a year. So I would expect that the forward is 1% higher than the index and it be index is 670. Then we're talking about 6, almost 677. So that's what I would expect the forward price to be. And the forward price is where the call and the put should be equal. So the mid mark. So if we look at the 677 strike, we don't have one of those. I can go to the 85s, which will probably have. Yes, there we go. I just moved us in a little bit like 15 or 20 days or so just so that because the wheat leaves have single strikes, the primary expiration just moves in five or five strikes. So we're five points. So you, okay, so you cut 15 days off of it? I did. So that cuts 10% off of the amount of premium right in there. So let's drop it to the 676 strike. Which, 20 now if I actually think the 677 was perfect here, probably because of the rest of the number estimations. But the 676 is a 51 delta on the call side. And put side is about a 50 delta. It's 49 and a half. What, and what, what are the mid market price of the options? Do we have them here? Yeah, I see 2143 by 50. So 2146. Okay, and what's the mid price of the put? Mid price of the put at 76, 2127. Okay, so there you",
    "start_timestamp_seconds": 367.36,
    "end_timestamp_seconds": 461.76,
    "start_timestamp": "06:07",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=367",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "49 and a half. What, and what, what are the mid market price of the options? Do we have them here? Yeah, I see 2143 by 50. So 2146. Okay, and what's the mid price of the put? Mid price of the put at 76, 2127. Okay, so there you go. So 2146 minus 2127 is a 20 cent premium to the call. So the forward here is implied to be like we're really close. The forward there is implied to be 676.2. So that is the forward price, which is what did we say? We said 677 originally and it's like we just said we lowered it the 676. And here we're getting 676.2. So that's the forward. Notice the delta. Now what's interesting is the delta, the delta is slightly higher. So remember that that's not the 50 delta option. The at the forward option is not the 50 delta option. So here we see that the at the 50 delta option is a little bit higher. I look to the 679 strike. E78 or 678 strike. Counting around a little bit. But yeah, yeah. So the 50 delta 678, the forward is 676. And the spot is 673. And what's the practical use or this information? Yeah, I think of I just think of the at the forward is the the center of the distribution. So it's like it's like it's the it represents the sort of like the expected return of the stock and sort of",
    "start_timestamp_seconds": 435.6,
    "end_timestamp_seconds": 543.44,
    "start_timestamp": "07:15",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=435",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "673. And what's the practical use or this information? Yeah, I think of I just think of the at the forward is the the center of the distribution. So it's like it's like it's the it represents the sort of like the expected return of the stock and sort of a risk neutral world. So it's it's the it's the zero point of the black shoals distribution. If you're looking at like the histogram. That you're at the forward is zero point. And you know that will matter if for example, it's kind of it's it's a like if you're thinking of a spot price of 678. And you're talking about a near data option. The forward doesn't really matter. It's going to be close to 678. But it's a little jarring when you look out and you're like, wait a minute. If I look out a year in advance, it's like, you know, it's like 4% higher than than 6070 is, you know, a call it 25 bucks or whatever. It's like, wow, the forwards like way way up there. And it looks weird if you're not aware that that's kind of how this works. So you'd be like, why is the, you know, the $700 synthetic, the one that costs zero, you know, the call on the put or the or the say the call on the put of the same value on like maybe like the 700 strike, but you would be like, well, wait a minute,",
    "start_timestamp_seconds": 519.04,
    "end_timestamp_seconds": 607.76,
    "start_timestamp": "08:39",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=519",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "why is the, you know, the $700 synthetic, the one that costs zero, you know, the call on the put or the or the say the call on the put of the same value on like maybe like the 700 strike, but you would be like, well, wait a minute, it shouldn't put be worth way more because it's like, it's, you know, it's 25 dollars in the money. So it's like, it looks like option prices could like look confusing to you. If you don't understand like, oh, no, that that actually makes sense because that's the point where the synthetic is worth zero, meaning that the call on the put or worth exactly the same. Even though the put is 25 dollars in the money. So that that's, I think the practical use of it there is just, you know, it's the center of your distribution and you're thinking about terms sort of like probabilities, but it's also just to make sense at the option chain when you're looking at it. Yeah, that's absolutely awesome. And then another thing that I don't know if you've written about, I presume this is part of your, your broader, your correct me if I'm wrong, but sometimes people will ask me when looking at a platform like this is a good question, which is like, why is it that sometimes your delta's for the calls and puts can add up to greater than one, which typically opens the conversation between spot",
    "start_timestamp_seconds": 597.28,
    "end_timestamp_seconds": 676.96,
    "start_timestamp": "09:57",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=597",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "me if I'm wrong, but sometimes people will ask me when looking at a platform like this is a good question, which is like, why is it that sometimes your delta's for the calls and puts can add up to greater than one, which typically opens the conversation between spot delta, forward delta, but I'm curious the way that you would describe that reason. Yeah, there's there's there's a I'll point to two reasons why that can happen. One thing is the, so one thing is that depending on the platform and how they're computing the implied walls, if they're just using the mid market of the option and they're giving it a rate, like when you when you can compute like a blacksholes, like you can give it an interest rate, but the other thing you can do is you could have like work backwards and said, let's assume put call parity is true. So if put call parity is true, that is the same thing is saying I must make the implied volatility on the call and the put exactly the same. So what happens is then you can back the rate out that must make that true. That's just sort of like the professional way to build a ball surface is to, is to start with the premise that put call parity is true. But that's not how a lot of platforms might do it. What they might say is I'm going to give it a 4%",
    "start_timestamp_seconds": 655.44,
    "end_timestamp_seconds": 752.0,
    "start_timestamp": "10:55",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=655",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "That's just sort of like the professional way to build a ball surface is to, is to start with the premise that put call parity is true. But that's not how a lot of platforms might do it. What they might say is I'm going to give it a 4% interest rate and then look at what the call implied wall is and what the put implied wall is. And what if you just do that, but let's say the markets implied rate is a different number than the one you give it. What will happen is you're going to get a different call ball and a different put ball. And once you have like a different ball on both, well now we can see that the delta is not necessarily have to be coherent anymore. So we're just running a different ball on each, each both the call and the put. So that and itself can create sort of a, like if you have a really high call ball, it might just give that option like a really large delta and because the call ball on the put ball are not the same, there's no reason that they need to add up to one. That's one. That's one reason, the second reason you can have delta that don't add up to one is the actually, if you think about the delta of a synthetic, it actually is greater than one because again we can go back to our example.",
    "start_timestamp_seconds": 740.4,
    "end_timestamp_seconds": 812.56,
    "start_timestamp": "12:20",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=740",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "to add up to one. That's one. That's one reason, the second reason you can have delta that don't add up to one is the actually, if you think about the delta of a synthetic, it actually is greater than one because again we can go back to our example. We'll use that our fake stock that's a hundred dollars in the synthetic future is 104. But let's say that we doubled the price of the index. So the index goes from 100 to 200. Interest rates are still 4%. Well, the synthetic is now 208. It's the 4% of 200 is added to it's 208. So the synthetic, the underlying moved 100 dollars. The synthetic went from 104 to 208. It went up by 104 dollars. So if the underlying moved 100 dollars in the synthetic moves 104, then it actually acted on a 1.04 delta. So by literally the definition of delta, like change in option divided by change in underlying. So just from that fact we know that the delta can be greater than one on a strike. And that's because what's happening here is that delta is actually 1 plus the interest rate in on the synthetic. So if the combined delta of the long call short put is greater than 100, then your call plus your put don't have to be 100. Or they don't have to they don't have to be 0. Right. Yeah. So that's the other reason. It just comes back to",
    "start_timestamp_seconds": 797.76,
    "end_timestamp_seconds": 904.0,
    "start_timestamp": "13:17",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=797",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "synthetic. So if the combined delta of the long call short put is greater than 100, then your call plus your put don't have to be 100. Or they don't have to they don't have to be 0. Right. Yeah. So that's the other reason. It just comes back to the cost of carry. Now when you're trying to compute or playing with different, vol surface models, obviously they can get like pretty complex pretty quick, especially as you start accounting for difficult factors, jumps, diffusion, things like that. When the broker is just plotting whatever the current implied vol is, on the back ends, the actual pricing mechanics for the market maker who might be providing the quotes. What kind of games are they playing to actually hide the vol that they actually think it is versus what they're laying out? Well, I don't I don't I don't think that we I wouldn't say that they are hiding the vol. I just think you know, vol is just this attempt to be sort of a measuring stick. It's not you know, again the day you're trading prices, your P&L comes down to a price. Like, P&L is how much of this options price change times the size of my position. Vol is is a way to sort of normalize across things that we can we can make a coherent comparison between different between different options. But it's not really anything that comes into play at least in equity options",
    "start_timestamp_seconds": 886.96,
    "end_timestamp_seconds": 990.32,
    "start_timestamp": "14:46",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=886",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "of this options price change times the size of my position. Vol is is a way to sort of normalize across things that we can we can make a coherent comparison between different between different options. But it's not really anything that comes into play at least in equity options between the broker and the the market maker or anything like that. Like the broker doesn't say to you, I'm going to pay 22. Now in FX they do do that. So in FX and I was never you know, over the counter FX trader or anything, but I know that in FX they do quote things in terms of vol and so a broker could say, I'll you know, I'll pay you 7% vol and the market maker could say sold and they're actually trading a vol number, not a price. But I would imagine in that market that they've kind of you know, coal last on a convention so that they make sure that they know what price they're trading at. Because again, again, the day price determines, you know, your P&L and that's whatever it cares about. Yeah, and I guess to clarify that question, I'm thinking more in terms of the bid asks that's offered and actually shown like, hey, you can transact at these prices. That's obviously going to yield a vol based on, you know, like we're saying the broker might have might use the mid price or whatever. But I assume there's a",
    "start_timestamp_seconds": 970.08,
    "end_timestamp_seconds": 1055.76,
    "start_timestamp": "16:10",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=970",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "more in terms of the bid asks that's offered and actually shown like, hey, you can transact at these prices. That's obviously going to yield a vol based on, you know, like we're saying the broker might have might use the mid price or whatever. But I assume there's a competitive game being played between different market makers in terms of knowing what other people are pricing walls at versus what your pricing walls at. And sometimes, and I don't know if this is connected, sometimes I'll find happen literally just today where I'll go to get a fill and I'll even go to the bitter of the offer. I won't even play the middle because I know it's not happening there. I'll go either or I'll be within the size and then nothing. So then I'll, you know, just slowly walk it. But I can see that there's something being offered. Maybe it's being consumed by other people on the queue. I can't see M&T and S, maybe they're there. But then I can see like there's actually a price that they want to transact at that seems different than the price that I'm seeing quoted. So then I immediately assume there's some sort of gamesmanship going on between the different market makers and liquidity providers in terms of what they want to show versus what they want to transact at. Yeah, I would say all market makers have all kinds of different strategies for how what they want",
    "start_timestamp_seconds": 1038.96,
    "end_timestamp_seconds": 1122.8,
    "start_timestamp": "17:18",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1038",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "immediately assume there's some sort of gamesmanship going on between the different market makers and liquidity providers in terms of what they want to show versus what they want to transact at. Yeah, I would say all market makers have all kinds of different strategies for how what they want to show versus what they want to trade. Like for example, and I would just kind of depart a little bit from the implied wall part because I don't, I don't actually, I think the implied wall part of it is just very specific to each firm. But every every single pair of option price stock price, whatever interest rate, the firm wants is running based upon like what their prime brokerage situation is and what their stock balance is are right because like are they pricing this option off of the long rate off of the short rate? Like all of that stuff is idiosyncratic to to the firm. I mean, this is like the kind of gets back to like when you're looking when you're pricing an option, you know, we do what we all we make all these short cuts where we're like we act because if there's one risk free rate. But like there's lots of rates and everybody has a longer short rate and it's all a lot more detailed than that. But let's just so the implied wall we can just say like pay whatever broker platform you're using has some implied wall, whatever",
    "start_timestamp_seconds": 1101.28,
    "end_timestamp_seconds": 1188.96,
    "start_timestamp": "18:21",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1101",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "there's one risk free rate. But like there's lots of rates and everybody has a longer short rate and it's all a lot more detailed than that. But let's just so the implied wall we can just say like pay whatever broker platform you're using has some implied wall, whatever analytics you're using has some implied wall. I would say that we didn't really care what implied wall was given to us by any vendor like in a professional setting because we were just going to take all those numbers and translate them into our internal way of looking at wall. Which we needed to do because especially if you trade cross asset, different assets have different calendars. So it's like, you know, crude oil expires, you know, say like, whatever is an hour and a half earlier than the equity market. Like is the settlement time for crude? So, you know, a European option and crude like settles like 230 PM Eastern time and equity options settle at 4 PM Eastern time. So you may have how you figure out what the wall corresponds between like USO and crude oil really kind of depends on like how much time is left in the day. All depends on how much time is left. And so there's different amounts of time left in each one of those options. So everybody can have a different wall and you have to have in a professional setting where you're trading for small margins, you're",
    "start_timestamp_seconds": 1171.84,
    "end_timestamp_seconds": 1260.16,
    "start_timestamp": "19:31",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1171",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "is left in the day. All depends on how much time is left. And so there's different amounts of time left in each one of those options. So everybody can have a different wall and you have to have in a professional setting where you're trading for small margins, you're going to have a very detailed approach to how you look at the wall. Separately, execution strategies can be, you could have people are streaming and then in the context of streaming, you may have, this is what the bid ask you're willing to sort of show. And now one of the things that happens is you show the bid ask and like, people don't generally want to trade really large size with electronic order necessarily because of adverse selection problems. So you want to show, you want to show an amount of, you want to show like a certain amount of size that you can trade, you don't want to get picked off. However, the base upon like the Qing rules at the exchange, like if you have a pro-reddit, pro-rata exchange which says, your the amount you will be filled on. Let's say a hundred contracts comes into buy. And a typical Q is like first in, you know, the forever's first on the order book gets, gets the, you know, if you place 200 contracts on the offer on your order book, you're the first person to do it, 100 lots comes in the buy, you get",
    "start_timestamp_seconds": 1245.6,
    "end_timestamp_seconds": 1331.92,
    "start_timestamp": "20:45",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1245",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "buy. And a typical Q is like first in, you know, the forever's first on the order book gets, gets the, you know, if you place 200 contracts on the offer on your order book, you're the first person to do it, 100 lots comes in the buy, you get them all. But on a pro-rata exchange, it could be the case that everybody's on equal standing and your fill is parada to how much size you show. So if you have five market makers who each show 200 lots on the offer for a thousand lots of total size on the offer and everybody's showing 200 each, they are all entitled to 20% of the order that comes in. So 100 lots comes into buy, everybody gets 20. You're just going to get your parada there. So what's happening there is when exchange does that, it's incentivizing you to show more size than you want to trade because you really don't want to trade 200 contracts on the offer necessarily. There are various metrics about like how many, you know, when these market makers study this stuff like how many lots, you know, if you trade over 15 lots, you start to see adverse selection in it. So like ultimately, just what they just want to trade against like smaller orders, right? They just want to trade against retail ones and too. They're happy to trade against that. So, but in this case, they're being incentivized to offer more",
    "start_timestamp_seconds": 1315.44,
    "end_timestamp_seconds": 1402.0,
    "start_timestamp": "21:55",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1315",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "you start to see adverse selection in it. So like ultimately, just what they just want to trade against like smaller orders, right? They just want to trade against retail ones and too. They're happy to trade against that. So, but in this case, they're being incentivized to offer more than they want to by the exchanges rules. But there are other situations where, you know, the bitask, the bitask is always a game because you're framing the market, you're framing, you're trying to paint it, like you're trying to paint a picture. And if you're trading something super liquid, there's not a lot of room for gamesmanship. Like because there's so much order flow that if you show like a quote unquote like low market, there's so much flow that someone might come in and lift you. But if you trade something that's relatively liquid, and you know that the next order in this name is like 75% to be a seller, then if fair value is $5, you might make your market a 48-bit offered at $5 instead of making it for 90-bit at $5, 10. So, you're going to frame your market and what will happen in that case is let's say you make the market that way, but you said it on electronic eye that says if something comes in offer at $490, lift and take it. So, don't show for 90-bit, but if offered at $490, then lift. So, that's how, so, a market maker",
    "start_timestamp_seconds": 1386.72,
    "end_timestamp_seconds": 1474.0,
    "start_timestamp": "23:06",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1386",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "that case is let's say you make the market that way, but you said it on electronic eye that says if something comes in offer at $490, lift and take it. So, don't show for 90-bit, but if offered at $490, then lift. So, that's how, so, a market maker is going to have these electronic eyes that have their real limit, you know, hidden from the marketplace, but at the same time, there are then platforms, execution platforms that you can like off the shelf stuff that you can get, like a spider rock, it's sort of like probably the most famous one in equity options, where they have algos themselves, which allow you to stream your quote. So, basically to move your bids and offers on options based upon how the stock price is moving, and then you also give you all kinds of functionality, like auto-hatch. Like if I get hit on these calls, go out and sell the shares. If I get hit on these calls, go out and leg this other option. And then they will have different levels of aggression, they will have electronic eyes. I mean, they're trying to give you as much they're trying to give you as close to the tools that market makers probably already have built in-house. They're just in off the shelf version of that. So, that's, but the whole game of bid-ask is definitely a game, but there's a lot more room for that little poker match",
    "start_timestamp_seconds": 1454.48,
    "end_timestamp_seconds": 1544.16,
    "start_timestamp": "24:14",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1454",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "they're trying to give you as close to the tools that market makers probably already have built in-house. They're just in off the shelf version of that. So, that's, but the whole game of bid-ask is definitely a game, but there's a lot more room for that little poker match if something is less liquid. If there's just like tons of two-way flow, I mean, you don't even need a market maker as much if there's tons of two-way. If you have enough like liquidity and something, you don't like a market, there's very little room for a market maker to sort of like insert themselves into that. Right, right, right, right, super interesting. And you mentioned something before that I want to follow up on in a slightly different context, which is like what the market maker or whoever, again, is providing liquidity there has in their book. And there's a retail, autistic level of focus on stuff like Gax, Dax, Charm, Bana. And a lot of these different tools that it seems like retail thing that these are like novel, new stuff, and maybe for them it is, but obviously it's stuff on the institutional side you guys have been looking at and working with for some time. Now, the main question I have here is my hypothesis with stuff like that has always been, it's of exceedingly limited utility and it goes back to what you were talking about before. The fact that if we look at",
    "start_timestamp_seconds": 1531.36,
    "end_timestamp_seconds": 1619.68,
    "start_timestamp": "25:31",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1531",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "have been looking at and working with for some time. Now, the main question I have here is my hypothesis with stuff like that has always been, it's of exceedingly limited utility and it goes back to what you were talking about before. The fact that if we look at Gax or Dax, we would assume some sort of behavior on the end of whoever's providing that liquidity, but that also has a massive assumption that they don't have other stuff that's interacting with that individual position thus actually leading to a different behavior. Could you talk a little bit about just general concepts around those kind of metrics, Gax, Bosa, Delta Exposure? And one, if you think that there's any actual practical utility for the retail side of the world, but then also your rendition of like how they actually work and how they impact things. Yeah, that's a big question. Let me, let me, let me, let's let's start with, I'll start with the first of all, the outstanding amount of Gama, these things absolutely, they matter. As far as, if there's a bunch of short Gama in the market and the stock rock starts running there and the short Gama is held by hedgers, they're going to have to respond. So, you can, you can always kind of, you can think of Greeks as sort of like an order book through time in a way. But, so it's true that these things matter, I think it's very",
    "start_timestamp_seconds": 1599.04,
    "end_timestamp_seconds": 1698.32,
    "start_timestamp": "26:39",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1599",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "the short Gama is held by hedgers, they're going to have to respond. So, you can, you can always kind of, you can think of Greeks as sort of like an order book through time in a way. But, so it's true that these things matter, I think it's very difficult to tell how they matter. Like, for example, it's because the problem is like adversarial, it's, if you think about how somebody has to generate those metrics, like there's this much Gama, what they're doing is they're looking at, they're saying there was this much options, water sold, and this region of the surface, and we know that the deltas of those options are this. But, are those are deltas that they got from where, first of all, like, like the, the, the, the market makers may not be running the exact same deltas, there could be certainly be variations of them, I, I used to run deltas on my books that were like five deltas different on, on, at the money, then they were in the marketplace for oil. So, that, so that's one is like, your deltas themselves could easily have like sort of like a 10% debt variation in them, especially like a sort of like, at the money. The other thing is that, well, in the bigger problem is like, there's, you're saying that the market makers are short, like, this is the example I used, like, you look at this and you say, well,",
    "start_timestamp_seconds": 1686.16,
    "end_timestamp_seconds": 1784.4,
    "start_timestamp": "28:06",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1686",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "debt variation in them, especially like a sort of like, at the money. The other thing is that, well, in the bigger problem is like, there's, you're saying that the market makers are short, like, this is the example I used, like, you look at this and you say, well, that's, look, market makers are short, like, all these 30 deltas and, uh, SNP puts, let's say. But, market makers job is not to just like, nakedly sell these SNP puts, right? It's like, so they're running, they're, they're like out there buying single stock puts against it. Like, they're pricing the SNP puts versus where they can get liquidity in something else. Like, to a market maker, the price for anything is dependent upon the price of, like, they're, they're offer for anything depends on where something else is offered. So, if they're running a book, where they sell a bunch of 30 deltas and P puts, they go out there and they buy a bunch of 30 delta, uh, single stock puts against it. Now you've got the situation where, well, first of all, what do you think the outstanding gamma in the market then is like, they've bought and they've sold. So, like, are you only showing me half the picture? We're not showing me that there's all this other singles stock gamma. That's one. So, this is like, and the thing is, that's a snapshot right there, 30 delta on both. But now the market starts",
    "start_timestamp_seconds": 1769.2,
    "end_timestamp_seconds": 1850.8,
    "start_timestamp": "29:29",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1769",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "bought and they've sold. So, like, are you only showing me half the picture? We're not showing me that there's all this other singles stock gamma. That's one. So, this is like, and the thing is, that's a snapshot right there, 30 delta on both. But now the market starts moving around. Everything starts doing its own wiggles. So, let's say that the SNP, that 30 delta puts, like, down 10%. This is the SNP drops 10%. And let's say that the single stocks that drop, they, they under perform on the cell-off. So, the stock to drop even more, meaning on that cell-off. So, now, you have gotten to short, your short gamma on your SNP leg and you've, you've went blown through the strikes on the single stock leg. So, the market makers have, like, done very well on the move. But, at this moment, at now, at this snapshot in time, they are, the market makers are now short in, in the money put, or equivalently, and out of the money call, and they're, sorry, they're long those, and they're short at the money SNP puts now, because we're sitting on their, on their short strike. So, now they started off hedged. Maybe they were, maybe they were over hedged by the way. Like, you're like, hey, there was all this short gamma down there. But, like, how do you know the, the market makers didn't over buy single stocks. So, maybe market makers were actually net",
    "start_timestamp_seconds": 1833.2,
    "end_timestamp_seconds": 1931.44,
    "start_timestamp": "30:33",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1833",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "now they started off hedged. Maybe they were, maybe they were over hedged by the way. Like, you're like, hey, there was all this short gamma down there. But, like, how do you know the, the market makers didn't over buy single stocks. So, maybe market makers were actually net long gamma on the move, and here you're advertising that they were short, but they were actually long, because you're not showing that set of the picture necessarily. And then when we move down there, now the market makers are short, because they're, they're shorts are at the money, and their longs are in the money puts. So, you know, accounting for all this is just very difficult problem, and then the other, okay, and then here's the, here's the, here's the complicates you'd even further. Let's take this example and say, first of all, the market makers know, because the skewlet even tell you, if put skew is super jacked, more than, you know, it's always a premium, but it's even more of a premium to that. That's because there's buyers. So, the market makers are, for so many needs get to tell me that the market makers were short those puts, because they're really, really expensive compared to their own history. So, how did they get expensive? Well, somebody bought them from the market makers. So, the market makers know that there's a bunch of short puts down. There's a bunch of short gamut down there. So, now",
    "start_timestamp_seconds": 1915.04,
    "end_timestamp_seconds": 1997.92,
    "start_timestamp": "31:55",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1915",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "short those puts, because they're really, really expensive compared to their own history. So, how did they get expensive? Well, somebody bought them from the market makers. So, the market makers know that there's a bunch of short puts down. There's a bunch of short gamut down there. So, now they have to think to them themselves, well, how do I, how do I want to deal with this? Do I want to be overhanged against them? Like extra short delta going into them? And a lot of times they may do that, but then what's their risk? Their risk is that's the stock market rallies, like it rips, because they were overheading on the short side. And I'll just tell you from my own experience, the amount of times I've been screwed by the market going in the opposite direction of my short, because I'm overhanged. It's like, you know, this is this is kind of thing that would happen a lot. Look, this is like a 5-B thing based upon like pattern recognition, but like, I would say, whenever I have been short calls, that have gotten really expensive. So, I'm short them. The way I get F is the market tanking, lower, because I'm short the calls and worried about, you know, the call is getting super big if we rally. So, I over-head my delta going into them. So, I'm running this like long delta book to lean into my calls, and then I get screwed",
    "start_timestamp_seconds": 1981.2,
    "end_timestamp_seconds": 2069.12,
    "start_timestamp": "33:01",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=1981",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "is the market tanking, lower, because I'm short the calls and worried about, you know, the call is getting super big if we rally. So, I over-head my delta going into them. So, I'm running this like long delta book to lean into my calls, and then I get screwed as the market and so my short calls go away and then I'm just like riding these long delta's down, right? So, like you would tend to get beat up in the opposite direction of where the short gamut, which is just leaves me in this place where I'm like, what are you supposed to do with this knowledge that there's a bunch of short gamut down there? Because if you lean into it, you expose yourself in the other direction. So, and one of the other things that happens is you not only expose yourself in the other direction, there's a very good chance that because again, you're running relatively vol-neutral books, if I'm short of a bunch of downside puts, yes, I might be long single stock puts, but I'm probably long upside calls because I'm not just naked short S&P Vega necessarily, right? So, I'm probably absolutely like weird risk reversal on, or some long upside calls. So, if I lean super short into those short puts and the market rips higher, I get worked on my being short too many shares against the puts. I also get worked if those calls that I'm long, if their",
    "start_timestamp_seconds": 2054.08,
    "end_timestamp_seconds": 2144.8,
    "start_timestamp": "34:14",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2054",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "like weird risk reversal on, or some long upside calls. So, if I lean super short into those short puts and the market rips higher, I get worked on my being short too many shares against the puts. I also get worked if those calls that I'm long, if their falls get pounded even more than like they're probably already kind of cheap calls because that part of the skew has gotten kind of maybe might have been kind of hit, but like they can underpour onto perform that too. So, like I get really crushed on the up move where like I lose not only on directional shares, I lose on the wall and not on the option that I actually own getting hit. So, it's actually it's very difficult to like, you know, be able to predict what is going to happen on the surface net of what's already priced into the surface. Like that's the whole, that's the difficulty. So, so I guess it's like I'm not really sure how people are supposed to take this information. Like if you're like, well, if we go down there we're going to be more volatile. But I don't know that kind of thing is I don't know if that's like what we call as like value over replacement information. Like, why I already knew that if we go down there we're going to be volatile. And I'll get the skew and tell you that. But it's another, so maybe",
    "start_timestamp_seconds": 2125.04,
    "end_timestamp_seconds": 2207.12,
    "start_timestamp": "35:25",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2125",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "that kind of thing is I don't know if that's like what we call as like value over replacement information. Like, why I already knew that if we go down there we're going to be volatile. And I'll get the skew and tell you that. But it's another, so maybe at the margin it could be the kind of thing that helps portfolio like like delta 1 portfolio managers. I don't really, I just don't, I don't see it. Like and I don't see the, but again, there's so much talk of that online and some of the people that are in that doing that stuff. You know, I know that there's smart people. So I, you know, I don't like to discount things if I haven't done the work. So it's not fair to me to like, but I'm just giving you my, my, my, my, my, my like impression from what I know. Yeah, and really that's the, that's the basis of the question. And it's also due to that same fact that there are sometimes smart people that seem to be talking about some of this stuff. Part of me is always curious if like it happened to be the kind of thing where they mentioned it, then it became part of their brand and then they kind of have to lean into that in order for the, like, I don't know, because it always just seemed strange to me to like crop it up quite as",
    "start_timestamp_seconds": 2192.08,
    "end_timestamp_seconds": 2278.08,
    "start_timestamp": "36:32",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2192",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "to be the kind of thing where they mentioned it, then it became part of their brand and then they kind of have to lean into that in order for the, like, I don't know, because it always just seemed strange to me to like crop it up quite as much as it seems, but I also have no idea. So that's why as people smarter than me with their ideas. And then hopefully sooner or later I could piece together, aid somewhat in tell you a position that I yet do not have. Now you mentioned another thing that I'm super interested in. I funny enough right before we started recording. I said that there was something I wanted to ask you about when we started, which 48 minutes in now I will ask you, because there's a perfect preamble. Right before we got on, I was looking at a zero DTE trade that I had on in SMB. And I run a couple different things in there. Long story short, I pick up on periods where it seems like the last 30 minutes, 15 minutes, I can kind of get more scalpled because I track it that we start to get like little runs and depending on when you enter and how you trade your ZERD's, especially I'm a typical in the short ball side, that last two minutes can undo the preceding X hours. So I have a specific system built and every once in a while,",
    "start_timestamp_seconds": 2263.68,
    "end_timestamp_seconds": 2338.64,
    "start_timestamp": "37:43",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2263",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "start to get like little runs and depending on when you enter and how you trade your ZERD's, especially I'm a typical in the short ball side, that last two minutes can undo the preceding X hours. So I have a specific system built and every once in a while, I'll look at it and I will overwrite the system overwrite the system in terms of like what I'm optimally supposed to do versus like what I'm seeing and I'm always super hesitant to do that. Because I know that the human brain is always trying to find patterns that's super fallible. So rather than overriding and just looking back in confirmation bias saying like, oh yeah, this worked out. I crushed it. I started tracking it and every single time I overwrite the system, I log it. And the system overrides so far. It's like a 300 in something samples. Again, it's zero DTEs. So there's a lot of samples. But it has a exceedingly high success rate in terms of the better decision based on what ended up happening. You had mentioned pattern recognition. I have spent a lot of time trying to figure out why sometimes when I'm looking, I decide to overwrite and other times I don't. I try to decode everything. I try to look at the move the move the day before the way vault everything. And I can't fucking figure out why, sometimes I look at this and like this just seems like",
    "start_timestamp_seconds": 2327.44,
    "end_timestamp_seconds": 2416.96,
    "start_timestamp": "38:47",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2327",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "I'm looking, I decide to overwrite and other times I don't. I try to decode everything. I try to look at the move the move the day before the way vault everything. And I can't fucking figure out why, sometimes I look at this and like this just seems like something that I need to do something on. What is that? And is there a way that you've found to crack the nut on trying to parameterize some of it so that I can at least try to like integrate it into a plan versus how I fucking happen to feel? So I have, I don't know, I've been really, I have generally, so as a discretionary trader, I was never, you know, you don't have like models but I would have models that would have like signals like what I thought like the right wall should be and all that. But as a pure discretionary trader, I basically use vibes all the time. It's, I don't, I think that if you have a very specific strategy that was sort of like tuned out a bunch of parameters and where to the point where you're confident enough to put it in production and you're using it and the, you know, sort of the results are reasonable compared to what you thought there would be. Then I probably wouldn't try to, uh, I probably would have void over writing that thing and just letting it be what it was doing and",
    "start_timestamp_seconds": 2396.8,
    "end_timestamp_seconds": 2509.04,
    "start_timestamp": "39:56",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2396",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "in production and you're using it and the, you know, sort of the results are reasonable compared to what you thought there would be. Then I probably wouldn't try to, uh, I probably would have void over writing that thing and just letting it be what it was doing and then, so it's almost like I would almost separate, like, is that thing that I'm doing truly programmatic and then I should just leave it alone or if it's not, then let me stay, let me continue to just accept the vibe trading. But, and when I say the vibe trading, it's still doing the same thing that you're doing. It's like you are trying to be like, why do I feel this way? I mean, when I was, uh, when I was on the desk, a lot of that was, I mean, the solution to it was talking. Really, I mean, it's that's what you did is like you would just turn, you would, you would explain the situation to somebody and then what happens is you kind of get into this like, um, it's not sparring, but it's like it's almost a critic where you're growing, the person's like, just keeps clarifying. So, uh, you know, so you're saying, so what is it? It's because this person bought them from you and the last time you saw them, the stock went up after they bought calls and you kind of like, uh, yeah, and they're like, okay, and",
    "start_timestamp_seconds": 2486.56,
    "end_timestamp_seconds": 2578.4,
    "start_timestamp": "41:26",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2486",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "like, just keeps clarifying. So, uh, you know, so you're saying, so what is it? It's because this person bought them from you and the last time you saw them, the stock went up after they bought calls and you kind of like, uh, yeah, and they're like, okay, and how often have you traded against them, um, what broker did they come through? Like, it's like, um, what was the vault was the vault also higher in the vault. Also, or the the vault screen high when they bought last time or did they come, did they bid when the vault when you got the vault was low? Like, it's kind of like trying to rebuild the circumstances of the scenarios that they were happening, but it's, it's really hard to do this yourself. I think it's, uh, because we can't see our own blind spots like literally by definition. So it's, it's more of like this banter thing and I guess that that's, that was my solutions of this. It was just, I was just talking about trades with people, um, and I think it's hard to do when you're like running, you're running your own trading strategy that you're the only one who runs that trading strategy. So if you try to talk to somebody else about it, like they're not, it's hard for them to maybe because they're not in their all day like doing that. But like when when I was on a, uh, I",
    "start_timestamp_seconds": 2558.56,
    "end_timestamp_seconds": 2645.28,
    "start_timestamp": "42:38",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2558",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "that you're the only one who runs that trading strategy. So if you try to talk to somebody else about it, like they're not, it's hard for them to maybe because they're not in their all day like doing that. But like when when I was on a, uh, I wanted to desk, like, well, the people next to me all kind of do the same job. And we all kind of see the same things, we all write similar tools. So we're, uh, it's easier to relate. It's probably, so what you mean, it's easier to ask sort of the, the, the right questions. It's, it's a funny thing how you can ask, you can ask the right questions to your neighbor and they're hard to ask yourself or to be a reliable witness with the way you answer yourself. So, um, and I think that I've just accepted this. Like this is, this is that, that where they really have to be okay. It's sort of like asking somebody else to the, I mean, obviously, you're going to do the best you can as far as like what you're doing as far as like, why am I doing this? What's going, like, like, you know, like, the logging the notebook, all that stuff? And I would say when I, when I first started to trade in my first few years, I did, I, I kept the notebook and I would say, you know, at this, you know, at",
    "start_timestamp_seconds": 2628.8,
    "end_timestamp_seconds": 2704.48,
    "start_timestamp": "43:48",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2628",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "this? What's going, like, like, you know, like, the logging the notebook, all that stuff? And I would say when I, when I first started to trade in my first few years, I did, I, I kept the notebook and I would say, you know, at this, you know, at this time, in the day, uh, you know, I sold uh, 2000, 27 delta calls, the stock price was here. It was at this implied wall. Um, the open interest was this. And then, if I got a chance to close those on it was a big trade, well, now that was useful because it they could pick, because some of like, you might have got into the trade, it was chunky. And the question is like, are you going to get back that trade in a chunky way too, meaning that the customer either came back and closed or they rolled, um, but sometimes it doesn't happen. And like, you actually never got them back or you missed the trade where the person came back and sold them and like, you weren't on the ticket, you passed, you didn't get the look, whatever it was. But like, over time, you'd kind of like build up these log. And that was just like, I did it for the first few years. Um, I probably didn't do it for like, probably the first quarter of my career. I kind of did that, but then I kind of stopped doing it and,",
    "start_timestamp_seconds": 2688.24,
    "end_timestamp_seconds": 2761.76,
    "start_timestamp": "44:48",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2688",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "you'd kind of like build up these log. And that was just like, I did it for the first few years. Um, I probably didn't do it for like, probably the first quarter of my career. I kind of did that, but then I kind of stopped doing it and, um, for better words, maybe I should have kept doing it. But the, uh, I would say overall, I felt pretty, I was pretty comfortable with the whole like this revolutionary aspect to it and being okay with, um, you know, it was all overwriting all the time, you know, but, but, but I would say the thing that you would get back all the time, it was a lot of like, I feel weird about this. Like, um, like, I feel like this feels like a trap kind of thing. Like, uh, you know, the, the, uh, I kind of gave it, I've done this example many times, but like, when you are so traded at a premium in, in a, uh, uh, you know, normally like the ETF, like, goes premium, whatever, you're going to be like, I'm going to sell these balls and then you're like, this kind of feels like a trap, like what's going on? And then you have to like slow down and like, think through the problem a little bit a little bit more and I think it makes a lot of sense to sort of, uh, listen to yourself because what's happening",
    "start_timestamp_seconds": 2752.56,
    "end_timestamp_seconds": 2831.04,
    "start_timestamp": "45:52",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2752",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "kind of feels like a trap, like what's going on? And then you have to like slow down and like, think through the problem a little bit a little bit more and I think it makes a lot of sense to sort of, uh, listen to yourself because what's happening is they go a bunch of things that you don't understand that are happening in your intuition. Like, it's just, you have to trust the fact that sitting there and looking at markets all damn day. Yes, they can fool you, but also you are perceiving something with your senses that are, uh, that, that you're not able to actually log, but it's being log somewhere and people can, you know, it's one of those things where it's like, people push back against that, but you know, it's, um, I don't know what to tell you, it's like, I, I've watched many people do very well, but the thing that's common about the people is they have a ton of reps and I think at the end of the day that's probably all it is is like, you can trust your intuition if your intuition is earned the right to be trusted by having lots of, like, reps. So it's one of those, uh, things that, you know, it sounds you lead us to say that like, you gotta do this for a long time and then you can trust yourself. But I don't know what else to tell you.",
    "start_timestamp_seconds": 2818.8,
    "end_timestamp_seconds": 2903.28,
    "start_timestamp": "46:58",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2818",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "be trusted by having lots of, like, reps. So it's one of those, uh, things that, you know, it sounds you lead us to say that like, you gotta do this for a long time and then you can trust yourself. But I don't know what else to tell you. Well, it's funny because the, the way that I've approached stuff is like pretty regimented, I just try to, like, box a standard process around like ideation, scoping, planning, testing, live testing, then, you know, start moving stuff. And I started, I, I know the way that the human brain likes to look for patterns, how fallible it is, but also how powerful it is in the same capacity. So I've always found, like, those sensations fascinating, which is exactly why I started tracking it, right? Turn into a science experiment. See if this is actually net value at or not. But the, the thing that you said towards the end is something that I've also found difficult to explain to people, because I mean, you've been trading longer and I have, but I, I started in 2007, so I've also been doing it for a minute. And there is a weird spot that I found where it feels like you can start trusting yourself to not make a lot of those mistakes that you might otherwise not be aware of, right? Easy part in this example is feeling some sort of way about S&P getting out, then it does",
    "start_timestamp_seconds": 2884.88,
    "end_timestamp_seconds": 2975.04,
    "start_timestamp": "48:04",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2884",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "a weird spot that I found where it feels like you can start trusting yourself to not make a lot of those mistakes that you might otherwise not be aware of, right? Easy part in this example is feeling some sort of way about S&P getting out, then it does the thing that I thought it was going to do and be like, oh, yeah, I knew that was going to happen, right? And it's like, the funny thing is when I look at what happened today, I said to myself, like, no fucking idea if it was going to happen, just thought that it might, and it felt like it was more likely to, so then the decisions made. Now, when you're describing that kind of concept to people though, and you actually framed it really, really well, the idea of like you can trust your intuition when it deserves and earns the trust. Is there a way that you can conceptualize that for people? Like, the question I would have if I were them, is how do I know if I'm at that point? I think I think the end of the day kind of comes down to like, if you don't a lot of, just if you've done a lot of trades, we pulled on one second, I'm going to close the door here. Of course. We back. Yeah. So, yeah, how do you know that you're at that point? Well, you know, you will, you probably",
    "start_timestamp_seconds": 2953.92,
    "end_timestamp_seconds": 3042.32,
    "start_timestamp": "49:13",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=2953",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "like, if you don't a lot of, just if you've done a lot of trades, we pulled on one second, I'm going to close the door here. Of course. We back. Yeah. So, yeah, how do you know that you're at that point? Well, you know, you will, you probably first of all. There's no amount of luck. There's no time where like self doubt doesn't live. You'd like within you, right? Okay, you never like escape self doubt. This is like the nature of the game. And so I think, and then I think that's good and important, because paranoia is a survival mechanism. So you need to kind of be paranoid. But, by the end of the day, it's what I find is if you're doing a lot of trades and things are going well, it's like the way these things work, it's kind of hard to do lots of trades, because trading costs do something. Like there's there's slippage, there's like adverse selection, like, you in other words, like there's like an anti, you could think about it as like there's an anti in the market. You may think like it's not caught, but like you're you are getting, you are losing a little bit in terms of execution on every single trade that you do. So you are paying an anti all the time. And it's very hard sort of like over many, many, many trades. It's like, I think that's the things like, I mean,",
    "start_timestamp_seconds": 3020.32,
    "end_timestamp_seconds": 3117.28,
    "start_timestamp": "50:20",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3020",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "are getting, you are losing a little bit in terms of execution on every single trade that you do. So you are paying an anti all the time. And it's very hard sort of like over many, many, many trades. It's like, I think that's the things like, I mean, I traded a lot of contracts. Like when it's like at the fun, like it's trading tons of contracts. And so I traded, I traded a lot of, I traded, I mean, we're talking about like close to a hundred thousand like a day. So it's kind of hard to trade that many contracts for a long time and just like you're not losing. Like if like if you're winning to it, it's not random. I mean, it's like so that's one. The other, but there, but that doesn't mean you don't go through losing streaks. And so the losing streaks are really the things that test you. It's like, okay, because you're always kind of like, whoa, is the thing, is the thing that I've like figured out or is what I'm doing sort of like solve, this get more competitive in some way that's like, that happens invisibly? Like it might be like this, you know, God, this all seems like way harder. Like I normally normally, when somebody came in and buy these things, it's like, I used to be able to get like three cents of edge on them. Now I'm like, it feels like it",
    "start_timestamp_seconds": 3096.88,
    "end_timestamp_seconds": 3187.52,
    "start_timestamp": "51:36",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3096",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "Like it might be like this, you know, God, this all seems like way harder. Like I normally normally, when somebody came in and buy these things, it's like, I used to be able to get like three cents of edge on them. Now I'm like, it feels like it trades for fair value every time. So it's like, there's like, does everybody know about the straight now? Is there more risk capital that, like maybe there's the same number of people trading, but they're not a risk capital. They're willing to put the behind the trade. It's grown. Maybe people are willing to accept worse risk or war. That also happens. So all of these things can happen. And it does so it's like your understanding, the situation, the same, but it's gotten more competitive. Like people will trade it for less. So that's, that tends to be the thing that's actually happening. So much more so than like, I don't know what a good trade is anymore. I never really, I don't think like that is this a good trade is that a bad trade was kind of like not the hardest part. It's like getting actually getting on a good trade is the hard part. It's not like necessarily knowing the trade is good or bad. So the, so I would say that in that when that happens, the thing that I found that's really important is like this back to the basics thing. Because you need",
    "start_timestamp_seconds": 3172.64,
    "end_timestamp_seconds": 3258.4,
    "start_timestamp": "52:52",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3172",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "on a good trade is the hard part. It's not like necessarily knowing the trade is good or bad. So the, so I would say that in that when that happens, the thing that I found that's really important is like this back to the basics thing. Because you need to weigh to like re-center yourself when you're running kind of bad. And so my back to basics thing is that I probably become, I become stricter about my discretionary, the way I'm trading discretionary. So like for example, I let less vibes come into the entire equation. If you're running, you might be running good in your confident and you're like, man, I'm just, whatever, I feel like I'm seeing the ball really well right now. So you kind of get a little bit more bold and like you're like, oh, you know what? Like I don't normally even trade that thing and I'm going to go like over there and I'm like I'm going to buy a bunch of calls on that thing because like I'm just, you know, for some reason I think I know something. When you're running bad, you pull everything in and you start to say, you know what? I'm only going, the only reason I'm going to buy this is because this other thing is bid here. And in other words, like I'm really going to narrow my focus and be like, I'm buying this because this is bid here and I like",
    "start_timestamp_seconds": 3243.36,
    "end_timestamp_seconds": 3322.88,
    "start_timestamp": "54:03",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3243",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "to say, you know what? I'm only going, the only reason I'm going to buy this is because this other thing is bid here. And in other words, like I'm really going to narrow my focus and be like, I'm buying this because this is bid here and I like that and I'm comfortable with that spread. And I'm going to do it at a size where I can sort of like be roughly evenly even risk on both unbolt sides of this rather than what you would I would often do is like, I might, I might say, hey, this thing is cheap. This thing is cheap because this thing is bid here. So this other thing is cheap and I'm just going to buy everything that's offered here and I'm not even going to hedge it. I'm not going to worry about it and I'm not going to like complete the, you know, complete the, not an orb, complete the relative value. I'm just, I think this is the good side. I'm just going to buy the good side and not trade the fair side and leave it at that. And I would be less inclined to do that when I was running bad and I'd be like, I should just do, I should just do the basic blocking and tackling because I need to, I need to like know that I need to rebuild my confidence. I need to know that the basics are working. So I",
    "start_timestamp_seconds": 3310.4,
    "end_timestamp_seconds": 3384.24,
    "start_timestamp": "55:10",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3310",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "that when I was running bad and I'd be like, I should just do, I should just do the basic blocking and tackling because I need to, I need to like know that I need to rebuild my confidence. I need to know that the basics are working. So I think that's almost, and I don't think that ever goes away. Like you can get really, really experienced. You're going to have a bad run and you're probably going to need to rescind yourself, go back to the basics and some fashion. So I think that's just a good habit. It's just like, no, how to get back to your fundamentals. So yeah, that's, that's a, that's my, I guess that's, that's all I can think about that for that. Yeah, that's super useful. And I appreciate the, the thought where a lot of the stuff that we're talking about anyways, it's a little bit conceptual in nature, but I think there are things that impact, especially retail traders at different points and sometimes it's actually really difficult to navigate, especially on your own. So I think it's super useful. And I know that we're at time, I had one more question for you. There's a really, really common concept that gets thrown around, especially for the option sellers, the theta gang crowd, that kind of thing, where there's a perception that theta is their edge. Did you talk about that? Yeah, I mean, theta's not an edge. It's a",
    "start_timestamp_seconds": 3368.96,
    "end_timestamp_seconds": 3459.04,
    "start_timestamp": "56:08",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3368",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "more question for you. There's a really, really common concept that gets thrown around, especially for the option sellers, the theta gang crowd, that kind of thing, where there's a perception that theta is their edge. Did you talk about that? Yeah, I mean, theta's not an edge. It's a grief. I mean, I don't even, like, okay, have you heard this before? Yeah, I mean, it's just, yeah, it's just like, yeah, I mean, it's so like, even if you, okay, so you can, here's where you can make it really obvious. If, let's say that you have, this is the example I was kind of gifted to this because it's so, it's just so obvious. If you have a stock, it's 100 bucks and the stock has a 25% chance of going up 50 bucks, okay? So what's the one, the one, the one 10 call worth? So the one 10 call has a 25% chance of being $40 in the money, okay? So the one 10 calls worth, it's worth $10. So like, if you sell the call, and now like it may decay, like, I guess that's the first question, it's like, does that option, how does that option even decay? Like, let's say that a little bit of time passes every day and then like, you don't know at what point, some point, that it could make that move, but the question is like, if you sold the option for like $9.50, like the option",
    "start_timestamp_seconds": 3433.04,
    "end_timestamp_seconds": 3543.44,
    "start_timestamp": "57:13",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3433",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "does that option even decay? Like, let's say that a little bit of time passes every day and then like, you don't know at what point, some point, that it could make that move, but the question is like, if you sold the option for like $9.50, like the option has beta, but is there, do you think you have any edge? Like, you have negative 50 cents edge, the options were $10.00, you sold it at $9.50, like, I really can't even understand, like, how you can look at that and be like the theta is an edge here, like you sold something worth for less than what it's worth. So, in the other way, you can look in a more complicated way of looking at it, but it's still not even that complicated, it's just recognizing that like gamma, that your gamma P&L, there's a formula for it, it's one half, your gamma times the stock price move squared. Your gamma P&L and your theta P&L, your gamma P&L is always positive, your own an option and the stock moves, that number is always positive because the move is squared. So it's always a positive number. The theta is a negative number, it's like, options decay every day. If the theta is greater than the gamma, then you want to be short and vice versa. So, there are two sides of the same coin. So, to say that the theta is an edge, is to say that the",
    "start_timestamp_seconds": 3532.64,
    "end_timestamp_seconds": 3608.88,
    "start_timestamp": "58:52",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3532",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "is a negative number, it's like, options decay every day. If the theta is greater than the gamma, then you want to be short and vice versa. So, there are two sides of the same coin. So, to say that the theta is an edge, is to say that the stock is not going to move. If the stock moves, you've lost, like, the stock moves more than what was implied in the theta. Basically, because the gamma number and the theta number are both derived from what the volume number is. So, the theta is just a hurdle for the gamma. That's all it is. It's the cost of the gamma, the hurdle for the gamma. So, I don't even understand, it sounds so incoherent to me to say that it's an edge when it's just a hurdle. Now, one of the common retorts is, I think, typically conflating things, because normally, if that, we open with that theta as an edge, we hear it's not, then a slightly more advanced option trader will say, well, isn't implied volatility typically slightly higher than realized bowl. It is. That's saying something different. That's saying that there's a risk premium to option prices. That is a perfectly fine statement. It's not enough of a statement to be like, I can make money knowing that because, well, how do you know that the premium is not always the same size and it's not always present. It's not always present all over the",
    "start_timestamp_seconds": 3595.2,
    "end_timestamp_seconds": 3707.04,
    "start_timestamp": "59:55",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3595",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "option prices. That is a perfectly fine statement. It's not enough of a statement to be like, I can make money knowing that because, well, how do you know that the premium is not always the same size and it's not always present. It's not always present all over the term structure. It's, it is, it's not, it's not this constant piggy bank that you can take. And the reason is why how could it be a constant piggy bank? Like, if it was and everybody would just do that, all these, you know, we see how much, look how much money people get paid to go work for 10 Griffin. It's like, if this thing is just free money sitting there, why aren't these guys going to go take it? Like, it's not, it's not like they don't have access to the option markets. So there's no reason to think it's simple just because it's there, which is the same thing. So, like, okay, this is, this is something I was just kind of working on a little bit this morning. I was just napkin stuff, okay. But let's say that we want to go with this risk premium idea, so you've got, let's say you have a, you've got a $100, give a $100 stock and it's 30, it's 30 to 30, all $100 stock. And we're going to say that we're going to just say that the, the wall is over priced by 10%. So it's, it's",
    "start_timestamp_seconds": 3686.96,
    "end_timestamp_seconds": 3789.36,
    "start_timestamp": "01:01:26",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3686",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "idea, so you've got, let's say you have a, you've got a $100, give a $100 stock and it's 30, it's 30 to 30, all $100 stock. And we're going to say that we're going to just say that the, the wall is over priced by 10%. So it's, it's going to, God told you that it's going to move at 27%. And it's implied wall is 30. Okay. So if that's a one-month straddle, that straddle is going to be, so, okay, 0.8, remember, it's 0.8 of the standard deviation is what the straddles worth. So that is $100 stock. So the one-standard deviation is 30 bucks. 0.8 of 30 is 24 bucks. And, but that's for one year. So to get it to one month, we can't just divide by 12, if it divide by the square root of 12. So we have to take, so we've got a $24 straddle divided by the square root of 12. The square root of 12 is, well, the square root of 12 is somewhere in between three and four. So, so that's, we'll call it three and a half. So you have a $24 straddle divided by like three and a half. That's about seven bucks. Okay. So you have a $7. Yeah, about seven dollars. Okay. So you have a seven, a one month, $7 straddle. Okay. We say that the fall is 10% overpriced. So that straddle has 70 cents in it of edge in the selling it.",
    "start_timestamp_seconds": 3761.36,
    "end_timestamp_seconds": 3867.12,
    "start_timestamp": "01:02:41",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3761",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "a half. That's about seven bucks. Okay. So you have a $7. Yeah, about seven dollars. Okay. So you have a seven, a one month, $7 straddle. Okay. We say that the fall is 10% overpriced. So that straddle has 70 cents in it of edge in the selling it. We'll say it's like the true value of the straddle should be 630 and it's trading for seven, so you sell it for $7. Okay. That's 70 cents of edge. You're going to hold it for a month. Okay. There's 20 trading days in a month. So you're going to, you're going to make 70 cents divided by 20 days. So you're making like 14 cents a day on that. And then you're paying slippage on that. So it's, it's four, let's say it's 14 cents dead. You got it right by the way. 70 cents divided by I'm just watching you. I'm just here to be the pretty face. Yeah. I'll be the, no, that's about right. It's about, sorry. It's more like it's a, it's a, it's a, you're, let me pull up a calculator real quick. I want to, what do we do when I got one right here? Yeah, I got it. It's, it's a, do you have 70 cents? You might have by 20 days. Sorry, it's three and a half. I'm doubled the wrong number. So three and a half cents a day. Okay. A veg. Now let's say your slippage is 10 basis",
    "start_timestamp_seconds": 3841.12,
    "end_timestamp_seconds": 3946.16,
    "start_timestamp": "01:04:01",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3841",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "right here? Yeah, I got it. It's, it's a, do you have 70 cents? You might have by 20 days. Sorry, it's three and a half. I'm doubled the wrong number. So three and a half cents a day. Okay. A veg. Now let's say your slippage is 10 basis points on your delta head. You're going to hedge and you're just going to hedge once a day and you're going to, so what happens is your slippage is going to end up being something like it's 10 basis points, which is a dime, but you're not hedging the full amount every day because like your adjustments are like, you know, like this straddle had 20 deltas today. It's got 24 delta today, whatever. So let's say you have 10 cents a slippage, but you're only trading 10 deltas worth a day. So that it cost you a penny. So now right now we're now down from like I'm making three and a half cents a day to like two and a half cents a day on this trade. And then, so the question is like it's two and a half cents a day and then I say like the Vega, the Vega that option is something like 24 cents. It's about 24 cents. So and we say fall can move around, let's say fall can move around 1.2 day on average. I could oscillates 1.8. So that's 24 cents a variation and then your realized fall is going to",
    "start_timestamp_seconds": 3930.72,
    "end_timestamp_seconds": 4006.0,
    "start_timestamp": "01:05:30",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3930",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "Vega, the Vega that option is something like 24 cents. It's about 24 cents. So and we say fall can move around, let's say fall can move around 1.2 day on average. I could oscillates 1.8. So that's 24 cents a variation and then your realized fall is going to bounce around reality to some some degree every day. There's going to be some gamatheta like tug of war, P&L every day as well. That's probably another dime worth the variation. So here's the situation. You have you are making two and a half cents a day and you have about 35 cents a variation a day in the trade with part of that coming from implied fall moving around and part of that coming from the type of war between realized fall and theta like your gamatheta, first your theta. So you are making so the risk of war here is about I'm making three cents and I got 30 cents a variation a day. So that's it's 10 to 1. It's actually not like that different from if I just bought the S&P because what is the S&P? You make three base it works out so you make about three bases points a day. Three bases points a day over 250 trading days is 7.5% a year. Whatever. Four bases points a day. You make 10% a year. And what's the daily standification of the S&P? It's like 100 BIPs a day. That's about 16V. So you're you're",
    "start_timestamp_seconds": 3992.0,
    "end_timestamp_seconds": 4087.28,
    "start_timestamp": "01:06:32",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=3992",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "about three bases points a day. Three bases points a day over 250 trading days is 7.5% a year. Whatever. Four bases points a day. You make 10% a year. And what's the daily standification of the S&P? It's like 100 BIPs a day. That's about 16V. So you're you're getting here that's like 25 to 1. So you're getting a little bit better on the on the on the you're getting 10 to 1 a day versus 25 to 1 a day on the S&P in terms of like risk and reward. So you can make so that's 20% a year rather than 10% a year trading the options. Let's say. But you've got to manage this you have to do a bunch of work and your or it's also not like it's not necessarily it's like worst taxes right because you're trading. So you're getting short term capital gains tax and like your S&P you can just buy and hold that thing. So like your risk of reward you like you can there's something there. Right? If you think that there's a 10% premium of volatility to realize in the marketplace. There is something there but is the juice sort of like worth the squeeze as far as like you now have to like go do that all the like you have to run a business sort of around that. And that's that's kind of the point like do I think that there's something there? Yes. Do I",
    "start_timestamp_seconds": 4066.56,
    "end_timestamp_seconds": 4164.96,
    "start_timestamp": "01:07:46",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4066",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "juice sort of like worth the squeeze as far as like you now have to like go do that all the like you have to run a business sort of around that. And that's that's kind of the point like do I think that there's something there? Yes. Do I think it's a lot of work to do it also yes. So it's not this passive thing and like we don't really know and then it's like there's another question of like how confident are you in that 10% premium? You know if you are only getting filled when you know when the when the premium is 3% and you don't get filled when the premium is 15%. You're being sort of like you're only getting filled when when it's not a good trade. So that's like goes into it as well. So it's like if the 10% is sort of like your best case scenario. So that's why which that's the reason you have to build a whole sort of like operation around it because you're trying you need to try to like be in the weeds to separate like you know am I you know when I'm trading is it like worse for me when I actually get filled versus not and that's so that's kind of like I think there's something there first of all I know that there's something there because there are no as people doing this like there's there are retail trader but you're",
    "start_timestamp_seconds": 4152.56,
    "end_timestamp_seconds": 4238.24,
    "start_timestamp": "01:09:12",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4152",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "is it like worse for me when I actually get filled versus not and that's so that's kind of like I think there's something there first of all I know that there's something there because there are no as people doing this like there's there are retail trader but you're doing it's like retail traders I know successful retail traders but I guess my point is it's a job. So if you're going to do all the things that you're doing then it makes sense that there could be money for doing it but this concept of like I'm just going to sell these options and walk away and like it's passive income and all that. I think it's I just don't think it's that easy. I think if it was that easy there would be there would be a lot more sort of like um professional money managers kind of doing it and you'd have to have you'd have to have a really good counter argument for why there isn't like why that edge should be sitting right in front of you. It's one of those interesting things because I also find even going back to the original question like some of the times when I've had try to have conversations with people about like theta is not an edge. It's almost like talking to a flat earther where it's like you can kind of show a lot of different things but it doesn't necessarily resonate or connect and",
    "start_timestamp_seconds": 4218.64,
    "end_timestamp_seconds": 4307.04,
    "start_timestamp": "01:10:18",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4218",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "like some of the times when I've had try to have conversations with people about like theta is not an edge. It's almost like talking to a flat earther where it's like you can kind of show a lot of different things but it doesn't necessarily resonate or connect and it's it's almost like a belief system which is even more bizarre or it's like you know you're taking away Santa Claus. I want to think this thing exists so bad therefore it exists. So I'm going to I'm going to do this thing I'm going to do this thing where like I borrow a story that I heard on another interview but it's perfect because it's great. So there's this uh uh it was uh it was um it was like it was a guy from C actually described this uh he he kind of like uh helped build the education system there and key was talking there's a very famous like condiment and tiberski sort of like study where they it's uh it's almost like a like a mathematical optical illusion so people well the question is is um you tell somebody that there's a bat in a ball in the ball the ball uh the bat costs the bat in the ball together costs $1 10 and the bat costs $1 more than the ball does okay and the question is like how much the ball costs and everybody says 10 cents. It's a good thing. Right",
    "start_timestamp_seconds": 4289.6,
    "end_timestamp_seconds": 4369.04,
    "start_timestamp": "01:11:29",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4289",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "ball in the ball the ball uh the bat costs the bat in the ball together costs $1 10 and the bat costs $1 more than the ball does okay and the question is like how much the ball costs and everybody says 10 cents. It's a good thing. Right but that's like everyone's like gut reaction it's 10 cents and um that that can't be true because if that's 10 cents then the bat is $1 10 and $1 10 plus the 10 cents is $1 20. That's right so it's a it's a it's a the ball's five cents. Right $1 5 and 5 $1 but you have to slow it out the sort of like uh to be able to do this and this is like one of these it's just like a very funny optical illusion because it works on like almost everybody if they don't stop for a second like it's basically kind of in kind of it was like his good demonstration of like system one versus them two thinking but you got to switch and system two to get this anyway. This particular study has been like the the the the the person I listen to the podcast he had mentioned that they have like read done this study there was a couple of research and they're read the the study with like 80 different variations on it and they're really and I've actually I have read the paper for this they're really",
    "start_timestamp_seconds": 4351.44,
    "end_timestamp_seconds": 4429.36,
    "start_timestamp": "01:12:31",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4351",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "I listen to the podcast he had mentioned that they have like read done this study there was a couple of research and they're read the the study with like 80 different variations on it and they're really and I've actually I have read the paper for this they're really trying to like understand where in the process people are sort of like tripping up on this but what that's crazy is some of the variations so okay most people get get this they get it they get it wrong and then they'll do variations where they say they ask the question and then they say um are you sure and that causes people's accuracy to go up a little bit okay but it's still less than 50% then they do a variation where they say have you considered that the ball is worth a nickel okay so now it's like the kind of gave you the answer right and then uh the accuracy believe it only goes up to like two thirds so like you think you would go to like a hundred but it goes to two thirds right then they do another one of variation where they say the ball is worth a nickel right a nickel for the answer and then it's like the accuracy only goes up to like 75% or something okay so now you know and it's not like the researchers are like just blunt it's like they're they're like trying to understand",
    "start_timestamp_seconds": 4412.88,
    "end_timestamp_seconds": 4502.96,
    "start_timestamp": "01:13:32",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4412",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "say the ball is worth a nickel right a nickel for the answer and then it's like the accuracy only goes up to like 75% or something okay so now you know and it's not like the researchers are like just blunt it's like they're they're like trying to understand is it like possible the people think they're being tricked like what is going on here but I will just tell you the conclusion of the paper is like there's just a certain percentage of the population that they call the hopeless that's where they kind of landed on this it's just like they are unable to like have their minds changed and I think about that I think about that story a lot man like like you try and sometimes you're just like I'm just talking to wall and it's over like there's no it's like I'm like hey man I'm happy for you like like it's all it's all good like believe what you want to believe and that's it and so like that study kind of tells it tells me quite a bit about like how much energy I should expand it's so awesome I love that like the hopeless just yeah it's I can send you the paper it's actually I would love to check it out because those kinds of things are fascinating to me I love SSR and I love going through there and just kind of pulling up different piece of information like",
    "start_timestamp_seconds": 4481.68,
    "end_timestamp_seconds": 4574.96,
    "start_timestamp": "01:14:41",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4481",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "like the hopeless just yeah it's I can send you the paper it's actually I would love to check it out because those kinds of things are fascinating to me I love SSR and I love going through there and just kind of pulling up different piece of information like have you heard of Barbara Lino Dean there out of Berkeley but they do a bunch of like investor behavior research and it's it's the same just stuff that I know you know and most people probably intuitively know but it's similar variations of that they they do a test with like cost basis effectively a scenario where cost basis like wave low and then you sell it higher than another one where you're below you sell it halfway and then you sell the rest of it halfway and like what's the difference in those like people that fucks people up massively so yeah it's yeah the the hopeless I really love that so much it's so in in the Marine Corps we call those like the window likers or like the lowest common denominator these are like the people that you just gotta get them where they need to be tell them have a great day and then move on with your life so I now know the term for traders beautiful yeah that will window likers is cold man damn well we're not necessarily known for our warmth so I had a buddy I had a buddy in",
    "start_timestamp_seconds": 4556.4,
    "end_timestamp_seconds": 4643.2,
    "start_timestamp": "01:15:56",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4556",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "be tell them have a great day and then move on with your life so I now know the term for traders beautiful yeah that will window likers is cold man damn well we're not necessarily known for our warmth so I had a buddy I had a buddy in the like operations section is called S3 and I would go visit him because he he was always the just most disenfranchised human being and I don't know why but I fucking loved it so every time I had a chance like go visit him I'd be like dude how's your day going he would just bitch about everything motherfuck this that you know and or Halloween when you are walking and they have a bowl of candy for Halloween and on the candy literally says not for fat Marines and I was just like I fucking love this place these are my people so we actually covered up a pretty good bit of ground today so I appreciate the the information the context obviously going into the detail that the hope is to try to like explore some of this a little bit more I'd love to have you on again and I'm thinking for a follow up it could be really cool to actually talk about some of like market effects or dynamics that are viable for retail and give some concepts around like how to build something around those ideas and how you vision that but that",
    "start_timestamp_seconds": 4630.32,
    "end_timestamp_seconds": 4718.56,
    "start_timestamp": "01:17:10",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4630",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 4746.0
  },
  {
    "video_id": "SsbI2qzsLGY",
    "title": "Kris Abdelmessih on the Volatility Secrets Nobody Talks About!",
    "text": "on again and I'm thinking for a follow up it could be really cool to actually talk about some of like market effects or dynamics that are viable for retail and give some concepts around like how to build something around those ideas and how you vision that but that is for another time Chris people can find you at noon tower you have your sub stack I can throw links to all that anywhere else that you want to send people there they can go to which hour dot sub stack everything they can everything the whole world opens from there and then the hopeless they'll just get lost so we'll let that be what it is great seeing your brother thanks for hanging out",
    "start_timestamp_seconds": 4698.96,
    "end_timestamp_seconds": 4737.44,
    "start_timestamp": "01:18:18",
    "video_url": "https://www.youtube.com/watch?v=SsbI2qzsLGY",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=SsbI2qzsLGY&t=4698",
    "chunk_index": 65,
    "word_count": 126,
    "upload_date": null,
    "duration": 4746.0
  }
]