[
  {
    "text": "Boom, we're alive, we're back, we got to figure it out. I'm going to tell you, man, I got to get a little better at figuring out these stream launches. Every time it's kind of like just seeing if I can get us off the launch pad and so far, I feel like we have a decent track record, I suppose. But yeah, you know, what else am I supposed to do here? I'm just out here doing my best. This is an old video for you. I have the swap video set up or if we need to reference that at all. But yeah, man, first off, welcome back. I'm actually really glad that we're kind of starting to do these regularly because one, it gives me a chance to continue learning from the master, which I literally love doing. And two, it gives everybody else a chance to kind of catch these periodic updates, right? Like as we're going through and seeing things unfold. So welcome back, stoked to have you. Yeah, thanks, Eric. Really appreciate it. And I, I think you said it really well. Like these updates are really good. I realized, you know, I have a habit of just doing a video every day with like what's on my mind. It's almost like stream of consciousness. But maybe by breaking it up every week with like, hey, we've gone through another week now since huge events in May and June in kind of like this",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 108,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=0"
    }
  },
  {
    "text": "a habit of just doing a video every day with like what's on my mind. It's almost like stream of consciousness. But maybe by breaking it up every week with like, hey, we've gone through another week now since huge events in May and June in kind of like this quiet period where the stocks like kind of edging its way up. Everyone's looking for options activity. It's like, what's the story at right now? You know, what can we look forward to? What's the summary for the week? So I think it's good to do videos like this or, you know, yeah, man, kind of seconds like this. I absolutely love it. So right now for everybody's awareness, it looks like we have like 150 people on great to see everybody. They're coming to hang out and chat some game stop with us. So far, I'm not able to log into my platform. So we'll have to use some other tools when we want to start taking a look at some details. But that future us problem, you know, there's only so many things you can worry about at a given point in time. This is not one of them. So I figured a great starting point here is to lay a little more foundation on some of the components that make this thing tick the way it does. So last time we were talking about some of these different settlement rules, how they apply and how they interact",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 108,
      "start_timestamp": "00:01:12",
      "start_timestamp_seconds": 72.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=72"
    }
  },
  {
    "text": "them. So I figured a great starting point here is to lay a little more foundation on some of the components that make this thing tick the way it does. So last time we were talking about some of these different settlement rules, how they apply and how they interact with one another. Do you want to kind of provide a quick rundown of those to lay some of a foundation? And the reason for everybody else's awareness that's kind of learning more about the story or already aware of the story, but curious why this matters. Because when we're trying to think about the way that the product moves, a lot of the reason why it moves the way it does is because of these forces and these rule sets that underpin things. It's why whenever I'm doing videos and you know talking about game stop, I'm always very careful to say like standard technical analysis in my opinion doesn't translate well to something like game stop. And a lot of that has to do with the fact that there are all these other injects that absolutely have a dominating effect on price and volume. So yeah, I'd love to start with an assessment slash just general overview of these settlement rules. Yeah, do you want me to go ahead and share my screen? Is that cool? I would love that. Honestly, just because I hate seeing my big fat face. So whenever we do that, yeah, it gets",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 108,
      "start_timestamp": "00:02:12",
      "start_timestamp_seconds": 132.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=132"
    }
  },
  {
    "text": "to start with an assessment slash just general overview of these settlement rules. Yeah, do you want me to go ahead and share my screen? Is that cool? I would love that. Honestly, just because I hate seeing my big fat face. So whenever we do that, yeah, it gets me, that's beautiful. It just gets me right out of there. Perfect. Everybody. Exactly. Same here. So I think you laid the groundwork pretty well. I think that with other stocks, you probably wouldn't be ultra concerned about settlement because liquidity is pretty robust. You know, you're going to have lots of buying and selling on the stock. I think with something like game stop, the fundamental problem here is liquidity. With so many shares being dominated by household, especially in periods like right now, you can see tremendous volume. But where are the market makers and the broker dealers going to go to get shares? You know, if they don't, if they don't have inventory, they're going to need to push all the rules to the maximum. So we need to know how the rules work to get an understanding of why we see volume happen on particular days. You know, days where we consider nothing's going on. There's nothing going on the stock. Why would it suddenly have 100 million volume? Why would the price suddenly go up 5 here? 800 there. You know, so that's where the rules become really important. So I made a tab here",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 108,
      "start_timestamp": "00:03:21",
      "start_timestamp_seconds": 201.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=201"
    }
  },
  {
    "text": "You know, days where we consider nothing's going on. There's nothing going on the stock. Why would it suddenly have 100 million volume? Why would the price suddenly go up 5 here? 800 there. You know, so that's where the rules become really important. So I made a tab here on the sheet. It's the third tab over. I actually combined the two tabs before into one tab. So I've got all the rules for settlement here. I'll make this really big over here on the left. So under regulation, SHO, this is the settlement rules. We just recently moved into a T plus one settlement period. That means that, you know, I buy a stock today. It should be settled into my account by tomorrow, sending with cash. If I move cash from my Bank of America account into my trading platform to take one data seven ounce at a two, which is great. Supposedly, my understanding is options contracts still take two days to settle. Do you know if that's the case? I think it is. I think so too. Yeah. So right now, they're aligning off of the same settlement period. So I think that that's, I think it's two T plus one now, no? I think because it's a contract, not an actual equity. I think it's still on T plus two, but I might be mistaken on this. So that's a curiosity. The chat, the chat might know. And I also think I have a",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 108,
      "start_timestamp": "00:04:22",
      "start_timestamp_seconds": 262.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=262"
    }
  },
  {
    "text": "think it's two T plus one now, no? I think because it's a contract, not an actual equity. I think it's still on T plus two, but I might be mistaken on this. So that's a curiosity. The chat, the chat might know. And I also think I have a download of the actual release. So let me dig that up in the meantime. Sure. But, you know, under regulation, SHO or Reg show for short, there's two particular rules that are really of interest. Rule 203 and Rule 204. They allow market makers to fail to deliver trades after T plus three and T plus six. And we can actually see that in action on the stock. What's really hard here, and I think that there's a lot of people that get frustrated on the forums because people are really caught up right now on roaring kiddies by a four million shares. But there's a reason to be caught up on that trade. That's a huge trade, right? And we get precious few moments in time where we get to see a huge trade and know when it's going to be. Ryan Cohen bought in in 2020. So we actually have his trade dates from his disclosures. And so we can actually see a rule happening here, which is he bought on December. Right here, he bought on December 17th, quite a few shares across four days. But you don't see gigantic price improvement until T plus three, especially",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 108,
      "start_timestamp": "00:05:21",
      "start_timestamp_seconds": 321.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=321"
    }
  },
  {
    "text": "actually have his trade dates from his disclosures. And so we can actually see a rule happening here, which is he bought on December. Right here, he bought on December 17th, quite a few shares across four days. But you don't see gigantic price improvement until T plus three, especially like basically. So you can actually see that happen in real time here. That's why people are still curious about roaring kiddies purchases. Not only do they match the size of Ryan Cohen's from back in 2020, but it gives us dates through which to follow to see if the rules pan out the way we expect them to. But the one of interest is Rule 204. They grants calendar days plus 25. And so down here, I basically mapped this out. You can see like, let's say you've got a trading date like December 22nd. The market maker should clear those trades by C plus three or two plus six. So those are trading days, so in days, but the calendar days include the weekends, but not market holidays. So then you want to count those out 35 and they absolutely have to close out by C plus 35. If you want to call it C plus 35. So that's basically how all those rules work. It's just what people are looking for now is, okay, so we know a big trade happened probably. You can tell me what you think about this. I think he sold his options",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 108,
      "start_timestamp": "00:06:28",
      "start_timestamp_seconds": 388.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=388"
    }
  },
  {
    "text": "If you want to call it C plus 35. So that's basically how all those rules work. It's just what people are looking for now is, okay, so we know a big trade happened probably. You can tell me what you think about this. I think he sold his options on the 12th and then bought the shares the following day on the 13th or sold most of the options like 80,000 of them here and then 40,000 more sold those there and then bought all the shares. So what everyone wants to know is are we going to see? Because we didn't really see T plus three or T plus six produce very much. There is volume, but not a lot of price improvement. So are we going to see something on 35 calendar days, which is basically going to be somewhere out here in the days to come? So does that give people a good enough idea on how settlement should work? Is that pretty clear? Yeah, yeah, that's super helpful. And I think that it paints a really important picture on why it matters, right? Because there's a lot of different perceptions of what it looks like and also, by the way, for option, it is T plus one. Yeah, so I grabbed, I threw a link in the chat for everybody. It's from the SEC and the Bolton's from 27 March and starting, I think it's 28 May, if I'm not mistaken. Yeah, 28 May, they",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 108,
      "start_timestamp": "00:07:31",
      "start_timestamp_seconds": 451.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=451"
    }
  },
  {
    "text": "and also, by the way, for option, it is T plus one. Yeah, so I grabbed, I threw a link in the chat for everybody. It's from the SEC and the Bolton's from 27 March and starting, I think it's 28 May, if I'm not mistaken. Yeah, 28 May, they switched over to T plus one. I'll try to remember to add a point to do list. Grab that link and just, I ended up starting linking everything on the sheet so people could just find us. I'll just link. That's sweet. And I'll throw it in the chat here too. All right, thanks. Yeah, man. So the hard part with calendar days is people forget about the market holidays. So this is a really good example to give because there are market holidays on this one. So let's say, Rory and Kitty did buy, and I think it's pretty obvious he bought on the 13th because that's when he was doing the Sanworm, Dune meme, right? He posted the Dune meme on Twitter and then the stock start rising immediately. It's like who just bought a whole bunch of shares pretty obvious. So what we want to do is we want to look at what I do is I just actually pull up a calendar. So if I look at June 13th, you guys could all do this right now if you're following the one. June 13th, that was a Thursday. Then you go out five weeks. So one,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 108,
      "start_timestamp": "00:08:39",
      "start_timestamp_seconds": 519.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=519"
    }
  },
  {
    "text": "we want to look at what I do is I just actually pull up a calendar. So if I look at June 13th, you guys could all do this right now if you're following the one. June 13th, that was a Thursday. Then you go out five weeks. So one, two, three, four, five should be the 11th, right? Is that right? Let me try this again. June 13th. There'd be the 27th, the 27th, oh, sorry. And then we're going to go the 18th, right? The 18th, yeah. All right. So yeah, that'll be, it should be 25 days though on here trading days. So now the way to do it. From here. No, so that's not a good way to do it. So you want to go for it? We have to add another column in here for you, like between AMB that auto populates it for you. I've always thought about doing that. I'm just like, that's going to be such a nightmare to actually add onto the sheet though, because you'd have to go back and do so much. Oh, I see. I was just like, it insert it and then have it calculate X number of trading days from whatever your trigger date is. Right. But it's tricky because, like, if this is the day, right? So I've got it highlighted now. Here's the trade date. Here's when calendar days plus 35 is, however, there were two holidays between there and there, right? And those",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 108,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=594"
    }
  },
  {
    "text": "of trading days from whatever your trigger date is. Right. But it's tricky because, like, if this is the day, right? So I've got it highlighted now. Here's the trade date. Here's when calendar days plus 35 is, however, there were two holidays between there and there, right? And those don't count. So you got to actually add two more days. So like, yeah. I would going to be tricky. Yeah. I'm almost, well, I don't know about Google Sheets, but I'm almost positive that you could import like an actual trading day function. Right. Yeah. So, so basically everyone's looking at a bunch of days in the time to come. It really matters though, because maybe to get to one of the other topics you want to talk about is we have incredible options interest on July 19th, right? So if though, if this trade still needs to be settled and is possibly going to be occurring sometime before the 22nd, then that means the 19th is a really interesting day, right? We're seeing lots of options interest there. So do you want to maybe talk about that a little bit? Yeah. I wish, I wish the platform was up and running so that I can like walk people through it. I'm trying to think of the easiest way to show you guys this because there's a lot of things that I would try to show you. Maybe let me see if the platform comes up in a little",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 108,
      "start_timestamp": "00:11:03",
      "start_timestamp_seconds": 663.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=663"
    }
  },
  {
    "text": "up and running so that I can like walk people through it. I'm trying to think of the easiest way to show you guys this because there's a lot of things that I would try to show you. Maybe let me see if the platform comes up in a little bit and then we can pivot back over to the options. I'm hopeful that maybe they're just updating it and it'll come back up in a little bit. This is like easy to look at just cursory, right? This experience just happened. Yeah. A lot of calls expired in the money, which is wonderful for the stock. If you're long on it, should produce lots of buying. This is next week. And this is like something like 40 of the OI going forward, all concentrated on the third week, a third Friday of July. Yeah. And again, none of this is financial advice. You know, that's a near-dated option that's extremely risky. But there's a lot of people front-loading options into next week. So I'm curious what you think about this because this seems unusual to me. I think, well, which part seems unusual to you? Just to have such a concentration here with such a near-term expiry. That's essentially been the standard so far for GameStop hands down. Okay. Yeah. So what you'll find in general in most products is the front standard explorations are almost always the busiest. And then there can be pockets further out of other",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 108,
      "start_timestamp": "00:12:17",
      "start_timestamp_seconds": 737.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=737"
    }
  },
  {
    "text": "a concentration here with such a near-term expiry. That's essentially been the standard so far for GameStop hands down. Okay. Yeah. So what you'll find in general in most products is the front standard explorations are almost always the busiest. And then there can be pockets further out of other things that are showing activity. But the vast majority of instances, you'll see the overwhelming activity in the front explorations. Now, what I find so fascinating about GameStop's options in particular, though, is the variance. That part is very interesting. Where you can see the options chain. Actually, if you go back to that other screen. Well, I liked it background. Yeah. So you can eyeball this and you can see inherently where the standard explorations are. Just look at the numbers that are much higher than the, exactly. You can straight up eyeball it. Now, one of the things that's so interesting about GameStop, though, is the variance between further out explorations and closer ones. Because to your point, your eyeball of seeing like heavy near-term volume or OI in the option space, that's, it's not inherently anomalous. That's pretty normal. But what is fairly anomalous is how big it is comparatively front versus further out. But, I've noticed that essentially being like a rolling trend with GameStop. It's actually been one of the most interesting things about the product to me is like, I've talked about the way that I buy options typically. I've shared a video a",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 108,
      "start_timestamp": "00:13:24",
      "start_timestamp_seconds": 804.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=804"
    }
  },
  {
    "text": "it is comparatively front versus further out. But, I've noticed that essentially being like a rolling trend with GameStop. It's actually been one of the most interesting things about the product to me is like, I've talked about the way that I buy options typically. I've shared a video a million times. I'll share it again. And it's because I think a lot of people light money on fire with the way that they buy options trying to trade something like GameStop. And specifically here, what confounds me is going so short term perpetually. Because those options are going to decay the fastest. And they will experience more of a move if you do eventually get a move in your favor. But if you don't, they decay pretty fast. So yeah, the kind of a meandering answer. The short one is seeing the active options being really focused in these near-term explorations that doesn't surprise me. Seeing it centralized in 19 July doesn't surprise me because that's a standard expiration. And the thing that does interest me though is just how big of a variance there is between the front explorations and then like the next month expiration. Having a gap that's typically like 100,000, like several hundred thousand O.I. Difference, that's interesting to me. Cool. Yeah. So I think what's also interesting is the community is largely avoided options because I think historically they got burned on out of the money options. I'm sort of curious what you're thinking",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 108,
      "start_timestamp": "00:15:06",
      "start_timestamp_seconds": 906.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=906"
    }
  },
  {
    "text": "gap that's typically like 100,000, like several hundred thousand O.I. Difference, that's interesting to me. Cool. Yeah. So I think what's also interesting is the community is largely avoided options because I think historically they got burned on out of the money options. I'm sort of curious what you're thinking about. It just seems like in this last couple of months, there's been far more in the money options than I remember there ever being because I could remember this maybe just like me misremembering or wanting to remember something. But it seemed like every week, you know, people would be bummed out because they would see all these out of the money options on a Friday. But these days it seems like there's more landing in the money. So maybe do you think maybe people are learning picking up on some stuff? Yeah, that's a great question. And I'm not exactly sure because I don't have a great understanding of the standard purchasing behavior before to like draw what I would consider to be a more direct comparison. But if I were to take a swag at it, I think a big part of that also comes down to people learning more about the products themselves. So for example, if there's a lot of folks from like the ape community that are trying to pitch into this idea of creating a gamma ramp, well, you need a mix of in the money and out of the money options to",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 108,
      "start_timestamp": "00:16:29",
      "start_timestamp_seconds": 989.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=989"
    }
  },
  {
    "text": "people learning more about the products themselves. So for example, if there's a lot of folks from like the ape community that are trying to pitch into this idea of creating a gamma ramp, well, you need a mix of in the money and out of the money options to start that process. So I think there's something probably coming from that angle. I also think that there's another angle that just focuses on how much raw dollars you can make. So there's a lot of reasons to go in the money. Like typically when I'm buying options, the overwhelming majority of instances, they're greater than 60 days out. A smaller subset sometimes will be 30 days out that like I typically won't go same week unless I'm playing something very short term that I can look at decisively. But I most of this time will be a little bit further out in time and it's almost always for the base position at the money or slightly in the money. And it's because you get a better dollar for dollar move with the underlying at a higher delta. And again, if I can get my platform to wake up, I can walk you guys through kind of an example that will help you visualize that concept a little more in depth. But the thing, the way to think about it is out of the money options are cheaper. They will compound as a percentage return much better than in the",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 108,
      "start_timestamp": "00:17:38",
      "start_timestamp_seconds": 1058.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1058"
    }
  },
  {
    "text": "can walk you guys through kind of an example that will help you visualize that concept a little more in depth. But the thing, the way to think about it is out of the money options are cheaper. They will compound as a percentage return much better than in the money options. They require a bigger move in order for them to like really start printing for you. And they will have slightly different theta decay tendencies depending on what the delta is and stuff like that. So my general approach to most things in life is actually balance. So I don't inherently do just one. I typically will have a base position little further out in time, typically at least slightly in the money, if not deep in the money. And then I'll add what I call kicker options. And those are near term expiration further out of the money. And that's really to capture a magnitude of a move if I get it because those options can compound super fast. But they are fighting a steady steady headwind of theta decay. And unless you get a big move real quick, they become worth less super fast. So let me run because I haven't watched your I should have watched your video about game stop options. But let me see if I'm learning correctly from you. So you know, this is our standard expiry for July. Here's our standard expiry for August. And then we've got September on October.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 108,
      "start_timestamp": "00:18:52",
      "start_timestamp_seconds": 1132.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1132"
    }
  },
  {
    "text": "me run because I haven't watched your I should have watched your video about game stop options. But let me see if I'm learning correctly from you. So you know, this is our standard expiry for July. Here's our standard expiry for August. And then we've got September on October. So this is about three months out. So I look for something in the money here as like my base position. So right now we're at 26. So we're going to choose something around one of these strikes here. And these are there. Go ahead. Does this have delta? This is just Yahoo finance. I may very adept trader that uses very powerful tools. Yeah. Yeah. Yeah, I think that that's okay to ballpark it there. Let me see real quick. I have another platform I can also look at what expiration are you in right now? I am in October. Got it. Yep. So those are 98 days out. That's a little far from where I would go for something like game stop specifically. I would probably favor like 20 September. Okay. The only reason for that is like again, game stop is I say it all the time. It's different. Like you have to do things very differently with this thing. And when I look at when I look at the options here, they're not they're not crazy priced. I would probably be looking at at least like a 65 delta, but then you have to find liquidity.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 108,
      "start_timestamp": "00:20:11",
      "start_timestamp_seconds": 1211.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1211"
    }
  },
  {
    "text": "It's different. Like you have to do things very differently with this thing. And when I look at when I look at the options here, they're not they're not crazy priced. I would probably be looking at at least like a 65 delta, but then you have to find liquidity. So the most liquid choices I see look to be about either the 25s. That's a really, really heavy strike. There's 2600 rely there. So that tells me that there's transactions in there. What three there bid at 515 offered at 550. So that would be fine. I personally would probably want a slightly higher delta because those options are a lot of extrinsic value. So those are also going to decay a little quicker than I would prefer. And so we're waiting by that. Let me just slow down a second. So since the strike is 25 and the price is five, you're basically you got to value this at basically like 30 bucks and the stock isn't at 30 bucks yet. Your 4 short of that. So 4 worth of that is like extrinsic right now wrapped up in theta. Yeah. So the way to think about the calculating the amount of theta in the options, it's the difference between the current price and the strike price. So current price is 20604. That strike price is 25. So an option price has two components intrinsic and extrinsic value. Intrinsic value simply put is how far in the money",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 108,
      "start_timestamp": "00:21:19",
      "start_timestamp_seconds": 1279.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1279"
    }
  },
  {
    "text": "calculating the amount of theta in the options, it's the difference between the current price and the strike price. So current price is 20604. That strike price is 25. So an option price has two components intrinsic and extrinsic value. Intrinsic value simply put is how far in the money it is. So in this case, it is 1 and 4 cents in the money. So if we take the midpoint between the bid and the ask to value the option, let's just call it a 525 just for ease. So you would take 525, that's the total value of the option. You would subtract out your intrinsic value, which is a dollar and four cents. And then the remainder of that is extrinsic value. So that would be 4 and. 221. 4 and 2 and 2. Yep. And that's all basically now subject to theta decay, right? Exactly. That's all going to slowly decay away. And the good part about being further out in time is you decrease the rate of theta decay, but you're paying more upfront. So more total theta can decay. Right. Because you paid 525 exactly to buy you that time. So yeah, perfect. And it decays exponentially, right? So like on the on the near term, you're only going to lose a little bit of that extrinsic value. But then like let's say six months, this is three months out. Let's say a month has gone by. Now it's going to accelerate. Two months",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 108,
      "start_timestamp": "00:22:38",
      "start_timestamp_seconds": 1358.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1358"
    }
  },
  {
    "text": "it decays exponentially, right? So like on the on the near term, you're only going to lose a little bit of that extrinsic value. But then like let's say six months, this is three months out. Let's say a month has gone by. Now it's going to accelerate. Two months go by. It's going to accelerate a lot. And then as you get closer and closer and closer, there you go. You got to right there on the screen. So yeah, I totally stole the screen share from you. But you actually do a great job explaining this exact graph. So what this in the top right is this is just showing you the behavior of the Greeks. But what you'll notice is theta decay starts to really accelerate once you start getting within 60 days to expiration. And then it becomes highly exponential within 30 days. So and this simply put is because options, they have to make a choice. All of these out of the money options, they are going to go to zero. They have no intrinsic value. So as you get closer and closer to expiration, these are going to move way, way faster. So that's why you see this accelerate to that degree. So when I'm using something, I'm just using ORETS. Because again, I don't know if I've mentioned but my platform is now, it's kind of like if I don't have my pants on, like not having the ability to open the platform",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 108,
      "start_timestamp": "00:24:13",
      "start_timestamp_seconds": 1453.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1453"
    }
  },
  {
    "text": "why you see this accelerate to that degree. So when I'm using something, I'm just using ORETS. Because again, I don't know if I've mentioned but my platform is now, it's kind of like if I don't have my pants on, like not having the ability to open the platform is like literally you're wearing pants right now? Yeah, well actually I'm not wearing short shorts, but. But so if if I look at these, there's a bunch of things I'm trying to balance. The first thing is I want to be far enough out in time to give it time to work. However, I know the further out in time I go, the more expensive they get. The next thing is if I do not get a high delta being further out in time, I'm not going to experience as much of the move because. So experience delta for me. What's delta? Great question. So there are a handful of Greeks that we care a lot about. Delta is one of them. So delta does a few things for us. The high level view of what delta does is it tells us the rate of change of an options premium per one point move in the underlying price. So that means in this case, if game stop goes up by one dollar, these options, CETRUS Parabus, everything else remaining the same will go up by 64 cents. That's what game is. Or I'm sorry, delta. So delta tells us",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 108,
      "start_timestamp": "00:25:19",
      "start_timestamp_seconds": 1519.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1519"
    }
  },
  {
    "text": "premium per one point move in the underlying price. So that means in this case, if game stop goes up by one dollar, these options, CETRUS Parabus, everything else remaining the same will go up by 64 cents. That's what game is. Or I'm sorry, delta. So delta tells us the rate of change of an options premium. You can use it for other things. It's kind of a back of the napkin tool for probability of in the money, probability of touch. So in like layman's terms, if game stop goes up 1 tomorrow, your option will go up 1, it'll go up 0.6, 4. It's based on a dollar move. So it's not based on percentage moves, but yes, it would essentially move a fraction of the dollar move. Okay. A question. I have another question. Yeah. So that's algorithmic, right? That's controlled by options pricing, which is inherent within how their schema works. But what if demand comes in suddenly and like wipes out all the sell orders on that particular strike, who would you sell it for a higher amount because it's just in demand at that moment? So typically if an option comes in really high demand like that, the bid ask spread would tighten. So you would gain a little bit more liquidity actually. Now if there's a ton of demand, because one of the things to always remember with options is their derivatives, their entire existence is derived from an underlying asset. So",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 108,
      "start_timestamp": "00:26:31",
      "start_timestamp_seconds": 1591.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1591"
    }
  },
  {
    "text": "high demand like that, the bid ask spread would tighten. So you would gain a little bit more liquidity actually. Now if there's a ton of demand, because one of the things to always remember with options is their derivatives, their entire existence is derived from an underlying asset. So if we're looking at it in a vacuum, just in a vacuum, and the options are moving a lot and we're just pretending for whatever reason the underlying cannot move, the underlying is frozen, then there would be observably little change in the value, the price of those options. This is in a vacuum, which is not reality. Because as that's happening, the underlying is probably moving for one reason or another, which then creates kind of this cycle that we can see where as people are piling into options, the market makers typically are the other side of the trade, they will start hedging their positions by using the underlying and other options, which can move the underlying itself. So there can't really be a buy supply in balance because if a lot of buy orders come in for a particular strike and expiry, the market makers will just write contracts for that. Yeah. And if it's in that scenario where it's very one-sided order pressure, they can widen their bid-ask spreads to manage their risk. And in that case, once I'm sorry to keep interrupting the questions. So in that case, like let's say, like Rory and Kitty",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 108,
      "start_timestamp": "00:27:49",
      "start_timestamp_seconds": 1669.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1669"
    }
  },
  {
    "text": "write contracts for that. Yeah. And if it's in that scenario where it's very one-sided order pressure, they can widen their bid-ask spreads to manage their risk. And in that case, once I'm sorry to keep interrupting the questions. So in that case, like let's say, like Rory and Kitty came in and wiped out or bought all the 20 strikes for June 21st, I believe it was. If you had already held those particular contracts, would you have seen a sudden surge in the price of your options that have been able to move on that beating the market makers to it? Or do they basically beat you to the punch? It would be the market makers leading the change in the price based on their assessment of the order flow. So you wouldn't see the price move unless it was adjusted by the market makers. Again, looking at this in a vacuum, pretending that the underlying isn't moving, looking at just the options. Okay. Cool. It's one of the things to always keep in mind with something like options or really any other derivatives, the market makers are very much slaved to the order flow. So if there's persistent buying, they have to continue creating, providing a market, right? That's how they make their money. So they're providing a market, providing a market to this one-sided order flow. Well, they have to continue hedging all this risk. Their ideal scenario would be to have a bit in an",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 108,
      "start_timestamp": "00:29:04",
      "start_timestamp_seconds": 1744.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1744"
    }
  },
  {
    "text": "persistent buying, they have to continue creating, providing a market, right? That's how they make their money. So they're providing a market, providing a market to this one-sided order flow. Well, they have to continue hedging all this risk. Their ideal scenario would be to have a bit in an offer and you want to buy options. I sell them to you and then I immediately turn around and neutralize and flatten them and buy them from somebody else that's selling them, right? And essentially collect a bit ask spread. And if we see really strong one-sided order flow, it actually puts them in a terrible spot because they now have to accumulate massive inventory and nobody's offloading their risk, which is what they would prefer to be able to do. So in those instances, they can absolutely widen the bit ask spread and they can say, the bit ask spread is an expression of what they're pricing volatility at. But then it's also an expression typically that it would be a size, right? So they would say, I'm bid at 515 for 100 lots. I'm offered at 550 for 500 lots. They can offer different sizes and that's to help them manage their book, right? So in that case, they're really trying to work on the offer side. That's why they're giving you more size there. And they're trying to be lighter on the bid side and that's typically a way for them to manage their book. So are",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 108,
      "start_timestamp": "00:30:22",
      "start_timestamp_seconds": 1822.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1822"
    }
  },
  {
    "text": "help them manage their book, right? So in that case, they're really trying to work on the offer side. That's why they're giving you more size there. And they're trying to be lighter on the bid side and that's typically a way for them to manage their book. So are you seeing this behavior now? Are you seeing an acceleration of options buying on GameStop and then therefore a widening of the spreads? It's not a universal widening of the spreads. But one of the things to always remember is on a relative basis, you can always come up with kind of like an assessment of what's something that's liquid, right? So let's check out just an example really quick in Spy. And we'll go to those that same expiration cycle, which I think is here. And we were looking at like a 64 delta option. The reason why I use 64 delta is or something like that is to normalize across the different products for the basis of a comparison. So right here. So these options, they're bid at 26 offered at 34. So the process to like assess liquidity of something, I would literally take 1734. I would subtract 1726. That gives you the bid ask spread, eight cents. You can now take that bid ask spread of eight cents divided by the strike price. Right. Multiply that by 100. Now you have a percentage and this is normalized to everything. So the percentage of the bid ask",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 108,
      "start_timestamp": "00:31:36",
      "start_timestamp_seconds": 1896.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1896"
    }
  },
  {
    "text": "subtract 1726. That gives you the bid ask spread, eight cents. You can now take that bid ask spread of eight cents divided by the strike price. Right. Multiply that by 100. Now you have a percentage and this is normalized to everything. So the percentage of the bid ask spread here of the strike price is 0.014. So even though is that automatically calculated somewhere, do you see that showing up somewhere? No, I do it. Oh, okay. Yeah, they don't they don't normalize it for you. What I've learned in a lot of instances, they don't make this stuff easy for some striking reason. We also use lots of silly terms when we're talking about this stuff. So I'm finding it interesting that you target the 64 delta. Is that common because look how heavy the activity is there for the spy? It's not so much that it's a 64 delta. It's more that it's a round number. You'll notice that the 50s, right, big number. Humans are hilarious. We're so predictable. 560s, bigger number, 565s, bigger number, right? So five dollar increments. It's just a very natural cognitive bias. And then the other thing is if there's the start of order flow to an option, it's typically followed by it. So like, let's say for example, I wanted to buy an option and for whatever reason I wanted something around a 60 delta, I'm going to gravitate to this one because there's more liquidity here than everything",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 108,
      "start_timestamp": "00:32:46",
      "start_timestamp_seconds": 1966.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=1966"
    }
  },
  {
    "text": "the start of order flow to an option, it's typically followed by it. So like, let's say for example, I wanted to buy an option and for whatever reason I wanted something around a 60 delta, I'm going to gravitate to this one because there's more liquidity here than everything else. And everyone else is doing the same thing. So it becomes like a kind of like a ball rush or a like a crowd mentality. It can be. It's really more in pursuit of liquidity though. It's not that, oh, I think other informed traders are going here to 555. So I want to do what they're doing. It's more, I don't want to pay as wide of a bid-ask spread. So I'm going to do everything I can to keep this as small as possible. Now the market's closed. So I mean, realistically, this has a similar size market, right? So you can easily go here at the probability of you getting filled here versus here at the same bid-ask spread is actually very low. You'll probably get a better fill on the 555s. So just finishing the example quickly, going back to GameStop looking at these 64s. So right now and other people can try this, right? So you just take the 550, you subtract 515. That gives you 35 cents wide. You divide that by 25 multiplied by 100. Your bid-ask spread as a percentage is 1.4. As compared to zero point zero, one 4. Oh",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 108,
      "start_timestamp": "00:34:07",
      "start_timestamp_seconds": 2047.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2047"
    }
  },
  {
    "text": "So right now and other people can try this, right? So you just take the 550, you subtract 515. That gives you 35 cents wide. You divide that by 25 multiplied by 100. Your bid-ask spread as a percentage is 1.4. As compared to zero point zero, one 4. Oh zero. So huge. Over some massive. Massive difference. That's because it's a volatile product. If things are more volatile, they will have wider bid-ask spreads. It serves as kind of like a natural breaking system for markets. So there's just another thing for people to be aware of. If you're trading small contracts and you're not trading a ton, it doesn't necessarily matter a bunch. But it will explain to some degree why you will find people central again, 25, 30. It's the same thing. It's the same mental tendency to look for these round numbers and then people will gravitate to where the rest of the volume is. So the significant difference though, like if you're looking at the delta of 64 versus the delta of 82, that's going to cause a big difference in the behavior of the options contract. Because if GameStop goes up a dollar, I'm netting way more of that move. So way more is intrinsic there. Right. Is what we're saying there at the. Exactly. What's strike are we seeing there at the 20s? That's a big difference. So you're buying. That's a big. You're buying way more of this stock and you're gambling",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 108,
      "start_timestamp": "00:35:05",
      "start_timestamp_seconds": 2105.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2105"
    }
  },
  {
    "text": "netting way more of that move. So way more is intrinsic there. Right. Is what we're saying there at the. Exactly. What's strike are we seeing there at the 20s? That's a big difference. So you're buying. That's a big. You're buying way more of this stock and you're gambling way less. It's that's exactly the way to look at it. It's a way of gaining leverage. So every options contract holds up to 100 shares of the underlying, right? Each options contract is worth 100 shares. So the way you can look at the delta is that tells you how many shares the position is behaving as right now, right? So remember, delta tells us the dollar change in or it tells us the premium rate of change for every dollar move in the underlying. So essentially each one of these is behaving like one share. So that is exactly why you will see these move and give you a better gross dollar return. However, something like this can give you a slightly better compounding return where you're putting up less money, right? Because these are called 525 versus these where you're paying 760 something like that. So these are paying more, but you if you get a move, you'll make a bigger gross dollar amount. These you're paying slightly less, but you will see a slightly less dollar move for the underlying itself. So that's the cool part about options is that you really have the ability to",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 108,
      "start_timestamp": "00:36:27",
      "start_timestamp_seconds": 2187.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2187"
    }
  },
  {
    "text": "are paying more, but you if you get a move, you'll make a bigger gross dollar amount. These you're paying slightly less, but you will see a slightly less dollar move for the underlying itself. So that's the cool part about options is that you really have the ability to construct positions that makes sense to you that really align with what you're trying to accomplish. So typically I'll have a base position that looks like this. So out here in the 25s and it's I literally have these right now. And then I'll put on shorter term positions, typically two weeks, three weeks, something like that. If I start seeing price movement and I'll do something that's a little closer to at the money or slightly out of the money. And it's because these can compound a lot. So the delta you're looking for on these is maybe somewhere around 0.5. I would less than that. So typically I would be looking like a 30 delta, 40 delta. A big thing is making sure that you're getting exposure to enough gamma, which this doesn't show me for some reason. But gamma in a nutshell is the rate of change of delta. So that's essentially an option's ability to compound. So options that are closer to expiration. That's what this is here. This yellow line represents closer to expiration. We'll have a higher gamma. And that just tells us that the delta is going to change faster, which is where",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 108,
      "start_timestamp": "00:37:35",
      "start_timestamp_seconds": 2255.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2255"
    }
  },
  {
    "text": "of delta. So that's essentially an option's ability to compound. So options that are closer to expiration. That's what this is here. This yellow line represents closer to expiration. We'll have a higher gamma. And that just tells us that the delta is going to change faster, which is where your compounding return potential comes from. But it gives and takes. If it goes against you, it means that you're going the wrong way super fast. So it's a delicate dance. So I'm hearing a lot of talk about options crush recently, right? Because we just had a period where the stock cooled down a lot. So and I think that's what you just kind of like talks to a little bit, right? The idea of like it turning against you. You all of a sudden your options lose a ton of value very quickly. So that means options crush right there. It's kind of a perversion of the term. I get what they're trying to say. Typically, when you'll hear people talk about options, crests of some sort, we generally referring to volatility actually. We normally volatility crush. But what that framing sounds like to me are people that have short term options with really high theta. And then their options are decaying away super, super fast. So there's a lot of options. Let's say for example, if we go to this all strikes, I think these have a 125. So there's 56,180 of these options way out here",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 108,
      "start_timestamp": "00:38:51",
      "start_timestamp_seconds": 2331.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2331"
    }
  },
  {
    "text": "have short term options with really high theta. And then their options are decaying away super, super fast. So there's a lot of options. Let's say for example, if we go to this all strikes, I think these have a 125. So there's 56,180 of these options way out here at 125. And their bid at five cents offered at six. Now again, this is a not my platform. This is just not my boat. But typically I would have theta in here to show you how much this decays. But on a daily basis, a huge chunk of this will decay out. So you could probably ballpark it to about a penny, which would be a dollar. But that's a fifth of the position after one day goes. It's gone. Just gone. So they will decay very, very fast. And most of these options that have these tiny little deltas, they can compound incredibly if you get a big old move in your favor. So if you're just a question, I've always had. So like looking at the strikes, they're at 100, right? So stock starts moving. Let's say the stock moves up 20 tomorrow or on Monday. We see a settlement cycle. Not a financial base. Stock goes from 25 or 26 to 46, right? Roughly speaking, that strike, if I was holding one contract, because the underlying is now moved 20, I should get, because it's got a delta, what's the delta on that guy? It's zero,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 108,
      "start_timestamp": "00:40:04",
      "start_timestamp_seconds": 2404.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2404"
    }
  },
  {
    "text": "see a settlement cycle. Not a financial base. Stock goes from 25 or 26 to 46, right? Roughly speaking, that strike, if I was holding one contract, because the underlying is now moved 20, I should get, because it's got a delta, what's the delta on that guy? It's zero, because it's so far out of the money. Right? So it won't move in value, right? It will. They just, because delta, it goes beyond two decimal points. So there's three, four, five decimal points to these really far out of the monies. Okay. And then it will only start changing in value as the strike approach is 100, right? Um, yes. So this either you would need to see the underlying move in the favor of the position. So in this case, if we're long these, you would need the underlying to go up or if volatility exploded for some reason, if volatility goes up a lot, the premium of all options goes up. Now, you would, who is quantifying or is it a static calculation for just vol, for volatility? So volatility, when you say who's, are you saying like who's determining it? Because it's, you know, it's a function of what the underlying is doing, right? So the stock is, it's a function of what the underlying is expected to do. So how, how is that derived? Great question. So volatility is a absolutely fascinating, fascinating component of options. And essentially, there are different types of volatility",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 108,
      "start_timestamp": "00:41:28",
      "start_timestamp_seconds": 2488.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2488"
    }
  },
  {
    "text": "a function of what the underlying is doing, right? So the stock is, it's a function of what the underlying is expected to do. So how, how is that derived? Great question. So volatility is a absolutely fascinating, fascinating component of options. And essentially, there are different types of volatility that we use. So on the trading side, more often than not, we, we use implied volatility. This is where we're taking whatever volatility has already been baked into the price and we're pulling it out and we can see what it is. That's implied volatility. Now what you're referring to is what's called forecast volatility. This is what market makers are doing. They're essentially maintaining a volatility surface model that postulates what volatility is going to be going forward. There are a lot of different ways to create these models. They're proprietary by nature. The reason why they're proprietary is because that's literally, if you can price, better than that person, you can make more money than them. So we'll not be able to actually see if you want to call it F, the forecast volatility, but we'll be able to see its effects by the pricing of the options as things are happening. Okay. Because they're at the, at the end of the day, they're the ones selling most of the options. So in theory, they could suddenly price options very, very cheaply crushing out all the options, but that's a risk for them because if the stock",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 108,
      "start_timestamp": "00:42:47",
      "start_timestamp_seconds": 2567.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2567"
    }
  },
  {
    "text": "options as things are happening. Okay. Because they're at the, at the end of the day, they're the ones selling most of the options. So in theory, they could suddenly price options very, very cheaply crushing out all the options, but that's a risk for them because if the stock were to then move into those options, they would have potentially sold a bunch of them at that cheap price and they get blown out. So it's in their interest to do this and not cheat on pricing the options. They have some wiggle room, but not a ton because it's still a consensus driven supply and demand market. So if I see them price something too cheaply, I can immediately tell there's an opportunity so people like me that are even, you know, I'm still, I'm still really dumb, but I'm not super dumb. So like if I see an opportunity like that, I'm going to take a shot on it. So speculators like me that are looking for that stuff will then flood into those products. And they can do it to one another too. So if like one market maker messes up on their options pricing, another one could buy on all up and then sell them and immediately make some money. Exactly. Okay. Options, sorry to keep interrupting. How many options market makers would there be? Because people talk about Wolverine. People talk about Citadel. I don't know. Susqueilana does options, but how many on one",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 108,
      "start_timestamp": "00:44:04",
      "start_timestamp_seconds": 2644.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2644"
    }
  },
  {
    "text": "one could buy on all up and then sell them and immediately make some money. Exactly. Okay. Options, sorry to keep interrupting. How many options market makers would there be? Because people talk about Wolverine. People talk about Citadel. I don't know. Susqueilana does options, but how many on one stock would they typically be involved in making this market? It's a great question. Really difficult to know. Really difficult to know because technically speaking, I could even behave as a market maker. Okay. Yeah, it's in terms of like large market making firms, you hit a lot of them because the other component to this that adds and muddies the water even more is there are prop trading firms and high frequency trading firms that also essentially behave short term as market makers. They have a different game, right? That's not their primary modality, but they can interact with things that are mispriced. Essentially, either supply liquidity by taking the other sides of trades potentially. Or take advantage of some of its mispricing. The mispricing absolutely. And algorithms, algorithms are high frequency trades are literally hunting for that. They're so sophisticated to the point where they care about how close they are to the exchange. They're paying millions of dollars to be ex bit closer to the exchange to reduce latency. And so there was a clip on SuperSonic about just that today or yesterday, right? Famous clip from it was quite a while ago. It was like over",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 108,
      "start_timestamp": "00:45:13",
      "start_timestamp_seconds": 2713.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2713"
    }
  },
  {
    "text": "close they are to the exchange. They're paying millions of dollars to be ex bit closer to the exchange to reduce latency. And so there was a clip on SuperSonic about just that today or yesterday, right? Famous clip from it was quite a while ago. It was like over 15 years ago, but talking about the latency and how much they're paying not just for speed, right? For internet speed, server location, but they're paying for particular levels of information and quality of information from the markets. And the markets are actually making the exchanges or making more money on that than they're making on offering those premium packages for information, quality and speed of information than they are on the actual trading. So, but what I'm curious about is when you're showing the volume on GameStop options as an example, it seems so low to me. Is that still going to be an efficient market where like a strike in that expiry only has volume on a day of maybe 50 or 100, like if you go to the daily volume on some of these or even lower in some cases. So is it still efficient? Yeah, it will always be relative to the size of the product, but yeah, like I still absolutely. Because relative to the size of this stock, there's actually a run of activity in here, like a crazy amount. So it's almost the inverse, right? So like if you look at other companies,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 108,
      "start_timestamp": "00:46:33",
      "start_timestamp_seconds": 2793.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2793"
    }
  },
  {
    "text": "will always be relative to the size of the product, but yeah, like I still absolutely. Because relative to the size of this stock, there's actually a run of activity in here, like a crazy amount. So it's almost the inverse, right? So like if you look at other companies, well, GE is kind of big, but I don't know what this looks like. I'm literally seeing. Yeah, look, look at the OI here. 14, 24, 183. And this is a 159 stock. This is GE. This is a big company. And you can see just how little activity there is here. There's, and this is big for this product, the 1500. So it's almost actually the inverse where GameStop is crazy active for the size. You should see it. We should see efficiently priced options. Moderately. The reason why I say moderately is because of the way that this moves, which is again, what makes it so fascinating is from a market-making perspective, you literally have to be ready to be ran over by a train whenever you're making a market in this. So I mean by that. The fact that GameStop does this, it goes from 17 to 48. That from a market-making perspective, being on the other side of those options traits, that's hell. Because they are having, again, this is kind of the entire concept of a gamma squeeze, right? It's driven by market makers. And it's because they're getting fucking destroyed. And they have to",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 108,
      "start_timestamp": "00:47:42",
      "start_timestamp_seconds": 2862.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2862"
    }
  },
  {
    "text": "48. That from a market-making perspective, being on the other side of those options traits, that's hell. Because they are having, again, this is kind of the entire concept of a gamma squeeze, right? It's driven by market makers. And it's because they're getting fucking destroyed. And they have to find a way to manage their risk in the positions. And how would they do that? So we know that market makers have come out and said they've made a ton of money on GameStop. So how should we do, Dan? All right, so they're making money on the spreads. How else would they be mitigating risk on the options front? For somebody that's not in the know here, because occasionally they are going to get run over, right? We saw options printed two or three times now, at least in the last two to three months. More, actually, probably, because May 3rd would be a big options printing in the whole week to follow. May 13th and 14th. But then multiple periods since then, there would be great opportunity to buy into some options and sell some options, make a ton of money. So what could they be doing to, because can they play them themselves, too? Absolutely. I was literally going to say that. That is one of the first things that they're going to do is hedging what the underlying is one tool that they will use provided that it's accessible. But they will use options tremendously,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 108,
      "start_timestamp": "00:49:00",
      "start_timestamp_seconds": 2940.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=2940"
    }
  },
  {
    "text": "to, because can they play them themselves, too? Absolutely. I was literally going to say that. That is one of the first things that they're going to do is hedging what the underlying is one tool that they will use provided that it's accessible. But they will use options tremendously, because the only thing that it's really important to remember is that option market makers, they have a book of a ton of things, right? It's not just individual strikes, you know, that counterparty to a person's single trade. They're on the other sides of thousands of trades. So they can use options that it's actually why they're so interested in all of the Greeks, because they can mitigate a lot of their risk by using options or even more interesting. Actually, I get my tinfoil hat. Do you like my tinfoil hat? Love the tinfoil hat. I need to make one. Yeah. I have to, I had to put my tinfoil hat on for this part. But the other thing that it can do is that if they think it's an informed order, like the counterparty to the order knows something, they can run with the order. So they can order. Okay, so that is something that I never knew about until very recently, the idea that orders are flagged, right? As informed versus uninformed. Absolutely. What does that mean? So you're telling me every option's order is that true for equity orders too, has a flag on it",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 108,
      "start_timestamp": "00:50:10",
      "start_timestamp_seconds": 3010.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3010"
    }
  },
  {
    "text": "can order. Okay, so that is something that I never knew about until very recently, the idea that orders are flagged, right? As informed versus uninformed. Absolutely. What does that mean? So you're telling me every option's order is that true for equity orders too, has a flag on it that says informed versus uninformed. I don't know if it's every single one. I couldn't speak intelligently to the to the actual process that they flag it. But what they can do is identify order flow that looks, it looks not like standard retail, right? Like the vast majority of retail trades, they're going to assume is uninformed to a degree. And they're not necessarily going to worry about it too much. But if they see somebody like roaring kitty, for example, I actually spoke to one of my buddies that's a market maker for this exact thing. So I was just curious. I was like, how would you even manage this position? And the first thing he said is that he would immediately hedge because he doesn't want to have open-sized risk with something that looks informed. So the way that it looks informed is that it's really big size. Somebody taking a big bet. And they're also willing to enter multiple times, right? Like they're building a position. So that starts to look like somebody knows something. And market makers, they're wildly, wildly educated in terms of what order flow is normal for a product. And then what",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 108,
      "start_timestamp": "00:51:21",
      "start_timestamp_seconds": 3081.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3081"
    }
  },
  {
    "text": "size. Somebody taking a big bet. And they're also willing to enter multiple times, right? Like they're building a position. So that starts to look like somebody knows something. And market makers, they're wildly, wildly educated in terms of what order flow is normal for a product. And then what order flow becomes anomalous. They're fantastic at that. So it's another way that they can identify opportunities in things like mergers and acquisitions. They can see crazy order flow for earnings. They can see inside or order flow and then try to frontrun it. So essentially, they're looking for certain kinds of behaviors and patterns that they identify as different for the underlying, the standard run of the mill transactions. And they're looking for things like size, persistence, the way that they're structuring the trades. And then they can make a assessment and think, okay, do I want to bet against this guy? If so, they would under hedge. If they don't want to bet against the guy, but they're not sure that they want to run with them, they'll just essentially hedge the position totally and just run a pure hedge and collect what they can off of that. Or you said earlier, running with them, would that be why we saw so many January 21st at the 20s? Because while he owned 120,000 of them, a ton of them came on top of this, right? Yeah, it's really, really hard to discreetly identify who was piling on, but",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 108,
      "start_timestamp": "00:52:25",
      "start_timestamp_seconds": 3145.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3145"
    }
  },
  {
    "text": "Or you said earlier, running with them, would that be why we saw so many January 21st at the 20s? Because while he owned 120,000 of them, a ton of them came on top of this, right? Yeah, it's really, really hard to discreetly identify who was piling on, but there was a lot of people piling onto those. Right. So a lot of household and retail could have after the fact, but we saw, I believe, his position come in, got built during that week of the share offering, but then there were also, there were too many of these block orders of five to 10,000. There was more than just him doing that kind of a play. So that could be people just basically mirroring his trade. Kind of like I think you said, you do at times, right? A flag or a an order comes up and you're like, well, I better jump in on this because someone's building something. It's literally how I found his order. And that's the funny part. It's one of the funniest things about this whole story, at least from like my fox hole, my little view is the fact like, I had no idea it was him. Like, I don't know who it was. I'm just sitting here, just watching blinky lights and stuff. And I see something that starts looking interesting. And I'm like, wait a minute, what the fuck is going on? Yeah. So I start paying much closer",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 108,
      "start_timestamp": "00:53:37",
      "start_timestamp_seconds": 3217.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3217"
    }
  },
  {
    "text": "had no idea it was him. Like, I don't know who it was. I'm just sitting here, just watching blinky lights and stuff. And I see something that starts looking interesting. And I'm like, wait a minute, what the fuck is going on? Yeah. So I start paying much closer attention. And I'm like, like this right here, if this is big of a red flag as you could possibly get, you have this persistent sizing, 5,000 centralized at the 20s, 21 June. It's the same position, over three million dollar positions. And they're going on within moments of one another, right? So this one went on at 12 o' 3, 1252, 1138. Like we were just pounding this position. And it happens 11, 32, 28, like, it's incessant. So that lights up on my alert system literally like a freaking Christmas tree. And the first thing I think of is this is an insane amount of conviction, right? Like because you can see what the standard premiums are for positions that are being built. And then you start seeing blocks come in in the two millions, five millions. And there's a bunch of them at the same time. It's so maybe a follow up question on that. Sorry. I'm just going to say for in that instance, for an options trader, that is like a big, blinky, flashy red light. It's so, so apparent. And the market makers are going to have even more tools to see that. Absolutely.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 108,
      "start_timestamp": "00:54:42",
      "start_timestamp_seconds": 3282.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3282"
    }
  },
  {
    "text": "so maybe a follow up question on that. Sorry. I'm just going to say for in that instance, for an options trader, that is like a big, blinky, flashy red light. It's so, so apparent. And the market makers are going to have even more tools to see that. Absolutely. They yes, by the time I see it, they probably have already built a position. So people are really excited about like these 30s for next week. You know, is that anything like this at all? Because I don't know and I haven't spoken to it at all. Yeah, definitely not like that at all. So for a comparison, if we look over the last 30 days, the biggest trade was 875. Which I'm not I'm not dumping on that, right? Like that's not that's not it. 1,000 trade. That's a billion dollar options trade for this. That's that's that's the other hilarious thing about like looking at this stuff is just how much it like skews the perception of reality. Let's take a look at the 19 expiration coming up. So the biggest trade for this upcoming 19 July expiration is 234K. It was the biggest trade. So again, not insignificant, but being in the world of game stop. What's the strike on where do you see the strike on that one? Those are 30s. Those are the 30s. Okay. Yep. And I think this was a 5,000 lot. I think this came through with a couple others. Yeah,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 108,
      "start_timestamp": "00:55:54",
      "start_timestamp_seconds": 3354.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3354"
    }
  },
  {
    "text": "not insignificant, but being in the world of game stop. What's the strike on where do you see the strike on that one? Those are 30s. Those are the 30s. Okay. Yep. And I think this was a 5,000 lot. I think this came through with a couple others. Yeah, broken up. Yeah. Exactly. So I think this is the entire order. But I thought in it. So I think it amounted to 4810 here. And then my guess is there was probably obviously a little bit more that got tacked on probably to round it out. But the wild part here is because game stop is so freaking crazy when you see like, you know, quarter million dollar positions come through like you're numb to it. You're like, yeah, okay, bro, whatever. Like wait, wait, wait me up when this is 3 million. So it's it looks like something could be going on, but it doesn't look anything literally anything like what we saw going on back in the original squeeze. Right. So here's a here's a question. We know that he built that position. And he had to have had about 170 million to do it, right? Because he bought 120,000. That would have cost 60 60 something million. 68 million was the options for the options. And then there was like a 100 million for the shares, right? Yeah. Somewhere around there. All right. So was there an opportunity to make that amount of money into the",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 108,
      "start_timestamp": "00:57:11",
      "start_timestamp_seconds": 3431.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3431"
    }
  },
  {
    "text": "he bought 120,000. That would have cost 60 60 something million. 68 million was the options for the options. And then there was like a 100 million for the shares, right? Yeah. Somewhere around there. All right. So was there an opportunity to make that amount of money into the run up to 80. Conceivably options only could could that have been accomplished off of like a small starting position? How much how much could you have made? Playing that from before, basically, this is like early May into May 13th and 14th. I don't even know like the magnitude of because I've never played options. I don't know how much you can make on them. Could that have been done? In terms of when you say could that have been done, you mean making how much? So making enough to buy that next position, you would have needed about 170 million to buy those shares and buy those one's others, those 20 calls, right? So he needs my theory is he needs 170 million in cash on May 15th to start building his next position. If he started with say 5 million in cash on May 1st, can you turn 5 million on May 1st into 170 million two weeks later? Is that possible? Could he I would have to look closer at the numbers? Again, if my platform worked, I could answer it actually for you immediately. But I'm trying to log in again now and it looks",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 108,
      "start_timestamp": "00:58:25",
      "start_timestamp_seconds": 3505.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3505"
    }
  },
  {
    "text": "turn 5 million on May 1st into 170 million two weeks later? Is that possible? Could he I would have to look closer at the numbers? Again, if my platform worked, I could answer it actually for you immediately. But I'm trying to log in again now and it looks like it's still down. But it would be highly improbable is the way I would frame that. Like the probability of turning five into almost 200 million over the course of those two weeks, I don't I don't think that is a highly probable scenario. So theoretically it makes more sense. We're not trying to nail it down or we're just falling, but he probably came into there you go. He probably came into May 15th with like already a large cash position established and he probably had to have done something similar with Chewie because out of nowhere he shows up with nine million shares at Chewie, which I don't know how much those cost him. But it seems like. Yeah, that one's crazy to me too. The whole Chewie thing. And I think one of the most interesting parts about that one is I guess technically he could have used the options to gain that exposure, but that's still a big position. Right. We haven't seen his position exactly. We don't know if it shares. They would have to be to be reported as a 13 G though short dated options, right? Less than 60 days. Yeah, you",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 108,
      "start_timestamp": "00:59:39",
      "start_timestamp_seconds": 3579.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3579"
    }
  },
  {
    "text": "have used the options to gain that exposure, but that's still a big position. Right. We haven't seen his position exactly. We don't know if it shares. They would have to be to be reported as a 13 G though short dated options, right? Less than 60 days. Yeah, you would know that rule better than I would because I originally didn't even know on the 13 G if it could be shares and I had to look that up and I found out that it could be options. I mean, if it could be options and it could be options that I learned. And I also don't know if there's a difference between the the G and the D. I don't know. Yeah, that part I don't know either. Maybe maybe somebody in the chat knows I imagine. I think on a D you show the position on the G. The you don't have to show what the purchase. Well, no, the purchase date or the event date is noted on the G, but the price paid is not shown or anything like the positions are shown on the G. Just the like what the representation is in number of shares and what percent that is of the outstanding. So yeah, super curious. I just, you know, when is he going to come back? I don't think he's gone for good again. But are we going to see more details on that position? Because that's crazy. Did not expect",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 108,
      "start_timestamp": "01:00:55",
      "start_timestamp_seconds": 3655.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3655"
    }
  },
  {
    "text": "of shares and what percent that is of the outstanding. So yeah, super curious. I just, you know, when is he going to come back? I don't think he's gone for good again. But are we going to see more details on that position? Because that's crazy. Did not expect that at all. I'm not going to lie. Part of me expected whenever the reason why I keep taking this off in case you don't know is that a solid aluminum foil hat vents as well as you think it would. So it's kind of like cooking your head. Literally. And I tell you my brain is already too close like a steamed vegetable. So I don't need to actually become a physical one. I think I think there's such a crazy potential for him to go so many routes after that. Gee, like I don't think it's any sort of happenstance that he hasn't shown a portfolio update for about a month now. I know that there was a lot of people that were really expected to see something like yesterday. That part I find just so intriguing, right? He was pretty rock study with these updates. And then he just stopped for some reason that I find I find very curious. I don't know what to make of that. Do you have any ideas? Well, we can look at the timing, right? So let me look at the timing. I'm going to pull up. He has only posted",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 108,
      "start_timestamp": "01:01:57",
      "start_timestamp_seconds": 3717.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3717"
    }
  },
  {
    "text": "he just stopped for some reason that I find I find very curious. I don't know what to make of that. Do you have any ideas? Well, we can look at the timing, right? So let me look at the timing. I'm going to pull up. He has only posted his yellow updates since cut returning on June 13th. June 2nd was the first one. That was a that was a Sunday. And then the stock surge like crazy on June 3rd. Then he posted another update after that, like that evening. And I think the key there, I think what he was trying to telegraph was, I'm not pumping this thing, right? I just showing my position because he could have taken action and he made no action, right? Because the media, like it was blaming him for the events for tweeting, right? On the rise up to 80, right? So by not taking any action during this Monday morning pump, he's basically saying like, I'm not actually causing this to happen. He did one more update on the sixth. And again, his position is completely unchanged on the sixth. Then he livestreams as it's pumping again on the 7th, 6th and 7th, doesn't do anything with this position. So you can count, you can count the 7th as a yellow update. Can we just pause there for a second and just soak in the fact that we're looking at a portfolio that has 250 million in gains on",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 108,
      "start_timestamp": "01:03:09",
      "start_timestamp_seconds": 3789.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3789"
    }
  },
  {
    "text": "7th, 6th and 7th, doesn't do anything with this position. So you can count, you can count the 7th as a yellow update. Can we just pause there for a second and just soak in the fact that we're looking at a portfolio that has 250 million in gains on the day. Right? What is this? Like what is this? It's all game stuff. It's insane. I like, I find myself talking about this stuff. And I'm like, what the fuck am I even saying anymore? It's like, at least in time you kind of stop and you like realize how absurd this whole scenario is. I had a moment of that when I was just like working on the spreadsheet today. Like I'm working on the spreadsheet as I'm doing, just checking my way on it. And I just stop and I think to myself like, this is actually crazy. Like everything that's going on with the story is insane. Literally, literally, it's so wild to me that this is like the reality. And this is single dude. This is sitting in his house using Yahoo Finance for his chart. And he's just using what's his platform season here? You trade that? Yeah, that looks like whatever the, and that's not even like, that's not even like a platform that I can't open, right? Like I can't get in my damn platform. He's just logging into the web browser. And he's just using like the standard website. So yeah,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 108,
      "start_timestamp": "01:04:28",
      "start_timestamp_seconds": 3868.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3868"
    }
  },
  {
    "text": "You trade that? Yeah, that looks like whatever the, and that's not even like, that's not even like a platform that I can't open, right? Like I can't get in my damn platform. He's just logging into the web browser. And he's just using like the standard website. So yeah, he basically exposed his portfolio on Sunday, stock runs, he exposed it again, doesn't make any changes. Shows his position again as stock goes bonkers and then live streams and shows it live as it's then losing like three or four hundred million dollars in value. And he's laughing and drinking up beer, bro. Mad man. And then his final update. No, no, no, no, no. He still hasn't changed anything, right? Yeah. No, he's state static. No change. Company has now sold 75 million shares. And what does he do? Basically doubles down. Yep. Like if that's not because, you know, I see all these comments. I just saw a comment on my channel today, someone basically saying like, we're in kid he's going to leave. He's lost faith in the company. He just got hundreds of million dollars on stock. You know, like, there's, there's nothing, there's nothing about much of anything in here that indicates to me that like he's trying to leave even from even from that options position. Like, who puts on 68 million of options without the intention, like of doing something with, right? So yeah, I just, yeah, it's crazy. Absolutely crazy. And",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 108,
      "start_timestamp": "01:05:48",
      "start_timestamp_seconds": 3948.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=3948"
    }
  },
  {
    "text": "about much of anything in here that indicates to me that like he's trying to leave even from even from that options position. Like, who puts on 68 million of options without the intention, like of doing something with, right? So yeah, I just, yeah, it's crazy. Absolutely crazy. And the fact that the, the my big angle on my channel is I talk about the media, right? The media should be like saying how amazing this is because like, this is an incredible, just an incredible play. Like you said, so much conviction, right? It was so, so, so much conviction that you could just write it and follow it and do well because you know that someone with this amount of strength and what they're doing has to know what they're doing, right? I think that that's a really fair assessment. There's a comment from Franz Zoo who says he 99 could turn a few millions into more than 100 millions in two weeks. Look how he made four days on half a billion. I think though the one thing I would note for you, Frances, think about the difference in magnitude, right? Few millions into hundreds of millions versus starting from 200 million and then going to essentially 500 and change. So at one point, he had almost a billion like on this on the sixth, right? Who's supposed to be? Yeah. So that's like a five five X, right? Yep. Over a couple weeks. I think",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 108,
      "start_timestamp": "01:06:59",
      "start_timestamp_seconds": 4019.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4019"
    }
  },
  {
    "text": "millions versus starting from 200 million and then going to essentially 500 and change. So at one point, he had almost a billion like on this on the sixth, right? Who's supposed to be? Yeah. So that's like a five five X, right? Yep. Over a couple weeks. I think the other thing to note is there's something to be said about like what's possible and then what's probable, right? So when he started going through that like almost becoming a bill, and I think he made a tweet about that too, which was hilarious. He said you were a billionaire, which is putting, you got a pretty tinfoil hat back on for us, but maybe he is a maybe he had a billion in cash going into this because if he played just 2020 into 2021 doing a thousand X or 2019 into 2021, he did a thousand X on his position. There's been enough volatility in the meantime on just this one stock for him to create a very large position. The only thing I would say and a couple people have said similar things that I'm just not sure about is on the stream when the thing was plummeting, he made the explicit comment of like this is my only account and these are my only positions. So I have to go back and watch it. He said these are my only game stop positions. Did he say, oh, let's find out. I'll find it real quick",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 108,
      "start_timestamp": "01:08:10",
      "start_timestamp_seconds": 4090.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4090"
    }
  },
  {
    "text": "was plummeting, he made the explicit comment of like this is my only account and these are my only positions. So I have to go back and watch it. He said these are my only game stop positions. Did he say, oh, let's find out. I'll find it real quick while you're talking and then we can literally make the quip. Yeah. And he did say is cash a position. He did say that. So he did as he did it, he hovered the mouse inside the platform. Right. Give me one sec. I think I know where it's this is the argument of the century. Does roaring kitty. Well, I mean, yeah, I mean, let's let's ask the chat. I'll throw a poll in there for them and see what they say. What do you get? The question is essentially, does he have a large cash or other stock position outside of what we saw in these yellow updates here? Is this so is this only is this is only position or does he have other positions than this other capital. So does RK have a large cash pile or other positions outside of the e-trade portfolio? He's shared with us. Because the thing that considers he poses or his 13G trade event is for the what the 24th. I believe it's a fidelity account. My bad, guys, whatever the account is. I don't know. No, no, no, I think what people are saying is he's got a tab",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 108,
      "start_timestamp": "01:09:20",
      "start_timestamp_seconds": 4160.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4160"
    }
  },
  {
    "text": "with us. Because the thing that considers he poses or his 13G trade event is for the what the 24th. I believe it's a fidelity account. My bad, guys, whatever the account is. I don't know. No, no, no, I think what people are saying is he's got a tab open and fidelity. Oh, I see. Okay. You don't see what's in there. And then in his previous live streams, he's used fidelity tools. So he could have he could have an account on fidelity. I'm going to grab the screen share from you again, really quick. And then I'm going to share the sound as well. Yeah. So I think I think this is pretty close to where it is. Just one quick ad been note for you guys as I play this. If for whatever reason, YouTube flags makes they always do when I try to play shit. If it cuts the stream, they're it'll come back on. We just have to chill for a second is all that is. And I have to turn it off. So if we disappear for a moment, that is what cost it. All right. I'm guessing it's right around here because this is where like literally yeah, the most user. There is a session. There goes. All right. Here we go. And then let me know if you can hear it. There you go. All right. Cheers. Cheers. I got a lot there. So those, yeah, those are my only positions.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 108,
      "start_timestamp": "01:10:43",
      "start_timestamp_seconds": 4243.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4243"
    }
  },
  {
    "text": "this is where like literally yeah, the most user. There is a session. There goes. All right. Here we go. And then let me know if you can hear it. There you go. All right. Cheers. Cheers. I got a lot there. So those, yeah, those are my only positions. You know, as you know, about me, I'll take. So you heard what he said. Only positions. Yep. It's a true yellow again. I suppose. I know there's some cash. Quick side note again. Sorry. Can we just salute this man? He's sitting here with fucking band-aids on his face. And how far down is he on the day right here? What's this? 220 something new. You know, like lunatic. I love it. I love it. You just can't make this up, bro. All right. I got it. Actually, that's what I made. It depends on your positions, but uh, it's another yellow again. You know what I'm saying? It's how I roll. So that's that's that there. But I seen those headlines. E-trade. E-trade. I see those headlines. I gotta check. I'm checking in every day. A long end. I'm like, I'm right. Position's still there. Are they still there? Let me check. They're still there. Wait, they're still there. Okay. They're still there. Actually, I wasn't even like paying attention to the details. They're still there. But I'm each morning. I'm like, I don't know what's happening. So I go, all right. Well, don't make me. Don't make",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 108,
      "start_timestamp": "01:11:48",
      "start_timestamp_seconds": 4308.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4308"
    }
  },
  {
    "text": "there? Let me check. They're still there. Wait, they're still there. Okay. They're still there. Actually, I wasn't even like paying attention to the details. They're still there. But I'm each morning. I'm like, I don't know what's happening. So I go, all right. Well, don't make me. Don't make me. But E-trade, I'll do this with HTML. I'll do that. Don't make me. Don't make me remove it. I know how to do that. I'm just kidding. No, I'm going to put it back. We're good. We're good. We're good. No, we're those positions are there. Those positions are there. But I'll do it. I'll remove it. Don't make me. Don't don't make me do it. Don't make me. I'll delete that from the HTML. I will. All right. Mr. Robot Hacker here. You know, I learned a thing or two and I know how to delete that. I don't want to do it. I don't want to do it. But I can. I can. I'm just messing. I'm just messing people. Okay. It's still I put it back. See, I'm like, what the? It's like all green. He's like, oh, he's squinting. He's squinting. He's like, oh, he's waking up looking. I feel like that's me in the morning. Some days I wake it up and I'm squinted. I'm seeing the stuff. I'm like, oh, my what the hell did I do? So that's where we're at right now. Oh, did it go down? Oh, is it halted",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 108,
      "start_timestamp": "01:13:10",
      "start_timestamp_seconds": 4390.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4390"
    }
  },
  {
    "text": "waking up looking. I feel like that's me in the morning. Some days I wake it up and I'm squinted. I'm seeing the stuff. I'm like, oh, my what the hell did I do? So that's where we're at right now. Oh, did it go down? Oh, is it halted again? It's halted. Well, that's where it was. Right word. That's where we're at the hole. See, I wait until the halt because if if it's halted, it doesn't show the stuff. So it's needs to be unh halted. I don't know why it does that. It just is. And so yeah, there you go. There you go. Did we miss the farmer? He said his cash position. I think it was like right after his first. Yeah, he says it right in the beginning. He goes, there's some cash in there is cash position. But we can go back to that because I think in the context there, I took it to mean like what's in there. Now, just to be clear, it's difficult, right? Because he's he's thinking in layers. So I don't think that he would ever purposefully like lie to like misrepresent what he has. I like, I think he's super transparent. But it also would not shock me if all of his wealth was not in this one account. Yeah, right. That seems that seems shocking is I think what he's implying there, though, is that like this is his only options and stocks at",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 108,
      "start_timestamp": "01:14:10",
      "start_timestamp_seconds": 4450.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4450"
    }
  },
  {
    "text": "like, I think he's super transparent. But it also would not shock me if all of his wealth was not in this one account. Yeah, right. That seems that seems shocking is I think what he's implying there, though, is that like this is his only options and stocks at the moment, right? Yeah, I'll play the front part again to see the cash part specifically. I'm not sure it's. I'm doing it. But I think it's fine if I bring the don't hold it, don't hold it. There you go. All right. There you go. Is it on the chat there? There you go. All right. Cheers. Cheers. I got a lot there. So those, yeah, those are my only positions. You know, as you know, about me, I'll take it's a true yellow again. I suppose, I know there's some cash there. That's what I made it to. I know there's some cash there. So I think there's the rest. I think he says new positions. But I suppose, I know there's some cash there. That's what I made it to. Depends on your positions. But it's another yellow again. He does say his cash position. But I think just kind of riffing off the fact in trying to at least I took it as he's trying to reinforce the fact that he doesn't have any other positions. I think he was simply saying that because, you know, he has some cash, which I think in this case,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 108,
      "start_timestamp": "01:15:02",
      "start_timestamp_seconds": 4502.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4502"
    }
  },
  {
    "text": "think just kind of riffing off the fact in trying to at least I took it as he's trying to reinforce the fact that he doesn't have any other positions. I think he was simply saying that because, you know, he has some cash, which I think in this case, I forget it's millions of dollars in cash. That's like 30 million bucks almost. Yeah. I got some cash in there. I got some cash. Oh, God. Well, anyways, yeah. So that's what I thought was really interesting. Because because I really do think he's very transparent. And I like, I believe that when he said that I really do, I take him at his word. But that, I mean, it still wouldn't be crazy to not have, you know, it would not be crazy for him to have some cash in something else. Like you still got to live. I don't know if he has a family. But he does. And I'm curious how he would have built his shoey position. Because I was this was on the, he's talking here on the seventh. And then his last update is on three days later on the 10th. He's converted now all those options into shares. And then there was one or no, 13th, 13th, sorry, 13th. This is the last one. So yeah, that's a week later. He now only has 11 days to build a position in shoey that six percent of the company, right? Yeah. So how",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 108,
      "start_timestamp": "01:16:19",
      "start_timestamp_seconds": 4579.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4579"
    }
  },
  {
    "text": "now all those options into shares. And then there was one or no, 13th, 13th, sorry, 13th. This is the last one. So yeah, that's a week later. He now only has 11 days to build a position in shoey that six percent of the company, right? Yeah. So how can he possibly do that? The one thing I think about the one thing I think about is using options as compared to buying shares. Right. Some of it could be options for sure. Because if he, even if he used in the money options, in shoey, I mean, but like I also imagine we would see the position. We can, we could see the position. So let's go back to this. Let's go to Chewy. And then what was the date range we were talking about? So it needs to be, if this is only a count he's playing with here between June 13th. Okay. And I think June 24th. Okay. I'm adding one day on both sides just in case. Okay. I think let me look at just 13G. Because it doesn't show the, does it show the basis in there or no? Yeah. It should. Because there it is. I mean, what's the, how it says he's not a cat? June is dude. Like every time I look at this guy's stuff, there's something in there that like straight up, no no cost basis. Sorry. I didn't think so. I think it just said like 9,000,000 year",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 108,
      "start_timestamp": "01:17:35",
      "start_timestamp_seconds": 4655.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4655"
    }
  },
  {
    "text": "it is. I mean, what's the, how it says he's not a cat? June is dude. Like every time I look at this guy's stuff, there's something in there that like straight up, no no cost basis. Sorry. I didn't think so. I think it just said like 9,000,000 year equivalent, right? Which is he keeps meaming on Ryan Cohen as he's doing all this too, which is just so funny to me. Right. And the date, the date of this, so it was filed on the first, but the date of his June 24th. So there's 10,000 contracts there. This is, that's a million shares. There's 10,000 contracts here at the 30. That's another million. Well, something won't, no, I don't know. If he did a yellow update on the 13th, the 13th. These were the, these are, and these are afterwards, these are 25th. So I have to use the actual window. Because those wouldn't apply that window. The price moved a lot. So there's, there's a 10,000 at the 27th, which was a 220,000 dollar trade, but this represents a million shares. So far cry for 9 million. But that's, there's, there's a possibility, right? Because here's another 10,000. So that's another million. So between these top two, just pretending that these were all him. Those are on the 21st. This, the first one's on the 21st, then this other 10,000 is on the 24th. So let me sort this by size, actually. Yeah. So I see",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 108,
      "start_timestamp": "01:19:16",
      "start_timestamp_seconds": 4756.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4756"
    }
  },
  {
    "text": "another 10,000. So that's another million. So between these top two, just pretending that these were all him. Those are on the 21st. This, the first one's on the 21st, then this other 10,000 is on the 24th. So let me sort this by size, actually. Yeah. So I see 10,000, another 10,000. Call this 5,000. So it doesn't look like he would have done it discreetly with options. But, again, pretending that at least some portion of this could, could be this, then it looks like he would have been able to essentially gain exposure to 1,000,000,000,000,000,000 shares for less than a million bucks total. Somehow he's got to get 6 million more shares, right? And they're expensive. Still, I mean, they're like 20 bucks each at the lowest. It wouldn't, I mean, it wouldn't necessarily surprise me if my hypothesis there is that he could have unwound some of his game stop position. And then my expectation there would be that he would be doing that to enter back in. Like, I don't think he's trying to leave it, but it looked like he was trying to move something in Shui. That was my guess. Maybe we can't know what he does with his positions in the interim. I've told you before, from our perspective, he's never decreased his number of shares. Yeah, and it's funny when I made the video looking at the Chui position, I actually cited you teaching me about that because I do think",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 108,
      "start_timestamp": "01:20:43",
      "start_timestamp_seconds": 4843.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4843"
    }
  },
  {
    "text": "know what he does with his positions in the interim. I've told you before, from our perspective, he's never decreased his number of shares. Yeah, and it's funny when I made the video looking at the Chui position, I actually cited you teaching me about that because I do think I think that that's important, right? In terms of his tendencies, but yeah, because yeah, cash, cash had to come from somewhere. And nine million shares of Chui, what was it trading at 2653? You said? Um, I hope right here. The low was 2180. Which he definitely wouldn't have gotten in at. What was the, what's the midpoint like between the low and the high, just to in here was like 25, 25. Yes. 225 million position. Right. The other thing too is that like his last meme is, you know, he or one of his last ones, besides the Chui one, right? You know, you got the hat on still, which is perfect. But you know, he's, I listen, I'm baking for both of us. My fucking brain is cooking, but it needs to happen. He's, he's posting this meme as he puts in the bi order. I think that's abundantly clear. Because then he immediately that afternoon, Yolo updates with his nine million shares, right? So he's very intentionally here telegraphing that like he's calling a Samworm. Um, so would he then immediately dump shares after buying them? Like that would undo his effort to do this.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 108,
      "start_timestamp": "01:22:11",
      "start_timestamp_seconds": 4931.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=4931"
    }
  },
  {
    "text": "think that's abundantly clear. Because then he immediately that afternoon, Yolo updates with his nine million shares, right? So he's very intentionally here telegraphing that like he's calling a Samworm. Um, so would he then immediately dump shares after buying them? Like that would undo his effort to do this. And he's meaning on Ryan Cohen, kind of undoes his meaning on Ryan Cohen too. I think potentially, but he had a very light cast, again, this is, I can't believe it. I think he had six million in cash, right? It's all light cash position, but not light, right? Six million fucking dollars, but he had a, he had relative to him, small cash. So six million dollars in cash, a 225 million dollar trade in Chui goes on. If it's all shares, you can knock off, again, giving the benefit of the doubt, assuming that all of this was him, which again, that that's probably not super likely for all of this volume to be him. But again, some combination of it could be. So that gives us three million shares here. So then he essentially would still have about six six million one thousand ish shares. You're looking at all strikes, all X-rays look there or you're only looking at certain strikes next race. You're just looking at any large traits. Yeah, so what I'm doing, I'm sorting it by size and I'm essentially just assigning this top block of order flow all to him. I see,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 108,
      "start_timestamp": "01:23:32",
      "start_timestamp_seconds": 5012.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5012"
    }
  },
  {
    "text": "looking at all strikes, all X-rays look there or you're only looking at certain strikes next race. You're just looking at any large traits. Yeah, so what I'm doing, I'm sorting it by size and I'm essentially just assigning this top block of order flow all to him. I see, yeah, you've got a mix of expertise there in strikes. Yeah, it's kind of everything exactly. So I'm just ballparking it. But so if that gives him a residual position of six million one thousand shares at 25 that gives us a hundred and fifty million dollar position. He had six million in cash. So again, you can knock that down to one forty four. But that's got to come from somewhere. And I know some people were talking about maybe he was trading options around it. In order to come up with that hundred million, we would have absolutely seen that volume come through and we didn't. So yeah, just curious. I think we got to wait and see. We can speculate. Yeah, till the end of time, right? It is still fascinating. The timing. Yeah, I think that's a lot of the fun part is you know the dude thinks in layers, right? So to your point and based on the breadth of evidence that we've seen, what was it in this? You showed me the. It's over to the right. Scroll to the right. I think you're showing my screen right now on the screen. If you",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 108,
      "start_timestamp": "01:24:54",
      "start_timestamp_seconds": 5094.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5094"
    }
  },
  {
    "text": "dude thinks in layers, right? So to your point and based on the breadth of evidence that we've seen, what was it in this? You showed me the. It's over to the right. Scroll to the right. I think you're showing my screen right now on the screen. If you want to show your screen now. This is it, right? Like his his share positions. It's the column L. Can you guys see this or is it not showing you this? You're showing my screen at the moment. I will actually. Yeah, this is in my window. Oh, okay. I bet. Yeah. Yep. So and this is what you taught me is that if we go back all the way through his share accumulation, it's always been more. So that part's also hard to read between because we know in this time frame, he had to do other stuff in order to build the money that he ended up sharing with us that position on what is it? The second of June or the third of June? It's first post was on the second. Yeah. And it wouldn't have come from just buying and holding all of this that entire time frame. Yeah, I'm thinking I'm just going to go with like the easiest explanation, which is this dude's super duper smart and has made other monies and other accounts doing other things over time and came in to this lock to mode it like ready to go. You know",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 108,
      "start_timestamp": "01:25:59",
      "start_timestamp_seconds": 5159.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5159"
    }
  },
  {
    "text": "time frame. Yeah, I'm thinking I'm just going to go with like the easiest explanation, which is this dude's super duper smart and has made other monies and other accounts doing other things over time and came in to this lock to mode it like ready to go. You know what I'm saying? And I think that's reasonable. Like I think I think based on because the other thing people point out pretty frequently is looking at his older streams, which I went back to take a look at. And I mean, he had a shit ton of positions on an autonomous stuff. So obviously he says at one point, I was watching the January 13th stream, he said he was monitoring over a thousand stocks to some degree, which is that this is mad man level right from the jump to even try to trade a thousand things, right? Like that's nuts. I struggle I struggle keeping an eyeball on like 150 names. Yeah, yeah, he's operating on a level that is completely unbelievable. I was going to point out I did want to point out really quick here at the timing on his because there's always all this timing going on between his yellow updates and his tweets. So his most recent tweets were when he's buying the shares. Then this one seems to be the macro, I think this is macro room or I don't know who this is, this a tennis player. This one's on the",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 108,
      "start_timestamp": "01:27:19",
      "start_timestamp_seconds": 5239.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5239"
    }
  },
  {
    "text": "timing going on between his yellow updates and his tweets. So his most recent tweets were when he's buying the shares. Then this one seems to be the macro, I think this is macro room or I don't know who this is, this a tennis player. This one's on the 17th, which is when GameStop's volume drops off a cliff, right? And then this one is like this one about this movie Bruno, right? Where he's talking about going away, he's a he's a prophet sort of and like people don't like his prophecies. And Bruno, I believe in the movie, people say it goes away for 10 years. So he goes away for exactly 10 days, calls the chewy spike to the day. This is when Chewie hit 40. And he had built his position in Chewie, you know, leading up right into that spike, especially on the 24th. And then he filed a 13G a couple days later. And then we didn't know what this meant at the time. But then this is like his 13G gets and then we look back and we're like, oh, that's we've been chewy. So it's like quick quick question. Yeah. Do you think that there is any forewarning with the Chewie position between those two components between here and here? Yeah. Well, there's the 35 emojis in the Missy Elliott meme. And the the dog is in one of those, right? So I don't have those 35 emojis off like on",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 108,
      "start_timestamp": "01:28:29",
      "start_timestamp_seconds": 5309.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5309"
    }
  },
  {
    "text": "you think that there is any forewarning with the Chewie position between those two components between here and here? Yeah. Well, there's the 35 emojis in the Missy Elliott meme. And the the dog is in one of those, right? So I don't have those 35 emojis off like on hand. I should give me a tap on the screen. If you give me a second, I had them. Yeah, give me one second. Yeah, I should probably just put them down here. And can we also just shout out the fact that we're talking about emojis from a Missy Elliott video? Right. Where are you in R.A.? And the in the whole of the fact that I've got all these memes here. I mean, sooner or later, you and him are going to have to go out for a beer like a seltzer water or something. And something. I feel yeah, I feel like I feel like that's probably fair at this juncture. I don't even this guy is operating on levels. Well, here's the other thing to think about. You're you're probably aware of this. So he's he's clearly so he's got his three personalities, right? He's got his crazy yellow posting account, DFE. He's got his roaring kitty Twitter, right? Where he posts tweets. And then he's got his live stream personality and his Keith Kill personality. But what's crazy to me is this idea that you can go all the way back to his means who",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 108,
      "start_timestamp": "01:29:25",
      "start_timestamp_seconds": 5365.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5365"
    }
  },
  {
    "text": "his crazy yellow posting account, DFE. He's got his roaring kitty Twitter, right? Where he posts tweets. And then he's got his live stream personality and his Keith Kill personality. But what's crazy to me is this idea that you can go all the way back to his means who is making back four or five years ago, or how many years ago was it now three or four years ago? Lost you there. There you are. And he was telling the story even back then because if you look back at his memes like for example, let me pull one up for you just to give you an example here. I don't know if you've gone back and watched these. This is like this is where things get so crazy to me. Check this out. Go grab a water real quick, but you can keep going. Let me find this one back here. There we go. All right. So for the folks watching along, Eric's grabbing the selsa water because he's addicted to those things. But roaring kitty's memes from even back in the day have the same characters. I think we've even got let me find. So here's green. Green represents DFE. So John Candy is DFE. Yellow are all the long holders on GameStop. And then we've got let me try to find this spot where we get there we go. Here's Ryan Cohen right here in blue. So he's been telling this story the whole time",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 108,
      "start_timestamp": "01:30:39",
      "start_timestamp_seconds": 5439.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5439"
    }
  },
  {
    "text": "green. Green represents DFE. So John Candy is DFE. Yellow are all the long holders on GameStop. And then we've got let me try to find this spot where we get there we go. Here's Ryan Cohen right here in blue. So he's been telling this story the whole time with his characters. And he's still just picked it up right where he left off three and a half years later. And I think that's absolutely crazy. It blows my mind. You guys can tell me in chat what you guys think about that whole thing. Hold this up again. So let me see where's Eric. We lost. We lost him. I'm trying to play up the chat right now. Oh, there you are. I was just I was just grabbing a reload on selsa waters, man. You I told you. It's like the I go through so much liquid, especially because like I typically intermittent fast. But the choice liquid is selsa waters, bro. Oh, are we watching this? Do you have it sharing volume? I was just showing it the volume. I'm not going to show I'm just showing that the characters are already defined. He posted this. No, it's going to say you should play it. Let's see. Can you hear it? Negative. Okay. When you when you go into share screen, there's a specific tab like if you're sharing your window. So if you unshare your screen and then share it again, there will be a",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 108,
      "start_timestamp": "01:32:11",
      "start_timestamp_seconds": 5531.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5531"
    }
  },
  {
    "text": "No, it's going to say you should play it. Let's see. Can you hear it? Negative. Okay. When you when you go into share screen, there's a specific tab like if you're sharing your window. So if you unshare your screen and then share it again, there will be a thing that'll say share audio. I just wanted to show that this was posted all the way back March 30th, three years ago, right? This was his last like big meme that he posted before doing his final yellow update, double down in this position. But his characters are already all defined. Yellow are Wall Street Bets long haulers. That's us saying what's going on here? He's got he shows up as John Candy basically saying, you know, I can help you out here. This is his green is DFE. And then he points to his crew. And his crew was Ryan Cohen in blue because that's always been his color coding that he uses here. It later refers to the blue character is chewy. Starting all about games down here. You got to kind of watch it to get a sense for it. But I just think it's crazy that he had already there. We got to see the same guy. So they're going to cruise along and pick him up. So you know, this is the Wall Street best people saying, you know, my GME positions down. I bought in January. Then I got a diamond hands forever.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 108,
      "start_timestamp": "01:33:34",
      "start_timestamp_seconds": 5614.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5614"
    }
  },
  {
    "text": "that he had already there. We got to see the same guy. So they're going to cruise along and pick him up. So you know, this is the Wall Street best people saying, you know, my GME positions down. I bought in January. Then I got a diamond hands forever. But now what am I going to do? He's got the crying Michael Jordan emoji right here. And then basically he says here at the end, those risks and I can't guarantee anything. But I expect GameStop will be able to drive you to your cost basis. It's on the way to what I feel could be fair value. It took three and a half years. This is crazy, right? Crazy that he dude. It's nuts. It's absolutely nuts. Quick admin note from the chat. Dunn Oak says that they want to do a poll to see if you are cooler or Darth Vader, which Dunn Oak, I'm happy to do that. Just provided that we revisit basic manners. And if you phrase that like a human being, I'm happy to run that poll for you. In the meantime, there's a poll that's going right now, which is do we think RC will extend an offer to RK to join the investment board. 36 say yes, 64 say no. What say you Richard? I would say no. Yeah, I don't think that that would be a wise decision at all. I agree. I think that the two of them don't",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 108,
      "start_timestamp": "01:34:35",
      "start_timestamp_seconds": 5675.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5675"
    }
  },
  {
    "text": "think RC will extend an offer to RK to join the investment board. 36 say yes, 64 say no. What say you Richard? I would say no. Yeah, I don't think that that would be a wise decision at all. I agree. I think that the two of them don't have any communication. They really shouldn't for legal reasons. I think that Ryan Cohen's got to be extremely careful. Everyone in GameStop has got to be extremely careful. The whole thing's under incredible scrutiny. Same thing with Warren Katie. So like he said, he's very honest and he's trying to be very transparent. I think that's what he's telegraphing every step of the way. And I wouldn't expect anything like that to happen. Yeah, I think that's fair and I think people might slightly misconstrue like the intentions of accumulating a lot of shares, which is the idea of conviction as compared to trying to move into leadership or run the board or something like that that seems slightly different. He also says on his stream. I've mentioned this one a lot because I just rewatch it. His January 13th, 2021 stream. I recommend everyone just watch it. But he says on there, he doesn't know how to run a company. Like he says, these aren't my areas of specialty. So like you just said, picking up a huge stake in a company doesn't mean you want to run it necessarily. We're going to involve them its runnings. Right. Yeah,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 108,
      "start_timestamp": "01:35:49",
      "start_timestamp_seconds": 5749.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5749"
    }
  },
  {
    "text": "says on there, he doesn't know how to run a company. Like he says, these aren't my areas of specialty. So like you just said, picking up a huge stake in a company doesn't mean you want to run it necessarily. We're going to involve them its runnings. Right. Yeah, I agree with you. It looks like Dun Oak remembered his basic manners. And we are ready to launch a new poll to see is Richard Newton cooler than Darth Vader. I'm curious. Darth Vader is Darth Vader cool. I was literally going to ask. I thought maybe there was some background to why the Darth Vader selection. But I'm a man of the people provided that the people are respectful. So I'm going to ask the question. Anyways, the poll is open. Let us know if Newton is cooler than Darth Vader. That's tough, man. Like, Newton, I got to be honest, man. Like I genuinely think you're an incredible person. But Darth Vader, like the force, he nuked Luke Skywalker's arm. Like that's have you cut a dude's arm off with a lightsaber? I guess we could start there. Have not. No, I'm not done that. And then I guess the only other following question is have you survived being thrown into magma and then gone on to walk around in a crazy suit? No, but the last three and a half years of GameStop. Very similar. Okay. So maybe there it is. And then also here's the",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 108,
      "start_timestamp": "01:37:11",
      "start_timestamp_seconds": 5831.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5831"
    }
  },
  {
    "text": "I guess the only other following question is have you survived being thrown into magma and then gone on to walk around in a crazy suit? No, but the last three and a half years of GameStop. Very similar. Okay. So maybe there it is. And then also here's the other question we have to ask ourselves. What kind of collector Pokemon cards does Darth Vader have? And did you show us yet the ones you're showing me? Because we're going to take a look at those really quick. So we did pull a glaci on so far. Check that one out, everybody. So that's a. I have different Pokemon's. So we got the glaci on one, which is over here, which is pretty exciting. So I thought that was pretty cool because we had talked last time and we talked about how EVs are favorite and your wife's favorite. And then we basically immediately pulled out of I don't know if it's a pack from the ones you got us because we've got kind of like a big old box of packs. I was going to ask what was well anyways, I'll ask you afterwards. I'm curious what was in those compared to the I don't know shit about Pokemon beyond when I played it on Gameboy advanced. So you're so far we got a glaci on. So that's exciting. We'll see what else we get. And is glaci on is that like a standalone critter or is no",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 108,
      "start_timestamp": "01:38:22",
      "start_timestamp_seconds": 5902.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5902"
    }
  },
  {
    "text": "in those compared to the I don't know shit about Pokemon beyond when I played it on Gameboy advanced. So you're so far we got a glaci on. So that's exciting. We'll see what else we get. And is glaci on is that like a standalone critter or is no so a glaci on evolves from an EV. So first you got to play an EV and then you can evolve it into a glaci on guys quick no vamp laws you are my hero. The platform is finally back up. Oh, there you go. This is tremendous news. A giant win really for me not so much for you guys because for me it just means I get to talk about options which we all know your boy can do. But let's do that. Do you want to pull those up and show people I do have to go in like 15 minutes if that's cool. Totally cool. So let me grab this. I'm just curious what you can show us with with GameStop options on your platform because I just learned so much earlier I found that to be so valuable. Dude this yeah I think we'll be able to dive a little deeper hopefully. I'm just checking real quick to make sure that the information is accurate. Yep it all looks good. Cool. All right. Oh there it is. Doesn't it just nice like being home like if you get back from a trip and do you",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 108,
      "start_timestamp": "01:39:23",
      "start_timestamp_seconds": 5963.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=5963"
    }
  },
  {
    "text": "able to dive a little deeper hopefully. I'm just checking real quick to make sure that the information is accurate. Yep it all looks good. Cool. All right. Oh there it is. Doesn't it just nice like being home like if you get back from a trip and do you get back to your house and you're like man it's just good to be back. So let's let's dive in. Now of no if anybody has any questions on the options chain as we go through this let me know there are some pieces missing like this isn't here for some reason typically this would be here. This is all blank. So we're working with partial information it looks like it seems like there's still updating it but we have enough to work with I think. Oh okay sort of. So one of the things I was going to show you guys was the expiration volatility which is actually kind of important so for that I'm going to grab a recent video that I did give me one sec just to kill the sound. It's going to be kind of like me inception but in here this was after the market closes and we look at the options chain right there. So you can still kind of see what this should be even though it's not populating. So what I noticed first is the primary explorations continue to maintain much higher volatility. So that doesn't inherently surprise me but I",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 108,
      "start_timestamp": "01:40:33",
      "start_timestamp_seconds": 6033.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6033"
    }
  },
  {
    "text": "market closes and we look at the options chain right there. So you can still kind of see what this should be even though it's not populating. So what I noticed first is the primary explorations continue to maintain much higher volatility. So that doesn't inherently surprise me but I do find it somewhat interesting where the volatility is centered. So in this case the 19 July expiration is 139.5 vault. The following expiration goes down to 127 then down again to 120. So right now the market is pricing in more activity here in this expiration cycle essentially compared to anything else in the options chains so far. So this is not highly novel based on what I've seen so far as I've been following game stop essentially from the end of April into May but nonetheless I think is noteworthy at least in terms of trying to track where things are happening. So that's the first note and a quick note on what this means in case anybody doesn't know the implied volatility here implied volatility like we talked about this is what the market is pricing fall at and we're just kind of pulling it out and it's just a projection of expected volatility which is just movement. How much do we think something's going to move? If it has a higher percentage it means that we're expecting it to move more than other things you will notice however that some of these with lower percentages like",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 108,
      "start_timestamp": "01:41:56",
      "start_timestamp_seconds": 6116.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6116"
    }
  },
  {
    "text": "it's just a projection of expected volatility which is just movement. How much do we think something's going to move? If it has a higher percentage it means that we're expecting it to move more than other things you will notice however that some of these with lower percentages like this one out here shows 121 vol but a bigger dollar move. 8 it's because it's relative to the amount of time that's all. So you're showing the screen right now Eric I can't I don't know if I'm seeing what you're pointing at right now. It looks like I'm not which is really fortunate that you told me that because there we go this one there is a sell order. Yep so this is just me inception. So what I'm in it's kind of blurry I don't know how easy it is for you guys to see but what I'm showing you is that the expiration volatility for 19 July is high on a relative basis to everything else around it. So that just means the market is expecting movement is the punchline and then the other thing I was explaining to people because I've seen a series of questions about well why is the expected move? That's what's within that's what's within the parentheses is the dollar move and then out here is the implied volatility. So the question I've seen is why is it that this has a lower IV but a higher expected dollar move and",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 108,
      "start_timestamp": "01:43:31",
      "start_timestamp_seconds": 6211.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6211"
    }
  },
  {
    "text": "questions about well why is the expected move? That's what's within that's what's within the parentheses is the dollar move and then out here is the implied volatility. So the question I've seen is why is it that this has a lower IV but a higher expected dollar move and the reason for that is because this IV is relative to the amount of time remaining. So even though this has a higher implied volatility it's relative to a seven day period as compared to 30 whatever day period. So just to clear that up for some folks. So the first thing I do notice is interesting volatility. It's not sky high and again this is not what we saw back in May. Back in May this was like in the 200s 300s it was astronomically high. So I think it's worth pointing out differentiation there. Now going back to the platform. Could I have anything to do with the idea of leading into earnings because earnings was due for early June? It's a good question. The expiration cycle that would contain that earnings release would have relatively higher implied volatility but it would be the cycle that may that offers exposure to the earnings release. Yeah. So right now what I see for open interest is there definitely is still pretty heavy call skew in terms of OI more calls than puts. We've seen this pretty persistently now. This is a lower gap than we've seen. So I think",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 108,
      "start_timestamp": "01:44:48",
      "start_timestamp_seconds": 6288.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6288"
    }
  },
  {
    "text": "offers exposure to the earnings release. Yeah. So right now what I see for open interest is there definitely is still pretty heavy call skew in terms of OI more calls than puts. We've seen this pretty persistently now. This is a lower gap than we've seen. So I think that is interesting to me. Now in terms of concentration of where these options are we can see that 19 July is absolutely the bell of the ball. This is the busy one. And you can see the next cycle that is most active is this 16 August. And again this will line up very beautifully with the primary option. Explorations this is literally it's for liquidity. If you're going through and you're trying to trade options the standard explorations especially in something like GameStop are going to be more liquid. So people that are looking to put on bigger positions will go out into these expiration cycles. The other thing I'll show you quick is volume from a call perspective is much higher than call side than put side. So we are seeing still a lot of transactions and building however there are a pretty noteworthy amount of puts going on as well for 19 July. So all of this boils down to we are going through and building out very clearly this expiration cycle that's essentially what a boil is down to. So question. Yeah man of course. So a boil is trade. A boil is trade would",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 108,
      "start_timestamp": "01:46:10",
      "start_timestamp_seconds": 6370.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6370"
    }
  },
  {
    "text": "going on as well for 19 July. So all of this boils down to we are going through and building out very clearly this expiration cycle that's essentially what a boil is down to. So question. Yeah man of course. So a boil is trade. A boil is trade would be selling cash to cure puts right. So that would show up in the OI for puts right. It would now we can detect how the market is leaning as they're establishing their put positions and I can show you how very quickly we go back to this one. And let's go back to GameStop and then we'll look at like the last week. There. So what I can do is I can look at the put side and I can look for put transactions that occur at a specific spot. We can determine if the option was opened via buying the option or selling the option if it transacts at the bid or the offer. So in this case if I want to see if people are putting on a bullish variation of a put meaning selling puts I can see the transactions that occur at or below the bid. So this is how I can isolate if we're selling or buying puts now I want to be very clear. This is still a kind of swag. This is still an assessment. It doesn't mean definitively. It just means the overwhelming probability is that being the case. So that's",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 108,
      "start_timestamp": "01:47:34",
      "start_timestamp_seconds": 6454.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6454"
    }
  },
  {
    "text": "bid. So this is how I can isolate if we're selling or buying puts now I want to be very clear. This is still a kind of swag. This is still an assessment. It doesn't mean definitively. It just means the overwhelming probability is that being the case. So that's why we classify them as this. I just I think it's important to decipher for people the things that we can conclusively say for sure versus the things that we're taking as good of an educated guess. But this one is as close as you can get to something that's probably affirmative without it being you know 100 affirmative. So most of the put activity that we see that occurs at the bid or below for the last week. Relatively small positions. The biggest ones we see are at the 125's and their 100,000 positions combined. This looks like the same trade to me because it occurred so close to one another. And what this looks like is they submitted this initial order and then they moved it. But this is all the way out in 2026. So hard to tell what this person is attempting to do. If we limit this to the 19 July op-ex something a little more current. We see some transactions coming through here. But none of them are even over 100,000 like the bulk of this is probably less than 500,000. Easy. So not a ton of put selling going on. Now the other",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 108,
      "start_timestamp": "01:48:59",
      "start_timestamp_seconds": 6539.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6539"
    }
  },
  {
    "text": "limit this to the 19 July op-ex something a little more current. We see some transactions coming through here. But none of them are even over 100,000 like the bulk of this is probably less than 500,000. Easy. So not a ton of put selling going on. Now the other thing we can do quickly is to take a look at this theory about using calls. Maybe roaring kitty is selling calls right as part of against the shares to try to generate some sort of profit. And when I look at the overall transaction volume for the call side specifically with those kinds of orders which would be calls that are happening at the bid or below that would tell us that we're selling. There's some positions coming through but they're not massive either. So the total premium being pulled in here is not it's not crazy large. Now the other thing I wanted to do before you have to jump while we have a couple minutes is actually go back to this and we can model roaring kitty's position and we can actually see what he could have made. I think that would be fun. Okay. Yep. So yeah. So we're postulating that this would have happened. I'm sorry, remind me again the date window that we think it would be. Well Jackie said large call buying occurred twice but specifically May 1st, 2nd and 3rd. No, is this is this the there was a ton of call",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 108,
      "start_timestamp": "01:50:16",
      "start_timestamp_seconds": 6616.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6616"
    }
  },
  {
    "text": "yeah. So we're postulating that this would have happened. I'm sorry, remind me again the date window that we think it would be. Well Jackie said large call buying occurred twice but specifically May 1st, 2nd and 3rd. No, is this is this the there was a ton of call volume there. I thought we were looking at the gap to try to build the chewy position or is this the idea that this occurred back in the beginning of May. Let's do the games stop position. Okay. And but did we was one of your ideas that he used he was trading game stop to create enough capital to then roll into something else. Was that the idea from before? I don't I have zero idea how he could have built the tree position. I really don't know because I thought that's a that's a mystery to me. Okay. Because I thought one of the things we wanted to look at is the probability of him being able to turn the one he only had like five million dollars or so or he because his last yellow update yet 3.6 million. So I'm just saying let's round it to five and give him the benefit of the doubt. So if he starts got it. If he's got five million five million bucks on April 24th. Could you have turned that in three weeks into the 170 million dollars or so that he needs to buy all those thousand shares.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 108,
      "start_timestamp": "01:51:33",
      "start_timestamp_seconds": 6693.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6693"
    }
  },
  {
    "text": "five and give him the benefit of the doubt. So if he starts got it. If he's got five million five million bucks on April 24th. Could you have turned that in three weeks into the 170 million dollars or so that he needs to buy all those thousand shares. And what was the what was the date the 24th to when? So April 24th would be his start date with five million bucks and then May 15th is his end date. Yeah. So what we can do really quick is just kind of simulate this. So we can go back into on demand. I don't know how well this is going to work with the platform where it's at and it's life right now. But we will see. So I'm going back to the 24th of April of 2024. And we are going to take a peek a boo at these options. And I'm what I'm going to do is build a highly advantageous position for him to see if this how this falls within the realm of possibility essentially. So we know from 24 April to 15 May. What was the high? What day a occurred that posted the high end stock price? The high was the 14th, but he could have bought weekly's. He could have bought and made an enormous profit buying. Strung, um, X-ray for the third or X-ray for the 10th and done extremely well. Okay. Yeah. So what I'm doing is I'm just",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 108,
      "start_timestamp": "01:52:46",
      "start_timestamp_seconds": 6766.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6766"
    }
  },
  {
    "text": "the high end stock price? The high was the 14th, but he could have bought weekly's. He could have bought and made an enormous profit buying. Strung, um, X-ray for the third or X-ray for the 10th and done extremely well. Okay. Yeah. So what I'm doing is I'm just figuring out the days that we had big price movements and I'm going to build again, like the most advantageous position I could think of for him, which what was the high on 14 May? It was like, I don't remember 64, 683. That's far. Okay. So let's say that he bought maybe these 15s. So these are a 13 delta. And they're trading for 18 cents. Again, like we kind of know he didn't do this because I can't, I would have seen the volume come through for this, especially to put on a position this far out, but just to see even what's within the realm of possibility. So we have 5 million divided by 18 that tells me he could put on 277,000 contracts. Seven, seven, seven. So that's the position we're looking at. Two, seven, seven, seven, seven, seven. The reason why I'm using these options as being most advantageous to him is because even though there are really low delta, we know there's a giant move that occurs in this time frame. So this would give you an idea of what the compounding could look like if essentially we built a again near perfect position",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 108,
      "start_timestamp": "01:54:01",
      "start_timestamp_seconds": 6841.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6841"
    }
  },
  {
    "text": "as being most advantageous to him is because even though there are really low delta, we know there's a giant move that occurs in this time frame. So this would give you an idea of what the compounding could look like if essentially we built a again near perfect position relative to the period that we know. So this comes in as you could tell at like 4.99 million, right? We're using essentially the full 5 million here. So now what I'm going to do is fast forward us to 14 May. And then we can just see what these options traded at and then we can see what his PL would have looked like. Okay. So this would give him essentially a billion dollars. If he if he ticked it that way. So yeah. So if in the like most optimal scenario was able to put on a position like this in some degree, then it is entirely possible that he could have scooped up the capital to do this. Now again, we can kind of steal man the argument to a degree by changing what we're looking at really quick going back to unusual whales. We can go back into GameStop and we can look at this time frame again 14 May. You'd want to you'd want to look specifically, I think, at two windows, the 24th, 25th and 26th for big purchases of calls. The 24th of April April. Yeah, yeah, sorry. Let's look real quick. Let's",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 108,
      "start_timestamp": "01:55:23",
      "start_timestamp_seconds": 6923.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=6923"
    }
  },
  {
    "text": "back into GameStop and we can look at this time frame again 14 May. You'd want to you'd want to look specifically, I think, at two windows, the 24th, 25th and 26th for big purchases of calls. The 24th of April April. Yeah, yeah, sorry. Let's look real quick. Let's see if there were any good buys there. And then let's kill that. And then let's kill that. Okay. So we have the tens being pounded several times. Yep. That's what Jackie posted was the tens. Well, actually, this is on the next week. Yeah. See his the tens up. So this is earlier. And these would fall right into that. I see 17 May 17 May. So I see one, two, three, four, five, six, seven, 24 May seven. Maybe just call it eight. So I see eight, essentially 8,000. What about the May 17th though? Because those may 17th salt print it. Yeah, I'm using the yeah. So I included both of those up here. Okay. Yeah. So if we use both of those expectations just to clean this up a little bit. Yeah, he would have targeted those for sure. The 17th and the 24th. I don't think he would have target. He could have targeted May 3rd. Are there is there much activity on May 3rd? That would have been highly risky or April, no May 3rd. Let me see. Let me just sort of super risky. Oh, no. No. Doesn't look like I typically for",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 108,
      "start_timestamp": "01:56:59",
      "start_timestamp_seconds": 7019.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7019"
    }
  },
  {
    "text": "think he would have target. He could have targeted May 3rd. Are there is there much activity on May 3rd? That would have been highly risky or April, no May 3rd. Let me see. Let me just sort of super risky. Oh, no. No. Doesn't look like I typically for the third. Yeah. And I think him trying to build a position in that would be really, really difficult. Well, then what I think he could have done is sold them all on the third to raise a whole bunch of sold sold all of what? He could have sold a lot of those when it peaked on the third because it hit a high on the third. Okay. 1745. He would have made it kind of money. And then he could have moved you could have moved up to the 30 strike that day. Let's let's take a look then. So if I give him credit for essentially pounding all of the tens, let's just look at the tens. And then again, we can literally simulate what this position could have yielded for him. So we have one, two, three, four, five, six, seven, eight, nine, and 11, 12, all this, and this 13. So probably 14,000 contracts, ish, total. So that's only going to cost him. The, it looks like the average price here. Well, there's a couple expensive. We can do the math really quick. So 14,000. And then, two, 60, 227, 225, 220, 205, 200, 181,",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 108,
      "start_timestamp": "01:58:43",
      "start_timestamp_seconds": 7123.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7123"
    }
  },
  {
    "text": "all this, and this 13. So probably 14,000 contracts, ish, total. So that's only going to cost him. The, it looks like the average price here. Well, there's a couple expensive. We can do the math really quick. So 14,000. And then, two, 60, 227, 225, 220, 205, 200, 181, 165, 155, 146, 145, 146, 145, 147, 165, 155, 21, 20, 20, 19, 19 times. So this would be like a 20, 20, how much cash did he have? Like 3.6 million. So he would have been way over if he did all of this. So then let's just give him credit then for 3.6 million worth. And then if we look at the average price just kind of by eyeball, I see, let's call it probably close to two. So I was going to say it. Yeah, we'll call it two. So let's say 3.6 million dollars divided by two, Hyundai is 18,000. So essentially, we're not fully calculating correct based on the average price. I think we're low-balling it a little too much. So then we could just say maybe he picked up maybe 11,000 contracts, ish. And then let's call it that that came in at 3.6 million. So 3.6 million divided by 11,000, by 100. Yeah, that comes in at like 327 or something like that. That seems a little high, but we can see just have an idea. All right, up over to this. And then we're saying that we think this happened on May",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 108,
      "start_timestamp": "02:00:04",
      "start_timestamp_seconds": 7204.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7204"
    }
  },
  {
    "text": "million. So 3.6 million divided by 11,000, by 100. Yeah, that comes in at like 327 or something like that. That seems a little high, but we can see just have an idea. All right, up over to this. And then we're saying that we think this happened on May or April 24th, 25th, 26th. So we'll just pick the middle and just pretend that we built the whole position all at once. This is the quote, like I, you haven't known to do how much I love this. This is like detective work with trades. Yeah, that's cool. Yeah. So we can say we think the expiration use transacting was a 17 May, but we're going to go to 3 May and pretended that he unwound there. And we were looking at the tens. So let's say that he built his position of like 11,000. And then let's say that the average price for the whole thing, I'll kind of all round it down like through maybe like 2.75. I think that's probably a little closer to accurate. And then we'll analyze that that comes out to like a 2 million outlay that keeps them within his range reasonably. And then let's move this out to 3 May and let's see what these would be worth. Let's see. Oh, dude, I'm like, I'm waiting with a baited breath. I want to know what this number is. 825,000. They lock with a, that's it. That's how much it would make.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 108,
      "start_timestamp": "02:02:35",
      "start_timestamp_seconds": 7355.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7355"
    }
  },
  {
    "text": "And then let's move this out to 3 May and let's see what these would be worth. Let's see. Oh, dude, I'm like, I'm waiting with a baited breath. I want to know what this number is. 825,000. They lock with a, that's it. That's how much it would make. Yeah, seems so small. Well, the price went up to 17 that day though. Yep. And it looks like those tens traded for 375. Okay. That's not, that's not a big game. It's not massive. No. So what is he, so what if he built his, so Jackie's other thing he looks at is I'm, I'm probably badly quoting Jackie, what if he built his position right into that cycle then? What if he built his position on May 1st, 2nd, 3rd? You want to look at, yeah, let's look at purchases there. Let's take a look. May 1st, 2nd, 3rd. May 1st, 2nd, 3rd. We'd be looking at strikes from 10 to 30s. And then let's look at the call side hitting the offer. Okay. And then it looks primarily like the 17 May expiration is where I see the size coming in. Do you think that he would have spread out between multiple expirations? No idea. Probably pretty short dated though. I don't know. If he's, if he's going super yellow on a cycle happening in the short term. I would imagine then probably the 17s would be my guess. So if we look at the total size",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 108,
      "start_timestamp": "02:03:59",
      "start_timestamp_seconds": 7439.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7439"
    }
  },
  {
    "text": "have spread out between multiple expirations? No idea. Probably pretty short dated though. I don't know. If he's, if he's going super yellow on a cycle happening in the short term. I would imagine then probably the 17s would be my guess. So if we look at the total size there, just again, I ball it. I see 1637. I see 1067. I see 85. And I see 959. Find any other big 17s here. So it doesn't look like blocks here, right? During this period of time. No. But there were blocks in that earlier period of time. So he could have held those all the way up into the 14th I suppose, right? The ones we've built out before. Yeah. And we can see what those would have been worth there. Yeah, then maybe he didn't do two periods of buying. Because yeah, that other one it just, it doesn't really seem on brand. What would these be worth? My not team. Yeah. Take a peek a boo. 11,000 of them. We can even guide this down. Let's just call it too. Give them the bigger benefit of the doubt. 19 mil 19.6. See, that's not nearly enough though. He needs to build hundreds of millions of dollars. Right. That's that's why I was saying like what the responses from before. It's why I'm fairly skeptical of turning the 3 million into that. Like even if we give them like in this case, I'm giving them a perfect",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 108,
      "start_timestamp": "02:05:47",
      "start_timestamp_seconds": 7547.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7547"
    }
  },
  {
    "text": "though. He needs to build hundreds of millions of dollars. Right. That's that's why I was saying like what the responses from before. It's why I'm fairly skeptical of turning the 3 million into that. Like even if we give them like in this case, I'm giving them a perfect deal to doubt. Yeah. So I mean, even if we size this up, let's say he scooped the 18,000 corresponding size, which that's more than what even traded there. But that would get him to just 32 mil. Yeah, it just seemed like so, you know, questions as we kind of wrap up the stream here. Where did he possibly come up with 170 million to pick up 4.2 million shares? We don't know when he picked up those 4.2 million shares at all, right? It was first 4.2 million on top of the 800,000 he had. We do know when he bought his 20s. So that's we know he had to have had 60 some odd millions, 65 million dollars during the share offering to buy all those 20s. Where did he get all this money? I think there are two solutions. I can think of that are the simplest ones. The first one is he has money in another account somewhere. I think the solution beyond that is that he unwound some of his game stop position to acquire. That's the second idea. Yeah. Yeah, because I like that that that was like my biggest question as well",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 108,
      "start_timestamp": "02:07:28",
      "start_timestamp_seconds": 7648.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7648"
    }
  },
  {
    "text": "simplest ones. The first one is he has money in another account somewhere. I think the solution beyond that is that he unwound some of his game stop position to acquire. That's the second idea. Yeah. Yeah, because I like that that that was like my biggest question as well as I was trying to conceive of what like it's not it's not a small amount of money. That's not easy to generate that amount of capital. So because basically what is it Andrew Citroen capital, what's his name? Andrew left. Yeah. He keeps asking the same question. The media is asking the same question. Good question. It's a fantastic question. Because like do I think that maybe he has money in another account potentially sure that's that's possible but is it a 100 million on top of the 100 million 60 or whatever he had in his primary account? Could be but like that's I don't know that seems like a ton to me. I was thinking more that he might be siphoning out like 20 million maybe something like that that I think could be conceivable for somebody like him that would set up his family for life. But yeah, it's to me that the the simplest would be unwinding some of the game stop position. But to your point, I would find it really hard to believe that he would go through the effort of accumulating 9 million 1000 shares to then unwind it. But then it's",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 108,
      "start_timestamp": "02:08:42",
      "start_timestamp_seconds": 7722.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7722"
    }
  },
  {
    "text": "But yeah, it's to me that the the simplest would be unwinding some of the game stop position. But to your point, I would find it really hard to believe that he would go through the effort of accumulating 9 million 1000 shares to then unwind it. But then it's also again I go back off of the the same thing of like who we're dealing with. And would he potentially build that position to essentially you know send the message to Ryan Cohen high five of them and then do something else? Not impossible either. So if you think about it based on what we looked at, what is your best guess on where the capital came from? Well, there's the curiosity too that is my share is my screen sharing right now? It is. So a curiosity pointed out is right here which is between these two updates. This one on June 3rd. Look at this cash position here. 29.29.29.29.2 mil. Yeah. And then it goes up it takes up. And this is going to be interest earned on the end of end of May. It's pretty obvious. But the the e-trade accounts for a high for over having over a million dollars in your account only earns you 0.15. The disrespect. Right. It doesn't earn you 5.5 like your money market is going to yield you or something else going to yield. And thus you put it you have to specifically put it into that vehicle. It's",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 108,
      "start_timestamp": "02:10:08",
      "start_timestamp_seconds": 7808.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7808"
    }
  },
  {
    "text": "having over a million dollars in your account only earns you 0.15. The disrespect. Right. It doesn't earn you 5.5 like your money market is going to yield you or something else going to yield. And thus you put it you have to specifically put it into that vehicle. It's in this right here. My understanding is it's going to earn 0.15. So if we look at if we just do simple math here and do. There's my calculator. So if we take how much that represents as a yield, so I'm going to do 29.409. And then we take away 29.276. In the meantime, Brad says a guy who loves trading is quite good at it. For three years, wasn't trading. His large cash reserve built up for this. I I agree with Brad's idea there. Again, I think the only crux to that idea is if he was being honest during that livestream, which I would that's again, I take him at his word. He's saying that that's his account and that's his cash. So we're working under the assumption of that being the case. But to your point, the wild card is kind of what Newton and I were recently talking about the fact that this could be money from somewhere else, but we're just kind of working off of what we can cleanly see. Right. If if he's got is this going to work out correctly? I don't want to. The number here bothers me, but",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 108,
      "start_timestamp": "02:11:27",
      "start_timestamp_seconds": 7887.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7887"
    }
  },
  {
    "text": "I were recently talking about the fact that this could be money from somewhere else, but we're just kind of working off of what we can cleanly see. Right. If if he's got is this going to work out correctly? I don't want to. The number here bothers me, but if he's got this amount chilling in the account at end of May and it's been in there all month and then he gets point. This will be right, right? 0.15. That would be the difference there, right? That's all working out correctly. But that makes sense. He would have had to have a bunch of money in there. I know people are saying he would have had to have a billion. Am I doing the math here wrong? So here's a billion dollars. If he was earning a yield of point zero, zero, or this would be one percent yield, but each rate only pays 0.15 yield. He would have got a huge dividend at the end of the month. So I don't see evidence of him having a billion dollars in the account unless I'm doing something. Yep. I agree with you. So he had. I still think that you would have seen it in the cash anyways. But he would have had in May 90 million maybe to play with. Yeah. And that I that I think makes sense at the start of this, right? Like because he came into this whole may move with a big",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 108,
      "start_timestamp": "02:12:40",
      "start_timestamp_seconds": 7960.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=7960"
    }
  },
  {
    "text": "that you would have seen it in the cash anyways. But he would have had in May 90 million maybe to play with. Yeah. And that I that I think makes sense at the start of this, right? Like because he came into this whole may move with a big bankroll. We saw in his initial position. What was it? 168 million total or something like that? Well, this is perfect sense. This actually makes perfect sense because look at the start interrupt you. But we got the cash here. How much to the options cost? Like 65. So that's like the perfect amount. He just probably just rolled right into this with the money to throw down on the options. So he probably came into this with the shares already. Yeah. I think that that's fair because also we can see well, I don't know if he had the shares because the price of 21274. Well, you could have bought those and actually his cost basis were going way over that 15 minutes. I said, but the cost basis on those guys should have been if he held his previous existing shares, these guys had a cost basis of 1379. His new ones had a cost basis of 2127. Yep. He could have got these at any point along the way, right? Lots of times when the stock was at 21 going back. Just a good chart here. Oh, you're saying over the past three years. Yeah, he could",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 108,
      "start_timestamp": "02:13:48",
      "start_timestamp_seconds": 8028.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=8028"
    }
  },
  {
    "text": "1379. His new ones had a cost basis of 2127. Yep. He could have got these at any point along the way, right? Lots of times when the stock was at 21 going back. Just a good chart here. Oh, you're saying over the past three years. Yeah, he could have bought these at any of these. I see. I see. I see. I see. I see. I see. Yeah, I follow you now. Yep. I think that he could have built up 90 million in his account, accumulated a big position over time, came into this ready to yellow update after buying a ridiculous amount of calls. I don't know. Well, I think to your point though, that seems more probable than that capital being generated and like right at the beginning of. Yeah, from here to here. Yeah. Yeah. Yeah. That seems unlikely. All right. Yeah. Yeah. Cool. I think that was that was a great game stop. Sash. Fascinating. Absolutely fascinating. Have an absolute blast doing these with you, man. So well, first off, I don't even know how many people we have hanging out. Looks like there's about 455 people in here. So shout out to you guys for hanging out and chat with us about this. I think the idea for Newton and I is to keep a cadence doing these because we both enjoy taking a look. So we'll probably take a look at doing another one next week. Obviously, I'll catch up with",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 108,
      "start_timestamp": "02:14:58",
      "start_timestamp_seconds": 8098.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=8098"
    }
  },
  {
    "text": "you guys for hanging out and chat with us about this. I think the idea for Newton and I is to keep a cadence doing these because we both enjoy taking a look. So we'll probably take a look at doing another one next week. Obviously, I'll catch up with you to see if that works. But if we do, it'll be same time, same place. We'll announce it for everybody. Newton is always, man. Thank you for coming in and dropping times the entire time. Super, super fun session. That was cool. Super fun to learn options. Learn from someone that knows a ton of bottoms. So thank you very much for sharing all your your knowledge. Yeah, dude. Absolutely. I love this stuff. So everybody else, we will see you throughout the week. OMG says set an agenda next time. Please, Bullshit. As if we go with a winds blow us, man, that's how this flows. But thank you guys a ton for hanging out and then we'll see you guys next weekend. Peace out. Thanks everybody. Thanks. And I think we double check.",
    "metadata": {
      "video_id": "Sue4LFwVQvU",
      "title": "GME Livestream with @RichardNewton - GameStop Analysis",
      "url": "https://www.youtube.com/watch?v=Sue4LFwVQvU",
      "upload_date": null,
      "duration": 8251.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 108,
      "start_timestamp": "02:16:14",
      "start_timestamp_seconds": 8174.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Sue4LFwVQvU&t=8174"
    }
  }
]