[
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "What's up outliers? We're going to talk about five options selling myths that are going to crush your returns or have been crushing your returns. We have five things on the docket. Now the main point of the video is to expose you to some really important concepts and more importantly to give you frameworks on how to think about them and how to approach them. So let's jump right in. The first thing is sell options when volatility is high. This is probably one of the most commonly used and misused concepts that exists and we need to talk about it. This entire idea is baked in this idea that options and specifically option volatility is mean reverting and I want to show you a little bit about what this mean reversion concept is. If I draw a plot of volatility and let's say that this line is going to be implied volatility and let's say that it runs like this and then it goes up here and then it's high. The issue with this idea of volatility being mean reverting is depending on the trade that you're running. Let's say it's a 30 day or a common 45 day strategy. This mean reversion doesn't have to happen in that timeframe. volatility does something we refer to as clustering. That means it can go through durations where it looks a lot like what it recently looks like before it goes through some sort of reversion process. The other thing",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 100.72,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "day strategy. This mean reversion doesn't have to happen in that timeframe. volatility does something we refer to as clustering. That means it can go through durations where it looks a lot like what it recently looks like before it goes through some sort of reversion process. The other thing to keep in mind is that if you are selling premium and some people will think that you're playing this Vega, meaning if implied volatility goes down, then some of your profit will come from this Vega, which is correct. But the dominant force in your strategy is still direction. It doesn't matter if IV collapses here and your Vega P&L looks good, but then the underlying just blasted right through your short strikes. You're still loose. Even though you got the movement involved that you wanted, you didn't get the price movement, which is a really, really common focus when we're two folks from the volatility side of this equation, which is important. But you have to remember the thing that makes or breaks your short premium strategy at the end of the day is not what Valdas, even if Vald for example, spiked and your Vega P&L looked bad. Evolves spiked, but price still, let's say price is this plot. And let's say price just trended sideways after that spike. You still would make money once this abates. So it's super important to keep that into context. Now the last few things that I want to mention with",
    "start_timestamp_seconds": 72.2,
    "end_timestamp_seconds": 177.6,
    "start_timestamp": "01:12",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=72",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "bad. Evolves spiked, but price still, let's say price is this plot. And let's say price just trended sideways after that spike. You still would make money once this abates. So it's super important to keep that into context. Now the last few things that I want to mention with this idea of when Valdas High is a lot of times when Valdas High, it's actually not priced effectively. The thing that you are typically trading when you're selling premium is not Valdi-Rackley. You are trading the relationship between implied and realized volatility. Realize volatility is how much something actually moves and implied volatility is how much it's expected to move. In this case, we can see a period here. This is a great example. Look at these yellow lines. This represents implied volatility. Notice how if I just wiggle my mouse, you notice how this range that I'm in right here, it's kind of high compared to everything else on this graph. This period back here is the only period that's even remotely close. Everything else in this center zone is lower. This period here, volatility was high. But what do you notice about the purple lines? The purple lines measure variance risk premiums, where implied volatility stays elevated relative to realized. It actually flips negative. What that means is if you sold during this period, even though volatility was good, you got ran over by direction. You lost your money. That is the crux. That's the main issue",
    "start_timestamp_seconds": 156.96,
    "end_timestamp_seconds": 260.4,
    "start_timestamp": "02:36",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=156",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "lines measure variance risk premiums, where implied volatility stays elevated relative to realized. It actually flips negative. What that means is if you sold during this period, even though volatility was good, you got ran over by direction. You lost your money. That is the crux. That's the main issue when you stay too emphasized on vault. So to give you some resources so that you're not just trusting some random dude on the internet, I encourage you to go to SSRN. There's a lot of research out here about the variance risk premium, VRP, which is what you're actually trying to capture. And a lot of these studies give you fantastic information about where it is and how it performs the best to give you a cliff notes version of this. When you're trading something like variance risk premiums, you actually want to avoid the extremes. So if I draw, let's say, like a thermometer version, let's say that this is 100% as high as it can go 0%. You actually want to avoid this top level and you want to avoid this very bottom level. You want to be in here. So this is the sweet spot. It's not when vault is super high and it's definitely not when vault is super low. But some of the best possible times to sell is actually when implied volatility is low because very frequently during those durations realize volatility is even lower. That's how you make money selling. It's not",
    "start_timestamp_seconds": 236.88,
    "end_timestamp_seconds": 332.12,
    "start_timestamp": "03:56",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=236",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "not when vault is super high and it's definitely not when vault is super low. But some of the best possible times to sell is actually when implied volatility is low because very frequently during those durations realize volatility is even lower. That's how you make money selling. It's not by seeing something with a high IVR and just selling something because you think vault is elevated and it should contract. There's a good chance it might not. Okay. Next item on the docket. Selling options is not your edge. This is a really common misconception. Same thing where people say like, oh, theta is an edge. It's not selling options can certainly be an edge. But there's a lot of bad statistics around this. You'll hear people say like 90% of options expire worthless. It's literally completely wrong. You can go to the OCC options clear and corporation. In there, you'll find that the overwhelming majority of options are traded before expiration. And of that small subset that goes to expiration, the remainder of that we have options expire worthless more frequently than options expiring in the money that probably logically flows. So selling options is fine. But it's not this magic thing where if you just do this, you're going to make money. It's not how it works because again, if I just sold options in this timeframe because vault facility was high, I lost. This also goes into a nuanced slash correlated concept of premium chasing. It's",
    "start_timestamp_seconds": 313.4,
    "end_timestamp_seconds": 417.06,
    "start_timestamp": "05:13",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=313",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "not this magic thing where if you just do this, you're going to make money. It's not how it works because again, if I just sold options in this timeframe because vault facility was high, I lost. This also goes into a nuanced slash correlated concept of premium chasing. It's when we want to sell and get these really, really high return on our premium, which logically makes sense. But you just have to remember a lot of times it's going to put you into supervoltaile names and going back to what we said before. A lot of times they can move outside your range, which will then cause you to lose. The next thing is using spreads to reduce your risk. There's nothing wrong inherently with using spreads adding tales if you have to. The thing to note though is that if you add tales, you are massively decreasing whatever edge you may have. The other thing to note is that if you're doing this for any sort of income-based activity, you'll find that this itself will unwind a lot of your potential gains when you do lose. Let's take a look at this section here. This sample expectancy, Elzumusin, to make it a little easier to see. There's a lot of noise on here. We'll focus on this. Here I'm showing you this was actually priced on spy. I'll show you the exact trade that I was looking at so that again, you can follow along at home.",
    "start_timestamp_seconds": 395.52,
    "end_timestamp_seconds": 480.22,
    "start_timestamp": "06:35",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=395",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "Elzumusin, to make it a little easier to see. There's a lot of noise on here. We'll focus on this. Here I'm showing you this was actually priced on spy. I'll show you the exact trade that I was looking at so that again, you can follow along at home. If I go into spy and I go into the option chain, let's say I go to the 19Ds and let's say go to like this 30Ds of the 665s on the put side. I want to run a vertical. Let's say that I don't have the capital to just run a short put. Run a vertical. This vertical is going to give me about $1. I get that $100. It's $5.5. That means that I have $400 of risk. I collected a dollar. I'm risking the rest of that spread. What's the probability of this thing making money? I'm giving it the benefit of the doubt and I'm saying the probability is 70%. I'm using that 30Ds. It's not quite. The probability of the entire spread falling in is a little different as well. It's slightly lower. I want to focus on the core concepts here, which the core concepts are if you have something with an average one of $100 and you have something with an average loss of your spread being consumed, you're now entirely negatively expecting. It means it net loses money. What means that this by itself doesn't have edge. It means that you have",
    "start_timestamp_seconds": 464.78,
    "end_timestamp_seconds": 545.3,
    "start_timestamp": "07:44",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=464",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "concepts are if you have something with an average one of $100 and you have something with an average loss of your spread being consumed, you're now entirely negatively expecting. It means it net loses money. What means that this by itself doesn't have edge. It means that you have to have something else going in your favor, meaning you're good at picking direction. This can make money. The main thing I want to write, like mention here, is that if you just blindly sell and then you add wings to help yourself, you're setting yourself up in a pretty poor instance. You have to have something else working in your favor. I have an issue that goes over this issue, more in detail, I'll link to that in the notes below. This is why I mentioned this one, it's just because it's in a fairies. A lot of people think that, oh, if I add a spread, I'm reducing my risk. It sounds logical, it does technically reduce your risk on any one individual instance. But in terms of your profitability and long-term profitability, it can be really difficult to be super profitable trading spreads unless you have something else going in your favor. But what that means is, let's say in this scenario that you actually are good at picking direction. Let's say in spy that you find that you're able to get a really, really good win rate, because you have some sort of secret strategy that",
    "start_timestamp_seconds": 524.46,
    "end_timestamp_seconds": 609.9,
    "start_timestamp": "08:44",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=524",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "else going in your favor. But what that means is, let's say in this scenario that you actually are good at picking direction. Let's say in spy that you find that you're able to get a really, really good win rate, because you have some sort of secret strategy that works well. A lot of those instances, you're going to be better off by not capping your returns. What I mean by this is if we plot on a risk graph, how our short put spread would work, it means that if we're directionally correct, the most we can win is a hundred bucks. If you're good at picking direction, there can be other strategies that might work well. Some of them include buying options instead of just selling. Now, again, this isn't just to say selling is bad. It's not. I saw all the time, a lot of times it's over half of my volume. But the issue is when traders just become entrenched into thinking that like selling is the only thing. Again, for this specific example, this trader could be better off if they're good at picking direction, trading something that doesn't cap their profit potential, because they might be cutting really big winners off that they otherwise would have gotten. Next, rolling doesn't avoid losses. Period, full stop point blank. It doesn't avoid losses. This confuses the crap out of people I have a ton of videos that go through this in detail. The easiest way",
    "start_timestamp_seconds": 588.9,
    "end_timestamp_seconds": 681.3,
    "start_timestamp": "09:48",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=588",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "they might be cutting really big winners off that they otherwise would have gotten. Next, rolling doesn't avoid losses. Period, full stop point blank. It doesn't avoid losses. This confuses the crap out of people I have a ton of videos that go through this in detail. The easiest way to think about rolling is that it literally is just multiple trades that the accounting is tied together. I'll give you an example. Let's say that I sell to open something, so sell to open, and let's say I got it for a dollar. And then let's say I buy to close for two dollars. What I just did, this trade for a one-lot took in a hundred dollars. This trade here sent out two hundred dollars. What is the net profit here? The net profit here is negative one hundred dollars. You just realized a loss. This is a realized loss on your books. Now what confuses people is when you do it as a rolling transaction, and this is tied to another trade, let's say that you got it for three dollars. And then you walk out out of this transaction up, right? Because in this case you got a hundred dollars, you lost two, but then you got three. So in this case you walk out up a little bit of money. What's the problem? The problem is that little bit of money is tied to an open position. So if we look at the rest of",
    "start_timestamp_seconds": 663.54,
    "end_timestamp_seconds": 760.02,
    "start_timestamp": "11:03",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=663",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "got a hundred dollars, you lost two, but then you got three. So in this case you walk out up a little bit of money. What's the problem? The problem is that little bit of money is tied to an open position. So if we look at the rest of this example, this trade just gave us plus three hundred dollars. So what's our net? We're plus two hundred dollars. What's the issue? This two hundred dollars is in an open trade. This open trade could also be a loss. The issue with all of this is the accounting side of the equation and how it confuses people. Because you can at the end of a long rolling campaign, walk out net positive. I've done it myself. It's entirely doable. But the issue typically at the end of one of those campaigns is that very frequently, you would have been better off just taking the trade down, putting your money and something else. If you look up what the actual return on that time is, sometimes people get way too wrapped in into just not booking a loss. Whereas the fun fact here is you're booking a loss the entire way just at the end that might net positive. So I have a video that goes through all that way more in detail. Again, this isn't to demonize rolling. I do it literally all the time, but it has to be taken in context and at face value for what",
    "start_timestamp_seconds": 741.98,
    "end_timestamp_seconds": 827.14,
    "start_timestamp": "12:21",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=741",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "way just at the end that might net positive. So I have a video that goes through all that way more in detail. Again, this isn't to demonize rolling. I do it literally all the time, but it has to be taken in context and at face value for what it is. It's closing a losing trade. If you're rolling a loser, you can roll winners as well. If you're closing a losing trade and rolling a losing trade, you've realized the loss. You're now opening a new trade that can overwhelm that loss or can become a bigger loss. Just have to go into it. Don't try to get yourself. Last thing here, high win rate does not equal a great strategy and we actually already looked at this example. The main reason why I'm calling this out specifically is because a lot of traders will tout high win rates as if it's some sort of demonstration of skill or something that's good. It's not. It's actually a really easy way to spot an experienced trader. So fun fact, if you see some sort of goveru, a YouTuber or somebody else that's like, hey, I have a 90% win rate. You immediately know something's wrong with that person, meaning they're probably full of shit or they just don't know what they're doing. And it's because of this exact reason back here. I just showed you a strategy that it has a 70% win rate much higher than the loss",
    "start_timestamp_seconds": 811.18,
    "end_timestamp_seconds": 887.82,
    "start_timestamp": "13:31",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=811",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "rate. You immediately know something's wrong with that person, meaning they're probably full of shit or they just don't know what they're doing. And it's because of this exact reason back here. I just showed you a strategy that it has a 70% win rate much higher than the loss rate, but it's net loss over time. It loses money over time. So just because something has a high win rate does not mean it's super profitable. This is a concept called expectancy or expected return. I have a video that goes through that as well. The cliff notes version of that is you can have strategies that actually have very low win rates that net positive over time. So let's say instead we have something that has a 35% win rate. Let's do something like 50 trades, but let's say your average winner is 1500 bucks. Notice what happened down here. You're now massively net positive. So you can have something that has a terrible win rate. But if the wins are big enough relative to the losers, you're still massively profitable. Let's jack this up. Say that you lose 600 bucks. What happens? You are still net positive. So do not ever take somebody that says, oh, I have a high win rate. This is a high win rate strategy. That means nothing. It can still lose money. What you care about as positive expected return. This is another massive trap when it comes to selling strategies. Selling",
    "start_timestamp_seconds": 875.26,
    "end_timestamp_seconds": 969.46,
    "start_timestamp": "14:35",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=875",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 1001.0
  },
  {
    "video_id": "T1HBYHUvEDc",
    "title": "5 Options Selling Myths Destroying Your Returns",
    "text": "So do not ever take somebody that says, oh, I have a high win rate. This is a high win rate strategy. That means nothing. It can still lose money. What you care about as positive expected return. This is another massive trap when it comes to selling strategies. Selling strategies generally and ignorantly over emphasize win rate where they shouldn't. We should focus on our expected return. All of this is not to say that selling is bad. It's good if you're interested comment below and I can make a video to talk about how to turn option selling into something productive for your account because it can be done. But again, you have to take all this into account and just apply some basic logic. Be an outlier. See you later.",
    "start_timestamp_seconds": 953.58,
    "end_timestamp_seconds": 999.7,
    "start_timestamp": "15:53",
    "video_url": "https://www.youtube.com/watch?v=T1HBYHUvEDc",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=T1HBYHUvEDc&t=953",
    "chunk_index": 13,
    "word_count": 133,
    "upload_date": null,
    "duration": 1001.0
  }
]