[
  {
    "text": "What's up, outliers? Welcome back to another outlier trading tips video where you learned something in three minutes or less. Today we are going to talk about the Ebb and Flow of Market liquidity throughout the day. There are periods that are more advantageous to trading just about anything than other periods throughout the day. And the reality is, especially as options traders, there are times during the day that are way more liquid than other times. Even if you're not trading something that's intraday decided to or designed to make money off of what is happening today, maybe a trade that's further out in time. And I want you to look at this chart above my head. This is of spy. It's a two-day five-minute charts all compressed down, because obviously we're in the vertical format here. But if I give you a little bit more space, I want you to take a look at these spikes in volume. There's a spike here. Then it's kind of flat low low low low, then there's another spike here. And then it's flat low low low low low, and then another spike here. So you notice there's a bit of a trend here. What's that trend? Well, it's really simple. When the market first opens, there typically is a flush of liquidity after the open. And this can exist for anywhere from 15 minutes to an hour or so. And then it typically starts to slow down throughout the rest of",
    "metadata": {
      "video_id": "T8gxGnOJO0Y",
      "title": "What Time Of Day Offers BEST Market Liquidity For Options?",
      "url": "https://www.youtube.com/watch?v=T8gxGnOJO0Y",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=T8gxGnOJO0Y&t=0"
    }
  },
  {
    "text": "trend here. What's that trend? Well, it's really simple. When the market first opens, there typically is a flush of liquidity after the open. And this can exist for anywhere from 15 minutes to an hour or so. And then it typically starts to slow down throughout the rest of the morning, midday. It's kind of low for most of the day. And then you'll notice as we get into like the last half hour of trading, all of a sudden it shoots back up again. And there are a key few key reasons. Why this happens? The first is due to opening and closing auctions. This is where the exchange is essentially a loud, larger trades to go through out of price. And this is where you'll see most of the institutional volume coming through and that's for that exact reason. The other thing as you'll notice, especially for opens, is there's a lot of overnight order flow imbalances based on what happened over the evening before. So the main thing to keep in mind is that if you're a trader in general and you have access to the market, if you're trading one-long, five-lots, 10-lot, small trades, doesn't really matter that much. But as soon as you're trying to size up your positions and trades slightly larger, then that, it can make a lot of sense to try to find your entries when the market is most liquid, typically first hour of the day, last hour of the",
    "metadata": {
      "video_id": "T8gxGnOJO0Y",
      "title": "What Time Of Day Offers BEST Market Liquidity For Options?",
      "url": "https://www.youtube.com/watch?v=T8gxGnOJO0Y",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:10",
      "start_timestamp_seconds": 70.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=T8gxGnOJO0Y&t=70"
    }
  },
  {
    "text": "really matter that much. But as soon as you're trying to size up your positions and trades slightly larger, then that, it can make a lot of sense to try to find your entries when the market is most liquid, typically first hour of the day, last hour of the day, something like that. Be an outlier. See you later.",
    "metadata": {
      "video_id": "T8gxGnOJO0Y",
      "title": "What Time Of Day Offers BEST Market Liquidity For Options?",
      "url": "https://www.youtube.com/watch?v=T8gxGnOJO0Y",
      "upload_date": "",
      "duration": null,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:25",
      "start_timestamp_seconds": 145.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=T8gxGnOJO0Y&t=145"
    }
  }
]