[
  {
    "text": "you you you you you you you reference about Cheryl John C on buy a few people and yeah, I understand I get like why people are interested in this. So I'm happy to talk about it. So the goal for the session today is to just talk a little bit about my path as a trader. So I had a Google form set up and I ended up getting even more submissions to be completely honest than I would have expected. So what I did to try to make the session a little more logical is I bucketed them so that I kind of put them in different categories so that I can talk about the topics in an order I think that that makes sense versus like a shotgun blast of stuff. I think that might be kind of confusing. And even though really the session is branded and we're doing it as like the path of an options trader and an AMA asks me anything sort of thing, I'm really not thinking about this more so as like it being about me. I'm trying to frame it as the path of a trader hence the title, right? And the goal is to spend more time focusing on how my path likely will have many elements that you either have or will come across in your path. And the intention that is hopefully to accelerate your movement through your path. Because one of the big things that you'll",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 111,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=0"
    }
  },
  {
    "text": "And the goal is to spend more time focusing on how my path likely will have many elements that you either have or will come across in your path. And the intention that is hopefully to accelerate your movement through your path. Because one of the big things that you'll find actually there's a couple questions in here about it about like mentorship and learning. And like the overwhelming majority of what I've done has been largely self taught. I have had a couple mentors that I'm going to talk about. But I think most of them probably are less prescriptive than I think, then I think people might think they are. And I actually think that's a really important admin note for us. So as always, we've got to say hello to everybody that's hanging out. So I see we got Samota Joey M. Ram. That's a cool name. Elon songs. Shrej. Shrej. Fun fact. One of the guys actually, I think he's, yeah, here, funny enough, here. Let me grab this. I was going to start with this anyways, just so that people that don't know much about me, they'll have a little bit of context. My goal is to go through this super fast. I just want people to understand the the background. But anyways, this dude right here, he's at my house right now. He's the guy that introduced me to investing. So anyways, Shrej, this comment specifically for you, because he was checking out the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 111,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=297"
    }
  },
  {
    "text": "is to go through this super fast. I just want people to understand the the background. But anyways, this dude right here, he's at my house right now. He's the guy that introduced me to investing. So anyways, Shrej, this comment specifically for you, because he was checking out the elephant that you got me, which is super cool. It's out in my living room. And he was asking about it. So yeah, you peaked his interest. He, you know, I have all sorts of like random art pieces and stuff around the house, but he really like honed in on that elephant, which is sick. So again, thank you very much. I really appreciate that. We have a Pollo, Zachariah, Lauren. Hello, AI made horrible choices this week. Have to hear more about that. We got Andrew Eric, my doppelganger, and Mick D from Southwest Florida, hell yeah. And then we have Mr. Off Putin. There's Newberry. Isn't that very near West Point? Yeah, it's probably less than two hours for sure, probably closer to an hour and change. I've been through West Point a few times. We actually did like some of our physical evaluations there and stuff. So yeah, really, really close. So yeah, one of the things that I wanted to start with, not AI, I, me, darn typos. Oh no, Lauren, now I'm even more interested. What kind of horrible choices did you make? We have to dive into that. So Off Putin says beautiful",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 111,
      "start_timestamp": "00:06:20",
      "start_timestamp_seconds": 380.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=380"
    }
  },
  {
    "text": "So yeah, really, really close. So yeah, one of the things that I wanted to start with, not AI, I, me, darn typos. Oh no, Lauren, now I'm even more interested. What kind of horrible choices did you make? We have to dive into that. So Off Putin says beautiful part of the Hudson Valley gorgeous. The Hudson Valley itself is absolutely stunning. That's one of the cool things about the north east is that if you take a look through the Hudson Valley, I mean, it's this is just beautiful. It is absolutely, absolutely beautiful. There's so many cool elements. And I think one of the coolest things about the Hudson Valley is the history. There's so much history there. But it's funny because, well, damn, what the hell? That seems dramatic. I guess we, well, everybody's going to have a couple haters. But yeah, I, the overall area is stunning. So we have Roaring Titty in the house. It's great to see Roaring Titty. Everybody shout out to our fan favorite Roaring Titty. And we got Mick D from New Pals. Yeah, New Pals is pretty sick. So the summary here is my start as a trader is probably the same as most people because I very much did not come for money. I had single mom. Most of you know all this stuff. Again, I'm not going to go super far into detail unless there's questions. Obviously, feel free to ask anything. But the reason why I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 111,
      "start_timestamp": "00:07:21",
      "start_timestamp_seconds": 441.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=441"
    }
  },
  {
    "text": "probably the same as most people because I very much did not come for money. I had single mom. Most of you know all this stuff. Again, I'm not going to go super far into detail unless there's questions. Obviously, feel free to ask anything. But the reason why I always go out of my way to highlight that fact is because I think it's important to understand the starting point. And I think it's important to understand, at least in my opinion, that trading is one of the very few things that genuinely is accessible to everybody. It is. So it's not like something that you have to have in somewhere. You don't have to have a connected parent that then connects you with an opportunity. The markets are open to everybody. That's one of the coolest things about it is that it is genuinely whatever you make of it, which is very, very cool because a lot of other things that involve money, wealth, development of wealth, they actually are quite kind of tight groups where it's like people pull each other in that they want to work with and stuff. That's not the case for trading. Okay. So that's essentially the main background I wanted to share. I'm going to slide this out of the way and then we can kick off with some of the questions. Now, again, these are the questions that got sent in. If you have any questions as we go through these",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 111,
      "start_timestamp": "00:08:42",
      "start_timestamp_seconds": 522.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=522"
    }
  },
  {
    "text": "So that's essentially the main background I wanted to share. I'm going to slide this out of the way and then we can kick off with some of the questions. Now, again, these are the questions that got sent in. If you have any questions as we go through these or any clarifying questions as we go through these, throw them in the chat. I always prioritize the people that are here live. Bose says, which books can you recommend? That's a great question. Love to start with that. So from a learning perspective, if you dance over to the website and if you go to the options trading guide for beginners, you'll notice down at the bottom, I give you a reading list. And what I do is I highlight a handful of the, I really think you need to read these books. I genuinely believe I cut this list down into the smallest grouping that I possibly could. So what I'm saying is is I genuinely believe if you, if I were going to be a trader, I would absolutely read all of these. But understanding that finite time, have to prioritize what I try to do is highlight the ones that I really, really think should be read. Now, there's a lot more than this. This is absolutely not even close to kind of like the full reading list that I would recommend. But I think there comes a point where there's diminishing returns on what you",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 111,
      "start_timestamp": "00:10:01",
      "start_timestamp_seconds": 601.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=601"
    }
  },
  {
    "text": "highlight the ones that I really, really think should be read. Now, there's a lot more than this. This is absolutely not even close to kind of like the full reading list that I would recommend. But I think there comes a point where there's diminishing returns on what you read. I genuinely do believe that. I think that you can learn a decent amount. And then some of the early books that you read will be essentially revolutionary because they're going to introduce you to things that you've never heard before, never considered stuff like that. Then what you'll find is a lot of follow on books. They're helpful, but they have a much less level of impact, the scope scales down a lot. And it's just because it's kind of like filling in blanks here and there. Mick D says I've been wanting to share how the improvements to the website have been awesome. That's awesome. I love to hear that. Yeah, I've had a few people from the community help me with some ideas. And then my the biggest shout out is actually to giggles. I've had him on the YouTube channel way in the beginning. We used to do a little thing together called tech talk and just, you know, bullshit on a video together that I would post about technology. And he was absolutely pivotal to like the design of the website, specifically with stuff like this, like just using spaces and trying to have",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 111,
      "start_timestamp": "00:11:13",
      "start_timestamp_seconds": 673.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=673"
    }
  },
  {
    "text": "used to do a little thing together called tech talk and just, you know, bullshit on a video together that I would post about technology. And he was absolutely pivotal to like the design of the website, specifically with stuff like this, like just using spaces and trying to have everything consolidated onto a page and stuff like that. It's still you could tell it's still self-made, right? Like I don't know what the fuck I'm doing, but I try to make it definitely a little more navigable at least as the idea. So yeah, I'm glad that it's been useful. Wigglyworm says you're talking about books to read. I am indeed. And it says, okay, what's a great foundational book or two? Literally here. I show you. That's what I'm highlighting. So the books that are highlighted on this list are exactly that. They're like the books that I think, especially for an options trader. I think these have to fit into the equation. Options as a strategic investment would be my go-to for like actually starting to trade options. And then when we look at general markets like understanding markets, I really, really like trading in exchanges because it goes into a lot of specific details about the process of markets, how they behave, the different participants. And I actually think a lot of people don't fully appreciate that for what it is. So I think that's probably why I have that as the starting point, because I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 111,
      "start_timestamp": "00:12:19",
      "start_timestamp_seconds": 739.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=739"
    }
  },
  {
    "text": "it goes into a lot of specific details about the process of markets, how they behave, the different participants. And I actually think a lot of people don't fully appreciate that for what it is. So I think that's probably why I have that as the starting point, because I think that's actually super, super, super important context. And then I think after that, you can go into, you know, again, wanting to trade options or other stuff like that. But I think this is probably the right spot to go. LPB says, is there a karma sutra for traders? What would the equivalents us? Let's ask chat GPT. I'm actually really, really curious which chat GPT will answer this as I'm actually really, really interested. What is the options trading equivalent of the karma? Is it karma or karma? Karma sutra book. Let's see. I have to save this so I can post this in for you. Oh, this is so good. This is so funny. All right. This is directly from GPT. So for those that are wondering, it's a great question. And I'm glad it's one that we could explore together. But we can see that the karma sutra is a text renowned for its complexity and breath in the context of relationships. Would be a comprehensive guide that covers intricate strategy, so on and so forth. The very first one is options as a strategic investment, which I can't help, but find to be absolutely hilarious",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 111,
      "start_timestamp": "00:13:26",
      "start_timestamp_seconds": 806.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=806"
    }
  },
  {
    "text": "karma sutra is a text renowned for its complexity and breath in the context of relationships. Would be a comprehensive guide that covers intricate strategy, so on and so forth. The very first one is options as a strategic investment, which I can't help, but find to be absolutely hilarious because that is essentially the book I most commonly recommend to people. So I now feel like I can comfortably and confidently say, I recommend the karma sutra equivalent of options trading. Literally perfect. That's now I'm not even going to I'm not even going to think of the book in the context of options as a strategic investment. I'm only now going to introduce that book as the karma sutra equivalent for traders. That's about as sick as it gets. I love that. All right. So let's start running through some of these. I don't know how long this is going to take. It'll go really however amount of detail that you guys want me to go into. The way that I intend to answer these is kind of give you a broad level overview so that I'm not fucking ranting about stuff. But then if there's specific elements of it or questions that you have as I go through some of these, let me know. And then I'll use that as my cue to dive in a little bit further. But otherwise, I'll just kind of give you a top line summary. And then yeah, see if that",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 111,
      "start_timestamp": "00:15:17",
      "start_timestamp_seconds": 917.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=917"
    }
  },
  {
    "text": "of it or questions that you have as I go through some of these, let me know. And then I'll use that as my cue to dive in a little bit further. But otherwise, I'll just kind of give you a top line summary. And then yeah, see if that satisfied because my goal is not to spend time talking about the stuff that people aren't highly interested in. I want to stick to what is most interesting to you because again, the goal for this is to kind of use the last almost 17 years of my trading experience as a bit of a lens for you, hopefully to look through where you're at in your trading career. And again, to give you some ideas on things to think about how to think about it, that kind of stuff. So early stages. The first one is what inspired you to start trading in 2007 and how did you approach learning the markets during your early years? This is pretty simple. I got into trading in 2007, because it was 2007. It's actually because I got introduced to investing by that teacher that I was just introducing you to. And I was looking for a way to make money. Like most people I grew up, I literally did grow up poor. So that's why. And when it came to the like, how did I start learning? I had the opposite problem that I think most people have today where for",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 111,
      "start_timestamp": "00:16:43",
      "start_timestamp_seconds": 1003.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1003"
    }
  },
  {
    "text": "I was looking for a way to make money. Like most people I grew up, I literally did grow up poor. So that's why. And when it came to the like, how did I start learning? I had the opposite problem that I think most people have today where for me, it was not information overload. It was kind of the inverse because the internet was still pretty new and it wasn't as anywhere near as robust as it is. So I was essentially restricted to what I could find in the library. Like that's pretty much it. So that's how I started learning in the beginning is going through stuff that I could find in the library. Then as the internet started absolutely compounding and expanding, I leveraged as much online learning as I possibly could. Vladimir says, I'm assuming that your account grew over time from regular cash deposits, from outsides from outside earnings as well as growing your OG pot of cash, the overwhelming majority of my starting capital and my early trading account came from saving the overwhelming majority. And that's something I continually try to remind people of. And this is something that I will happily take this as an opportunity to talk to you about. So back to the website. And I'm getting better at this example. So it should be a little bit quicker than some of my previous renditions. I'm like, starting to nail this example down. The main thing I want",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 111,
      "start_timestamp": "00:17:40",
      "start_timestamp_seconds": 1060.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1060"
    }
  },
  {
    "text": "happily take this as an opportunity to talk to you about. So back to the website. And I'm getting better at this example. So it should be a little bit quicker than some of my previous renditions. I'm like, starting to nail this example down. The main thing I want to show you is just where compound interest takes over. So when we look at like an initial balance with no contributions over a set time frame with a rate of return. Again, you guys have seen different elements of this before. But in this case, at 5,000, 10 for 20 years, you have 33 grand. If you add literally 100 per month, you would have 102 grand. This is the point in the beginning, saving is non-negotiable. In the beginning, saving is what gets you to your desired point sooner rather than later. Now let's change this. Now let's do 500,000. If you have 500,000, 20 years, 10 return per year. Again, this is saying we've gone from small account to now we're growing our account. And we have a larger account. Now you'll notice that you have 3.36 million. If you saved 100 more per month, you go to 4.32. So this is still that that's still a lot of money, right? No, no doubt. Going from 3.36 to 3.43, that's a non-negotiable amount of money just for 100 a month. However, the percent difference here is trivial. This is very small now on a comparative basis. Whereas",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 111,
      "start_timestamp": "00:19:00",
      "start_timestamp_seconds": 1140.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1140"
    }
  },
  {
    "text": "to 4.32. So this is still that that's still a lot of money, right? No, no doubt. Going from 3.36 to 3.43, that's a non-negotiable amount of money just for 100 a month. However, the percent difference here is trivial. This is very small now on a comparative basis. Whereas before when I showed you with this 5,000 account, I'm literally tripling the account plus. That's not the case when you have a 500,000 account. You get an extra, what, 60 grand, something like that. It's a not insignificant amount of money, but it's not a ton. What matters as your account grows, now let's take a look if you get a 1 return better over the same time frame. You would go from 3.36 to 4.03. That now matters because we've just added about 700,000 nearly a million dollars by just getting a 1 better return. So going back to off-putons, kind of not so much a question, but inference, which is completely accurate. In the beginning, saving is your path. It is the path to actually grow money very quickly. Then there comes a distinct point where it switches. Where now your additional savings add a much smaller incremental amount that is much more trivial in the broad scheme of things as compared to having a better rate of return. This now is getting 1 better return than the 10 is now light years more important to you than saving the 100 a month or whatever. So yeah,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 111,
      "start_timestamp": "00:20:09",
      "start_timestamp_seconds": 1209.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1209"
    }
  },
  {
    "text": "incremental amount that is much more trivial in the broad scheme of things as compared to having a better rate of return. This now is getting 1 better return than the 10 is now light years more important to you than saving the 100 a month or whatever. So yeah, to off-putons initial question, I absolutely, I slaved in my early 20s, probably until like 24 when I had to slow down and start focusing on like my military career more. I did everything I possibly could to make more money all the time. It was always top of mind to me. I was unbelievably disciplined with what I would spend. And one of the biggest things I always would go back and remind myself is that's why I built this calculator. I had it in an Excel sheet, so it didn't look quite this visual. But I would constantly remind myself that like when the rugby team was going out for drinks and to go hang out, I would always go. But I would go on Thursdays when it was nickel beers. I could do that. But when they wanted to go out to like anything nicer than that, I would go hang out, but I wouldn't get anything. And it's because I wanted to hang out with the people. I wanted to have fun. I still wanted to enjoy. But I also knew that I was making a short term sacrifice for a hopefully not long term gain.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 111,
      "start_timestamp": "00:21:36",
      "start_timestamp_seconds": 1296.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1296"
    }
  },
  {
    "text": "I would go hang out, but I wouldn't get anything. And it's because I wanted to hang out with the people. I wanted to have fun. I still wanted to enjoy. But I also knew that I was making a short term sacrifice for a hopefully not long term gain. That's the whole point. Is the stronger you delay gratification early on, the less you have to delay gratification in mass. If I delay gratification massively early on and focus on building this account to as much as I humanly can, the earlier I get to enjoy it, it's literally how I became a millionaire before I was 30 in a multi-millionaire in my early 30s. Once you start getting over those thresholds, it starts to compound pretty quickly. And again, I'm, well, I would say I'm healthy. I have a fucked up disc. So there goes that idea. But the broader point is that if you can get to a good spot early on, then the overall delayed gratification actually isn't as delayed as when I look at most of my peers. The vast majority of my friends haven't even bought a house yet, or they're just buying their first house, which I'm very happy for them for. But they're getting into like their first starter house. And that's just not where we're at, fortunately. We're kind of at a different spot in our lives. Like in my neighborhood, I am, we are 30 years younger at the least",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 111,
      "start_timestamp": "00:22:53",
      "start_timestamp_seconds": 1373.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1373"
    }
  },
  {
    "text": "first house, which I'm very happy for them for. But they're getting into like their first starter house. And that's just not where we're at, fortunately. We're kind of at a different spot in our lives. Like in my neighborhood, I am, we are 30 years younger at the least compared to all of our neighbors. So we're in just in a very fortunate spot at our age. So yeah, for Mr. Off Putin, absolutely. The beginning is all about saving. What I want to summarize this whole thing is no matter what you do, no matter what you do, this 5,000 account is not going to be your future wealth. It's not going to happen. Even if you get a 50 return for 20 years, you have 16.6 million, that's your future wealth. What's the probability of you getting a 50 return on your 5,000 account? It's essentially fucking no. It's essentially fucking no. The vast majority of traders will not beat the stock market. So then if you think about the continuum of beating the stock market, I beat the stock market typically. And I have a good return. It's actually much better than this. I still have an update of that. But it's still, again, this isn't 50, right? He's not even close because here's the other reality that's important for people to understand that the incremental changes that you walk into after this is really fucking hard. So I argue that if you can paste the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 111,
      "start_timestamp": "00:24:06",
      "start_timestamp_seconds": 1446.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1446"
    }
  },
  {
    "text": "an update of that. But it's still, again, this isn't 50, right? He's not even close because here's the other reality that's important for people to understand that the incremental changes that you walk into after this is really fucking hard. So I argue that if you can paste the market slightly outperform and then inch your way past that, it's a pretty good way to create repeatable success over time. However, once you start getting into higher return thresholds, it's really difficult to move the needle incrementally further. So for example, for me, going from a 15 average return to 20, genuinely was not that life changing. It was not that difficult. It obviously took a lot of effort in context, but it was quite doable. I can summarize that as whereas now I'm in like the mid 20 returns. If I wanted to grow to like a 30 compound annual growth rate, that's really, really hard. That's really, really hard. It's doable, but really, really hard. So there comes like a natural cap on return potential. So then if we look at something like this and we say, okay, well, what if you're a rock star and you're able to return 25 per year for 20 years on your 5,000. Six story, bro, you have 433,000 pre-tax. That's not your future wealth. Now again, if you would save just 100 more, you literally double it. You go to 845. And if you become a slightly better saver, then",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 111,
      "start_timestamp": "00:25:20",
      "start_timestamp_seconds": 1520.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1520"
    }
  },
  {
    "text": "able to return 25 per year for 20 years on your 5,000. Six story, bro, you have 433,000 pre-tax. That's not your future wealth. Now again, if you would save just 100 more, you literally double it. You go to 845. And if you become a slightly better saver, then all of a sudden this becomes much more powerful. So this goes all the way back to the beginning point that I want to reinforce. In the beginning, saving is the entire, entire goal, the entire goal. Then as you build your skill sets, then we worry about that 1 return variance and getting slightly incrementally better as we continue to trade. But one of the worst mistakes we all make, which is actually one of the questions I'm probably going to pop up in here. One of the worst mistakes we all make is trying to start with a 5,000 account. And we are so focused on trying to get this really crazy return, not understanding that even the ability to hit that return for one year, two years, five years, 10 years, 15 years, 20 fucking years, still doesn't get you there. It's the wrong focus. In the beginning, there is no substitute for savings period. That's all there is to it end of story. So I'm really glad that you brought that up off Putin because that's absolutely huge. That Lauren says, how much did you start with? What was your first big trade? It was definitely",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 111,
      "start_timestamp": "00:26:36",
      "start_timestamp_seconds": 1596.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1596"
    }
  },
  {
    "text": "beginning, there is no substitute for savings period. That's all there is to it end of story. So I'm really glad that you brought that up off Putin because that's absolutely huge. That Lauren says, how much did you start with? What was your first big trade? It was definitely 5,000 or less. I don't remember it was 5,000 or 3,500 when I actually started trading because I opened up an account and I started investing for a few months before. So I don't know which of those it was. I want to say it was about a 5,000 account. And when you say that Lauren, when you say for first big trade, what do you mean? Like the first big position size I put on or like the first big win that I had? Because I also have to be honest, as I'm thinking about that, I don't remember either outright. I remember my biggest loss. That one is visceral. I remember that plane is day, but like the first actual big winning trade, I don't remember. I remember my biggest winning trade, which the reason why I remember is because it was last year. So that one is very top of mind for me. But yeah, I don't remember the like the first big winning trade. The biggest loss for me as a percentage of the portfolio happened after I had been trading for a few years. So I had already been trading probably for five or six",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 111,
      "start_timestamp": "00:27:49",
      "start_timestamp_seconds": 1669.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1669"
    }
  },
  {
    "text": "very top of mind for me. But yeah, I don't remember the like the first big winning trade. The biggest loss for me as a percentage of the portfolio happened after I had been trading for a few years. So I had already been trading probably for five or six years. And I was trading good, all right. And in the rut, I was trading a really wide iron condor, a massively wide iron condor. And it was a short-term trade. It was like a one week trade. And I was trying to make 500 in something bucks. It was like less than 600 bucks. I want to say it was like 560 or 580. It wasn't that much. Super wide iron condor. And I was just like, it had such a high probability of winning. So I went into this thinking just let the probabilities play out, right? Super high probability trade. And sure as shit, it had a big move that breached one side. And I remember distinctly, I was pulling up to the gym to go work out with a buddy. And I looked at my phone, I got an alert and I saw the trade and I saw it was going really bad. And this was like a day into the trade. Maybe a couple days. I don't remember how long it was mid week. And I put the trade on earlier in the week. And then I walked into the gym. I looked at the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 111,
      "start_timestamp": "00:29:01",
      "start_timestamp_seconds": 1741.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1741"
    }
  },
  {
    "text": "I saw it was going really bad. And this was like a day into the trade. Maybe a couple days. I don't remember how long it was mid week. And I put the trade on earlier in the week. And then I walked into the gym. I looked at the phone again and I saw it and I saw that things were still going really bad. So I like sat for a minute. I decided to close the trade. I realized the loss and it was over a 30 drawdown on the account. And I just kind of sat there for a second. And then I went and did my workout with my buddy. And that was the largest drawdown I've ever had on the account since never anything even close to that, especially on one trade, not even not even close. But yeah, that was a really formative experience for me. That's when I I decide like I took some time to like really think about it. And I decided to start taking it really seriously from there. Because I thought I was doing a smart thing. I thought I was picking some sort of really high probability trade. And the biggest mistake I made in that was focusing so much on what I wanted to win and what I thought I was going to win that I spent exactly zero time thinking about what the path of the return could look like and how I would react during",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 111,
      "start_timestamp": "00:30:08",
      "start_timestamp_seconds": 1808.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1808"
    }
  },
  {
    "text": "And the biggest mistake I made in that was focusing so much on what I wanted to win and what I thought I was going to win that I spent exactly zero time thinking about what the path of the return could look like and how I would react during the path of the return. My favorite part about the story is that if I had just held the trade, it would have been a complete winner. It landed right in the range. It would have been a complete winner. And I actually was never upset about that. I always just thought that that was like a funny, a funny part of the story that it would have been a complete winner. But I still think going like looking back at it now in that context, I would make that same choice every time where I make the hard choice. I realize the loss. And then I reconstitute and figure out what I'm going to do because here's the here's the funny part. I look at that year. What year was that? That year was in those 2011. So I started trading in 2007 that happened in 2011. And it was a two week trade. Sorry, I thought it was a one week trade. It was a two week trade. And that year I still landed up 13.99. That trade literally transformed what I did. So I think that trade had a really profound impact on the way that I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 111,
      "start_timestamp": "00:31:14",
      "start_timestamp_seconds": 1874.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1874"
    }
  },
  {
    "text": "was a two week trade. Sorry, I thought it was a one week trade. It was a two week trade. And that year I still landed up 13.99. That trade literally transformed what I did. So I think that trade had a really profound impact on the way that I thought about this stuff. So yeah, definitely remember that losing trade without a doubt. LPBBO say Zacharias says research time versus earning capital time. How do we contribute to each? That is a fantastic question. I think that you create time for both of them. Like they, if you want to be really efficient about growing your money, we can't work unilaterally. We have to work in conjunction in tandem with multiple things. So in terms of research, you can set a specific amount of time each day that you want to dedicate to researcher each week. And then the same thing for expanding your income. And I think both of those just have to be really well thought out, right? Because if you're at a really high earning job or a job with really high earnings potential, rather than bothering and go getting a side hustle, you might be better off grinding it out at work, getting a promotion, fighting for yourself, arguing for mid-year raises because nobody else does it. And they're a thing you can get those. You just have to advocate for yourself and have the right results to back up your worth to the company.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 111,
      "start_timestamp": "00:32:28",
      "start_timestamp_seconds": 1948.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=1948"
    }
  },
  {
    "text": "better off grinding it out at work, getting a promotion, fighting for yourself, arguing for mid-year raises because nobody else does it. And they're a thing you can get those. You just have to advocate for yourself and have the right results to back up your worth to the company. But I think spending time on that in like a high earning job, that's the best place you could spend the time. Because the incremental gain of picking up a side hustle is probably not much. For me, it was the opposite. Well, I was in college. I did side hustles. That's all I did. And when I was in when I was in something like the Marine Corps, there's no time for like, well, there's nothing I can do in the Marine Corps to advocate for myself to get promoted faster and get paid more. It's a standardized pay scale. So in those instances, I had to absolutely start looking at other things. So that's one of the ways I got into flipping motorcycles. That was I made a lot of money flipping motorcycles. And same thing with like cars, I've told you guys a million times, like, yes, I have nice cars now, but I've always been a car guy. That's why I got a Corvette and I started building it because I like cars. It's why I have them a Clarence. I like cars. It's not because I think that they're like what the finance guru's supposed",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 111,
      "start_timestamp": "00:33:46",
      "start_timestamp_seconds": 2026.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2026"
    }
  },
  {
    "text": "I have nice cars now, but I've always been a car guy. That's why I got a Corvette and I started building it because I like cars. It's why I have them a Clarence. I like cars. It's not because I think that they're like what the finance guru's supposed to do. I kind of suck at the finance guru's supposed to do thing. I just happened to like cars. But that's a big way that I got into cars is I applied a skill set that I learned as a kid, which was fixing my mom's car because we didn't have money to go take it to a mechanic. My brother and I had to become mechanics. And then I just continued to apply the skill set. So I did that literally all through college. Yeah, I think that that was a really important process for me actually. And I think understanding your current scenario and identifying what makes the most sense for you. So again, I would take a good hard look at where you're at in your professional career. If you can make an incremental investment in order to make a larger impact on what you're trying to do in terms of your ability to promote, then that makes sense to me. If you're in a career where that's not really looking good, you're already pouring it in, whatever it's not happening. And again, the most important part there is you have to advocate for yourself. You",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 111,
      "start_timestamp": "00:34:50",
      "start_timestamp_seconds": 2090.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2090"
    }
  },
  {
    "text": "to do in terms of your ability to promote, then that makes sense to me. If you're in a career where that's not really looking good, you're already pouring it in, whatever it's not happening. And again, the most important part there is you have to advocate for yourself. You absolutely have to advocate for yourself. But beyond that, I think picking one of those two paths to expand your income is first. And then taking the time to build a fundamental understanding of trading would be done in tandem. I would focus more on earning more money in the beginning because in the beginning, again, we all try to move so fast with respect to how much we're going to learn. And it's honestly a waste of time and effort in my opinion. Like, it doesn't actually matter quite that much in the beginning. I think that you'd be much better off increasing your overall starting principle and then going from there. Mixed as I love my Ducati. Yeah, I love them. That was actually one of my favorite bikes. I had multiple monster 1200 S's. That was always my favorite. I had the pantogollies. I like those. They were cool. They're not my favorite sport bike. I much prefer the R1. But yeah, the Ducati's are beautiful. I really liked the monsters. I've probably had like 10 or 12 of those now. Big, big fan. So yeah, that's how I think about like earning versus learning Zachariah. Zachariah",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 111,
      "start_timestamp": "00:35:55",
      "start_timestamp_seconds": 2155.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2155"
    }
  },
  {
    "text": "were cool. They're not my favorite sport bike. I much prefer the R1. But yeah, the Ducati's are beautiful. I really liked the monsters. I've probably had like 10 or 12 of those now. Big, big fan. So yeah, that's how I think about like earning versus learning Zachariah. Zachariah then also says, ever listen to Dave Ramsey? No, literally never. I've never listened to any of his material. I've seen some of his like, YouTube shorts will pop up once in a while. But he seems to deal from my understanding. He seems to deal with more like general finance stuff, like basics of budgeting and debt and stuff like that, which is not that's not my bag. So not really. Joey says, do your neighbors think you deal drugs? Yeah, it's actually funny. One of the most, here's a funny story for you, Joey, when this is a hilarious story. When we were walking around the house that we live in now, we were at an open house. And you know, it's my wife and I, and we're just kind of cruising around looking at the place. And I swear to you, there was this woman with her husband. And they had a kid that they were holding. And then I guess it was the woman's parents that were also walking around with them. And I was coming out of this room right here, the office that I'm in right now. And I was walking out. And the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 111,
      "start_timestamp": "00:37:11",
      "start_timestamp_seconds": 2231.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2231"
    }
  },
  {
    "text": "husband. And they had a kid that they were holding. And then I guess it was the woman's parents that were also walking around with them. And I was coming out of this room right here, the office that I'm in right now. And I was walking out. And the the older lady, I guess she was the grandma, the mother of the couple. She literally looks at me and she goes, so who are you guys looking for? It's just my wife and I here. I was just like, yo, for us, bitch. But I thought the way that she said that was so epically funny. She was like, so who are you looking for? And I was just like, what the fuck do you think I'm here for? Like it's just me and her. If like, what does this even mean? I thought that she was so funny. And the absolute best part about that interaction is after I said, I'm looking for us, she didn't say anything. She just turned and walked into the bedroom because we were going back out to the living room. She didn't say anything. She didn't say like, even, oh, interesting. Oh, cool. Oh, good for you. Oh, okay. Fucking nothing. Absolutely nothing. I can I just, oh, my God, I was dying so hard. I couldn't stop laughing at that interaction. The fact that she just straight up said nothing, dog. So funny. But yeah, I don't know if they think",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 111,
      "start_timestamp": "00:38:21",
      "start_timestamp_seconds": 2301.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2301"
    }
  },
  {
    "text": "cool. Oh, good for you. Oh, okay. Fucking nothing. Absolutely nothing. I can I just, oh, my God, I was dying so hard. I couldn't stop laughing at that interaction. The fact that she just straight up said nothing, dog. So funny. But yeah, I don't know if they think that we are drug dealers, but because most of my neighbors know like what I do and what Mel does because Mel also is a high earner. But we yeah, her and I we complement each others like return profiles really, really well. Wigglywarm says doesn't one beat the market by becoming the house and selling options? No, definitely not. Negatron goes writer. That is not the way. Apollo says a Japanese trader pulled off 100 returns for several years. Now that's an outlier. But potentially again, even I don't know that the Japanese trader and I don't know like what the background is behind them. But the most important part of the game for that is keeping the money. Because I had a video and I'll link to it here because I think it's an important video. It's about risk management. There are tons of traders that I've seen. He go. This one. There are tons of traders that have made tons of money. But the name of the game is to keep it. So yeah, that Japanese trader or the Singaporean trader might have done really well, but the whole idea is how well did you keep it?",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 111,
      "start_timestamp": "00:39:45",
      "start_timestamp_seconds": 2385.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2385"
    }
  },
  {
    "text": "He go. This one. There are tons of traders that have made tons of money. But the name of the game is to keep it. So yeah, that Japanese trader or the Singaporean trader might have done really well, but the whole idea is how well did you keep it? Zacharias says people underestimate the ability of a V.A. loan. Sort of. You have to have the money to back it up. The V.A. loan just grants you access to something. But because like we had to put money down on the house anyways. So yeah, it's not like we did like a zero money down V.A. loan for the were in a not cheap house. It's over seven figures. So yeah, the V.A. loan is very powerful, but you have to have the finances to back it up. Otherwise, they're not going to give you a V.A. loan. It makes no sense for them. They take all that risk. So yeah. So yeah, Wigglyworm, happy to dive more into that, but no. The way that a person beats the market is not by becoming the house and selling. There's elements to that that are useful, but I think that's the exactly wrong conclusion to land with. Off-putin says it takes 400K per year gross on average to live the American dream in 24. Yeah, I think it depends on the concept of a American dream, right? That's everybody will have their own version of the dream. I'll tell you",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 111,
      "start_timestamp": "00:41:18",
      "start_timestamp_seconds": 2478.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2478"
    }
  },
  {
    "text": "the exactly wrong conclusion to land with. Off-putin says it takes 400K per year gross on average to live the American dream in 24. Yeah, I think it depends on the concept of a American dream, right? That's everybody will have their own version of the dream. I'll tell you right now, like 400 per year is decent, but it depends on what somebody cares and values. Roryntady says, okay, so you save at what point in your saving do you start trading? I think you start trading immediately, literally immediately. I think the way to think about trading is that I would start paper trading right away, because you stand nothing to lose. And if you again, it's working in tandem, it's coming up with a proof of concept for yourself that then you can continue to leverage. So this video, which is like one of my worst viewed videos so far this year, but I think it's really important anyways. That's why I made it. That video talks about how to use paper trading to completely leverage, just expand what you're doing. Wigglyworm says, man, it all comes back to the paper trading video. That's it, dog. Always back to paper trading, because I think if I were to do this in the most efficient way I possibly could, I would save money, I would find ways to make more money. I would learn about trading, I would paper trade while I'm learning about trading. Then when I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 111,
      "start_timestamp": "00:42:33",
      "start_timestamp_seconds": 2553.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2553"
    }
  },
  {
    "text": "back to paper trading, because I think if I were to do this in the most efficient way I possibly could, I would save money, I would find ways to make more money. I would learn about trading, I would paper trade while I'm learning about trading. Then when I have a decent track record of successful paper trading, then I would start live trading. That's exactly the way that I would do it. But the tricky part is, again, like most people, myself included, like I'm not innocent with this, but most people myself included think that we're just going to somehow strike it, strike it rich, make a bunch of money with very little effort, very little experience. It's so unbelievably naive, but most of us think like that. That is exactly what I would do. I truly believe that's the most efficient path you can take to sort out and quickly move through that for sure. Joey says, when you feel you're ready to start sizing up your trades, well, I size them up too early. So I think after I went through that loss, I just came up with way more strict risk control parameters and would get stopped out a lot. But I set very, very clearly to find limits to what I would let myself put up for sure. Roy and Titty says, you have a back to the future card, DeLorean, no, I wish. DeLorean, those are very cool. But I don't think",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 111,
      "start_timestamp": "00:43:56",
      "start_timestamp_seconds": 2636.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2636"
    }
  },
  {
    "text": "would get stopped out a lot. But I set very, very clearly to find limits to what I would let myself put up for sure. Roy and Titty says, you have a back to the future card, DeLorean, no, I wish. DeLorean, those are very cool. But I don't think I would actually want one that's not my car, but I think they're very beautiful. I like them a lot. LPB says, do the shoddy's melt for the McLaren. That's actually funny, especially out here in Southern California, because I run a car club. There's a pretty cool car culture. And the McLaren definitely seems to draw more more of the females that are they just like the paint, the look of the car, it looks expensive. I think that's probably the superficial way that they'll look at it. And then the Corvette actually gets a generally equal amount of attention, which is kind of funny, because well, it's because it's totally built. But I'd never really expect women to feel any type of way about it. I always get a kick out of that though. Like when dudes think if they get a cool car that like women somehow are gonna melt over it, it's like it's the dumbest thing. The overwhelming majority of people that are interested in cars are fucking dudes. So it's like, yeah, if you want to find a bunch of dudes and talk with dudes about cars, then for sure, that's the place to",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 111,
      "start_timestamp": "00:45:17",
      "start_timestamp_seconds": 2717.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2717"
    }
  },
  {
    "text": "are gonna melt over it, it's like it's the dumbest thing. The overwhelming majority of people that are interested in cars are fucking dudes. So it's like, yeah, if you want to find a bunch of dudes and talk with dudes about cars, then for sure, that's the place to do it, because that is the overwhelming majority of people you're going to talk to. The main thing I get is when like there will be girls at the car meets that want to take a picture with the car, which I'm always, always cool with. But I have actually a funny story about that because most girls that ask to take pictures of the car, they're really respectful. So they'll say like, is it okay if I lean on the car or can I do this? And then more often than not, I'll tell them don't touch my fucking car. But sometimes like if it's like a little kid or something of course, like I've put little kids on the fucking hood, like they get special treatment. But yeah, if you're like a 20-year-old chick like fuck you. But the funny part was is there was a girl that didn't ask and she like went to like lean back and it was this was on the Corvette. And I was literally, I literally, I was just, I didn't skip a beat. I was like, get the fuck off my car. You fucking crazy. And you can tell that she",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 111,
      "start_timestamp": "00:46:33",
      "start_timestamp_seconds": 2793.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2793"
    }
  },
  {
    "text": "didn't ask and she like went to like lean back and it was this was on the Corvette. And I was literally, I literally, I was just, I didn't skip a beat. I was like, get the fuck off my car. You fucking crazy. And you can tell that she was blown away that somebody would talk to her like that. It's actually quite funny because to me, you have to be in such, you have to be in such a spot in your brain that you think you could do something like that. And then to not like to never have somebody like reprimand you, that was absolutely hilarious. Big, big fan. So yeah, they different people definitely like them though. That's for sure. Mick D says Eric, what are your opinions on Bitcoin, Bitcoin ETFs and the new options on Bitcoin? I like options on Bitcoin ETFs. Those are very, very tradable. With respect to Bitcoin ETFs, I don't care about them. Right now, I hold the cryptocurrency itself. And it's not a big part of my overall book. I literally, it was actually funny. I was on the phone with a buddy the other day and Bitcoin came up. Literally, the only time I check it is when it in this context, like I literally was just going to go check it because I never think about it. And I forgot how to log in for a second. I was just like, shit, this is a problem",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 111,
      "start_timestamp": "00:47:34",
      "start_timestamp_seconds": 2854.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2854"
    }
  },
  {
    "text": "came up. Literally, the only time I check it is when it in this context, like I literally was just going to go check it because I never think about it. And I forgot how to log in for a second. I was just like, shit, this is a problem because there's no, there ain't no extra way to get in there. But yeah, so I'll hold the cryptocurrency itself, but I don't really care about holding the ETFs. There's not a need for that for me. But the options on them that's completely completely different. So yeah, I think for sure, Bitcoin is cool. Bitcoin ETFs are cool. However, I think they have to fit in well with what you're doing. And a Bitcoin ETF, if there's a way, I don't know, if there's one that's structured well, I would be interested. But yeah, I haven't seen much of that. Speedrunner says, Rims, he got rich selling multi-level marketing garbage. He doesn't like talking about that because he's the big Christian. I did not know that he was in multi-level marketing. But I mean, yeah, people gotta do what they gotta do. Wigglyworm says I can throw a vertical spread at the wall and make money to compound earnings. No, that's not how that works. Olli Poppins says, keep getting ads, man, sorry about that. I literally have it turned off, but I do not control YouTube, unfortunately. So yeah, I literally have this literally turned off on my",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 111,
      "start_timestamp": "00:48:50",
      "start_timestamp_seconds": 2930.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2930"
    }
  },
  {
    "text": "spread at the wall and make money to compound earnings. No, that's not how that works. Olli Poppins says, keep getting ads, man, sorry about that. I literally have it turned off, but I do not control YouTube, unfortunately. So yeah, I literally have this literally turned off on my end. So Rowan City says YouTube is changing ads, Olli. It's YouTube. Oh, okay, God, thank you, Rowan City. I was literally going to ask about that because yeah, I literally have this shit turned off. I think I'm almost caught up. G36 says, man, I wish I was into this shit when I was 18. That's the cheat code. The earlier you can start, that's where it's literally magic. That's literally where all the magic starts because this, this, if you're 17, isn't that long. If you're 17, it's not that long. And if you get good at this stuff while you're doing this, then all of a sudden this becomes a very viable roadmap. Now, if you're in your early 20s, you just have to get better here at your contributions. Here's what I find with most of my peers, people that are my age, I'm 33. I find that most people that are my age seem to feel like they deserve a certain lifestyle. And I think that kind of entitlement is a mental disease that will keep most of them fucking poor or at least stock in their current threshold because the worst thing people do,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 111,
      "start_timestamp": "00:49:53",
      "start_timestamp_seconds": 2993.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=2993"
    }
  },
  {
    "text": "find that most people that are my age seem to feel like they deserve a certain lifestyle. And I think that kind of entitlement is a mental disease that will keep most of them fucking poor or at least stock in their current threshold because the worst thing people do, and I've already given you this example before, the worst thing people do is as they make more money, they incrementally grow their lifestyle. And what they don't realize is that incremental lifestyle growth is trivial. It doesn't really matter, but if you just maintain your existing lifestyle as your income rose, then you can save more. And then what ends up happening is as you decide to fill your lifestyle, your earnings potential grows exponentially. And then you can fund a really cool lifestyle at a relatively young age. It's the same thing I've talked to you guys about even with like the toys that I bought, right? Like the cars, I bought all those in cash because there's, I don't have to take out loans for them. I think, well, I think auto loans are terrible. But if you delay gratification a little bit early on hardcore, then it's less of a delayed gratification path in its entirety. So yeah, I think G36 you're on it. And that's the thing also G36 is everything you guys can do to talk to other people about this. I think that it is absolutely critical to share this information with people",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 111,
      "start_timestamp": "00:51:18",
      "start_timestamp_seconds": 3078.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3078"
    }
  },
  {
    "text": "it's less of a delayed gratification path in its entirety. So yeah, I think G36 you're on it. And that's the thing also G36 is everything you guys can do to talk to other people about this. I think that it is absolutely critical to share this information with people because it's fucking life changing. It literally is life changing. It's why I'm doing this session. I much, I don't know, I don't mind talking about like my path and my background, but I really don't like it being about me. That's kind of the military side of me, especially the marine officer side of me. Like if you look at my little notebook, there's a thing that we always write, which is marine officers eat last. Right? It's not about you. It's about the dudes. It's about other stuff. But I think in this context, the ability for other people to talk about and to share this kind of information with people is literally life changing. So I'm glad G36 that you're identifying that. And then the next question though is make sure you share it with people because that's really, really where it's super powerful. Like super powerful. I'd rather be skiing say I like to say I don't beat the market. I learn how to be consistently profitable. I think that depends on the goal because to me, I think the idea of trading is to beat the market. Otherwise, I would just take the beta risk",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 111,
      "start_timestamp": "00:52:20",
      "start_timestamp_seconds": 3140.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3140"
    }
  },
  {
    "text": "I'd rather be skiing say I like to say I don't beat the market. I learn how to be consistently profitable. I think that depends on the goal because to me, I think the idea of trading is to beat the market. Otherwise, I would just take the beta risk because there's really no other reason not to. Yeah. Yeah. Bow loses. I'm just curious what's your MBTI personality type? The fuck is MBTI? Myers-Breg-Thompton? What the fuck is MBTI? MBTI test. What is this? Could I take this? Am I supposed to take this? Where do I take this? I'll take the test. Where do I take it though? Where's the Myers-Bregs you took it at some point? I remember I took a Deloitte version of it because Deloitte, they have their own little fancy version for it. Is this the right one? I'll take it right now. Does this look correct? MBTI test. From 16 personalities? Where do I take it through truity? Which one of these do I take it through? Does 16 personalities? That sounds like somebody with really bad schizophrenia. Where this one? Okay. Choose this phrase that describes you best. Very organized. Very logical. Ooh, that depends. Typically speak up. Don't care about attention. I always care about that. That way. Hence. Hence. More that. Probably more that way. More that. Always that. Mostly that. Always that. Accurate. Medium. Accurate. Very much. Definitely. Definitely not. Always. Not so much. I think about why people",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 111,
      "start_timestamp": "00:53:32",
      "start_timestamp_seconds": 3212.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3212"
    }
  },
  {
    "text": "Ooh, that depends. Typically speak up. Don't care about attention. I always care about that. That way. Hence. Hence. More that. Probably more that way. More that. Always that. Mostly that. Always that. Accurate. Medium. Accurate. Very much. Definitely. Definitely not. Always. Not so much. I think about why people do always have to do with their own abilities. Adding with new acquaintances. Yeah. Always. This is actually this is one of the funniest things. Whenever I like I literally have designated places for everything and it always cracks me up because sometimes Mel will try to like she puts I don't know I literally don't understand how it works but she just like puts shit down into like fucking evaporates. I don't understand how it works. That is never been. I don't know. It's so bizarre to me. Even down to like what I'm going to wear. I essentially lay out what I'm going to wear the night before. So this is like literally always. I enjoy being there for people when they're feeling sad. Now I'd rather go with the flow than have a set schedule. This depends. Philosophical. Yes. Large party in my honor. Fuck no. Very attentive to deadlines. Helpful to people I hope so. Bigger picture. Yes. Easy to talk to people. Yes. I believe in the importance of art. Medium. Please others. Fuck others. Personal problem. Sure. I'd like mysteries universe. Yes. Yes. Yes. A thrill sometimes. Probably that. Sensitive to the feelings of",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 111,
      "start_timestamp": "00:55:45",
      "start_timestamp_seconds": 3345.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3345"
    }
  },
  {
    "text": "attentive to deadlines. Helpful to people I hope so. Bigger picture. Yes. Easy to talk to people. Yes. I believe in the importance of art. Medium. Please others. Fuck others. Personal problem. Sure. I'd like mysteries universe. Yes. Yes. Yes. A thrill sometimes. Probably that. Sensitive to the feelings of others. Sort of. Scientific theories. Yes. Yes. Make new friends. Kind of. I like to have a detailed plan before. Sometimes people tell me I'm too quiet. I've never heard that in my life. I would prefer to come up with the original solution to a problem. Sometimes. Being around lots of people energizes me does not. I have trouble sticking to a routine. Clearly inaccurate. Service to others. Yes. Examinate myself in my life. Yes. How long do you make new friends? No. Private person generally. That I care about their feelings. Probably not. Full of new ideas. Sort of. Yo, this is way longer than I thought. It's been time. Choose the phrase that describes you best. Oh, fuck. Both of those. Real life. I don't even know what this means. This. Don't know what this means. Both. Both. Active bustling. Oh, this would be terrible. That by step. Figure out things as I go. I like to finish all my chores before I do something fun every single time. Question why things why they are typically. Almost always. Care out my plans. Yes. Minimize emotion. Yes. Lose my belongings at psychotic. Follow traditions. Maybe. I let other",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 111,
      "start_timestamp": "00:57:54",
      "start_timestamp_seconds": 3474.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3474"
    }
  },
  {
    "text": "step. Figure out things as I go. I like to finish all my chores before I do something fun every single time. Question why things why they are typically. Almost always. Care out my plans. Yes. Minimize emotion. Yes. Lose my belongings at psychotic. Follow traditions. Maybe. I let other people know what I think. Sort of. Don't care about conflict. I have trouble controlling impulses. Do not. Yeah. I'm terribly with terrible with music. Needed. No, I don't like being. You like being alone. I forgive moderately easily. Do you like new hobbies? Very active. When my back's not fucked up. I try my absolute best to be objective. I have a rich fantasy life. I don't know what the fuck that means. I like to do things as they read on the past. I avoid arguing when I disagree completely. Get rid of that. I have a lot of fun. Always. I resist temptations all the time. I succeed. Three time alone. Yeah, typically alone or with my wife. One of the coolest things about hanging out with my wife, I think, is we're both really good. Like we can be around each other. But we don't have to constantly engage. So like, I actually really enjoyed just being in the same room and just chilling. Punished for mistakes depends on the mistake. Speaking of experiences all the time on the go. Yes, yes, yes, no. Medium. Dislike. I don't care. Always. Yes. Care. Rarely. Yes. Need support.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 111,
      "start_timestamp": "00:59:41",
      "start_timestamp_seconds": 3581.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3581"
    }
  },
  {
    "text": "to constantly engage. So like, I actually really enjoyed just being in the same room and just chilling. Punished for mistakes depends on the mistake. Speaking of experiences all the time on the go. Yes, yes, yes, no. Medium. Dislike. I don't care. Always. Yes. Care. Rarely. Yes. Need support. No. Love museums. Avoid noisy crowds. Yes. Funny enough for me, I actually think it's easier to do this. Yeah. Ballard by disorder. None or really care. Yes. No. No. Don't care. No. Yes. Yes. Yes. Don't care. Very much. Generally. Do not. Don't care. Don't care. Don't make me uncomfortable. I'm not. I'm not. I'm not. Don't care. Don't make me uncomfortable. I don't care. All right. What am I? Any guesses? Elizabeth says my guess is ESTJ. I am ENTJ. What is the ENTJ? What am I? Very skeptical. That's spot on. That is. I am highly skeptical. That is completely true. Super curious, very true. Dominant doesn't surprise me. Driven doesn't surprise me. Innovative sort of analytical objective. Yep. Assertive, chicken charge, organizing people. Yes. Yes. Blunt and prone to certainty. Yep. Yes. Yeah. This is actually, it's actually kind of nuts to be honest. Like how accurate a lot of this stuff is. Because I literally completely grew with this. I think that this makes a lot of sense. The gaining power in influence part, I don't actually identify with that, but like the vast majority of it. I think is absolutely solid. Cool. Well, forgot",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 111,
      "start_timestamp": "01:01:00",
      "start_timestamp_seconds": 3660.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3660"
    }
  },
  {
    "text": "accurate a lot of this stuff is. Because I literally completely grew with this. I think that this makes a lot of sense. The gaining power in influence part, I don't actually identify with that, but like the vast majority of it. I think is absolutely solid. Cool. Well, forgot who asked that question, but now we know the answer to that myself included. All right. Let's get back to these. Okay. Okay. So there's a conversation about hypocrisy and Christianity. That's kind of fun. Speedrunner says, I'd buy a 2024 Corvette. If any of you get rich, avoid the Dodge Viper unless you're a pro. Don't say that. Dodge Viper is fine. Wigglyworm says, at least, if that is the cheap car. Yeah. The vet is that, well, funny enough, after the work, it's definitely not like with the amount of time and parts that I've put in it to build it. It's definitely definitely not. But yeah. Okay. Cool. So now, Samoji says, I'm going to watch dishes play a tornado warning tone. I don't know how to do that. I don't have that. It has to be a do shit that I can't do. All right. Let's get on to the next. How did the 08 financial crisis shape your perspective on risk and market volatility? I didn't really know what I was looking at. So this one, I don't actually think had a massive impact because it was so early on my trading career. I don't",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 111,
      "start_timestamp": "01:03:16",
      "start_timestamp_seconds": 3796.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3796"
    }
  },
  {
    "text": "get on to the next. How did the 08 financial crisis shape your perspective on risk and market volatility? I didn't really know what I was looking at. So this one, I don't actually think had a massive impact because it was so early on my trading career. I don't think that, yeah, I don't think I fully understood and had it soak in. It was just like a weird year. I didn't have a lot of risk out. Speedrunner says, you tap the gas just a little too hard and you're going into the wall. I can tell that you've never driven a Dodge Viper because it's actually not the case at all. That's one of the most common misconceptions I continue to hear about the Viper. If you look at the Viper, take a look at the Laguna, the Laguna Seka track times. And if you look at the Viper ACR, it's one of literally the best handling cars that exists. So yeah, that's that ain't it. It's completely wrong. The thing that people probably don't understand about something like a Viper specifically is like understanding how to apply power through a corner in order to maintain slash gain traction. That's probably a bigger issue that people will have with it. But yeah, they literally handle actually exceedingly well. Even the old school ones, I've driven 1994, or was it a 96, GTS? And that was way better behaved than I would have expected. And they definitely, like,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 111,
      "start_timestamp": "01:04:38",
      "start_timestamp_seconds": 3878.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3878"
    }
  },
  {
    "text": "gain traction. That's probably a bigger issue that people will have with it. But yeah, they literally handle actually exceedingly well. Even the old school ones, I've driven 1994, or was it a 96, GTS? And that was way better behaved than I would have expected. And they definitely, like, if you're a completely lay driver, trying to drive it aggressively, then yeah, that would probably be slightly problematic. But if you're reasonably understanding of a car, then it's not that bad. You'd wonder, says, my neighbor had one. He always warned me, never let me drive it. That's just because he didn't want you driving his car. There's no reason not to let somebody drive your fucking car. Yeah. Triple in says, what's the insurance on those cars? I actually don't know. I literally don't know what I pay for insurance. I have it all bundled together. So like, my insurance, I paid every six months. And it's several thousand dollars. But that's for all my shit, like the house, all the cars and stuff. So I don't know what it is per car, unfortunately. So yeah, that's the O8 crisis. Let's move on to the next. What mistakes did you make early on that had the biggest impact on your trading strategy today? That's a good question. I think not prioritizing enough the performance of a system. So in the beginning, I was like really, really, really willing to modify and to change what I was doing to",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 111,
      "start_timestamp": "01:05:46",
      "start_timestamp_seconds": 3946.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=3946"
    }
  },
  {
    "text": "did you make early on that had the biggest impact on your trading strategy today? That's a good question. I think not prioritizing enough the performance of a system. So in the beginning, I was like really, really, really willing to modify and to change what I was doing to try to salvage individual trades. And I didn't fully respect how much how useless that was. Because if we think about it for something like a long-term path as a trader, it's your ability to reliably deploy at a specific level for an extended duration. So it's like, if even if I break all the rules and I do everything I can, and I have one good successful trade, that's okay. But the problem with that is it doesn't, it's not replicable into the same degree. So then when I come into a similar circumstance in the future, I'm actually not in a good spot to manage it. That's actually highly problematic. And I think that's one of the most common mistakes new traders make is focusing on individual trades too much and not the process or the system of trades. That's what I would say. Mick D says, how long did it take for you to adjust to bear markets and downturns? Yeah, that's a really great question. And how did you adjust your trading? That's a fantastic question. Because I think that question is so important because as a trader, if you can't trade directionally well, both directions,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 111,
      "start_timestamp": "01:07:04",
      "start_timestamp_seconds": 4024.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4024"
    }
  },
  {
    "text": "long did it take for you to adjust to bear markets and downturns? Yeah, that's a really great question. And how did you adjust your trading? That's a fantastic question. Because I think that question is so important because as a trader, if you can't trade directionally well, both directions, you're missing a lot of opportunities. Now a lot of traders can do very well trading one direction. It's a thing. The problem is that in that context, if that's your approach, you run into some problems. So say, for example, we look at SPX and we go back to five years. If you can only trade one direction, when the SP 500 is fumbling like it did in 2022 here, a lot of people struggled a lot trying to trade this. And if you're not able to pivot effectively, this essentially completely puts you at a disadvantage period. So the way that I try to think about it is I think when trying to trade direction is to remap the way that we look around markets. Most of us think of markets like going to the store, right? By low, sell high, that whole thing. But there's actually a lot of things that start to make more sense when you get rid of that mindset. And you think way more just about direction. And you'll hear me say it all the time, I try to reinforce some of these really important points, at least for me. And one of",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 111,
      "start_timestamp": "01:08:23",
      "start_timestamp_seconds": 4103.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4103"
    }
  },
  {
    "text": "lot of things that start to make more sense when you get rid of that mindset. And you think way more just about direction. And you'll hear me say it all the time, I try to reinforce some of these really important points, at least for me. And one of those points in this context is that my job isn't to want anything from the market or think the market should do something. My job is to do my absolute best to see what the market is doing and see how I can get on with it. That's what I think about. So when I think about bear markets, I understand the tendencies for bear markets. I have entire data sets that break out the performance and different ways for me to flag when we're coming into a bear market, different topping things that I look for. So it essentially allows me to reposition so that then I can trade to the downside. And it's also why I pick the strategies that I do. Because it's really not a big list of strategies. I continue to remind you of this because I don't think that you have to have this massive stable of strategies. So when we look at something like directional, these are essentially the way I'm going to trade directionally to the downside. And it's three things. Ratio put diagonal short calls or long puts. That's pretty much it, almost always. So yeah, I think more so of",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 111,
      "start_timestamp": "01:09:41",
      "start_timestamp_seconds": 4181.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4181"
    }
  },
  {
    "text": "massive stable of strategies. So when we look at something like directional, these are essentially the way I'm going to trade directionally to the downside. And it's three things. Ratio put diagonal short calls or long puts. That's pretty much it, almost always. So yeah, I think more so of trying to identify trade movement and or market movement and then figuring out a way to structure trades around it. I think way less about applying a normal mindset to markets where we're just trying to buy low sell high. I think the sooner you can break out of that, the like the light years better off you're going to be. So it's a really, really good question, Mick. It takes a little bit of time, but it's like anything else genuinely. Like if you go back and you pay per trade back to paper trading and you pay per trade, these kinds of markets, you have a lot of really good ideas. Because there are going to be tendencies that you'll identify in down markets versus up markets. One of the biggest ones and you've heard it before. And it's absolutely true. That markets tend to take the elevator down and the stairs up. So what that means is when I'm trading markets to the downside, I'm thinking more so about velocity. How can I trade things that move quickly? That's really important to me. So I think that's probably one of the biggest ways that I started pivoting",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 111,
      "start_timestamp": "01:10:46",
      "start_timestamp_seconds": 4246.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4246"
    }
  },
  {
    "text": "down and the stairs up. So what that means is when I'm trading markets to the downside, I'm thinking more so about velocity. How can I trade things that move quickly? That's really important to me. So I think that's probably one of the biggest ways that I started pivoting is I reshaped my thought about trading, meaning dumping the idea of just trying to trade things as they're going up and adopting the idea of trying to trade direction as it is. Then I just used the simplest strategies that I could to take advantage of those movements. So let me know if that answers your question, Mick. Sam says, how do you go about choosing your stop loss? It's another great question. It's not a set rule. So there's some general parameters that I tend to apply to things. And actually in that video that I posted earlier goes into it. I'll throw it in here again about risk management for options traders. But essentially the cliff notes version of it is I actually look more so at what makes sense for an opportunity. And we can look at some examples. So let's say that I'm trading, well, I can find something I'm trading right now so that we have a live example. I'm just going into my trade log. You see if I can find something that's sucking wind. No, that's going well. That's going well. Is this okay? This might, nope, I'm out of there already.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 111,
      "start_timestamp": "01:11:55",
      "start_timestamp_seconds": 4315.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4315"
    }
  },
  {
    "text": "I can find something I'm trading right now so that we have a live example. I'm just going into my trade log. You see if I can find something that's sucking wind. No, that's going well. That's going well. Is this okay? This might, nope, I'm out of there already. This might be a good one. And yeah, so we can look at gold. So with something like this, this trade is going well so far. But right now I'm just long gold futures and I have no options against them. Now the way that I set up this trade is I essentially look in this case, I look for a breakout and I'm trying to trade the breakout. So as it's breaking out, I need to decide where do I think near term, and this is, let me take a giant step back, sorry, the way that I think about my portfolio is there's two buckets core allocation speculative allocation. This would be a speculative allocation. This is me taking a shot. This is me thinking I have some idea about what may or may not happen and I'm trying to quantify and then ideally monetize that idea. It's not something like my core allocation where I'm really trying to take advantage of core concepts like long term positive drift and equities and stuff like that. Okay, so in something like this, I'm going to start by thinking first about the portfolio level. What's a reasonable amount of risk",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 111,
      "start_timestamp": "01:13:02",
      "start_timestamp_seconds": 4382.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4382"
    }
  },
  {
    "text": "not something like my core allocation where I'm really trying to take advantage of core concepts like long term positive drift and equities and stuff like that. Okay, so in something like this, I'm going to start by thinking first about the portfolio level. What's a reasonable amount of risk to have on in a trade? We'll use a 100,000 portfolio. So you can start by determining what is the maximum amount of dollars you would be comfortable losing on any one individual trade. That's the starting point. So if I have 100,000, if I want to make it simple, I can do a 1,000 loss, I can do a 10,000 loss, which is kind of big. I can do a 5,000 loss, I can do 2,500 loss. You have to pick what's right for you and what aligns with your approach. Because for me, I have a lot of trades on at a given point in time. So I can't have a really big maximum loss. So say, for example, in that 100,000 portfolio, it's not uncommon for me to have anywhere from 50 to 100 trades on at a given point in time. So that already tells me that if I use something like a 10 stop, I'm so like I'm toast if there's some sort of really bad that is a really, really bad structure for that style. Now it's completely inverse. Let's say that I'm only trading five names or 10 names at a time. Now",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 111,
      "start_timestamp": "01:14:10",
      "start_timestamp_seconds": 4450.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4450"
    }
  },
  {
    "text": "that if I use something like a 10 stop, I'm so like I'm toast if there's some sort of really bad that is a really, really bad structure for that style. Now it's completely inverse. Let's say that I'm only trading five names or 10 names at a time. Now in order to get enough risk on for the portfolio to make sense, then maybe 10 actually starts to make sense. Again, I would argue that might be a little high, but it's reasonable. It's not outside the realm of possibility for that to make sense in that scenario. So it'll be entirely entirely dependent on your processes of trader and what you're trading. For me, I tend to find 5 or less is okay. And it's because there's a lot of uncorrelated returns and I will go over 5, but it's not always 5. So for example, let's use this example. If we have this trade and let's say we started trading it on this breakout right here, well, then I say, okay, well, where's near term resistance? I see near term resistance here, just judging off of the volume profile. I see nothing and then I see near term resistance down here and right below it. So maybe that's where I would want to put a stop. So more around 25, 23, something like that. And this would speculate in entry around 26, 15. So now if we take a look at the active futures and we look",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 111,
      "start_timestamp": "01:15:19",
      "start_timestamp_seconds": 4519.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4519"
    }
  },
  {
    "text": "term resistance down here and right below it. So maybe that's where I would want to put a stop. So more around 25, 23, something like that. And this would speculate in entry around 26, 15. So now if we take a look at the active futures and we look at a model trade, I'm in my pass through account. And we look at what the loss would be at 25, 23. If we go to analyze, we go to 25, 23, we can see that's a 15,000 loss. Wait too big for a 100,000 account for this kind of opportunity. Okay. So then what does that mean? Well, it means that I can go into a smaller product like MGC, same thing. I was trading this earlier and let's use that same scenario. So let's say, it'll be the same pricing. So 25, 23 I said, I think before, right there. And again, it's presuming an entry at 26, 15 or so. So let's take a look at this. Let's take a look at this, this, this. Now I have to adjust the price. 26, 15 I think I said was the entry. Something like that. Yeah, it's like 26, 15 for an entry using 25, 23 for the exit. So then down here, I can add another price slice. I can show 25, 23. And I can say, what's my loss there? It's 920 bucks on one mini. So then I say, okay, well, I'm actually okay losing",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 111,
      "start_timestamp": "01:16:28",
      "start_timestamp_seconds": 4588.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4588"
    }
  },
  {
    "text": "26, 15 for an entry using 25, 23 for the exit. So then down here, I can add another price slice. I can show 25, 23. And I can say, what's my loss there? It's 920 bucks on one mini. So then I say, okay, well, I'm actually okay losing 5 on the account on this one trade. So then that tells me I can lose up to 5 grand if we're using a 100,000 account. So now I can literally size this up until I get close to that number. So here I can put on 5 of those where if I look at 5 and I get stopped out at that level, then it's a 4,600 loss that falls within risk tolerance. Okay. So now it's sized about right now. I just need to look at probabilities. Right. So like, what's the probability? And again, this is using slightly hindsight. This is pretending that the entry was here. Because that's actually when I did enter. But it's now up here. So the probabilities will be different. So I'm not going to go through that exercise. But what I would do is at this point, I would check the probabilities of where I'm entering. What's the probability of me coming down here versus the probability of me having some sort of up move? If there's no reference, I create my own reference. So when I say no reference, I normally will go back as far as I can, right,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 111,
      "start_timestamp": "01:17:35",
      "start_timestamp_seconds": 4655.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4655"
    }
  },
  {
    "text": "probabilities of where I'm entering. What's the probability of me coming down here versus the probability of me having some sort of up move? If there's no reference, I create my own reference. So when I say no reference, I normally will go back as far as I can, right, to come up with an idea. But gold is hitting highs. So I don't have some sort of other reference. So actually what I like to do is look at prior moves before pauses. So like, for example, if I look at this move here, it went from 2420 and then it got up here and it closed at 2552. So 2420 to 2552. So about what 130 point move or something. So then I can use that as a reference. I can say, okay, I have no reference where I think this might go. But maybe I'll just use that previous model move and I'll say that it'll move 130 points or so. Okay. So then that takes me to 2750 or so. So now we're literally very close to that. That will become the planning factor. And then I calculate my expected return. That's the exact process. So for Sam, let me know if that answers your question. Roryntiti says, define max loss per trade or per day or doesn't matter per trade. I don't care about per day. Per day doesn't really matter. Any sort of time frame doesn't matter. So the way that I think about,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 111,
      "start_timestamp": "01:18:46",
      "start_timestamp_seconds": 4726.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4726"
    }
  },
  {
    "text": "for Sam, let me know if that answers your question. Roryntiti says, define max loss per trade or per day or doesn't matter per trade. I don't care about per day. Per day doesn't really matter. Any sort of time frame doesn't matter. So the way that I think about, and again, it's in that video up above. But the way that I think about defining risk is I have two risk defining functions. I have risk that's defined at the portfolio level called circuit breakers. And then I have risk that's defined at each individual trade level. So for me at this point, if I have like a 15 drawdown on the total portfolio, that's triggering a circuit breaker where I'm going to go in and I'm just going to start hacking and slashing stuff. Because it's telling me something's gone wrong. I don't know what, but something's definitely gone wrong. And I need to try to figure out what it is. So then that's exactly why I go through that process. So yeah, I think at the trade level, I just make sure each individual trade is sized logically for the size of the account. That's my approach there. Off-boons says so many big moves happen extended hours when options aren't trading. How to react to a bad overnight surprise. They don't actually happen that much. So one, I think it's important to understand the product that you're trading and the friction of the not the friction, understanding",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 111,
      "start_timestamp": "01:19:49",
      "start_timestamp_seconds": 4789.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4789"
    }
  },
  {
    "text": "there. Off-boons says so many big moves happen extended hours when options aren't trading. How to react to a bad overnight surprise. They don't actually happen that much. So one, I think it's important to understand the product that you're trading and the friction of the not the friction, understanding the product that you're trading and the frequency that it has different kinds of moves. Vladimir off-boons says SMCI happened. Yeah, I'm not saying that they don't happen. Again, people do this all the time. When I say something like it doesn't happen often, that does not equal. It doesn't happen. What I would return to you is that what happened in SMCI is rare. That's not very frequent. Now that goes back to sizing. And if you had a trade on an SMCI or something that you know is prone to move a bit, because like none of these gaps are bad, it's had some gaps. But none of these are like break your portfolio size gaps. Like the biggest gap that I see here over the last six months is what? This right here. So this closed at 547 and opened at 485. What is that? 547 to 485. 547 to 485 to 11 move. Like I'm not saying that that's small. That's a big move. It's a big overnight move. But that's not like break your portfolio size big, especially if you're sized well. So yeah, I mean in my opinion, I think the the boogie man",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 111,
      "start_timestamp": "01:20:58",
      "start_timestamp_seconds": 4858.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4858"
    }
  },
  {
    "text": "485. 547 to 485 to 11 move. Like I'm not saying that that's small. That's a big move. It's a big overnight move. But that's not like break your portfolio size big, especially if you're sized well. So yeah, I mean in my opinion, I think the the boogie man of overnight moves is really, really overdone by people. And they don't actually understand the math behind it and like the severity of it. But it does happen. Like you can have these big gaps. Like if you're fading SMCI here and you get ran over. But again, here's the other thing that you have to keep in mind is understanding the individual security that you're trading. If I look at the average five day range, I see 10.5 and then for a 20 day range, I see seven and a quarter. So this is daily range. If I added true range, which I can add right now really quick, it'll give me context right out of the gate about what may or may not make sense. So this is five and 20. Let's see what this shows me. I'm going to get rid of this. It's for the same time frames. So that's why I don't care. But I can use ATR to show me obviously the full range, including the reason why I was the same as because there is none of those gaps in that window. But yeah, so actually let's do this really quick. I'll add",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 111,
      "start_timestamp": "01:22:14",
      "start_timestamp_seconds": 4934.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=4934"
    }
  },
  {
    "text": "time frames. So that's why I don't care. But I can use ATR to show me obviously the full range, including the reason why I was the same as because there is none of those gaps in that window. But yeah, so actually let's do this really quick. I'll add the ATR. And then I'll change this so that rather than five and 20, we'll do just like 30 years. Vladimir Alpun says 10 for the underlining translates to a much bigger move for the options. Yeah, dog. Fucking welcome to options. Do not again, don't understand the point. If the points that options have leverage, then I completely agree with you options absolutely have leverage. Let's do like a five day ATR and then let's do like a 90 day ATR. And then I need to change that label just for a context. Yo, this thing is so slow. I think I have like too many indicators and things scripts open, so it always freezes up. This is going to be 90 days now. And then I'll slide this next to the other one for context. Make it nuclear yellow. And then drop that up there. Bingo. So I can see as I look at this, I'm like, okay, the average range that I see here is again, for the day, I'm seeing pretty significant moves. And then this is plotting the high and the lows that it hit over those periods in case you're wondering. But Alpun says",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 111,
      "start_timestamp": "01:23:34",
      "start_timestamp_seconds": 5014.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5014"
    }
  },
  {
    "text": "can see as I look at this, I'm like, okay, the average range that I see here is again, for the day, I'm seeing pretty significant moves. And then this is plotting the high and the lows that it hit over those periods in case you're wondering. But Alpun says the question is how to counter that big move size the trade well. So let's literally look at the example. So let's look at SMCI. We'll go back in time. And then we'll see. Like, let's go through the sizing process. What did we do? We looked at this one here. Is that correct? Or was it, which one would we look at? Remember, I think we did this one. So let's go back to 27 aug. And let's look at it together. So it's a really good question. But I think your fears will be abated. We have to go back up to 2024. And I said, what is it August 27th? Something like that. And in this case, we know we get ran over to the downside. So the first thing, straight from the jump, I'm not trading this bullish. Right. I'm not trying to trade this to the upside. That's all there is to it. However, let's just say for the sake of the examples so that we could put the trade on together, that we were feeling really silly and chose to do that. But reinforcing that it's literally a straight up terrible idea. There's no",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 111,
      "start_timestamp": "01:25:16",
      "start_timestamp_seconds": 5116.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5116"
    }
  },
  {
    "text": "the upside. That's all there is to it. However, let's just say for the sake of the examples so that we could put the trade on together, that we were feeling really silly and chose to do that. But reinforcing that it's literally a straight up terrible idea. There's no reason to be bullish in this right here. You can see essentially what it looks like. So now the first thing I see is analyzing the ranges, the five day average daily range, six and a half percent. And then I see seven point nine seven percent. And then average true range. I see six point nine and 10 point eight percent. So this is giving me a bit of a heads up right from the jump. I got to open the door real quick. I need time. I do that. That's because Thor is either looking to enter or exit the office. In this case, it was an exit. So now here we go 10.8 percent average true range. So the first thing that I see here is that I'm looking at something that's actually quite gappy. Right. And again, this is objective. I can see it. So when I think about how I'm going to set my risk control metrics, that's going to matter a lot. Again, there's no way looking at this that I would go long, but I have to play along with the scenario. So the next thing I do is I try to find",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 111,
      "start_timestamp": "01:26:48",
      "start_timestamp_seconds": 5208.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5208"
    }
  },
  {
    "text": "I think about how I'm going to set my risk control metrics, that's going to matter a lot. Again, there's no way looking at this that I would go long, but I have to play along with the scenario. So the next thing I do is I try to find where I see potential support and resistance. I look at this handle here, right. So where we're trading right now, I'm reluctantly going to I'm reluctantly going to make a bullish trade. And I'm going to say I would have to expect us to retrace down to this. So maybe my thought process is once it gets down to this 495 handle, maybe I think it's going to rally and bounce up and on Eric or Eric. I just saw Ryan Osay Eric, hope you had a great week. Thank you so much. I did have a good week. I got some shots in my back yesterday, which is very fun. But I have to keep reiterating there's no chance. I would put this trade on literally no chance because the first thing I would do is wait and see how it consolidates around this level. Okay, that aside, I think I've made that disclaimer loud and clear. Where do I see it going after that? Here's here's what I see again from an objective analysis standpoint. You saw me do this on other tickers. This isn't overfitting for a back test. This is me saying where do I see",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 111,
      "start_timestamp": "01:28:13",
      "start_timestamp_seconds": 5293.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5293"
    }
  },
  {
    "text": "think I've made that disclaimer loud and clear. Where do I see it going after that? Here's here's what I see again from an objective analysis standpoint. You saw me do this on other tickers. This isn't overfitting for a back test. This is me saying where do I see support at the next level? The next volume node I see is here at 425 and that's a weak volume node, but it is a volume node. I wouldn't want to take it all the way down here to the point of control. It's way too big of a move. So then that becomes my next area that I might expect to get stopped out. Okay, so now let's say that I again am fucking crazy and want to buy options. I wouldn't want to do this. But if I did, I would come in here and I would say I want to buy calls that are probably like a 70 delta, something like that. I will get into these calls for 120 bucks. Now what I need to do is analyze what I think my risk again, we're using a proverbial 100,000 account. Roy and Titi says why not buy puts. Roy, T, come on girl, you know what we're doing? We're trying to analyze this scenario of getting ran over with options. So if I buy puts, it would help me in this scenario. We know it gaps down. So yeah, that would be much more close to",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 111,
      "start_timestamp": "01:29:18",
      "start_timestamp_seconds": 5358.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5358"
    }
  },
  {
    "text": "buy puts. Roy, T, come on girl, you know what we're doing? We're trying to analyze this scenario of getting ran over with options. So if I buy puts, it would help me in this scenario. We know it gaps down. So yeah, that would be much more close to what I would choose to do. But yeah, that's why we wouldn't buy puts is because off-poon's kind of question, which is a fair question, is how do we do, like how do we deal with down moves? And I'm kind of working through this step by step gaps because the first thing I'm showing is how I find the different levels that I'm going to factor or trade around. So again, in this case, I look at the fact that over the last 90 days, the average true range is about 11. So I have to be thinking of about an 11 move. Then I can see what kind of range that price that places price movement out, which is about 60 points. Ish. So now I'm saying, where do I think it might go to and where's my planning factor? So my planning factor for the downside if I'm wrong on these long calls would be about 42.55. That's where I see the next area of support, again, which is going out a year and pinning off of this volume node. And it's not a discrete number. It's like something pretty close. It just happens to be 45",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 111,
      "start_timestamp": "01:30:21",
      "start_timestamp_seconds": 5421.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5421"
    }
  },
  {
    "text": "I'm wrong on these long calls would be about 42.55. That's where I see the next area of support, again, which is going out a year and pinning off of this volume node. And it's not a discrete number. It's like something pretty close. It just happens to be 45 and a half. Okay. So now I have to see at that handle, what would the loss be at 425 55, which is way over here, it would be about in eight grand loss. So if I'm trading a 100,000 account for me personally, this would be a pass because it's already too big for what I'm trying to put on. Now I have a couple choices. I could come back in, again, to try to force fit the scenario. I can look at maybe the 80 DTE come into something that's like a 70 and see if I can size this so that it makes sense. Get rid of that. And then I can look at that 425 handle and it's a great yeah. So for me, I literally would be, it would be, I would be priced out of the trade. But since we're here, let's just take a look at the example. So the first warning sign is being bullish on something going down, stupid. The second warning sign is my, the way that I fit trades literally naturally keeps me out of this trade. If I blow past both of those bright warning signs and choose",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 111,
      "start_timestamp": "01:31:44",
      "start_timestamp_seconds": 5504.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5504"
    }
  },
  {
    "text": "a look at the example. So the first warning sign is being bullish on something going down, stupid. The second warning sign is my, the way that I fit trades literally naturally keeps me out of this trade. If I blow past both of those bright warning signs and choose to put the trade on anyways, let's see what this looks like. So using that 425 handle, I would expect to have my loss capped at about eight grand. Now I know definitively my risk is controlled at 11,000. I cannot lose more than 11,000 because I'm buying a so that's already the case. My max risk as defined is done. I've already sized this at max size and again, I know I can't lose more than that. But for the planning factor for the example, I'm thinking, okay, I want to go off of, I gotta get that out of the way. I want to go off of where I think my stop is. So I'm going to throw this in here, throw my stop in, which is going to be 42550. Right there. And that puts me at not a 16 because there's two and 8400 I'll loss. That's how much I think I'm going to lose. Okay. So now let's fast forward time. And then let's go into the morning because that's where I would be looking at this. And the gap down is to 520. That's where the gap started. So now if I go into",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 111,
      "start_timestamp": "01:32:53",
      "start_timestamp_seconds": 5573.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5573"
    }
  },
  {
    "text": "That's how much I think I'm going to lose. Okay. So now let's fast forward time. And then let's go into the morning because that's where I would be looking at this. And the gap down is to 520. That's where the gap started. So now if I go into the analyze and I see how I'm doing here at 520, which is a 5 decline, I lose 3400 bucks. That would actually be closer to the max loss I would want to take on the kind of trade. But anyways, so it's a 2,000 loss. This is extra criteria. Just exit the trade. I could wait a little bit if I wanted to see if it would eventually consolidate against this. Again, let's play the scenario out. But the first thing I'm showing you is the sizing protocols that I already did. They even with that gap, I'm okay. It's like we're doing okay here. It's not ideal, but we're not blown out and we're down a few thousand dollars. So now let's continue the scenario though. Roryntady says, do you do you cut your losses before they reach your stop? It is context dependent for sure. In this kind of case, I would realize that I'm a colossal fool for putting on a trade here. There's no chance I would have put a long trade on here. And then seeing it gap down, I would have been like, oh shit, that's right. I forgot. I wouldn't do this",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 111,
      "start_timestamp": "01:34:16",
      "start_timestamp_seconds": 5656.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5656"
    }
  },
  {
    "text": "kind of case, I would realize that I'm a colossal fool for putting on a trade here. There's no chance I would have put a long trade on here. And then seeing it gap down, I would have been like, oh shit, that's right. I forgot. I wouldn't do this in the first place. So yeah, in this case, it's coming down right away. Now again, to play this scenario out from the other perspective, adopting that, let's say we're like, okay, well, I really think this 495 handle is going to be my support. So let's see how it does tracking towards that 495 handle. I'm going to fast forward two hours. We'll go to 842 and see how it does. Okay. So it touched down to it came back up. Again, if I'm playing this scenario realistically, I would have not freaked out about that. That would have been okay. And I would I would genuinely continue to let it ride here. Now realistically, again, would have been out already. But well, I would have never put the trade on. I don't know if I've mentioned that yet. I don't know if you could tell how reluctant I am with this because I think it's putting on bad trades is just so silly. But let's continue. Let's go another two hours and see what materializes. This off-poon says, I held it some C.I. calls, but the move, oh, sorry, I just realized sorry, dude, I am not trying",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 111,
      "start_timestamp": "01:35:33",
      "start_timestamp_seconds": 5733.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5733"
    }
  },
  {
    "text": "am with this because I think it's putting on bad trades is just so silly. But let's continue. Let's go another two hours and see what materializes. This off-poon says, I held it some C.I. calls, but the move, oh, sorry, I just realized sorry, dude, I am not trying to paint this as if like you've like you're dumb. Like I was saying I'm done in this scenario. I want to be super clear. I'm really not trying to pick on like this at all in the context of you. I'm just talking about this opportunity. I don't want you to feel like you have to defend or that this is about. It's really not. I'm just talking about the prospect of managing gaps. So is the gap the next day? Is that what's going on here? There, no, there's no gap there. Where's the gap? Line the gap. The 27th into the 28th. This doesn't show the gap. Maybe I'll do it like first thing in the morning. There we go. 456. So I have 456. It's still it's still within tolerance. It's not good, but that gap down still doesn't kill us. So the whole point here is sizing the trade. Sizing the trade entirely takes care of all of it. That's the point. So the way that we deal with gaps is by sizing the trade well. That's what it is entirely. Because even in this case where we deal with a couple gaps, we're still",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 111,
      "start_timestamp": "01:36:37",
      "start_timestamp_seconds": 5797.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5797"
    }
  },
  {
    "text": "is sizing the trade. Sizing the trade entirely takes care of all of it. That's the point. So the way that we deal with gaps is by sizing the trade well. That's what it is entirely. Because even in this case where we deal with a couple gaps, we're still we still live to fight another day. It's still okay. So yeah, it's a great question. But what I find is if you look at the numbers on it a little bit and you actually become familiar with them, you'll find that people talk about the the boogie man of gaps and they're not that bad. Sometimes they are. I think somebody talked about a 33 down. Yeah, in Intel. But that's an earnings play, right? So if we go to Intel and we look at this gap again, at what point in this kind of thing, we were like, oh, I should be long Intel. Right? Like there's nothing about this that tells me I should be long Intel at all. If I look at its past earnings, gap down, gap down. Right? So again, this is one of those things that is completely, completely preventable by even the smallest monochrome of research. It's entirely preventable. There's no reason to get right over here. So yeah, earnings in and of itself are really, really tricky. But yeah, I think this shouldn't surprise anybody. Like there's nothing surprising about this. Cool. Let's keep flying through these. This next one says,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 111,
      "start_timestamp": "01:37:55",
      "start_timestamp_seconds": 5875.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5875"
    }
  },
  {
    "text": "smallest monochrome of research. It's entirely preventable. There's no reason to get right over here. So yeah, earnings in and of itself are really, really tricky. But yeah, I think this shouldn't surprise anybody. Like there's nothing surprising about this. Cool. Let's keep flying through these. This next one says, looking back, what would you have done differently in your first few years of trading? Focus more on the process. I think focus, focus more on the process and focus less on trying to grow my small account into a bunch of money. I think that is hands down the biggest components. And then I'll flip through these next two. We'll do the strategy development section and then I'll pause this and then we can just talk about whatever else you guys want. This one says at what point did you realize you needed to specialize in a particular strategy or asset class and how did you choose it? I didn't do this. This is actually kind of the antithesis of how I trade. So the, I guess it's actually funny because I actually felt like I did the opposite. And I didn't specialize. I just realized I need to see if. Colonel ordered. Can you grab me? Mango orange. I gotta get a refill on my sorter water. So yeah, the way that I looked at it actually was by not honing in on a specific strategy. By picking a basket of strategies. And again, you can see the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 111,
      "start_timestamp": "01:39:27",
      "start_timestamp_seconds": 5967.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=5967"
    }
  },
  {
    "text": "see if. Colonel ordered. Can you grab me? Mango orange. I gotta get a refill on my sorter water. So yeah, the way that I looked at it actually was by not honing in on a specific strategy. By picking a basket of strategies. And again, you can see the strategies that I run. I'm very, very open about all of them. There's no secrets to what I do. There are a handful of things. It's ratio diagonals, call or put, covered strangles. Ratio covered calls sometimes typically not. I would be part of this. But sometimes straddles, strangles, single options. That's literally the overwhelming. That's essentially all I do. Sometimes I'll do verticals very rarely. But yeah, I mean, the way I look at this is kind of the inverse where my job is to try to find things that are moving. Roy Titty says, what do people call, what do most people call ratio diagonals? Well, they would call it a diagonal. But most people don't do the ratio. Roy Titty says, you know, the wrong term so I can follow along with it. Oh, a poor man's covered call. I don't know if they call it a poor man's covered put. They probably would. But yeah, the the wrong term is a poor man's covered call. That's hilarious because you know, you know, I hate those. I hate those terms so much. But you make me say it, but I will do it for you. Roy Titty,",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 111,
      "start_timestamp": "01:40:57",
      "start_timestamp_seconds": 6057.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6057"
    }
  },
  {
    "text": "poor man's covered put. They probably would. But yeah, the the wrong term is a poor man's covered call. That's hilarious because you know, you know, I hate those. I hate those terms so much. But you make me say it, but I will do it for you. Roy Titty, you know that. But yeah, that would be a ratio call diagonal ratio put diagonal. I think stick into the right terms is the way to go. But yeah, does that make sense at least for for this question, which is like I act, I really do think the the aspect of not specializing in a specific strategy and not specifically picking like a one asset class, I want the mobility of looking around and finding things that look interesting, finding things that offer opportunities that again, I can exploit. And it's by not being like super locked in. Roy Titty says, I respect you, but why don't you buy a ton of the mango orange seltzer waters? I literally have a ton right now. I know I'm asking for a refill from my wife, so I don't have to step away, but she might be working. So I might have to go grab it. But yeah, I have I bulk by them. I have tons. I don't run out of stuff. So yeah, it's kind of like part, part and parcel. Jonathan says, did you revisit unity yet? I may have missed it. No, we haven't looked at really",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 111,
      "start_timestamp": "01:42:34",
      "start_timestamp_seconds": 6154.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6154"
    }
  },
  {
    "text": "have to go grab it. But yeah, I have I bulk by them. I have tons. I don't run out of stuff. So yeah, it's kind of like part, part and parcel. Jonathan says, did you revisit unity yet? I may have missed it. No, we haven't looked at really any individual names. We've been just talking more about fundamentals of trading and I think we talked a little bit about my personality type because that came up. I took a test. But yeah. Joey says, how about specializing in certain profit mechanisms? That didn't happen. Like I didn't even think about classifying them as profit mechanisms until like I had been trading for over a decade. Easy. Yeah, because I never even looked at this stuff before then. I had ideas about movement, but I've never gotten to like the really specific elements of profit mechanisms, the subcategories. Like I would have been a decade into trading deep before I started thinking about that. And I think that's mostly because I think it's mostly because I didn't know and like nobody taught me that. So it didn't really occur to me to think of it that way, I think. So I probably didn't think about profit mechanisms and sub mechanisms or subcategories the way that I do now. But I would say that I definitely thought about specializing in like these concepts, meaning trading directionally up and down and then trading volatility in these different manners. Like that I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 111,
      "start_timestamp": "01:43:44",
      "start_timestamp_seconds": 6224.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6224"
    }
  },
  {
    "text": "So I probably didn't think about profit mechanisms and sub mechanisms or subcategories the way that I do now. But I would say that I definitely thought about specializing in like these concepts, meaning trading directionally up and down and then trading volatility in these different manners. Like that I knew I was doing. And to do that, I did spend time trying to figure out like the qualities of movements, but I don't think I had it down to anywhere near the science that I do now. Whereas for me, I can look at a chart quickly classify the kind of movement and then I already have a massive repository of data in my mind about how this thing is more likely to move and then I can fit something to it. It definitely was not always like that. So yeah, Joey, let me know if that answers your question because I know it's a little bit of a non-answer, but it is the truth. Like in the beginning, I didn't even think about the way I think about profit mechanisms and characterizations like I do now. And especially anybody that's in like the mentoring program, when we go through different profit mechanisms, like you can tell like I literally have a fucking template essentially that we fill in about understanding in depth specific profit mechanisms. That's not something I thought of for probably the first half of my trade and career. It's something that I think I indirectly",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 111,
      "start_timestamp": "01:45:09",
      "start_timestamp_seconds": 6309.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6309"
    }
  },
  {
    "text": "through different profit mechanisms, like you can tell like I literally have a fucking template essentially that we fill in about understanding in depth specific profit mechanisms. That's not something I thought of for probably the first half of my trade and career. It's something that I think I indirectly had it's like captured and started to tinker with because again, like I definitely knew about these traits, but I didn't get into the habit of fingerprinting them like I do now. And having like really, really solid understandings of the specific behaviors that's quantified. That's a big thing is I don't really rely on my ability to just look at it and see it. It's very much how can I put numbers behind this so that I can then make good probabilistic assessments. And this goes back to even the gold trade that I have on because when I first put on this gold trade, the probabilities, it was literally partially negatively expected when I entered the trade because the neutral density probabilities that it gave me were very high for me getting stopped out compared to where I thought it might go using that 130 point mover, whatever. So, but I kind of I kind of knew differently from the neutral density. I didn't take that. I took it under advisement, right? Like I understood that the probability of as it was being plotted in the way that the options markets were plotting things, but I absolutely expected",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 111,
      "start_timestamp": "01:46:27",
      "start_timestamp_seconds": 6387.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6387"
    }
  },
  {
    "text": "So, but I kind of I kind of knew differently from the neutral density. I didn't take that. I took it under advisement, right? Like I understood that the probability of as it was being plotted in the way that the options markets were plotting things, but I absolutely expected there to be a bit of momentum and drift, which fortunately did materialize here. So there's a little bit of nuance there. The next question here is, wait, let me go back to your guys. Roin Titty says, did you start trading with margin? I'm resistant to trade with margin. Well, just make sure you understand the difference between with margin and on margin. I don't borrow any money. Yeah, I don't borrow any money with respect to margin. So as I'm looking at, like for example, if I went through and I wanted to buy gold, if I buy a call, I'm trading with margin, right? So like, I have access to margin. I have access to the leverage, but I'm not on margin. I'm not borrowing money for the position. So I don't think there's a reason to borrow money. The way to think about that Roin Titty is essentially margin is fine. Margin is what you naturally gain access to when you trade options. You're not borrowing. You don't owe anything. You owe money, meaning you're borrowing money and you have to pay interest. When your cash and sweep goes to zero, that's when you're now borrowing",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 111,
      "start_timestamp": "01:47:37",
      "start_timestamp_seconds": 6457.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6457"
    }
  },
  {
    "text": "is essentially margin is fine. Margin is what you naturally gain access to when you trade options. You're not borrowing. You don't owe anything. You owe money, meaning you're borrowing money and you have to pay interest. When your cash and sweep goes to zero, that's when you're now borrowing money. So I don't do that. I don't see a reason to do that. I know people are happy doing that, but it is absolutely not my not my approach at all. I don't borrow. Joey says I was thinking it's better to specialize in surf and profit mechanisms over certain strategy. Yes, a class. Yeah, I agree. I totally agree. I think when it comes to things like profit mechanisms, I think you like at least if it were me, I would be trying to focus on the highest probability stuff first and then starting to get more specific from there. So like, again, I think that I use all the time in the mentoring sessions with people is new traders will have all different kinds of numbers that they think they want to hit. Like, oh, I want a 25 return or I want an 18 return. But then as soon as we start going through the actual track record, we might be lucky if we're not negative. So it's like, we're focusing on the wrong thing to start. I think it's much easier to use some sort of benchmark as the starting point. Buy and hold. That's",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 111,
      "start_timestamp": "01:48:53",
      "start_timestamp_seconds": 6533.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6533"
    }
  },
  {
    "text": "then as soon as we start going through the actual track record, we might be lucky if we're not negative. So it's like, we're focusing on the wrong thing to start. I think it's much easier to use some sort of benchmark as the starting point. Buy and hold. That's an easy benchmark to use that it's a 100 beta no alpha return. Okay. Then if we can optimize that buy and hold approach slightly and get a slightly better return, now we're introducing at least an element of alpha over the market. Cool. That's the very first step it takes to start beating the market. Most people want to skip past that whole process and immediately get into the idea of making 15 per year every year without fail. And it's a low probability way to go about that. So I think the idea of starting with profit mechanisms is super logical. And you don't need that many of them. So for me, you again, you can see on you can see on this, what I tend to focus on, which is about as simple as possible. So I'm looking at things like trend momentum, breakouts, breakdowns, and drift. That's directionally generally what I'm looking at. For volatility, I'm looking for risk premium, mean reversion, skew, mispricings, sometimes less so on mispricings if I'm being honest because they're kind of hard to come across, but still keep my eyes out for those. Those are really the core of the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 111,
      "start_timestamp": "01:50:09",
      "start_timestamp_seconds": 6609.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6609"
    }
  },
  {
    "text": "That's directionally generally what I'm looking at. For volatility, I'm looking for risk premium, mean reversion, skew, mispricings, sometimes less so on mispricings if I'm being honest because they're kind of hard to come across, but still keep my eyes out for those. Those are really the core of the profit mechanisms that I focus on. So yeah. Make these says, can we to join them? Mentoring, just waiting to master the basics of options trading, even though I've been trading futures and forks for 15 years. Yeah, that's awesome. Literally whenever you're ready. I have people that I work with that literally are brand new and I have people, I have a couple of people that I work with that I've actually been trading longer than I have. The main thing is just for anybody that wants to do the mentoring stuff, it's like you have to know what you're trying to accomplish and then my job is to help you accomplish that. That's the way I look at it. So even if it's a beginner trying to learn options, my job for that person is to get them to learn options as efficiently as humanly possible. But I think the most important thing is having like, and I do this with most people in the beginning, which is workout like really clear objectives for what we're trying to accomplish. And I think that that's just massively important so that it is a good use of time because I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 111,
      "start_timestamp": "01:51:29",
      "start_timestamp_seconds": 6689.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6689"
    }
  },
  {
    "text": "think the most important thing is having like, and I do this with most people in the beginning, which is workout like really clear objectives for what we're trying to accomplish. And I think that that's just massively important so that it is a good use of time because I always try to pack the time as much as, even just like these live streams, I try to get as much information into the smallest amount of time as possible. Zacharias says, can you define that terminology? Could you let me know what it was? Sorry. If you let me know what terminology I was using. Reese says, where do you think it'd be if you started on Robinhood? There's no chance. I would have started on Robinhood. I hate Robinhood. Any opportunity I have to talk shit and to just express my hatred for Robinhood, I'm always down for that. Robinhood is literally straight trash. Let me show you Robinhood. Let me see really quick. Here we go. You should read this study. This is one of many because Robinhood is trash. But this talks about essentially their terrible fills. So yeah, they're garbage. I hate them. Zacharias says borrowed versus mechanism. Sorry, I'm not totally following. Are you talking about profit mechanism and then give me one second. I need to go get a refill. Okay. All right. We are back at it. And Zacharias says margins. I see. Yeah, yeah, yeah. So let's talk about margin, because",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 111,
      "start_timestamp": "01:52:39",
      "start_timestamp_seconds": 6759.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6759"
    }
  },
  {
    "text": "borrowed versus mechanism. Sorry, I'm not totally following. Are you talking about profit mechanism and then give me one second. I need to go get a refill. Okay. All right. We are back at it. And Zacharias says margins. I see. Yeah, yeah, yeah. So let's talk about margin, because I think it's a good example. So there's a difference between trading with margin versus trading on margin. I actually think I have a video, probably an old video about this. So this video is about portfolio margin. And then I think in my options 101, I talk about margin. So here's the way to think about it. When you're trading options, you're trading with margin. So you essentially gain access to leverage. That's all it is. So let's look at an example. If I want to, let's do APLD. I saw somebody pop that in before. So if we look at APLD and we want to buy a call, this call costs us 175. If that 175, you're gaining access to 700 worth of stock. So here you are still trading with margin. The margin that's provided to you is via the leverage. So in a buying scenario, it's essentially relegated to whatever you choose to buy it for. That's going to be the margin. Now, let's say I want to instead to sell a putt. This would be a 55 putt that I get. If I analyze this, you'll see that there's a margin requirement. And again, this",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 111,
      "start_timestamp": "01:54:17",
      "start_timestamp_seconds": 6857.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=6857"
    }
  },
  {
    "text": "essentially relegated to whatever you choose to buy it for. That's going to be the margin. Now, let's say I want to instead to sell a putt. This would be a 55 putt that I get. If I analyze this, you'll see that there's a margin requirement. And again, this is a pass through. This is using an IRA pass through account. So this one is going to be cash secured. It's not regulation T. But what I'm showing you is it's showing you how much money it wants you to set aside. But you're not borrowing that money. There's no loan. There's no interest that you have to pay. This is just the amount of money that your broker is saying I want you to set this aside. That's it. Then there's trading on margin. On margin is let's say I have that 100,000 account. And let's say for whatever reason I wanted to get 10,000 of these. So in this case, I would be exceeding the overall value of the account. However, the broker would, if you're trading in a margin account, would extend you a certain amount of money that you can borrow in excess of your available resources. So when you're trading options normally, buying options, selling options, you're trading with margin, but not on margin. And you then run through all of the money in your cash and sweep. And that's zeroed out. That means you've used all of your available capital. And now the",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 111,
      "start_timestamp": "01:57:23",
      "start_timestamp_seconds": 7043.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7043"
    }
  },
  {
    "text": "available resources. So when you're trading options normally, buying options, selling options, you're trading with margin, but not on margin. And you then run through all of the money in your cash and sweep. And that's zeroed out. That means you've used all of your available capital. And now the broker is lending you money to put on new trades. So the easiest way to think about it is as long as your cash and sweep is not zero, you're not borrowing money yet. So yeah, let me know if that makes sense. Rointitys says, sorry, I'm confused, you trade with the margin account, but you don't trade on margin. That's correct. That's exactly correct. So now, even once you have a certain size account, I forgot what it is. I don't know if it's 125,000 or 150,000 or whatever. But you can get what's called portfolio margin, which actually gives you even better rates in terms of if I wanted to borrow, but then also in terms of what they require and what they set aside for you. Because regulation T by its design is highly, highly, highly conservative. And if you don't want to deal with that overly conservative margin requirement, then you can use portfolio margin, which would ask for even less. So for example, in this IRA account, it won't show us. But when I tried to sell that put, the margin requirement was 700. If I had a regulation T account, if one of you",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 111,
      "start_timestamp": "01:58:41",
      "start_timestamp_seconds": 7121.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7121"
    }
  },
  {
    "text": "conservative margin requirement, then you can use portfolio margin, which would ask for even less. So for example, in this IRA account, it won't show us. But when I tried to sell that put, the margin requirement was 700. If I had a regulation T account, if one of you guys do you guys could tell me what it would cost to sell that put, but it would be much less from that 700. It'd probably be maybe 100 and something dollars or maybe 200. I'm not sure. But then with the portfolio margin account, it would be even less than the regulation T requirement. So I can tell you exactly what it would be with the portfolio margin account. Give me one sec. I'll log in and I will tell you. And what we're looking at, APLD 21 7 put. Give me one sec. APLD. Let's take a look at the options chain. 21 days. The 7 put. Come on, just tell this. So the, oh, that's actually really fascinating. So the margin requirement on, well, it's a good example. But the margin requirement, even with portfolio margin, is 645, really, really high margin. So that's an example of something that's like, oh, I see, because I'm still in the wrong account. That's my bad. Yeah. Joey says 125 bucks. Yeah. Okay. So that makes sense. Thank you, Joey. Yeah. So essentially, the margin requirement in those different accounts will be very different because of the sizing is required.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 111,
      "start_timestamp": "02:00:05",
      "start_timestamp_seconds": 7205.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7205"
    }
  },
  {
    "text": "something that's like, oh, I see, because I'm still in the wrong account. That's my bad. Yeah. Joey says 125 bucks. Yeah. Okay. So that makes sense. Thank you, Joey. Yeah. So essentially, the margin requirement in those different accounts will be very different because of the sizing is required. Growing Titi says, and they were letting my shares, even though I opted out. So now I won't use margin account. Um, yeah. I mean, you could do that. I, I'm an options trader. So margin is just a force multiplier for me. It's something that I like. But if it's not something that you want, then yeah, there's no reason. Off Putin says, you often look at a chart of the underlying, but you ever use toss to look at the chart of individual options for me. It's a very nice tool. Not really. It doesn't matter to me. I do it really when I'm investigating stuff for if I'm conducting research with like trades, people have said that they made or whatever. But I don't really bother looking at the chart of options because the other thing is the chart of options is, is not super telling because of the way that it's reported. So yeah, I mean, it could be cool, but otherwise not so much. Okay, cool. And let me look at the next couple here and then we'll just kind of bullshit for a little bit longer and then I'll wrap up. Um, can you",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 111,
      "start_timestamp": "02:01:36",
      "start_timestamp_seconds": 7296.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7296"
    }
  },
  {
    "text": "of the way that it's reported. So yeah, I mean, it could be cool, but otherwise not so much. Okay, cool. And let me look at the next couple here and then we'll just kind of bullshit for a little bit longer and then I'll wrap up. Um, can you walk us through a strategy? That didn't work out in how you adopted it after realizing it wasn't profitable. There's one that comes straight to the front of my mind. Can any of you guess what it might be? Because this one, it just slams. Slams home. Spreads. That's exactly right. 100 correct. It was spreads. So I was trading vertical spreads for years and I had decent win rates. Overall, I thought vertical spreads were like pretty solid. And then I was going back through my trading log realizing that I was, I was trading a lot. And I noticed that the biggest issue I had with spreads is I actually had a pretty good win rate. But the issue was the losing trades were too big and they would take out too many winners. And it becomes a massive, massive headache. So I found after trading them literally for several years that they looked better than they actually do. And it was misleading because I didn't know to look for it because I had been winning like pretty regularly. Like Dices, do you have a video on search mechanism to finding trades? Yeah. So that one's about like",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 111,
      "start_timestamp": "02:02:43",
      "start_timestamp_seconds": 7363.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7363"
    }
  },
  {
    "text": "for several years that they looked better than they actually do. And it was misleading because I didn't know to look for it because I had been winning like pretty regularly. Like Dices, do you have a video on search mechanism to finding trades? Yeah. So that one's about like building strategy is like the basis. And then this video is about scanning for options trades. Definitely. It's a big part of the process, especially to do it very efficiently. Zacharias says an example of spreads. Sure. Let's take a look. So APLD, let's say instead of buy or let's say instead of just selling this put, we sell the put and we buy the put and we come up with a spread. Now the funny thing is that at this configuration, if I was actually able to get 35 cents, this would be a really good spread. I would do that spread. You're unlikely to get a fill here. That's why it's a 10 cent wide spread like you probably get 30 if you're lucky. So this, this is a vertical spread. So vertical spreads are super inefficient in the sense that if you're right, you stand to make very little money. They're highly efficient in that they take up very little amount of money. So if we look at the margin requirement for this trade as compared to, so if you remember, even in the IRA, if you remember selling the put by itself, we had to put",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 111,
      "start_timestamp": "02:04:16",
      "start_timestamp_seconds": 7456.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7456"
    }
  },
  {
    "text": "very little money. They're highly efficient in that they take up very little amount of money. So if we look at the margin requirement for this trade as compared to, so if you remember, even in the IRA, if you remember selling the put by itself, we had to put up 700. Here you only have to put up 100 bucks. So it gives you a massive, massive, massive buffer. The problem is that if I am directionally correct, let's say I go through all my research, I get all my ducks on a row and everything looks good, well, I can only make 30 bucks. So that's the downside with vertical spreads, especially small vertical spreads is that you literally just can't make decent money with them because of like quite literally their very structure, which is one of the annoying parts for it in my opinion. Because otherwise, I mean, it looks really, really good, right? Because it essentially balances everything. It can be a high probability trade. It can be defined risk, which is awesome. And yeah, that's really the main problem that you're going to run into with it though, is that they don't tend to work well long term. So they're misleading. Zachary says just a little return for the labor. Well, it's not just the fact that it's a little return that definitely is part of it, but the other part of it is again, I'm risking 70 to make 30. So that's a",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 111,
      "start_timestamp": "02:05:52",
      "start_timestamp_seconds": 7552.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7552"
    }
  },
  {
    "text": "work well long term. So they're misleading. Zachary says just a little return for the labor. Well, it's not just the fact that it's a little return that definitely is part of it, but the other part of it is again, I'm risking 70 to make 30. So that's a problem because even if I'm right several times, if I'm wrong once, then I've undone several winning trades. And then you also add the issue with friction. You're going to pile up fees because there's more legs. If I want to get in, I have two legs I have to pay for. If I want to get out, I have two legs I have to pay for. Oh, and don't forget, what is it? What are the average option commissions right now? I don't even know. I'm going to ask Chachapetit. What is the average option mission? It's 50. It says between 50 and 1. So let's use 50. Let's keep it. Let's keep it mellow. So in order to put up the trade, I'm going to give up a dollar and my max profit is 30. So right out of the jump, it's a 3.3 drag right out of the jump. Just to get into the trade, 3.3 gone. 30 bucks, you just give up a dollar. Now the max you can get is 29. Just before you apply any management, if you do not take it all the way to expiration, which is not smart, you have another",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 111,
      "start_timestamp": "02:07:16",
      "start_timestamp_seconds": 7636.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7636"
    }
  },
  {
    "text": "the jump. Just to get into the trade, 3.3 gone. 30 bucks, you just give up a dollar. Now the max you can get is 29. Just before you apply any management, if you do not take it all the way to expiration, which is not smart, you have another dollar that you're going to give up. So then as you give up that other dollar, now you're literally adding over 6 drag, almost 7 drag to your to your trade. And there's not that much to give up. So that's the big problem with spreads as far as I see it. How do you handle the balance between risk management and maximizing profit? Well we already talked about risk management. That's pretty easy. And then maximizing profit is also easy. It's typically following trades. So if I hit a profit target of sorts, so for example, if we go back to this gold trade, like if I hit that, you know, target that I had, I don't automatically get out. I just move my stop up incrementally. So essentially the initial stop goes there, then we start to rally up and out, second stop goes there. If it starts basing here and then goes up, then the stop goes up to here and so on and so forth. So I don't just get out. I essentially ride the movement up as far as I can. I tend to choke things a little bit, especially as they get ran up.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 111,
      "start_timestamp": "02:08:30",
      "start_timestamp_seconds": 7710.14,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7710"
    }
  },
  {
    "text": "basing here and then goes up, then the stop goes up to here and so on and so forth. So I don't just get out. I essentially ride the movement up as far as I can. I tend to choke things a little bit, especially as they get ran up. I don't want to let it turn into a losing trade or give up too many of the profits that I've accumulated because the way that I trade is I'm always happy to get right back in. And that's a really, really, really big mental hurdle that I think a lot of traders have is the idea of like once you get out, then you're out that you have to go look for something else. So say, for example, in this trade, let's say I had a stop there and let's say that there's a big enough move below it that it convincingly moves below the stop for me. I get out. If it starts rallying back up and out, I will happily get back in. I'll get right back in. I do not care if I get stopped out on something like that. I will get right back in because to me, I don't mind that process, but that takes a long time to build if I'm being completely honest. Most of the time I think traders once they get stopped out, they feel some type of way about it. They feel like the trade's over and that they",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 111,
      "start_timestamp": "02:09:59",
      "start_timestamp_seconds": 7799.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7799"
    }
  },
  {
    "text": "because to me, I don't mind that process, but that takes a long time to build if I'm being completely honest. Most of the time I think traders once they get stopped out, they feel some type of way about it. They feel like the trade's over and that they have to go look for something else. For me, I normally will set alerts when I get stopped out of something if it still looks good. If I just think that the range that it happened to catch me in was a little bit wide, which will happen sometimes. And that's okay. But there's no reason to sacrifice like a really good opportunity because that happens. Well, Rowan Titty said you have exemption on wash trades. Yeah. So if you have day trading with your account and the way that you file your taxes, you're marked to market daily. So wash sales inherently don't apply. The other thing to consider those is if that doesn't apply to you, then it's less of a tax consideration. And it's simply more of what efficiently makes sense, right? Because what I try to remind people is you only pay taxes on what you make. So while we want to be mindful for taxes without a doubt, we definitely don't, in my opinion, want to overemphasize taxes because you pay taxes on what you make. So Moda says, yeah, that trade you were down 30 on what have worked if you had set a",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 111,
      "start_timestamp": "02:10:58",
      "start_timestamp_seconds": 7858.98,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7858"
    }
  },
  {
    "text": "make. So while we want to be mindful for taxes without a doubt, we definitely don't, in my opinion, want to overemphasize taxes because you pay taxes on what you make. So Moda says, yeah, that trade you were down 30 on what have worked if you had set a stop and then got back in. That one probably not because it was a short premium trade. It's a little more difficult to do that with short premium trades, I think, but yeah, to your point broadly at what of? Rowan Titty says, yeah, because you can't claim it as a loss, right? Yeah. Exactly. Wash sales essentially just prevent the short term entry and exiting of same or similar products essentially to try to play taxes. But if you're again flagged as a full-time trader, then they know that that's not so much your game. And again, like there's other drawbacks to that because you're automatically going to be marked to market. So well, I think you can, I don't know, can you, you might be able to elect it or not. That part I don't remember. But yeah. Cool. And then the last one, how do you decide what strategies to try? In the beginning for me, I tried everything, literally everything. So what I started to do is realize that I needed to refine down what I was trying because a lot of stuff. It's like, again, the problem that you have as a trader is you",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 111,
      "start_timestamp": "02:12:04",
      "start_timestamp_seconds": 7924.9,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7924"
    }
  },
  {
    "text": "what strategies to try? In the beginning for me, I tried everything, literally everything. So what I started to do is realize that I needed to refine down what I was trying because a lot of stuff. It's like, again, the problem that you have as a trader is you have to strike this really important balance. And let me get rid of this and grab this so that I can draw you something that hopefully will be priceless art that moves you. But more importantly, something that might be able to explain the point. So let's say that you have a system that you're trading and let's say that this is the zero line. And let's say that this is number of like occurrences. And then this is PNL. Oh, that got stuck there. So here's the problem. If you try the strategy, let's just pick a random strategy. That sounds cool. Maybe a vertical, long vertical. Let's just do like a long, all vertical. That's your strategy. Now there's a process that has to happen in order for you to identify how effective this strategy is for you is if you put on, let's say your, whoa, that got stuck. If you put on 10 trades and then let's say that you get 50 trade and then let's see if you get 100 trade. What will happen in this first 10 trades is you'll be here maybe. So what I'm trying to highlight is that in your first",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 111,
      "start_timestamp": "02:13:16",
      "start_timestamp_seconds": 7996.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=7996"
    }
  },
  {
    "text": "got stuck. If you put on 10 trades and then let's say that you get 50 trade and then let's see if you get 100 trade. What will happen in this first 10 trades is you'll be here maybe. So what I'm trying to highlight is that in your first 10 trades, it could look something like this that's kind of skewed to one side, right? So we can see that we have one, I didn't really count how many I put. One, two, three, four, five, six, seven. Oh, that's good. The math worked out. So you could have seven winning trades and three losing trades, which is actually kind of funny because that's about right. So then you could be looking at this in the beginning and say, oh, wow, this looks great. I'm doing a great job. I have seven wins, three losses. Now again, you'll realize that if these are max losses, this might not actually look that good. It's even more dangerous is if instead of your sample looking like that, it looks like this. That's even more dangerous. And the reason why it's more dangerous is because you think, oh, okay, cool. Like I put on, you know, 10 trades and this is working really well. And then what's even more dangerous still is if you put on another 15 trades, I'm not counting the dots anymore, but let's just count the losers. And you're like, shit, you know, I put on another 15",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 111,
      "start_timestamp": "02:14:53",
      "start_timestamp_seconds": 8093.3,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8093"
    }
  },
  {
    "text": "put on, you know, 10 trades and this is working really well. And then what's even more dangerous still is if you put on another 15 trades, I'm not counting the dots anymore, but let's just count the losers. And you're like, shit, you know, I put on another 15 trades and only if three losers, this is great. Here's the issue. You need a large enough sample size to actually show you the performance of something. This is also under the context that you're doing it the same way every time. So it means that we're using the same deltas. We're using the same entry criteria. We're using the same signals. All of this has to be done the same in order for this to mean anything because what happens after this first group and you're like, wow, you know, after this group, I'm going to try actually changing my deltas. Guess what? You need to start again at zero because you just changed some shit. Then after a little while, you're all the way up here in like your 50 trades, you get through those and you're like, oh, man, maybe I want to try this new signal for my entry. Guess what? Back to fucking zero because every time we make these little tiny tweaks to a strategy, if we want to understand how efficacious it is, we have to keep same thing same so that we can compare it. And then the problem is it takes",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 111,
      "start_timestamp": "02:16:11",
      "start_timestamp_seconds": 8171.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8171"
    }
  },
  {
    "text": "for my entry. Guess what? Back to fucking zero because every time we make these little tiny tweaks to a strategy, if we want to understand how efficacious it is, we have to keep same thing same so that we can compare it. And then the problem is it takes time to understand the performance of something. It's not instant. It takes actually a really long time to get a good sample size. So by testing too many strategies, you're kind of half ass testing a bunch of stuff. That's why the way that I talk to people about this stuff is by starting with the profit mechanisms, then the signals, then the structures. Because rather than toiling, testing with all these different option strategies out there that might sound great, if we focus more on identifying profit mechanisms and fitting stuff to them, we can keep things so much simpler. So that's my sales pitch on what strategies to try. I think no matter what, a trader should try essentially everything they come across. But I would just differentiate whether you're trying stuff with real money or paper trading, I would paper trade the vast majority of it. There's no reason to throw real money at the overwhelming majority of it. So yeah, I actually really enjoyed a bunch of these questions so far. I think they're pretty cool. I will save the rest. We'll go through the rest in the next one. And then if you guys have",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 111,
      "start_timestamp": "02:17:28",
      "start_timestamp_seconds": 8248.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8248"
    }
  },
  {
    "text": "no reason to throw real money at the overwhelming majority of it. So yeah, I actually really enjoyed a bunch of these questions so far. I think they're pretty cool. I will save the rest. We'll go through the rest in the next one. And then if you guys have anything else that you want to hit quick, I'm happy to do that. And then in the meantime, there's a couple adjustments. I need to start making to my little platform here because I want to actually know, I think this looks okay. Never mind, I'm good here. Joyce says, can you clarify signals here? Like candlestick patterns, T-indicators? Yeah, exactly. So when I think about signals, it's what allows me to identify the profit mechanism. So for example, a signal in this case is the moving averages. And the actual signal here is when, let's say, prices above the short-term moving average, then maybe that's my first signal of a bullish configuration. Now there's going to be typical multiple signals, but that's the first one. And then what I do is I look at the, I call it the breadth of evidence. So essentially compiling all the different signals and stuff. And then seeing what I think based on the totality of what I see in front of me. So yeah, I think, I think that's the main way I look at it personally. And then I think signals have to be tailored to the profit mechanism as well.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 111,
      "start_timestamp": "02:18:47",
      "start_timestamp_seconds": 8327.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8327"
    }
  },
  {
    "text": "and stuff. And then seeing what I think based on the totality of what I see in front of me. So yeah, I think, I think that's the main way I look at it personally. And then I think signals have to be tailored to the profit mechanism as well. So I think it's lazy and not useful if you try to do the same exact signals for everything that tends to not work well at all. So yeah, signals are essentially what provide some sort of entry criteria. And then it's less frequently any one signal, but more kind of all of the signals combined that I'm using. Mike says, over your trading career, how many major levels in aha moments? And were they all triggered by losing trades? No, no, no, no, definitely not all by losing trades. I definitely had that big one from that one losing trade. In terms of like big breakthrough moments, there's not a ton that jump out at me because for me, it was like a very process growth, like procedural growth roadmap. So I didn't have a lot of things where I was like doing something and then I came across something at some point, which was like light bulb moment. This is completely new to me. Now there definitely are a ton of elements of those. I'm saying like there are tons of them. But there's not many that like jump out at me as like pivotal or like changing",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 111,
      "start_timestamp": "02:20:07",
      "start_timestamp_seconds": 8407.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8407"
    }
  },
  {
    "text": "something at some point, which was like light bulb moment. This is completely new to me. Now there definitely are a ton of elements of those. I'm saying like there are tons of them. But there's not many that like jump out at me as like pivotal or like changing my trading career. That losing trade was a big one. But other than that, there's not a ton of them that jump out at me. But I would say a lot of the times that I would get those bigger feelings of kind of unlocking something is probably like between the five and eight year mark. Because at that point, you're looking at stuff long enough, you're starting to identify things that are interesting for some reason or another. You're starting to see stuff and then you start getting smart enough to like understand how to analyze it and justify what you're seeing. That's really cool. That I actually like a lot. And that happens mostly during that time frame because you're at that balance where you now have enough experience that you've seen enough. You're starting to build a roll of decks of information and then you're getting to a point where you're kind of like rising to the next trading cognitive level that you can like overlook all these different things from a point of experience. And then you can see like, oh, yeah, like this clearly like now I understand the actual effect behind this. And I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 111,
      "start_timestamp": "02:21:31",
      "start_timestamp_seconds": 8491.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8491"
    }
  },
  {
    "text": "a point where you're kind of like rising to the next trading cognitive level that you can like overlook all these different things from a point of experience. And then you can see like, oh, yeah, like this clearly like now I understand the actual effect behind this. And I can like, I've seen it before. I kind of knew it was there, but now I know why it's there. It kind of builds a little bit over time. Yeah. Zacharias says, what I learned today, earn some money and eat beans and rice, invest early, learn the trade. It'll sticks. I'm still on beginner. Yeah, that's fair. I think you can even do a little bit better than beans and rice and just go to ramen. I spent a lot of time on ramen. That's for sure. But yeah, invest early, no debate and earn as much money as possible as early as possible no debate. And then Samota says, how do you decide what time frame to use for T8? Yeah, that's easy actually. So for technical analysis, the way that I frame that is it just needs to fit like what you're trading. So I have a couple videos that go through technical analysis. Here's the first one. And then here's the second one. Part one or part two. Essentially, I fit the technical analysis that I'm doing to the time frame that I'm trading. That's the way I think about it. So like, for example, if",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 111,
      "start_timestamp": "02:22:50",
      "start_timestamp_seconds": 8570.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8570"
    }
  },
  {
    "text": "couple videos that go through technical analysis. Here's the first one. And then here's the second one. Part one or part two. Essentially, I fit the technical analysis that I'm doing to the time frame that I'm trading. That's the way I think about it. So like, for example, if I'm trading zero DTE options and SPX, I don't care about a six month chart. If I'm trading something that I want to trade for like a month or so, two months, then I do care about the six month chart that kind of becomes like my one click up. The way I try to think about like a trading time frame is just observing the time frame I want to trade in a chart, a click up, a click down. And it's kind of relative, but a lot of my trades are about a one month thesis if that of holding time frames. So I actually use like a three month chart a lot, a lot. And then a lot of times I'll use six month chart for like the broader context of something. And I use a year more out of curiosity than anything. And then I'll use longer term time frames again, just to explore based on curiosity, not for some practical functional reason. Most of the time I'm going to use like six month, three month time frames for most of my charts. And even that can be argued that it's a little bit long. I",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 111,
      "start_timestamp": "02:23:54",
      "start_timestamp_seconds": 8634.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8634"
    }
  },
  {
    "text": "longer term time frames again, just to explore based on curiosity, not for some practical functional reason. Most of the time I'm going to use like six month, three month time frames for most of my charts. And even that can be argued that it's a little bit long. I do tend on a slightly longer time frame. Like a one month chart would make a whole lot of sense and a two month chart really would fit even better. But I kind of like these time frames. They are a little bit longer, but it gives me a little bit more context. So yeah, I think that's mostly what I use. Mick D says I agreed tonight was fun. Thanks for sharing your Friday night. Yeah, I love hanging out with you guys. You guys know that I always have a blast. Annabella says do you use other tools to analyze price and charts? You mean do I use stuff other than price and charts? Or Annabella, could you clarify your question just a little bit? To analyze price and charts. Because to analyze price and charts, I would use charts to analyze price because that's really what charts are a representation of. But I can't tell if you're asking for like a broader analysis question. Zachary says do you think technical analysis is driving the price due to the fact everyone is doing it and ignoring the outliers? No, I think supply and demand is what drives price",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 111,
      "start_timestamp": "02:24:54",
      "start_timestamp_seconds": 8694.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8694"
    }
  },
  {
    "text": "are a representation of. But I can't tell if you're asking for like a broader analysis question. Zachary says do you think technical analysis is driving the price due to the fact everyone is doing it and ignoring the outliers? No, I think supply and demand is what drives price and technical analysis or just in general is the way that we can visualize it. That's all. So we can see human traits and human qualities come through in technical analysis. The frequency for people to look at something at a specific level or stuff like that. But it's really just broad supply and demand functions that are happening and a chart that lets you visualize the supply and demand functions playing out. But you can also see a lot of human psychology in them, which is hilarious, right? Because I've told you guys about this. I was reviewing this on the pro livestream yesterday. I have a trade on in Baba and it is literally to no surprise. I actually have to move my stop up again. It is no surprise to me to see something like this move this fast. And this is about how information is being integrated into a price of something, right? And as you can tell in this case, it's obviously being integrated, not cleanly is what I would frame it as. So yeah. I think when I look at the movement of stuff like this, it's just such a great visualization about how",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 108,
      "total_chunks": 111,
      "start_timestamp": "02:26:10",
      "start_timestamp_seconds": 8770.78,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8770"
    }
  },
  {
    "text": "integrated into a price of something, right? And as you can tell in this case, it's obviously being integrated, not cleanly is what I would frame it as. So yeah. I think when I look at the movement of stuff like this, it's just such a great visualization about how people behave. Rointit says is it true that charts are structured off of UK cheese. I've not heard that, but that's actually funny. Mick D says that's why fibs are so effective. They're actually not. I've done a lot of studies about fibonautchies. I think what you're experiencing there is just confirmation bias. They're not completely ineffective, but like in an actual like practical sense, they're really not that effective. The most effective indicators that you'll find in general are going to be volume and moving averages. That's why I use those is like those are hands down. The most accurate reflections and predictive tools that we have available stuff like fibs and stuff like that. They like a fib doesn't mean anything, right? Like a fib is totally random. It's just using the natural sequence as something of consequence, but it doesn't actually mean a whole lot. And so like to Joey's point, Joey likes VWOPs. People use VWOPs and funny enough if you plot a moving average compared to a VWOP, they're not that far apart. So you can kind of see them in the same. That's the thing is like so many of these tools, they're so",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 109,
      "total_chunks": 111,
      "start_timestamp": "02:27:25",
      "start_timestamp_seconds": 8845.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8845"
    }
  },
  {
    "text": "like to Joey's point, Joey likes VWOPs. People use VWOPs and funny enough if you plot a moving average compared to a VWOP, they're not that far apart. So you can kind of see them in the same. That's the thing is like so many of these tools, they're so damn close to one another. There's really not a massive amount of difference between them. So yeah. Sweet. Super fun. Great. Hang in out with you guys. I'm going to hop off, go hang out with the fam for a little bit, take the pub for a walk, grab some dinner. Tomorrow we have the GME live stream. We're going to be diving into roaring kiddie's trades. I think this is part four, is that right? It is part four. So we have to keep getting into the weeds on the cat and what he's working on. As always, anything you need, let me know, hit me up. I'm around. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "tcTsTVUqapU",
      "title": "tcTsTVUqapU",
      "url": "https://www.youtube.com/watch?v=tcTsTVUqapU",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 110,
      "total_chunks": 111,
      "start_timestamp": "02:29:01",
      "start_timestamp_seconds": 8941.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tcTsTVUqapU&t=8941"
    }
  }
]