[
  {
    "text": "If you ask people who roll options, they'll tell you off and that if you roll for a net credit, you're avoiding a loss or you don't have a loss. The reality is you unbelievably are taking a loss every single time if you roll an option that is losing. The way to think about rolling options is we are literally closing a trade and opening up a new trade and mentally tying the accounting together. That first trade was opened and closed. That includes a realized loss. The new trade is an open trade that includes a unrealized PL. It's just the reality. The sooner that traders can stop playing these stupid mental gymnastics in their head and get over the fact that there's a losing trade as part of what they're trying to do, it's literally just looking at reality as what it is. But traders don't like to do that because it can be uncomfortable and we have to get comfortable with the idea of losing positions. It happens all the time as a trader. If you can make money going forward, all the better. It doesn't make the last trade that you closed unrealized because it is realized. The Nuller sealer.",
    "metadata": {
      "video_id": "TE0Vv2aflIE",
      "title": "Truth about rolling options",
      "url": "https://www.youtube.com/watch?v=TE0Vv2aflIE",
      "upload_date": "2025-03-25T16:30:08Z",
      "duration": "PT1M10S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, direct Q&A, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TE0Vv2aflIE&t=0"
    }
  }
]