[
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 13,
    "text": "What's up, outliers? Happy Sunday. Today's video is just a quick market outlook for what's coming up for the week ahead and we'll get right off to the races. So last week we saw a pretty significant rotation. You can see across the primary futures, the E-minis here had a really strong rally as the NASDAQ as did Russell. Now, when I look across the different indices, I still see the SP 500 kind of being the top performer here as it's very, very reasonably closing in on near term highs. These are all three month daily charts. We can see that NASDAQ still has a way to go. Right now it's at 19, 872 and it needs to get essentially to 2100 ish and the Russell is still behind by a moderate amount as well with the term high here at 2320 and right now it's running at 2209. So what does that tell me? It tells me that the SP 500 obviously is leading in terms of overall strength but then it also gives me some glimpses is to where the strength is coming from. So if we take a look within the individual exchanges and sectors, we'll see two things that are really important. The first thing is you'll see that for the NASDAQ, it's still starting to show highs but just very recently. And then if we took at the New York Stock Exchange, it is really, really running green. Now here's the interesting thing is",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=0"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 13,
    "text": "see two things that are really important. The first thing is you'll see that for the NASDAQ, it's still starting to show highs but just very recently. And then if we took at the New York Stock Exchange, it is really, really running green. Now here's the interesting thing is even as IWM was collapsing and again NASDAQ and IWM they're not like a one to one in terms of what's on the New York Stock Exchange just an important admin note but they're decent proxies for kind of broad market behavior. So when we look across the New York Stock Exchange, we can see that there was pretty significant strength even as IWM is rolling over, even as the Qs were running over and even as the SP 500 were rolling over. We can see that gross lows were definitely opening up but that tells me that this down move was being precipitated by a handful of larger names, not the breadth of names. Breath mean how many are there, definitely not the most of them, right? Because it maintained net highs even during this across the board, across all the individual indices. So what this means to me at a high level is pocketed strength. It means that when we're looking to stack strength like I talk about frequently when coming up with directional dispositions, I want to have as many factors in my favor as possible. Well, I can tell you one of those factors that's not",
    "start_timestamp_seconds": 64.92,
    "start_timestamp": "00:01:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=64"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 13,
    "text": "at a high level is pocketed strength. It means that when we're looking to stack strength like I talk about frequently when coming up with directional dispositions, I want to have as many factors in my favor as possible. Well, I can tell you one of those factors that's not here right now is all of the indices moving up uniformly. We can see that even now the Qs, it's still for a three month standard deviation channel is negative sloping. Now, as I've mentioned before, it's getting near what I would consider to be a couple really important levels. We can see that the point of control on a volume profile for the Qs is at 480, 481 and we can see that there's a lot of congestion just below that as well. So what that tells me is for tech, I want to know how it behaves in this region here massively. Because if it starts breaking above, then I start thinking, okay, looks like bullish resumption. If it gets stuck here and starts to reject down, notice what that would build. We have a high, we have a lower high. Right now, this is a lower high. So if this stays down here is a lower high, then we are literally assuming a downtrend where the next expectation would be a lower low below this. But right now, when you see these kinds of configurations, the chart it literally can go either way for any reason. Now,",
    "start_timestamp_seconds": 138.94,
    "start_timestamp": "00:02:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=138"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 13,
    "text": "So if this stays down here is a lower high, then we are literally assuming a downtrend where the next expectation would be a lower low below this. But right now, when you see these kinds of configurations, the chart it literally can go either way for any reason. Now, there's some economic events coming up this coming week that I think will actually help this a little bit in terms to the upside. But we never know. And we have to wait and see. Our job as traders is to come up with ideas, probabilistic assessments about what we think may or may not happen. But I'm going to wait until I can see some level of confirmation before I start committing large sums of capital. Again, I've said this a few times. I have exposure to all three indices right now through futures, but I'm still not heavily committed. So I'm in a holding pattern here. So that's what I'm really eager to see in the cues specifically. Now, let's take a quick look at what we have coming up the week ahead. And there's some meaningful releases, not is quite of a busy week, but obviously there's a really important release coming up that will go over in a second being the fed rate statement. But I mean, in terms of other inflation indicators that's a little quiet. So we have retail sales coming out on the 17th, the 16th is super quiet. It's just the manufacturing",
    "start_timestamp_seconds": 213.26,
    "start_timestamp": "00:03:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=213"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 13,
    "text": "a really important release coming up that will go over in a second being the fed rate statement. But I mean, in terms of other inflation indicators that's a little quiet. So we have retail sales coming out on the 17th, the 16th is super quiet. It's just the manufacturing index. I read this for context, but I don't really read too far into it. So we have retail sales, industrial production, the housing market index, I always like reading because I'm also a real estate investor. So I kind of like understanding how overall housing market is performing really just for that context. So that's the same reason why care about things like housing starts and building permits. But here's where it starts to become really important. You can see on the 18th, we have the FOMC rate statement and economic projections along with the rate decision. So this is going to be massively important because if we take a look at the current market expectations, they're very, very specific. So if we pop over here to the Fed watch tool, get rid of their pop up. But maybe not. Well, look at that. Not even lined up. If I hit my crosshair right on there, it's no good. It's lined up down here. Tricky, tricky. So if you look at the comparison probabilities, this is actually new. So we now see a higher probability of a 50 basis point cut. That's new. That's brand new because just yesterday",
    "start_timestamp_seconds": 284.26,
    "start_timestamp": "00:04:44",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=284"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 13,
    "text": "I hit my crosshair right on there, it's no good. It's lined up down here. Tricky, tricky. So if you look at the comparison probabilities, this is actually new. So we now see a higher probability of a 50 basis point cut. That's new. That's brand new because just yesterday in the day before, it was 50, 50 and then even tilted a little heavier for a 25 basis point cut. So fascinating. The only thing that I find interesting about this is in my opinion, it seems like largely the market has a 25 basis point cut already priced in. I think that if we see the cut, it's insanely likely that we see some sort of follow through from the broad market, kind of just seeing that we're moving down that path of rate cuts. If it's a 50 basis point cut, I would imagine a little bit more of a movement or the market could start getting a little concerned actually. It wouldn't surprise me because I still think the market would be bid up, but I think overall cautiousness and nervousness would start to come out more because if you think about the campaign that Powell has maintained, it's been very communicative, very steady, and it's been very slow and methodical, like very slow. We even been waiting so long to cut rates where a lot of people have been arguing this should have started like six months ago at the late end. So it would",
    "start_timestamp_seconds": 358.98,
    "start_timestamp": "00:05:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=358"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 13,
    "text": "has maintained, it's been very communicative, very steady, and it's been very slow and methodical, like very slow. We even been waiting so long to cut rates where a lot of people have been arguing this should have started like six months ago at the late end. So it would be actually kind of surprising to me to see Powell go through his real, real focus on controlling inflation, his sphere of inflation, spiking back up once we start cutting rates because that's a whole other problem set. And to start with the 50 basis point cut, actually to me would start to indicate that they don't feel like they have the same runway that they've been communicating because that's one of the luxuries they've had about the rate they've been able to move so slowly and methodically because things aren't breaking all over the place yet. We've been very economically resilient. We've seen some spikes and drops in things like employment, productivity metrics, stuff like that, but we're not seeing like depression level signals or anything like that. So I am now really, really eager actually to see if this materializes because I could see this going either way. Again, I would imagine in terms of price, we would see near-term positive price movement, but I imagine we would see sentiment change a little bit and people starting to get a little bit kind of curious about we've had this really, really cautious cycle so far. We've waited so",
    "start_timestamp_seconds": 422.1,
    "start_timestamp": "00:07:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=422"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 13,
    "text": "Again, I would imagine in terms of price, we would see near-term positive price movement, but I imagine we would see sentiment change a little bit and people starting to get a little bit kind of curious about we've had this really, really cautious cycle so far. We've waited so long to start cutting to start with the 50 basis point cut. To me would indicate something else in their messaging that we would have to pay really close attention to because by all accounts, I think most across the market would presume a 25 basis point cut and kind of see what happens. It wouldn't even surprise me to see a cut a pause than a cut because again, they face a really, really delicate challenge here. And if the scenario comes where inflation starts to spike back up after they start cutting, that's really difficult to get back under control meaningfully. So very interesting. So that's going to be on the 18th though. That's going to be a really, really volatile day on a relative basis. Again, not looking to be hyperbolic or anything, but if we take a look at, we'll grab SPX for this example and we take a look at the volatility, you can see 15, 16, 19, 19, 19. So we're really, really interested about this time period where we're going to see the rate statement come out again, totally as expected. So the other thing that we have coming up, jobless claims, sorry,",
    "start_timestamp_seconds": 490.18,
    "start_timestamp": "00:08:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=490"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 13,
    "text": "we take a look at the volatility, you can see 15, 16, 19, 19, 19. So we're really, really interested about this time period where we're going to see the rate statement come out again, totally as expected. So the other thing that we have coming up, jobless claims, sorry, that's just a little alert. Jobless claims on the 19th, which again, that's going to be another really important metric, believe it or not. And the reason why that's becoming important is because there is a couple of revisions that we had and now everybody's kind of looking at this metric a little more closely, I think. So we have again, not a ton of data coming out this week, but we have a few things that are much higher impact, specifically rate statements and things like that. So I'm interested to see essentially how that goes. Now, from a broader market perspective, I've already talked about a few of these trades. I've really been rotating through a bunch of different stuff. Right now, my portfolio is still heavily positioned to be in my core allocation with speculative allocations running. So things like HAL was a ratio put diagonal that I had on that I took off because it essentially did what I wanted and it started bottoming out. So I actually still think this looks good to the downside to be clear, but you can see where my alert sits and essentially where we hit as a high on",
    "start_timestamp_seconds": 554.26,
    "start_timestamp": "00:09:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=554"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 13,
    "text": "I had on that I took off because it essentially did what I wanted and it started bottoming out. So I actually still think this looks good to the downside to be clear, but you can see where my alert sits and essentially where we hit as a high on the 13th was 2844. So I was six cents shy of that. So at that point, the trade had generally run its course. It wasn't a really long-term trade. It was just general short in energy. And for those that are curious what the ratio put the agnol look like, it's really, really simple. All I'm doing is something like going out into 15 know I'll buy a in the money put. So something like this. Get rid of that. And I realized I accidentally did the opposite trades. We'll do buy. And then what I do is I sell typically closer to today. Really, it was the 20 steps that I had on, but it would be something around here. And I would sell out of the money puts against it. And the way that this would work is typically I maintain a very specific ratio that I like to run. So for example, I might have in this example, like maybe 10 longs against three shorts. This is smaller than I would put on, but that's kind of like where it starts to become representative of the disposition I have. And it's really just designed to play to",
    "start_timestamp_seconds": 627.86,
    "start_timestamp": "00:10:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=627"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 13,
    "text": "to run. So for example, I might have in this example, like maybe 10 longs against three shorts. This is smaller than I would put on, but that's kind of like where it starts to become representative of the disposition I have. And it's really just designed to play to the downside. The short puts can be rolled if I want to try to salvage profit out of them, but it gives me two different profit mechanisms. That's the point of the trade. This was a just really simple, really simple trade. Now in terms of finding good shorts, now it becomes a little more interesting to me because if we look at energy, it's starting to bid up. This is what I was shorting before. So as I look for things that look kind of ugly that are rotating over, the best still is energy, but not right now because it's being bid up. I need to see how that rolls. I see XLV, which is kind of trending sideways. What I'm highlighting is from a high level. I'm actually not seeing a whole lot jumping out at me that I want to go short. XLV would still be towards the top of the list. XLF is getting there. I actually had some short puts in Bank of America that I took down at a loss because it was essentially a bullish trade. They weren't in the money yet, but it started not doing what I wanted it to",
    "start_timestamp_seconds": 692.26,
    "start_timestamp": "00:11:32",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=692"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 13,
    "text": "towards the top of the list. XLF is getting there. I actually had some short puts in Bank of America that I took down at a loss because it was essentially a bullish trade. They weren't in the money yet, but it started not doing what I wanted it to do. So I managed those pretty quickly. And yeah, so to find short deltas becomes a little more interesting when I look across all of the indices and I'm not seeing significant weakness except for XLE, which again is now starting to get bid up before it was easy, right? You just go to XLE. It was falling off a cliff. You ride that to the downside. I don't like going short tech. So now it's just a matter of finding other opportunities to capture some short deltas. The last thing I want to take a look at is the calendar. And it's because for those that don't know, we still have some earnings on the docket that I like to see. So things like Riley, GIS, FDX, those are all well within play and you AC and CCL. So for this month, it's kind of like the stragglers. But then as soon as you click to the next month, guess what? We start with the banks. So we're coming into the next earning season. That's kind of the cool part about being an option trader is that as soon as you wrap up one options trading season, the next",
    "start_timestamp_seconds": 753.62,
    "start_timestamp": "00:12:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=753"
  },
  {
    "video_id": "TjjfgZ7o68I",
    "title": "TjjfgZ7o68I",
    "url": "https://www.youtube.com/watch?v=TjjfgZ7o68I",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 13,
    "text": "then as soon as you click to the next month, guess what? We start with the banks. So we're coming into the next earning season. That's kind of the cool part about being an option trader is that as soon as you wrap up one options trading season, the next ones kicking off right away. And we're going to start with the banks. So I'm already prepping the portfolio to essentially take positions in earnings plays, making sure I have capital ready to move there. But just putting that on everybody else's radar because it is on mine. Now for the outlier pro live stream later today, I'm going to go through a bunch of my positions, talk about some of the updates I've made recently. And then we got a bunch of scanning to do to look for opportunities. But for everybody else, you know, happy to connect more on that stuff tomorrow during the YouTube live stream. As always, if there's anything that you want to cover any questions you have, let me know be an outlier. I'll see you all later.",
    "start_timestamp_seconds": 821.46,
    "start_timestamp": "00:13:41",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=TjjfgZ7o68I&t=821"
  }
]