[
  {
    "text": "What's up, outliers? I'm going to walk you through some of my favorite ways to use the Analyze tab in Thinker Swim. Actually came up during a workshop today, so I figured this would be a good reference video for folks. So there's a bunch of different things in the Analyze tab on the top. It's just outside the windows, you can't see it, but I'll read them off to you. There's ad simulated trades, so this is kind of like paper trading. There's the risk profile, probability analysis, economic data, think back, fundamentals and earnings. We're going to go through all of them. Now simulated trades is kind of just paper trading for today. I don't really use this much myself, but it's in there in case you want it. Then the risk profile I use all the time. And this helps us understand how a certain position is set to perform in a few different ways, and I'll explain how. So the Y axis here is representing the P and L for the position. This is your zero line. Anything above this is positive returning. Anything below negative. You can see this goes from 1,000, 2,000, 3,000, so on and so forth. Same thing to the downside on the negative side. Now the X axis shows us different prices for the underlying. So you'll see it's essentially just increasing from left to right. So you can zoom this in or out as you want, as you can see",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=0"
    }
  },
  {
    "text": "on and so forth. Same thing to the downside on the negative side. Now the X axis shows us different prices for the underlying. So you'll see it's essentially just increasing from left to right. So you can zoom this in or out as you want, as you can see just by clicking and dragging, I can change the scale of things. So I can compress things down super far, or I can spread them out so that they make a little bit more sense for what we're looking at. So that's this. Now these different vertical lines, you can control to be whatever you want. As you can see down here, I have them currently as different standard deviations. So I have plus one, plus two, plus three, minus one, minus two, minus three. And then this middle one is the spot price. So we can tell 36, 79, which is right here. It's telling us the current spot price, which is this one. So this is this line here. So then as you move out, this is minus, well, quick pause. This is whatever, essentially, you want it to be. You can set this to be whatever price. So you'll also notice down at the bottom here, I have a couple other prices that are key coded in, one at 3190, one at 4434. Why is that? Well, for this trade example that we were looking at, those were the stops for the trade that we were looking",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:01",
      "start_timestamp_seconds": 61.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=61"
    }
  },
  {
    "text": "So you'll also notice down at the bottom here, I have a couple other prices that are key coded in, one at 3190, one at 4434. Why is that? Well, for this trade example that we were looking at, those were the stops for the trade that we were looking at. So in this case, the 3190 here, and then the 4434 here actually represents those two positions so that I could easily see what the P and L would be at those. So then in order to find the plus one and minus one standard deviation, you have to go out here and here. And you'll notice it gives you the probabilities up here. So this says 15, 8, 5. This says 15, 8, 7. So it's automatically giving you the probabilities on top of them. And then so on and so forth for the rest. So you can change these. Actually, you can change them by going over here and by hitting set slices. You can do some sort of percentages is really, really common. There's another really common one that I like to use, which shows like 5 steps in the underlying like this. You can essentially make it whatever you want. I find standard deviations to be most useful. Again, I'm kind of a statistic minded myself. So then if you click the default, it'll give you plus one minus one. And then if you want to add more, you can just hit this plus button",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:09",
      "start_timestamp_seconds": 129.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=129"
    }
  },
  {
    "text": "make it whatever you want. I find standard deviations to be most useful. Again, I'm kind of a statistic minded myself. So then if you click the default, it'll give you plus one minus one. And then if you want to add more, you can just hit this plus button on the right hand side. Change these by clicking on them. And then I can add my plus two minus two and then so on and so forth as much as I want. So the other thing you'll notice on this is that as you look at this position, you notice that there are two lines that actually can be even more. We can have four lines if there were four legs, but in this case, there's not four legs. There's technically only two legs. So what are these different lines? Well, if you'll notice over here, they give you three different dates. So what these are showing you are the P and L for these specific combination of positions at different points. So in this case, 816, that's today. It's showing you the P and L for your trades today. And then 9-7, it's using the first exploration for the closest expiring leg. So in this case, there's one leg in this trade. This is, I think a ratio called diagonal. Oh, no, this is calls inputs. I just picked random stuff for the example. So in this case, though, the put side is in six set. So that's",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:15",
      "start_timestamp_seconds": 195.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=195"
    }
  },
  {
    "text": "the closest expiring leg. So in this case, there's one leg in this trade. This is, I think a ratio called diagonal. Oh, no, this is calls inputs. I just picked random stuff for the example. So in this case, though, the put side is in six set. So that's what the blue line is. It's showing you when that leg would expire. But again, the blue line is still the entire position combined. It's just giving you the date variance or whatever the first leg expires at. And then the 1019 shows you the rest of the trade, the longer expiration leg when this whole trade would look like when that comes up to expiration. So obviously, at that point, the short calls would be, or in this case, the short puts would be gone. So the other thing you can do is click into these and remove individual legs if you just want to see how something would perform, which is kind of cool by isolating the individual legs. A couple of notes, you can change those different lines. You can do it based on the passage of specific days, changes in volatility. It's really up to you. You can also change the metric. So it's showing the total PNL, the PNL on the day, the individual, the Greeks, so that you have a sense of how the position behaves as it moves around. Now, for probability mode, I like to use the probability of a touch because",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:04:18",
      "start_timestamp_seconds": 258.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=258"
    }
  },
  {
    "text": "You can also change the metric. So it's showing the total PNL, the PNL on the day, the individual, the Greeks, so that you have a sense of how the position behaves as it moves around. Now, for probability mode, I like to use the probability of a touch because for most of the stuff that I use, it is predicated on management as things get to different levels, which is based more so again on touch. Because when we look at probability of in the money or out of the money, that really refers to at expiration. So I typically will use touch. And then the probability range is adjustable. So this is using a one standard deviation range. You could do two standard deviation or three standard deviation ranges. And then you can also use different times, again, based on the steps that you're using for the data here. So right now, it's defaulting to the long leg, the longest expiration leg as the ultimate date, but you can change that if you want. So you'll notice as I hover over it and move around, that in the middle, it shows you the price at the PL of the underlying. So that's what it is right in the middle. Then down at the bottom, it shows you the price of the underlying. And then on the left hand side, it shows you the PL at those different points in time. So then down here, you'll see it shows",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:05:37",
      "start_timestamp_seconds": 337.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=337"
    }
  },
  {
    "text": "the underlying. So that's what it is right in the middle. Then down at the bottom, it shows you the price of the underlying. And then on the left hand side, it shows you the PL at those different points in time. So then down here, you'll see it shows you the position delta gamma theta Vega for each of those points. And then it also shows you the PL for the individual day for open, what the net liquidity would be, and then the expected margin requirements. So there's a ton, a ton of details in here. Now a couple other small things, you can tinker with the interest rate down here or you can lock it so it doesn't change. You can change the volatility pricing model. So you can use kind of their proprietary method that they kind of adjust slightly. You can use binomial black sholes, whatever you want. You can group the symbols into different things. There's literally a ton of other things that's really quite a lot of people don't know, is you could look at the entire portfolio as compared to one individual ticker, which is kind of nice. So another note here is that if you click this little cog on the side over here, you can change the stock price in here as you want, or more importantly, you can change the volatility. And if you hit this thing over here, more parameters, you can change the volatility for individual legs",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:06:41",
      "start_timestamp_seconds": 401.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=401"
    }
  },
  {
    "text": "is that if you click this little cog on the side over here, you can change the stock price in here as you want, or more importantly, you can change the volatility. And if you hit this thing over here, more parameters, you can change the volatility for individual legs if you want. This just helps you see how things move. So that's a general walkthrough of this. There's kind of some more corky little things in there but I think that's kind of a good overview. Now, probability analysis gives us a projection of future price. So in this case, it's taking the volatility of the underlying. So in this case, 77.36. And then it's projecting out in this case a cone. So this really a parabola. And it's using again a one standard deviation range. Now you can change this to be from probability of touching, to be the probability of in the money. And then you'll notice that our little crosshair has two numbers on it. So it's showing you the probability above and below whatever number you're hanging on. So what that means is on the y-axis is the price of the underlying and the x-axis is the date. So this is date zero today. And then this is 10 days away, 20 days, 30 days, 40 days, 50 days, so on and so forth. And then this is showing you the price of the underlying. This is obviously showing you essentially where the current spot",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:07:46",
      "start_timestamp_seconds": 466.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=466"
    }
  },
  {
    "text": "is the date. So this is date zero today. And then this is 10 days away, 20 days, 30 days, 40 days, 50 days, so on and so forth. And then this is showing you the price of the underlying. This is obviously showing you essentially where the current spot price is. So what I like to use again is the probability of a touch because that's typically what I'm managing by. And you can see what the probability is of your position being touched at different price levels. So for example, you can tell right out of the gate for this 20802 and this 47, again, this cone is a one probability. So that'll be about a 16 probability of a touch. And if I change this from a one standard deviation to two, you'll notice that it now represents like a two and change percent probability. So these are just using standard deviations for the probability calculation. What's really useful here is you can use the options chain for this information, but it's also really simple to just look it in here. So for example, if I have this trade down here, that just happens to be short 34 puts. And I'm like, okay, what's the probability of us hitting 34 by six September? I can look at six September. I can find the date. Again, you can zoom it in as much as you want. And then I can say, what's the probability of us hitting 34?",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:08:55",
      "start_timestamp_seconds": 535.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=535"
    }
  },
  {
    "text": "34 puts. And I'm like, okay, what's the probability of us hitting 34 by six September? I can look at six September. I can find the date. Again, you can zoom it in as much as you want. And then I can say, what's the probability of us hitting 34? The probability of hitting 34 is like 69.99 probability. So now I know that for whatever reason I'm looking for that, whether I'm trying to calculate expected return or zone and so forth. So super, super useful tool. And then again, you can adjust the volatility for the parameters down here if you would like. I use both of these literally all the time. Now economic data is actually another really underutilized tab where you can take a look at different broad economic indicators and it literally plots them for you. You can pick the format that you want. You can change the ranges. This is essentially coming from Fred, which is the Federal Reserve economic data. There's a ton of great details in here. So the, yeah, I mean, tons and tons of different things you can tinker with in here. Think back is essentially the on-demand feature, but it's just in the normal portal, right? So you can pick a stock that you want to look at. You could pick the date you want to go back into. And then you can take a look at the options chain, the chart at that time, all those kinds of",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:10:01",
      "start_timestamp_seconds": 601.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=601"
    }
  },
  {
    "text": "it's just in the normal portal, right? So you can pick a stock that you want to look at. You could pick the date you want to go back into. And then you can take a look at the options chain, the chart at that time, all those kinds of details. And then the last couple of things, fundamentals, exactly what it sounds like. You can see what different rating agencies feel about the underlying. The cool part about it is you can download their reports where you can see, you know, when new reports are launched, so you can see actually what they're saying. You can just get a quick update about the parameters, or I'm sorry, the like background of the company, not the parameters. And then you can go to the website for the company here. You can look at some of standard valuation metrics, so annual or quarterly. And this is another really cool tool because I feel like a lot of people don't fully utilize it. Because one of the other things I think a lot of people aren't familiar with is if you scroll down for some companies, not all, it'll give you a lot of details about the valuation of it. And then it'll actually even give you a breakdown, essentially of the company's market cap or the estimated value. So you can click into it and then get trends within that specific segment. So right now looking at Boeing, we can look",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:11:08",
      "start_timestamp_seconds": 668.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=668"
    }
  },
  {
    "text": "lot of details about the valuation of it. And then it'll actually even give you a breakdown, essentially of the company's market cap or the estimated value. So you can click into it and then get trends within that specific segment. So right now looking at Boeing, we can look at the global services arm, which obviously comprises 43.9 of the market cap and you can see what the revenue looks like in there, what they're actually selling, what the competitors are. The detail in here is actually like really, really good, I think. So there's that context for you. And then the last thing I use all the time is for earnings. So this gives me context about the underlying price before and after the release. So you can see the release date is in the center. We can look at implied versus historical volatility, the pricing of the straddle, and then how the actual versus estimates line up with one another. Now this is kind of the last eight quarters together. You can zoom in a little bit more. So this gives you a little more granularity in terms of what time frames you're looking at. Then you can also compare them across different quarters. So this is comparing the IV, the HV, the straddle price, and then the stock price, again, pre-imposed release. So you can see down here, center shows earnings announced. And then it shows you five days before with all those parameters and then",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:12:09",
      "start_timestamp_seconds": 729.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=729"
    }
  },
  {
    "text": "can also compare them across different quarters. So this is comparing the IV, the HV, the straddle price, and then the stock price, again, pre-imposed release. So you can see down here, center shows earnings announced. And then it shows you five days before with all those parameters and then five days after you can zoom in a little bit if you need. It is again, just another really, really cool tool, I think. You can also change the specific quarters that you want to compare out of curiosity. So yeah, just another absolutely awesome tool in my opinion that I use all of the time. As always, if there's any questions, just let me know, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "TMNRTsBeaHE",
      "title": "Thinkorswim Analyze Tab: A Complete Walkthrough for Traders",
      "url": "https://www.youtube.com/watch?v=TMNRTsBeaHE",
      "upload_date": "",
      "duration": 843.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:13:17",
      "start_timestamp_seconds": 797.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TMNRTsBeaHE&t=797"
    }
  }
]