[
  {
    "text": "What's up, outliers? Quick market update will run through the indices. Then we'll take a quick look at what happened today. And then I'm going to pivot over to GameStop ahead of our GameStop live stream tonight at 5 p.m. Pacific time. So if you want to come, hang out, get a little weird, get a little deeper into GameStop. That's where that will happen. But in the meantime, let's take a look at these markets. So you can already see, as I'm hovering over the Russell, it had a massive down day. So did the NASDAQ, so did the E-minis. We saw the SP 500 percentage of stocks above the 50 day moving average crater. We saw bonds have a pretty good day and we saw VIX actually pop above 18 for a little while, which is kind of an important thing because VIX is been a very reliable steady trade this year. And it's been very static, meaning we're not seeing these really drastic extremes. But whenever I see it up at these levels, I'm fading it. And it's just because it has very seldomly remained above here for all too long, although it can volatility does cluster. But this has been a great trade so far this year. Essentially anything above 17 becomes interesting scaling and above 18, 19. That's that's all right. Now I do want to take a look at the futures really quick futures are open right now. So the E-minis are down a",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "But this has been a great trade so far this year. Essentially anything above 17 becomes interesting scaling and above 18, 19. That's that's all right. Now I do want to take a look at the futures really quick futures are open right now. So the E-minis are down a little bit more. The Russell's about unchanged in the NASDAQ is down about half a point. Taking look specifically at the Russell, because I have some short puts on in there, I've scaled the trade down massively funny enough. I seem to have a really random habit of doing this with Russell. But the last couple days I actually had a much bigger position on that I was scaling out as we were kind of trending sideways here. You can see that we're baking in a little bit of a top. And that's okay, because we need consolidation. It's healthy for the index for the underlying, but things are a little different this time. One thing I noticed is that the CCI is now turned negative, which is just a momentum indicator. It's an oscillator. But I have pretty good success with it. I like this one. I tinker with a lot of them, but really when I want to draw your eye to down here is the net highs lows. So we see net highs lows is now turned negative for sure, actually a little deeper than the last negative we saw over here. But take a look at",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "a lot of them, but really when I want to draw your eye to down here is the net highs lows. So we see net highs lows is now turned negative for sure, actually a little deeper than the last negative we saw over here. But take a look at the difference in the quality. So as I hover here, net highs lows was negative 51. Today it's negative 69 giga. It's not that different, but take a look at the difference in these days. Here's where the other red day was. Here's what it is now. And again, this is for the NASDAQ. It's not fully representative of what you're going to see in the Russell. But this gives you a pretty good idea of what's going on. And we see highs collapsing and we see lows expanding. So I don't actually love this configuration. If we take a look at these other periods where we start to see these transitions, these transition days can be kind of heavy one way or the other to the upside of the downside. So it's something I'm keeping an eye on. But the way I think about it now is brought in disease. I am being careful with risk. I'm not overly allocated or utilized right now. Most of the cash I have is kind of being transferred over into more of a holding pattern for at least till it needs not to be. I will maintain some exposure as per usual,",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "disease. I am being careful with risk. I'm not overly allocated or utilized right now. Most of the cash I have is kind of being transferred over into more of a holding pattern for at least till it needs not to be. I will maintain some exposure as per usual, just because you never know when things are going to grab some light and start moving. But right now things are slowing down. So what is the cause of this? What happened? Well, first I want to be very clear that people really like to oversimplify things in markets. And we like to have these really neat, tidy little descriptors of what happened. Right? Why did X happen? And a bunch of things happen today. Now nobody ever fully knows why everything goes the way it goes in the market, typically unless there's a massive catalyst. I just like to call that out because getting into the news cycle of listening to CNBC or these other news sources say, oh, the SP 500 is down because of this. It's probably partially because of that. But then you also notice that the next day it'll be up because of a similar thing. So you just have to be careful. Otherwise, if you get into this habit of these really neat succinct explanations for everything, you start to oversimplify it just as a heuristic and you miss a lot of details. Now if I were to pinpoint though the primary drivers for",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "thing. So you just have to be careful. Otherwise, if you get into this habit of these really neat succinct explanations for everything, you start to oversimplify it just as a heuristic and you miss a lot of details. Now if I were to pinpoint though the primary drivers for the movement today, it's this right here. I think job jobless claims came in very hot. And this is really important because it's seen as a form of broad stock market weakness. And this is important because we've been in this really high inflation period for so long. And we've been at a point now where rates have been held up for quite some time. That puts a lot of pressure on small companies, specifically small caps, typically everybody, but specifically small caps. And as this continues, you get to a point where you're wondering when things are going to break. When can they no longer sustain viable operation? When do they have to start laying people off in order for this to continue to be economically viable for them? And this all feeds into the fed rate decision because the fed in the previous meeting said that they're not putting rates. And for the last meeting and the market didn't care, that's what we expected to see. But if we take a look at what the markets expectations are for September, it is that a cut is coming. So now the question becomes how big of a cut and",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "putting rates. And for the last meeting and the market didn't care, that's what we expected to see. But if we take a look at what the markets expectations are for September, it is that a cut is coming. So now the question becomes how big of a cut and notice the change yesterday, it was an 88 probability of a quarter point cut. Today, after that came out, that dropped literally 10 points. And we now have a 22 probability of a 50 basis point cut. Why is that? Because the market is starting to see weakness. And if this persists for too long, it's important to remember that there's leads and lags to all of this. So if this continues at this rate, it puts the market in a compromised position moving forward. So that's why in my opinion, a primary driver of this was the unemployment metric coming out and being much higher than pretty much everybody expected it to be. So this will likely be an important data point for big daddy J pound his decision on what he wants to do with rates. All right, so now let's talk about GameStop quickly. And it's because this trend is assuming. So again, this is I talked about this yesterday. This is not surprising to me. I don't want it to do this, but this is what it's doing regardless of what I want. Shocker. The market is not listening to my wishes. It's unbelievable, really. And",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "this trend is assuming. So again, this is I talked about this yesterday. This is not surprising to me. I don't want it to do this, but this is what it's doing regardless of what I want. Shocker. The market is not listening to my wishes. It's unbelievable, really. And to me, we're getting close to this first stop as I see it at least, which is this 2098 slash 21-ish handle. Again, I always think it's important to remind people, GameStop is one of those really unique beasts where when it decides not to follow standard pricing behavior, it doesn't. Right? When you see things go through these kinds of cycles, this is not standard pricing behavior. So even though that this is in a very standard descending trend line, if I put a linear regression best fit line on it, it's going to be descending from this point. The thing is as soon as there's some sort of catalyst that turns it around, it'll shoot right up. Like this. So it's an important point because I always have to remind myself as I'm looking at this product, you can always apply technical analysis to things. It's simply observing behavior of market participants and their conviction with how they choose to buy and sell. Now with that, you can read into it a lot and you can determine standardized patterns, behaviors, and extrapolate that across a broader data set. You can't really do that as well with GameStop. I",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "behavior of market participants and their conviction with how they choose to buy and sell. Now with that, you can read into it a lot and you can determine standardized patterns, behaviors, and extrapolate that across a broader data set. You can't really do that as well with GameStop. I run studies on all the different kinds of studies I like to use. You'll notice that I switch between them sometimes based on what I'm kind of flagging is working really well at a given point in time in a current market condition. And GameStop fails them all the time when you kind of want the most. So what I mean by that is during this less volatile period going back in here, you can come up with some pretty good ideas of standard technical analysis. But even these kinds of really big moves, you don't, it's really difficult to pinpoint the pivot. So that's okay. That's kind of what makes it special. And that's why I like using options also to just use it as an amplifying function of determining price behavior. So what are we seeing here? Downtrends continuing. I still think 21 is very likely on the horizon. Hopefully not. But what makes me say that is I'm seeing the buy volume continue here. Right. So you can see essentially coming back to 26 July, we've had buy volume, I'm sorry, sell volume on a daily basis coming in above 90 every single day. So there's just",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "horizon. Hopefully not. But what makes me say that is I'm seeing the buy volume continue here. Right. So you can see essentially coming back to 26 July, we've had buy volume, I'm sorry, sell volume on a daily basis coming in above 90 every single day. So there's just people selling and there's a lot of people selling here. Why? Who knows? And you can see that the point of control is now up here. I imagine for a lot of people, there's fear about getting stuck in the stock at 20 when it's spent a long time below 10. Now that still doesn't seem like the floor to me. We've had a couple conversations about this. It looks like after this 21 handle where I'm pricing it off of this node, it looks like the next next node is here at like 15. You can see it right in there. So I'm just referencing where people previously transacted with the underlying, but you can see another node building right here in the 17 handle 1771. So there's a good chance that buyers will continue to step in down here as well. But we are getting into a later volume area. And all that means is price becomes more loose in those zones. It means that there's not enough not as much support or resistance. That's why price bounces around and these kinds of things very quickly. Right. As you see, price like this, making these kind of moves.",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "volume area. And all that means is price becomes more loose in those zones. It means that there's not enough not as much support or resistance. That's why price bounces around and these kinds of things very quickly. Right. As you see, price like this, making these kind of moves. Look how light that volume is. But it's just flying through this. And it's because there's not much support or resistance to slow it down. And you'll see that when there is a lot more support and resistance that's built out over time due to heavy volume, price becomes sticky around those points until it starts traversing above or below. And in this case, we're dripping traversing below this most recent point of control. So let's take a look now at the options. I'm seeing 701,000 calls against 388,000 puts. So again, this is not the most bullish configuration I've seen for this product specifically. I'm seeing continued build out in 16 August. I've said that multiple times now. But on the call side, that's where most of the volume is starting to dump in. Now what I do want to show you, this is total li across all the options. Change. Check. Take a look at these. This is in 17, Jan 25. So we have some pretty long expiration starting to pop up 17, Jan 25. Again, the 125. So there's already 20,000 of those. If we look across the current strikes for calls where the most li",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "options. Change. Check. Take a look at these. This is in 17, Jan 25. So we have some pretty long expiration starting to pop up 17, Jan 25. Again, the 125. So there's already 20,000 of those. If we look across the current strikes for calls where the most li is, this is essentially tied for third. So there's a massive amount of options being built out in these longer term explorations. And they're creeping up, which is really interesting. Even this expiration cycle, which is the 18 October 24, right? That's 78 days out. So that's interesting to see. And this is something I've been talking about where it feels like we continue to have so much centralization in these near term explorations. But it's actually starting to slide out a little bit into the next primary expiration and then even further out than that. So what does that tell me from an options perspective? It just looks like the market is being priced in for a more mellow two weeks. And I've said that before, I can I'm just reiterating that sentiment as far as I can see. Now sometimes people will say that I say a lot of stuff in the video, but not there's nothing that they can pull out. So I'm trying to make it more clear. I try to avoid that typically because I want people to come to their own conclusions. But for those that are unfamiliar with like how to take the",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "of stuff in the video, but not there's nothing that they can pull out. So I'm trying to make it more clear. I try to avoid that typically because I want people to come to their own conclusions. But for those that are unfamiliar with like how to take the information I'm saying and decipher it into or I guess interpret it not really decipher. It's pretty clear in my opinion, but to turn it into usable information, I'm trying to specifically call those out for you guys. So here in 16 aug, this is where things are the busiest next. And it's not crazy for the at the monies. So the 21 and a half are very light. The 22s are a little bit busier, but you can see out here at the 25s, that's a very dense, very dense strike 17,000 liat 25s with 3600 transactions today and 1100 net new over yesterday. So I bring that to your attention because it tells me people are building in this expiration cycle. They're not taking positions whereas if I look in here, notice, and this is exactly what I expected based on the video yesterday if you were called that I thought the 25s people would be taking down and rolling out. And that's exactly what they're doing. So you can see that there was negative 4,000 on the OI net. That means people close these positions. My guess is again that they're just moving them out in time.",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "that I thought the 25s people would be taking down and rolling out. And that's exactly what they're doing. So you can see that there was negative 4,000 on the OI net. That means people close these positions. My guess is again that they're just moving them out in time. So not seeing the price behavior and they're trying to salvage what they can of the remaining time value. So what's the play here for me? I still have my long shares and I intend to hold those. I have decent basis on them, but even if I didn't like I told you guys I plan to hold them just to support the ape movement. I like I like it. I like what you guys are about. It's fun for me to participate. So that's the deal with the shares and I highlight that because I'm essentially turning the trader part of my brain off and I'm using some money to participate. Now the trader part of my brain has short calls on still in 20 September against the long shares that I've already made some money on. I've rolled them down and I probably will scrub a little bit more off of them because they're producing and it's just allowing me to not just see the unrealized gains on my shares dwindle, but it's allowing me to take some money and while that's happening. In terms of long options, I've none of them right now in GameStop and I",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "more off of them because they're producing and it's just allowing me to not just see the unrealized gains on my shares dwindle, but it's allowing me to take some money and while that's happening. In terms of long options, I've none of them right now in GameStop and I don't intend to until I start to see it paving closer to what I want. So really what I'm paying attention to is when do I see more buying volume, right? Because right now it's not here and somebody else made a comment about how, you know, they said that the buyers have never stepped away, which I appreciate. I know that the apes have always been there. But what I mean is from a broader market perspective, you need big volume and with the amount of the at the money offering that came through, there's a lot of shares floating around right now. So the flow isn't as locked up as it used to be. So what that means is this that's partially good and bad. It's good in this case because even though we're seeing these sellers coming through in mass, they're not really crushing the price. It's going down, but they're not crushing it, which again is probably because a lot of shares got also picked up during the at the money offering. So we'll have to see where it starts to stabilize. That's what I'm most interested in. When does this start consolidating? That's where I",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "going down, but they're not crushing it, which again is probably because a lot of shares got also picked up during the at the money offering. So we'll have to see where it starts to stabilize. That's what I'm most interested in. When does this start consolidating? That's where I start looking at in long options. That's where I start looking to add more shares. For me, the trading side of my brain, when I see something going down, I'm not going to build a long position until it's tenor changes. The down inside of that, I very rarely top tick or bottom tick something. So even this move here, when I first started getting in in the beginning of the May, I waited until this breakout came through. So I didn't get in here. I didn't get in here. These periods obviously would have made me some more money. But the problem is, again, from a trading perspective, I'm thinking about probabilistic outcomes, what's most probable to happen and then how can I put money behind those ideas? So that's why I think about it the way I do. So as always, any questions, let me know through them in the comments. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  },
  {
    "text": "in the comments. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "TTX-FFvReOk",
      "title": "Unemployment & GME Analysis",
      "url": "https://www.youtube.com/watch?v=TTX-FFvReOk",
      "upload_date": "",
      "duration": 959.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TTX-FFvReOk&t=0"
    }
  }
]