[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you we're looking at. We have this band and then we have this band. If I were to take this band and I were to stretch it and you can see that I actually lined it up pretty well with these the grid lines here. And let's say that I take this band and I stretch it up to this point here. And let's say I do the same thing here. So what is that one, two, three, four? So we go from here, one, two, three, four. Unfortunately, it's really close to this. What's the difference between these bands? Let's say that there's tension as you can see on the first band. And then what I was trying to make clear on the second band is that there's some slack. So as I expand, as I pull these bands up, what's the difference between these two bands? If I were maybe to just let go of the band, what do you what do you think would happen? If we were to run a little little trading experiment together and we have these two bands, top band, bottom band, I expand them both the same distance through the same length, pretend they're the same length. They're not really this one should be over here. There you go. Lauren",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 94,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=0"
    }
  },
  {
    "text": "If we were to run a little little trading experiment together and we have these two bands, top band, bottom band, I expand them both the same distance through the same length, pretend they're the same length. They're not really this one should be over here. There you go. Lauren is on it. This top band would have probably much greater downward force as soon as I let go the one with slack can kind of take up some space. So maybe the band with looks like this once we stretch it out, right? The point that I'm trying to make here is the concept of actual mean reversion. Mean reversion is this function, whereas something gets too extended one way or the other. So in this case, if we extend it this way or this way, these bands, this band wants to come back here. Wants to be about this range here. This band doesn't really care as much. This band will say, okay, we'll use you stretch me to this point up here. And once the slack is out, I'm already at this point. So then if you let go of me from here, I'm just going to cover this distance. I don't really care that much. This is the difference of a mean reverting asset compared to a standard growth asset of some sort. So to bring all of this back to the current chart that we're looking at, I want you to take a look at",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 94,
      "start_timestamp": "00:13:01",
      "start_timestamp_seconds": 781.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=781"
    }
  },
  {
    "text": "cover this distance. I don't really care that much. This is the difference of a mean reverting asset compared to a standard growth asset of some sort. So to bring all of this back to the current chart that we're looking at, I want you to take a look at every single time. Well, that's a terrible line. Every single time price moves away from this midline. It pops up and then it goes back down. It pops up a whole lot. And then it goes back down. It goes below. And then it goes back up. The other thing I want you to notice is the slope of this channel. We have one endpoint here. This is for a five year weekly chart. We have one endpoint here. So let's take a look at this from this midpoint here is at 2865. Now this is after the COVID crash. So actually, let's zoom this out even more. Let's do a 10 year and we'll clean those off. Let's use a 10 year chart. So 10 year chart, we have 20.7 here. And then back here, we have 16. 16 to 20.7. So it's four points. Let's take a look at an example together. Now I want you as we're doing this, I want you to remember what we're doing. We're understanding why volatility itself is an interesting asset class. So the difference here from 16 call it to what is this 20 20.7. The difference between 16 and 20.7",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 94,
      "start_timestamp": "00:14:15",
      "start_timestamp_seconds": 855.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=855"
    }
  },
  {
    "text": "at an example together. Now I want you as we're doing this, I want you to remember what we're doing. We're understanding why volatility itself is an interesting asset class. So the difference here from 16 call it to what is this 20 20.7. The difference between 16 and 20.7 is a 29.38 slope in terms of absolute return. That means from here to here, we've moved 29 obviously. It's a smaller asset, so a smaller move. Let's now keep the same chart 10 year monthly, but let's go to SPX. What do you notice right out of the gate? What do you notice? There's a couple things that should strike you as very different than what we just looked at. This should help you understand what mean reversion actually is. Now, not to get too far off topic and get into the world of mean reversion too much, but the other thing we have to pay attention is time frame. When we're comparing long term mid term short term, because if you look on a shorter term cycle, first, let's start with the comparison we were doing in the other one. What's the difference between these two points? This is going to tell us the slope. This is going to tell us how much has this changed over the same reference period compared to the other. So it starts down here at 1645. Let's log that here 1645. And then it caps out here at 5197. 5197. It's a",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 94,
      "start_timestamp": "00:15:36",
      "start_timestamp_seconds": 936.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=936"
    }
  },
  {
    "text": "is going to tell us the slope. This is going to tell us how much has this changed over the same reference period compared to the other. So it starts down here at 1645. Let's log that here 1645. And then it caps out here at 5197. 5197. It's a 216 return from here to here. Compare that to the 20 return that you saw in VIX here. The point that I'm making is that in a long term time frame, something like equities do not exhibit mean reversion. They exhibit drift. Very different function. Mean reversion is essentially a compelling force where as things move out of a band, they are literally migrated back into a relation of the original band. In this case, the line of best fit of the standard deviation channel. You do not see that on SPX. Why does this matter? Why am I spending so much time at the beginning of this in terms of recapping this point? Why trade options? Why am I spending so much time on this point about mean reversion and volatility? It's because as an options trader, you literally gain access to one of the most predictable, the most predictable market functions that exist volatility in mean reversion. You get that right here. You do not get that with price. Price sometimes will go up a day in a row. Well, this is a month. Sometimes it'll go up a month in a row. Sometimes it'll go up seven",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 94,
      "start_timestamp": "00:17:07",
      "start_timestamp_seconds": 1027.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1027"
    }
  },
  {
    "text": "predictable market functions that exist volatility in mean reversion. You get that right here. You do not get that with price. Price sometimes will go up a day in a row. Well, this is a month. Sometimes it'll go up a month in a row. Sometimes it'll go up seven months in a row. Then it will be down one up, one up. It'll be all over the place. Now, one admin note. When we're talking about order term time frames, price in equities driven by sentiment can exhibit some elements of mean reversion. But it's not true mean reversion because the difference is exactly as I've painted for you here. This is appreciated over 200 over this time frame. There's nothing that's pulling it down every time it goes up. It's pulling it down a little bit, but then net net. It's moving up higher over time. That's called drift. When we look at something like VIX, it's the opposite. Literally VIX starts to pop a lot. It literally gets ripped back down. This is exactly why for those that were in some of the live streams throughout the past week is soon as VIX cracked above 20 literally recently. I had just spoke about trading it and trading it to the downside. I gave two different ways that a trader could trade it to the downside. I actually suggested people paper trade it. You could see how this works. You can either do it via short puts, which",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 94,
      "start_timestamp": "00:18:42",
      "start_timestamp_seconds": 1122.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1122"
    }
  },
  {
    "text": "recently. I had just spoke about trading it and trading it to the downside. I gave two different ways that a trader could trade it to the downside. I actually suggested people paper trade it. You could see how this works. You can either do it via short puts, which is a little anti-intuitive that's more of a volatility specific kind of approach. Or you could literally just trade it directionally. If you'll recall what I said is if you trade this directionally and you do something like buy puts, you're not going to make much money on it. Why did I say you're not going to make much money on it? Because everybody fucking knows this exact thing. But highly tradable. So going back to this, these are the reasons why options can be so interesting to trade and why they can be so lucrative. Okay, cool. Next one, key market participants. Last time we connected, we spoke about this graph art thing here. And the cliff notes version of this section and why it matters is because we are small fish in a big pond. We have to learn some of our advantages and how we can play those advantages. Because in general, we have very, very few of them. So some of the advantages of retail traders is that we're very small. It means that we can trade things that are literally too small for larger institutions to get into. Sometimes this is where you can find",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 94,
      "start_timestamp": "00:19:57",
      "start_timestamp_seconds": 1197.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1197"
    }
  },
  {
    "text": "those advantages. Because in general, we have very, very few of them. So some of the advantages of retail traders is that we're very small. It means that we can trade things that are literally too small for larger institutions to get into. Sometimes this is where you can find true edge because it can't be tackled by larger entities that have the resources that can see things that look really appealing there. But it's just too small. It just doesn't make sense for them anymore. The other thing is our ability to move around however we need to. And what I mean by that is we can be full long one day, full short the next day for a lot of people that kind of movement actually can lead to negative performance because we get whipsawed, we don't have a defined plan. But if you learn to master that, it allows you to move much more quickly with the market. You essentially are riding the tide, the coattails of the larger participants. That's the cool part about being a retail trader. Is there is a small niche for us that we can operate that even as a small retail trader, meaning you have sub 50 million dollars essentially, you have plenty of room to move around. Once you start getting above like 25, 50 mil, then you do start running into some positioning problems. You're kind of like the size of a small fund almost at that point. Really",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 94,
      "start_timestamp": "00:21:17",
      "start_timestamp_seconds": 1277.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1277"
    }
  },
  {
    "text": "trader, meaning you have sub 50 million dollars essentially, you have plenty of room to move around. Once you start getting above like 25, 50 mil, then you do start running into some positioning problems. You're kind of like the size of a small fund almost at that point. Really once you get over 100 mil. Okay, the next thing, when do we decide to trade an option versus the underlying? We already talked about options adding complexity options give us more things that we have to track and pay attention to. So when would we want to trade options as compared to the underlying? There are a few instances, and that's cool part. There's really not a whole lot of them. There's just a few instances. In general, equity outright is a simpler position. So if I wanted to trade options instead of equity outright, why might I do that? Well, one of the first reasons is for leverage. I can control. This is an old thing obviously before the split and Nvidia. But it's a good example because at the time that I made this, Nvidia was trading at 11.05. And if I wanted to buy 100 shares of Nvidia, I need to put up 110K. The option equivalent at that point was 15K. That's leverage. I am controlling a much larger amount of money, which a much smaller amount of money. So that's one of the reasons why we might decide to trade options. The other thing",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 94,
      "start_timestamp": "00:22:27",
      "start_timestamp_seconds": 1347.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1347"
    }
  },
  {
    "text": "of Nvidia, I need to put up 110K. The option equivalent at that point was 15K. That's leverage. I am controlling a much larger amount of money, which a much smaller amount of money. So that's one of the reasons why we might decide to trade options. The other thing is if we want to isolate other profit mechanisms, meaning if I want to trade something that's going sideways and actually capitalize on volatility, or if I just want to capitalize on theta and take in risk premium, that's another completely viable approach. So the main times we look to add options is when they make sense. The way they make sense is if we're doing things like this, that are specific to an asset like options and are not available in something like equities. I make this point because sometimes traders can make the mistake of automatically always defaulting to something like options. And that's not always the right answer. Because let's say that I have a portfolio. I don't really care how much money I'm using because it's a large enough portfolio. And I'm going to be controlled more by risk than position size. And I put on something. And when the trade goes on, I can either put it on with options or equities. Well, if I don't care how much money I'm using, and I don't want the leverage because I can put on the size that I want in the underlying itself, I just use",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 94,
      "start_timestamp": "00:23:34",
      "start_timestamp_seconds": 1414.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1414"
    }
  },
  {
    "text": "something. And when the trade goes on, I can either put it on with options or equities. Well, if I don't care how much money I'm using, and I don't want the leverage because I can put on the size that I want in the underlying itself, I just use the Delta one. I just use the underlying because now I don't have to deal with days to expiration. Now I don't have to deal with Vega as volatility changes and how that impacts the premium of my option. I don't have to deal with slowly dealing with theta decay as the premium is eroding out day over day of those options. So the point is just avoid automatically backing into something because there can be other periods, other approaches that might make sense. Okay, so now we can get into the session for today. Reading an options chain literally is going to be done as we go through this. So close that down. Open this one up. Here we are buying versus selling options. First thing, let me update our little timestamp here. We are at 26 minutes. This is for anybody that wants to rewatch these. So this will be buying versus selling. Okay, so when we look at an options chain, we know, let's grab a ticker. Let's grab something like so-fi. Just grab an random ticker. And if we go into the options chain, if you guys have any questions on how to read this, let",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 94,
      "start_timestamp": "00:24:42",
      "start_timestamp_seconds": 1482.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1482"
    }
  },
  {
    "text": "will be buying versus selling. Okay, so when we look at an options chain, we know, let's grab a ticker. Let's grab something like so-fi. Just grab an random ticker. And if we go into the options chain, if you guys have any questions on how to read this, let me know. The expectation is most people for this will at least be somewhat familiar with what this thing looks like and how to read it. So looking at the options chain, we can see that there's a bunch of different expressions, a bunch of different vultilities that are specific, all relative to the expiration duration itself. We can click in here and we can see all our different strike prices. We can see calls on the left, puts on the right, all that kind of stuff. So this number here is premium. What the fuck is premium? One of the things you'll notice in options trading in finance in general is we use a lot of stupid words to make shit more confusing than it needs to be. And this is an artifact of that. This is simply the value. This is equivalent of the stock price. This the premium is the stock price effective of an option itself. So this 17 call is currently bid at 132 offered at 135. So what this means is right now the most somebody is willing to buy it for as a dollar 32, the cheapest somebody is willing to sell it",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 94,
      "start_timestamp": "00:25:57",
      "start_timestamp_seconds": 1557.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1557"
    }
  },
  {
    "text": "premium is the stock price effective of an option itself. So this 17 call is currently bid at 132 offered at 135. So what this means is right now the most somebody is willing to buy it for as a dollar 32, the cheapest somebody is willing to sell it for as a dollar 35. Typically, what's resting here will be orders placed by market makers. They rest orders to provide liquidity. And they have specific regulations on how much they need to offer liquidity, meaning how often they have to have their quote machines turned on and provide those numbers. Now they can fuck with those numbers. They can make it really illiquid. They can make it really unattractive, but they still have to provide it. So we're faced with the choice. The first choice with every single option is do we want to buy it or do we want to sell it? The way we answer that is pretty simple. And on the slide, we're going to go through a series of decisions together. Then I want to give you some considerations to keep in mind as you apply this practically. And then at the end, I want to walk through actually structuring a few trades with you in making the decision together live on current names that are happening right now if we might want to buy or sell. So first, let's start with understanding the differences between buying and selling premium. The first thing is we",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 94,
      "start_timestamp": "00:27:12",
      "start_timestamp_seconds": 1632.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1632"
    }
  },
  {
    "text": "to walk through actually structuring a few trades with you in making the decision together live on current names that are happening right now if we might want to buy or sell. So first, let's start with understanding the differences between buying and selling premium. The first thing is we know, hopefully we should know. Let me grab one. I need a, you know, like a peacock. I got to be able to draw. I need this up here so I could draw. Let me draw. Here we go. We're ready to rock. Beautiful. Grab my notepad. So the first thing we have to identify is that we have an options contract. And we know for every single options contract, there are two people. Fire and a seller. Typically, there's a facilitating party in the center of this. Which is a market maker. The main point I want you to take away from this section is that there are two components, a buyer and a seller. Every single contract needs a buyer and a seller. Think of your insurance for anything that you have insurance on. There are two parties to your insurance. The first party to your insurance, this is actually better done here. The first party to your insurance is you. You want insurance. You're going to buy insurance. You're the first party. The second party is the insurance provider. Whoever the agency is, all state, state, farm, whoever you're going through for your insurance. One entity is",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 94,
      "start_timestamp": "00:28:25",
      "start_timestamp_seconds": 1705.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1705"
    }
  },
  {
    "text": "is actually better done here. The first party to your insurance is you. You want insurance. You're going to buy insurance. You're the first party. The second party is the insurance provider. Whoever the agency is, all state, state, farm, whoever you're going through for your insurance. One entity is selling the insurance. The other entity is buying the insurance. That insurance has a contract. There are different rules that apply to the insurance that typically amount to how can we not pay you but take your money, you know, standard insurance. So that's an insurance contract. It's the same thing in options. In options, there's a contract with two components, two people that are tied to that contract. So let's start now with understanding the differences between those two perspectives. I'm grabbing an overview somewhere. Here we go. We're not going to go through this whole thing. It doesn't really matter. I want you to specifically focus on this section. So this section here gives you an outline of what things look like for the buyer of an option as compared to a seller. And again, just keep the insurance thing in the back of your brain because that's kind of what it is. If you think about the purchaser of an insurance, they're paying a premium. I'm giving you money. And the deal is if there's a covered loss, you cover the loss. The point and why people buy insurance beyond the insurance that's just literally legally mandated,",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 94,
      "start_timestamp": "00:30:05",
      "start_timestamp_seconds": 1805.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1805"
    }
  },
  {
    "text": "kind of what it is. If you think about the purchaser of an insurance, they're paying a premium. I'm giving you money. And the deal is if there's a covered loss, you cover the loss. The point and why people buy insurance beyond the insurance that's just literally legally mandated, it's to reduce severity. What that means is I might pay two two hundred bucks a month, whatever it is for my insurance. And I just pay that two hundred bucks every month. I can fit it into the budget, losing the two hundred bucks isn't fun, but I can stomach it. It's okay. And then if I have a covered loss, let's say that there's unfortunately a car accident and the car is totaled. Well, let's say I'm found at fault in some capacity. Maybe it wasn't my fault at all, but somebody hits my car, totals, it drives away. We have no idea who they are. Well, then me as the consumer as the end point, the buyer of the insurance, well, I'm like, shit, I don't want to go buy a 60,000 car. That's a lot of money to come up with at once to replace this thing. And I don't want to pick up a car payment that's going to be double whatever my prices, which fun fact offshoot, you should never have a car payment. You should never have a car payment. One of the worst possible kinds of payments you can have. It's dumb.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 94,
      "start_timestamp": "00:31:46",
      "start_timestamp_seconds": 1906.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1906"
    }
  },
  {
    "text": "thing. And I don't want to pick up a car payment that's going to be double whatever my prices, which fun fact offshoot, you should never have a car payment. You should never have a car payment. One of the worst possible kinds of payments you can have. It's dumb. You don't have a car payment. Just buy a car that fits within your budget. That aside, you don't want to come up with the money out of pocket. So that's the point of insurance. I pay 200 every month to make sure that if some shit happens, I'm covered and it reduces my overall severity. Even if in the aggregate, I pay more than the value of the car over the entire life cycle of the car. I'm okay with that. And the reason I'm okay with that is because it reduces the severity so that I'm not stuck having to pay 60,000 at one point in time. So the buyer receives something. Now, the difference in the departure from options versus insurance is the way settlement occurs because in options, the buyer, if it's an American style option, they can exercise whenever they want, even if it doesn't make sense, they can. So a big, big difference in something to be aware of in options, especially specifically, American style option is that they can be exercised at any point in time. The seller, it's to be aware of that because you can be on the hook to deliver",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 94,
      "start_timestamp": "00:32:53",
      "start_timestamp_seconds": 1973.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=1973"
    }
  },
  {
    "text": "make sense, they can. So a big, big difference in something to be aware of in options, especially specifically, American style option is that they can be exercised at any point in time. The seller, it's to be aware of that because you can be on the hook to deliver whatever your end of the bargain is, whether you've sold a call or sold a put two different scenarios. And you can see those down here, I purposely give you and I recommend grab a screenshot. I actually think what's better is you make your own, the process of making your own is valuable. But this here just gives you a quick little cheat sheet on how these things move with respect to stock price volatility and then opening closing transactions and who's on the hook to do what. But what you'll notice is that the seller is on the hook to do some shit. If you sell a call, you're on the hook to buy, I'm sorry, you're on the hook to sell shares. So if you sell a, if you sell a call, you're on the hook to sell somebody shares at a set price, the strike price. And then if you sell the put, you're on the hook, the buy shares. One thing to know is that the majority of options are closed before expiration. So the majority of instances will not include these transactions here. And it's because in general, they're just inefficient. It doesn't make",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 94,
      "start_timestamp": "00:34:09",
      "start_timestamp_seconds": 2049.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2049"
    }
  },
  {
    "text": "And then if you sell the put, you're on the hook, the buy shares. One thing to know is that the majority of options are closed before expiration. So the majority of instances will not include these transactions here. And it's because in general, they're just inefficient. It doesn't make sense. And we can get into that at another point in time. But the way to think of it is when we talk about the premium of an option, the premium of an option has a couple key components. One of them is time value. When you exercise your option, whether you bought a caller or put and you exercise it, you give up your time value that otherwise you could recover. So that's why in general, it doesn't make sense. Now again, there's nuances to this that we can get into at some point. Okay. So to recap what we just talked about, we now understand the perspective of buyers. We now understand the perspective of sellers. We now understand that people that sell calls have an obligation to sell shares at a certain price. We now know that people that sell puts have the obligation to buy shares at a certain price. We also now know that in general, it doesn't make sense to exercise the option. So what does that tell you? It tells us that most of us are trading the options contract itself without necessarily why going into why got to real learn says, oh,",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 94,
      "start_timestamp": "00:35:19",
      "start_timestamp_seconds": 2119.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2119"
    }
  },
  {
    "text": "at a certain price. We also now know that in general, it doesn't make sense to exercise the option. So what does that tell you? It tells us that most of us are trading the options contract itself without necessarily why going into why got to real learn says, oh, I understand why selling puts can be bullish. Bingo. There you go. That's exactly correct. So this becomes a useful exercise and we can sell options by options, depending on what we're trying to do. But most of us are simply trading the contract. And we're using those unique aspects of an options contract that we talked about earlier as the rationale for trading and options contract. So quick pause here after we just talked a whole lot about premium of an option buying, selling. Are there any questions? And in the meantime, I'm going to update our timestamps. So premium, buying, selling, settlement, and that's pretty good. Any questions on any of this stuff? I made like a liquid IV, but I've watered it down too much. So it just kind of tastes like slightly, slightly off flavored water. Lauren says I have questions, but I think they might be answered later looking at your sidebar. Sure. Well, let's get over to that now because that's the next step. The next step in this process is comparing buying versus selling options kind of line by line. So let's do that now. So we're at 3830. And we are talking",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 94,
      "start_timestamp": "00:36:30",
      "start_timestamp_seconds": 2190.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2190"
    }
  },
  {
    "text": "be answered later looking at your sidebar. Sure. Well, let's get over to that now because that's the next step. The next step in this process is comparing buying versus selling options kind of line by line. So let's do that now. So we're at 3830. And we are talking about combining or comparing to buying first, selling option. And then don't worry because at the end, I'm literally going to give you like a specific framework. And it's not like Eric secret framework. There's nothing secret about this shit. It's just to give you a way to think about this so that it at least makes sense. Now I'm going to slide this over just a little bit so that my head isn't directly over this. I think it's good now. And let's kick off. So the difference between buying and selling. We're going to start with the entering transaction. Pretty simple. When we're buying something, we're buying to open. When we're selling something, we're selling to open BTO STO. Now what this means is if I'm buying to open, it means that I'm giving money. And after I give the money, I have an open position. Selling to open means I am taking money. I am receiving money. We call it a credit. I get a credit. And then I have an open position. When we're buying, it is a debit. So the inverse is the inverse. Pretty simple. Probably can move through this part a little quickly",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 94,
      "start_timestamp": "00:38:08",
      "start_timestamp_seconds": 2288.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2288"
    }
  },
  {
    "text": "open means I am taking money. I am receiving money. We call it a credit. I get a credit. And then I have an open position. When we're buying, it is a debit. So the inverse is the inverse. Pretty simple. Probably can move through this part a little quickly because I don't think this should be a big shock. We're just going to do the opposite of what we did to get in. And again, for those that are wondering, this is how the majority of options contracts are going to be settled is through this transaction process of buying and selling just like that. Okay. Risk profile. Now we start getting into the differences. The differences that matter a lot. So one of the first differences here is you'll notice that if I buy premium, I have defined risk. That means the most I can lose is whatever I bought it for. And if I sell premium, I have undefined risk. That means I can lose a non-symmetric amount to whatever I collected up front. So let's take a quick look at what this can look like. We'll stay in so if I just because we're here, let's keep it on the 17 call just because and let's take a look at buying and selling the same call. And let's do... Yep, this is fine. So let's get rid of this. I'm actually going to do the opposite trade as well in the same spot. Let's delete this.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 94,
      "start_timestamp": "00:39:26",
      "start_timestamp_seconds": 2366.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2366"
    }
  },
  {
    "text": "keep it on the 17 call just because and let's take a look at buying and selling the same call. And let's do... Yep, this is fine. So let's get rid of this. I'm actually going to do the opposite trade as well in the same spot. Let's delete this. So it's out of the way. And let's take a look first at buying it. This is called a risk profile. So risk profile, you can plot this for yourself. You literally can make this in Excel. It's super simple. It just looks across different strike prices and then different PNLs based on... I'm sorry, this is in strike prices. This is prices of the underlying. And it looks at different PNLs at different values of the underlying. So here, notice two things. The first thing is the loss component, which is what's below zero on the y-axis here. And you can see that it levels off. It's flat. That means once you get to that point, so all you got. And again, think of it logically. If I pay 100 for something, that's what I give up. That 100. Even though if, let's say I'm flipping shoes, I know people do that, which is just such a crazy thing to me because I don't know anything about shoes. But somebody will pay for shoes. You give money upfront and then you get the shoes. And then the idea is that the shoes might be worth more if you're good",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 94,
      "start_timestamp": "00:40:37",
      "start_timestamp_seconds": 2437.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2437"
    }
  },
  {
    "text": "people do that, which is just such a crazy thing to me because I don't know anything about shoes. But somebody will pay for shoes. You give money upfront and then you get the shoes. And then the idea is that the shoes might be worth more if you're good at this. So you're given the money upfront, you get the shoes. And then later, you're going to try to give the shoes to somebody and collect more money. The same thing that's going on here. But if you buy those shoes and then those shoes turn out to be worthless because they're fake, the most you can lose is whatever you paid upfront for those shoes. Same thing here. So when you're buying an option, the most you can lose is what you pay for the option. The inverse occurs when we sell options. You'll notice that if I squish this down and we go further and further and further and further and further out and we see so far, I imagine I've never actually done this. I'm curious how far this goes. 900 that this is actually kind of fun. I'm not going to lie. 41 million. It's got to stop at some point. 600 million, 30 billion. I did not think that this would go into the billions. This is crazy. If this goes into trillions, I'll stop after trillions because I cannot believe that this is still going. Oh no, it's stuck. I think we're stuck.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 94,
      "start_timestamp": "00:41:43",
      "start_timestamp_seconds": 2503.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2503"
    }
  },
  {
    "text": "got to stop at some point. 600 million, 30 billion. I did not think that this would go into the billions. This is crazy. If this goes into trillions, I'll stop after trillions because I cannot believe that this is still going. Oh no, it's stuck. I think we're stuck. No, we're still in the billions. This is crazy. Okay. Well, anyways, the point hopefully is proved because now it can't even calculate it. It literally just says infinite. So what this is actually showing you though is you have unlimited risk in the direction that it goes against you. Now it's not truly unlimited risk. It's just really big risk. It's not truly unlimited risk because sooner or later is weird as this is going to sound sooner or later, the world literally runs out of resources. Right? There's only so much value on planet earth of things at a given point in time. This is theoretical and conversation, but I want the point to be clear. So what that means is even though we can just chart this of going into the hundreds of billions of dollars in terms of stock price, that's not in terms of market cap. That's in terms of stock price. There comes to be a natural cap in terms of literally what code what is the total amount of value that literally exists today. So just be aware of that. It's the same thing to the downside. When we sell an option like",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 94,
      "start_timestamp": "00:42:44",
      "start_timestamp_seconds": 2564.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2564"
    }
  },
  {
    "text": "cap. That's in terms of stock price. There comes to be a natural cap in terms of literally what code what is the total amount of value that literally exists today. So just be aware of that. It's the same thing to the downside. When we sell an option like if we sell a put, we typically say that the risk profile is undefined, which is always comical to me. It's actually defined, right? A stock can go to zero. That's defined, but we refer to it as undefined risk. The reason why we refer to it as undefined risk is that it can go to those extremes and it can go as far along those extremes technically as it wants. Now the reality is obviously that's not how price works. It's not very frequent that you see stocks go to zero. And I've never seen a hundred million dollar stock price for a stock, right? So there becomes natural limitations to it. But the point I'm making is that defined versus undefined. A travel says when you sell an option, don't you also know the max you can lose as long as you do not do naked? For example, on selling a put, is the strike minus premium received? There's not a max loss. That's incorrect. So travel says so it is undefined, but there is a max loss. Nope, that's incorrect. What you're calculating there is your break even point, which actually is a couple away from here.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 94,
      "start_timestamp": "00:44:15",
      "start_timestamp_seconds": 2655.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2655"
    }
  },
  {
    "text": "on selling a put, is the strike minus premium received? There's not a max loss. That's incorrect. So travel says so it is undefined, but there is a max loss. Nope, that's incorrect. What you're calculating there is your break even point, which actually is a couple away from here. But say for example, you sell, what did you do? You use an example of selling a put. If you sell a put and you have your strike price less the credit received, that's just giving you your break even point. You still have undefined risk of that option. Technically, technically undefined risk as I was talking about before, the stock can only go to zero. A travel says no max. I can lose because I get assigned and the underlying goes to zero. Correct. That's literally the point I was just making is that we refer to it as undefined. But on that option, it still has technically undefined risk, even for a short put. To your point, it's defined down at zero, right? And same thing like I was just making the point of going all the way to the upside, making the hypothetical that so far is trading at 100 million in terms of stock price. We've never seen anything even close to that. You literally run out of resources, literally on earth to call the value infinite of any stock. Any stock is going to have a cap somewhere. Now the commensurate value can slowly rise",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 94,
      "start_timestamp": "00:45:29",
      "start_timestamp_seconds": 2729.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2729"
    }
  },
  {
    "text": "trading at 100 million in terms of stock price. We've never seen anything even close to that. You literally run out of resources, literally on earth to call the value infinite of any stock. Any stock is going to have a cap somewhere. Now the commensurate value can slowly rise and whatnot. But the value, literally the value on earth is not infinite. So the main point is when we're referring to short options as undefined, we're talking about the severity. That's the primary point. So even in the example of a short put, it technically speaking has undefined risk down to zero. Just as any of these stocks have undefined risk up to whatever price it can go to, which leads to the profile, which is the inverse. So the reward is what you make and we just saw this on those options. So if we buy an option, we have undefined profit, but to find risk. If we sell options, we have undefined risk, but to find profit. Begs the question. Who the fuck would do this? Why would I do this? Why on earth would I accept unlimited risk, but limited profit from just a logical perspective that in and of itself makes no fucking sense? It makes absolutely no sense to do something like that. But there are specific reasons why it actually does make sense in practice, which we'll talk about. So let's take a look at the next one. This is one of those",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 94,
      "start_timestamp": "00:46:50",
      "start_timestamp_seconds": 2810.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2810"
    }
  },
  {
    "text": "that in and of itself makes no fucking sense? It makes absolutely no sense to do something like that. But there are specific reasons why it actually does make sense in practice, which we'll talk about. So let's take a look at the next one. This is one of those reasons. Because when you buy premium, you need the stock to move. The stock has to move. And you also need the stock to move in your direction, has to move in your direction. If it doesn't, you will slowly start losing money. So if we go back to this example, let's go back to this long option, you'll notice that there are two lines purple and blue. Purple represents today. Blue represents at expiration. Notice how the purple line right now is much higher than the blue line. Why is the purple line higher than the blue line? Because of X, intrinsic value, time value. What ends up happening is with current price right now, if I buy this option right now, the 17 call, and I buy it with the stock price at 1657, you'll notice that I need this to move in order for me to make anything at expiration. You need the stock price above your strike price plus the premium to make any money with a long call. What you don't need is the stock price above your strike price in order to make money before that time. What this means is right now, the",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 94,
      "start_timestamp": "00:48:07",
      "start_timestamp_seconds": 2887.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2887"
    }
  },
  {
    "text": "anything at expiration. You need the stock price above your strike price plus the premium to make any money with a long call. What you don't need is the stock price above your strike price in order to make money before that time. What this means is right now, the strike price is 17 and paying a dollar 35. Strike price is 17, stock is at 1657. Let's zoom this in a little bit so that you can see a little easier. Let's pretend that the stock goes to 1675. Stock moves to 1675. That's not my strike price yet, but I will make money. If I go to 1675, I make 7.77 today. That doesn't include the passage of time yet. That is if it happens today. This is to short circuit a really common misconception of people who buy options that think the underlying has to go past your strike in order to make money, and it doesn't. It does only at expiration. Before expiration, I'm showing you right now, an example where that is not the case. This is a really small case of it because the numbers are so close. 1657 to 17. Let me show you another example quickly that will hopefully make this point even more clear. Let's pick something that's super far out of the money. Let's pick the 25s. It doesn't have to go to 25 before you make money. My strike is all the way over here at 25. What do",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 94,
      "start_timestamp": "00:49:39",
      "start_timestamp_seconds": 2979.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=2979"
    }
  },
  {
    "text": "you another example quickly that will hopefully make this point even more clear. Let's pick something that's super far out of the money. Let's pick the 25s. It doesn't have to go to 25 before you make money. My strike is all the way over here at 25. What do you notice about that purple line before we get there? The stock can rally to 20. I would pay 17.17 for this option right now looking at the 21.25 call and I would make 55. This is where you see people placing and placing options trades and saying, I made 5,800 that's going to be tied to a smaller, cheap out of the money option that compounded a lot that compounding is due to gamma, which we'll talk about later. Let's go back here and let's take a look now at the selling premium component that has that built in buffer. If I sell a call and right now, Spot Price is 1657, what do you notice that's different than if I sell that call versus buying it? The stock cannot move at all. If it doesn't move before we get into expiration, I make the maximum amount of money I can on this trade if it doesn't move at all. The other thing you'll notice is that even if it moves against me a little bit, I can still make money. Won't be max profit, but I can still make money. This is a big difference between selling and",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 94,
      "start_timestamp": "00:51:23",
      "start_timestamp_seconds": 3083.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3083"
    }
  },
  {
    "text": "I can on this trade if it doesn't move at all. The other thing you'll notice is that even if it moves against me a little bit, I can still make money. Won't be max profit, but I can still make money. This is a big difference between selling and buying and this is one of the benefits of selling is you have a built in buffer to be wrong. But notice the difference here. Take a look at the purple line to the blue line. At this point right here at 1740, that means that the underlying would have rallied against me, if I sell a call it's bearish, so the rally would be against the position. It would rally against the position about one point. That's still, if you look at the blue line, still in profit, but today it's not. I would be showing a loss of 44. Even though if I held that position, and I took it into expiration, it would be worth this case 95. I would literally make money even though the underlying moved against me. That's another one of the benefits of selling. Okay, relationship with volatility. Really, really simple. This is the standard relationship of long options versus short options. Long options, enjoy expanding volatility and shrinking volatility decreases the extrinsic value, decreases the value of the option. So to make this point, I don't know, I honestly don't know the general understanding of most of the people that are in",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 94,
      "start_timestamp": "00:52:56",
      "start_timestamp_seconds": 3176.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3176"
    }
  },
  {
    "text": "the standard relationship of long options versus short options. Long options, enjoy expanding volatility and shrinking volatility decreases the extrinsic value, decreases the value of the option. So to make this point, I don't know, I honestly don't know the general understanding of most of the people that are in here. So I'm going to draw this out really quick so that hopefully will make sense. So if we have, let me get this keyboard out of the way. If we have a premium, so let's say it's a dollar premium and we break this premium out, it will have intrinsic and extrinsic value. Let's say that this option is out of the money. That means that there is zero intrinsic value, not. And then extrinsic value is broken down into two sub components. I'm and vol. The reason why there are two sub components in here is volatility lives essentially volatility essentially lives in time. But there's separate factors because time is linear. I know the days to expiration. I know the expiration of every single option out there. So I inherently know how much time I should decay out per day based on the time input itself. It's linear time is linear. The non-linear component to this is volatility. Because if something is more volatile, it's more likely to have bigger moves. If something is less volatile, it has smaller moves. So then the value of that option is different. Lawrence says, I thought volatility made profits from",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 94,
      "start_timestamp": "00:54:15",
      "start_timestamp_seconds": 3255.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3255"
    }
  },
  {
    "text": "linear time is linear. The non-linear component to this is volatility. Because if something is more volatile, it's more likely to have bigger moves. If something is less volatile, it has smaller moves. So then the value of that option is different. Lawrence says, I thought volatility made profits from call options go down. It depends on which side of the trade your own. So it inherently does not do that. Volatility impacts options like this. Let me hide this so it's not your way. Here. Notice how there's no catty corner relationship here, meaning it impacts one call or put, depending on what you've done differently. What it is entirely based on is if you're long or short the option. So get rid of this component for now. Just make all this go away in your brain. I didn't mean to do that. I thought there was like a fill color. That's not it either. What I was trying to do is hide this. But what I want you to think about is all options. Every single one of them call, put all of them. All options across the board, all of them. Their premium will go up if volatility goes up. All of them calls and puts. If volatility goes down, all options, calls or puts, the premium will contract all of them across the board. They will be obviously different levels of severity, different scale, depending on the other Greeks of the option. But it affects them",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 94,
      "start_timestamp": "00:55:57",
      "start_timestamp_seconds": 3357.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3357"
    }
  },
  {
    "text": "volatility goes up. All of them calls and puts. If volatility goes down, all options, calls or puts, the premium will contract all of them across the board. They will be obviously different levels of severity, different scale, depending on the other Greeks of the option. But it affects them it affects them all in this way. So now it depends if this change in volatility if it helps or hurts my position is if I've bought or sold the option. Because remember, if I buy something, I want it to be worth more in the future. So if I buy a call or if I buy a put, volatility expanding helps me. My option is now worth more. It's the inverse if I sell. But I'm selling options. I want to sell something high and then buy it back to cover lower cheaper. So if volatility goes up, that hurts my position. Whether it's a color put, if I sold it, it's going to hurt me. So the way to think about volatility's impact on options is think of it in terms of the impact on all options. There's new wants, right? We're obviously talking about things in a vacuum. We're talking about no changes in time and all that kind of stuff. There's layers that will factor on to it. But Cedrus Parabus, everything else remaining the same. If we move this component, that's what you will see. So good question. Okay. Let us continue down. Capital requirement",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 94,
      "start_timestamp": "00:57:33",
      "start_timestamp_seconds": 3453.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3453"
    }
  },
  {
    "text": "vacuum. We're talking about no changes in time and all that kind of stuff. There's layers that will factor on to it. But Cedrus Parabus, everything else remaining the same. If we move this component, that's what you will see. So good question. Okay. Let us continue down. Capital requirement is different. Whether you buy or sell premium. Capital requirement when you buy is whatever you paid. You're going to pay that out of your cash and sweep. When you sell premium, you're actually going to collect money upfront that's going to go into your cash and sweep. However, there's going to be a margin requirement. The margin requirement can be different. If you're in a cash security account and you try to sell a call, it won't let you because you can't cash secure a short call. There's no cash securing it. It's undefined. If you want to sell a put, you can cash secure a put because you can take a Simon of the underlying and hold the equity itself. And then your max risk and the equity is the value of the equity. So a little bit different. Now in the context of like a regulation T margin account or a portfolio margin account, they calculate the margin requirement differently. The way to think about margin requirements is it's essentially your broker's method to put the risk of the position onto you. They're not going to take the risk for you. So what that means is they're",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 94,
      "start_timestamp": "00:59:04",
      "start_timestamp_seconds": 3544.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3544"
    }
  },
  {
    "text": "margin account or a portfolio margin account, they calculate the margin requirement differently. The way to think about margin requirements is it's essentially your broker's method to put the risk of the position onto you. They're not going to take the risk for you. So what that means is they're very guarded against people having a bunch of options positions on because if there's some sort of big move that goes against you and you lose on a bunch of these options positions and you don't have the money in the account for it, they've now just taken your risk because they still have to make that position whole. So that's why when markets become more volatile, typically speaking, you will see margin requirements go up because your broker is essentially saying, I see more risk out there today. I'm not going to take that risk for you. You're going to have to put some more money in this account to cover that risk. This is what we call a margin call to satisfy a margin call. You have to add money into the account. Otherwise, there's a chance your broker will start liquidating your positions for you and that's to reduce the broker's risk. Okay. Greeks, this one, I'm a little hesitant to put up but we'll see how this goes for you guys. When you're buying premium, you're going to be short theta long game a long row. Feel good? That makes sense? Partially joking, but partially not.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 94,
      "start_timestamp": "01:00:17",
      "start_timestamp_seconds": 3617.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3617"
    }
  },
  {
    "text": "to reduce the broker's risk. Okay. Greeks, this one, I'm a little hesitant to put up but we'll see how this goes for you guys. When you're buying premium, you're going to be short theta long game a long row. Feel good? That makes sense? Partially joking, but partially not. We'll go through them all. There are a bunch of different Greeks. People have so many misconceptions about the Greeks and we're here to clarify as many as we can. So let me update our little time stamp here. This will be Greek impacts, you're buying or selling. We are at 10230. Beautiful. Right on schedule. Let's take a look at some examples. Notice how I'm not saying if your long calls, long puts, short calls, short puts, I'm talking about it across all options here. Let's keep that in mind. So let's get an example going. Buy, buy to open a call or a put. Literally a call or a put. It doesn't matter either one. If I buy one of these, we already know that when you buy an option, you're gaining leverage, you have defined risk, you have undefined profit. That's a really solid place to be for an investment. So there are compensatory elements to this that makes this not the Goldilocks scenario that otherwise this would be. If there were not drawbacks to this, there's nobody that wouldn't do this. One of those drawbacks is ThetaDK. So ThetaDK simply tells us Theta itself tells us",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 94,
      "start_timestamp": "01:01:23",
      "start_timestamp_seconds": 3683.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3683"
    }
  },
  {
    "text": "for an investment. So there are compensatory elements to this that makes this not the Goldilocks scenario that otherwise this would be. If there were not drawbacks to this, there's nobody that wouldn't do this. One of those drawbacks is ThetaDK. So ThetaDK simply tells us Theta itself tells us the rate of decay of an options premium per one day passing. So options decay. The reason why that matters is because let's take it back to basics. If I bought those sneakers and let's say that those sneakers had a magical spell on them, where at the end of one week, the sneakers aren't there anymore. They've fucking decay away into nothing. My goal is to offload these sneakers super fast because I don't want, I paid 100 for those sneakers. I'm going to try to sell them for more, because I think they're worth more. But if I hold on to them for too long, they're not going to be worth anything. That kind of sucks. So to short circuit this magical sneaker scenario, I'm going to try to move on them quickly. I'm going to try to sell them off quickly and move on with my day and do the human thing of give somebody else the problem. All right, cool. ThetaDK is the same for options. Options or contracts, all of these contracts will conclude at some point. So if we take a look here, let's take a look at a couple scenarios. These are out",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 94,
      "start_timestamp": "01:03:16",
      "start_timestamp_seconds": 3796.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3796"
    }
  },
  {
    "text": "and do the human thing of give somebody else the problem. All right, cool. ThetaDK is the same for options. Options or contracts, all of these contracts will conclude at some point. So if we take a look here, let's take a look at a couple scenarios. These are out of the money options. Let's take a look at the out of the money, 30 delta option here in SoFi. If we take a look at the 30 delta put, it's bid 80 offered at 82. Now let's go into zero days to expiration. Let's see if we can find the 30 delta. It won't be there technically. Since it landed right at 1650, it's actually kind of funny, because it's quoting a penny. But notice the value of all these options. Zero gone. No value left decayed away out of there. So when you are buying options, you're paying money upfront and we know that they're stated decay. Dated decay is the decay of the extrinsic value of the options. So what ends up happening is as you bought this thing for a dollar, if nothing else changes, but time passes, it's worth a little bit less each day. Theta is the Greek that tells you how much less. So that you know. Makes sense so far? I want to isolate this Theta component. So ThetaDK negatively impacts holders. The inversors for sellers, they'll to open, call or put. Yeah, ThetaDK. Now let's talk about a really common misconception",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 94,
      "start_timestamp": "01:04:42",
      "start_timestamp_seconds": 3882.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3882"
    }
  },
  {
    "text": "Theta is the Greek that tells you how much less. So that you know. Makes sense so far? I want to isolate this Theta component. So ThetaDK negatively impacts holders. The inversors for sellers, they'll to open, call or put. Yeah, ThetaDK. Now let's talk about a really common misconception for sellers. Sellers, a lot of sellers will mistakenly tell you that their edge is Theta. There is exactly zero edge in Theta. Theta will not provide you in ounce of edge. Theta is a linear metric that is known. There's no edge in it. The reason why they say Theta is their edge is because they collect money and they think falsely that that provides them a bait in edge. The way to think about in edge in the market is that if there's any sort of edge that's easily accessible by everybody, there's no edge there. It's not a thing. So there are risk premiums. And Theta does not even provide you a risk premium outright. It's the volatility component that provides you a risk premium. We can get into risk premiums in efficiencies versus edge. Don't even worry about that right now. The way to summarize this component is sellers benefit from the decaying of an option. Because again, if I sold something for 100 and then I'm going to look to buy it back, I want to buy it back cheaper. So that decay helps my position as a seller. Okay, so let me take a",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 94,
      "start_timestamp": "01:06:10",
      "start_timestamp_seconds": 3970.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=3970"
    }
  },
  {
    "text": "component is sellers benefit from the decaying of an option. Because again, if I sold something for 100 and then I'm going to look to buy it back, I want to buy it back cheaper. So that decay helps my position as a seller. Okay, so let me take a pause there. And I would love to hear if that so far makes sense. Are we on board? Any questions about the difference between these, why it is what it is, why the behavior is what it is specifically for this Greek. And then, okay, great. So now let's get into Gamma. Let me update my little thing. We're at 10902. Oh, two. Let's get it. Gamma. Gamma is the rate of change of delta. So let's go back to basics here. Every time that we do these, I specifically want you to get into the mental habit of taking it back to the basics of something. So let's grab the options chain. And let me grab this again. I'll just clear all that off. So let's go further out in time here. And here, what happens if I buy this option, and the price goes up? Well, if the price goes up, my option right now is that a 51 delta, it will appreciate by 11 cents. This column here is Gamma. Gamma represents movement. If things start to move, we know that that can impact volatility. That can ultimately benefit our position. So typically speaking, let's use a",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 94,
      "start_timestamp": "01:08:08",
      "start_timestamp_seconds": 4088.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4088"
    }
  },
  {
    "text": "price goes up, my option right now is that a 51 delta, it will appreciate by 11 cents. This column here is Gamma. Gamma represents movement. If things start to move, we know that that can impact volatility. That can ultimately benefit our position. So typically speaking, let's use a simpler example, not of single options, but let's use a long straddle to show you how the Gamma component works. What do you notice about this straddle? Does it care if price goes up or if price goes down? Based on this risk profile, does it have a preference? Next time I am not watering down the liquid IV, not terrible, but it just doesn't really taste like much. It's kind of boring. Reese says, no, that's correct. Lauren, where you at? Lauren, talk to me. Why do you think yes? Why? Yes, Lauren. Lauren, I don't know if you know this. You're the proxy for the group. So yes or no, you tell me the green line cares. Lauren, you've got to be fucking with me right now. That's, I think that has to be what's currently happening. That's the only rational explanation for this so far. There's not a fucking green line on here. Lauren, are you colorblind? Are you actually colorblind? Because if so, that's colorblindness, I feel like is one of those afflictions that's so fun to make fun of, like you can make fun of somebody's disability if they're colorblind. It's not like making fun",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 94,
      "start_timestamp": "01:10:00",
      "start_timestamp_seconds": 4200.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4200"
    }
  },
  {
    "text": "a fucking green line on here. Lauren, are you colorblind? Are you actually colorblind? Because if so, that's colorblindness, I feel like is one of those afflictions that's so fun to make fun of, like you can make fun of somebody's disability if they're colorblind. It's not like making fun of somebody that was born without a leg. Like if you can't see colors, sucks to be you, but that's also one of those ones that you're just going to be made fun of for. Rightfully so. So, joking aside, what this is showing you is that it really doesn't care which way it goes. It technically has a slight preference based on underlying price and where the strike of the straddle is technically speaking, right? Because this is the 17 strike. So technically speaking. But if I grab the 16 and a half, which is actually exactly where it landed, it doesn't have one. Let me see if there's one of them in here. Here we go. This will be a better example. Yeah, there you go. So this one doesn't really care which way it goes because we're buying an at the money straddle. What I'm showing you is that you're long options right now. We don't care which way this goes. That's why this position is long gamma because as long as it moves, that's all we want. We just want it to move up or down. Don't care. Just want it to move. Gamma helps us",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 94,
      "start_timestamp": "01:12:07",
      "start_timestamp_seconds": 4327.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4327"
    }
  },
  {
    "text": "is that you're long options right now. We don't care which way this goes. That's why this position is long gamma because as long as it moves, that's all we want. We just want it to move up or down. Don't care. Just want it to move. Gamma helps us understand the rates of change of delta. Gamma is the ultimate way that this ends up making money is if it gets in a accommodating move big enough to overcome ad expiration to be outside the break even points before expiration doesn't care as long as it moves either way. It doesn't care it on. So this is why buying premium, depending on the premium, will be long gamma in some capacity. Now it's a little bit different because if you use single options, you can have single option positions that benefit from favorable gamma moves. So it's a little bit of nuance in there. The main thing to think about is gamma, like if gamma expands or if gamma starts to increase, that means that volatility is increasing, which feeds back into the options. Now the actual impact of selling a single option, buying a single option, not all gamma would help a position. So when we say long gamma, we're talking about all of gamma increasing, not the change of gamma as the underlying moves. So let me clarify that point a little bit. What ends up happening is this number here gamma represents the rate of change",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 94,
      "start_timestamp": "01:13:20",
      "start_timestamp_seconds": 4400.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4400"
    }
  },
  {
    "text": "gamma would help a position. So when we say long gamma, we're talking about all of gamma increasing, not the change of gamma as the underlying moves. So let me clarify that point a little bit. What ends up happening is this number here gamma represents the rate of change of delta. And gamma helps us understand how volatile something is. If we're trading something that's a little bit more volatile, you will find that the gamma numbers as a raw number, the gamma will be higher. And then the gamma as a relative number to the price of the underlying will be higher because it's expected to move more. That again is essentially a proxy for volatility. If gamma starts to increase, it means volatility is increasing. If gamma is contracting, that means volatility is decreasing. That means that the overall values of the options will be decreasing. Now the reason why it's kind of nuanced and there's two levels to think about this one is because if I buy this call here, that means net net, I'm long gamma. But if this moves against me by a dollar here, like goes this direction, well, gamma is actually hurting me in that case. That's not good. So two different ways to think of it. The way I want you to think of it for the context of this conversation here is long gamma as a general metric across the volatility surface, across aspirations across strikes. Now, row, row is",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 94,
      "start_timestamp": "01:14:39",
      "start_timestamp_seconds": 4479.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4479"
    }
  },
  {
    "text": "me in that case. That's not good. So two different ways to think of it. The way I want you to think of it for the context of this conversation here is long gamma as a general metric across the volatility surface, across aspirations across strikes. Now, row, row is actually really easy, believe it or not. And row doesn't impact stuff that much. So this one should be pretty easy to understand. Row tells us how much options, the rate of change of an options premium relative to changes in interest rates. Interest rates matter across different time frames. So one of the really common misconceptions you'll see is people will say like, oh, this is a direct reflection of the federal funds rate or the sofa rate or things like that. And it's not. It is tied to it for sure because both of those rates will impact the broader rate environment. But it's different for different aspirations, right? So something like a sofa rate is pretty short term in nature. If I'm trading something like this, that's 364 days out, the overnight rate is important. But there's a different rate that's appropriate for this duration as compared to a really short term duration. So just think of it this way again across all options, just like we looked at volatility from before. Remember how we said volatility, whether it's a caller or put, doesn't matter, cross all options if volatility goes up, it makes options more expensive,",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 94,
      "start_timestamp": "01:16:06",
      "start_timestamp_seconds": 4566.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4566"
    }
  },
  {
    "text": "to a really short term duration. So just think of it this way again across all options, just like we looked at volatility from before. Remember how we said volatility, whether it's a caller or put, doesn't matter, cross all options if volatility goes up, it makes options more expensive, right? So then that would naturally benefit buyers and naturally heard sellers. It's the same, it's literally the same exact thing with row. If interest rates go up, options become more expensive. That's immediately going to buyers. It's immediately going to hurt sellers. So gamma and row, gamma's a little more confusing row, I think is pretty straightforward. Okay. Time to take a pause before we get into a little bit of Prak app. We have a little longer left. I'm not in a big rush and I want to make sure that you guys get this stuff. So let's do any questions on this stuff first. Okay. Reese, oh no, your answer and somebody which is good. EHodge says gamma is how much the delta of a contract moves per dollar. Yep. That's exactly correct. We typically refer to it as a one point move. It's just like a dollar is fine. The reason why we call it a one point move is because there are some things that move in handles like options on futures and stuff, which is just a little bit different. But yeah, it's per dollar move. That's fine. You'll also heard it referred to",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 94,
      "start_timestamp": "01:17:32",
      "start_timestamp_seconds": 4652.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4652"
    }
  },
  {
    "text": "dollar is fine. The reason why we call it a one point move is because there are some things that move in handles like options on futures and stuff, which is just a little bit different. But yeah, it's per dollar move. That's fine. You'll also heard it referred to as one point move, which is really annoying, by the way, because when we're talking about points in relation to percentages, it's different than like a one point move in relation to the underlying, which would be synonymous with the dollar as compared to percentages of percentages. You know, just another little fun quirk to completely annoy the living share out of everybody trying to learn this stuff. Thanks, markets. Cool. So it seems like so far we're good. Let's talk about two things now. These should be pretty quick. Some costly misconceptions and then making the decision on when to buy versus ones. So I'm going to update our timestamps, costly misconceptions, of buying pieces like type over here, buying for selling. And yeah, we'll just start there. Beautiful. Okay. So the decision between buying and selling becomes really simple once we understand the individual inputs. One of the big mistakes that people make is before they even start looking at what they're doing, they immediately try to answer should I buy or sell. And that approach doesn't really make sense because we need more information before we make the choice to buy or sell. Now, there's another video.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 94,
      "start_timestamp": "01:18:43",
      "start_timestamp_seconds": 4723.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4723"
    }
  },
  {
    "text": "big mistakes that people make is before they even start looking at what they're doing, they immediately try to answer should I buy or sell. And that approach doesn't really make sense because we need more information before we make the choice to buy or sell. Now, there's another video. I'm going to link to it in the chat there and then I'll also link to it in the timestamps when they come out. But that video is literally, it's a 10 minute video or so that directly compares buying versus selling across all different parameters that we're going to talk about some now. But let's start here. One is not better than the other. There's a reason why that is such an important point. One is not better than the other. The reason why one is not better than the other is because if that were the case, it's time for the dude to grab his dinner. Give me one sec. Let me pop the door. It's funny because he knows as soon as I pop that door that it's like his dinner time, he gets out of here like a bad out of hell. So if one was better than the other, why would anybody do the other? This is a really, really, really common misconception. And it's a common misconception that I notice definitely impacts sellers because sellers have this total misunderstanding that they think what they do is superior to buying. And it's not. It's not",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 94,
      "start_timestamp": "01:20:29",
      "start_timestamp_seconds": 4829.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4829"
    }
  },
  {
    "text": "better than the other, why would anybody do the other? This is a really, really, really common misconception. And it's a common misconception that I notice definitely impacts sellers because sellers have this total misunderstanding that they think what they do is superior to buying. And it's not. It's not worse than buying. It's just different. It's just different than buying. That's the way to think about it. Lauren says that's why so many strategies include both. That's not the reason here. The reason why so many strategies include both is because for smaller accounts, you have to make a series of concessions that inherently suck. That's the reality of it. So for a small account, you are automatically going to be backed into having to make small adjustments and include elements of a trade because you can't afford to buy something outright or you can afford to sell something outright. Now there are absolutely instances where it still makes sense to blend both of them together. And it's because each of them has different behavioral inputs in terms of how the trade will move. So it's less so that just because one is not better than the other do them both and make it better, it's more because of those two reasons. Smaller accounts have to make concessions, trading things like verticals, horizontal spreads, stuff like that are cheaper and they're more accessible. The second thing is for more developed accounts, even though you're not necessarily worried about use",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 94,
      "start_timestamp": "01:21:58",
      "start_timestamp_seconds": 4918.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=4918"
    }
  },
  {
    "text": "them both and make it better, it's more because of those two reasons. Smaller accounts have to make concessions, trading things like verticals, horizontal spreads, stuff like that are cheaper and they're more accessible. The second thing is for more developed accounts, even though you're not necessarily worried about use of sizing and whatnot in terms of how much money, it allows you to take advantage of the built-in components of buying versus selling and the benefits thereof, which is exactly what we're going to talk about when we get down here. Lauren says, hedging. Yeah, so you can buy or sell to hedge technically depending on how much you want to hedge, but that's another big reason why people will trade verticals is because it has a hedge baked in technically speaking. Cool. So let's take a look at the other, which is overweighting volatility. I say this because of tasty trade nation and you guys know I really like Tom Saznoff. I love that dude. I have him on the podcast every couple months. I have a lot of respect for what he does. So this is in no way talking shit about him or what they do. But if you get into the habit of every single time bar none, you see volatility is high and you automatically default to selling just because volatility is high, you're making a mistake. You're making an objective mistake for a few reasons. One of them is depending on the ticker",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 94,
      "start_timestamp": "01:23:21",
      "start_timestamp_seconds": 5001.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5001"
    }
  },
  {
    "text": "But if you get into the habit of every single time bar none, you see volatility is high and you automatically default to selling just because volatility is high, you're making a mistake. You're making an objective mistake for a few reasons. One of them is depending on the ticker that you're trading, some of the most lucrative times to sell premium is when volatility is actually low. Weird, right? Probably haven't heard that. It's an absolute, absolute fact. The second thing is let's take a look at an example. Let me close this thing for now. And what's the volume here? 79. Implied volatility percentile 81. I think most people would objectively say that's pretty high volatility, especially implied volatility percentile metric, correct? We would say that that's generally high-vol. So with generally high-vol, again, let's get back to basics. What does high-vol tell us? It tells us something very specific. What is it? What does high volatility tell us? Any guesses? And while you're thinking about that, Riz says expectations for future volatility good, so expand on that a little bit more. There you go. We'll stretch those right on target. But breaking the wall right on target. Good. Nathan Burke right on target. When we see volatility high, it means we expect larger movements. Okay. So then let's say let's go back here. Volatility was also high here in SoFi. Let's go back. I'm going to use on-demand. We're going to go back in time and look",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 94,
      "start_timestamp": "01:24:36",
      "start_timestamp_seconds": 5076.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5076"
    }
  },
  {
    "text": "Good. Nathan Burke right on target. When we see volatility high, it means we expect larger movements. Okay. So then let's say let's go back here. Volatility was also high here in SoFi. Let's go back. I'm going to use on-demand. We're going to go back in time and look at an example together. We're going to go back to 8 November. Let's do that. 8 November. While this is loading, I want to talk about a couple other things. A lot of times there's a relationship between volatility and price movement, but it's not direct. What that means is a lot of times when you see a stock going up heavily, volatility will contract. And as the stock starts plummeting, volatility will expand massively. But it's not always. You can have things that are going up that are still highly volatile. So let's take a look at an example here. Let's pretend the date is not here because it's on demand. Let's pretend that the implied volatility percentile on the 8th of November right now is the same as what we just looked at. Right. So like 82. Let's just pretend. Would that mean we would want to buy or sell if we were defaulting based off of the volatility level itself? And if we were making the mistake of overweighting the volatility input, we would be primed to sell. The taste is right on it. That's exactly correct. Again, we're generally taught if implied volatility percentile, if implied",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 94,
      "start_timestamp": "01:26:30",
      "start_timestamp_seconds": 5190.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5190"
    }
  },
  {
    "text": "or sell if we were defaulting based off of the volatility level itself? And if we were making the mistake of overweighting the volatility input, we would be primed to sell. The taste is right on it. That's exactly correct. Again, we're generally taught if implied volatility percentile, if implied volatility rank, if implied volatility is high, we sell. One of the reason why we're primed to say that or we're primed to learn that is for this reason here. And again, this is probably easier to understand drawn out. Like this. So let's say you have an option. And let's say that this is the band. Let's say that this is 0 vol. This is 100 vol. And in this case, when I say 100, I simply mean as high as it can go for the underlying, not actually 100. So this, let me actually make this easier. So it's clear. So this will be the lowest. This will be the highest. So so far, just using today's metrics, I already forgot what they were, but I remember that it was at 82 percentile. So 82 represents maybe about here. So there's still a little more room that it can go to the upside before it conceivably gets near wherever its highest point is. One important admin note is that there's not a cap. It can go. It can go as high as it wants, right? Volatility can be 1000. It can be 10. It can be one. It",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 94,
      "start_timestamp": "01:28:01",
      "start_timestamp_seconds": 5281.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5281"
    }
  },
  {
    "text": "can go to the upside before it conceivably gets near wherever its highest point is. One important admin note is that there's not a cap. It can go. It can go as high as it wants, right? Volatility can be 1000. It can be 10. It can be one. It can be zero. Volatility can run all of this and it can be 15 hot, right? There's not a cap. There's not a natural ceiling to it. So what this is telling us, if you remember from the beginning, we spent a lot of time talking about one of the very important aspects of volatility from the beginning of this. Do you remember what it was? We talked about it for a hot minute, but there's a very specific element to this that you have to be aware of. And while you guys are telling me that, give me one second. I got to go check on the dog because my wife had a pop out. I will be or be give me one second. Put you guys over on this one. All right. Hi, A to sober. Nothing. Do you guys not remember the beginning of the the episode? There is a very specific thing we are talking about with respect to volatility. One of the most important traits of volatility and why we care about it so much. You guys have to know this. We compared VIX to SPX. And we talked about one of the key differences",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 94,
      "start_timestamp": "01:29:37",
      "start_timestamp_seconds": 5377.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5377"
    }
  },
  {
    "text": "There is a very specific thing we are talking about with respect to volatility. One of the most important traits of volatility and why we care about it so much. You guys have to know this. We compared VIX to SPX. And we talked about one of the key differences between VIX and SPX. We saw that SPX exhibited something called positive drift. We noticed that VIX, which is literally the volatility of SPX exhibited mean reversion. Lauren's on it. Mean reversion, also known as the snap. The reason why all this matters and the reason why you're taught to sell when IV is high is because the expectation is mean reversion. The expectation is that this vol will be more compelled to contract down to whatever the mean is. So this is why you are taught to sell volatility when volatility is high. There's a problem here. Big problem. The big, big problem here is this oversimplifies a really important function. What this does is it over emphasizes the impact of volatility as compared to the impact of delta. Take a pause there. I want to make sure that that point is clear. When we see this, it means we're prioritizing mentally, the movement of volatility. We are de-sensitizing the prioritization of delta. Unless you are truly isolating delta, it can overwhelm this volatility input. And I'll show you exactly what that looks like. I got to let it for. So we're being a straight diva. So let's take",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 94,
      "start_timestamp": "01:31:14",
      "start_timestamp_seconds": 5474.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5474"
    }
  },
  {
    "text": "we're prioritizing mentally, the movement of volatility. We are de-sensitizing the prioritization of delta. Unless you are truly isolating delta, it can overwhelm this volatility input. And I'll show you exactly what that looks like. I got to let it for. So we're being a straight diva. So let's take a look. We'll clear this off. Let's use this as an example. You are taught here to sell premium. The other thing that you're technically taught for a lot of people if you go with the TastyTrade approach, which is to trade mean reversion and price extensions. So from a TastyTrade perspective, we might look at something like this and say, well, this is like really overextended to the upside. Valtility is super high. Let me come in and sell a call, something like this. And somebody else might say, well, I'm actually expecting this to continue in this direction. I think it looks really good here. I'm going to trade at bullish and I'm going to sell a put. Let me see if I can enter these as single trades. The reason why I want to do this is so that you can see how each one of these will behave. Yeah, let me clear all this nonsense out. Perfect. We have this one. We have the person that sold a put. I'm giving you three scenarios. And then we have somebody else, the enterprising trader, who is more interested in isolating profit mechanisms that instead says, you know",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 94,
      "start_timestamp": "01:33:09",
      "start_timestamp_seconds": 5589.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5589"
    }
  },
  {
    "text": "will behave. Yeah, let me clear all this nonsense out. Perfect. We have this one. We have the person that sold a put. I'm giving you three scenarios. And then we have somebody else, the enterprising trader, who is more interested in isolating profit mechanisms that instead says, you know what, I'm actually going to buy a call instead of these other ones. And now this, I, one of these I have to move us back in time. I think maybe this one, which is November 8th. So you guys can see what this there goes. So first person says, price is extended to the upside. I favor it to the downside. Volatility is high. I'm going to sell a call. Second person says, I like it to the upside. I don't want to trade against the trend, but I'm going to sell premium because volatility is high. Third person says, I think it's going to go up more. And I don't care that volatility is high. I think the price movement is going to be bigger than any change in volatility. The price movement is represented by delta. So if we take a look at the options chain quickly, you can see that Vega here, which we know Vega is the rate of change premium relative to changes in implied volatility. Vega is 0.02. So every one point move involved will change this by 0.02. Whereas delta for every one point move in the underlying is going to change",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 94,
      "start_timestamp": "01:34:54",
      "start_timestamp_seconds": 5694.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5694"
    }
  },
  {
    "text": "you can see that Vega here, which we know Vega is the rate of change premium relative to changes in implied volatility. Vega is 0.02. So every one point move involved will change this by 0.02. Whereas delta for every one point move in the underlying is going to change it by 64 cents. So what that tells us in order for this move to overwhelm the delta component of this trade, you literally can do the math. You need this essentially, you need volatile change by 32. In order for that volatility to overwhelm a one point move in the underlying. So somebody knows that and they're playing the directional move instead. Okay, so let's just fast forward this quickly and we'll go straight to expiration, which is in this example 20 days. We'll go here. And let's see how this does. Thorne. Like digging through his bed. He is on a whole crackhead vibe right now. Okay, let's see what this gives us. Sick. So let's start with the short call. The short call got ran over. The short call stepped in front of something they thought that they knew better than what market price was. Something was overextended and they just decided to step in front of the trend and they got ran over to the upside. Fun fact, this is what happens in the majority of those instances. Just keeping it a buck. You can be a good price mean reversion trader. It is a thing,",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 94,
      "start_timestamp": "01:36:16",
      "start_timestamp_seconds": 5776.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5776"
    }
  },
  {
    "text": "overextended and they just decided to step in front of the trend and they got ran over to the upside. Fun fact, this is what happens in the majority of those instances. Just keeping it a buck. You can be a good price mean reversion trader. It is a thing, but it is so much more complex than simply saying this thing's gone up a lot. I think it should go down now. That ain't it. If that's the thesis, that's not a good thesis. Okay, so the short call ran over crushed. Second one, we have the short put. The short put we originally sold it for 56 cents and as of today in here, it should be what put did we have? The 12 put. The 12 put is, I mean, technically trading a liquid. Let's just say that it's trading at zero. It should be about zero, meaning this would be a full profit. This short put would be a full profit of 56 cents or 56 dollars. Let's take a look at the long call. The long call as of today is up 223. What does all of this tell you? This tells you that if you're making the trade decision based solely on volatility, you make two wrong decisions, possibly. The first decision is if you're a contrarian trader trying to trade a downside move and you default to that, you just stepped in in front of a moving trade and just lost in terms",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 94,
      "start_timestamp": "01:37:52",
      "start_timestamp_seconds": 5872.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5872"
    }
  },
  {
    "text": "you're making the trade decision based solely on volatility, you make two wrong decisions, possibly. The first decision is if you're a contrarian trader trying to trade a downside move and you default to that, you just stepped in in front of a moving trade and just lost in terms of direction. The volatility did not help you. Your Vega, the volatility contracting as this thing made its up move did not help you. You were overrun by Delta. It ran you over. This one, best case scenario, you made Max profit. That's awesome. But you traded something that was defined profit potential on something that maybe you thought it was going to move a lot. If you think something's going to move a lot, why would we define our profit? That doesn't make a lot of sense. Then there's the third scenario, the long call, the call that you bought, even though volatility was high and you're told if volatility was high, you're supposed to default to sell. Even though you did not do that, you made more money than both of these other scenarios. This is precisely why we do not overweight volatility and we don't just automatically default to one or the other. So now let's talk about when to buy when to sell. The first factor in deciding when we want to buy an option is what fits the portfolio. That's the first thing. The reason why portfolio fit matters is because that ultimately is the",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 94,
      "start_timestamp": "01:39:09",
      "start_timestamp_seconds": 5949.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=5949"
    }
  },
  {
    "text": "default to one or the other. So now let's talk about when to buy when to sell. The first factor in deciding when we want to buy an option is what fits the portfolio. That's the first thing. The reason why portfolio fit matters is because that ultimately is the governing decision of what needs to go on. So you all know in terms of my approach to trading and portfolio management, it always starts at the portfolio. So what I mean by this is if I have a portfolio that's full of short premium strategies, meaning defined profit undefined risk. I might start trying to look for some long premium strategies to try to offset some of that convexity that is against me in that scenario as compared to being in my favor. That's why we started the portfolio. That's the first factor. The second is your risk preference, meaning the downside risk, meaning downside the loss risk, I should say. It's not relegated to stock going down. This risk preference is your loss management preference. It's what are we comfortable with taking in terms of risk in the trade. So what that means going back to this example. The difference, let's just get rid of the short call because it's a completely different thesis. If I'm comparing this short put against the long call, the difference is on the short put, I have undefined risk and defined profit. If I'm uncomfortable with this undefined risk, because maybe as",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 94,
      "start_timestamp": "01:40:33",
      "start_timestamp_seconds": 6033.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6033"
    }
  },
  {
    "text": "The difference, let's just get rid of the short call because it's a completely different thesis. If I'm comparing this short put against the long call, the difference is on the short put, I have undefined risk and defined profit. If I'm uncomfortable with this undefined risk, because maybe as I'm looking at so far, I think maybe it can go up a lot or down a lot. And I'm just not sure which one I have a slight favor to the upside, but it's not it's slight. It's not a ton. So I don't want to step in front of this to the downside in case I'm wrong, because then I can have something where I stand to make 56, but let's say it drops to nine and I lose 282. That's not a great risk reward profile. That's the risk preference. So then there's this risk preference where we can say, okay, my max risk at the time of entering this trade is 117. I'm okay with that because that means if it moves a lot of my favor, I make more than the other scenario. And if it moves a lot against me, I make a lot in this scenario. I lose less in this scenario, slightly more optimal. Joseph's straddle or strangle, that's if you don't have a directional preference. And the straddle or strangle won't make as much money if it does, in fact, move in the direction that you might think it does. So",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 94,
      "start_timestamp": "01:42:05",
      "start_timestamp_seconds": 6125.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6125"
    }
  },
  {
    "text": "in this scenario. I lose less in this scenario, slightly more optimal. Joseph's straddle or strangle, that's if you don't have a directional preference. And the straddle or strangle won't make as much money if it does, in fact, move in the direction that you might think it does. So the way to think about using a long straddle or strangle is if you just expect movement, but you really don't have a sense of which way it's going to go. In this case, we were talking about trading a breakout strategy, trading breaks break out to the upside means we have a directional preference, but we just don't want to get ran over if it goes against us. So that's the risk preference. The third profit mechanism. This goes back to the prior example that I just gave you. If we have something, we got in here on this day. We got in here. Here, I think I was here. We got in here. We're here, whatever, one of these do. While it's doing this, if my profit mechanism is a bullish price movement, break out, which is the subtype, I know based on my trading approach, break out's carry more severity, which means bigger moves, higher severity. So if I'm trading this profit mechanism, if I come across so far, I think it's about to break out for whatever reason based on my analysis, based on my approach, and it looks like it'll have a breakout, which again,",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 94,
      "start_timestamp": "01:43:19",
      "start_timestamp_seconds": 6199.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6199"
    }
  },
  {
    "text": "carry more severity, which means bigger moves, higher severity. So if I'm trading this profit mechanism, if I come across so far, I think it's about to break out for whatever reason based on my analysis, based on my approach, and it looks like it'll have a breakout, which again, typically means it has bigger moves. Do I want to sell a put or do I want to buy a call? Which fits this better? Selling a put or buying a call, based on the scenario that I just laid out for you, what takes best advantage of this profit mechanism? It's very clearly one of these. This is a primary differentiator between the way that I think about markets compared to what I see a lot of other people think about markets. And I don't actually know why. I think it's because of trying to oversimplify things a little bit. The problem is if you oversimplify things too much, it kind of sucks. And it kind of sucks because it sabotages the nuance, which is where a lot of the potential is. Because in this scenario, both of these would have won. Both of these made money. But the difference is this made way more money four times the amount of money than this one did. So what ends up happening is you have people that defaults to selling options because it's a higher probability trade. They like the idea of winning frequently. But then this might not make",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 94,
      "start_timestamp": "01:44:52",
      "start_timestamp_seconds": 6292.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6292"
    }
  },
  {
    "text": "difference is this made way more money four times the amount of money than this one did. So what ends up happening is you have people that defaults to selling options because it's a higher probability trade. They like the idea of winning frequently. But then this might not make any sense based on the profit mechanism. So that goes back to this point. When we're making the decision on buying versus selling, one of the factors portfolio fit. Second factor risk preference of the difference between buying and selling premium, which you're aware of now. The third factor is what is the profit mechanism and what makes more sense for that profit mechanism? The fourth factor is now ancillary overlays as I refer to it as this is where we get into the fine tuning details of things like do I have an opinion on being short theta long gamma? Do I have an opinion on that for this specific trade? If nothing here stacked up in my favor, or if nothing here naturally diverted me into buying versus selling. Ancillary overlays is if I get through all of this agnostic to buying or selling risk preference, don't care buying or selling. Profit mechanism is price direction up, but it's not really I'm not expecting a whole lot of movement, although it could be. So we're still at the point where buying or selling can make sense. Now, now it might make sense to say what's implied volatility percentile",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 94,
      "start_timestamp": "01:46:39",
      "start_timestamp_seconds": 6399.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6399"
    }
  },
  {
    "text": "buying or selling. Profit mechanism is price direction up, but it's not really I'm not expecting a whole lot of movement, although it could be. So we're still at the point where buying or selling can make sense. Now, now it might make sense to say what's implied volatility percentile at. Does that make sense for this position? Matea says I prefer sold the put and Joe says I prefer selling puts as well. And that's okay. People will have preferences. The problem with preferences like that is they're objectively suboptimal. So you have to accept that. But that's okay. You can trade suboptimally. You don't have to overfit and have things as optimized as possible. What I can tell you is it's better to have things as optimized as possible. It's how I've been trading like I said, I just wrapped up my 18th year of trading. It's how I've been doing this for so long. So there's nothing wrong. If you choose and you're like, I'd rather just sell the put versus buying the call. I prefer it for these X, Y and Z reasons. The problem is is that we have an arbitrary preference based on not logic at that point. It's based on an underlying assumption. Matea says you don't know if the call is going to have profits. You don't know if the put is either. If that tells me that there's a breakdown in the strategy, that's not the problem with buying versus selling.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 94,
      "start_timestamp": "01:48:12",
      "start_timestamp_seconds": 6492.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6492"
    }
  },
  {
    "text": "logic at that point. It's based on an underlying assumption. Matea says you don't know if the call is going to have profits. You don't know if the put is either. If that tells me that there's a breakdown in the strategy, that's not the problem with buying versus selling. If you buy a call or sell a put, you don't know if that put's going to have profit either. It can go against you. You can be directionally wrong. The point is if you buy a call and you're directionally correct in this scenario, you simply make more money. It's based on your strategy. That's not a fault with buying versus selling. And this goes back to the broader point because in this case for the people that say, well, I prefer to sell the put again. That's cool. But the reality is if you sold a put in that scenario, you made 56 bucks. The person that bought the call and that scenario made literally four times the money. So what that leads to long term is significant outperformance. This is why people who like getting into selling and start defaulting to selling, which is way, way more common than people defaulting into buying beyond just being more comfortable with the concept of buying. But sellers are notorious for that. It's because it becomes a comfort zone. It becomes comfortable because it's a higher probability trade. And it's okay. You can be comfortable. But there's a cost for",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 94,
      "start_timestamp": "01:49:24",
      "start_timestamp_seconds": 6564.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6564"
    }
  },
  {
    "text": "common than people defaulting into buying beyond just being more comfortable with the concept of buying. But sellers are notorious for that. It's because it becomes a comfort zone. It becomes comfortable because it's a higher probability trade. And it's okay. You can be comfortable. But there's a cost for comfort. You're not going to make as much money. That's just how it's going to go. And that's okay. For some people that might be slightly more preferential. And that's totally cool. It really is totally cool. It's up to the individual trader to figure it out. But as I always try to remind traders, what's most important in my opinion is going into things eyes wide open, objectively saying, I prefer selling puts. I know it's suboptimal. It's suboptimal for this reason, this reason, this reason, these reason. But I still prefer it for these reasons. And I'm okay with that trade off. That's cool. That is completely cool. But what a lot of people do is they shy away from that because they get uncomfortable. And they don't want to look at the suboptimal components of what they're doing because then we're acknowledging that what we're doing like truly isn't fully logical. And that can be difficult for people to swallow. But yeah, I have absolutely no issue with people that have a general preference one way or the other. The again, the downside to it is you're going to see it in your performance. And you could",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 94,
      "start_timestamp": "01:50:26",
      "start_timestamp_seconds": 6626.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6626"
    }
  },
  {
    "text": "truly isn't fully logical. And that can be difficult for people to swallow. But yeah, I have absolutely no issue with people that have a general preference one way or the other. The again, the downside to it is you're going to see it in your performance. And you could be okay with that. But for somebody like me, it's not okay. Like my job is to trade as effectively as I can, given my sets of parameters, to make as much money as I possibly can. And it's how I made so much money through trading before I was 30 is by optimizing in this way. So just food for thought. Okay. So that wraps us up for the session today. Now I have some homework for you guys. One of the things I'm going to give you and then we'll get into open QA. I'm not done yet. But I just want to give you your homework in case you do have to bounce because I know we've been on for a little while, which is here. Let me find it. Here. So this is your homework. The takeaway for today is to go and select four stocks. Actually, you could do two stocks. You don't even need four. Select two stocks. And you want one that you're bullish in and you want one that's your bearish in. Then in both of those stocks, based on aligning with your disposition, create a long premium strategy and a short",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 94,
      "start_timestamp": "01:51:36",
      "start_timestamp_seconds": 6696.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6696"
    }
  },
  {
    "text": "Actually, you could do two stocks. You don't even need four. Select two stocks. And you want one that you're bullish in and you want one that's your bearish in. Then in both of those stocks, based on aligning with your disposition, create a long premium strategy and a short premium strategy. And just compare. See how they go. So the way that this would work, just to summarize, actually, I realize I need to add the timestamp here for homework. 53. Just call it one, 53. This will be episode two homework. So what you'll do is you'll say stock XYZ. I'm bullish. The profit mechanism, if you're following the outlier strategy process, we codify what the profit mechanism is. If you're unfamiliar with what the outlier strategy or outlier trade processes, I have two videos. It's completely free. There's nothing attached to it. It's just to give you a framework on how to think about these things a little more effectively. Because there, I mean, it's their frameworks that I built for myself for that exact reason. So those are the two. So I threw them in the chat there and then I'll also throw it in the video notes so that you have that. Let me grab this one really quick. Okay. So profit mechanism here is going to be price direction up. The subtype is whatever the subtype is. It can be drift and be breakout. It can be a catalyst. Whatever it is. And then",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 94,
      "start_timestamp": "01:52:50",
      "start_timestamp_seconds": 6770.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6770"
    }
  },
  {
    "text": "video notes so that you have that. Let me grab this one really quick. Okay. So profit mechanism here is going to be price direction up. The subtype is whatever the subtype is. It can be drift and be breakout. It can be a catalyst. Whatever it is. And then based on that, I'm going to structure two different trades in the same underline. So I know I'm going to trade two. I'm going to put on two bullish trades in here. So this one I might sell a put and this one I might buy a call. So this is the first one. Then you do it for another stock that you're bearish in. So stock ABC, we're bearish. You go through the same process and then here maybe we sell a call and then buy a put. Like that. So that's the homework. And for those that are in the discord, which again, it's completely free to join. You can throw it in the channel. I've built a thread for the learning lab. I'll share a link here, which is a thread for essentially collating stuff around this. Okay. So the link to that is here. My thought was here. How do I share this link? Copy link. Here you go. It's here. And then for those that are not in there and you don't want to join total equal, you can throw it as comments to the video. One of the things, the reason I'm asking you",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 94,
      "start_timestamp": "01:54:27",
      "start_timestamp_seconds": 6867.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6867"
    }
  },
  {
    "text": "was here. How do I share this link? Copy link. Here you go. It's here. And then for those that are not in there and you don't want to join total equal, you can throw it as comments to the video. One of the things, the reason I'm asking you to do this is because the process of seeing what other people do will help you generate some ideas. And that I think is worth your time. So that's why that is your homework. Okay. So now is literally the perfect time. If you have ancillary questions, things that we didn't hit throughout the episode, now is the perfect time. And it doesn't have to be specific to the episode. If there's just random stuff you saw this week in the options markets that you're curious about. If there's a burning options question that you've had for some time. If there's a concept you're unclear on, if there's a step in your process and you're like, I don't know where to go now. This is the perfect time for all that stuff. And while you guys are doing that, I'm going to start going through and figure out what the dinner plan is going to be because I don't really know this work. That was actually easier than I thought. And then I'll pop up and see what you guys are thinking. Good, good, good. That's all good. And that's good. Cool. All right. What questions you guys have? Anything",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 94,
      "start_timestamp": "01:56:34",
      "start_timestamp_seconds": 6994.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=6994"
    }
  },
  {
    "text": "dinner plan is going to be because I don't really know this work. That was actually easier than I thought. And then I'll pop up and see what you guys are thinking. Good, good, good. That's all good. And that's good. Cool. All right. What questions you guys have? Anything from here sticking out. And then in the meantime, a quick preview of the next one is going to be looking at option pricing. So we want to get more close to things like early assignment thinking through when we might choose to close trades. That kind of stuff. Let's talk about early. Well, let's do exercise. Assignment. Process and risks. And then the other note is if there are specific options trading topics that we want to hit, we still have a handful of flex sessions that we can build out. So just keep that in mind. All right. Let's get into some Q and A and see where we at. I will probably keep this up because there's a good chance I'm a draw. I bet. And Reese says toss head and video IV are at zero, which may be tempted to buy options. Is that miss miss guided all selling premium because IV? Yep, that's correct. That's miss guided. The reason why it's miss guided is based on that alone, there are two things to keep in mind. And let's again, let's take it back to basics. If I buy to open, we know I need movement.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 94,
      "start_timestamp": "01:57:41",
      "start_timestamp_seconds": 7061.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7061"
    }
  },
  {
    "text": "guided all selling premium because IV? Yep, that's correct. That's miss guided. The reason why it's miss guided is based on that alone, there are two things to keep in mind. And let's again, let's take it back to basics. If I buy to open, we know I need movement. If ball. Well, in this case, IV are equals zero. That equals very low ball, which equals very low movement. Very low movement. Does not equal need movement. So while you might say I'm going to buy to open a straddle, because I think Vol will go up. This is still a secondary profit mechanism. Primary is still delta. So the way that I would look at that specific trade, Reese, is let's say that I was bullish in Nvidia or bearish whichever. I have a directional preference in Nvidia. And then let's say I look at the portfolio. Portfolio doesn't need anything specific. It doesn't matter. I look at the different risk profile between those. I'm indifferent. It doesn't matter. So now I'm at the point of structuring the trade. Then I might say, okay, I'm slightly bullish in this idea. And I don't really know how much it's going to move. I don't necessarily think this is going to be a moonshot. So then what I do is super, super simple. We come out of on demand. We go into Nvidia. And then we say, let me just clear this out. We can close one of these programs",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 94,
      "start_timestamp": "01:59:27",
      "start_timestamp_seconds": 7167.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7167"
    }
  },
  {
    "text": "going to move. I don't necessarily think this is going to be a moonshot. So then what I do is super, super simple. We come out of on demand. We go into Nvidia. And then we say, let me just clear this out. We can close one of these programs down. And then I say, where do I think it's going to go? I think it's going to go up. I think it's going to go up by how much. So let's say my profit target is going to be 150 in the next couple of weeks. So then I say, how do I compare these? I say, well, I have a bullish tilt. I've used super low. Let me take a look at selling this put. Let me compare that selling that put against to buying this call. Maybe we go further out on the call. Something like this. And my preference, my price target here is going to be a dollar 50. I'm sorry, 150. That's the initial price target, 150. So all I do is I say, what do I make at 150 here? I make 102 on this one. What do I make here? A thousand sixteen. So let me say, well, you're going to put up more money on this one because you have to buy 1485, 1485. So what's the margin requirement for this one? 13,000. It's already the same, right? Because this is a pass through IRA account. So it's requiring it to",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 94,
      "start_timestamp": "02:01:56",
      "start_timestamp_seconds": 7316.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7316"
    }
  },
  {
    "text": "sixteen. So let me say, well, you're going to put up more money on this one because you have to buy 1485, 1485. So what's the margin requirement for this one? 13,000. It's already the same, right? Because this is a pass through IRA account. So it's requiring it to be cash secured on a regulation T margin account. You might be able to get two or three. I have portfolio margins. So I'm actually not sure what the margin requirement would be and how many you could put on. But let's just say you could put on a multiple of whatever it is. So let's say you put on five. Well, if I put on five and I get that move to 150, I make five 14. If I buy this one and I get that move to 150, I make 1016. Right. So you see what I'm you see what I'm highlighting is that the profit mechanism here is still direction. Now, if I look at these and the difference is negligible based on my price target, let's say I don't think it's going to go up that high. Let's say looking at this price and all this stuff, I think it might go to 141 and we analyze the difference instead at 141, it will be much tighter. So 141, we make 405 here, 141 on the put why why is that showing it losing money? I'm confused. Oh, is that because it's lower than I know?",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 94,
      "start_timestamp": "02:03:11",
      "start_timestamp_seconds": 7391.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7391"
    }
  },
  {
    "text": "stuff, I think it might go to 141 and we analyze the difference instead at 141, it will be much tighter. So 141, we make 405 here, 141 on the put why why is that showing it losing money? I'm confused. Oh, is that because it's lower than I know? It's not. For the dates messed up. There it is. The thing down here was using old dates. That's why I was so confused. So if I sold five of these and it goes to 141, I make 415. If I buy one of these, I make 195. So now it's actually stacking in favor of selling. And then I also have the secondary benefit of expecting maybe some sort of expansion involved. But I don't care. Like the selling perspective still makes more money here. So the dominant feature is still direction. That's the take away there. Cool. Let me know if that makes sense for you. Next is from Peter, when you sell a put versus buying a call for a bullish thesis, doesn't selling the put have a higher probability of making money depending on the delta you choose? Yep. It does. And you can calculate all of that stuff depending on how you intend to manage it. That's an important element because let's use the same example that we're looking at now. And I'm just going to reduce it to, we'll keep it out of five lot. And let's say that I'm going to manage this",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 94,
      "start_timestamp": "02:04:11",
      "start_timestamp_seconds": 7451.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7451"
    }
  },
  {
    "text": "of that stuff depending on how you intend to manage it. That's an important element because let's use the same example that we're looking at now. And I'm just going to reduce it to, we'll keep it out of five lot. And let's say that I'm going to manage this trade, meaning if it goes to different prices, I'm going to exit. So let's say that I'm going to exit. If it goes below this handle, the 128, let's say it goes to 128. And that's where I would exit. Well, if I go in here and I take a look at 128, let's say that I'm going to have this trade on for two weeks. And I take a look at the probability of touching 128. The probability of touching 128 is 30 chance. So what I'm showing you is that that higher probability will help you. But if you're going to manage it based on different touches like this in terms of a directional trading approach, that that benefit actually decreases a little bit, not a ton, but it decreases a little bit. So what that ends up meaning for you is then we can analyze at the 128 loss handle, which one of these looks better based on how much you can make. And then you can literally conduct it. You can literally conduct an expected return calculation. So if we take a look at the 128, let's say that we think it's going to go between",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 94,
      "start_timestamp": "02:05:56",
      "start_timestamp_seconds": 7556.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7556"
    }
  },
  {
    "text": "128 loss handle, which one of these looks better based on how much you can make. And then you can literally conduct it. You can literally conduct an expected return calculation. So if we take a look at the 128, let's say that we think it's going to go between 141 and 128. Those are our two targets. And let's go into the scratch here so that is there not an expected return in here that's annoying? Give me one sec. I'm just going to drop an expected return calculation in here. And then I'll get rid of whatever all this nonsense is. And let's do this one. Now, let's take a peek. Our target is going to be the 142 for the profit. Our loss is going to be 128. This will be for the long call. This will be for the short puts. So we already know, we already did some of the math here. And we already know that the probability of hitting the 128 was what, like 30 or 28 I already forgot because you know, the memory of a goldfish, 28.5. And then the probability of us hitting 142 in that same time frame. 64.4. This is based on our managed targets, 64.4. Meaning once it hits these levels, we would do something. And depending on what it is that we would do. So now, let's take a look at the PNL levels. So the long call at 142 and 128. Let me wish this",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 94,
      "start_timestamp": "02:07:06",
      "start_timestamp_seconds": 7626.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7626"
    }
  },
  {
    "text": "This is based on our managed targets, 64.4. Meaning once it hits these levels, we would do something. And depending on what it is that we would do. So now, let's take a look at the PNL levels. So the long call at 142 and 128. Let me wish this down so that we can look at this stuff at the same time. And then we'll go to the risk profile. So now, all we do, we're on the short puts. So we'll start with that at 142. We make 555 up to 1650. So we'll put 555 to start. And then we have to add another column specifically for the short puts because it's going to change the time frame. So this will be short puts managed and then there will be short puts, X-Berry. And then at X-Berry, that would be 1650. Now, we need to also do the loss side at expiration, which would be for those short puts 21FAB. So we'll use that here. The reason why it's important to do that is because you'll see that it actually opens up the expected moves quite a lot. So then there will be two series of probabilities that we're going to be talking about. There will be at expiration and then prior to expiration. And we'll do this for both. So this will be probability at a management point. And then this will be probability at expiration. This will be at a management point. And then this",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 94,
      "start_timestamp": "02:09:18",
      "start_timestamp_seconds": 7758.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7758"
    }
  },
  {
    "text": "that we're going to be talking about. There will be at expiration and then prior to expiration. And we'll do this for both. So this will be probability at a management point. And then this will be probability at expiration. This will be at a management point. And then this will be the long call, same thing. And this is literally something you all can do for yourselves to understand how this stuff works and to get more comfortable with the behavior of these. So right now, we're starting with the management point. Let's just finish the management point through for all of them. And the management point, I'm using a perspective two week time frame for something like that. So then the 128s or at 128, this would make lose 2064. 2064. And now let's take a look at the long calls quickly. At the profit target of 142, our long call itself would make 195. And then at 128, it loses 530. So these are, it's not a totally fair comparison because you could tell by these numbers, we're using a different overall size and scope, right? Because I didn't actually do the math to see for regulation T how many calls I could put on, but it doesn't matter. You'll still see the the important output here. So now let's take a look, update the probabilities based on at expiration. So the probability of hitting 142 and being there at expiration, we have to update this. So",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 94,
      "start_timestamp": "02:11:15",
      "start_timestamp_seconds": 7875.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7875"
    }
  },
  {
    "text": "T how many calls I could put on, but it doesn't matter. You'll still see the the important output here. So now let's take a look, update the probabilities based on at expiration. So the probability of hitting 142 and being there at expiration, we have to update this. So expiration for the short, let's just 21 Feb here. And the probability of 142 is 37. Realistically, the top side doesn't matter that much actually is we're looking at this. For the short put, what matters is our strike, which is the 131. So what's the probability 21 Feb of being above 131? 66.6. 66.6 chance. And then the probability of being below that less the credit, which is 131 minus 3. So let's just call it 127.5. Dame expiration, 127.5, below that 25 chance. And then our risk at that level at expiration would be 2064. So I have to move this number over. And then at 128 before that would be 1840. And then I'll summarize all this for you so that you kind of know what the fuck is going on. So then the short puts at 142 before will be 583. That's good. Okay. So now let's take a look at the long calls really quick. Long call at 142 will be like 527. And then at 128, I'm an idiot at 142 will be 266. And then 128 would be 522. Negative. And then this is negative. And then this is. Now what I've just",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 94,
      "start_timestamp": "02:13:07",
      "start_timestamp_seconds": 7987.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=7987"
    }
  },
  {
    "text": "let's take a look at the long calls really quick. Long call at 142 will be like 527. And then at 128, I'm an idiot at 142 will be 266. And then 128 would be 522. Negative. And then this is negative. And then this is. Now what I've just made is an entire matrix that we can objectively analyze this. Now one thing to keep in mind is you don't have to do after each trade that you do or you'll get a sense of what these numbers are going to be. So that's the benefit. You'll develop a little bit of intuition here. But what we can do is we can figure out the expected return for both of these scenarios. So we can do expected return for a managed position and we can do expected return at X-PRI. And then we can compare these. expected return. We'll just do it actually down here. So this will equal this. Well, hold on. You guys know how to do this. What? Yeah, I just realized I'm about to start building this whole thing out for you. But you guys know how to do this, right? So if we take a look and compare the two different strategies, we would have an expected return for the long call. And we would have an expected return. So this should be expected return for managed. This will be expected return for managed. And there will be two different expected returns. There will",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 94,
      "start_timestamp": "02:15:13",
      "start_timestamp_seconds": 8113.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8113"
    }
  },
  {
    "text": "a look and compare the two different strategies, we would have an expected return for the long call. And we would have an expected return. So this should be expected return for managed. This will be expected return for managed. And there will be two different expected returns. There will be one for the long call. And then there will be one for the short puts. And then you literally make the decision based on this. So then there will be an expected return at expiration for the long call and expected return at expiration for the short puts. And then you compare these. And now you can make an actual decision. And I think you guys already know how to do this. I'll show you just hold on. I think you guys will just do the first one. And then I'll have you guys do the other ones. So let's do the expected return for the long call. The expected return for the long call is the wind probability or the wind size times the wind probability. And in this case, we have to do plus because this is negative number plus the loss times the loss probability. And then for the short put, the wind size times the wind probability plus the loss times the loss probability. And you can see from this perspective, which one looks good out of the gate. And then you could do the same thing. This is looking at a managed position. This",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 94,
      "start_timestamp": "02:17:41",
      "start_timestamp_seconds": 8261.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8261"
    }
  },
  {
    "text": "then for the short put, the wind size times the wind probability plus the loss times the loss probability. And you can see from this perspective, which one looks good out of the gate. And then you could do the same thing. This is looking at a managed position. This is looking at expiration. And then you can literally make the comparison, which one of these fits better. So you guys can fill out this other side because you guys can obviously follow along with what I did. And when you have the answer to this side, again, either throw it as a comment, throw it in the chat or throw it in the discord. And let me get through the rest of these. And then your boy is going to wrap up. Alberto said, okay, so you guys already answered that. M54 says, how often do options traders exercise their contracts or is it mostly trading the contract? The overwhelming majority has traded. It's like over 70. Exercise is a subset of that. I want to say it's like 15 or 18 or maybe the low 20s, but it's a minority of instant. The day says, what would be a good strategy for you that combines both selling and buying? For me, it would be ratio diagonals. That is a way that I combine both buying and selling. But the reason why I combine both buying and selling in that context is to take advantage of the risk profile",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 94,
      "start_timestamp": "02:19:00",
      "start_timestamp_seconds": 8340.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8340"
    }
  },
  {
    "text": "a good strategy for you that combines both selling and buying? For me, it would be ratio diagonals. That is a way that I combine both buying and selling. But the reason why I combine both buying and selling in that context is to take advantage of the risk profile of buying and selling specifically, which is a little bit different than the sake of buying and selling, again, just for like the sake of reducing risk or something like that. For me, when I'm including both buying and selling components of a trade, it's for a very, very specific risk profile. It's not because I'm trying to like reduce risk. The thing is, is traders get obsessed with reducing risk with their positions and thus in doing so, you inherently reduce your profitability. Becoming too risk adverse literally becomes a disease. It becomes a really, really big thing that we like the feeling of it. It's less scary. But if you condition yourself to trade, for example, like naked premium strategies and you just size appropriately, you realize that's actually not that scary. The risk is completely capable of being controlled effectively. That's the main time that I would be mixing buying and selling or doing buying and selling at the same time would be via ratio call diagonal. The other example could be something like the coverage strangle that I run, which is what I consider to be a superior alternative to the wheel. But that's buying equity",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 94,
      "start_timestamp": "02:20:46",
      "start_timestamp_seconds": 8446.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8446"
    }
  },
  {
    "text": "be mixing buying and selling or doing buying and selling at the same time would be via ratio call diagonal. The other example could be something like the coverage strangle that I run, which is what I consider to be a superior alternative to the wheel. But that's buying equity and then selling options. So a little bit different. Capital Apes is do you recommend selling premium on leveraged ETFs? If you want. I have a coverage strangle on right now and you prone to triple cues. So it can be fine, but you just have to understand the ticker, like the product in that case that you're trading and be comfortable with it. But yeah, I mean, it can work. Okay. You just have to have a solid management plan in place for it because it can also be really, really destructive at the same time if you don't. Lauren says, this is the part that stresses me out, not because I'm lazy and don't want to do it because I don't know how. And that's why we're doing this exact thing together here is to show you how. And this is a really easy way to think about managing risk. And I have a video that talks about this exact process of how to do this kind of thing. And the main goal here is to quantify different levels so that we can make an objective decision of virtual numbers. Mark says for long calls, are we better",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 94,
      "start_timestamp": "02:22:08",
      "start_timestamp_seconds": 8528.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8528"
    }
  },
  {
    "text": "managing risk. And I have a video that talks about this exact process of how to do this kind of thing. And the main goal here is to quantify different levels so that we can make an objective decision of virtual numbers. Mark says for long calls, are we better off targeting strikes in the money or out of the money? And how far in and out is there a method to madness and picking the strikes? They're absolutely as there's an entire science box. And you guessed it, I have a video that walks through literally that entire process in detail on. Let me see. Where is it? Here we go. This one. So, Mark, this video will walk you through that in its entirety. There's a lot to it. That's why it's not a it's not a small question. I literally think that video I just dropped in. There was like 20 minutes long. And it's because it goes through the striking a balance between the various deltas and stuff. The Cliff Notes version is you have to think through what expiration makes sense. Then within that expiration, the strike selection really is not about the strikes at all. It's all about delta, gamma and theta. Those are the main inputs in deciding what you want to buy. So the way I look at it is I don't even care what the strike price is. It literally is meaningless to me. What matters are the Greeks that I'm",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 94,
      "start_timestamp": "02:23:23",
      "start_timestamp_seconds": 8603.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8603"
    }
  },
  {
    "text": "all. It's all about delta, gamma and theta. Those are the main inputs in deciding what you want to buy. So the way I look at it is I don't even care what the strike price is. It literally is meaningless to me. What matters are the Greeks that I'm trying to pick up for the trade idea. And that will depend on how much you're expecting the thing to move. If you expect something to move a lot, then you can make way more money by building what we call units, which is using further out of the money options that have high gamma. So they're not super far out in time. So that they'll compound a lot. If you're expecting a medium amount of movement, then that's typically how I structure them. I'll use options that are at least 60 days to expiration, preferably 90 as at a minimum for the long option component. That's because it decreases the overall theta decay per day, even though you're paying more money outright. I'm not taking it into expiration. Then I use a higher delta to start one because it also decreases theta decay, but you will also get a better dollar for dollar move with the underlying. So if I have a delta that's 80 or 70 or even 60 as the underlying goes up one dollar, that is going to move by 60 cents. So the underlying gives you a dollar move that gives you 60 cents. You're",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 94,
      "start_timestamp": "02:24:54",
      "start_timestamp_seconds": 8694.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8694"
    }
  },
  {
    "text": "better dollar for dollar move with the underlying. So if I have a delta that's 80 or 70 or even 60 as the underlying goes up one dollar, that is going to move by 60 cents. So the underlying gives you a dollar move that gives you 60 cents. You're collecting a good bit of that. If you have a really low delta option of 10 delta, if the underlying moves at dollar, you get fucked and just have 10 dollars to show for it, meaning a 10 cent move. So the only time that the out of the money start to make a lot more sense is if you're expecting a really, really big movement, which for me, a lot of times I will add them to something like a ratio called diagonal, I call them kicker options. They add like a little bit of a kicker to the trade if it goes in your favor. But then you still have the primary base of the trade, which is the in the money options, low worth 80 to K, but they move better for dollar with the underlying and so. So that's the high level overview of that like 20 minute video. Wheat. All right, guys, I am tired. I really enjoy doing these. I try to make sure I'm doing a good job for you guys. I want to give you really, really good information as best as I possibly can. The only thing I ask from you",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 94,
      "start_timestamp": "02:25:58",
      "start_timestamp_seconds": 8758.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8758"
    }
  },
  {
    "text": "20 minute video. Wheat. All right, guys, I am tired. I really enjoy doing these. I try to make sure I'm doing a good job for you guys. I want to give you really, really good information as best as I possibly can. The only thing I ask from you all is if you can, please share what we're doing with other people. The reason why I care about that so much is you can tell there's not even ads that run during the livestream or anything like I literally make nothing from doing this. But this is like, this is the pay it forward part of what that mentor did for me. And you'd be clear, he never did anything like this for me. He doesn't even know how to trade. That's funny. But he's the one that introduced me to investing. And I feel so indebted because of where and how it's changed the trajectory of my life. And I know how important this stuff can be for people. So that's the mean thing that you guys can do to help me with this is literally just to share it with other people that are trying to figure out how to trade options because there's so much information out there that's a lot of it is meant in good faith. But it's just not great information, unfortunately. So my goal is to try and connect people with better information and not all of it's going to be mine.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 94,
      "start_timestamp": "02:26:54",
      "start_timestamp_seconds": 8814.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8814"
    }
  },
  {
    "text": "out how to trade options because there's so much information out there that's a lot of it is meant in good faith. But it's just not great information, unfortunately. So my goal is to try and connect people with better information and not all of it's going to be mine. Like one of the biggest books I recommend is options as a strategic investment, stuff like that. So yeah, hope the session was useful. Absolutely. Enjoy talking about this stuff. We have a big one set up for next week. Lauren, the homey just hooked people up, five people without liar trading memberships. Really it's just a way to support the channel. So super, super thankful for doing that and hooking some people up. And yeah, if you guys need anything, you guys can hit me up in the discord in the comments, whatever. Happy to help as best I can. Be an outlier. I'll see you guys later and enjoy the weekend.",
    "metadata": {
      "video_id": "tuLYhzeA-cE",
      "title": "Buying vs Selling Options | Outlier Options Trading Basics Ep2",
      "url": "https://www.youtube.com/watch?v=tuLYhzeA-cE",
      "upload_date": "",
      "duration": 8952.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 94,
      "start_timestamp": "02:28:06",
      "start_timestamp_seconds": 8886.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tuLYhzeA-cE&t=8886"
    }
  }
]