[
  {
    "text": "Three reasons options traders lose money. I'm going to walk you through one by one and then I'm also going to attach it to what you can do to overcome the problem. Now, I'm not going to go into my usual spiel of planning or having a trading planner or trading log. Although I will throw videos to those in the notes below, I think that is an absolute necessity. I'm even talking about the first order hurdles that these people run through that they're unable to overcome to even start making money let alone optimize it and become super successful. I want to be super clear trading options is difficult, but it's not insurmountable. It really is a doable prospect, but the problem is a lot of people approach it with the wrong mindset. So we're going to talk about that right now. And before we get into that, a shout out to the Patreon members. Thank you guys so much for the support. And let's get straight into the video. The very first one is going to be no surprise to anybody. It's the yellow traders. These are the folks that are looking for a lottery. These are the people that you see on Wall Street bets. And they're looking for those really crazy asymmetric payouts. They're going to have very low wind rates with a high expected payout. This is typically a negatively expecting strategy. It's just as if you were to go to the lottery store",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "the people that you see on Wall Street bets. And they're looking for those really crazy asymmetric payouts. They're going to have very low wind rates with a high expected payout. This is typically a negatively expecting strategy. It's just as if you were to go to the lottery store or to the gas station and buy a lot of tickets. It's the same exact thing. So the problem with this is people want an out. They want the idea or the potential to win regardless of how small it actually is, but they don't want to put in the effort to build strategies to actually create success. It gives them an out. They have the ability to try to make some money, but they're not putting in any effort. And then if they lose, well, it's no skin off their back. They don't really care because it was just a lot of, they didn't really care. And that creates this really insane cycle where we're literally just throwing money away. Want to be clear, you can actually have asymmetric risk strategies. You can have strategies that have really big payouts, low wind rates, but are still positively expecting. It still just requires a little bit of effort to get there. And most people don't want to do that. So this is exactly what we see. Now, when we're thinking about the way we can overcome these lottery trades, like I said, scaling into strategies, again, you can be aggressive,",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "still just requires a little bit of effort to get there. And most people don't want to do that. So this is exactly what we see. Now, when we're thinking about the way we can overcome these lottery trades, like I said, scaling into strategies, again, you can be aggressive, but they have positive expectancy. You're scaling into successful strategies as compared to not even bothering to create a strategy. And then you're wondering why you're just bleeding money. Then next one is the Greeks, the evil Greeks, the reasons why everything happens in the markets, right? No, not right. When we're talking about the Greeks, we're talking about Delta, Gamma, Theta, Vega, Ro, and then even the second order Greeks, well, technically, third order Greeks, charm, things like that. Vanna, but when we're talking about the Greeks, it's important to kind of clarify things. The Greeks measure stuff. They don't do anything. So when people say, oh, Theta's killing me. Oh, whatever's killing me, Theta is just a measure of, I'm decay. I'm decay is killing you. Now, when we're talking about, though, kind of this idea of the Greeks, the Greeks in and of themselves, there's nothing wrong with them. Theta isn't a problem. Theta is the boogie man for long options traders, but there's nothing wrong with Theta because Theta gives you exposure to long gamma, which is actually good. The issue is people don't understand how options work to figure out the correct balance for their",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "with them. Theta isn't a problem. Theta is the boogie man for long options traders, but there's nothing wrong with Theta because Theta gives you exposure to long gamma, which is actually good. The issue is people don't understand how options work to figure out the correct balance for their dispositions. This is not the Greeks problem. It's your problem. It's your lack of understanding of how options work. So how do we overcome this? Well, there's a couple things. The first thing is I'm actually going to throw a video in the notes below on an introduction to options that goes through all of the Greeks and how they impact your options, which is a really important concept. But let's talk at a few other things. The first one is I want you to take a look at your strategies and identify how each Greek impacts your strategy. So if you are long an option and you're long gamma, that's part of your strategies risk profile. If you're long an option, what's happening with Theta? What happens with Vega? And it's not just going to be whether you're longer short, it's going to depend on other things. Like what is the delta of your option? How far out in time is your option? Those sorts of things. Do that for all of the Greeks. Once you understand how the changes in the Greeks impact your position or your strategy, the next thing we need to take a look at",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "is the delta of your option? How far out in time is your option? Those sorts of things. Do that for all of the Greeks. Once you understand how the changes in the Greeks impact your position or your strategy, the next thing we need to take a look at is what impacts those Greeks. So if we know that we're long gamma, what does that even mean? What happens? What what makes gamma move? You've got to be able to answer those questions so that you can actually create strategies that work because going back to this. Most of the lotdos that we see out there are super short days to expiration far out of the money options. It is no wonder why they don't work. That is an awful structure. Those kinds of trades have really awful risk profiles. They're expensive. All sorts of things make them unattractive. And if you go through this exercise, you'll start to see some of that. And then the second thing for kind of overcoming this, placing on holes. I think too many times traders, they're looking at what makes a strategy great. Why does the strategy seem so awesome for them? And they're not looking what's the problem with this strategy. Where's the risk in this strategy? That's what we need to be focusing on when we're looking at the Greeks in relation to an option strategy and how we're trading in general. We're not trying to essentially trick ourselves into",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "And they're not looking what's the problem with this strategy. Where's the risk in this strategy? That's what we need to be focusing on when we're looking at the Greeks in relation to an option strategy and how we're trading in general. We're not trying to essentially trick ourselves into thinking that this is perfect and everything's going to be okay. We need to identify where the risk is so that we can work around it. Identify what we need to do to manage the risk to create a successful strategy. Next, the good old 99.9 repeating win rate. I hate these. And it's because what happens if we have an astronomically high win rate? Can anybody answer that question? And if you can't, your average win size is going to be pretty fucking small. So the problem with this is this is an ego trade. Traders don't like to lose. Look up the disposition effect. This is a super commonly studied trader behavior where traders will allow loser trades to grow and get bigger because they don't want to realize the loss, but they cut winners super short instead of letting them move because we like the experience of a winning trade that's the disposition effect. That's what this is. So whenever you see these insane win rates, you can immediately throw this out as a grossly inexperienced trader or strategy because a sophisticated options trader is focused on positive expectancy, not win rate. So what's the fix here?",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "a winning trade that's the disposition effect. That's what this is. So whenever you see these insane win rates, you can immediately throw this out as a grossly inexperienced trader or strategy because a sophisticated options trader is focused on positive expectancy, not win rate. So what's the fix here? Focus on positive expectancy, not win rate. And if you're not sure what positive expectancy is, don't worry. I got you. I will throw a link in the notes below so you can check that out as well. The last thing that I want to talk about is kind of a trickier one. So I think it bears mentioning. And this is where retail traders want to try to do what institutions do. This is where you're going to see the retail traders that want to scowl or they're trying different strategies that they think are successful from the institution side. A couple of things. It's a good mindset. Your mind is in the right place because typically we want to try and emulate people or entities that are successful at what we're trying to do. That's good. The problem in this instance is that the worlds between retail trader and institutions are vastly different. That's the tricky part. So I think it's good to absorb some of the approach of institutions. Having very clear risk profiles, having well thought out strategies, testing things, all of those sorts of things are great to integrate into a retail trader strategy. The",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "and institutions are vastly different. That's the tricky part. So I think it's good to absorb some of the approach of institutions. Having very clear risk profiles, having well thought out strategies, testing things, all of those sorts of things are great to integrate into a retail trader strategy. The reason why I bring this one up as an addition at the end is because it's really nefarious because there is a structural gap between the two. You will never have the resources that institutions have. You will never have the commission or cost structure that institutions have. So whenever retail traders are trading, there's a lot of friction, meaning that there's a lot of cost associated and it's not relegated to just the commissions you see. It's things like bid-ask spread slippage, so on and so forth. The institution side doesn't deal with a lot of that or the ways to circumnavigate it, aka block trades for giant orders. They have specific ways to circumnavigate a lot of that stuff. That's not to say that retail traders don't have any advantages. We actually do have some, but the point being is if you try to emulate exactly what institutions are doing, it's not going to work for you as a retail trader. So that's not the right way to focus your energy. And if you're curious about the differences between the two, you guessed it. I have a video that I will throw in the notes below that talks",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  },
  {
    "text": "are doing, it's not going to work for you as a retail trader. So that's not the right way to focus your energy. And if you're curious about the differences between the two, you guessed it. I have a video that I will throw in the notes below that talks about the difference between Wall Street and retail traders because it's important to understand that difference. So let me know what I missed. If you liked, please like the video, subscribe, share with some friends. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "TuxlzeD0RiQ",
      "title": "3 Ways to Stop LOSING Money Trading Options",
      "url": "https://www.youtube.com/watch?v=TuxlzeD0RiQ",
      "upload_date": "",
      "duration": 500.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TuxlzeD0RiQ&t=0"
    }
  }
]