[
  {
    "text": "What's up, outliers? Quick market update. Two things on the agenda. We have GameStop. Two things for GameStop. I want to talk about this case with Ryan Cohen. And then I want to take a look at this question from my boy Bruce. He sent it in. I think a couple days ago and I was going to review it yesterday and I forgot to. So we'll hit this one today as well. And then the second broader topic is the chewy offering, quote unquote, which will take a look at that together. So first, so that I do not forget, we're going to start with this one here. We're going to start with Bruce's, Bruce's question about analyzing the volume on the January 20 calls from the 18th. So let's take a look at what's going on. We'll kill that. You'll open up to the platform and we'll get right in. Well, first off, GameStop is been very, very quietly trending sideways. So from a stock trading perspective, it's now starting to fall within this range that starts to become a little more interesting in terms of which way does it break? And as you can see on a shorter term timeframe, when we get rid of a lot of those, you know, other like spikes, the chart normalizes. And you can see that we're still seeing longer term moving averages, positive sloping, but they are starting to become negative sloping on the day. So that's kind of important",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=0"
    }
  },
  {
    "text": "shorter term timeframe, when we get rid of a lot of those, you know, other like spikes, the chart normalizes. And you can see that we're still seeing longer term moving averages, positive sloping, but they are starting to become negative sloping on the day. So that's kind of important to note for me from just a general charting perspective. But we'll see what behaves in there. Let's get into specifics though and take a look at this options change. So here's what's going on in GameStop. I'm still seeing this really heavy call skew. And I am seeing the options scattered about. I'm seeing options moving in and out of this front expiration. If we take a look at volume, we can see that the highest volume is the 20 step 20s. And this to me looks like they're being moved around, meaning they're coming up on expiration. People are probably managing them. So if we take a look at the 20 step and we take a look at the 20s, we can see that the volume today was very high. And the volume yesterday, as they were pointing out was high, but not a lot actually translated into more opening trades. That's for the 20 step expiration. So what I see in instances like this is people are trying to salvage the value out of these options. And because they're going to decay away in the next day or so. And without a meaningful catalyst and price trending",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:05",
      "start_timestamp_seconds": 65.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=65"
    }
  },
  {
    "text": "more opening trades. That's for the 20 step expiration. So what I see in instances like this is people are trying to salvage the value out of these options. And because they're going to decay away in the next day or so. And without a meaningful catalyst and price trending in the wrong direction, it's just kind of holding something that's breaking apart in your hands that you can't grab a hold of once it's gone. So that's mostly what I see going on here. People trying to take these front expiring options, move them out a little bit in time, give them some time in order to have a position to ultimately hopefully put on for themselves in the future. And this goes all the way back to the same video I cite all the time. I will throw it in the comments below for you. But there's a better way to buy options in something like GameStop than continuing to play the front expiration and just watching your money evaporate. So that's in a nutshell what I see going on here. Now as I look across time and sales, I can definitely see some activity for today, specifically not the 18th, but the 19th because I'm getting to Bruce's question of day late. And it does look like there are some people that are still buying options. Again, this could be that they sold. These are now are buying them back. You can't entirely tell. But when I",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:12",
      "start_timestamp_seconds": 132.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=132"
    }
  },
  {
    "text": "not the 18th, but the 19th because I'm getting to Bruce's question of day late. And it does look like there are some people that are still buying options. Again, this could be that they sold. These are now are buying them back. You can't entirely tell. But when I look through the options chain over the last few days and I kind of see, you know, what's been the most active. And if we come down here to the strike and we want to take a look at just the 20s to help us isolate a little bit more, there's just not a lot going on here is what I'm seeing. And it's a little bit of a mix for people that are buying and selling. So right now we're just looking at things at the offer. But if we add the bid back in again, you can see tons of people that are also selling these. So it's a bit of a mix back. I think that there's people obviously doing different things in here based on what their portfolio represents. But I don't see anything here that's like jumping out at me as like hyper interesting. Now these 20s that are way further out in time. This has been going on for a little while with people building these out. And you can see that that's actually the bulk of these larger trades that we see at the 20 strike and even the 10 like the majority",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:13",
      "start_timestamp_seconds": 193.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=193"
    }
  },
  {
    "text": "these 20s that are way further out in time. This has been going on for a little while with people building these out. And you can see that that's actually the bulk of these larger trades that we see at the 20 strike and even the 10 like the majority of the higher premium value trades I've been seeing. So these are 300,000 200,000 plus. They've been out in 2025. So that's a big difference than historically what we've seen in something like GameStop. So yeah, overall interesting find. But there's not really anything that's like truly jumping out at me from an options trading perspective. And again, not that I'm doing a video on it every single day now because there are some quiet days. But I look at it every day for us so that every any time I do see something I make a video like this, hopefully in share some of what I'm identifying. But yeah, it's been a little more on the quiet side. So now let's take a look at a couple of these other things really fast. The first thing I want to show you is this case against Ryan Cohen. And it looks like he's paying just shy of a million dollars at 985,000. It's a civil penalty. And it comes against violation of the HSR act. So essentially, and here's the complaint for those that are interested. So you can look this up whenever you would like. And you can kind",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:04:06",
      "start_timestamp_seconds": 246.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=246"
    }
  },
  {
    "text": "looks like he's paying just shy of a million dollars at 985,000. It's a civil penalty. And it comes against violation of the HSR act. So essentially, and here's the complaint for those that are interested. So you can look this up whenever you would like. And you can kind of see the summary here. And it says he acquired more than 562,000 Wells Fargo voting securities. And he exceeded the HSR filing thresholds. So that means he needed to file specific forms with federal antitrust agencies and then wait before doing anything, essentially wait before completing an acquisition of the shares and whatnot. And then again, depending on what he's planning to do from there. And then obviously you can see from here, it says he failed to do so violating the act. So this goes through exactly what they're supposed to do. It says they have to report large transactions over certain thresholds to the FTCN DOJ so that they can investigate the deals before they close. They have 30 days after the transaction has been reported to conduct an initial investigation, file a second request for additional information, generally illegal to finalize an acquisition during this investigatory period. The maximum civil penalty comes out to 43,792 per day. And that's when he made the correct of filing. So it looks like it was not exempt under the investment only exemption, even though that he represented less than 10 of the outstanding voting securities. So this is again,",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:05:18",
      "start_timestamp_seconds": 318.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=318"
    }
  },
  {
    "text": "period. The maximum civil penalty comes out to 43,792 per day. And that's when he made the correct of filing. So it looks like it was not exempt under the investment only exemption, even though that he represented less than 10 of the outstanding voting securities. So this is again, that differentiation where the purchaser says like I'm planning on doing something or kind of what Rory and Kitty recently did Keith Gill. And he said, I'm just an investor. I just, you know, exceed a certain reporting threshold. So then you can see here when acquiring the Wells Fargo shares, Cohen intended to influence Wells Fargo's business decisions as evidenced by his emails when he advocated for a board seat. Right. So and that goes all the way back to this. So when we're talking about him closing the deal, that's why it matters. Because in this case, the deal obviously is just the transaction of the shares. But then he was expecting to use that power to then affect the business. So this looks like kind of just something to appease, close this out and move on for somebody like him paying a million bucks. It's a lot of money. It's not ideal. But I don't think he probably cares that much. And this is likely just him looking to move on with the path here. So I don't really think this matters a whole lot. I think it's generally interesting because, I mean, you don't like seeing",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:06:31",
      "start_timestamp_seconds": 391.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=391"
    }
  },
  {
    "text": "of money. It's not ideal. But I don't think he probably cares that much. And this is likely just him looking to move on with the path here. So I don't really think this matters a whole lot. I think it's generally interesting because, I mean, you don't like seeing somebody like him getting called out like this or breaking the rules like this. But it's whatever. Like I don't think that this material changes much. Okay, now let's talk about Chewie really quick. So Chewie, they announced a public offering. And this is I think really confusing because as you read through this, you can see that there's going to be a 500 million share of class A being offered. But it's not from Chewie. They're not issuing shares. It's from buddy Chester sub LLC who's advised by BC partner advisors LP. And so essentially, what is going on here is this shareholder is unwinding some of their position. And then Chewie is saying that they're going to buy 300 million of it. So this person's offering 500 this entity is going to sell 500 million shares. They're treating it like an offering. And then Chewie is choosing to buy 300 million of it. And then concurrently, they still have a 500 million repurchase program that was authorized and is separate from this. So they're just scooping up 300 million of this 500 million 200 million will hit. And then they still have this 500 million repurchase program going",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:07:51",
      "start_timestamp_seconds": 471.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=471"
    }
  },
  {
    "text": "buy 300 million of it. And then concurrently, they still have a 500 million repurchase program that was authorized and is separate from this. So they're just scooping up 300 million of this 500 million 200 million will hit. And then they still have this 500 million repurchase program going on. So overall, interesting. I find some of the details behind it a little murky. Still, I need to do a little bit more homework. But that's just what I'm seeing so far. So I thought folks might be interested at least in my rudimentary understanding. I'm not an expert on this exact thing. But that's what I read here. So as always, anything I should take a look at, let me know. Later today, I'm doing an outlier pro livestream that's open to everybody. I made a post on YouTube because I'm going to be breaking down some pretty big trades that I made for the FOMC. And I want to talk through how I structured those. And then I also want to talk about kind of the current landscape of the market because I think things have changed a little bit. And I think it's worth while having a conversation a little more detailed about what that means, at least for the way that I'm treating the markets, which is typically what I do in those pro livestream sessions. So completely free to join. You can grab the link from the YouTube post. It's unlisted. So it's not",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:09:04",
      "start_timestamp_seconds": 544.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=544"
    }
  },
  {
    "text": "a conversation a little more detailed about what that means, at least for the way that I'm treating the markets, which is typically what I do in those pro livestream sessions. So completely free to join. You can grab the link from the YouTube post. It's unlisted. So it's not going to show up on the YouTube channel, otherwise. As always, if there's anything you want me to take a look at, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "tVkDtu_mOjI",
      "title": "Gamestop Options, Ryan Cohen, & Chewy Offering",
      "url": "https://www.youtube.com/watch?v=tVkDtu_mOjI",
      "upload_date": "",
      "duration": 627.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:10:05",
      "start_timestamp_seconds": 605.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tVkDtu_mOjI&t=605"
    }
  }
]