[
  {
    "text": "Cut the tails off in your trading. What the hell does that mean? I'm going to walk you through it. I'm also going to explain why you care because it can help you make more money trading. And at the end of the video, I'm going to walk you through the exact process I follow to identify and manage tails in my trading. What's up, everybody? Eric here. Welcome back to all the outliers. Shout out to the Patreon family. Consider signing up. We've got weekly workshops, all sorts of cool things in there. And without further ado, let's get started. Here we have a 68,000 account. And the title of this Reddit post, I know that probably shocks you that this is where this is from. And it says, incoming 50,000 loss. Send my favorite part here. It says, I know. I'm stupid for doing this. Yes, you are. Never thought in video would move like it just did. Guess what? This person just figured out what a tail is. When we talk about tails, it is synonymous with extreme data points in a data set. You think about it. My branding for my YouTube channel and my community be an outlier. That is a tail. An outlier is a part of a data set, but it's a tail. In this case, we think a positive skew tail. A good tail. In trading, we typically want to look at the tails that hurt us. So let's get a better",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "be an outlier. That is a tail. An outlier is a part of a data set, but it's a tail. In this case, we think a positive skew tail. A good tail. In trading, we typically want to look at the tails that hurt us. So let's get a better sense of what that actually is. If we take a look at this strategy, this is a zero DTE SPX 15 Delta Strangle. I run tons of these. Don't worry about all the details. Just know in this example, I'm referring to something that has no stop, has no wings. This is just placed as is. And this is running from 2018 to 2024. This returned 1,210 at a 0.2 compound annual growth rate. This is why we care about the tails. Because if I apply a stop loss to this strategy, everything else is the same. It returns 55,152 at a 7.6 compound annual growth rate. This is why we care about the tails. It can help you make a lot of money. Now, it's really important to know. This is a delicate process. Because as we go through this, you're going to notice a few things that are worth calling out. So to help us understand that, let's take a look at what tails are. If you look at this distribution, notice these little purple dots pretend that that is the profit and loss for your trades. So as we look across this standard distribution, know that you",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "worth calling out. So to help us understand that, let's take a look at what tails are. If you look at this distribution, notice these little purple dots pretend that that is the profit and loss for your trades. So as we look across this standard distribution, know that you don't have to have a standard distribution. It could be leptocardic, mesocardic, it doesn't matter. It could have all different kinds of skew. The point being though, that at some point in the data set, you're going to notice this right here, mu, which is the mean. This is the average of the data. So that's where the bulk of the data falls around. And if you look at the negative one in plus one standard deviation, that's sigma, you'll see that 68.3 of data falls within negative one and positive one standard deviations. Interesting thing is you go down to two standard deviations. This is 95.5 of data. And then 99.7 of data at three standard deviations. So as you go further out in your standard deviations, it becomes more and more inclusive of your data set. Notice that there's both positive and negative deviation. So in the case of this being PNL for a trade, this means these are your losing trades, these are your winning trades. We want to have as many winning trades. And if we have some big winning trades over here, that's great. You have to keep all things in context though. If you",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "of this being PNL for a trade, this means these are your losing trades, these are your winning trades. We want to have as many winning trades. And if we have some big winning trades over here, that's great. You have to keep all things in context though. If you have a bunch of outliers in your winning trades, you have to take a close look at what's going on there. But an easier place for us to start is looking at the losing side of the equation. So what does this look like in a practical sense? Well, if we take a look at those first two strategies that I shared with you, the short strangle without a stop and then with a stop. Without a stop, notice the average profit was 3.11. Average loss was negative 11.91 max profit 1340 max loss was negative 7,287 dollars. After I applied the stop, take a look at what happened to the average profit. It went from 3.11 down to 307. The average loss went down to 6.70. The max profit remained the same, no impact to that. And then the max loss went down to negative 3345. So we improved both the average loss and the max loss by about 50. And then we took a minor hit to the average profit, no impact to the max profit. This is how we can approach cutting tails off of our strategies. This is why this strategy returned so much better. Because",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "both the average loss and the max loss by about 50. And then we took a minor hit to the average profit, no impact to the max profit. This is how we can approach cutting tails off of our strategies. This is why this strategy returned so much better. Because when I looked at this and you see the average loss is 1,200 bucks, the max was 7,300 bucks. That's a big difference. Notice the difference between these from 6.70 to 3,300 bucks. Still big difference, but not as big. This is massive. So this is why we care about tails. This is what they look like in a data set. So now let's talk about how we go about getting rid of them. When you start this process, you have to be aware of something called overfitting data. I'm not going to go into statistics 101. Just note that when we're looking at back-tested data, it's looking at previous information. We have to be aware that whatever we do to previous information as we receive new data points, it's going to look different. So if you optimize a strategy so that it looks perfect in a back-tested sample, going forward, it's not going to look anything like that. That strategy is not going to be robust because you have overfit your data to a specific sample that is continually changing. So we're looking for things that are more robust. The other thing to keep in mind is as you",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "forward, it's not going to look anything like that. That strategy is not going to be robust because you have overfit your data to a specific sample that is continually changing. So we're looking for things that are more robust. The other thing to keep in mind is as you go through this process, it's not as simple as just cut the tails off. Because if you notice as we cut those tails off, it impacts the rest of the expectancy of the trade. So we'll get into what that means in just a minute. So the first thing is start with a large data set. The more data, the better. Ideally, you have a trade log. And if you are in the Patreon, you have access to a free sample of one to get you started. The reason why we want a large data set, though, is because it gives you a wide lens to start with. So what I like to do in this example is you can see these are all different permutations for zero DTE strategies. And this top one you'll notice the max profit and loss. There's no application. I'm not touching it. I'm putting the trade on and letting it go to expiration. Notice the max loss in this scenario was 8251. Then you'll notice I started applying max loss protocols. Then I apply max profit protocols. Then I combined the two protocols. What I'm doing in the beginning is I'm looking for extremes.",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "the trade on and letting it go to expiration. Notice the max loss in this scenario was 8251. Then you'll notice I started applying max loss protocols. Then I apply max profit protocols. Then I combined the two protocols. What I'm doing in the beginning is I'm looking for extremes. And then I'm trying to apply different rules that help me control the extremes while monitoring the impact to expected return. So here's what that means. If I take a look at this strategy and I apply a 200 max loss, meaning 200 of the credit received, that takes my max loss from 8250 down to 3 grand. That is a great change. Now, if I look at the average win, prior to the adjustment, it's 378. And after the adjustment, it goes down ever so slightly. So I don't actually care. That means I haven't made a big impact there. Now, notice how the number of winners changes. The number of winners with no management is 642. The number of winners in this case is 584. So what's happened? We have less winning trades here. What's going on in this scenario is because we have a stop when this strategy goes out, there are periods that the trade profit and loss goes outside of your stop. You get stopped out. So it's no longer a potential winning trade. That's a losing trade in this case. But sometimes it comes back in and becomes a winner. So if you do",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "strategy goes out, there are periods that the trade profit and loss goes outside of your stop. You get stopped out. So it's no longer a potential winning trade. That's a losing trade in this case. But sometimes it comes back in and becomes a winner. So if you do not apply a delicate balance here, you can have things that get stopped out. And then as it comes back in, you would have made money. The other thing you can do is try adding legs to strategies like this. This is just a concept I'm sharing. The problem with adding legs is multiple fold. Not going to go into detail. This isn't about this explicit strategy. This is specifically about the idea of cutting tails off. But if you want to talk more about that, let me know. And I can make a video on it for you guys. So after this, we figure out what rules we think we can apply. So in this case, I see a big loss. I want to figure out how to get this loss down without affecting the profit too much. So I start by applying stops. I start by applying buying legs. Because if you buy legs, that seems really great. Because then you don't have this instance where something goes out of sample and comes back in. Seems great. But unfortunately, it doesn't work that great. So after you apply it to the broad data set, then you need to",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "legs. Because if you buy legs, that seems really great. Because then you don't have this instance where something goes out of sample and comes back in. Seems great. But unfortunately, it doesn't work that great. So after you apply it to the broad data set, then you need to apply it to segmented data. So what that means is if you remember in the original example, we looked at 2018 to 2024, that entire period, then what I'm going to do is split that period up typically in half, test those two periods. So the first half of that range, and then second half, and then I'm going to split it up into each year. By doing this, I'm making sure that the strategy holds up in different market conditions and isn't just being smooth because of a long runway. It's really important to segment your data in this way to make sure that you have stuff that falls in sample and out of sample. Again, I'm not going to go into statistics 101. It's good practice. Just know that. Then you can apply it to projected data. You could throw it into a money carload simulation to get new prices for future occurrences, lots of deviations, and see how it holds up. Then from there, start testing in a small amount of money, paper trading live, stuff like that, put real money behind it, see how it does, and continually optimize it. Because markets change, if you apply",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "new prices for future occurrences, lots of deviations, and see how it holds up. Then from there, start testing in a small amount of money, paper trading live, stuff like that, put real money behind it, see how it does, and continually optimize it. Because markets change, if you apply one structure here, that doesn't mean it's going to work forever. This is a big reason why in the past year, I was trading a lot of short strangles versus my typical go-to for a long time before that was short straddles. And it's because markets change. You have to stay sensitive to how things are doing. So in a nutshell, the way we cut tails off our trading is we review data. We segment the data out after we apply different rules that we think might work. And we observe the impact to our expected return. If you're unfamiliar with what that is, I'll throw a video in the notes below. This is simply how things perform in aggregate looking at win probability, average win, loss probability, average loss. That gives you a really solid idea on how you can project something like this forward, using sample data. And to decrease the unnecessary losing positions that you have, and to decrease the drag you experience on your portfolio. If you have any questions, let me know. Be an outlier. You guys later.",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  },
  {
    "text": "to decrease the unnecessary losing positions that you have, and to decrease the drag you experience on your portfolio. If you have any questions, let me know. Be an outlier. You guys later.",
    "metadata": {
      "video_id": "tvNQQmOc3t0",
      "title": "How to Become Consistently Profitable Trading Options | Cut the Tails!",
      "url": "https://www.youtube.com/watch?v=tvNQQmOc3t0",
      "upload_date": "",
      "duration": 682.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=tvNQQmOc3t0&t=0"
    }
  }
]