[
  {
    "text": "Hey everyone, Eric here. We got some small stacks updates to get through. So I wanted to jump into those very quickly. In short, the account is actually pretty allocated. A little more than I was expecting it to be, but I like what I have on. So let's go to the screen. Okay, so right now the account value is 59.17. Utilization is 40.92 and we're about 70 utilized. Total PNL not just over 900 bucks. That represents a 15.15.5 return. And right now we have 255 out, which is a 4.31 return on the account. So let's see the trades that have been made. First off, if you'll notice, forward is down. So I took that entire trade down. Total PNL in it was 124 after closing the short calls. And that's a 13.7 return on invested capital in that trade. So that was pretty much an easy win as far as I could tell. I do like Ford still. It's something that I might revisit, but just seeing the move that it made, it essentially made the move that I was looking for it to. So I didn't maintain exposure. So if we take a quick looking, kind of see what I'm talking about. When I first entered Ford, it was quite a bit lower, definitely in the sevens, like mid sevens and maybe yeah, definitely mid sevens. I don't totally remember what the price was on entry. I'd have to look at the date. But essentially",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=0"
    }
  },
  {
    "text": "kind of see what I'm talking about. When I first entered Ford, it was quite a bit lower, definitely in the sevens, like mid sevens and maybe yeah, definitely mid sevens. I don't totally remember what the price was on entry. I'd have to look at the date. But essentially after it made this high, I was getting ready to unwind and then just on the down day today, just made sense. To take the whole position down. That's where we're at in Ford. Then for. A croger, the only adjustment that I think that's this one. Yeah. So for in croger, it's pretty simple. All I did was take the short call down. At a profit. And I did not lay anything new out. And the reason for that is as things sit right now. I would, I could sell at the 35 five or at the 36 strike, but short calls, but it wouldn't make that much money. So I would rather just leave it uncapped for now. The trade itself is still returning well. I've realized 288 in profit with 1357 outlay. So overall, it's returning well. I'm not going to prematurely close off the potential profit. Now, one strategy I am looking at in here is maybe selling one call on a rebound. And then leaving it at a ratio, kind of like that. So if we take a look real quick at croger, you'll see it's made a move down. It's made a move back",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:01:22",
      "start_timestamp_seconds": 82.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=82"
    }
  },
  {
    "text": "Now, one strategy I am looking at in here is maybe selling one call on a rebound. And then leaving it at a ratio, kind of like that. So if we take a look real quick at croger, you'll see it's made a move down. It's made a move back down to this minus two. And that's why I'm not really in a big rush to sell the calls. It could obviously continue down for sure, but just based on general, my general approach to trading, seeing it hold this 200 day moving average and be it a negative two standard deviation. I think overall, I probably would favor at least some sort of move to the upside, even if it's limited. So if I see that, that's when I'll start adding a couple short calls. There is definitely some premium in there, even at the lower deltas, like if I were to sell 35, 5, but it's just not enough. Compared to what I know I can get. So this is one that I intend to keep an eye on. And then finally, you'll notice a new diagonal in Intel. So this is actually a position that I'm mirroring a similar version in my margin account, not quite the same. Simply because I just want with short puts in there, but generally bullish. And obviously couldn't afford that realistically in the smallest acts accounts. So instead I went with the diagonal. And I took in the 18 June 21",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:02:40",
      "start_timestamp_seconds": 160.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=160"
    }
  },
  {
    "text": "a similar version in my margin account, not quite the same. Simply because I just want with short puts in there, but generally bullish. And obviously couldn't afford that realistically in the smallest acts accounts. So instead I went with the diagonal. And I took in the 18 June 21 37 and a half calls. And I paid 10.35. And then I sold the four D 47 calls. And I got 1.65 that of 48 delta. That's 165 credit. And almost a 16 return on invested capital, which again, would be completely happy with that. This is a slightly tricky position because I do not want it to take a third of the account. Third represent 33 of the account or so. And I say that because right now I have 2,000 allocated to it. That was more just kind of taking a look more probably than anything. I will not add to this trade unless it comes down significantly. And I could add something for like 600. That I would consider kind of taking that a lot of them down from 2,500 is probably the way forward here. And I really like Intel, but. Just general good portfolio management. I don't want this position to represent that much of the account. And then so in here I did sell the short call against it. And it's mostly because the premium was really good. I still think that. The propensity for this trade is for that short call to fall",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:04:03",
      "start_timestamp_seconds": 243.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=243"
    }
  },
  {
    "text": "I don't want this position to represent that much of the account. And then so in here I did sell the short call against it. And it's mostly because the premium was really good. I still think that. The propensity for this trade is for that short call to fall in the money. At least some point. Relatively in the future, I don't see Intel, you know, necessarily staying down here at 46. But nonetheless. I wanted to make sure that I kind of realized that premium upfront. So best scenario, just like any other diagonal is the short call falls on the money. And then I have to manage it that way, which would be totally cool. No sweat with that. But otherwise this trade will kind of be set and forget and more revisited in closer to December. And then lastly, I have a short put out in mosaic at 17. And this was honestly a really good trade for me because I like mosaic. And this bit of a down move has moved it closer to where I could reasonably enter. Now, there is earnings coming up, which I perceive to be a positive catalyst. This is not necessarily an earnings play outright. If you'll notice how far out in time I went, but I was using the earnings. I'm increasing volatility to try to increase the return on the position collecting 90 cents on a 17 strike is obviously really good premium. If I do get",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:05:27",
      "start_timestamp_seconds": 327.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=327"
    }
  },
  {
    "text": "not necessarily an earnings play outright. If you'll notice how far out in time I went, but I was using the earnings. I'm increasing volatility to try to increase the return on the position collecting 90 cents on a 17 strike is obviously really good premium. If I do get a bounce leading into earnings or, you know, bleed off of volatility, I will take the trade down. For a smaller profit, maybe 20 or so. But if it doesn't happen and I run this into earnings, I'm okay with it. We'll see, you know, how earnings goes, but this is a cash secured put for me. This is something that I would not mind owning longer term. It would utilize 1,700 and that's fine. So on all the account is relatively utilized at this point. I found a few trades to put on that I like. And we'll see big dependency really is croaker. I want to add those short calls when I pretty much soon as I can because that's realized money. You just don't want to do it down here for Intel and mosaic. Those are almost set it and forget just kind of check it in a few weeks and see what they're doing. But right now I like where the account is unlike my margin account small stacks to stay and allocated. It's too little money. Again, if there's some sort of big down move after the election, I don't really care because I'll hold",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:06:37",
      "start_timestamp_seconds": 397.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=397"
    }
  },
  {
    "text": "a few weeks and see what they're doing. But right now I like where the account is unlike my margin account small stacks to stay and allocated. It's too little money. Again, if there's some sort of big down move after the election, I don't really care because I'll hold the products that I have. And the small stacks account, I can't say it enough. It's not going to be the thing that's going to make anybody rich. You're not going to turn that 5,000 even 100,000 into your future, you know, wealth. This is working through mechanics and strategy and really proof of concept that we can implement a successful strategy. So that's why I'm not as concerned about preservation of capital in this account. As compared to what I'm doing in my margin account, which is more so scaling into the election just to limit exposure to that binary event. I'm not applying that same paradigm here. So we'll see what this looks like. I do think that this will be relatively quiet at least for a week or two. And the next trade I expect to make would be short calls and croaker to add some short premium there or closing mosaic out leading into earnings. Otherwise, we should be pretty static. As always, if there's any questions or anything anybody wants to work through, let me know and I will catch everybody later.",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:07:43",
      "start_timestamp_seconds": 463.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=463"
    }
  },
  {
    "text": "premium there or closing mosaic out leading into earnings. Otherwise, we should be pretty static. As always, if there's any questions or anything anybody wants to work through, let me know and I will catch everybody later.",
    "metadata": {
      "video_id": "TwmxypaxWeU",
      "title": "Portfolio Adjustments INTC, F, MOS, KR - Small Stacks",
      "url": "https://www.youtube.com/watch?v=TwmxypaxWeU",
      "upload_date": "",
      "duration": 545.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:08:46",
      "start_timestamp_seconds": 526.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=TwmxypaxWeU&t=526"
    }
  }
]