[
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 13,
    "text": "What's up, outliers? Quick market update. I got three things on the agenda. The first one is what you see on the screen. We're going to talk a little bit about September 11th, because your boys are patriot and it's important to continue that message. The second thing I want to talk about quickly is actually looking at the broad market and specifically tech slash Nvidia. There's some interesting activity going on there. And then the third thing for today is actually going to be chewy. And I want to discuss a few things I'm seeing in there specifically. So kind of a broad market update today with a few bubble points. Let's dive right in. So for those that don't know today's September 11th, and I think it's important to at least talk about it very quickly. You can check out this really, really, really good video from National Geographic. This is kind of just about the attacks from the American perspective. So there's not a lot about war fighting and stuff in here, which honestly is what I'm more interested in. There's a couple other documentaries. I think are better for that. But the thing that I think is important to highlight about this is I feel like most of us in this Western world consider us civilized and, you know, we're really, really comfortable here comparatively. I know for Americans that haven't traveled a lot that's kind of hard to see. We can always find things to",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=0"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 13,
    "text": "is important to highlight about this is I feel like most of us in this Western world consider us civilized and, you know, we're really, really comfortable here comparatively. I know for Americans that haven't traveled a lot that's kind of hard to see. We can always find things to bitch and complain about. But if you look across a lot of the world, it's very little compared to most other places. So we live in a pretty cool spot. And I think this is an important reminder that even though we live in a cool spot, it can be disrupted. And this is a reminder of how cool of a spot it is that something like this is still so prolific and it's something that's happened over almost a decade and a half ago, right? We don't get that much heat here. And it's very fortunate because of our geographical location, our neighbors, all that kind of stuff. So it's not getting into politics, anything like that. Couldn't care less. The main thing is just to be thankful for where we are to be reminded that a lot of the world is not quite as fortunate. And as I try to remind people is that although we play the game civilized, we are all quite literally still animals. Violence is a part of human nature. It's not changed since our existence. I don't see it changing anytime soon. So this is exactly why we say things like be hard",
    "start_timestamp_seconds": 54.76,
    "start_timestamp": "00:00:54",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=54"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 13,
    "text": "try to remind people is that although we play the game civilized, we are all quite literally still animals. Violence is a part of human nature. It's not changed since our existence. I don't see it changing anytime soon. So this is exactly why we say things like be hard to kill. Just remember, people can suck as much as we have these ideals about how good we want things to be, how we would love there to be flowers and butterflies everywhere and everybody to love one another. It's just unrealistic. There's going to be different people that believe different things. So you can like flowers and butterflies. I think they're sick too. But I also think it's important for people to remember the overall scope of the world. So big day, this is a transformative day for me. I remember it literally crystal clear. I was still a kid at this time. I was in elementary school. And this is one of the reasons why my brother joined the Marine Corps. Why I joined the Marine Corps? We saw this happen and we're like, we're going to war. Let's do what's got to get done. So that's that. Let's get on to the markets. So DJT funny enough. I wasn't going to talk about it, but fell off a cliff. So this was interesting to see. This has just been a vicious, vicious downtrend. This isn't anything that I trade as you could tell. I think it's a",
    "start_timestamp_seconds": 113.92,
    "start_timestamp": "00:01:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=113"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 13,
    "text": "Let's get on to the markets. So DJT funny enough. I wasn't going to talk about it, but fell off a cliff. So this was interesting to see. This has just been a vicious, vicious downtrend. This isn't anything that I trade as you could tell. I think it's a great trade to the downside. Although the downside is starting to look a little bit exhausted here because it's kind of like how far down can it go? And it looks like it's almost at IPO levels. Yeah, it's essentially all the way down near all time lows. So you might get another couple bucks down like the 14 handle, but not what I wanted to talk about. Let's dive in here. This. This is what I want to highlight. Take a look at this candle in queues. Queues right now is essentially what led to this massive rally in the SP 500. And as per usual, it comes down to a handful of names. We saw volatility contract down now, even below 18. It's in the mid 17 handle. And the market is starting to catch a bite here. But again, I still view this as tenuous. Now I did add a queues position today. I have NASDAQ futures to complement my SP futures, but it's very, very tenuous. I do not have a position still in IWM, although as you all probably know, I typically prefer to just don't see it right now. And it's because even though",
    "start_timestamp_seconds": 168.48,
    "start_timestamp": "00:02:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=168"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 13,
    "text": "did add a queues position today. I have NASDAQ futures to complement my SP futures, but it's very, very tenuous. I do not have a position still in IWM, although as you all probably know, I typically prefer to just don't see it right now. And it's because even though this does start look like it might be rallying, it's just way too early. And there's no, there's no heroes in the market. I have found that the game of trying to top tick or bottom tick or perfectly time reversals as a really difficult game. I don't want to call it a fool's errand because some people can do it really well. I just find it to be an absolute minority of people that can, and it's not me. I'll tell you that. I miss time it all the time. And that's just how this game goes for me. I have to adopt a different strategy to deal with my litany of issues that being one of them. So that part aside, I do think when I look at queues that this starts to get interesting. So let's take a closer look at QQQ. And let's see how it's performing. I want to come into a six month because here's what I've highlighted before. This is a really important level in my opinion. And the reason why this level is very important to me is because once we start dropping below this handle, we really collapse this higher low",
    "start_timestamp_seconds": 229.84,
    "start_timestamp": "00:03:49",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=229"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 13,
    "text": "performing. I want to come into a six month because here's what I've highlighted before. This is a really important level in my opinion. And the reason why this level is very important to me is because once we start dropping below this handle, we really collapse this higher low thesis. Again, lower low, higher low, higher low. But there's a couple issues I see with this move. The first one is look at the compression. So if you look at the distance between this lower low and then this higher low, that's a fair period of time. It's like four months almost. So that move compared to what we're seeing now from here to here is about a month. So this is more reminiscent of this move. And that doesn't mean that it can't, bounce around here for a little bit, shoot up, then come back down. Who knows where it goes? It goes circles. But what I'm really trying to highlight here is although I like the movement that I'm seeing in tech right now, I also understand that it still seems fairly tentatively moving in my opinion. The moving averages are an absolute mess. It's starting to look healthy. Again, that's why I built a position today. But it's something that I'm watching very carefully. And the way that I play those kinds of positions is to be really aggressive because I'm not trying to bottom ticket, right? Like I waited till today to start getting in.",
    "start_timestamp_seconds": 297.92,
    "start_timestamp": "00:04:57",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=297"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 13,
    "text": "look healthy. Again, that's why I built a position today. But it's something that I'm watching very carefully. And the way that I play those kinds of positions is to be really aggressive because I'm not trying to bottom ticket, right? Like I waited till today to start getting in. But I also don't want this to roll right back over as it starts coming up into this handle, which is really where near term resistance is going to be kind of like first stop will be there ish. And if it gets up there and gets stuck up and starts shooting back down, that's exit for me right away. And then I would wait until some sort of ability to break above this. If it hits it consolidates and then starts moving up, great. But I'm really sensitive to a down move off of that at this point because again, you can see that this has happened. This happens with stocks all the time when they have these failed breakouts on consolidation that weekends. This all goes back to the broader thesis. The market right now is so freaking emotional. And if you need proof of that, look at Nvidia. Nvidia got trounced, got murdered here in the beginning of August, then after earnings, which were really good earnings, it went from one 28 down to 101, almost a low of 100, I think actually, yeah, a low of 195, a massive down move. And now it's starting to",
    "start_timestamp_seconds": 368.56,
    "start_timestamp": "00:06:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=368"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 13,
    "text": "Nvidia. Nvidia got trounced, got murdered here in the beginning of August, then after earnings, which were really good earnings, it went from one 28 down to 101, almost a low of 100, I think actually, yeah, a low of 195, a massive down move. And now it's starting to rally back out. So to see these kind of movements based on solid earnings, most of this is from a broader economic sense. Again, in my opinion, there's a lot of broad economic factors, which we'll go into later during the YouTube live stream a little bit later today. But that's what I see going on with Nvidia. I mean, it had a crack day. It was up what, eight points. So I mean, a massive massive rally. And the interesting thing I find about Nvidia here is that it is still consolidating well. So what that means is I'm setting new alerts to kind of follow this move up and see how it performs. But again, low, higher low, higher low. So even though it's having these really nasty selloffs, which I don't love from a volatility perspective, it's rallying out and it's not falling too deep. So tech is still alive here. It just looks like it's really, really dependent on external factors at this point. Energy getting killed. So I still have my fades in energy. I'm pleading individual stocks, not XLE writ large, but that's playing out really, really well. And we can also see a",
    "start_timestamp_seconds": 426.88,
    "start_timestamp": "00:07:06",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=426"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 13,
    "text": "is still alive here. It just looks like it's really, really dependent on external factors at this point. Energy getting killed. So I still have my fades in energy. I'm pleading individual stocks, not XLE writ large, but that's playing out really, really well. And we can also see a couple interesting behaviors. XLF caught a bite today. That started selling off pretty hard. And we're starting to see again rotation among the sectors. So XLU still strong performing, XLR is still strong performing. XLP stay still hanging in there. And XLK obviously technology is really starting to rally up out of here, but this is not out of the woods in my opinion. This is not whole port tech. All right. So the last thing I want to take a look at with you quickly is Chewie. And it's because people are obviously really excited and the timing for roaring kiddie's post about Chewie and dropping the toys is really funny. And a lot of people are going back and forth as to whether he caught this move or not or whether he's already out based on that post. We still haven't seen a refiled 13G, which he would owe within 10 days of when he made the transaction that would cause him to fall below 5. So let's say, for example, because after I think his percentage would have increased pretty meaningfully because of the corporate actions from Chewie. So that could put him at a higher percentage.",
    "start_timestamp_seconds": 504.32,
    "start_timestamp": "00:08:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=504"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 13,
    "text": "owe within 10 days of when he made the transaction that would cause him to fall below 5. So let's say, for example, because after I think his percentage would have increased pretty meaningfully because of the corporate actions from Chewie. So that could put him at a higher percentage. He could have sold some of it, not hit the 5 threshold, waited a little bit. And who knows, maybe you caught a little bit of the move today. But based on our best guess is the date that he got into at least cross the 5 threshold was back here. So again, this is still not big bucks for him. Even if he top tick tick going from 26 to 30, it's a lot of money. It's a ton of money. But again, like we've seen this dude go through a quarter billion dollar rally and just hold it. So my guess is he's not trying to play this move as anything significant. He is a time traveler that's doing something else. But I do think it's interesting because it's important to highlight the move that happened today. So if you'll notice, we saw that pet co-wolf, it had really good second quarter results. So you can see that it missed its earnings target, expected what, two cents. But overall, we saw growth within wolf. And you can tell that the market really, really, really liked the report. So this is again, a really important comparison. When we're looking",
    "start_timestamp_seconds": 574.24,
    "start_timestamp": "00:09:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=574"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 13,
    "text": "really good second quarter results. So you can see that it missed its earnings target, expected what, two cents. But overall, we saw growth within wolf. And you can tell that the market really, really, really liked the report. So this is again, a really important comparison. When we're looking at the performance of products and earnings releases. Sometimes we get too wrapped up in the idea of, oh, if it's a earnings miss, the market's going to hate it. And it's going to collapse not necessarily. It all depends on the context. So in this case, again, you can see that let's grab wolf really fast. And you'll see it came in at negative two cents. It was expected at negative eight cents. So really, really big beat in terms of EPS. It fell a little bit short on some of its metrics. But that earnings beat absolutely through pet co-through the roof on today. I mean, it's a 32.9 move. So Chewie moved some of that in sympathy. And again, this is very common for stocks that share similar industries around earnings. Because if you see collective strength, then it typically means some of that strength will pass between other companies in the same industry. So this is a really interesting movement today. And I didn't go through all of the earnings yet. I did see that there were some elements that were a little bit soft from the earnings. But overall, it looked like it did. It",
    "start_timestamp_seconds": 640.0,
    "start_timestamp": "00:10:40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=640"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 13,
    "text": "between other companies in the same industry. So this is a really interesting movement today. And I didn't go through all of the earnings yet. I did see that there were some elements that were a little bit soft from the earnings. But overall, it looked like it did. It did really, really well. You can see capital expenditures, 140 million. So they're investing adjusted EPS came in three four cents for, this is looking for Q three. So this is forward-looking guidance. So yeah, I mean, overall, it looks like the company is, I mean, this isn't something that I love. This isn't something I typically would trade its way too cheap of a stock. But it looks like overall, we can see that like, for example, net revenue came down half a percent year over year. I know that that's we, we normally really don't like that. But there was enough other components that counteracted that and led to the market really liking the move. And then the forward guidance. So really, really massive move in pet co. So there apps me up. I'll see you on the live session later today. 5 p.m. Pacific time being out there. See you guys later.",
    "start_timestamp_seconds": 718.0,
    "start_timestamp": "00:11:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=718"
  },
  {
    "video_id": "u7Q26iOXaHo",
    "title": "Analysis: NVDA, CHWY, WOOF | Stock Market News",
    "url": "https://www.youtube.com/watch?v=u7Q26iOXaHo",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 13,
    "text": "there. See you guys later.",
    "start_timestamp_seconds": 788.72,
    "start_timestamp": "00:13:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=u7Q26iOXaHo&t=788"
  }
]