[
  {
    "text": "you you you you you you you you you what's up out liars happy friday hope the relief rally today took some of the throughout the tough the as that's change for information. Again, this will be at a slightly more basic level, so some of the concepts I'm going to gloss over so that we don't get bogged down, but I want you to be aware of them. And then hopefully we will be able to get a little further into detail as we get further along in the video and hopefully on the next version of the series that we do. Now, one quick admin note for the outlier options trading basics series is I had to reconfigure our sessions just a little bit and it's just to accommodate some travel and stuff so that I'm not stopping in the very middle of the series because that wouldn't be ideal. So I want to show you this syllabus as it sits and I have to move it so that I can also see how it has sits. Okay, so we are here in the options chain navigation and then we have essentially two more videos in this mini series about options trading basics. The next one is going to be how to build trade and then the one after that is going to be portfolio management. And then I have one bonus video after those two which will be on the 21st of March will kind of be",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 45,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=0"
    }
  },
  {
    "text": "series about options trading basics. The next one is going to be how to build trade and then the one after that is going to be portfolio management. And then I have one bonus video after those two which will be on the 21st of March will kind of be like a summation. We'll recap the series at a super high level, but the most important thing that I want to accomplish during that 11th episode is helping people create a path forward for themselves. So that's really the intention I have and then obviously we can do a generalized QA or anything that we didn't answer or you want to dive a little deeper into. So just so that you understand where we're at in this broader series, we've been at it for a hot minute. Now I have a slightly compressed time frame today so I'm not going to run through too deep of a quiz and all that stuff. I have to skip over it because I don't want to run out of time. I want to get into this. So I'm going to move us over onto the main screen here and then we'll bring this along and then we'll talk about this. Now your TLO's terminal learning objectives is not only should you have an understanding of how to read an options chain literally just to find your way around, but you should also have an understanding of some of the data and information we",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 45,
      "start_timestamp": "00:05:51",
      "start_timestamp_seconds": 351.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=351"
    }
  },
  {
    "text": "along and then we'll talk about this. Now your TLO's terminal learning objectives is not only should you have an understanding of how to read an options chain literally just to find your way around, but you should also have an understanding of some of the data and information we can extrapolate from market specifically options markets and market pricing. The reason why this is so important is because options are leveraged markets. What that means is other than your friend who likes to lick windows and you're not sure if they can tie their shoes and their proclivity to yolo on zero DTE options, most of the money in options tends to be more informed, quite informed because they're pursuing leverage with these ideas. Because of that, we can reliably pull very usable information out of the markets. And I have a couple examples that I will give you towards the end of the session, but that's the so what here. We have the very basics of how do we even look at these things and understand what we're looking at? That's the very basic. And then there's the more important level beyond that of how can we use options chains to glean information because they are full of information that I use literally every single day. If you've seen me in the GME series that I've been doing analyzing GameStop options, I talk about a lot of these tools that I'm going to introduce you to because they're",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 45,
      "start_timestamp": "00:07:06",
      "start_timestamp_seconds": 426.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=426"
    }
  },
  {
    "text": "options chains to glean information because they are full of information that I use literally every single day. If you've seen me in the GME series that I've been doing analyzing GameStop options, I talk about a lot of these tools that I'm going to introduce you to because they're very useful. So that's our agenda for today. Before we get too far, I've got to say hello to everybody. So looks like we got magic hands and magic hands seems to be a little grumpy that there was no sound during the holding screen kickoff with the countdown. So that's okay. We have Reese Alex, Mr. Lex Ryan. Great to see everybody. Awesome. So let's start with this. This should take us literally two minutes. The option chain itself obviously is where you will find all of the individual options that you might try to analyze and or subsequently trade. The options chain is broken down into different explorations. We refer to these explorations as terms, T-E-R-M terms. So when we're referring to different terms, we're referring to different explorations. They're interchangeable. Within any individual term or expiration, you will see that there are two types of options. Cals and puts. You're familiar with all of those by now, but they split. So we have calls on one side, puts on the other. Other platforms don't do this side-by-side version. You will find some platforms actually use a stacked version, which is different. Just be aware that there are",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 45,
      "start_timestamp": "00:08:26",
      "start_timestamp_seconds": 506.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=506"
    }
  },
  {
    "text": "and puts. You're familiar with all of those by now, but they split. So we have calls on one side, puts on the other. Other platforms don't do this side-by-side version. You will find some platforms actually use a stacked version, which is different. Just be aware that there are different ways this will be presented to you. So on the data side, you will have the same data with respect to the columns for both the calls and the puts. The data obviously will be slightly different. For most of them, put call parity aside. You will find unique data points. And that's why it's split calls and puts. Then different platforms will present this differently. I'm obviously familiar with thinker swim. If you have questions about your platform, let me know. You can send in a screenshot into the discord. And I'll do my best to see what it is. I actually have no idea what Robin Hood's options chain looks like. Like genuinely zero idea. I've seen trades posted. So I know what the individual trades look like, but in the charts, but I have no idea what the options chain looks like in there. But the main thing is that there are certain data points that are super important to us. And then there are others that are kind of just good to know. So I'm going to slide this out of the way now. We're going to actually look at in options chain together. I",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 45,
      "start_timestamp": "00:09:54",
      "start_timestamp_seconds": 594.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=594"
    }
  },
  {
    "text": "main thing is that there are certain data points that are super important to us. And then there are others that are kind of just good to know. So I'm going to slide this out of the way now. We're going to actually look at in options chain together. I was looking at HWM earlier, actually with somebody on the mentoring program. So we'll just keep this up because we're in here. Now let's go into the trade tab. And let's get rid of this. I don't know what that example is from. And let's start with a standard expiration. One of the things to know, as as we look through the different terms, you'll see that there are kind of like these gray ones. And then there's these yellow ones. The gray ones represent standard option expiration, which is the third Friday of the month. And then we have weekly's, which is a weekly expiration. If we look at something like SPX, you will see daily expirations. The reason why they're different colors is because different expiration cycles need to be called out for a bunch of different reasons. One of the things you will find with options chains overwhelmingly, most of the liquidity is going to be in standard expirations. Why is that the case? Does anybody have a guess in the chat as to why this would be the case? Any guesses? Mr. Lex, daily will still have weekly? Yes, that's correct because it's telling you it's",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 45,
      "start_timestamp": "00:11:03",
      "start_timestamp_seconds": 663.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=663"
    }
  },
  {
    "text": "overwhelmingly, most of the liquidity is going to be in standard expirations. Why is that the case? Does anybody have a guess in the chat as to why this would be the case? Any guesses? Mr. Lex, daily will still have weekly? Yes, that's correct because it's telling you it's expiring within that week, right? So it's expiring in a week, meaning like within a subweek timeframe. So it just uses the same flag for it. Travel says institution trading. That's not wrong. Zoom it up one level. Why would institutions go into the standard expiration? This is important for you to know, especially if you're looking to trade options in different timeframes. If you don't understand this detail, you're typically stepping in front of illiquid options just because you happen to prefer the 17 DTE 17 marches. And instead of just going out a couple of extra days to 21 March, you're going to take a haircut on the liquidity of your options. There's a very specific reason why. No other guesses? I'll give you the answer. It's because that's where everybody goes. That's why it's a self-fulfilling prophecy. If we had the scenario where everybody chose to use this 10 DTE weekly option, these would be super liquid. They'd be the most liquid options on here. But they're not. And it's literally just because everybody just goes to these. That's literally why it is the way it is. The reason why you should know that's why the way",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 45,
      "start_timestamp": "00:12:07",
      "start_timestamp_seconds": 727.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=727"
    }
  },
  {
    "text": "this 10 DTE weekly option, these would be super liquid. They'd be the most liquid options on here. But they're not. And it's literally just because everybody just goes to these. That's literally why it is the way it is. The reason why you should know that's why the way it is is because if you find instances where most of the liquidity is in another cycle for some reason, there's typically a reason. And there were going to be a lot of these little instances that I highlight with that exact framing. There's typically a reason. And it's because this is the market giving you subtle context clues based on what's normal. And then based on what the deviations off of normal are. That is a big part of analyzing options chains. It's not there's not going to be big blinking flashing lights telling you this is different. This is changed. This is anomalous. You have to build a familiarity with these. So to put that idea to the test, let's go down here really quick. And let's take a look at the open interest. The open interest for SPX right now across all cycles is 6.7 million and 12.5 million calls to puts respectively. Let's take a look at these different expiration cycles. Let's go to the 14 March. The 14 March has 60,000 calls 248,000 the 17 March has 10,000 calls 31,000 puts. The 21 March has 1.7 million calls against 2.6 million puts. What do you",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 45,
      "start_timestamp": "00:13:37",
      "start_timestamp_seconds": 817.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=817"
    }
  },
  {
    "text": "12.5 million calls to puts respectively. Let's take a look at these different expiration cycles. Let's go to the 14 March. The 14 March has 60,000 calls 248,000 the 17 March has 10,000 calls 31,000 puts. The 21 March has 1.7 million calls against 2.6 million puts. What do you notice? You notice that the standard expiration has insanely higher open interest than all of these individual little weekly options. This will almost always be the case. So you should be aware of that propensity. Okay. Now let's go back to what we were looking at. I literally already forgot the ticker. Was it hwb? No. hwn? No. Well, y'all help me out. What was I just looking at? What's in here? Is it hh something? hwm? Thank you. Thank you, Elizabeth, hwm. So if we go into hwm and we take a look at this same idea, all of the options in this are pretty light. There's 36,000 calls against 17,000 puts. And just to reiterate this point, what should I find if I get rid of all these different series, series, terms, expectations, all the same thing, by the way, all synonymous. I get rid of all these different terms and I'm going to flow between them just to help reinforce that point. And I click this series versus this series. The 14 March versus 21 March. What am I going to see? What are you going to see? What do you know? overwhelmingly, probabilistically, you're going to",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 45,
      "start_timestamp": "00:14:45",
      "start_timestamp_seconds": 885.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=885"
    }
  },
  {
    "text": "different terms and I'm going to flow between them just to help reinforce that point. And I click this series versus this series. The 14 March versus 21 March. What am I going to see? What are you going to see? What do you know? overwhelmingly, probabilistically, you're going to see. Now it could not be the case, but there's would be a reason why it would not be the case. And that would be something for us to look into. But what is overwhelmingly likely going to be the case? If I click into 14 March and then 21 March, what what am I going to see in terms of an open interest disparity between those? Which of those is going to have higher open interest? 14 March or 21 March. What's the guess? Love me a good guess. Bingo. Big Aces on it. Big A's with the big brain. We go into 14 March, 4,000 again, 625. Go into 21 March, 4,000 against 1,000. Not that big of a difference. Something interesting there. But still, this is essentially two times the size on the put side. So the total OI in here is 5,700. The total OI in here is 4,800. So still more, but not a ton more. One of the things you'll notice is with lower overall float options, meaning 36,000 total OI against 17,000 total OI on the put side, when it's this low, the discrepancy between different expiration cycles is less pronounced. And it's",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 45,
      "start_timestamp": "00:16:26",
      "start_timestamp_seconds": 986.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=986"
    }
  },
  {
    "text": "here is 4,800. So still more, but not a ton more. One of the things you'll notice is with lower overall float options, meaning 36,000 total OI against 17,000 total OI on the put side, when it's this low, the discrepancy between different expiration cycles is less pronounced. And it's because there's less of them in total. If you look at it as a total percentage difference, it's still quite high, right? The difference between 5,700, 747, 100. It's still fairly high. But it looks flatter because there's simply not as many options in there. What's another thing we can conclude by just looking at this open interest? If I were to take an educated guess about the liquidity of these options, what might I conclude by this? Do we think that it would be more liquid or less liquid than something that has higher open interest? So if I'm comparing HWM to something else that has higher open interest, what I expect the liquidity in here to be higher or lower. Ben says not good, you pay more. Good first part. The second part, a little shaky. It's not inherent that you pay more, but you do pay a wider bit ask spread overwhelming probability. Travel also has it, less liquid. So let's take a look at what this might look like. Let's go to the 21 March and let's take a look at the liquidity here. These are 1.60 wide for at the money put. That's actually like",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 45,
      "start_timestamp": "00:17:35",
      "start_timestamp_seconds": 1055.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1055"
    }
  },
  {
    "text": "wider bit ask spread overwhelming probability. Travel also has it, less liquid. So let's take a look at what this might look like. Let's go to the 21 March and let's take a look at the liquidity here. These are 1.60 wide for at the money put. That's actually like super illiquid. And then these are 1.40 wide for at the money call. So these are also very illiquid. Important point, we're going to circle back to it in a little bit. But again, what I'm trying to get you to think about is when you look at an options chain, all of these little data points should be popping into your brain. It shouldn't be just looking at numbers. You should be looking at numbers coming up with conclusions as you're looking at the numbers. Another thing that jumps out to me on the screen is the difference between calls traded today against puts traded today. What's going on here? What can I infer? I can infer that there is a shit ton of calls being traded compared to HWM. The majority of these might be traded at the bid, the ask, or in between the market. So big A says bullish, not inherently. We don't know inherently. Why don't we know inherently? I just gave you a little bit of a preamble. And as everything to do with these, the bid, the ask, or between the market, if we were to take a guess as to whether or",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 45,
      "start_timestamp": "00:19:14",
      "start_timestamp_seconds": 1154.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1154"
    }
  },
  {
    "text": "A says bullish, not inherently. We don't know inherently. Why don't we know inherently? I just gave you a little bit of a preamble. And as everything to do with these, the bid, the ask, or between the market, if we were to take a guess as to whether or not it's actually bullish or not. And then I'm going to grab my little drawing pad here. So big A's, why is your response there not accurate by itself? It happens to be the case here, by the way. But simply comparing calls to puts, that doesn't answer it for us. What do we think? Did they buy or sell would make a difference? It's exactly correct. Elizabeth is on it like white on rice. So if we take a look at the difference between these two calls inputs, we can see that there's 4,700 of these against 561 of these. At a first look, we would think, yeah, that's super bullish. That's way more calls traded. But we're mistakenly making an assumption. The assumption we're making is that we bought those calls, we being the broad market participants. We don't know that yet. So what we need to do is actually take a look if they transacted at the bid or at the offer. So if you'll recall, all options have a bid and an ask. The bid is somebody saying, this is the most I'll pay. And then the ask is the cheapest I'll sell. So let's pretend",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 45,
      "start_timestamp": "00:20:38",
      "start_timestamp_seconds": 1238.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1238"
    }
  },
  {
    "text": "is actually take a look if they transacted at the bid or at the offer. So if you'll recall, all options have a bid and an ask. The bid is somebody saying, this is the most I'll pay. And then the ask is the cheapest I'll sell. So let's pretend for a moment that there's no bid ask spread. Let's pretend that you can only transact at one of these two points. The bid or the ask. And let's say that I wanted to buy a call. Let's say I, Eric, and bullish. I want to buy to open a call. Who do I have to go to? Who do I go to in order to buy this one call? Do I go to the bid? The person that's offering the bid or the person that's offering the ask or offering the offer to make it confusing for you? Where do I go? Which one of these sides do I go to in order to buy this call? What's the guess? Big Ace is close to it with his question from the other part. You go to the ask exactly correct. So if I'm buying this call under the assumption that I'm bullish, I have to go to this person. If I want to sell to open one call, which would be bearish, I have to go to this person. Can't sell it to them. They're trying to sell. I have to sell to them. So this is how you",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 45,
      "start_timestamp": "00:21:46",
      "start_timestamp_seconds": 1306.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1306"
    }
  },
  {
    "text": "that I'm bullish, I have to go to this person. If I want to sell to open one call, which would be bearish, I have to go to this person. Can't sell it to them. They're trying to sell. I have to sell to them. So this is how you can use the at the bid or at the offer to make an inference super important point. In inference, we do not know. We do not know if these 113 calls at the bid, we do not know if all of them were bought. I guess I should say sold here. Sorry. We do not know if they were sold. Some of them might have been bought low probability, but they might have been. This can happen during what's called a sweep or subsequent orders. I'm putting in a big order. That's just a market order at a certain price. I can get filled at better levels than the bidder to the offer. There will be instances that, for example, you might be able to buy at the bid. It's not common. The majority of instances that won't be the case, but it absolutely can happen. It does happen. It's not like super rare, but the majority of instances that won't be the case. You have to be aware of that because a lot of people that I see talking about the bids and the offers in deconstructing the bias behind those trades falsely assume that this is a bullish",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 45,
      "start_timestamp": "00:23:27",
      "start_timestamp_seconds": 1407.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1407"
    }
  },
  {
    "text": "not like super rare, but the majority of instances that won't be the case. You have to be aware of that because a lot of people that I see talking about the bids and the offers in deconstructing the bias behind those trades falsely assume that this is a bullish rebarrows trade based on the transaction that happened there. But we are making an educated guess. We do not know if they were actually bought or sold. We're making an educated guess based on market mechanics. It's important nuance to be aware of with respect to this. A big A says, what about when you placed at the mid? What's it classified then? Great question. What do you notice this category is between the market and notice where the majority of the volume went today. The majority of the volume today went between the market. When something's between the market, we don't know. Now, again, we can make educated guesses. You can't make an educated guess in here because they don't have the capability. But if I show you a tool like this who fold disclosure, I am an affiliate for. They're not sponsor in this or anything. But again, I'm just always going to keep it a buck with you guys. If I take a look at, let's do flow feed. Let's take a look at HWM. Or not. We can also not. It's the computer is doing this fun thing that it started doing or just completely locks",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 45,
      "start_timestamp": "00:25:02",
      "start_timestamp_seconds": 1502.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1502"
    }
  },
  {
    "text": "I'm just always going to keep it a buck with you guys. If I take a look at, let's do flow feed. Let's take a look at HWM. Or not. We can also not. It's the computer is doing this fun thing that it started doing or just completely locks up during this. Okay. So if I take a look at HWM, and again, you can also do this in thinkorswim, by the way, I should clarify that. It's just more difficult. If I want to know for the between the market, if I wanted to try and make a guess, an educated guess as to if the option was bought or sold, the way that I can do this is very simple. If this 88 of instances, I'm kind of like, how can I classify if these were bought or sold? Well, if we're trading something that's illiquid like this, it actually becomes easier. Because rather than something like the SP 500, where the bid and ask might be this distance apart, HWM being less liquid, the bid ask spread is this distance apart. We already looked at two scenarios where for the calls, they were 1.40 wide, and then I think what was it? 1.80 wide for the puts. So what can we do? Simple. We can see where they transacted over here, or where they transacted over here, or over here, or over here. You can look at where it's closer to. So the cool part about",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 45,
      "start_timestamp": "00:26:26",
      "start_timestamp_seconds": 1586.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1586"
    }
  },
  {
    "text": "then I think what was it? 1.80 wide for the puts. So what can we do? Simple. We can see where they transacted over here, or where they transacted over here, or over here, or over here. You can look at where it's closer to. So the cool part about bar chart, or I'm sorry, bar chart, unusual whales, you can kind of see all that in one spot. You can also see it in thinkorswim though. What you can do is you can go to TNS, time and sales. And I can take a look at what the market was offered at during the time that the trade ran through. And we can find instances where the trade like this right here is a great example. The seven March, 141 calls here, they traded at a dollar. The market at the time was 95 cents by a dollar 10. What is this closer to? That's closer to 95 cents. More likely than not occurred towards the bid. So you can make an educated guess that those were probably sold. Don't know. Educated guess. So anyways, you could do the same thing with a tool like this that kind of lets you see it in one spot more broadly. And you can even look at it. One of the things I do like about it is that if you look at the overall flow for the day, you can see where most of it transacted at. So if we look",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 45,
      "start_timestamp": "00:27:46",
      "start_timestamp_seconds": 1666.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1666"
    }
  },
  {
    "text": "lets you see it in one spot more broadly. And you can even look at it. One of the things I do like about it is that if you look at the overall flow for the day, you can see where most of it transacted at. So if we look at it over the course of the day, we can get a sense of where the net premium came in. And then at closer to bids or offers where it came in. Okay, so this is literally just an overview of what I want to talk to you about. This is really what I want to talk to you about. When we're looking at an option chain, there are two broad buckets of data that I think makes sense to look at. There's a zero percent chance we'll be able to go through all of this in detail today. But I want you to be aware of some of these. Now, the purpose of this data is we can come up with ideas on what's happening again, cleaning information from the market. So I'm going to move this out of the way. And we're just going to keep strolling through the options chain like this together. And then I'm going to highlight more of these four you as we go along. So one of the things that we can look at is based on volume and open interest. We just started doing that analysis, by the way. We started looking",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 45,
      "start_timestamp": "00:29:02",
      "start_timestamp_seconds": 1742.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1742"
    }
  },
  {
    "text": "the options chain like this together. And then I'm going to highlight more of these four you as we go along. So one of the things that we can look at is based on volume and open interest. We just started doing that analysis, by the way. We started looking at the total volume of calls traded today versus puts and kind of coming up with some assumptions. First assumption is, is it mostly bullish flow? Is it mostly bearish flow? That typically means that there are people taking educated guesses based on information that they may not have. Another interesting question with respect to this is I wonder what explorations this volume happened in and is this same breakdown prevalent in the individual exploration. So we can take a look at the volume total volume and we can eyeball what explorations got the bulk of this volume. Well, I can tell you from the call side, the bulk of that volume came in at the 14 March 143's 1921 of these total contracts traded there. Interesting. So what could I do now? I could then say, I'm curious specifically about these 143's. Do I think these 143's were bought or sold? Simple. We can come in here and we can filter this. We can say, I only want to look at the call side in that specific series. So we're going to go to 14 March and then we're going to look at what was it? The 141's. I",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 45,
      "start_timestamp": "00:30:11",
      "start_timestamp_seconds": 1811.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1811"
    }
  },
  {
    "text": "or sold? Simple. We can come in here and we can filter this. We can say, I only want to look at the call side in that specific series. So we're going to go to 14 March and then we're going to look at what was it? The 141's. I only care in this scenario, about the 141's. So let's limit everything we're looking at to just the 141's. And then let's also get rid of where is it? Oh, interesting. It doesn't have the quantity filter on. Okay, so this isn't showing me the right data, which is kind of annoying. But we can find it over here as well. So we can go into the volume for today and we can take a look at these different calls, right? So we know the 141's were busy today. And we can figure out where the majority of those were traded at throughout the day. Now normally, think or swim would also support being able to do this yourself. I don't know why it's yielding not correct information. One of the issues when you're trading or when you're using data like this, not paid data is typically going to have some constraints. It's just kind of a function of what it is. I know a lot of people, traders are used to getting a ton for free. But the reality is the only reason why you get as much as you do for free is because the brokers want you",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 45,
      "start_timestamp": "00:31:26",
      "start_timestamp_seconds": 1886.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1886"
    }
  },
  {
    "text": "some constraints. It's just kind of a function of what it is. I know a lot of people, traders are used to getting a ton for free. But the reality is the only reason why you get as much as you do for free is because the brokers want you to trade. They're not necessarily incentivized for like quality of information. They just want to give you stuff so that you do trade. That's how they make their money. So that's the facade. That's one style of analysis that we can run based on what we think this difference between calls and puts are. Another very common analysis, there's actually a scam that I run for this is we can take a look at tickers. Let's build one together really quick. We don't want non-common. We don't want OTC. Let's take a look at options really fast. What I'm going to do is first filter by open interest. We want open interest to be greater than zero. Probably 500 at least so that we're not trading like super, super small stuff. And then what I want to do is actually look at changes in volume to OI. And it's frozen again. We want to look at volume compared to OI. So what this scan is going to show me is where in what tickers did we have explosions of volume over open interest on the day. The reason why volume over open interest is such a useful metric is because",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 45,
      "start_timestamp": "00:32:45",
      "start_timestamp_seconds": 1965.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=1965"
    }
  },
  {
    "text": "again. We want to look at volume compared to OI. So what this scan is going to show me is where in what tickers did we have explosions of volume over open interest on the day. The reason why volume over open interest is such a useful metric is because it shows us where positions are being aggressively built out. And I don't see any in here that are jumping out at me. And I don't see any here. So we'll run the scan and see what comes up. It's probably going to be a ton, not that many actually. So let's sort this by volume over OI. If I can get this to work for me, there we go. So we can see O or ORGO. I was literally just going to say this too. More often than not, when you see big spikes in volume over OI, it's from the medical world. Why is it from the medical world? And funny is shit. The top two are from the medical world. Why is that? Anybody know? That's so funny, honestly. I'm going to get a kick out of that. And while you guys are seeing if you can come up with why that might be the case, let's add a couple more things. While we're in here, we'll add 5 change. We will add one month. We will add six months. We will add one year. The reason why the percent changes matter to me is because typically",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 45,
      "start_timestamp": "00:34:05",
      "start_timestamp_seconds": 2045.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2045"
    }
  },
  {
    "text": "come up with why that might be the case, let's add a couple more things. While we're in here, we'll add 5 change. We will add one month. We will add six months. We will add one year. The reason why the percent changes matter to me is because typically speaking, there will be a reason why we see massive changes in volume over OI. So I didn't input anything into those. I just want to see what the results are. James says clinical trials. That's a little specific. But the reason why more often than not, that I will see volume over OI very high in the medical industry is because very frequently, the motherfuckers that trade options in these are insiders. And it's because they have much more lacks rules with respect to insider trading in the medical industry. If you couple that with the fact that a lot of medical companies, specifically biotech and stuff like that, their entire business is typically wrapped around an individual trial of a drug or solution that they're trying to get out onto the open market. So you have the ability for something to move massively based on the information that we're discussing. So that's why as you look through this, if we just take an eyeball count of how many of these are in the medical field, it looks like the majority to me, right? Medical, medical, medical, medical, medical, medical, medical, medical, medical, so on and so forth. A",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 45,
      "start_timestamp": "00:35:46",
      "start_timestamp_seconds": 2146.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2146"
    }
  },
  {
    "text": "we're discussing. So that's why as you look through this, if we just take an eyeball count of how many of these are in the medical field, it looks like the majority to me, right? Medical, medical, medical, medical, medical, medical, medical, medical, medical, so on and so forth. A ton of these are in medical. And this is very, very common for this kind of thing. So let's just take a look at ORGO. Something's happening there. Wonder what it is. ORGO. You don't say. So this had earnings where it was expected to come in at negative three cents and it came in at four cents, a massive earnings beat. There is a. So one of the things we can do now is we can say, well, that's for today. I wonder if there are some bastards that knew about this ahead of time and they were positioning ahead of time. You very often will actually see that. So what we can do if this will allow me is we can take a look at a few things. We can look at volume percent change. And then we can also look at put call volume ratio. I don't really care so much about the one month change. I don't want this to become too noisy for you guys. Then we can also look at total interest percent change. We'll do this over the five day. And then this one should have one one. Okay. So we will have",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 45,
      "start_timestamp": "00:37:34",
      "start_timestamp_seconds": 2254.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2254"
    }
  },
  {
    "text": "really care so much about the one month change. I don't want this to become too noisy for you guys. Then we can also look at total interest percent change. We'll do this over the five day. And then this one should have one one. Okay. So we will have call versus puts for current and then a five day average. And then we have five day percent open interest percent changes. We have five day volume percent changes. And then we have one month open interest percent changes. So what we can do now is we can observe what kind of changes have occurred over the past five day periods for both volume and OI just to get a sense of did somebody have a clue that this was going on? And what do we notice? It looks like yes. Because if we take a look at the five day volume change and the five day OI change even compared to the one month OI change. Huge huge discrepancy, which is kind of hilarious to be honest. And this is again super, super common. There's really I wish it wasn't as common as it was because this is a lot of people that are trading information that they have access to that technically it's not completely removed from your access either by the way. That's an important note. That's why it's allowed. In a lot of these places you'll see this kind of thing in medical devices especially because",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 45,
      "start_timestamp": "00:39:07",
      "start_timestamp_seconds": 2347.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2347"
    }
  },
  {
    "text": "lot of people that are trading information that they have access to that technically it's not completely removed from your access either by the way. That's an important note. That's why it's allowed. In a lot of these places you'll see this kind of thing in medical devices especially because of periods where they will have conferences and whatnot which is again kind of annoying but it is what it is. So what we can do for something like this again if this thing will work as it should we can get in alert. We can essentially say we want to sort this by the total volume over OI. We want to do it descending and we want it both at market open and market close because then this will give us an idea throughout the day as people are putting positions on midday is also fine depending on what period you might try to trade the idea. But this is literally exactly how you can use something like volume over OI to get a little bit of a heads up that something's happening before the thing actually happens. Now there are other versions of this that we can run. We can get rid of total volume over OI. We can get rid of that as our primary filter and we can say that we just want to look for stuff that's starting to have really big changes in volume just overall volume. So what we can do is like",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 45,
      "start_timestamp": "00:40:41",
      "start_timestamp_seconds": 2441.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2441"
    }
  },
  {
    "text": "We can get rid of total volume over OI. We can get rid of that as our primary filter and we can say that we just want to look for stuff that's starting to have really big changes in volume just overall volume. So what we can do is like these become less important and we can analyze the growth of five day versus one month average volumes. Specifically, often for bigger names you really require institutional sponsorship. Institutional sponsorship doesn't happen overnight. So the medical device world a lot of times institutions will stay out of there. And it's just because it's a complete crapshoot and you're typically betting against people that have information that you don't. More often than not, if I'm going to trade in the medical space like that, I'm purposely going to try to ride the flow that exists. So now let's go back. I don't want to get too far into the weeds on this specific example and I want to talk to you about a couple other things. A big one is analyzing open interest shelves. So let's take a look at a GameStop is a good example. So if we look at GameStop and the reason why GameStop is a good example is because this is something that absolutely has previously experienced Gamma squeezes. And if we take a look at this 21 March expiration and we just kind of like think about the landscape for a Gamma squeeze. This is exactly",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 45,
      "start_timestamp": "00:42:07",
      "start_timestamp_seconds": 2527.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2527"
    }
  },
  {
    "text": "GameStop and the reason why GameStop is a good example is because this is something that absolutely has previously experienced Gamma squeezes. And if we take a look at this 21 March expiration and we just kind of like think about the landscape for a Gamma squeeze. This is exactly why I got involved trading GameStop earlier this year and I've talked about this. How I traded this exact move like earlier last year. I got my years fucked up during this move here. And the reason why I became involved in this move just like I was involved during the first squeeze. It's not because and I'm very open about this. I trade everything. I know that there are like apes that they are so deep into GameStop and I don't have that depth of knowledge yet. But what I do know is from a general trading perspective when I see massive changes in open interest and volume like I did here, it draws my attention. Then when I see that movement sustained and if we look in the options chain, we can start to glean some information. That kind of information comes by way of understanding the hedging behavior of the counter party to your trade typically market makers. Now a bunch of notes. The first thing. The majority of people wrongfully believe, well, actually let's put it to the test. If I buy to open one call, we assume that a market maker has sold to open",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 45,
      "start_timestamp": "00:43:24",
      "start_timestamp_seconds": 2604.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2604"
    }
  },
  {
    "text": "behavior of the counter party to your trade typically market makers. Now a bunch of notes. The first thing. The majority of people wrongfully believe, well, actually let's put it to the test. If I buy to open one call, we assume that a market maker has sold to open one call. So this means we are long deltas. This means these guys are short deltas. And let's say that we're talking about a 30 delta option. We assume that this market maker hedges. How does this market maker hedge? What are your thoughts? Pepe says shares. Any other guesses? I don't know what Ben means. Pepe says baldness which I assume means not hedging. So is that the primary consensus right now that they would hedge with shares? Is that what I'm picking up? Looks like yes. Here's the reality. They don't have to hedge with shares. There's no imperative for them to hedge with shares. What if this one call gets added because they don't just market make for this one strike? They market make for all of this. So what if this one strike? This one call gets added to this broader basket of options that they've sold at different periods? What if this one call actually offsets some of the other risk that they've taken on throughout the day? Absolutely. Absolutely can be the case. They don't have to hedge with shares. It's a massive common misconception. Now there is an important period when they would",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 45,
      "start_timestamp": "00:44:42",
      "start_timestamp_seconds": 2682.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2682"
    }
  },
  {
    "text": "sold at different periods? What if this one call actually offsets some of the other risk that they've taken on throughout the day? Absolutely. Absolutely can be the case. They don't have to hedge with shares. It's a massive common misconception. Now there is an important period when they would hedge with shares. I was trying to delete this. If I have these options that are in the money, big A says in the money that is also only partially correct. It's still not full credit correct. Why is that not full credit correct? Guesses. What do we think? Why do I say partially correct? Not full credit correct. You do not get full credit. Reece says most in the money are still sold to close out not exercise. That's part of it. Think carefully. We covered this before. When is an option likely to be exercised? In the money near expiration. Be more specific. That's not wrong. But be more specific. I want you to identify the actual function. Bingo. Reece and travel are on it. When there's not a lot of extrinsic value left, that's when it becomes logical to exercise the option. So it's not just a function of buying or selling a call. That inherently doesn't mean hedging with the underlying. It also doesn't mean hedge with the underlying if I've in the money options that are 21 days out. Because these options still have a ton of extrinsic value. You can get a proxy by",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 45,
      "start_timestamp": "00:47:28",
      "start_timestamp_seconds": 2848.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2848"
    }
  },
  {
    "text": "function of buying or selling a call. That inherently doesn't mean hedging with the underlying. It also doesn't mean hedge with the underlying if I've in the money options that are 21 days out. Because these options still have a ton of extrinsic value. You can get a proxy by looking over here. They're still very unlikely to be exercised. And if they are, it's profitable for me. Just going to open market and buy them. Completely fine. So if we go back to this idea of analyzing open interest shelves, again, this context is super important. Because if we want to talk about something like a gamma squeeze, which is a very near term behavior, the places where a gamma squeeze become increasingly likely is if, say, for example, next week, let's say next week, GameStop starts to see a massive build out in all of these OIs. What ends up happening is as one of these fall in the money, the market makers now have to make a business decision, especially depending on the probability of being assigned, which they have very good models that help them assess that. And they say, do I need to buy shares? Okay, I need to go buy shares now. So buy to open shares. As they buy shares to hedge their short call, that pushes price up. So then we move into the next wrong. And they say, okay, now I have to buy shares here to hedge the calls. And",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 45,
      "start_timestamp": "00:49:59",
      "start_timestamp_seconds": 2999.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=2999"
    }
  },
  {
    "text": "Okay, I need to go buy shares now. So buy to open shares. As they buy shares to hedge their short call, that pushes price up. So then we move into the next wrong. And they say, okay, now I have to buy shares here to hedge the calls. And then I also have to buy more shares here to finish Delta hedging these calls because they don't want to buy a hundred shares for one call of the Delta's 53. Because now they're net long. They're not trying to be net long necessarily. They're trying to be flat. They're trying to capture the bit-ass spread. Now, if they think it's uninformed market flow, they might pile on top of it. A lot of them will try to do that. But from a hedging lens, they don't want to over hedge. They want to hedge the position precisely. So anyways, as this series happens, more buying, more hedging, pushing more options in the money that causes more buying, that causes more hedging, that causes more stock goes up. This action is what causes a gamma squeeze. So that's why understanding the volume shelves or the open interest shelves is super important. Because for example, if price got pushed up into here and they had all the sudden 7,300 options have to be hedged because they fall in the money. Okay, cool. But then the next couple shelves, they're pretty light. There's not a whole lot going on here. So then",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 45,
      "start_timestamp": "00:51:28",
      "start_timestamp_seconds": 3088.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3088"
    }
  },
  {
    "text": "important. Because for example, if price got pushed up into here and they had all the sudden 7,300 options have to be hedged because they fall in the money. Okay, cool. But then the next couple shelves, they're pretty light. There's not a whole lot going on here. So then the buying pressure will wane if this is the case. So this is how you can use open interest to help you understand something like a gamma squeeze. You can also use open interest to help us identify specific strikes that are of interest for different reasons. So one of the things that I coded for thinkorswim is the change day over day of open interest. And then I also have another tool that helps me calculate the volume ratio. Right. So in this case for the 25s and a halfs, I can see that day over day 95 were added. But then I can also see that 7.4 times of this strike were traded today compared to the open interest, 3,500 compared to 481 going back to what we learned earlier. If we know that every single option has to has to have a counterparty and quick recap volume is the number of options traded today. Open interest is the number of options that are active, meaning day over day. So if we see volume like this, 4,500 compared to sorry, this one, 3,500 compared to 481, we already know there's going to be new OI, new open interest",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 45,
      "start_timestamp": "00:52:41",
      "start_timestamp_seconds": 3161.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3161"
    }
  },
  {
    "text": "is the number of options traded today. Open interest is the number of options that are active, meaning day over day. So if we see volume like this, 4,500 compared to sorry, this one, 3,500 compared to 481, we already know there's going to be new OI, new open interest because there's more volume than the existing open interest. So it can't be closing. There would be nothing there. So there's going to be a massive amount of open interest being added to the strike. So we can use that as an understanding of where options are being built out. Then we can take a look at which strikes have the most volume, which expiration cycles have the most volume, so on and so forth. So you can glean an insane amount of information from options. Now the last thing, I mean, there's way more than that from a volume in OI lens, but the last thing I want to talk about quickly over the next five minutes or so and then leave some time for Q and A is volatility. Volatility is super important. So we can visualize term structure, the volatility across expiration cycles, and you see me do this all the time. It helps me understand what the perception is for different periods of time. If we see volume spike up like this here, 77 vol up to 96, up to 94, up to 96, and then it starts to come back down to 94, 91, 82,",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 45,
      "start_timestamp": "00:54:07",
      "start_timestamp_seconds": 3247.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3247"
    }
  },
  {
    "text": "do this all the time. It helps me understand what the perception is for different periods of time. If we see volume spike up like this here, 77 vol up to 96, up to 94, up to 96, and then it starts to come back down to 94, 91, 82, 69 means that the market is pricing in movement around this time frame. Very frequently, that's due to a corporate event that we kind of know is going to happen during that time frame. And in this case, that corporate event is going to be earnings of some sort. So you can use the term structure to make inferences about movements and also movements severity. The cool part about volatility is that it literally tells us based on the best market consensus that exists right now today, what is the expected range for something over a time frame? So for GameStop, the expected range for GameStop over the next 21 days is plus or minus 3.71. That's a one standard deviation 68 probability of falling within that range. You can calculate this for different standard deviations. I'll literally do it right now and one of my calculators for you just to give you an idea of what the number would be. So we're here. So stock price is 25 or 4. The events, expert evolve. So in this case, we're looking at the 21 March, which is 96.35. We're three five. The ticker volatility is 86.95. And the days expiration",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 45,
      "start_timestamp": "00:55:25",
      "start_timestamp_seconds": 3325.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3325"
    }
  },
  {
    "text": "to give you an idea of what the number would be. So we're here. So stock price is 25 or 4. The events, expert evolve. So in this case, we're looking at the 21 March, which is 96.35. We're three five. The ticker volatility is 86.95. And the days expiration on that cycle are 21. So for a two standard deviation move over that time frame, you're essentially looking at plus or minus, in this case, it's 3.71. You're looking at plus or minus 4 in change. So you can calculate the actual expected range. Now using the, this is using not the term vault. This is using the underlying vault, the 86. We can also calculate this using the actual term vault for that specific time frame. But using the volatility of 86.95, the one day range is 1.37.274.11 for one, two, and three standard deviations. For the monthly range, if we're going to look at that over the course of a month, it's 6.29, 12.57, 1886, for a one, two, three standard deviation move, so on and so forth. So the point that I'm trying to help you with here is that we can use volatility to calculate moves. That's one of the greatest things about it. The other thing we can do is look at a volatility surface. And the volatility surface is really, really useful. So if I just use the standard expiration volatility surfaces, I can come up with all sorts of inferences based on",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 45,
      "start_timestamp": "00:56:35",
      "start_timestamp_seconds": 3395.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3395"
    }
  },
  {
    "text": "moves. That's one of the greatest things about it. The other thing we can do is look at a volatility surface. And the volatility surface is really, really useful. So if I just use the standard expiration volatility surfaces, I can come up with all sorts of inferences based on expected move and relative values based on the way that these look. If they're jagged like this, I can tell you that there's a lot of mispricings or discrepancies between implied volatility pricing or wide bit of spreads. I can also tell you that if we see the call tail as high as this even higher than the put tail, that tells us that the market is pricing in a higher probability move to the downside, but higher severity move to the upside. So you can extract a insane amount of information by just looking at options chains in this way. And as promised, that puts us right at 55. And I want to make sure that we have a little bit of time for Q and A. The main thing I want you all to be aware of is twofold. The first one is how to generally navigate in options chain. And then the second is just to give you at least a taste of some of the different ways we can use an options chain to glean information about the underlying. So that wraps me up for the kind of formal part of the series or this episode",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 45,
      "start_timestamp": "00:58:16",
      "start_timestamp_seconds": 3496.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3496"
    }
  },
  {
    "text": "options chain. And then the second is just to give you at least a taste of some of the different ways we can use an options chain to glean information about the underlying. So that wraps me up for the kind of formal part of the series or this episode I should say. I would love to hit any questions, concepts, things that you're interested in understanding better. And in the meantime, I'm actually going to update one of my calculators because I want to also be able to calculate these ranges using a specific event. So feel free to throw in any questions that you have now and then happy to take a look. Hopefully you learned something new. At least that's the main goal. Von Hale says I've read they can pair a buyer and sell her so they don't have to hedge. I mean, that's the entire goal for a market maker. The market maker carries inventory for as little time as possible. And the reason is because they were trying to capture the bid-ass spread. So the way that they can capture the bid-ass spread is by exactly that, by trying to identify buyers and sellers and to pair them. Now realistically more often than not, they can't do it real time. They have to take on inventory for at least a little bit. But they absolutely do try to minimize the time frame that they're taking on inventory because that increases their total risk. They",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 45,
      "start_timestamp": "00:59:26",
      "start_timestamp_seconds": 3566.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3566"
    }
  },
  {
    "text": "and to pair them. Now realistically more often than not, they can't do it real time. They have to take on inventory for at least a little bit. But they absolutely do try to minimize the time frame that they're taking on inventory because that increases their total risk. They don't want to take on inventory. Rhys says I swear I was listening. But how can you discern if they were bought or sold if the majority were between the bid and ask? Okay, so then Rhys, if you were listening and I believe you were, what do you recall me saying about the process of discerning that? I gave you an ex a specific example, actually, if you'll recall. And it had to do with the split between bid and ask. That base says what platform can I use if I live in Mexico? I honestly have no fucking idea. I don't live in Mexico. I do know I be interactive brokers is used most places globally. So I do think that they have a pretty global footprint. But I generally don't know beyond that. I would have to do the same Google search that you would do to get to the answer. If you do the Google search really quick and you list out some of the brokers, I'm happy to let you know if like I think they're good or not, I can do that. But Rhys says checking actual transactions sort of. But there's an important",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 45,
      "start_timestamp": "01:00:53",
      "start_timestamp_seconds": 3653.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3653"
    }
  },
  {
    "text": "get to the answer. If you do the Google search really quick and you list out some of the brokers, I'm happy to let you know if like I think they're good or not, I can do that. But Rhys says checking actual transactions sort of. But there's an important differentiation that we can make and I gotta go grab the dog real quick. All right. That's straight hater activity. Look at this. It literally cuts his head off because he's too dark. Okay. So now the dude is ready to answer your questions. Let me get this out of his way. And the question was how can we figure out if an option falls between the bid S spread? How can we tell if it was a bottle sold? What do you think? So he's licking my hand, which is clearly him trying to explain to you about analyzing the width between the bid S spread and then where the transaction occurs. That is the start to the answer. Travel says one is through. We're going to start picking stocks. He's not going to do stocks. He's going to do sector ETFs. But I'm hopeful to do it soon. I think it'll be super, super fun. And essentially run it like week over week. Or maybe month over month or something like that could be fun. Lauren says Thor looks like he's wearing white eyeliner. Yo, the disrespect, the disrespect to Thor. He's actually going back in to get",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 45,
      "start_timestamp": "01:01:56",
      "start_timestamp_seconds": 3716.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3716"
    }
  },
  {
    "text": "I think it'll be super, super fun. And essentially run it like week over week. Or maybe month over month or something like that could be fun. Lauren says Thor looks like he's wearing white eyeliner. Yo, the disrespect, the disrespect to Thor. He's actually going back in to get another haircut tomorrow. So he's going to be looking fly as a motherfucker. So Reese, let's take a look at an example here. We're in GameStop. 26 of the calls traded today and 47 of the puts traded today were between the market. How can we tell? Let's look at the puts. How can we tell if these puts were bought or sold? One of the main ways is by analyzing where the transaction occurred against the bid S spread. So if we go into TNS and if we choose to just look at puts, let's just eyeball some of them. So like this one, this one we can see and right now the way it codifies them, right, is red sold green is bought. That's if it's at the bidder ask. So these gray ones are the ones that occur between the bid S spread. So if we take a look, this is another great example. This one here. If we take a look at the 155 traded at one dollar when the market is bid at 95 cents offered at 115. It's much closer to the bid. So it's much more likely to have been sold versus bought.",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 45,
      "start_timestamp": "01:03:38",
      "start_timestamp_seconds": 3818.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3818"
    }
  },
  {
    "text": "a look, this is another great example. This one here. If we take a look at the 155 traded at one dollar when the market is bid at 95 cents offered at 115. It's much closer to the bid. So it's much more likely to have been sold versus bought. Much closer to the bid. So this is exactly how you can go through and kind of complete that process of trying to analyze if it occurred closer one or the other. Now the one thing I want to be super clear on, like this isn't necessarily the the pinnacle use of your time. This is okay if you're getting into nuanced analysis and trying to come up with smaller trends and stuff like that. It's okay to do this. I do this all the time. But for the vast majority of new traders, this is not the right place to spend your time. The right place to spend your time is by analyzing profit mechanisms and finding things that make money genuinely. This is kind of interesting side information that you can use to slightly temper the way you might be building a trade or thinking about a trade. But this is not there's not like super secret squirrel information in here that's going to be the difference between you making money or not. You got to get the profit mechanisms down for that without a doubt. This is good amplifying information. So yeah, that's how you do it.",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 45,
      "start_timestamp": "01:05:08",
      "start_timestamp_seconds": 3908.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3908"
    }
  },
  {
    "text": "But this is not there's not like super secret squirrel information in here that's going to be the difference between you making money or not. You got to get the profit mechanisms down for that without a doubt. This is good amplifying information. So yeah, that's how you do it. Any other questions Ben says, can you see US European option classification and an option chain? No, I don't think so. You just kind of know it. So it's the indices. The indices are going to be European style options. Most other things are going to be American style options. But I don't think you can see it in the options chain. I've not actually looked for it in there. I don't think so. Let me ask, let me just try to be tea. I literally don't know. Does think or swim go you Euro and the first American options? Oh no, shit. So you can filter by it. Yeah, you can filter by it, but I don't see somewhere where it like explicitly tells you that. It's interesting. But yeah, not something. The majority of instances you'll find that they're going to be American style unless they're indices. Cool. All right, Ken, looks like that wraps us up as always. If you need anything, let me know. Be an outlier. Let's go later.",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 45,
      "start_timestamp": "01:06:22",
      "start_timestamp_seconds": 3982.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=3982"
    }
  },
  {
    "text": "All right, Ken, looks like that wraps us up as always. If you need anything, let me know. Be an outlier. Let's go later.",
    "metadata": {
      "video_id": "uif4pXs2wEI",
      "title": "Navigating an Options Chain | Outlier Options Trading Basics Ep8",
      "url": "https://www.youtube.com/watch?v=uif4pXs2wEI",
      "upload_date": "",
      "duration": 4087.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 45,
      "start_timestamp": "01:07:48",
      "start_timestamp_seconds": 4068.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uif4pXs2wEI&t=4068"
    }
  }
]