[
  {
    "text": "What's up, apes today, we're going to take a look at GameStop. So two things on the agenda, we have an expiration week coming up. So we're obviously going to look through all of that. And I want to start with a quick recap of the lessons learned from the live stream on Saturday. This is just where we've been diving into the story and the history of GameStop. And typically after I have a chance to digest mentally, like what I was looking at, what we were talking about, it's kind of fun to talk about from a high level what we discuss, what we learned. So the video on Saturday, we spent some time actually exploring through the recent conversation, slash idea that Cohen met with sailor and then the potential that that could mean for GameStop and involvement with cryptocurrency. But there really was nothing we could find that either proved or disproved the idea. So then after that, we just went through the stock. We didn't really see a whole lot coming out that looked super interesting as of last week, other than some of the price behavior based on that Bitcoin news. And then we rolled into the good old DD library. So the main thing I learned from the DD library last week is that it spent a little bit of time talking about actually, I have funny, this is the exact thing I was going to mention. It talked about the, it talked",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "rolled into the good old DD library. So the main thing I learned from the DD library last week is that it spent a little bit of time talking about actually, I have funny, this is the exact thing I was going to mention. It talked about the, it talked about the broader landscape where a lot of seemingly disparate companies have shared interests or are even directly owned by some of the other companies, specifically things like BlackRock, and how that can create an interesting lens when you're looking at something like institutional ownership. And if you're looking at a stocks institutional ownership and then you look at the list of different institutions, a lot of those institutions either have ties or bubble up into the same broader institution. So then it kind of becomes the same institution potentially owning and exerting force over that company. I think it's a little more nuanced. There's obviously more detail to it than that. But that was one of the interesting pieces that we came across. All right, let's get into what it looks like this week. In general, this move here doesn't surprise me. This largely came about when we did get the news, well news, when news coverage started to pick up this idea that GameStop might be getting involved in Bitcoin. One of the things to remember is that there are a lot of investors and less involved entities in the markets that they don't really necessarily directly involve",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "get the news, well news, when news coverage started to pick up this idea that GameStop might be getting involved in Bitcoin. One of the things to remember is that there are a lot of investors and less involved entities in the markets that they don't really necessarily directly involve themselves until there's some sort of news article written about it. So that's why you see this news driven event because a lot of people are like, well, wait a minute, we already saw this picture that picture is not new. This is something that's kind of been talked about for a little while now. So why now? Why today and today being the 14th? And that's simply because the news cycle started to pick it up and talk about it on the 13th into the 14th. That move itself did seem overdone and excessive to the upside based on everything else. And I genuinely did think it was probably going to come back down into this range. This is primarily because this broader move is likely from larger institutional positions unwinding for one reason or another. And in order for this to go through this kind of a magnitude of a significant rise and maintain that pace would either be from institutional level accumulation or some sort of catalyst. And obviously we had a catalyst from the Bitcoin picture coming out first with sailor. But then also after that, again, the news cycle starting to pick up on the",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "of a significant rise and maintain that pace would either be from institutional level accumulation or some sort of catalyst. And obviously we had a catalyst from the Bitcoin picture coming out first with sailor. But then also after that, again, the news cycle starting to pick up on the event and the potential. And then today kind of, you know, gap down a little bit had an inside day. We'll gap down below this area, not on the prior day. And right now we're hovering right around 2697. Nothing huge jumping out of me here. Volatility is still very low. 74 volume. You can see that places is literally at a 3 implied volatility percentile. That means the overwhelming majority of days for the past year, vol was higher than what it is right now. So vol is siphoning out. Volume is also drifting down, even though we're seeing these clear peaks were volume clearly as spiking. In general, if you take a look at the averages, they're trailing down very slowly. So volume is starting to come out of the stock. From a volatility perspective, we can see, vol is essentially been on a steady decline for a while now. This darker yellow line represents 30 day vol. This brighter yellow line represents seven day vol. So week and seven day vol has been coming down for literally two months. We've been seeing this happening. This has actually been a trade I've been running for some time now.",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "while now. This darker yellow line represents 30 day vol. This brighter yellow line represents seven day vol. So week and seven day vol has been coming down for literally two months. We've been seeing this happening. This has actually been a trade I've been running for some time now. That's just because this has been very, very prevalent. And now 30 day vol is actually contracted massively. It's gone from 128 that you see here. And now again, this is showing it at 86 ish. So the the vol that we're seeing is really, really contracting like very significantly. So let's take a look at the options chain. I actually had somebody in the discord last week asking about the options transactions that we were seeing specifically in the 21-feb expiration. And I think to their dismay, unfortunately, was saying that like I really wasn't seeing anything. And I know that key was a little bit excited because there definitely is some life in the options chain, but it's just not that much. That's kind of the reality as it sits here. So what I mean by that is when I look at the at the monies here, you can see that the 27's have 5200 open interest. And then there was 5800 traded today. So definitely going to build out this front expiration a little bit. So there's still always people playing the near term price movements. But in terms of overall value, this option chain is not",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "can see that the 27's have 5200 open interest. And then there was 5800 traded today. So definitely going to build out this front expiration a little bit. So there's still always people playing the near term price movements. But in terms of overall value, this option chain is not that deep. There's just not that much in it. So if we take a look at the total open interest for that option chain by itself, the upcoming expiration, there's 166,000 calls and 40,000 puts. So it definitely does and continues to maintain calls skew in favor of the upside. That's not changed. However, 166,000 calls and something like this really isn't that significant either, based on what we typically see in here. If I zoom this out, this is all the way down to sub 600,000. Normally, this will be anywhere from 7800,000. The high fives is a little bit low. Now the good part here though is there's still massive callsque compared to putsque, which that's great because we are actually at one of the largest call to put OIscues that we've seen in a while. So even though total OIs later, it's very heavy on the call side. And a lot of people play this from a pot odds perspective because you never know what's going to send game stop just flying, right? And it could be the cat throws a tweet out. It could be a million different things. That's kind of how the stock moves.",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "side. And a lot of people play this from a pot odds perspective because you never know what's going to send game stop just flying, right? And it could be the cat throws a tweet out. It could be a million different things. That's kind of how the stock moves. That's one of the things that makes it so interesting. But so it's cheaper to hold this now on a relative value. These are very expensive. The volatility on the call side, which I'll show you right now, tends to be very, very expensive, which you can still see that here, right? If we look in these front explorations, notice how high this call I've shoots out. That's the purple line and the blue line for your reference. Purple lines 21 Feb, the 28 Feb is the blue line. And you can see how high these IVs shoot out for these out of the money calls. What that tells you is the market is essentially pricing in severity in that direction. This is the market saying at this point, it can either crash or it can fly to the upside. And because the levels are very similar, you don't really know which one. And to give you a context of what this normally looks like, if we go over to Apple, here's typically what you will see. I'm going to limit this to just these front two series to give you the same example. This is typically what you see.",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "know which one. And to give you a context of what this normally looks like, if we go over to Apple, here's typically what you will see. I'm going to limit this to just these front two series to give you the same example. This is typically what you see. Typically what you'll see is the front expiration will be slightly higher than the follow-on explorations and in companies that just tend to grow and expand over time like Apple tends to do. You often will see the call side much lower than the put side. So what this is is the market pricing in severity to the downside, bigger potential move, but a higher probability move to the upside. Now if we compare this to what we were just looking at in GameStop, it's a bit of a different story. So market is essentially pricing in severity to both directions. There's no way it's going to go. It's scared and it's pricing in heavy vals to the upside because we all know GameStop can crack off to the upside. Big giant moves very quickly. And again, based for a litany of different reasons. And it could absolutely create her to the downside for the same thing. So this is a really interesting play and it's also why I still really like the coverage strangle in something like GameStop because of this kind of volatility profile. It really is very, very beneficial for that style of trading. Now the last",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "to the downside for the same thing. So this is a really interesting play and it's also why I still really like the coverage strangle in something like GameStop because of this kind of volatility profile. It really is very, very beneficial for that style of trading. Now the last thing I want to talk about though are the main exploration cycles. So if we go out now to 21 March, you can see that there's only 51,000 calls, 16,000 puts. So again, most of this volume is in these front two exploration cycles. Now right now on the platform, it's showing earnings on the 25th after the close. We will see if that holds. If we take a look at the wall, it looks like the market might be buying it because this jumps up to 89.7 from 75. But then it also remains pretty elevated for these two. So I think the market is probably saying it thinks it's going to land somewhere in this range. That would be the expectation for the earnings release. And just like the last one, I have to be honest, I'm very eager to see what the earnings release has in store for us because the company is still sitting on enough cash. It can do good things with that cash to reinvent the company. I just really, really want to see how it positions out. Now the last thing I do want to show you is this. So I noticed that",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "for us because the company is still sitting on enough cash. It can do good things with that cash to reinvent the company. I just really, really want to see how it positions out. Now the last thing I do want to show you is this. So I noticed that even though the volume, so if you go up here really quick, you'll see that there's 130,000 calls against 23,000 puts. But if you take a look at the volume of options today, but then you take a look at the total premium between calls and puts. So put premium 1.9 mill call premium 15.6 mill total 17.5. There are still a lot of deep calls in terms of the skew overall value traded in the calls. But a lot of these are short calls. And there are people selling calls in these very regularly. If you're holding this stock, it can make a lot of sense to do that because of how elevated the volatility is. You're getting paid to hold something that you're holding anyways. So this is interesting just because the total call value I tracked is pretty closely. And a lot of times it'll maintain about this kind of spread between calls and puts. But a lot of times we'll see a little heavier bullish skew on the premium as compared to the bearer skew. And this is just guessing, by the way. When it says bullish versus bearish, it's guessing based on where the call",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  },
  {
    "text": "this kind of spread between calls and puts. But a lot of times we'll see a little heavier bullish skew on the premium as compared to the bearer skew. And this is just guessing, by the way. When it says bullish versus bearish, it's guessing based on where the call or put transacted at. So if I sell a call, they view that as bearish. It's not necessarily bearish because if I sell a call against long shares, I still want the stock to go up. That's where my max profit is. So just when you see this, always keep that context in mind. It's not exactly as simple as that. But the company itself still hanging in there. I think we need to see how does it behave in this general now widening consolidation zone? Because this is a pretty big consolidation area from 28 and a half, essentially, down to 25 and a half. That's a little too big for a consolidation zone, actually. I think that this will probably narrow out somewhere in here. I just don't know where. So as always, anything I should take a look at, let me know. I'll see you later.",
    "metadata": {
      "video_id": "UJFQ2WJVM88",
      "title": "GameStop (GME) Analysis: Key Earnings & Options Expiration Insights",
      "url": "https://www.youtube.com/watch?v=UJFQ2WJVM88",
      "upload_date": "",
      "duration": 762.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UJFQ2WJVM88&t=0"
    }
  }
]