[
  {
    "text": "All right, man, we are on. What's up, Chris? Not much. How's it going? Absolutely. Great. I don't know if I told you my, uh, my brother's name is Chris. Is it except I call him Sasquatch. Um, he's a little bit. Yeah, he's a big old dude. I mean, I'm not small. I'm like six foot to 20-ish and he just dwarfs me. He's like six, three, you know, two, six, two, oh, most he's just big old boy. So I call him Sasquatch. He's not very hairy though. It's like a heralous Sasquatch. Amen. Anything you do to get a more unique name, I think I'm all more one of the name Chris Butler and my first and last name are literally both in the top, like 100 most common first names and last name. Oh, really? I can't, I can't get a unique username anywhere. There's no username where I could get Chris. Oh, yeah. I have to, you know, either you can first or do something that's a little bit more unique and not use my, my first and last name so. Yeah, you got to be like Chris Butler 99 or. Yeah, exactly. I usually, like my Instagram was Chris Butler 22. My email, I have an email that just basically has my birthday after. Uh-huh. I don't get it. I don't get Chris Butler at Gmail is. I love that. So also funny caveat on that in the Marine Corps, I was the only",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 94,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=0"
    }
  },
  {
    "text": "like my Instagram was Chris Butler 22. My email, I have an email that just basically has my birthday after. Uh-huh. I don't get it. I don't get Chris Butler at Gmail is. I love that. So also funny caveat on that in the Marine Corps, I was the only Eric R.I.K. Smolinsky, except I don't know why, but instead of just giving me Eric dot Smolinsky at usmc.mil, keep it just my name, they made it Eric dot M, which is my middle initial dot Smolinsky at you. Why, why would I make this so long, man? I already got a long, long last name. Now we got to have the middle, yeah, why? Cool, man. So obviously, super stuck to have you on the channel, like we were just talking about, I gave you some context on why I'm doing this, you know, just the general background and whatnot. And, you know, anybody who's willing to come on and just, you know, share some time with us is honestly super awesome. I get a tremendous amount of super positive feedback from the folks that frequent my channel, you know, just saying that they're having fun learning and seeing other stuff. So obviously, thank you for that. Um, I thought obviously good places start off would be learning a little bit about you, you know, we didn't dig too far into your background. I know you from Chicago with Denver. Um, but I would love to, you know, dig",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 94,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.64255319148936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=99"
    }
  },
  {
    "text": "other stuff. So obviously, thank you for that. Um, I thought obviously good places start off would be learning a little bit about you, you know, we didn't dig too far into your background. I know you from Chicago with Denver. Um, but I would love to, you know, dig in your background a little bit. What got you into investing? When did you start? It's a good place to start. Um, so it's a good question because my freshman year, when I went to college, my initial major was computer science. Okay. And that's because when I was in high school, I played a lot of video games and I, for any computer. So I thought that I wanted to do something with computers. And I also have a very technical mind, which it's no surprise that translates into options or suit and a lot of moving parts. Um, but my initial major was computer science. And I went to Arizona State. Okay. And then about a party school, it is a party school. Okay. I did my fair share of party, but I did not leave ASU because I couldn't handle the party. I did have friends, however, that they dropped out of ASU because of the farging. It is couldn't handle it. Um, but after my first year at ASU, I kind of, I decided to transfer to Nepal, which is in Chicago. And when I, prior to doing that move, I decided that I wanted to",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 94,
      "start_timestamp": "00:03:19",
      "start_timestamp_seconds": 199.2851063829787,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=199"
    }
  },
  {
    "text": "that they dropped out of ASU because of the farging. It is couldn't handle it. Um, but after my first year at ASU, I kind of, I decided to transfer to Nepal, which is in Chicago. And when I, prior to doing that move, I decided that I wanted to change my major to finance. And I can't explain exactly the moment that's happened, but it was literally just like a weird moment of my life where I woke up one day and my whole mindset was shifted towards finance. And I was just like, I need to know how money works. I need to figure out how investing works. Yeah. Because it doesn't matter what kind of money I make in my life. Like if I don't know what to do with it or the things that I can do with it to grow it and preserve it, then I'm going to be screwed. Yeah. So I literally had like an overnight moment where I saw it from computer science to finance, transfer to the Paul and the rest of his history. So when I was at the Paul, I got an internship at Tasty Trade, which is a, I don't know where to talk about options trading and stuff like that. Got it. But I was just in email correspondence with the founder, Tom Sawzna. And I mean, I think her swim, right? Yeah. He's co founder, I think co founder of Tinker Swim. Got any other co",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 94,
      "start_timestamp": "00:04:58",
      "start_timestamp_seconds": 298.92765957446807,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=298"
    }
  },
  {
    "text": "I don't know where to talk about options trading and stuff like that. Got it. But I was just in email correspondence with the founder, Tom Sawzna. And I mean, I think her swim, right? Yeah. He's co founder, I think co founder of Tinker Swim. Got any other co founder that started to think her swim with them is at Tastyworks now. Got it. So the CEO of Tastyworks got shared and he and Tom were the, I think co founders of Tinker Swim. They definitely both worked there. I'm just not sure if there was another founder. But, but yeah, so I just was in email with him. I sent him a couple emails. One was about just an options trading question. And then I sent him another email that was asking about internships within the finance slash trading industry. I wasn't even necessarily asking for an internship at Tasty Trade. But he just kind of skimmed that email, I think. And then he sent me back another email saying that they had some interns there that would be in a couple months. And so he connected me with this other woman that worked at Tasty Trade. I sent her my resume came in for an interview, which was literally just kind of like a meet degree to see. Right. Just personalities. Yeah, exactly. Yeah. Like the hardest question he asked me, he said, how are your math skills? And I was like, I don't know, I think",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 94,
      "start_timestamp": "00:06:38",
      "start_timestamp_seconds": 398.5702127659574,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=398"
    }
  },
  {
    "text": "sent her my resume came in for an interview, which was literally just kind of like a meet degree to see. Right. Just personalities. Yeah, exactly. Yeah. Like the hardest question he asked me, he said, how are your math skills? And I was like, I don't know, I think they're pretty good. Like that was the most, that was the most technical question. I think the interview process is a little harder these days, but I definitely got super lucky with that. But it was just kind of a cold email led into an internship. And I worked at Tasty Trade for three years from 2013 to 2016. And then after my stint there, I left to start project option, which the initial goal was to start a website, have a lot of written content, grow the website traffic, and then sell subscription services or courses on that. But then it kind of morphed into a YouTube channel because I knew that it would be easier to get exposure on YouTube as compared to Google search. Because when you think about the two, there's like, there's, when I started, there was already probably hundreds of websites that had lots of our options trading articles, and they're, it was really hard to compete with them. But when you looked at the YouTube space, there were only really a couple of channels that had lots of viewers. So I thought that it would be a much easier time getting exposure on",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 94,
      "start_timestamp": "00:08:18",
      "start_timestamp_seconds": 498.2127659574468,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=498"
    }
  },
  {
    "text": "of our options trading articles, and they're, it was really hard to compete with them. But when you looked at the YouTube space, there were only really a couple of channels that had lots of viewers. So I thought that it would be a much easier time getting exposure on YouTube as compared to just the written content. Since there are less people making videos as compared to the blog post type content. So and that kind of led to where I am today. So today I'm just focused essentially 100 on YouTube. Okay. It's funny because when I started the YouTube channel, I saw it as a tour. Like I wanted to focus on the website and the written content. Interesting. But I knew that the YouTube channel would be a much easier way to get exposure, at least at your e. And so I created written or video counterparts to all the blog posts that I was writing. Okay. And my like my OG day one YouTube video is we're all just horrible like voice over presentation. Like I would have, I would just be doing sitting here at this microphone. Yeah. And I would make a PowerPoint presentation. I would export the slides as images. And then there would be times where I would be talking over like the same slide for two minutes. And it would be like all this text like sitting static. And then me talking for two minutes. Like which looking back at",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 94,
      "start_timestamp": "00:09:57",
      "start_timestamp_seconds": 597.8553191489361,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=597"
    }
  },
  {
    "text": "presentation. I would export the slides as images. And then there would be times where I would be talking over like the same slide for two minutes. And it would be like all this text like sitting static. And then me talking for two minutes. Like which looking back at that, I can't believe I even drew on YouTube with that format because on YouTube engagement is everything. And so these days when I make videos like I'm always trying to have something moving just to keep the viewer engaged visually. You must have really good content though. I mean at the end of the day, if that was making you grow even with the you know the clear overhead front on the projector thing that goes. Yeah. Yeah. You know. I think I think yeah, I think the original growth or the growth that I experience over the first couple of years, even with the less engaging video format. I think it was just the bottom of the back end. Not necessarily production quality. Yeah. But I identify honestly a lot with that because I put zero effort into my production quality. And I think everybody knows that. I mean I tell it to people like this is a lot of work. What's that? It's a lot of work. Yeah. And for me, like I was telling you, I do not identify as a creative person. So for me to like I like to use the whiteboard. I just",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 94,
      "start_timestamp": "00:11:37",
      "start_timestamp_seconds": 697.4978723404255,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=697"
    }
  },
  {
    "text": "mean I tell it to people like this is a lot of work. What's that? It's a lot of work. Yeah. And for me, like I was telling you, I do not identify as a creative person. So for me to like I like to use the whiteboard. I just jot out my thoughts and whatnot, talk through them and share screenshots. And for me, that's not work. For me, that's just how I mentally process things. But if I were to do with some of the other channels, do which is really Gucci, like it looks cool. But to me, that's work. I'm not graphically inclined. So that's what I also attribute. The, you know, very humble growth that my channel has had is essentially just because the content comes from a good, a good place. And I know that because I'm not selling anything. I couldn't fucking care if you like it or not. It's just there for general consumption. But that's really interesting. I'd love to hear a little bit more about the switch from the focus on your website to YouTube. When did you make that jump? I think, let's see. So I think 2019 was the first year. This was a literal, recent resolution. I had a business New Year's resolution. That's awesome. Coming into 2019, I said, for the entirety of 2019, I'm doing nothing on the website. I'm focusing all of my energy on making my video is better. So higher production quality.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 94,
      "start_timestamp": "00:13:17",
      "start_timestamp_seconds": 797.1404255319148,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=797"
    }
  },
  {
    "text": "the first year. This was a literal, recent resolution. I had a business New Year's resolution. That's awesome. Coming into 2019, I said, for the entirety of 2019, I'm doing nothing on the website. I'm focusing all of my energy on making my video is better. So higher production quality. Also, I kind of like the post production of doing animations and graphics and stuff like that, which the first couple iterations of that were absolutely terrible. But for 2019, that was the first year. And it was a literal business New Year's resolution to spend all of my energy and focus on YouTube because I'm a one man show. And so for me, especially like I can be, I'm so prone to procrastination and being easy and focused like, there's no way I could have a podcast, a YouTube channel, right blog posts and do all that at the same time. I just have to focus on one thing. And I think, well, I know. So the reason that I that I chose to focus on YouTube for that year is because up to that point, YouTube was kind of like the steady growth curve. So like, whenever I looked at the analytics, it was steadily growing. And compared to my website analytics, you know, it was it was kind of choppy. It wasn't it wasn't growing exponentially like YouTube was. And so I figured the highest probability bet that I could make would be to focus 100 of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 94,
      "start_timestamp": "00:14:56",
      "start_timestamp_seconds": 896.7829787234042,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=896"
    }
  },
  {
    "text": "looked at the analytics, it was steadily growing. And compared to my website analytics, you know, it was it was kind of choppy. It wasn't it wasn't growing exponentially like YouTube was. And so I figured the highest probability bet that I could make would be to focus 100 of my effort on the one thing that I know is growing. And if I focus more on that, and especially if I improve the quality of my videos, then I think I can kind of pour gasoline on that growth. So it's the yeah, yeah, that's what I did. That's absolutely awesome. I love that because I also had a blog for a little while that was just, you know, general hobby. And what I realized is I was talking to some of my friends, nobody wanted to sit there and fucking read it. You know what I mean? And one of the things people really enjoy about YouTube is that if they're doing something else and they want to partially pay attention, it's available to them. They can just let it run and, you know, digest what they hear. And if they want to go back and like really focus on it, I think it's really awesome that you did that and you kind of identified that obviously, you're really savoring it. It comes to identify business opportunities. That's super awesome. When you first started, general question, did it still feel like a chore working on YouTube slash? And",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 94,
      "start_timestamp": "00:16:36",
      "start_timestamp_seconds": 996.4255319148936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=996"
    }
  },
  {
    "text": "focus on it, I think it's really awesome that you did that and you kind of identified that obviously, you're really savoring it. It comes to identify business opportunities. That's super awesome. When you first started, general question, did it still feel like a chore working on YouTube slash? And I'm asking for me, obviously, my viewers, they don't care. But I'm curious personally, like when did it start feeling like fun for you to work on YouTube channel compared to the website? That's a good question. I honestly can't, I can't pinpoint a specific moment. But I think, I think just generally after I started YouTube and I started seeing, because the YouTube analytics are absolutely insane, as I'm sure you know. I'd say what, man, I'm too dumb to use it. I literally have one of my best friends. You only need to focus on a couple of things. YouTube, they kind of guide you and show you that when you log in, watch times, the first thing they should do. It's all about watch time. But I think it was after I had maybe a few months experience, probably about a year experience, because in my first six months, I think I added maybe three to four hundred subscribers. And then second six months, I added maybe a thousand, 1500. So like every, every interval of time or chunk of time, like going forward was exponential in terms of growth compared to this same amount of time",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 94,
      "start_timestamp": "00:18:16",
      "start_timestamp_seconds": 1096.068085106383,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1096"
    }
  },
  {
    "text": "six months, I think I added maybe three to four hundred subscribers. And then second six months, I added maybe a thousand, 1500. So like every, every interval of time or chunk of time, like going forward was exponential in terms of growth compared to this same amount of time in previous history. So like the first months was 300 subscribers the next six months were 1000 subscribers or whatever it is. And it just continued to grow exponentially. And so once I started to see those trends, I think I became much more interested in YouTube. And then I think after I turned on monetization, because I actually, I didn't turn on monetization or ads on my videos right when it was available to me. I think I actually, because I assumed that the money that was going to be made from my YouTube channel would be so low that it wouldn't even matter. And then I was surprised when I turned on monetization. I was like, oh, this is actually like my first, my first paycheck from YouTube was like a couple hundred bucks. Yeah. So like, well, that's a pretty substantial amount of money, because at the time, my first year, when I started project option, I made 10,000. And the second year was more than that, but it still wasn't like, it wasn't a lot of money. Right. Right. So 300 in one month in my first paycheck from YouTube, like that was a good amount",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 94,
      "start_timestamp": "00:19:55",
      "start_timestamp_seconds": 1195.7106382978723,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1195"
    }
  },
  {
    "text": "time, my first year, when I started project option, I made 10,000. And the second year was more than that, but it still wasn't like, it wasn't a lot of money. Right. Right. So 300 in one month in my first paycheck from YouTube, like that was a good amount of money. Yeah, that's decent. So I was super surprised to see the amount of money that could be made from monetization. And so that also started to get me more and more interested. And I love that is for people who maybe have no idea about YouTube ad revenue and stuff like that. It's very niche dependent. So like if you have a YouTube channel and you are getting like tens of millions of views on all of your videos, then that means you have a very broad audience. Right. Basically, you're catering to everyone. You just have you just have viral YouTube content that everybody wants to watch. But for advertisers, if you have a really broad audience, then there's not going to there's not going to be as much competition to actually target a specific audience because they can't use your channel to really get to the audience they want. Right. But in something like finance, since all the people who are watching options trading videos or investing videos, that's a much more specific audience. And the lifetime value of acquiring a customer and finance is thousands of dollars. Right. And so if you can, if you",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 94,
      "start_timestamp": "00:21:35",
      "start_timestamp_seconds": 1295.3531914893617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1295"
    }
  },
  {
    "text": "audience they want. Right. But in something like finance, since all the people who are watching options trading videos or investing videos, that's a much more specific audience. And the lifetime value of acquiring a customer and finance is thousands of dollars. Right. And so if you can, if you can acquire that customer and make those thousand dollars, in some case, tens of thousands of dollars over the lifetime of that customer, then you can naturally spend hundreds of dollars to acquire a customer. Right. And so since the lifetime value of the customer is higher in finance and investing, then you can pay more to acquire the customer. And so advertising competition and advertising spend is a lot higher in finance as it would be in something that's much more broad where you can't figure out the audience. And so that trick goes down to the YouTube creator because YouTube takes a percentage of what the advertisers pay to advertising the channel and then you as the creator get the rest. So yeah, that's it's, I mean, that's educational for me. I honestly didn't know a lot of that because I was in the same boat as you where I didn't bother turning on monetization for some time. And then I was talking to somebody about it and they were like, dude, why don't you just turn it on because they know I work with the Wounded Warrior project. No, why don't you just turn it on and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 94,
      "start_timestamp": "00:23:14",
      "start_timestamp_seconds": 1394.995744680851,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1394"
    }
  },
  {
    "text": "where I didn't bother turning on monetization for some time. And then I was talking to somebody about it and they were like, dude, why don't you just turn it on because they know I work with the Wounded Warrior project. No, why don't you just turn it on and donate it? And I was like, yeah, you know, I'm not sure I thought the same thing is going to be really low, who really cares. And then he's just like, dude, think of it this way. It's no sweat off of the viewers back. Like it makes no difference. The content you're providing is still completely free to them. So you're not, you know what I mean? You're not changing that paradigm that I kind of built my channel on. And he's like, and then you just, you know, it's passive, like just donate it. I was like, yeah, okay. And then I found the semi-sac thing as you were talking about. I was surprised with the ad revenue. It's actually really cool because I was able to make a donation that was for building a ramp out of dude's house that was in a wheelchair. He literally sent a video to one of the segments of him getting in his house because it had stairs. And he literally would roll the wheelchair backwards until he hit the stairs and like muscle himself up for stairs. And he was good at it. But we're like, you know what we",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 94,
      "start_timestamp": "00:24:54",
      "start_timestamp_seconds": 1494.6382978723404,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1494"
    }
  },
  {
    "text": "a video to one of the segments of him getting in his house because it had stairs. And he literally would roll the wheelchair backwards until he hit the stairs and like muscle himself up for stairs. And he was good at it. But we're like, you know what we could probably get this dude a ramp. So it doesn't have to play that game. So it's fascinating that background you shared because like you said, ignorant all of it. You know nothing. So that's cool man. So like all these little things that I was learning about, especially like as they pertain to YouTube, all these things together, they really pulled me in. I was like, okay, if I could focus on this and if I put in the effort then maybe one day like this could be all I need. Right. Yeah. I'm happy that I'm able to make a full-time living from YouTube and also the affiliate marketing that I do which is just essentially connecting people with a brokerage firm because now my business model doesn't require anybody that's watching my videos. It doesn't require them to pay me right out of the pocket for me to make money. And so you know there's obviously a lot of in the trading and investing industry. It's very predatory. I hate it. Where fucking hate it. These people they line their pockets from other people who are paying them that just don't know any better. And they sell",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 94,
      "start_timestamp": "00:26:34",
      "start_timestamp_seconds": 1594.2808510638297,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1594"
    }
  },
  {
    "text": "to make money. And so you know there's obviously a lot of in the trading and investing industry. It's very predatory. I hate it. Where fucking hate it. These people they line their pockets from other people who are paying them that just don't know any better. And they sell them on the material things which you know that was like from day one when I started project option. I was like I'm going to take the long road and I'm never going to I'm not going to succumb to you know selling the dream to sell my business or whatever because number one that's not reality. Like these people they're making they could be making that amount of money from their trading accounts. But it's very unlikely that they grew small trading accounts which is most of their customers will have a thousand dollars into millions of dollars. That's like very far in between. But once they have that experience or they have the proof that they actually did that however they were successful in doing so. Then they can use that to sell a subscription service or a course. And then the money that comes from that can grow their trading account even further. And then they have the steady just steady flow of cash flow that they can use to make riskier and risk your bets. And some of those could pay off. But for the average person that is going to start with a couple thousand",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 94,
      "start_timestamp": "00:28:13",
      "start_timestamp_seconds": 1693.9234042553192,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1693"
    }
  },
  {
    "text": "grow their trading account even further. And then they have the steady just steady flow of cash flow that they can use to make riskier and risk your bets. And some of those could pay off. But for the average person that is going to start with a couple thousand dollars. It's just not it's not a realistic way to market your stuff. And so my goal with project option was to just kind of present things neutrally and get people the information and let them use it however they want to. But I never wanted to use the flashy sales tactics for the purpose of selling things that would line my own pockets. I love that. So I'm happy that the ad revenues are high enough on YouTube for the options trading space and finance in general. Because I can structure a business model around that where I don't have to actually collect payments from the customers. Yeah. Have them pay out of pocket. Yeah. That's awesome. Man. And to be honest, it's one of the things that I do before I invite anybody to chat on my channel. Not like again, not like I'm offering any sort of significant exposure. But do you know that folks are looking for resources and stuff? And I want nothing to do with any of those kind of channels because it's just misleading. It brings people down the wrong path. I literally just started a I call it a small stacks portfolio.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 94,
      "start_timestamp": "00:29:53",
      "start_timestamp_seconds": 1793.5659574468084,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1793"
    }
  },
  {
    "text": "significant exposure. But do you know that folks are looking for resources and stuff? And I want nothing to do with any of those kind of channels because it's just misleading. It brings people down the wrong path. I literally just started a I call it a small stacks portfolio. So I just took 5k, opened up a small portfolio, and I'm essentially trading it, knowing what I know now as if I was starting all over again. And what I tell everybody is that this 5k is not going to grow into my nest egg. Like this 5k is something that I think if I was starting over again, that I would be wanting to grow modestly, but most importantly, developing a solid strategy that as my income grows and as I continue to save and grow the account, I can continue to apply that same strategy, earning that whatever that percent return is. So it's like that 5k is for developing a strategy in consistency that is not going to grow in your nest egg. And I honestly love that you kind of echo that because it's so exhausting, seeing all the bullshit that people are spreading. And then it's no wonder why when there's new people to come into investing, they're like, you ask them, hey, you know, what are you what are you targeting this year? They're like, oh, you know, nothing crazy, maybe 80, 100 for the year. And it's like, oh, God, like just",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 94,
      "start_timestamp": "00:31:33",
      "start_timestamp_seconds": 1893.2085106382976,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1893"
    }
  },
  {
    "text": "then it's no wonder why when there's new people to come into investing, they're like, you ask them, hey, you know, what are you what are you targeting this year? They're like, oh, you know, nothing crazy, maybe 80, 100 for the year. And it's like, oh, God, like just you're completely lost. You're so skewed in what you think is realistic. Yeah, some people, some people email me and they ask me for my opinion on a service or whatever, not to name anything. And most of the time, like I've never heard of it myself, but just the other day, someone asked me and they said, well, this service, they said that they can turn 5,000 into 200,000 every year. I was like, well, obviously, like that's not true because they may have done it once, but if they could do it every single year, then there would be no reason to sell that because they would be a trillion. If you could turn 5,000 into 200K every single year, and you could scale that strategy, there would be no reason to be in online sales. You could just, you could become a billionaire with that. Right. Sure. You know, so Epstein's Island and then just stay there. Yeah, exactly. And then like I've had, I've had people email me pictures from other newsletters or trade-alert services where like in their introductory newsletter that they're using to kind of try to sell people on it, where they'll say",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 94,
      "start_timestamp": "00:33:12",
      "start_timestamp_seconds": 1992.851063829787,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1992"
    }
  },
  {
    "text": "You know, so Epstein's Island and then just stay there. Yeah, exactly. And then like I've had, I've had people email me pictures from other newsletters or trade-alert services where like in their introductory newsletter that they're using to kind of try to sell people on it, where they'll say like with just 2,000 on a margin account, like you can make a full-time living trading options like psychotic. It's just absolute bullshit. So it's psychotic. It's unfortunate that that's the space we're in. I feed it. But yeah, like when I started, I knew that not taking that approach to marketing and selling would be a much slower path, but it was just so important to me to not go down that path. It's so awesome. It's so awesome. I wouldn't be able to live with myself, which is different types of people that because the person that can do anything and do any type of sales that they want to as long as it benefits them. And they don't care, like what that means ethically. And then there's the other type of person that will refuse certain approaches if it's not ethical. You know, I'm just type of person. So I always try to be, I always try to be brutally honest. And my whole goal is just to give people information, unbiased, and let them do with the information whatever they want. I love that. Yeah, it's honestly when I was, I looked at a couple of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 94,
      "start_timestamp": "00:34:52",
      "start_timestamp_seconds": 2092.4936170212763,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2092"
    }
  },
  {
    "text": "person. So I always try to be, I always try to be brutally honest. And my whole goal is just to give people information, unbiased, and let them do with the information whatever they want. I love that. Yeah, it's honestly when I was, I looked at a couple of your videos before I asked you to come on and do this with me. And that's one thing I truly look for is the people who are genuinely trying to just share information and then let individuals do what they're going to do with it. But something that is definitely clouded the space is just predatory live advertising. You see it all the time and it sucks because it's so effective. So many people just want that lifestyle so bad that when they see something that you know it's fishy, but you want it so bad that you want to believe it. And then you find yourself going down this, you know, really shitty path. Yeah. Right. So when you started investing, what, what was your primary vehicle? Did you start with stock and go to options? Or do you start with options? What did that look like? Yeah, so I started when I read a lot of books just on general stock investing. So I read basically all of Peter Lynch's books. He's famous mutual fund manager and who worked for fidelity. He had like 30 returns for 15, 20 years, whatever, whatever his period of time working there,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 94,
      "start_timestamp": "00:36:32",
      "start_timestamp_seconds": 2192.136170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2192"
    }
  },
  {
    "text": "I started when I read a lot of books just on general stock investing. So I read basically all of Peter Lynch's books. He's famous mutual fund manager and who worked for fidelity. He had like 30 returns for 15, 20 years, whatever, whatever his period of time working there, he has like some of the most historic returns ever for mutual fund managers. So I read all of his books essentially. I read a couple books by Jim Kramer. I was just kind of, I was just absorbing as much information as I could within the stock investing space. And naturally from there going down rabbit holes on the internet, I found options. And I think I found options articles from the Motley pool. And I was like, these things are interesting. Like, I don't know what this is about, but this sounds really appealing. And like admittedly, the appeal of options that drew me in was that you could use a small amount of money. There it is. Automotive. You know, so that really drew me in. And then I started searching for options content on YouTube. And then I found Tason Trade. And then that's kind of what led me to email Tom. And then I had the internship at Tason Trade and then started project option obviously. So yeah, I started in stocks, transitioned into options. But at the time. So this must have been in 20, this was probably early 2013. Okay. So I was",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 94,
      "start_timestamp": "00:38:11",
      "start_timestamp_seconds": 2291.7787234042553,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2291"
    }
  },
  {
    "text": "what led me to email Tom. And then I had the internship at Tason Trade and then started project option obviously. So yeah, I started in stocks, transitioned into options. But at the time. So this must have been in 20, this was probably early 2013. Okay. So I was 20 years old. So I didn't have a lot of money to invest at that time. So I was basically just learning as much as I could. And just this absorbing all the content. So yeah, that's awesome. I started with stock myself. And then I stumbled across options in a kind of similar way. I started early though. I started trading options in when I was a senior in high school. So 2009. And I was super fortunate in that there was no, like, internet was still kind of like growing then. Obviously it existed. But it wasn't like for information as it is now. And I was super fortunate. I came across a, my mentor, I still talked to him today. But he's a prior army officer and what not, I met him on a Facebook group. But long story short, if it wasn't for that dude to help me get started when I was getting started, I probably would have just, you know, pissed on my money away. So I, I find your approach very respectable because most people, myself included, want to get started before they're ready to get started. And it seems like you did",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 94,
      "start_timestamp": "00:39:51",
      "start_timestamp_seconds": 2391.4212765957445,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2391"
    }
  },
  {
    "text": "help me get started when I was getting started, I probably would have just, you know, pissed on my money away. So I, I find your approach very respectable because most people, myself included, want to get started before they're ready to get started. And it seems like you did a lot of homework, which is, honestly, it's just super admirable to hear that because most people are like me and they're impulsive and they want to get started before they're ready. They want to start making money. And then they just piss it away because they're not ready. So that's really awesome. Something I'm curious about is if you were to like look at the lifespan of your options trading, how has it evolved from when you started to how you trade now? That's a great question. So to kind of, to kind of build on what you just said, while I did do a lot of reading and learning before I ever made an option straight, I probably was reading about options for probably one or two months before I even don't count and made my first trade. But the most, the most you're going to learn is going to come from your direct experience. So it doesn't matter how many YouTube videos you watch, how many book to read, how many blog posts you read, you're not going to learn how options work until you actually start trading them with real money in my opinion because I,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 94,
      "start_timestamp": "00:41:31",
      "start_timestamp_seconds": 2491.0638297872338,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2491"
    }
  },
  {
    "text": "going to come from your direct experience. So it doesn't matter how many YouTube videos you watch, how many book to read, how many blog posts you read, you're not going to learn how options work until you actually start trading them with real money in my opinion because I, I messed around with paper trading and I just never found it to be a valuable learning experience because I would, I would, and this is, it's not true for everybody. Oh, sure. Yeah. Like I would put on an option position in these simulated trading softwares and I would kind of just forget about them because I, I didn't have any skin in the game and there was really nothing that was pulling me back to like monitor that position. I'm just really focused on it. And so I didn't really find that it was a valuable learning tool. Although if, if people use it like a real trade or a real position and they actually like watch it. Yeah. A whole time today, checking on every day and then close it out. I think, I think you can learn a lot from that. But I've always felt that real money trading is the absolute best way to learn obviously with a small amount if you're just, yeah. But I agree with you. Your experience trumps all. I totally agree with you. Regardless of what we're talking about. Yeah, I totally agree with you. I think for me, I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 94,
      "start_timestamp": "00:43:10",
      "start_timestamp_seconds": 2590.7063829787235,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2590"
    }
  },
  {
    "text": "real money trading is the absolute best way to learn obviously with a small amount if you're just, yeah. But I agree with you. Your experience trumps all. I totally agree with you. Regardless of what we're talking about. Yeah, I totally agree with you. I think for me, I had the same exact perspective on paper trading for a long time that was kind of useless. And then when I met my mentor, my opinion on paper trading completely changed because he forced me to paper trade for six months straight. I couldn't, he, I mean, I say I couldn't, I could have traded, right? He didn't fucking control my account. But I really respected him and I didn't, I wanted to do, you know what I mean? What my mentor was kind of telling me to do is he made me paper trade for six months straight. And he, we treated it just like it was my money. Like we would talk about it every single day. We would talk about the moves I wanted to make. I was only allowed to trade the amount of money I was going to, you know, invest with stuff like that. And I found that to be so beneficial. And it came down exactly to what you said. It's like having the no shit discipline to treat this like real money, to treat this just like your account. And like you said, most folks, it's super hard to do that. I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 94,
      "start_timestamp": "00:44:50",
      "start_timestamp_seconds": 2690.3489361702127,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2690"
    }
  },
  {
    "text": "And I found that to be so beneficial. And it came down exactly to what you said. It's like having the no shit discipline to treat this like real money, to treat this just like your account. And like you said, most folks, it's super hard to do that. I needed somebody to force me to do it in order to take it seriously. So I totally identify with you that for most people until you put actual money in the game. It's just not the same. And even so, even like with me taking it as seriously as I did, it still isn't the same exactly like you said. Like there is no replacement for actually trading. But what I do tell people is that if you're new, I suggest so strongly to start with paper trading. Because I truly think that it can help you get a lot of like just the gross fuck ups out of the way early. So you don't have to do that with real money. I think that that's in just a really cool perspective that you were sharing because it's something I talk a lot about is, you know, the disposition towards paper trading. I agree with that. So to answer your question, how the trading evolved. Yeah. The early, like the first couple of years that I was trading options. I was doing, I was very active. So I was probably trading every day or as much as I could. And",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 94,
      "start_timestamp": "00:46:29",
      "start_timestamp_seconds": 2789.991489361702,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2789"
    }
  },
  {
    "text": "paper trading. I agree with that. So to answer your question, how the trading evolved. Yeah. The early, like the first couple of years that I was trading options. I was doing, I was very active. So I was probably trading every day or as much as I could. And I was experimenting with lots of different strategies, trading all the different strategies. I did a lot of naked option selling. So I loved selling stringals early in the case. And that's because when you learn about option decay and positive theta and everything like that, you naturally are gravitated towards selling straddles and selling stringals because you don't have the long options that are reducing your option decay. And so early in my options trading career, learn life span, whatever you want to call it. I was doing a lot of naked options selling and just trading a lot of different strategies, making a lot of predictions and speculations on stock price movements. But I think the most important part of that whole thing is just experimenting with different strategies and paying attention to why the positions are changing in terms of P and L every single day. So observations that you make with your positions, I think are one of the best ways to learn because you have to ask yourself, all right, the stock is down today and my position is up or the stock is flat today, my positions, P and L has changed by why",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 94,
      "start_timestamp": "00:48:09",
      "start_timestamp_seconds": 2889.634042553191,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2889"
    }
  },
  {
    "text": "observations that you make with your positions, I think are one of the best ways to learn because you have to ask yourself, all right, the stock is down today and my position is up or the stock is flat today, my positions, P and L has changed by why is this happening? And you have to ask yourself the why every single day and after every single movement. And that's how you're going to learn how options work truly in the real world. And so that was the first the first few years that's kind of how I approached it. I was not really making money, I would say I was a break even trader at best, which is still I think really good when you're starting out. If you can break even your first year, I think that's all I really be honest been I tell everybody be profitable because your first year and you make a dollar win. Yeah, you come out okay. Yeah, I may not have been breaking even, but it wasn't I never had any catastrophic loss. Which I think is very common for beginners, especially if you're getting into the short term option buying, which is something that a lot of people kind of put out there these days because that's the only that's the only real way to have a 10,000 extra turn is to buy out of the money options, super short term and be right on a big stock price",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 94,
      "start_timestamp": "00:49:49",
      "start_timestamp_seconds": 2989.276595744681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2989"
    }
  },
  {
    "text": "buying, which is something that a lot of people kind of put out there these days because that's the only that's the only real way to have a 10,000 extra turn is to buy out of the money options, super short term and be right on a big stock price movement. Yep, that's the only way to have those home run type returns and people do hit them, but that's the fastest way to blow up your whole account because you don't have any margin for error and those options are not only going to decay very quickly, but if the stock price moves against them, those options will also be worth it. I mean, you just sit there looking at a lot of gamma risks. So it's yeah, it's as my I'm in a I'm in a Google chat with my brother and some other people and we call it vapor risk vapor risk. So like if you buy short term out of the money options, those are pure vapor. So that'll just gone. Yeah, I love that. That's absolutely accurate. Yeah, and so that evolved into that evolved into basically transitioning from all the strategies to mainly selling directionally neutral trades or doing spread trades directionally. So it's basically just spreads, but it was either neutral or directional. Got it. Like iron condors, iron butterflies or selling foot spreads selling pulse spreads, buying pulse spreads, buying foot spreads. That's kind of where it went, but the activity was",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 94,
      "start_timestamp": "00:51:28",
      "start_timestamp_seconds": 3088.9191489361697,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3088"
    }
  },
  {
    "text": "directionally neutral trades or doing spread trades directionally. So it's basically just spreads, but it was either neutral or directional. Got it. Like iron condors, iron butterflies or selling foot spreads selling pulse spreads, buying pulse spreads, buying foot spreads. That's kind of where it went, but the activity was still pretty high. And if we fast forward to probably the past year, I would say that my trading activity, my trading activity from day one options trading like starting from when I started learning all the way to today, I think my trading activity has been a steady decrease in current. That's awesome. I think that's because I've realized that the more active I am, the worse I do. Because not necessarily just like churning trades, but like your your micromanaging position and this actually happened earlier this year in March when the market was so volatile, I got sucked into the volatility and I was started to micromanage again. And every single day I was making a 10 to 15 trades. Yeah. And I felt like I was just kind of digging myself and do a whole because I was never letting a prediction play out. I was just kind of changing my predictions with each day with each new movement in the market. And I found that to be a very difficult period trading wise. And it was also getting super, super stressful. I started to lose sleep. I was waking up at four in the morning,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 94,
      "start_timestamp": "00:53:08",
      "start_timestamp_seconds": 3188.5617021276594,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3188"
    }
  },
  {
    "text": "just kind of changing my predictions with each day with each new movement in the market. And I found that to be a very difficult period trading wise. And it was also getting super, super stressful. I started to lose sleep. I was waking up at four in the morning, oh my, my phone to see where ES was. Yeah. So it just it wasn't like I had a ton of risk on it. That's that's not why I was losing sleep. It was just because my brain had gotten into this pattern of just being hyper obsessed with every little movement in the market. Yeah. It was hard to lower the fame because every day the market was up or down. And so I was able to pair that back and start putting on some directional positions, which after the Federal Reserve came out and came out with all the stimulus. And then we rallied like 10 off the lows. And then we weren't started. We weren't really seeing any negative downturns even after he's coming out. Then I kind of figured like all right, I might as well just not try to fight this because after we started bouncing 5 10 off the lows, I was like, all right, now is the time to start loading up on the shorts again. And I burned a lot of money in VXX by purchasing deep out of the money calls and VXX because I thought we could have another vol",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 94,
      "start_timestamp": "00:54:48",
      "start_timestamp_seconds": 3288.204255319149,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3288"
    }
  },
  {
    "text": "bouncing 5 10 off the lows, I was like, all right, now is the time to start loading up on the shorts again. And I burned a lot of money in VXX by purchasing deep out of the money calls and VXX because I thought we could have another vol explosion with the obvious, the obvious incoming market crash. But we never really got that. And then I also learned that typically when you have a shock to the system and you have a really severe stock market crash, the volatility increases typically the most exaggerated on the initial downturn. But then even if you rally back up and then you have another 10 drop, like the second increase in volatility, primarily talking about the VIX, VIX futures, and therefore VXX, that will not be as significant as the first typical meltdown. So like the initial shock is typically the most jarring in terms of a volatility increase. Absolutely. The information that I came across on the internet, which you always have to take with the great. Just to blindly obviously. It does make sense when you think about it because like a couple months in like a month and a half into the new volatility, like people are used to really bad news and people are used to a market decrease. And therefore the reactions to those movements and the reactions to the news are not going to be as exaggerated as when you go from a 12 VIX",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 94,
      "start_timestamp": "00:56:27",
      "start_timestamp_seconds": 3387.8468085106383,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3387"
    }
  },
  {
    "text": "a half into the new volatility, like people are used to really bad news and people are used to a market decrease. And therefore the reactions to those movements and the reactions to the news are not going to be as exaggerated as when you go from a 12 VIX and then all of a sudden the market dropped 30 in 17 trading days and now the VIX is at 90. I talk about that a lot too. I always like to say markets crash down, not up. But once you get through that first move, exactly like you're talking, people have had a chance to digest, synthesize the information. So even if there is a change in circumstance, two months down the line or whatever, they've already hit that initial shock. It's funny you bring that up because I truly have felt and I've said it a million times on different videos that this has been one of the most emotional markets I've ever traded in. I started trading really in 2007 and it's just been mind blowing to me just how emotional every single thing feels to me. And it's also very fascinating to hear how you handled the rebound compared to how I did because I absolutely shared your sentiment. I thought with near certainty that there's no way the market could continue up after the initial rebound. But I didn't start playing it because I felt like the move in the news I was seeing didn't",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 94,
      "start_timestamp": "00:58:07",
      "start_timestamp_seconds": 3487.4893617021276,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3487"
    }
  },
  {
    "text": "the rebound compared to how I did because I absolutely shared your sentiment. I thought with near certainty that there's no way the market could continue up after the initial rebound. But I didn't start playing it because I felt like the move in the news I was seeing didn't make any sense. So I literally just started scaling out. When the market makes typically those big down moves, that's when I end up doing very well with the volatility starting to spike as much as it does. And then as soon as we started getting that rally, I was like, I'll just kind of scale out and see how this plays out. And then it just kept going and going. And I was like, what the fuck man? What is happening right now? And especially the technology stocks. I was just crazy. And I was looking at you know, just some studies on historical bear markets and from like 1920 or so the average recovery is like 298 days or so. So over 200 days, almost 300. And I know that. And then as soon as I started seeing this thing, you know, looking like a V shape, I was like, how, how, like how are we making this move? I just didn't believe it. So I've been ever since the drop. I've been very lightly invested. I've scaled in a bit more in different periods of time. But in general, I just don't trust it, man. I just",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 94,
      "start_timestamp": "00:59:47",
      "start_timestamp_seconds": 3587.131914893617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3587"
    }
  },
  {
    "text": "was like, how, how, like how are we making this move? I just didn't believe it. So I've been ever since the drop. I've been very lightly invested. I've scaled in a bit more in different periods of time. But in general, I just don't trust it, man. I just do not trust for things. Our technology has been doing well. And I think in a lot of ways, this kind of environment boasts well for them. You know, everybody needs technology. And I get that. But there's a lot of other, you know, makeup in the markets, not just technology. So I have, I don't have a hard time with that. Being cognizant of our time, I definitely don't want to run over. I really appreciate your time. I want to make sure that we have a few minutes to touch on just your thoughts on how the mind of the trader impacts, you know, their execution, especially in a time like we're seeing right now, you know, when things are so emotional. I'd let you get your thoughts on that. Yeah. So I think I've personally realized and I structure my own trading, philosophy and approach around psychology because I'm particularly sensitive to stress and anxiety. And so if I, if I'm too active in the markets and like they're taking, it's taking up too much of my mental space and especially like if I size trades too large or something like that or I don't really know",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 94,
      "start_timestamp": "01:01:26",
      "start_timestamp_seconds": 3686.7744680851065,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3686"
    }
  },
  {
    "text": "because I'm particularly sensitive to stress and anxiety. And so if I, if I'm too active in the markets and like they're taking, it's taking up too much of my mental space and especially like if I size trades too large or something like that or I don't really know how I'm in a man in the position, then all those things can start to kind of e-way at me. And so I try to structure my trading strategy so that I don't really have to have those worries. And I think trader psychology is one of those things that it's not a sexy topic to talk about because everybody is like if we, if we just sit here talking about trader psychology, people will probably think, well, that doesn't really apply to me because it's really strong. Always. And while that could be true, when you have your money on the line and especially once you start to pay attention to the markets very actively, you'll find that the markets can break you down pretty quickly. And I've learned through many of, I think I learned the most about my own trader psychology and trader psychology in general through the big market crashes that we've experienced over the past few years. Yeah. Namely, I started trading options in mid 2013. And 2015 was extremely low, but 2014 was extremely low. And then we get to August 2015. And that's the first time that I ever saw a high volatility",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 94,
      "start_timestamp": "01:03:06",
      "start_timestamp_seconds": 3786.4170212765953,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3786"
    }
  },
  {
    "text": "the big market crashes that we've experienced over the past few years. Yeah. Namely, I started trading options in mid 2013. And 2015 was extremely low, but 2014 was extremely low. And then we get to August 2015. And that's the first time that I ever saw a high volatility market. And that's the first time I ever saw the floor being pulled out from the stock market. Right. And so in 2015, I was trading with about 20,000. And from January to August, I went up 10,000 again with a lot of naked options selling. I was selling lots of strangles. But I was having a lot of success with options trading. And I was up 50 on the year. And then August came around. And I lost all of my profits in like 36 hours or something like that. So, because the market started to get so volatile that I initially got blown out, not like blown out in terms of I blew out my whole account. But my short option positions to strangles those exploded in value when the market opened on August 24th. Right. And I took some big losses on those. But then the futures were moving around 100 a day. So then I was I was like, if I could just catch one of these movements, then I could make 5,000 because 100 points on ES is 5,000. And so I started to get into active futures trading. And that was like that pulled",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 94,
      "start_timestamp": "01:04:46",
      "start_timestamp_seconds": 3886.059574468085,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3886"
    }
  },
  {
    "text": "were moving around 100 a day. So then I was I was like, if I could just catch one of these movements, then I could make 5,000 because 100 points on ES is 5,000. And so I started to get into active futures trading. And that was like that pulled me in a very dark place psychologically because you're looking at every single move. Right. And especially if you like I had my entries and then I have my stops. And then it would always basically go right to my stop. I could stop down. And then the move would happen. And I'd miss out on it. And then you'd start to force entries on things because you're tired of waiting around. So it was just a very undisciplined period. And I started to get really, really active, especially with the futures. And I just noticed that like I just got way, way stressed out. And I was in a very dark place like it was not just it was not just affecting my investing portfolio. Yeah. For like my investing life, it was like all the aspects of life I got very sour and just I was in a not good place. So I actually when I got back to principle, which is my 20,000. So I actually took all of that money out of my trading count. And I didn't trade for a month. I didn't even open up my platform for a month. I was like, I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 94,
      "start_timestamp": "01:06:25",
      "start_timestamp_seconds": 3985.702127659574,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3985"
    }
  },
  {
    "text": "not good place. So I actually when I got back to principle, which is my 20,000. So I actually took all of that money out of my trading count. And I didn't trade for a month. I didn't even open up my platform for a month. I was like, I need to reset from this. I can't just go right back in there. Like I'm not in a good place mentally. And so that was my first big lesson about trader psychology. And especially how volatile markets can can chew you up and spit you out. To actually float my own boss. And I think a lot of people may agree with that because if you if you've never experienced a volatile market and when you start to learn, you start actually trading and getting involved in markets, just trickling higher. It's like, all right, low volatility, the market just kind of grinds up over time. There's no real worry. Like I don't know why people are scared of the declines and the drawdowns. And then it happens. And then you're like, oh, shit, like this is this is how it feels. And this is what happens in my brain when I start to see so much volatility. And also with volatility, you start to see all these opportunities. And so you might get sucked into all these trades that you are probably just putting on just because of the volatility. And you're thinking about if you can catch one",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 94,
      "start_timestamp": "01:08:05",
      "start_timestamp_seconds": 4085.344680851064,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4085"
    }
  },
  {
    "text": "when I start to see so much volatility. And also with volatility, you start to see all these opportunities. And so you might get sucked into all these trades that you are probably just putting on just because of the volatility. And you're thinking about if you can catch one of those huge moves for this particular position, like you're going to be sitting pretty. But unfortunately, it's it's not that easy. And volatile markets, I think, are the most dangerous, particularly for new traders because just what happens psychologically when you're actively involved in the markets and then everything just starts to get crazy volatile. I think that can that can really surprise you negatively in terms of how you react to those environments. So especially the, you know, what I find when there are people who are, you know, starting to think that they understand it and stuff like that. I always talk to folks. My favorite conversation is when folks are selling cash secured puts and they're always just like, oh, I'm okay with assignment. And then all of a sudden the underlying drops and they're like, why don't I want to sign it here? And it's like, it's just what you're talking about that it's what Mike Tyson always said, right? Everybody's got a plan to get punched in the face. It's the same exact thing. Like so many people feel like they're in a certain mental space. And then the shit happens. And they're like,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 94,
      "start_timestamp": "01:09:44",
      "start_timestamp_seconds": 4184.987234042553,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4184"
    }
  },
  {
    "text": "like, it's just what you're talking about that it's what Mike Tyson always said, right? Everybody's got a plan to get punched in the face. It's the same exact thing. Like so many people feel like they're in a certain mental space. And then the shit happens. And they're like, oh, okay, I'm in a completely different mental space. Yeah, I love that conversation. Obviously, we're pretty much at time. So I, I literally have a million questions for you. We can keep going. If I'm on that, on that note about psychology because I kind of want to have an action plan here. But the way I structure my trading these days is I'm typically doing one of three things if I'm trading off things at all. So a big, a big idea that I made a video about not long ago was that people see that I have this options trading channel and I only talk about options on the channel. And so I think that people might have the impression that I only trade options. And that's like all I do in terms of my investing portfolio. But actually, it's a very small percentage. And I think that's important because since you get a lot of leverage with options, you don't need to allocate 100 of whatever you have saved up and in your investment accounts, you don't have to allocate 100 of that money to options. And the fact I think is very dangerous. So for",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 94,
      "start_timestamp": "01:11:24",
      "start_timestamp_seconds": 4284.629787234042,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4284"
    }
  },
  {
    "text": "that's important because since you get a lot of leverage with options, you don't need to allocate 100 of whatever you have saved up and in your investment accounts, you don't have to allocate 100 of that money to options. And the fact I think is very dangerous. So for example, like you could use 5 of your portfolio. Let's say you have, let's say you have 50,000. I know that's a lot of money, but I have to kind of size it up here because unless you have tens of thousands of dollars, like you can't really size position with 5. If you have 3,000, 5 of that is 150. There's not many options in positions you can put on for 150. And so let's say you have 50,000, 5 of that is 25,000. Let's say you're really, really bullish on some stock and you want to put on a position that is going to benefit immensely from any increase that you see over the next couple of years. Well, you could take that 2,500 and you could buy a call option with it in the year out, two years out expiration cycle. And you could double or triple or 10X that money depending on the exact stock price increase that you see. But you can only lose 1X. And so you either are going to lose 5, which over a one year, two year period, that's not going to kill you. You're not going to be at zero.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 94,
      "start_timestamp": "01:13:04",
      "start_timestamp_seconds": 4384.272340425532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4384"
    }
  },
  {
    "text": "or 10X that money depending on the exact stock price increase that you see. But you can only lose 1X. And so you either are going to lose 5, which over a one year, two year period, that's not going to kill you. You're not going to be at zero. But if your prediction is correct and you should really only be doing this if you have a strong conviction about something and you want that exposure. But you could double or triple 4X, whatever it is. And with that small 5 allocation, that could result in an overall account gain that is still huge relative to the risk you took. Right. And so I think with the leverage that you can get with options, you don't have to take 100 of what you have. Unless of course you have just a couple thousand dollars. In which case, it's hard to kind of diversify that into different position. And stocks are expensive, which is, I think another reason people are drawn to options is that buying stocks is really expensive. Like, if you want to buy a share of Amazon, you got to have 3,000. Whereas you could trade a call spread on Amazon with a few hundred dollars and you could make a few hundred dollars from that position if you're right. But I think it's I think it's dangerous to forego traditional investing and focus solely on more active approaches. Just because you think about it over if",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 94,
      "start_timestamp": "01:14:43",
      "start_timestamp_seconds": 4483.914893617021,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4483"
    }
  },
  {
    "text": "call spread on Amazon with a few hundred dollars and you could make a few hundred dollars from that position if you're right. But I think it's I think it's dangerous to forego traditional investing and focus solely on more active approaches. Just because you think about it over if I'm going to take all of my money, everything I've saved up and I'm going to allocate it to strictly options trading. And I'm going to do that for the next 10 years. Well, what that means is over the next 10 years, I have to be consistently right about my short term predictions with what's going to happen in the stock market. Otherwise, I'm going to lose money. And for me personally, getting back to the trader's psychology, I don't want to I don't want to put myself into position where I have such a high bar to be successful. I'm not saying that that's going to lead me to not do it at all. I love trading options. Like, I'm going to be here for the rest of my life. But I just I don't need to spend or I don't need to allocate 100 of whatever I'm saving to options because I know that they are more speculative because they require whether you're trading directionally or neutral, it doesn't matter. You're still making a prediction. And the success of your strategies depends specifically on the path that the stock pays take over that trade duration. And so",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 94,
      "start_timestamp": "01:16:23",
      "start_timestamp_seconds": 4583.557446808511,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4583"
    }
  },
  {
    "text": "saving to options because I know that they are more speculative because they require whether you're trading directionally or neutral, it doesn't matter. You're still making a prediction. And the success of your strategies depends specifically on the path that the stock pays take over that trade duration. And so I don't want to put myself in a position where I'm not going to make any money unless I'm successfully predicting short term movements and stocks over the next 10 years. Like that. When I just think about that, like, that seems like a very stressful situation to be in. And so I'd rather hold passive investments and actively purchase more long term positions that actually represent something over a long period of time. Because I know with the longer holding period, this has statistically been shown to be true too. The longer you hold stocks, the higher the percentage chance that you have in making money. And in this book that I'm reading psychology of money, I think he said over 20 year periods, there's been 100 chance of making money thus far. But basically like on a one day period, it's 50. Right. One year, it's 60. I think he said 68 10 years is even higher than 20 years is 100. So like if I'm putting my money in those types of positions, there's a lot less stress associated with that because I know it's not on me. I don't have to predict where Tesla is going",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 94,
      "start_timestamp": "01:18:03",
      "start_timestamp_seconds": 4683.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4683"
    }
  },
  {
    "text": "think he said 68 10 years is even higher than 20 years is 100. So like if I'm putting my money in those types of positions, there's a lot less stress associated with that because I know it's not on me. I don't have to predict where Tesla is going to go over the next 45 days. If I think in 10 years from now, the company is going to be better off than it is now. And it's going to change the world and how we see it. Then that's a much easier play to make with the majority of my money. But it doesn't mean that I'm not going to buy some Tesla stock, Tesla stock, and then also take a portion of that and do some highly leveraged, highly speculative option positions on. So I think like that gets back to psychology. And for me, personally, like I don't want to put myself in a situation where I have such a high bar required just to be successful, which is, which is I think one of the things that happens with people when they get into options is that you see the benefits of it. Like you can make a lot of money with a little bit of money and you can make money when the stock price doesn't move at all. You can make money when the stock price moves in either direction and all these things, they seem better than just passively investing. But I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 94,
      "start_timestamp": "01:19:42",
      "start_timestamp_seconds": 4782.842553191489,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4782"
    }
  },
  {
    "text": "can make a lot of money with a little bit of money and you can make money when the stock price doesn't move at all. You can make money when the stock price moves in either direction and all these things, they seem better than just passively investing. But I honestly, I think it's a really bad idea to kind of forget about traditional investing, even though there are benefits to be had with options. So I think I would agree with you. And I think for most folks finding some sort of mix is definitely the right balance. For me personally, my margin account is all options. I trade all options and I've done that for over a decade. And what I found is exactly like you're saying, for most people, it doesn't work well. And I think one of the reasons why it has worked very well for me is because the guy again, I talked about my time, I talk about him all the time because 80 of what I do is a relic of this dude that's been trading for 60 years. So my mentor, he's retired. And he uses his portfolio for income. So while a lot of people are trading spreads like you're talking about, I avoid spreads at all costs. And most of his trading is covered strangles. So not even like naked strangles, obviously, you know. But the way that he trades is really identifying with your concept of the longer term",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 94,
      "start_timestamp": "01:21:22",
      "start_timestamp_seconds": 4882.485106382979,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4882"
    }
  },
  {
    "text": "a lot of people are trading spreads like you're talking about, I avoid spreads at all costs. And most of his trading is covered strangles. So not even like naked strangles, obviously, you know. But the way that he trades is really identifying with your concept of the longer term game plan. So he trades primarily index ETFs. I trade primarily index ETFs. As a, again, just a relic of the way he imprinted on me. And one of the things that he does, and this is exactly what I did in March, is we allocate a certain amount of our account to this trade. Then we figure out how much we want to enter. So if I allocate 300,000 to this trade, I'm not going to enter with all 300K at once. I'm going to start with maybe 100K, 150K on the initial outlay. And then it happened in March. As soon as the market started crashing, I continue to scale into the trade until I hit my cap. And then I just took assignment. And then I exercised that long term point of view, whereas I trade IWM a lot. So whereas I thought, eventually, the market will recover. And the market will be fine. So I just sat on a shit ton of stock until the market started to move up. And then I completely unwind. So it's very interesting listening to you talk about your journey through active management, because I think most people touch the",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 94,
      "start_timestamp": "01:23:02",
      "start_timestamp_seconds": 4982.1276595744675,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4982"
    }
  },
  {
    "text": "recover. And the market will be fine. So I just sat on a shit ton of stock until the market started to move up. And then I completely unwind. So it's very interesting listening to you talk about your journey through active management, because I think most people touch the keyboard and the mouse too fucking much and they get in their own damn way for somebody to take assignment. And then do nothing is so difficult. And they like folks don't realize that. But they want to try to manipulate the trade and do all these other things. Something I'm curious about, and I'd love to just dig into like your journey. Because you do a lot of self analysis. It's very clear. How did you go about like truly getting yourself to slow down in terms of your interactions, you know, with your trades as much, and becoming more comfortable allowing your trade and your initial, you know, assumption to play out? I think that comes with experience and just understanding, understanding that every impulse you have doesn't need to be acted on. And I think that's a that's been a big lesson for me. So how did you come to that? And also, I think I kind of got too smart for my own good where I almost would talk myself out of almost every single trade. Because the initial assumption would be like, oh, XYZ or Apple stock is down today. Therefore, I should sell this",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 94,
      "start_timestamp": "01:24:41",
      "start_timestamp_seconds": 5081.770212765957,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5081"
    }
  },
  {
    "text": "you come to that? And also, I think I kind of got too smart for my own good where I almost would talk myself out of almost every single trade. Because the initial assumption would be like, oh, XYZ or Apple stock is down today. Therefore, I should sell this put spread because I can make, you know, 300 of easy money. But if it plummets another 20 that I'm going to lose whatever 1000, whatever the number is. And so you could look at it like, oh, it's a really high probability trade. You have a really high probability of making money. Apple's a crowd favorite. Like it's probably going to catch a bit at some point. Sure. So you should take, you should sell that spread right now because you can. And I think I've talked myself out of a lot of impulsive trades like that. Because you understand what can go wrong and you understand that there's that specific time frame associated with it as well. So then how do you balance to the other side, right? You like you're saying you talked yourself out of a lot of trades. How do you get yourself then, you know, to find the good trades to make? It's a it's a hard question because as I said earlier, in March, I kind of got sucked back in and I was doing bad things and I was being too active. But a lot of that a lot of the activity",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 94,
      "start_timestamp": "01:26:21",
      "start_timestamp_seconds": 5181.412765957447,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5181"
    }
  },
  {
    "text": "know, to find the good trades to make? It's a it's a hard question because as I said earlier, in March, I kind of got sucked back in and I was doing bad things and I was being too active. But a lot of that a lot of the activity was kind of trading around stock positions. But I also did I was making a lot of speculative plays as well. Primarily, the number one thing I was doing is I was betting on a market decrease in after the initial balance in March and April. And that never happened. So I actually put I put too much money into the into the high high reward low risk plays. I did a lot of asymmetric bets. I was basically buying puts in five. I had puts an IWM got a call and Vxx not necessarily all at once, but these are kind of conditions that I was trading. And the market just kept going up and I kept leading those positions out. But I did make I did make a lot of money on the initial decline from Vxx call options, because I had a lot of stocks in this main portfolio that I'm talking about. And those were taken ahead. And I as we started to kind of inch into that decline. And as I started to read more into the coronavirus headlines and kind of understand that this could be something not so great. I started to actually",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 94,
      "start_timestamp": "01:28:01",
      "start_timestamp_seconds": 5281.055319148936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5281"
    }
  },
  {
    "text": "main portfolio that I'm talking about. And those were taken ahead. And I as we started to kind of inch into that decline. And as I started to read more into the coronavirus headlines and kind of understand that this could be something not so great. I started to actually put on long Vxx call positions. And those did really well. So they sheltered a lot of losses from the stock going into the decline. But then as we rebounded back, I started to bet heavily again on another leg lower in the market. Those those never happened. So I I've earned a lot of money doing that. And also just like micro managing around those positions, you know, like if I bought Vxx calls on one day and then the market went up, then I would buy more because Vxx would be lower. And therefore I was kind of scaling into that position. And that's how I was justifying it. But then maybe as we got a decline, I would kind of sell out to earlier. So I just got I got way too active with that. But to answer your question like how how do you select the trades these days? It's it's a difficult question. But I would say I didn't answer this earlier. I said I was basically I'm doing one of three things from trading. The first is putting on leveraged upside plays, which is primarily long term call options in specific companies or it",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 94,
      "start_timestamp": "01:29:40",
      "start_timestamp_seconds": 5380.697872340425,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5380"
    }
  },
  {
    "text": "trades these days? It's it's a difficult question. But I would say I didn't answer this earlier. I said I was basically I'm doing one of three things from trading. The first is putting on leveraged upside plays, which is primarily long term call options in specific companies or it could be in index. Okay. Like SPY I had I had a couple of those positions where I purchased like the 350 calls in SPY for 3 and they had like two years, two and a half years of expiration. And I tripled up on those and I've since closed them. Yeah. It was like the bullish type of plays that I'm doing. And Tesla, I have some pretty deep out of the money call spreads that I actually legged into. So I purchased I purchased some calls in Tesla that had two years of expiration. Yeah. Stock shot up on that same day that I entered and I was actually able to short the same amount of calls at a hundred points higher. Right. And I collected the same amount of premium. So I essentially legged into a call spread in my enterprise is zero. And since the strike with is a hundred the max profit on those is 10,000. Right. So but the answer that there's no risk anymore. So if I'm really bullish on a stock long term, then I'll look to these leveraged upside plays. Yeah. But other than that, I'm either selling a directionally neutral",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 94,
      "start_timestamp": "01:31:20",
      "start_timestamp_seconds": 5480.340425531915,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5480"
    }
  },
  {
    "text": "with is a hundred the max profit on those is 10,000. Right. So but the answer that there's no risk anymore. So if I'm really bullish on a stock long term, then I'll look to these leveraged upside plays. Yeah. But other than that, I'm either selling a directionally neutral index butterfly. So I do I need a butterfly strategy and SPY or SPX depends on how I'm sizing it. But that's a directionally neutral plane that basically doesn't have a lot of upside risk. The main risk is a severe decline that's like a completely systematic strategy. So that really doesn't I don't lose sleep over that. Right. And the third way I'm trading is if I have an existing stock position, such as one in Tesla, this is the exact example of when I use this, if I have a stock position that's increased like certainly in a short period of time. And therefore the profitability of that position is really high. Then I'll actually look to hedge that position by using a put or put spread. So I did that in Tesla because the cost basis in the main portfolio that is the stock and option mix. The cost basis of Tesla shares is like 210. And the stock price obviously is a certainly high. It's shot way higher just a couple months. And so going into the election and with all the uncertainty that's still brewing with coronavirus and everything, I purchased some of the 300",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 94,
      "start_timestamp": "01:32:59",
      "start_timestamp_seconds": 5579.982978723404,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5579"
    }
  },
  {
    "text": "The cost basis of Tesla shares is like 210. And the stock price obviously is a certainly high. It's shot way higher just a couple months. And so going into the election and with all the uncertainty that's still brewing with coronavirus and everything, I purchased some of the 300 puts, the purchase two of the 300 puts in Tesla got it. And I bought those for 15. So those expired in I think November. And so with that playing, the logic was Tesla shares have already seen this meteoric rise. I have a lot of profits on the stock position. But I can use this opportunity to buy these put options that are really cheap now at that strike price because the stock price is gone. So right. And since my cost basis is 210 on the shares and I bought the 300 puts for 15. Effectively, like the minimum sale price for those Tesla shares through November expiration is 285. So the strike price of 300 minus the cost of the puts is 285. Right. The entry price in the shares is 211. So if Tesla shares go to zero, I'm guaranteed to be able to sell the share that at 285, essentially. Right. It would be effective sale price inside. I bought the 300 puts for 15. Well, like, Tesla goes to zero. I don't think anybody's doing shit. We're probably not going to be on the computer very much. Yeah. Yeah. Who knows? You never know.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 94,
      "start_timestamp": "01:34:39",
      "start_timestamp_seconds": 5679.625531914894,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5679"
    }
  },
  {
    "text": "share that at 285, essentially. Right. It would be effective sale price inside. I bought the 300 puts for 15. Well, like, Tesla goes to zero. I don't think anybody's doing shit. We're probably not going to be on the computer very much. Yeah. Yeah. Who knows? You never know. But selecting, I think selecting trades is really hard. And it's trader specific because everybody has kind of the signals that they look for their own personal predictions. These days, I'm not trying to make an aggressive amount of predictions, but I do need options when I have a stronger conviction on a particular company. Or I just want leverage exposure. Like, let's say I have 125,000 into the account. And I'm already invested with 100,000 of it. Right. 25,000 left over. So maybe instead of buying shares of the company that I'm bullish on long term, instead of spending that larger outlay, maybe I'll spend the same amount or a fraction of that and just turn it into an option play. And therefore, I can get exposure to that long term move. And I don't have to necessarily break the bank and doing it. So I don't necessarily have allocate the remaining amount attached to that one position. By using an option, I can get the leverage, but I still have limited downside if I'm wrong. So yeah, I love how I think about it. But how does the trade is such a difficult topic because everybody has their",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 94,
      "start_timestamp": "01:36:19",
      "start_timestamp_seconds": 5779.268085106382,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5779"
    }
  },
  {
    "text": "allocate the remaining amount attached to that one position. By using an option, I can get the leverage, but I still have limited downside if I'm wrong. So yeah, I love how I think about it. But how does the trade is such a difficult topic because everybody has their own strategies. Everybody has their own stocks that they trade and their own philosophies. I think that's a really difficult question to answer. But I try to be, I try not to make as many predictions in the short term as I can. So I try to, I'm going to make a leverage option play. Typically, it's going to have an expiration a couple of years out. And I think that's, I actually love that strategy as well. I mean, too. Me too. Me too. Maybe not right. This is second, but I know I'm going to employ that strategy a lot in the future. Yeah. My, so something that I've always appreciated my mentor for is whenever I would feel like I have an opinion on where an underlying was going, he would essentially always just call me a fucking idiot. And he would always say like, I'm worried about the wrong thing. He's like, stop worrying about where things are going to go. He's like, start worrying about money management. He's like, right at the end of the day. And he's really imprinted that on me where like, for most of my trades right now, and I truly",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 94,
      "start_timestamp": "01:37:58",
      "start_timestamp_seconds": 5878.910638297872,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5878"
    }
  },
  {
    "text": "about the wrong thing. He's like, stop worrying about where things are going to go. He's like, start worrying about money management. He's like, right at the end of the day. And he's really imprinted that on me where like, for most of my trades right now, and I truly mean it, like, I couldn't care less where the underlying goes because I know what I'm going to do if it plummets. I know what it's going to, what I'm going to do if it goes up. And most of my strategies are coverage strangle. So a big part of it is just get ready to sit and wait. And as long as you're comfortable with that, and it takes, it took me a long time to get there. And once your account continues to grow, it becomes easier and easier since you have additional capital to do other things with as you see fit. But I love that you're talking about the longer term long options. I very rarely buy premium, but I do. And I kind of scold people that, you know, are dead set on only buying or selling. I always feel like it's a pretty ignorant position. There's a time for both. And the way that if I'm buying options, it's typically a leap. And I'll generally employ like some sort of ratio diagonal. So I'll still sell calls against the longs. But in contrast to your approach, where you'll go out of the money, obviously",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 94,
      "start_timestamp": "01:39:38",
      "start_timestamp_seconds": 5978.553191489362,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5978"
    }
  },
  {
    "text": "position. There's a time for both. And the way that if I'm buying options, it's typically a leap. And I'll generally employ like some sort of ratio diagonal. So I'll still sell calls against the longs. But in contrast to your approach, where you'll go out of the money, obviously paying less, I typically goes, I go very far in the money. So I can try to limit, um, faded to K on the position and make sure, you know, I'm capturing some intrinsic value, but trade off is more expensive. But it's, it's really cool to hear you talk about, leaps, because most people who are buying options, they're cheap. You know what I mean? They want to buy it in the next two weeks, because it's a low dollar amount. But I've done it too. I'm guilty as well. I'm just just, um, yeah. So I guess what you said kind of builds on what I was saying by talking myself on a trade. It's that like, if I'm going to put on this 30 day off and play that requires a specific movement to happen, it could happen over the next three months or the next year. But for me to put money on the line and say with high certainty that's going to happen in the next three days. Right. Those types of trades are, they're much more like gambling. They're much more speculative, because I, I use this term, the path of the stock price.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 94,
      "start_timestamp": "01:41:18",
      "start_timestamp_seconds": 6078.195744680851,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6078"
    }
  },
  {
    "text": "But for me to put money on the line and say with high certainty that's going to happen in the next three days. Right. Those types of trades are, they're much more like gambling. They're much more speculative, because I, I use this term, the path of the stock price. And basically what I mean by that is literally like the path of the stock price takes over a specific period of time. Option option phrase and option position are entirely dependent on the path that the stock price takes. So for example, if you're going to say Netflix is overvalued, it's whatever it is, let's say it's 525 a share. I don't know where it is right now. And you think that Netflix for sure is going to be below 600 in 30 days or 60 days. So for that reason, you might go out to the 60 day expiration cycle and you might short the 600 call option just by itself, because you're, you're very convinced that Netflix is going to be below 600 and 60 days. And with the stock at 525, it's a very high probability play because it has to go up more than 75 by expiration for you to lose money on that. But what a lot of people overlook is even though that is a high probability strategy, you have to keep in mind what the stock path would mean for your strategy. So if the path of the stock was just flat,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 94,
      "start_timestamp": "01:42:57",
      "start_timestamp_seconds": 6177.838297872339,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6177"
    }
  },
  {
    "text": "by expiration for you to lose money on that. But what a lot of people overlook is even though that is a high probability strategy, you have to keep in mind what the stock path would mean for your strategy. So if the path of the stock was just flat, it traded at 525 through the 60 day period, then you're just going to see steady decay on your 600 short call and you're going to make easy money. But let's say you short that same call in the other path that happens where a different path is the stock goes from 525 and it gaps to 600 the next day. Well, now your assumption on the prior day was, yeah, there's a good chance Netflix is below 600 in the next 60 days, which is a high probability event at that moment. And you could collect a few hundred dollars on that option and you think it's free money. But then if the stock price gaps higher in the very short term after you enter that trade, now you have this massive unrealized loss on the short call. And now you're thinking, well, if it goes to 700, then I'm going to be out a huge amount of money. And so maybe you close that short call because you think that it's not worth the risk anymore. You've already lost a lot. You can't stomach losing anymore. And then right after you get out of that call, the stock",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 94,
      "start_timestamp": "01:44:37",
      "start_timestamp_seconds": 6277.4808510638295,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6277"
    }
  },
  {
    "text": "I'm going to be out a huge amount of money. And so maybe you close that short call because you think that it's not worth the risk anymore. You've already lost a lot. You can't stomach losing anymore. And then right after you get out of that call, the stock price maybe goes a little higher. It gets to 610. But then it goes back to 575, 550 goes up to 575. And at the expiration date of your call, it's below 600. Like you thought initially, but since the stock path was not accommodative at all in the initial period. And since you took such a huge heat, initially, you got shaken out. So I think it's to look at an option position or a particular trade. Instead of just looking at like, here's the max loss, here's the max profit, like here's the probability of profit. That's all that expiration. You have to think about what can happen before expiration, which is the stock price path. And what will be your reaction to those movements? And I think thinking about the particular path that the stock price can take, I think it can help you understand the risk and kind of looking go wrong. As opposed to just saying Netflix is at 525, there's really had probabilities that it's going to be below 660 days. So I'm going to sell the short 600 to be easy money. You could be right about your assumption. But what happens in",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 94,
      "start_timestamp": "01:46:17",
      "start_timestamp_seconds": 6377.123404255319,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6377"
    }
  },
  {
    "text": "and kind of looking go wrong. As opposed to just saying Netflix is at 525, there's really had probabilities that it's going to be below 660 days. So I'm going to sell the short 600 to be easy money. You could be right about your assumption. But what happens in between entry and expiration? And how do you react? That can that can be a wild ride and it can be so. I honestly are prepared for. I absolutely love that example. I really do because I also think a lot of people when they're setting up a higher probability trade, let's just say that was 20 delta, whatever it is. And if you think about a lot of people forget the probability of a touch, which is exactly that. There's a pretty good likelihood at some point your option is going to be underwater. And exactly like you said, even though your entire long term assumption does in fact play out that shorter term touch assumption or just calculation also tends to play out. And if you find yourself in that scenario where you're not ready to see your position underwater and then what that actually looked, I love that. I really do because a lot of people, it seems like they're just so focused on the probability when they enter. And then what that looks like at expiration and the money they're going to make. They forego the interim, I think that's a really good conversation. The other",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 94,
      "start_timestamp": "01:47:56",
      "start_timestamp_seconds": 6476.765957446809,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6476"
    }
  },
  {
    "text": "that. I really do because a lot of people, it seems like they're just so focused on the probability when they enter. And then what that looks like at expiration and the money they're going to make. They forego the interim, I think that's a really good conversation. The other thing that my mentor talks a lot about is expectancy because everybody wants to talk about probability profit. Everybody wants to talk about the likelihood of different things happening. But that's like that's half of the equation that matters to you. It's not that it doesn't mean anything. Exactly. And like everybody wants to obsess over these different metrics. And like he always says, he doesn't get it. And I'm always, I question him a lot on it. And he's like, at the end of the day, you know, the likelihood of something matters 50. The other is what is your average PNL attached to those likelihoods? Because like you're saying right there, if you're getting shaken out on a really low paying but high probability trade, typically really poor expectancy. Because as soon as you get that move against you, it's going to wipe out eight, 10 trades. And then you know, you're kind of sitting there holding that. I find that to be a really uncommon conversation with people because they don't like to think through that in terms. It's, I like that. I like that you bring that up. Another example would be, I think, I think",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 94,
      "start_timestamp": "01:49:36",
      "start_timestamp_seconds": 6576.408510638298,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6576"
    }
  },
  {
    "text": "then you know, you're kind of sitting there holding that. I find that to be a really uncommon conversation with people because they don't like to think through that in terms. It's, I like that. I like that you bring that up. Another example would be, I think, I think talking about stock price paths is a very interesting thing. And this is something that you kind of, you'll read about if you read about like more advanced option pricing, documents, stuff like that, or you get into the more academic side of things I should say. And you feel like really deep on how these things work. But the path is like, that's everything in optistry. What could happen before expiration? And that's kind of where option prices get their their prices from. One of the, I think it's called the binomial tree is one of the pricing. So basically, it's like, here are all the potential paths of the stock through between now and expiration. And if those paths or each path is successful, here is what the option price will be. And basically, it takes all of the different potential paths. And then basically takes like a weighted average of option price values. And that's the option price. Sheldon talks. So I think that's like a very, that's a very crude way of explaining it. And if there's anybody who is effective, much more specific, like with that knowledge and they understand exactly how that works, then",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 94,
      "start_timestamp": "01:51:16",
      "start_timestamp_seconds": 6676.0510638297865,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6676"
    }
  },
  {
    "text": "weighted average of option price values. And that's the option price. Sheldon talks. So I think that's like a very, that's a very crude way of explaining it. And if there's anybody who is effective, much more specific, like with that knowledge and they understand exactly how that works, then maybe there are some holes in what I just said, but that's like, there's like one, there's one that's one way to price and option is like, yeah, I feel like all the potential paths based on the probability. And then you take the probability weighted value of that option at each one of those paths. And then that's the option price. Yeah. But as I was going to say earlier, another example would be if you're extremely bullish on a stock and you think it's going to go up, a lot of people are gravitating towards a short term option, maybe seven days out and they'll buy the item when you call. And let's say you put, you know, 10 of your account into that trait, which is obviously a large percentage for much recreation. And over the next seven days, like the stock phrase kind of transpired, maybe gets closer to your straight, but it expired out of the money. And therefore, you just lost 10. And then the next week, now the stock phrase to shot higher and your initial outlook was completely accurate, except you just had the timing wrong. And another way to say is",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 94,
      "start_timestamp": "01:52:55",
      "start_timestamp_seconds": 6775.693617021277,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6775"
    }
  },
  {
    "text": "gets closer to your straight, but it expired out of the money. And therefore, you just lost 10. And then the next week, now the stock phrase to shot higher and your initial outlook was completely accurate, except you just had the timing wrong. And another way to say is that the stock price path over the duration of your trade was not specific enough. And you didn't get that part of it right. And therefore, you were right overall, but you were wrong with your trade. And obviously, you'd have to kind of match up your time frame with your outlook. But that's again, you can still miss out, regardless of what time frame you choose. And so that's kind of how I think when I think about the more speculative plays, because I'll admit, like, if I'm not trading a specific trading plan with the rules all laid out, which is basically the SP 500 butterfly strategy. That's a short-term strategy, because the entry is 60 days out. I know exactly how I'm going to size it relative to the account. I know exactly what is going to trigger the trade to be closed. And then I know exactly when I'm going to re-enter the trade. So that's not, it is speculative still, because it still requires the market to accommodate the strategy. But every single trade is managed exactly the same, right? The sizing for each trade is exactly the same. And so it's a very easy",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 94,
      "start_timestamp": "01:54:35",
      "start_timestamp_seconds": 6875.336170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6875"
    }
  },
  {
    "text": "exactly when I'm going to re-enter the trade. So that's not, it is speculative still, because it still requires the market to accommodate the strategy. But every single trade is managed exactly the same, right? The sizing for each trade is exactly the same. And so it's a very easy strategy to follow over a one year, two year, three year period. And if you are going to allocate like a specific amount of your account to an active strategy like that, I think it has to be rules based just so you can number one keep your sanity. But also, if you have consistency with how you manage the position, and especially if you've done back testing and you've seen some encouraging results from that, even though it's not same, that's better than just choosing 10 different stocks every month, choose your prediction, and then structure all these different types of strategies around your predictions. And they're all differently sized. You're managing them all different. Then at the end of the day, whether you're successful or not, you don't know if it was luck or if it was just from discipline. So that's kind of like the really long answer. This is still on the how do you choose trade thing, I think. But yeah, so like if it's outside of a predetermined system with rules, then I'm just fully understanding of the fact that I'm speculating. You just have to accept that. I talk a lot about like",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 94,
      "start_timestamp": "01:56:14",
      "start_timestamp_seconds": 6974.978723404255,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6974"
    }
  },
  {
    "text": "answer. This is still on the how do you choose trade thing, I think. But yeah, so like if it's outside of a predetermined system with rules, then I'm just fully understanding of the fact that I'm speculating. You just have to accept that. I talk a lot about like trading plan and strategy outlines for that exact reason, because I always tell people unless you learn to like identify, monitor, and control variables, one, you can't replicate, and two, you can't make adjustments in any sort of calculated manner to see how things go. So the way that I have my personal portfolio broken out is I call them core holdings, which is probably exactly what you would assume it to be. And then I have a speculative portion. And in the speculative portion, there's a certain set of strategies that I'll apply, and I have strategy outlines for all of them for that exact reason, exactly what you're talking about. Because the shotgun blast leads to whatever results it's going to lead to, and then who knows what it will be next time. Yeah, I think that's a great way to learn is to experiment a lot and do a lot of that and be very active. But I think if you really want to use options systematically, and you want to like a lot of people want to trade options for a living, for income, that's the case. You're not going to do that by just doing",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 94,
      "start_timestamp": "01:57:54",
      "start_timestamp_seconds": 7074.621276595744,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7074"
    }
  },
  {
    "text": "do a lot of that and be very active. But I think if you really want to use options systematically, and you want to like a lot of people want to trade options for a living, for income, that's the case. You're not going to do that by just doing all random strategies and coming up with your own specific predictions each week or each month. It's not going to happen because that requires you to be consistently predicting short-term stock price movement, which nobody can do that consistently. And the shorter time you go, the more uncertain it is with whatever your prediction is. So if I say the market's going to go up tomorrow versus the market's going to go up over the next 10 years, there's a big difference between those two statements. The shorter the term, the more it is like gambling, I feel. And if you are really, really active without a plan, I also think that is gambling. Because unless you have a very strict plan for each strategy that you're trading and you're sizing them all the same, then you can actually figure out, all right, this strategy, I manage them all the same, my size them all the same, my results were X. Then you can actually reverse into new that and study the performance. Much more so than if you have 20 different trading strategy and you're using, you have 20 different stocks and you're managing them all different ways and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 94,
      "start_timestamp": "01:59:34",
      "start_timestamp_seconds": 7174.263829787234,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7174"
    }
  },
  {
    "text": "same, my size them all the same, my results were X. Then you can actually reverse into new that and study the performance. Much more so than if you have 20 different trading strategy and you're using, you have 20 different stocks and you're managing them all different ways and your size and the mother the way. It's going to be much harder to attribute success or fail to one single point. Yeah, that's one of the things that I think is people mature as traders, they start to identify the sustainability of what they're doing. When I was in college, I used to really enjoy trading forex and I was pretty good at it. And then as I started my career in the Marine Corps, I stopped trading forex and it was weird to walk away from something I was doing well at. But then when I did the post mortem on it, I realized the amount of time it was taking me to adequately research what I felt comfortable doing before I was placing trades. I was like, this isn't sustainable man. There's no way I want or probably can continue this. And that's again, when I kind of came across momentum, I had a conversation with them, and they was just like, stop worrying about direction, start figuring out how to place trades and work around them based on money management, like I said before. And it's exactly like you're saying, like if you're trying to consistently,",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 94,
      "start_timestamp": "02:01:13",
      "start_timestamp_seconds": 7273.906382978723,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7273"
    }
  },
  {
    "text": "of came across momentum, I had a conversation with them, and they was just like, stop worrying about direction, start figuring out how to place trades and work around them based on money management, like I said before. And it's exactly like you're saying, like if you're trying to consistently, yes, short-term returns, you're just leaving it up to chance, pure chance. And that's something that he talks a lot about. And I share on his behalf where when I was like in the phase where I was aggressively growing my account, I tell people I target at least 15 return career. Sometimes that will underperform the SP 500. A lot of other times it will outperform the SP 500, kind of just depend on where things lie. And what he always taught me is once you're starting to get closer to retirement to draw on this account, he's like, you're out of your mind if you're going to continue using that 15 as your planning variable, like especially when you depend on your income. So he's like, when you're doing your planning factor, make sure you have enough money that you can crank that all the way down to five, six percent somewhere in there and still get the amount of money you want per month in order to live off of it. And that was just an eye-opening concept because 15 per year is really good. It's nothing astronomical, like you said, there's a duty of 30 for",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 94,
      "start_timestamp": "02:02:53",
      "start_timestamp_seconds": 7373.548936170213,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7373"
    }
  },
  {
    "text": "five, six percent somewhere in there and still get the amount of money you want per month in order to live off of it. And that was just an eye-opening concept because 15 per year is really good. It's nothing astronomical, like you said, there's a duty of 30 for like 15 years. But it's modest and it's something that's attainable. And it was weird to me to hear him kind of even scold that once you're trying to reliably draw on it. So I think it reinforces the point you're making that you're trying to trade in a way that you have to be correct and you need to perform well in order to get what you need to get can be one very stressful and then two, set you up for failure in a pretty big way. Right. You got to have you got to have a plan. If you look at if you look at any professional trader, meaning they trade at a trading firm, they have a trading plan like 99. There's probably very few traders that you'll talk to that don't have any resemblance of a plan. And they're just successful a year after year just from just from their predictions that are coming out of their head. Yeah. There has to be some sort of plan as the backbone. If you are going to trade very actively and especially if you're going to put like a serious amount of capital into those strategies. Yeah.",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 94,
      "start_timestamp": "02:04:33",
      "start_timestamp_seconds": 7473.191489361701,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7473"
    }
  },
  {
    "text": "just from just from their predictions that are coming out of their head. Yeah. There has to be some sort of plan as the backbone. If you are going to trade very actively and especially if you're going to put like a serious amount of capital into those strategies. Yeah. Yeah. Something that obviously I know that we're well over now and like I said, I really do respect your time. So thank you. Something I'm really curious about on that same vein though in your thought process. I get the sensation that some people when they start trading and they're applying their time, they feel like they deserve a certain return because they're applying that time. I'm sitting in front of the computer all of this time. I should get extra turn at the end of the year. And like we've both been talking about, again, like I read a lot of white papers from MIT University of California and everything unanimously in terms of those studies says the more you touch the computer, the lower the average return is for those folks. So I'm curious what your thoughts are in having those conversations with those people because that's something I find myself doing a lot like trying to have a conversation to save people from themselves and essentially letting them know that you don't deserve shit. And at the end of the day, like the more you touch the computer, the worse off you are, but a lot",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 94,
      "start_timestamp": "02:06:12",
      "start_timestamp_seconds": 7572.834042553191,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7572"
    }
  },
  {
    "text": "something I find myself doing a lot like trying to have a conversation to save people from themselves and essentially letting them know that you don't deserve shit. And at the end of the day, like the more you touch the computer, the worse off you are, but a lot of people refute that. Have you had a conversation like that with anybody? I'm curious how you'd approach that dialogue. I've had people through email correspondence that will say that they've been emailing me for a while. They've been learning for probably over a year in some cases. And they kind of get discouraged because they feel like, although say things like, you know, there's so much to this option stuff, like it's really, really a lot. And it's true. And I'm not sure if you're probably familiar with the Dunning Kruger effect, which is essentially, as soon as you get involved in something new, you feel like you're a genius and you know everything. And then that's like the peak of the introduction phase of learning something new. And then before you learn, then it goes back into like negative territory, which is like, wow, I don't know shit. I don't know shit. Yeah. And then as you continue to get more experience, you get closer to that initial baseline where you realize that you know a lot, but you still are, you're still acknowledging the fact that there's more to know. Yes. So I think option straining is",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 94,
      "start_timestamp": "02:07:52",
      "start_timestamp_seconds": 7672.476595744681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7672"
    }
  },
  {
    "text": "I don't know shit. Yeah. And then as you continue to get more experience, you get closer to that initial baseline where you realize that you know a lot, but you still are, you're still acknowledging the fact that there's more to know. Yes. So I think option straining is a perfect example of that because as soon as you come out of the gates and you have like your first few months of learning, you feel like you're on top of the world and you know everything and you're going to be rich. And then months later or a couple of years later, you're continuing to learn. And then you realize, wow, like everything in the past that I thought was a holy grail strategy. It turns out that this is very, very difficult. There's a lot to know before you can even get to a playing field where you're not making, you're not losing money from mistakes or not knowing something. You're losing money because you're wrong. Yes. And options is one of the most humbling things because you can know everything there is about option straining and still that does not guarantee that you're going to make it. Still be wrong. And that's a very difficult thing to swallow for most people. Yeah. But it's true. Like there's just because you know everything about options and how they work, the next step is to actually implement them in scenarios where they profit. And there's no guarantee that",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 94,
      "start_timestamp": "02:09:32",
      "start_timestamp_seconds": 7772.11914893617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7772"
    }
  },
  {
    "text": "it. Still be wrong. And that's a very difficult thing to swallow for most people. Yeah. But it's true. Like there's just because you know everything about options and how they work, the next step is to actually implement them in scenarios where they profit. And there's no guarantee that you can do that consistently over time. And so that's another reason why I focus most of my savings into passively investing because I know that over a long period of time, compound interest can grow whatever I put in now hundreds of times, thousands of times in some cases depending on whatever you put it into. But I don't want to risk having to be right about every prediction that I make knowing that I'm going to be wrong on a lot of predictions. And I don't want to structure my financial future around having to be right consistently in the short term over a long period of time. It's just too stressful for me. So yeah, like options is the more you know the better because you can avoid you can avoid catastrophic losses through mistakes or just not knowing something. But there is a certain amount of time you have to put in before you get to a point where you're pretty comfortable that you know like pretty much all there is that you need to know. There's obviously always going to be more to learn. Yeah. And like I consider myself to be an expert, but",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 94,
      "start_timestamp": "02:11:11",
      "start_timestamp_seconds": 7871.76170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7871"
    }
  },
  {
    "text": "time you have to put in before you get to a point where you're pretty comfortable that you know like pretty much all there is that you need to know. There's obviously always going to be more to learn. Yeah. And like I consider myself to be an expert, but I know that I don't know everything. There's always more to learn. But once you get to that point where like you know everything or as much as you need to know to actually implement these things whenever you see fit and you know what's going to happen given certain scenarios with this position, it still doesn't guarantee that you're going to make money. And that's a difficult thing to digest, but it's true. Yeah, it's I like to talk a lot about it in terms of you know like the practical understanding versus the scholastic understanding. So a lot of people can go really far in their scholastic understanding of options or whatever they're doing. But unless you learn how to like practically apply it, it's you know just a scholastic understanding. And you know because things scholastically should work out x, y and z way, it doesn't mean in a practical sense that it's going to. So I think that it's honestly really impressive on your end that you kind of acknowledged and looked through the way that you trade and said yes, you know I'm an option trader, but financially it literally makes sense for me to",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 94,
      "start_timestamp": "02:12:51",
      "start_timestamp_seconds": 7971.404255319148,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=7971"
    }
  },
  {
    "text": "in a practical sense that it's going to. So I think that it's honestly really impressive on your end that you kind of acknowledged and looked through the way that you trade and said yes, you know I'm an option trader, but financially it literally makes sense for me to have this kind of two prong approach with passive investments and option. But I seriously respect that so much because a lot of people that start options trading, I mean like I said, I trade pretty much only options. And there's just so many of us that I talk to they again think that well if I just continue to trade, I'll pick it up and I'll start making money. And you know for a lot of people they just are throwing away their future wealth chasing something that they're just not performing on. So I think that's really awesome. And I think the situation you want to avoid and this is another reason why I buy, you know I'm buying stocks and buying Bitcoin as I'm a Bitcoiner. But I'm buying these things and investing long term because I don't want to be in a situation where if I was only trading options and in a year the stock market goes up 20 and I happen to lose money trading options, then that's a bad situation to be in because it's horrible because you don't want to see the market go up 20 when everyone else made 20 and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 94,
      "start_timestamp": "02:14:31",
      "start_timestamp_seconds": 8071.046808510638,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8071"
    }
  },
  {
    "text": "was only trading options and in a year the stock market goes up 20 and I happen to lose money trading options, then that's a bad situation to be in because it's horrible because you don't want to see the market go up 20 when everyone else made 20 and you lost money because you didn't have any slice of that. And so that's that's kind of another reason why I'm structuring that way and I just think it's I think it's irrational for me to think that I am so smart where my predictions are always going to be true. Yeah. That's why I with the majority of my free savings I am investing that long term. But like talking about rational versus irrational, like I think the most rational thing for me to do or most reasonable thing for me to do will be to take all of my savings and just put it in a passive index fund and just put all of that money into the next fund and just let it sit for whatever the rest of my life and let that grow. But just because I think that is the most rational thing for me to do doesn't mean I'm going to not be irrational with a small portion of my money. I enjoy making predictions. I enjoy trading options and I enjoy you know learn or implement the things that I've learned over the past two years. So like just because just because",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 94,
      "start_timestamp": "02:16:10",
      "start_timestamp_seconds": 8170.689361702128,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8170"
    }
  },
  {
    "text": "me to do doesn't mean I'm going to not be irrational with a small portion of my money. I enjoy making predictions. I enjoy trading options and I enjoy you know learn or implement the things that I've learned over the past two years. So like just because just because there's like a and obvious like rational approach doesn't mean I'm going to actually follow that. And if that's just human nature that's not just with trading that's with everything. Like I think everyone can agree the most rational thing for me to do would be to get up every day and I should probably work out every day exercise every day because that's going to be good for me long term. But even though people know that they don't do that and so there's a you have to understand and like we're all human and we're going to do things that are irrational and it's fine. It's a really fun conversation and kind of hearing that side of things because I am the dude that wakes up every day and works out because I know I'm supposed to but I'll also eat I have beats the last night which I know I'm not supposed to do. It's that same thing right? Why would I go? I'm like a thousand calories of Chinese food actually. Yeah. I'm glad I ordered orange chicken hands general so it's chicken because I have leftovers that I get right and then they got it's",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 94,
      "start_timestamp": "02:17:50",
      "start_timestamp_seconds": 8270.331914893617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8270"
    }
  },
  {
    "text": "I know I'm not supposed to do. It's that same thing right? Why would I go? I'm like a thousand calories of Chinese food actually. Yeah. I'm glad I ordered orange chicken hands general so it's chicken because I have leftovers that I get right and then they got it's now I get to indulge two days in the row. That's beautiful. It's only because only supposed to be a cheap Sunday. Yeah, but I mean I also I would argue that by continuing to trade options I mean who knows man like you absolutely can continue developing your approach and just find the next thing that works for you because something that my mentor always told me is like when you're retired you can't draw monthly income via trading stocks. Not consistently so he's like you have to understand a way to use your capital to be if you want to draw for income right. But again like by continuing to trade options no matter what we're still developing a skill set that in the future very likely can be very helpful to us. Yeah that's a great that's a great point that's a positive point. I feel like we've talked about a lot of maybe discouraging things today and I don't want to be discouraging whatsoever but what you just said is perfect because as I just said to you that I'm not trading options every single day I'm not like super super active with it but I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 94,
      "start_timestamp": "02:19:29",
      "start_timestamp_seconds": 8369.974468085105,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8369"
    }
  },
  {
    "text": "we've talked about a lot of maybe discouraging things today and I don't want to be discouraging whatsoever but what you just said is perfect because as I just said to you that I'm not trading options every single day I'm not like super super active with it but I do do it but there is there's always value and having knowledge. So there's this quote that my brother said he said fortune favors the prepared mind. I think this this guy Lewis Lewis Pest Store said it initially and now I'm now that's how I close out my newer YouTube videos. Perfect. Portion favors the prepared mind. So even though it may not be in your best interest to be trading options like 30 times a day or whatever it is or using them actively and just because you know the kind of the odds are stacked against active traders like more active you are the worse you'll do statistically speaking it doesn't mean that it's a bad thing to learn something because for example let's say you give up on options you don't know how options work because they're too complicated or you hear this conversation and are you're discouraged? They're like yeah fuck that. And then you just you don't you don't learn about options and then let's say you have a million dollar stock portfolio that grows immensely over over a multi-decking period and then there's something that happens in the world where you have this",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 94,
      "start_timestamp": "02:21:09",
      "start_timestamp_seconds": 8469.617021276596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8469"
    }
  },
  {
    "text": "you're discouraged? They're like yeah fuck that. And then you just you don't you don't learn about options and then let's say you have a million dollar stock portfolio that grows immensely over over a multi-decking period and then there's something that happens in the world where you have this prediction maybe that you want to protect against some very unfortunate outcome with your stock portfolio. So one thing you could do you could purchase put options in the SP 500 index and that would effectively hedge your stock portfolio and if you understand the way that you could structure that to protect yourself against catastrophic loss if you're correct about this prediction but you only give up a small portion of your profits if you're wrong then if you understand options you know how to do that exactly you can structure that trade but if you have no idea how options work then there's no way you could ever use them in any situation that could benefit you when you could be implementing them with some sort of prediction that you have. And so I think there's a lot of value in knowledge I'm a huge bookworm myself I love learning I love reading about different perspectives just because I think anything that can broaden your perspective or see something from a different angle I think that is immensely valuable and so to go along with that I think there's excuse me I think there's a ton of value",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 94,
      "start_timestamp": "02:22:49",
      "start_timestamp_seconds": 8569.259574468084,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8569"
    }
  },
  {
    "text": "love learning I love reading about different perspectives just because I think anything that can broaden your perspective or see something from a different angle I think that is immensely valuable and so to go along with that I think there's excuse me I think there's a ton of value in understanding active trading having experience with active trading knowing how options work knowing how futures work how the financial markets work in general I think understanding all those things it's never going to be a bad thing to know those things because when the time comes if you are paired with this knowledge then there could be times where you say I know exactly what I need to do and I need to do it tomorrow because I already I don't need to learn I already know everything that I need to know for this particular play and here's what I'm going to do and I'm going to put this trade on and that's it you know if you don't have the knowledge you never spent the time learning about something then you're not going to be able to identify that circumstance yeah you can't open that door for yourself yeah I think I think understanding options is hugely valuable and you learn a ton about financial markets and through the process of learning options you learn about yourself you learn about you know the the trading kind of psychology like everything that goes along with trading yeah I",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 94,
      "start_timestamp": "02:24:28",
      "start_timestamp_seconds": 8668.902127659574,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8668"
    }
  },
  {
    "text": "yourself yeah I think I think understanding options is hugely valuable and you learn a ton about financial markets and through the process of learning options you learn about yourself you learn about you know the the trading kind of psychology like everything that goes along with trading yeah I think a lot of value in all those things especially if you get to even if it's even if it's a thing where you get to a point where you realize you know maybe I don't want to be an active trader maybe I do want to be a passive investor but if you learn those things sooner than later it's going to be better than learning them later and it's based on you know your experience so yeah it's easier for you to deploy with conviction right like I'm so I'm so grateful that I have all the experience that I have because if I was if I didn't have a lot of experience and investing or especially active trading with options maybe I would just be getting into it today and maybe I have you know a hundred thousand dollars saved up that I saved up over the last 10 years yep and now I'm just starting to learn about options with no prior experience or knowledge but I have more money now and I'm learning with a larger a larger stack of cash and now I make these mistakes let's say I wait about 10 years of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 94,
      "start_timestamp": "02:26:08",
      "start_timestamp_seconds": 8768.544680851064,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8768"
    }
  },
  {
    "text": "last 10 years yep and now I'm just starting to learn about options with no prior experience or knowledge but I have more money now and I'm learning with a larger a larger stack of cash and now I make these mistakes let's say I wait about 10 years of saving because I didn't understand how these things work and that's not a situation you want to be in so I think learning learning is learning about these things is going to always be valuable because at the very least you can avoid land mines and knowledge and experience is always a good thing no matter what so yeah yeah and I mean I think just like you're saying exploring different perspectives and you know life use and whatnot it's literally the entire purpose of this entire segment is exactly that because I do find a tremendous of value in it and I know when I first started trading options like most I was struggling and not doing very well and then when I was able to like drill down mentor for like literally force me to write a trading plan to paper trades like take this shit seriously then for me I've been just so fortunate with the way that it is changed my trajectory and it's not from you know any sort of pure luck it's just from like taking the fucking time to like truly sit down and understand these things and how I can apply them",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 94,
      "start_timestamp": "02:27:48",
      "start_timestamp_seconds": 8868.187234042553,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8868"
    }
  },
  {
    "text": "for me I've been just so fortunate with the way that it is changed my trajectory and it's not from you know any sort of pure luck it's just from like taking the fucking time to like truly sit down and understand these things and how I can apply them and I think for a lot of people you know no matter in what capacity you choose to apply you know something like options or whatever there's just a lot of utility and then whether you're like me and you trade them exclusively or like you and you trade them as a component of a larger portfolio biggest thing about trading and I think dovetailing off your psychology comment man it's individual to the person man everybody works differently you have an incredible amount of self-awareness so do I in the sense that like I know I don't know fucking shit so I just try to do what I know and learn as much as I can and that's generally my approach and like your self-awareness has led you to a place where you know you can get sleep now you're comfortable with what you're doing stuff like that because there's so many people I mean you saw the kid that killed himself because of some shit that wasn't even real right you know what I mean like just it's just insane so I totally agree with you that you know just taking the time to get the education is",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 94,
      "start_timestamp": "02:29:27",
      "start_timestamp_seconds": 8967.829787234043,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=8967"
    }
  },
  {
    "text": "there's so many people I mean you saw the kid that killed himself because of some shit that wasn't even real right you know what I mean like just it's just insane so I totally agree with you that you know just taking the time to get the education is super important and help pull yeah minute as a as a final note on that I think having experience with active trading and having experience with options but mostly just like having experience being super acting in the markets can make you a much better passive investor as well because it can teach you it can teach you about the impulses that you feel in certain situations and then it can teach you that the best thing to do is probably nothing you know like with your option positions you could you could be swayed to deviate from your trading plan because of some sort of term movement and when in reality you know that you have to follow the trading plan and you can't you shouldn't touch it right so yeah from the traditional investing long-term investing perspective if you are buying stock let's say you buy this company that you love and then the next month stocks down 30 if you have a lot of market experience and active trading experience then you'll know that things don't always go according to plan right in fact more often than not they don't go according to plan and if you're",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 94,
      "start_timestamp": "02:31:07",
      "start_timestamp_seconds": 9067.472340425531,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=9067"
    }
  },
  {
    "text": "that you love and then the next month stocks down 30 if you have a lot of market experience and active trading experience then you'll know that things don't always go according to plan right in fact more often than not they don't go according to plan and if you're equipped with that mindset I think it can be very informing and it can help you make better decisions overall so I definitely attribute whatever future success I have with passive investing I think a large part of that success is going to be attributed to my experiences with more active approaches so I think having the active approach or having the active experience can make you a better long-term investor in more capacity it's powerful honestly I've never I truly have never sat down to think of it that way and that's a really powerful comment and I literally as I hear you talking about I couldn't agree with the sentiment more I think that that makes a ton of sense you know so the other day experience from saw that's it fact never never a bad thing to have knowledge or experience so yeah don't don't let this conversation discourage you if you're an aspiring office trader we basically we we kind of just talked talk through years and years of experience and kind of the psychological rollercoaster that you have over that a whole experience too so hopefully people that are just getting started or maybe just",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 94,
      "start_timestamp": "02:32:47",
      "start_timestamp_seconds": 9167.114893617021,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=9167"
    }
  },
  {
    "text": "conversation discourage you if you're an aspiring office trader we basically we we kind of just talked talk through years and years of experience and kind of the psychological rollercoaster that you have over that a whole experience too so hopefully people that are just getting started or maybe just a couple of years in hopefully those people can can learn from the things that we're talking about today yeah man and you know like I said I seriously can't thank you enough for your time it's super dope talking with you about this stuff I'd love to do a follow-on session with you at some point there's definitely a lot more than I want to explore with you but until next time you know like I said thank you so much for your time looking forward to chat with you again yeah for sure thanks for having me all right brother we'll catch you later sounds good have a good rest of your day yeah",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "",
      "duration": 6187.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 94,
      "start_timestamp": "02:34:26",
      "start_timestamp_seconds": 9266.757446808511,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=9266"
    }
  }
]