[
  {
    "text": "all right man we are on what's up chris not much how's it going absolutely great i don't know if i told you my uh my brother's name is chris is it except i call him sasquatch um he's a little baby yeah he's a big old dude i'm i mean i'm not small i'm like six foot 220 ish and he just dwarfs me he's like six three you know 260 almost he's just a big old boy so i'll call him sasquatch he's not very hairy though it's like a hairless sasquatch hey man anything you do to get a more unique name i think i'm all for it one of the my name chris butler and my first and last name are literally both in the top like 100 most common first names and last name oh really i can't i can't get a unique username anywhere there's no username where i could get chris oh yeah i have to you know either or do something that's a little bit more unique and not use my my first and last name so yeah you gotta be like chris butler 99 or yeah exactly usually like my instagram was chris butler22 my email i have an email it just basically has my birthday after uh-huh i totally get it i don't get chris butler at gmail is i love that so also funny caveat on that in um in the marine corps i was the only eric erik",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 0,
      "total_chunks": 96,
      "start_timestamp": "00:00:01",
      "start_timestamp_seconds": 1.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1"
    }
  },
  {
    "text": "was chris butler22 my email i have an email it just basically has my birthday after uh-huh i totally get it i don't get chris butler at gmail is i love that so also funny caveat on that in um in the marine corps i was the only eric erik smalinski except i don't know why but instead of just giving me eric.smolinski at usmc dot mil keep it just my name they made it eric.m which is my middle initial dot smolinski why why would god make this so long man i already got a long long last name and now we gotta have the middle yeah why um cool man so obviously super stuck to have you on the channel like we were just talking about i gave you some context on why i'm doing this you know just the general background and whatnot and you know anybody who's willing to come on and just you know share some time with us is honestly super awesome i get a tremendous amount of super positive feedback from the folks that frequent my channel you know just saying that they're having fun learning and seeing other stuff so obviously thank you for that um i thought obviously good place to start off would be learning a little bit about you you know we didn't dig too far into your background from chicago moved to denver um but i would love to you know dig in your background a little bit",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 1,
      "total_chunks": 96,
      "start_timestamp": "00:01:01",
      "start_timestamp_seconds": 61.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=61"
    }
  },
  {
    "text": "you for that um i thought obviously good place to start off would be learning a little bit about you you know we didn't dig too far into your background from chicago moved to denver um but i would love to you know dig in your background a little bit what got you into investing when did you start is a good place to start um so it's a good question because my freshman year when i went to college my initial major was computer science okay and that's because when i was in high school i played a lot of video games and i was into computers so i thought that i wanted to do something with computers and i also have a very technical mind which it's no surprise that that translates into options because options are a lot of moving parts but my initial major was computer science and i went to arizona state and then about a party school it is a party school okay i did my fair share of partying but i did not leave asu because i couldn't handle the party i did have some friends however that they dropped out of asu because of the partying they just couldn't handle it um but after my first year at asu i kind of i decided to transfer to depaul which is in chicago and when i prior to doing that move i decided that i wanted to change my major to finance and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 2,
      "total_chunks": 96,
      "start_timestamp": "00:02:05",
      "start_timestamp_seconds": 125.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=125"
    }
  },
  {
    "text": "because of the partying they just couldn't handle it um but after my first year at asu i kind of i decided to transfer to depaul which is in chicago and when i prior to doing that move i decided that i wanted to change my major to finance and i can't explain exactly the moment this happened but it was literally just like a weird moment in my life where i woke up one day and my whole mindset was shifted towards finance and i was just like i need to know how money works i need to figure out how investing works yeah because it doesn't matter what kind of money i make in my life like if i don't know what to do with it or the things that i can do with it to grow it and preserve it then i'm going to be screwed yeah so i literally had like an overnight moment where i switched from computer science to finance transfer to depaul and the rest is history so when i was at depaul i got an internship at tastytrade which is a financial network to talk about options trading and stuff like that but i was just in email correspondence with the founder tom sasna and i had been i think or swim right yeah he's co-founder i think co-founder of thinkorswim got it and the other co-founder that started thinkorswim with him is at tastyworks now gotta tell the ceo of tastyworks",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 3,
      "total_chunks": 96,
      "start_timestamp": "00:03:05",
      "start_timestamp_seconds": 185.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=185"
    }
  },
  {
    "text": "but i was just in email correspondence with the founder tom sasna and i had been i think or swim right yeah he's co-founder i think co-founder of thinkorswim got it and the other co-founder that started thinkorswim with him is at tastyworks now gotta tell the ceo of tastyworks got sheridan he and tom were the i think co-founders of thinkorswim they definitely both worked there i'm just not sure if there was another founder but okay um but yeah so i just was in email with him i sent him a couple emails one was about just an options trading question and then i sent him another email that was asking about internships within the finance slash trading industry i wasn't even necessarily asking for an internship at tastytrade but he just kind of skimmed that email i think and then he sent me back another email saying that they had some interns there that would be in a couple months and so he connected me with this other woman that worked at tastytrade i sent her my resume came in for an interview which was literally just kind of like a meet and greet to see righteous personalities yeah exactly yeah like the hardest question he asked me he said uh how are your math skills and i was like i don't know i think they're pretty good like that was the most that was the most technical question i think the interview process is a little",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 4,
      "total_chunks": 96,
      "start_timestamp": "00:04:08",
      "start_timestamp_seconds": 248.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=248"
    }
  },
  {
    "text": "personalities yeah exactly yeah like the hardest question he asked me he said uh how are your math skills and i was like i don't know i think they're pretty good like that was the most that was the most technical question i think the interview process is a little harder these days but i definitely got super lucky with that but it was just kind of a cold email led into an internship and i worked at tc trade for three years from 2013-2016 and then after my stint there i left to start project option which the initial goal was to start a website have a lot of written content grow the website traffic and then sell subscription services or courses on that but then it kind of morphed into a youtube channel because i knew that it would be easier to get exposure on youtube as compared to google search because when you think about right the two there's like there's when i started there was already probably hundreds of websites that had lots of options trading articles and there it was really hard to compete with them but when you looked at the youtube space there were only really a couple of channels that had lots of viewers so i thought that it would be a much easier time getting exposure on youtube as compared to just the written content since there are less people making videos as compared to the blog post type content so",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 5,
      "total_chunks": 96,
      "start_timestamp": "00:05:16",
      "start_timestamp_seconds": 316.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=316"
    }
  },
  {
    "text": "were only really a couple of channels that had lots of viewers so i thought that it would be a much easier time getting exposure on youtube as compared to just the written content since there are less people making videos as compared to the blog post type content so and that kind of led to where i am today so today i'm just focused essentially 100 on youtube okay it's funny because when i started the youtube channel i saw it as a chore like i wanted to focus on the website and the written content interesting but i knew that the youtube channel would be a much easier way to get exposure at least that way theory and so i created written or video counterparts to all the blog posts that i was writing okay and my like my og day one youtube videos were all just horrible like voice over presentations like i would have i'd just be doing sitting here with this microphone yep and i would make a powerpoint presentation i would export the slides as images and then there would be times where i would i'd be talking over like the same slide for two minutes and it would be like all this text like getting static and then me talking for two minutes like which looking back on that i can't believe i even grew on youtube with that format because on youtube engagement is everything and so yeah these days when i",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 6,
      "total_chunks": 96,
      "start_timestamp": "00:06:21",
      "start_timestamp_seconds": 381.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=381"
    }
  },
  {
    "text": "two minutes and it would be like all this text like getting static and then me talking for two minutes like which looking back on that i can't believe i even grew on youtube with that format because on youtube engagement is everything and so yeah these days when i make videos like i'm always trying to have something moving just to get the viewer engaged visually you must have really good content though i mean at the end of the day if that was making you grow even with the you know the clear overhead turn on the projector thing that goes yeah you know i think i think um yeah i think the original growth or the growth that i experienced over the first couple years even with the less engaging video format i think it was just about the content on the back end not necessarily production quality yeah i identify honestly a lot with that because i put zero effort into my production quality and i think everybody knows that i mean it's i tell it to people like this is what's that it's a lot of work yeah and for me like i was telling you i do not identify as a creative person so for me to like i like to use the whiteboard i just jot out my my thoughts and whatnot talk through them and share screenshots and for me that's not work for me that's just how i mentally process things",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 7,
      "total_chunks": 96,
      "start_timestamp": "00:07:24",
      "start_timestamp_seconds": 444.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=444"
    }
  },
  {
    "text": "you i do not identify as a creative person so for me to like i like to use the whiteboard i just jot out my my thoughts and whatnot talk through them and share screenshots and for me that's not work for me that's just how i mentally process things but if i were to do what some of the other channels do which is really gucci like it looks cool but to me that's work i'm not graphically inclined so that's what i also attribute the you know very humble growth that my channel has had is essentially just because the content comes from a good a good place and i know that because i'm not selling anything i couldn't care if you like it or not it's just there for general consumption but that's really interesting i'd love to hear a little bit more about the switch from the focus on your website to youtube when did you make that jump um i think let's see so i think 2019 was the first year this was a literal new year's resolution i had a business new year's resolution that's coming into 2019 i said for the entirety of 2019 i'm doing nothing on the website i'm focusing all of my energy on making my videos better so higher production quality i learned kind of like the post production of doing animations and graphics and stuff like that which the first couple iterations of that were absolutely terrible sure",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 8,
      "total_chunks": 96,
      "start_timestamp": "00:08:25",
      "start_timestamp_seconds": 505.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=505"
    }
  },
  {
    "text": "2019 i'm doing nothing on the website i'm focusing all of my energy on making my videos better so higher production quality i learned kind of like the post production of doing animations and graphics and stuff like that which the first couple iterations of that were absolutely terrible sure but for 2019 that was the first year and it was a literal business new year's resolution that's dope to spend all of my energy and focus on youtube because i'm a one-man show right and so for me especially like i can be i'm i'm so prone to procrastination and being busy and focused like there's no way i could have a podcast a youtube channel write a blog post and do all that at the same time i just have to focus on one thing and i think well i know so the reason that i that i chose to focus on youtube for that year is because up to that point youtube was kind of like the steady growth curve so like whenever i looked at the analytics it was steadily growing and compared to my website analytics you know it was it was kind of choppy it wasn't it wasn't growing exponentially like youtube was and so i figured the highest probability bet that i could make would be to focus 100 of my effort on the one thing that i know is growing is growing and if i focus more on that and especially if",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 9,
      "total_chunks": 96,
      "start_timestamp": "00:09:27",
      "start_timestamp_seconds": 567.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=567"
    }
  },
  {
    "text": "it wasn't it wasn't growing exponentially like youtube was and so i figured the highest probability bet that i could make would be to focus 100 of my effort on the one thing that i know is growing is growing and if i focus more on that and especially if i improve the quality of my videos then i think i could kind of pour gasoline on that growth so to speak yeah yeah that's what i did that's absolutely awesome i love that because i i also had a blog for a little while that was just you know general hobby and what i realized is i was talking to some of my friends nobody wanted to sit there and read it you know what i mean and one of the things people really enjoy about youtube is that if they're doing something else and they want to partially pay attention it's available to them they can just let it run and you know digest what they hear and if they want to go back and like really focus on it i think it's really awesome that you did that and you kind of identified that obviously you're really savvy it comes to identify business opportunities that's that's super awesome when you first started general question did it still feel like a chore working on youtube slash and i'm asking for me obviously none of my viewers have they don't care um but i'm curious personally like when did",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 10,
      "total_chunks": 96,
      "start_timestamp": "00:10:32",
      "start_timestamp_seconds": 632.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=632"
    }
  },
  {
    "text": "savvy it comes to identify business opportunities that's that's super awesome when you first started general question did it still feel like a chore working on youtube slash and i'm asking for me obviously none of my viewers have they don't care um but i'm curious personally like when did it start feeling like fun for you to work on youtube channel compared to the website um that's a good question i honestly can't i can't pinpoint a specific moment but i think i think just generally after i started youtube and i started seeing because the youtube analytics are absolutely insane as i'm sure you know i i tell you what man i'm too dumb to use it i like i literally have one of my best friends you only need to focus on a couple things youtube they you know they kind of guide you and show you yeah like when you when you log in watch time's the first thing they should it's all about watch time but i think it was after i had maybe a few months experience probably about a year experience because in my first six months i think i added maybe three to four hundred subscribers and then second six months i added maybe a thousand fifteen hundred yeah so like every the every interval of time or chunk of time like going forward was exponential in terms of growth compared to the same amount of time in previous history so like",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 11,
      "total_chunks": 96,
      "start_timestamp": "00:11:25",
      "start_timestamp_seconds": 685.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=685"
    }
  },
  {
    "text": "to four hundred subscribers and then second six months i added maybe a thousand fifteen hundred yeah so like every the every interval of time or chunk of time like going forward was exponential in terms of growth compared to the same amount of time in previous history so like the first months was 300 subscribers the next six months where you know a thousand subscribers or whatever it is and it just continued to grow exponentially and so once i started to see those trends i think i became much more interested in youtube got it and then i think after i turned on monetization because i actually i didn't turn on monetization or ads on my videos right when it was available to me i think i actually because i assumed that the money that was going to be made from my youtube channel would be so low that it wouldn't even matter right and then i was surprised when i turned on monetization i was like oh this is actually like like my first my first paycheck from youtube was like a couple hundred bucks yeah so like well that's a pretty substantial amount of money because at the time my first year when i started project option i made ten thousand dollars right and the second year was more than that but it still wasn't like it wasn't a lot of money right right though three hundred dollars in one month in my in my first",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 12,
      "total_chunks": 96,
      "start_timestamp": "00:12:27",
      "start_timestamp_seconds": 747.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=747"
    }
  },
  {
    "text": "at the time my first year when i started project option i made ten thousand dollars right and the second year was more than that but it still wasn't like it wasn't a lot of money right right though three hundred dollars in one month in my in my first paycheck from youtube like that was a good amount of money yeah that's decent um so i was super surprised to see the amount of money that could be made from monetization and so that also started to get me more and more interested and i love that just for people who maybe have no idea about youtube ad revenue and stuff like that um it's very niche dependent so like if you have a youtube channel and you are getting like tens of millions of views on all of your videos then that means you have a very broad audience right basically you're catering to everyone you just have you just have viral youtube content that everybody wants to watch but for advertisers if you have a really broad audience then there's not gonna there's not gonna be as much competition to actually target a specific audience because they can't use your channel to really get to the audience they want right but in something like finance since all the people who are watching options trading videos or investing videos that's a much more specific audience and the lifetime value of acquiring a customer in finance is thousands of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 13,
      "total_chunks": 96,
      "start_timestamp": "00:13:30",
      "start_timestamp_seconds": 810.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=810"
    }
  },
  {
    "text": "can't use your channel to really get to the audience they want right but in something like finance since all the people who are watching options trading videos or investing videos that's a much more specific audience and the lifetime value of acquiring a customer in finance is thousands of dollars right and so if you can if you can acquire that customer and make those thousands of dollars in some case tens of thousands of dollars over the lifetime of that customer then you can naturally spend hundreds of dollars to acquire a customer right and so since the lifetime value of the customer is higher in finance and investing then you can pay more to acquire the customer and so advertising uh competition and advertising spend is a lot higher in finance as it would be in something that's much more broad where you can't figure out the audience and so that trickles down to the youtube creator because youtube takes uh youtube takes a percentage of what the advertisers pay right to advertising your channel and then you as the creator get the rest so yeah that's it's i mean that's educational for me i honestly didn't know a lot of that because i was in the same boat as you where i didn't bother turning on monetization for some time and then i was talking to somebody about it and they were like dude why don't you just turn it on because they know i work",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 14,
      "total_chunks": 96,
      "start_timestamp": "00:14:32",
      "start_timestamp_seconds": 872.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=872"
    }
  },
  {
    "text": "know a lot of that because i was in the same boat as you where i didn't bother turning on monetization for some time and then i was talking to somebody about it and they were like dude why don't you just turn it on because they know i work with the wounded warrior project no why don't you just turn it on and donate it and i was like yeah you know i'm not sure i thought the same thing it's gonna be really low who really cares and then he's just like dude think of it this way it's no sweat off of the viewer's back like it makes no difference the content you're providing is still completely free to them so you're not you know what i mean you're not changing that paradigm that i i kind of built my channel on and he's like and then you just you know it's passive like just donate it i was like yeah okay and then i i found the same exact thing as you were talking about i was surprised um with the ad revenue it's actually really cool because i was able to make a donation that was for building a ramp at a dude's house that was in a wheelchair he literally sent a video to one of the segments of him getting in his house because it had stairs and he literally would roll the real wheelchair backwards until he hit the stairs and like",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 15,
      "total_chunks": 96,
      "start_timestamp": "00:15:40",
      "start_timestamp_seconds": 940.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=940"
    }
  },
  {
    "text": "was for building a ramp at a dude's house that was in a wheelchair he literally sent a video to one of the segments of him getting in his house because it had stairs and he literally would roll the real wheelchair backwards until he hit the stairs and like muscle himself up four stairs and he was good at it but we're like you know we could probably give this dude a ramp like so he doesn't have to play that game so let's it's fascinating that background you shared because like i said ignorant to all of it knew nothing so that's cool man so like all these little things that i was learning about especially like as they pertain to youtube all these things together they really pulled me in and i was like okay if i i could focus on this and if i put in the effort then maybe one day like this could be all i need right i'm i'm i'm happy that i'm able to make a full-time living from youtube and also the affiliate marketing that i do which is just essentially connecting people with a brokerage firm because now my business model doesn't require anybody that's watching my videos it doesn't require them to pay me we're out of the pocket for me to make money and so you know there's obviously a lot of in the trading and investing industry it's very predatory where hate it these people they line",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 16,
      "total_chunks": 96,
      "start_timestamp": "00:16:24",
      "start_timestamp_seconds": 984.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=984"
    }
  },
  {
    "text": "model doesn't require anybody that's watching my videos it doesn't require them to pay me we're out of the pocket for me to make money and so you know there's obviously a lot of in the trading and investing industry it's very predatory where hate it these people they line their pockets from other people who are paying them that just don't know any better and they sell them on the material things which you know that was like from day one when i started project option i was like i'm gonna take the long road and i'm never gonna i'm not gonna succumb to you know selling the dream to sell my services or whatever because number one that's not reality like these people they're making i they could be making that amount of money from their trading accounts but it's very unlikely that they grew small trading pounds which is what most of their customers will have a couple thousand dollars into millions of dollars that's like very far and few between but once they have that experience or they have the proof that they actually did that however they were successful in doing so then they can use that to sell a subscription service or a course and then the money that comes from that can grow their trading account even further and then they have just the steady steady flow of cash flow that they can use to make riskier and riskier bets and some of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 17,
      "total_chunks": 96,
      "start_timestamp": "00:17:24",
      "start_timestamp_seconds": 1044.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1044"
    }
  },
  {
    "text": "use that to sell a subscription service or a course and then the money that comes from that can grow their trading account even further and then they have just the steady steady flow of cash flow that they can use to make riskier and riskier bets and some of those could pay off but for the average person that is going to start with a couple thousand dollars it's just not it's not a realistic way to market your stuff and so my goal with project option was to just kind of present things neutrally and give people the information and let them use it however they want to but i never wanted to use the flashy sales tactics for the purpose of selling things that would line my own pockets i love that it's so i'm happy that the ad revenues are high enough on youtube for the options trading space and finance in general yeah i can structure a business model around that where i don't have to actually collect payments from the customers yeah and have them pay out of pocket so yeah that's awesome man it's and it's to be honest it's one of the things that i do before i invite anybody to to chat on my channel not like again not like i'm offering any sort of significant exposure but i do know that folks are looking for resources and stuff and i want nothing to do with any of those kind of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 18,
      "total_chunks": 96,
      "start_timestamp": "00:18:31",
      "start_timestamp_seconds": 1111.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1111"
    }
  },
  {
    "text": "things that i do before i invite anybody to to chat on my channel not like again not like i'm offering any sort of significant exposure but i do know that folks are looking for resources and stuff and i want nothing to do with any of those kind of channels because it's just misleading man it does it brings people down the wrong path i literally just started a i call it a small stacks portfolio so i just took 5k opened up a small portfolio and i'm essentially trading it knowing what i know now as if i was starting all over again and what i tell everybody is that this 5k is not going to grow into my nest egg like this 5k is something that i think if i was starting over again that i would be wanting to grow modestly but most importantly developing a solid strategy that as my income grows and as i continue to save and grow the account i can continue to apply that same strategy earning that whatever that percent return is so it's like that 5k is for developing a strategy in consistency that is not going to grow in your nest egg and i i honestly love that you kind of echo that because it's so exhausting seeing all the that people are spreading and then it's no wonder why when there's new people to come into investing they're like you ask them hey you know what are",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 19,
      "total_chunks": 96,
      "start_timestamp": "00:19:31",
      "start_timestamp_seconds": 1171.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1171"
    }
  },
  {
    "text": "in your nest egg and i i honestly love that you kind of echo that because it's so exhausting seeing all the that people are spreading and then it's no wonder why when there's new people to come into investing they're like you ask them hey you know what are you what are you targeting this year they're like oh you know nothing crazy maybe 80 100 for the year and it's like oh god like just just you're completely lost you're so skewed in what you think is realistic yeah some people some people email me and they ask me for my opinion on a service or whatever not to name anything and some of most of the time like i've never heard of it myself but just the other day someone asked me they said well this service they said that they can turn five thousand dollars into two hundred thousand dollars every year i was like well obviously like that's not true because they may have done it once but if they could do it every single year then there would be no reason to sell that because they would be a trillionaire if you could turn five thousand dollars into 200k every single year and you could scale that strategy there would be no reason to be in online sales you could just you could become a billionaire with that right you know so epstein's island and then just stay there yeah exactly um and then",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 20,
      "total_chunks": 96,
      "start_timestamp": "00:20:34",
      "start_timestamp_seconds": 1234.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1234"
    }
  },
  {
    "text": "five thousand dollars into 200k every single year and you could scale that strategy there would be no reason to be in online sales you could just you could become a billionaire with that right you know so epstein's island and then just stay there yeah exactly um and then like i've had i've had people email me pictures from other newsletters or trade alert services where like in their introductory newsletter that they're using to kind of try to sell people on it where they'll say like with just two thousand dollars in a margin account like you can make a full-time living trading options like psychotic now it's just absolute so psychotic it's unfortunate that that's the space we're in i hate it but but yeah like when i when i started i knew that not taking that approach to marketing and selling would be a much slower path but it was just so important to me to not go down that path just because it's so awesome i wouldn't be able to live with myself which is different types of people that the person that can do anything and do any type of sales that they want to as long as it benefits them and they don't care like what that means ethically and then there's the other type of person that will refuse certain approaches if it's not ethical you know not i'm this type of person so i always try to be i always try",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 21,
      "total_chunks": 96,
      "start_timestamp": "00:21:34",
      "start_timestamp_seconds": 1294.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1294"
    }
  },
  {
    "text": "to as long as it benefits them and they don't care like what that means ethically and then there's the other type of person that will refuse certain approaches if it's not ethical you know not i'm this type of person so i always try to be i always try to be brutally honest and just my whole goal is just to give people information unbiased and let them do with with the information whatever they want so i love that yeah it's it's honestly when i was i looked at a couple your videos um before i asked you you know to to come on and do this with me and that's one thing i i truly look for is the people who are like genuinely trying to just share information and then let individuals do what they're going to do with it but right something that that is definitely clouded the space is just predatorial advertising you see it all the time and it sucks because it's so effective so many people just want that lifestyle so bad that when they see something that you know it's fishy but you want it so bad that you want to believe it and then you find yourself going down this you know really shitty path yeah right so when you started investing what what was your primary um vehicle did you start with stock then go to options or did you start with options what did that look like yes",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 22,
      "total_chunks": 96,
      "start_timestamp": "00:22:41",
      "start_timestamp_seconds": 1361.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1361"
    }
  },
  {
    "text": "believe it and then you find yourself going down this you know really shitty path yeah right so when you started investing what what was your primary um vehicle did you start with stock then go to options or did you start with options what did that look like yes i started and i read a lot of books just on general stock investing so i read basically all of peter lynch's books he's famed mutual fund manager he worked for fidelity he had like 30 returns for 15 20 years whatever whatever his period of time working there he has like some of the most historic returns ever for mutual fund managers so i read all of his books essentially i read a couple books by jim cramer um i was just kind of i was just absorbing as much information as i could within the stock investing space and naturally from there going down rabbit holes on the internet i found options and i think i found options articles from the motley fool and i was like these things are interesting like i don't know what this is about but this sounds really appealing and like admittedly the appeal of options that drew me in was that you could use a small amount of money there it is a lot of money you know leverage um so that really drew me in and then i started searching for options content on youtube and then i found taste and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 23,
      "total_chunks": 96,
      "start_timestamp": "00:23:48",
      "start_timestamp_seconds": 1428.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1428"
    }
  },
  {
    "text": "appeal of options that drew me in was that you could use a small amount of money there it is a lot of money you know leverage um so that really drew me in and then i started searching for options content on youtube and then i found taste and trade and then that's kind of what led me to email tom and then i had the internship at tastytrade and then started project option obviously so yeah i started in stocks transitioned into options but at the time so this must have been in 20 this was probably early 2013 okay so i was 20 years old so i didn't have a lot of money to invest at that time so i was basically just learning as much as i could right and just just absorbing all the content so yeah that's awesome i i started with stock myself and then um i stumbled across options in a kind of similar way i started early though i started trading options in when i was a senior in high school so 2009 and i was super fortunate in that there there was no like internet was still kind of like growing then obviously it existed but it wasn't like tory for information as it is now and i was super fortunate i came across a um my mentor i still talk to him today but he's a prior army officer and whatnot i met him on a facebook group but",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 24,
      "total_chunks": 96,
      "start_timestamp": "00:24:59",
      "start_timestamp_seconds": 1499.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1499"
    }
  },
  {
    "text": "growing then obviously it existed but it wasn't like tory for information as it is now and i was super fortunate i came across a um my mentor i still talk to him today but he's a prior army officer and whatnot i met him on a facebook group but long story short if it wasn't for that dude to help me get started when i was getting started i probably would have just you know pissed all my money away so i i find your approach very respectable because most people myself included want to get started before they're ready to get started and it seems like you did a lot of homework which is honestly it's just super admirable to hear that because most people are like me and they're impulsive and they want to get started before they're ready they want to start making money and then they just piss it away because they're not ready so that that's really awesome something i'm curious about is if you were to like look at the lifespan of your options trading how has it evolved from when you started to how you trade now that's a great question um so to kind of to kind of build on what you just said while i did do a lot of reading and learning before i ever made an option straight i probably was reading about options for probably one or two months before i even opened up account and made",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 25,
      "total_chunks": 96,
      "start_timestamp": "00:26:13",
      "start_timestamp_seconds": 1573.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1573"
    }
  },
  {
    "text": "so to kind of to kind of build on what you just said while i did do a lot of reading and learning before i ever made an option straight i probably was reading about options for probably one or two months before i even opened up account and made my first trade but the most the most you're gonna learn is gonna come from your direct experience so it doesn't matter how many youtube videos you watch how many books you read how many blog posts you read you're not going to learn how options work until you actually start trading them with real money in my opinion because i i messed around with paper paper trading and i just never found it to be a valuable learning experience because interesting i would i would and this is that's not true for everybody oh sure like i would put on an option position in these simulated trading softwares and i would kind of just forget about them because i i didn't have any skin in the game and therefore there was really nothing that was pulling me back to like monitor that position i'm truly focused on it and so i didn't really find that it was a valuable learning tool although if if people use it like a real trade or a real position and they actually like watch it yeah multiple times a day check it out every day and then close it out i think i",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 26,
      "total_chunks": 96,
      "start_timestamp": "00:27:15",
      "start_timestamp_seconds": 1635.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1635"
    }
  },
  {
    "text": "so i didn't really find that it was a valuable learning tool although if if people use it like a real trade or a real position and they actually like watch it yeah multiple times a day check it out every day and then close it out i think i think you can learn a lot from that but i've always felt that real money trading is the absolute best way to learn obviously with a small amount if you're just getting started um but i agree with you your experience trump's all i totally regardless of what we're talking about yeah i totally agree with you i think for me i had the same exact perspective on paper trading for a long time that was kind of useless and then when i met my mentor my opinion on paper trading completely changed because he forced me to pay per trade for six months straight i couldn't he i mean i say i couldn't i could have traded right he didn't control my account but i i really respected him and i didn't i wanted to do you know what i mean what my mentor was kind of telling me to do so anyways he made me paper trade for six months straight and he we treated it just like it was my money like we would talk about it every single day we would talk about the moves i wanted to make i was only allowed to trade the",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 27,
      "total_chunks": 96,
      "start_timestamp": "00:28:21",
      "start_timestamp_seconds": 1701.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1701"
    }
  },
  {
    "text": "to do so anyways he made me paper trade for six months straight and he we treated it just like it was my money like we would talk about it every single day we would talk about the moves i wanted to make i was only allowed to trade the amount of money i was gonna you know invest with stuff like that and i found that to be so beneficial and it came down exactly to what you said it's like having the no discipline to treat this like real money to treat this just like your account and like you said most folks it's super hard to do that i needed somebody to force me to do it in order to take it seriously so i totally identify with you that for most people until you put actual money in the game it's it's just not the same and even so even like with me taking it as seriously as i did it still isn't the same exactly like you said like there is no replacement for actually trading but what i do tell people is that if you're new i suggest so strongly to start with paper trading because i truly think that it can help you get a lot of like just the gross ups out of the way early so you don't have to do that with real money i think that that's in just a really cool perspective that you're sharing because it's something",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 28,
      "total_chunks": 96,
      "start_timestamp": "00:29:22",
      "start_timestamp_seconds": 1762.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1762"
    }
  },
  {
    "text": "trading because i truly think that it can help you get a lot of like just the gross ups out of the way early so you don't have to do that with real money i think that that's in just a really cool perspective that you're sharing because it's something i talk a lot about is you know the the disposition towards paper trading i agree with that so to answer your question how the trading evolved yeah the early like the first couple years that i was trading options i was doing i was very active so i was probably trading every day or as much as i could and i was experimenting with lots of different strategies trading all the different strategies right i did a lot of naked options selling so i i loved selling strangles early in the day and that's because when you learn about option decay and positive data and everything like that you naturally are gravitated towards selling straddles and selling strangles because you don't have the long options that are reducing your option to pay and so early in my options trading career lifespan whatever you want to call it i was doing a lot of naked options selling um and just trading a lot of different strategies um doing making a lot of predictions and speculations on stock price movements okay but i think the most important part of that whole thing is just experimenting with different strategies and paying attention",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 29,
      "total_chunks": 96,
      "start_timestamp": "00:30:17",
      "start_timestamp_seconds": 1817.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1817"
    }
  },
  {
    "text": "doing a lot of naked options selling um and just trading a lot of different strategies um doing making a lot of predictions and speculations on stock price movements okay but i think the most important part of that whole thing is just experimenting with different strategies and paying attention to why the positions are changing in terms of p l every single day so observations that you make with your positions i think are one of the best ways to learn because you have to ask yourself all right the stock is down today my position is up or the stock is flat today my positions p l has changed by correct why is this happening and you have to ask yourself the why every single day and after every single movement and that's how you're going to learn how options work truly in the real world um and so that was the first the first few years that's kind of how i approached it i i was not really making money i would say i was a break-even trader at best which is still i think really good when you first start out if you can break even your first year i think that's all i tell everybody i tell everybody be profitable if it's your first year and you make a dollar when you you come out okay yeah i may not have been breaking even but it wasn't i never had any catastrophic losses completely wiped",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 30,
      "total_chunks": 96,
      "start_timestamp": "00:31:26",
      "start_timestamp_seconds": 1886.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1886"
    }
  },
  {
    "text": "your first year i think that's all i tell everybody i tell everybody be profitable if it's your first year and you make a dollar when you you come out okay yeah i may not have been breaking even but it wasn't i never had any catastrophic losses completely wiped me out which i think is very common for beginners especially if you're getting into the short-term option buying which is something that a lot of people kind of put out there these days because that's the only that's the only real way to have a 10 000 x return is to buy out of the money options super short term and be right on a big stock price movement that's the only way to have those home run type returns and people do hit them but that's the fastest way to blow up your whole account because you don't have any margin for error and those options are not only going to decay very quickly but if the stock price moves against them one of those options will also be worth yeah i mean you're just sitting there looking at a lot of gamma risk so it's yeah it's uh as my i'm in a i'm in a google chat with my brother and some other people and we call it vape risk vapor risk so like if you buy short-term out-of-the-money options those are pure vapor so yeah they'll just be gone yep i love that that's that's",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 31,
      "total_chunks": 96,
      "start_timestamp": "00:32:33",
      "start_timestamp_seconds": 1953.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=1953"
    }
  },
  {
    "text": "uh as my i'm in a i'm in a google chat with my brother and some other people and we call it vape risk vapor risk so like if you buy short-term out-of-the-money options those are pure vapor so yeah they'll just be gone yep i love that that's that's absolutely accurate yeah so that evolved into that evolved into um basically transitioning from all the strategies to mainly selling directionally neutral trades or doing spread trades directionally so it's basically just spreads but it was either neutral or directional like iron condors iron butterflies or selling foot spreads selling call spreads buying false spreads buying put spreads that's kind of where it went but the activity was still pretty high and if we fast forward to probably the past year i would say that my training active my training activity from day one options trading like starting from when i started learning all the way to today i think my trading activity has been a steady decreasing curve that's awesome i think that's because i've realized that the more active i am the worse i do because not necessarily just like churning trades but like you're you're micromanaging positions and that's not work this actually happened earlier this year in march when the market was so volatile i got sucked into the volatility and i was started to micromanage again and every single day i was making like 10 to 15 trades yeah and i felt like i was",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 32,
      "total_chunks": 96,
      "start_timestamp": "00:33:28",
      "start_timestamp_seconds": 2008.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2008"
    }
  },
  {
    "text": "and that's not work this actually happened earlier this year in march when the market was so volatile i got sucked into the volatility and i was started to micromanage again and every single day i was making like 10 to 15 trades yeah and i felt like i was just kind of digging myself into a hole because i was never letting a prediction play out i was just kind of changing my predictions with each day with each new movement in the market and i found that to be a very difficult period training wise and it was also getting super super stressful i started to lose sleep i was i was waking up at four in the morning checking my phone to see where es was yeah so it just it wasn't like i had a ton of risk on that's that's not why i was losing sleep it was just because my brain had gotten into this pattern of just being hyper obsessed with every little movement in the market yeah it was hard to learn today because every day the market was up or down and so i was able to pair that back and start putting on some directional positions which after the federal reserve came out and came out with all their stimulus and then we rallied like 10 off the lows and then we weren't starting we weren't really seeing any negative downturns even after that was coming out then i kind",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 33,
      "total_chunks": 96,
      "start_timestamp": "00:34:51",
      "start_timestamp_seconds": 2091.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2091"
    }
  },
  {
    "text": "start putting on some directional positions which after the federal reserve came out and came out with all their stimulus and then we rallied like 10 off the lows and then we weren't starting we weren't really seeing any negative downturns even after that was coming out then i kind of figured like all right i might as well just not try to fight this because after we started bouncing 5 10 off the lows i was like all right now is the time to start loading up on the shorts again right and i burned a lot of money in vxx by purchasing deep out of the money calls in vxx because i thought we're gonna have another vol explosion with the obvious the obvious incoming market crash but we never really got that and then i also learned that typically when you have a shock to the system and you have a really severe stock market crash the volatility increase is typically the most exaggerated on the initial downturn right but then even if you rally back up and then you have another 10 drop like the second increase in volatility primarily talking about the vix futures and therefore vxx that will not be as significant as the first typical meltdown so like the initial shock is typically the most jarring in terms of a volatility increase at least from the information that i came across on the internet which you know you always have to take really",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 34,
      "total_chunks": 96,
      "start_timestamp": "00:35:55",
      "start_timestamp_seconds": 2155.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2155"
    }
  },
  {
    "text": "therefore vxx that will not be as significant as the first typical meltdown so like the initial shock is typically the most jarring in terms of a volatility increase at least from the information that i came across on the internet which you know you always have to take really great just trust it blindly obviously it does make sense when you think about it because like a couple months in like a month and a half into the new volatility like people are used to really bad news and people are used to a market decrease and therefore the reactions to those movements and the reactions to the news are not going to be as exaggerated as when you go from a 12 vicks and then all of a sudden the market dropped 30 in 17 trading days and now the vix is at 90. so yeah i i talk about that a lot too it's you know obviously i always like to say markets crash down not up but you know once you get through that that first move exactly like you're talking people have had a chance to digest synthesize the information so even if there is a change in circumstance you know two months down the line or whatever um they've already you know hit that initial shock i've it's funny you bring that up because i i truly have felt and i've said it a million times on you know different videos that this has",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 35,
      "total_chunks": 96,
      "start_timestamp": "00:37:01",
      "start_timestamp_seconds": 2221.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2221"
    }
  },
  {
    "text": "a change in circumstance you know two months down the line or whatever um they've already you know hit that initial shock i've it's funny you bring that up because i i truly have felt and i've said it a million times on you know different videos that this has been like one of the most emotional markets i've ever traded in like i said i i started trading um really in like 2007 and it's just been mind-blowing to me just how emotional every single thing feels to me and it's also very fascinating to hear how you handled the rebound compared to how i did because i absolutely shared your sentiment i thought with near certainty that there's no way the market could continue up after that initial rebound but i didn't start playing it because i felt like the move in the news i was seeing didn't make any sense so i literally just started scaling out when the market makes typically those big down moves um i that's when i end up doing very well with the volatility starting to to spike as much as it does and then as soon as we started getting that rally i was like ah you know i'll just kind of scale out and see how this plays out and then it just kept going and going and i was like what the man like what is happening right now yeah especially the technology stocks that was i was looking",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 36,
      "total_chunks": 96,
      "start_timestamp": "00:38:03",
      "start_timestamp_seconds": 2283.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2283"
    }
  },
  {
    "text": "rally i was like ah you know i'll just kind of scale out and see how this plays out and then it just kept going and going and i was like what the man like what is happening right now yeah especially the technology stocks that was i was looking at um you know just some studies on historical bear markets and from like 1920 or so this the average recovery is like 298 days or so so over 200 days almost 300 and i know that and then as soon as i started seeing this thing you know looking like a v-shape i was like how how like how are we making this move i just didn't believe it so i've been ever since the drop i've been very lightly invested i i've scaled in a bit more in different periods of time but in general i just don't trust it man i just do not trust where things are technology has been doing well and i think in a lot of ways this kind of environment bodes well for them you know everybody needs technology and i get that but there's a lot of other you know makeup in the markets not just technology so i have uh i don't have a hard time with that um being cognizant of our time i definitely don't want to run over um i really appreciate your time i want to make sure that we have a few minutes to touch",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 37,
      "total_chunks": 96,
      "start_timestamp": "00:39:13",
      "start_timestamp_seconds": 2353.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2353"
    }
  },
  {
    "text": "in the markets not just technology so i have uh i don't have a hard time with that um being cognizant of our time i definitely don't want to run over um i really appreciate your time i want to make sure that we have a few minutes to touch on just your thoughts on how the mind of the trader impacts you know their execution especially in a time like we're seeing right now you know when things are so emotional i'd like to get your thoughts on that yeah so i think i've i've personally realized and i structure my own training philosophy and approach around psychology because yeah i'm particularly sensitive to stress and anxiety and so if i if i'm too active in the markets and like they're taking it's taking up too much of my mental space and especially like if i size trades too large or something like that or i don't really know how i'm going to manage the position then all those things can start to kind of eat away at me and so i try to structure my trading strategy so that i don't really have to have those worries and i think traitor psychology is one of those things that it's not a sexy topic to talk about because everybody is like if we if we just sit here talking about traitor psychology people will probably think well that doesn't really apply to me because always completely strong always and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 38,
      "total_chunks": 96,
      "start_timestamp": "00:40:15",
      "start_timestamp_seconds": 2415.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2415"
    }
  },
  {
    "text": "i think traitor psychology is one of those things that it's not a sexy topic to talk about because everybody is like if we if we just sit here talking about traitor psychology people will probably think well that doesn't really apply to me because always completely strong always and while that could be true uh when you have your money on the line and especially once you start to pay attention to the markets very actively you'll find that the markets can break you down pretty quickly and i've learned through many of i think i learned the most about my own trader psychology and traitor psychology in general through the big market crashes that we've experienced over the past few years yeah namely i started trading options in mid-2013 and 2015 was extremely low vol 2014 was extremely low ball and then we get to august 2015 and that's the first time that i ever saw a high volatility market that's the first time i ever saw the floor being pulled out from the stock market right so in 2015 i was trading with about twenty thousand dollars and from january to august i went up ten thousand dollars again with a lot of naked options selling i was selling lots of strangles but i was having a lot of success with options trading and i was up 50 on the year and then august came around and i lost all my profits in like 36 hours or",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 39,
      "total_chunks": 96,
      "start_timestamp": "00:41:18",
      "start_timestamp_seconds": 2478.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2478"
    }
  },
  {
    "text": "dollars again with a lot of naked options selling i was selling lots of strangles but i was having a lot of success with options trading and i was up 50 on the year and then august came around and i lost all my profits in like 36 hours or something like that and that's because the market started to get so volatile that i initially got blown out not like blown out in terms of i blew out my whole account but my short option positions the strangles those exploded in value when the market opened on august 24th right and i took some big losses on those but then the futures were moving around a hundred dollars a day so then i was i was like if i could just catch one of these movements then i could make five thousand dollars because a hundred points on vs is five thousand dollars and so i started to get into active futures training and that was like that pulled me in a very dark place psychologically because you're looking at every single move right especially if you like i had my entries then i had my stops and then it would always basically go right to my stop i'd get stopped out and then the move would happen and i'd miss out on it and then you'd start to force entries on things because you're tired of waiting around so it's just a very undisciplined period and i started",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 40,
      "total_chunks": 96,
      "start_timestamp": "00:42:34",
      "start_timestamp_seconds": 2554.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2554"
    }
  },
  {
    "text": "it would always basically go right to my stop i'd get stopped out and then the move would happen and i'd miss out on it and then you'd start to force entries on things because you're tired of waiting around so it's just a very undisciplined period and i started to get really really active especially with the futures and i just noticed that like i just got way way stressed out and i was in a very dark place like it was not just it was not just affecting my investing portfolio yeah for like my investing life it was like all aspects of life i got very sour and just dude i wasn't i was in a not good place so i actually when i got back to principal which is by 20 000 or so i actually took all of that money out of my trading account and i didn't trade for a month i didn't even open up my platform for a month because i was like i need a receipt i need to reset from this i can't just go right back in there like i'm not in a good place mentally yeah and so that was my first big lesson about trader psychology and especially how volatile markets can can chew you up and spit you out to actually vote my old boss and i think a lot of people may agree with that because if you if you've never experienced a volatile market",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 41,
      "total_chunks": 96,
      "start_timestamp": "00:43:39",
      "start_timestamp_seconds": 2619.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2619"
    }
  },
  {
    "text": "that was my first big lesson about trader psychology and especially how volatile markets can can chew you up and spit you out to actually vote my old boss and i think a lot of people may agree with that because if you if you've never experienced a volatile market and when you start to learn you start actually trading and getting involved in markets just trickling higher it's like all right low volatility the market just kind of grinds up over time there's no real worry like i don't know why people are scared of the declines and the drawdowns and then it happens and then you're like oh like this is this is how it feels and this is what happens in my brain when i start to see so much volatility and also with volatility you start to see all these opportunities and so you might get sucked into all these trades that you are probably just putting on just because of the volatility and you're thinking about if you can catch one of those huge moves for this particular position like you're going to be sitting pretty but unfortunately it's it's not that easy and volatile markets i think are the most dangerous particularly for new traders because just what happens psychologically when you're actively involved in the markets and then everything just starts to get crazy volatile yeah i think that can that can really surprise you negatively in terms of how you react to",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 42,
      "total_chunks": 96,
      "start_timestamp": "00:44:35",
      "start_timestamp_seconds": 2675.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2675"
    }
  },
  {
    "text": "markets i think are the most dangerous particularly for new traders because just what happens psychologically when you're actively involved in the markets and then everything just starts to get crazy volatile yeah i think that can that can really surprise you negatively in terms of how you react to those environments especially the you know what i find when there are people who are you know starting to think that they understand it and stuff like that i always talk to folks my my favorite conversation is when folks are selling cash secured puts and they're always just like oh i'm okay with assignment and then all of a sudden the underlying drops and they're like well i don't want assignment here and it's like it's it's just what you're talking about that right it's what mike tyson always said right everybody's gotta plan until you punch in the face it's the same exact thing like so many people feel like they're in a certain mental space and then the happens and they're like okay i'm in a completely different mental space yeah i i love that conversation obviously um we're pretty much at time so i i literally have a million questions for you we can keep going on that on that note about psychology because i kind of want to have an action plan here but the way i structure my trading these days is i'm typically doing one of three things if i'm trading options at",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 43,
      "total_chunks": 96,
      "start_timestamp": "00:45:38",
      "start_timestamp_seconds": 2738.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2738"
    }
  },
  {
    "text": "have a million questions for you we can keep going on that on that note about psychology because i kind of want to have an action plan here but the way i structure my trading these days is i'm typically doing one of three things if i'm trading options at all so a big a big idea that i made a video about not long ago was that people see that i have this options trading channel and i only talk about options on the channel and so i think that people might have the impression that i only trade options and that's like all i do in terms of my investing portfolio but actually it's a very small percentage and i think that's important because since you get a lot of leverage with options you don't need to allocate 100 of whatever you have saved up and in your investment accounts you don't have to allocate 100 of that money to options and in fact i think it's very dangerous so for example like you you could use five percent of your portfolio let's say you have let's say you have fifty thousand dollars i know that's a lot of money but i have to kind of size it up here because unless you have tens of thousands of dollars like you can't really size positions with five percent like if you have if you have three thousand dollars five percent of that is a hundred and fifty dollars",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 44,
      "total_chunks": 96,
      "start_timestamp": "00:46:42",
      "start_timestamp_seconds": 2802.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2802"
    }
  },
  {
    "text": "of money but i have to kind of size it up here because unless you have tens of thousands of dollars like you can't really size positions with five percent like if you have if you have three thousand dollars five percent of that is a hundred and fifty dollars there's how many options positions you can put on for 150 and so let's say you have fifty thousand dollars five percent of that is twenty five hundred dollars let's say you're really really bullish on some stock and you wanna put on a position that is going to benefit immensely from any increase that you see over the next couple years well you could take that 2500 and you could you could buy a call option with it in you know the year out two years out expiration cycle and you could double or triple or 10x that money depending on the exact stock price increase that you see but you can only lose one x and so you either are going to lose five percent which over a one year two year period like that's not gonna that's not gonna kill you you're not gonna be at zero right but if your prediction is correct and you should really only be doing this if you have a strong conviction about something and you you want that exposure but you could double or triple 4x whatever it is and with that small five percent allocation that could result in",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 45,
      "total_chunks": 96,
      "start_timestamp": "00:47:48",
      "start_timestamp_seconds": 2868.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2868"
    }
  },
  {
    "text": "right but if your prediction is correct and you should really only be doing this if you have a strong conviction about something and you you want that exposure but you could double or triple 4x whatever it is and with that small five percent allocation that could result in an overall account gain that is still huge relative to the risk you took right and so i think with the leverage that you can get with options you don't have to take a hundred percent of what you have unless of course you have just a couple thousand dollars in which case it's hard to kind of diversify that into different positions and stocks are expensive which is i think another reason people are drawn to options is that buying stocks is really expensive like if you want to buy a share of amazon you gotta have three thousand dollars whereas you could trade a call spread on amazon with a few hundred dollars and you could make a few hundred dollars from that position if you're right but i think it's i think it's dangerous to forgo traditional investing and focus solely on more active approaches just because if you think about it over if i'm gonna take all of my money everything i've saved up and i'm going to allocate it to strictly options trading and i'm going to do that for the next 10 years well what that means is over the next 10 years i",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 46,
      "total_chunks": 96,
      "start_timestamp": "00:48:50",
      "start_timestamp_seconds": 2930.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2930"
    }
  },
  {
    "text": "if you think about it over if i'm gonna take all of my money everything i've saved up and i'm going to allocate it to strictly options trading and i'm going to do that for the next 10 years well what that means is over the next 10 years i have to be consistently right about my short term predictions with what's going to happen in the stock market otherwise i'm going to lose money and for me personally getting back to the trader psychology i don't want to i don't want to put myself in a position where i have such a high bar to be successful i'm not saying that that's going to lead me to not do it at all i obviously i love trading options like i'm going to be here for the rest of my life but i just i don't need to spend or i don't need to allocate 100 of whatever i'm saving to options because i know that they are more speculative because they require whether you're trading directionally or neutral doesn't matter you're still making a prediction and the success of your strategies depends specifically on the path that the stock price takes right over that trade duration and so i don't want to put myself in a position where i'm not going to make any money unless i'm successfully predicting short-term movements in stocks over the next 10 years like that right when i just think about that like that",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 47,
      "total_chunks": 96,
      "start_timestamp": "00:49:52",
      "start_timestamp_seconds": 2992.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=2992"
    }
  },
  {
    "text": "price takes right over that trade duration and so i don't want to put myself in a position where i'm not going to make any money unless i'm successfully predicting short-term movements in stocks over the next 10 years like that right when i just think about that like that seems like a very stressful situation to be in and so i'd rather hold passive investments and actively purchase more long-term positions that actually represent something over a long period of time because i know with a longer holding period this is statistically been shown to be true too the longer you hold stocks the higher the percentage that you have in making money yes and in this book that i'm reading psychology of money i think he said over 20 year periods there's been a 100 chance of making money thus far right but basically like on a one day period it's 50 right one year it's 60 i think he said 68 um 10 years it's even higher and then 20 years is 100 so like if i'm putting my money in those types of positions there's a lot less stress associated with that because i know it's not on me i don't have to predict where tesla's going to go over the next 45 days if i think in 10 years from now the company is going to be better off than it is now and it's going to change the world and how we see it",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 48,
      "total_chunks": 96,
      "start_timestamp": "00:50:57",
      "start_timestamp_seconds": 3057.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3057"
    }
  },
  {
    "text": "not on me i don't have to predict where tesla's going to go over the next 45 days if i think in 10 years from now the company is going to be better off than it is now and it's going to change the world and how we see it then that's a much easier play to make with a majority of my money but it doesn't mean that i'm not going to buy some tesla stock tesla stock and then also take a portion of that and do some highly leveraged highly speculative option positions well um so i think like that that gets back to psychology and for me personally like i don't want to put myself in a situation where i have such a high bar required just to be successful which is which is i think one of the things that happens with people when they get into options is that you see the benefits of it like you you can make a lot of money with a little bit of money and you can make money when the stock price doesn't move at all you can make money when the stock price moves in either direction and all these things they seem better than just passively investing but i honestly i think it's a really bad idea to kind of forget about traditional investing even though there are benefits to be had with options so i think i think i would agree with you and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 49,
      "total_chunks": 96,
      "start_timestamp": "00:52:05",
      "start_timestamp_seconds": 3125.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3125"
    }
  },
  {
    "text": "direction and all these things they seem better than just passively investing but i honestly i think it's a really bad idea to kind of forget about traditional investing even though there are benefits to be had with options so i think i think i would agree with you and i think for most folks finding some sort of mix is definitely the the right balance for me personally my margin account is all options i trade all options and i've done that for for over a decade and what i found is exactly like you're saying for most people it doesn't work well and i think one of the reasons why it has worked very well for me is because the guy again i talk about all my time i talk about them all the time because 80 of what i do is a relic of this dude that's been trading for 60 years so my mentor he's retired and he uses his portfolio for income so while a lot of people are trading spreads like you're talking about i avoid spreads at all costs and most of his trading is covered strangles so not even like naked strangles obviously you know um but the way that he trades is really identifying with your concept of the longer term game plan so he trades primarily index etfs i trade primarily index etfs as a again just a relic of the way he imprinted on me and one of the",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 50,
      "total_chunks": 96,
      "start_timestamp": "00:53:00",
      "start_timestamp_seconds": 3180.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3180"
    }
  },
  {
    "text": "obviously you know um but the way that he trades is really identifying with your concept of the longer term game plan so he trades primarily index etfs i trade primarily index etfs as a again just a relic of the way he imprinted on me and one of the things that he does and this is exactly what i did in march is we allocate a certain amount of our account to this trade then we figure out how much we want to enter so if i allocate 300 000 to this trade i'm not going to enter with all 300k at once i'm going to start with maybe 100k or 150k on the initial outlay and then it happened in march as soon as the market started crashing i continued to scale into the trade until i hit my cap and then i just took assignment and then i exercised that long-term point of view whereas i trade iwm a lot so whereas i thought eventually the market will recover the market will be fine so i just sat on a ton of stock until the market started to move up and then i completely unwind so it's very interesting listening to you talk about your journey through active management because i think most people touch the keyboard and the mouse too much and they get in their own damn way for somebody to take assignment and then do nothing is so difficult and they like folks don't",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 51,
      "total_chunks": 96,
      "start_timestamp": "00:54:15",
      "start_timestamp_seconds": 3255.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3255"
    }
  },
  {
    "text": "very interesting listening to you talk about your journey through active management because i think most people touch the keyboard and the mouse too much and they get in their own damn way for somebody to take assignment and then do nothing is so difficult and they like folks don't realize that that they want to try to manipulate the trade and do all these other things something i'm curious about and i'd love to just dig into like your journey because you do a lot of self-analysis it's very clear how did you go about like truly getting yourself to slow down in terms of your interactions you know with your trades as much and becoming more comfortable allowing your trade and your initial you know assumption to play out i think that comes with experience and just understanding understanding that every impulse you have doesn't need to be acted on and i think that's a that's been a big lesson for me so how did you and also i think i i kind of got too smart for my own good where i almost would talk myself out of almost every single trade yeah because the initial assumption would be like oh xyz or apple stock is down today therefore i should sell this put spread because i can make you know 300 of easy money but if it plummets another 20 then i'm gonna lose whatever thousand whatever the number is and so you could look at",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 52,
      "total_chunks": 96,
      "start_timestamp": "00:55:28",
      "start_timestamp_seconds": 3328.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3328"
    }
  },
  {
    "text": "would be like oh xyz or apple stock is down today therefore i should sell this put spread because i can make you know 300 of easy money but if it plummets another 20 then i'm gonna lose whatever thousand whatever the number is and so you could look at it like oh it's a really high probability trade you have a really high probability of making money apple's a crowd favorite like it's probably going to catch a bid at some point sure um so you should take you should sell that spread right now because you can and i think i've talked myself out of a lot of impulsive trades like that because you understand what can go wrong and you understand that there's that specific time frame associated with it as well so how do you balance to the other side right you like you're saying you talked yourself out of a lot of trades um how do you get yourself then you know to find the good trades to make it's uh that's a hard question because as i said earlier in march i kind of got sucked back in and i was i was doing bad things and i was being too active um but a lot of that a lot of the activity was kind of trading around stock positions okay um but i also did i was making a lot of speculative plays as well primarily the number one thing i was doing",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 53,
      "total_chunks": 96,
      "start_timestamp": "00:56:38",
      "start_timestamp_seconds": 3398.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3398"
    }
  },
  {
    "text": "bad things and i was being too active um but a lot of that a lot of the activity was kind of trading around stock positions okay um but i also did i was making a lot of speculative plays as well primarily the number one thing i was doing is i was betting on on a market decrease again right after the initial bounce in march in april um and that never happened so i actually i put i put too much money into the into the high high reward low risk plays i did a lot of asymmetric bets i was basically buying puts in spy i had puts in iwm got it i had calls and vxx not necessarily all at once but these are kind of positions that i was trading and the market just kept going up and i kept leading those positions out right but i did make i did make a lot of money on the initial decline from vxx call options right because i had a lot of stocks in this main portfolio that i'm talking about and those were taken ahead and i as we started to kind of pinch into that decline and as i started to read more into the coronavirus headlines and kind of understand that this could be something not so great i started to actually put on long vxx call positions those those did really well so they sheltered a lot of losses from the stock",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 54,
      "total_chunks": 96,
      "start_timestamp": "00:57:48",
      "start_timestamp_seconds": 3468.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3468"
    }
  },
  {
    "text": "that decline and as i started to read more into the coronavirus headlines and kind of understand that this could be something not so great i started to actually put on long vxx call positions those those did really well so they sheltered a lot of losses from the stock going into the decline but then as we rebounded back i started to bet heavily again on another leg lower in the market right that was those never happened so i reasonable i've earned a lot of money doing that and also just like micromanaging around those positions you know like if if i bought vxx calls on one day and then the market went up then i would buy more because the xx would be lower and they're out therefore i was kind of scaling into that position and that's how i was justifying it but then maybe as we got a decline i would kind of sell out too early so i just got i got way too active with that but to answer your question like how how do you select the trades these days it's it's a difficult question but i would say i i didn't answer this earlier i said i was i basically am doing one of three things if i'm trading the first is i'm putting on leveraged upside plays which is primarily long-term call options in specific companies or it could be an index okay um like spy i had i had",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 55,
      "total_chunks": 96,
      "start_timestamp": "00:58:52",
      "start_timestamp_seconds": 3532.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3532"
    }
  },
  {
    "text": "answer this earlier i said i was i basically am doing one of three things if i'm trading the first is i'm putting on leveraged upside plays which is primarily long-term call options in specific companies or it could be an index okay um like spy i had i had a couple of those positions where i purchased like the 350 calls in spy for three dollars and they had like two years two and a half years expiration and i've tripled up on those and i've since closed them yeah those are like the bullish type of plays that i'm doing and tesla i have some pretty deep out of the money call spreads that i actually liked into so i purchased i purchased some calls in tesla that had two years expiration stock shot up on that same day that i entered and i was actually able to short the same amount of calls at 100 points higher right and i collected the same amount of premium so i essentially legged into a call spread and my price is zero and since the strike width is 100 um the max profit on those is uh ten thousand dollars right so but the answer that there's no risk anymore so so if i'm really bullish on a stock long term then i'll i'll look to these leveraged upside plays yeah but other than that i'm either selling a directionally neutral index butterfly so i do uh iron butterfly strategy",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 56,
      "total_chunks": 96,
      "start_timestamp": "01:00:01",
      "start_timestamp_seconds": 3601.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3601"
    }
  },
  {
    "text": "right so but the answer that there's no risk anymore so so if i'm really bullish on a stock long term then i'll i'll look to these leveraged upside plays yeah but other than that i'm either selling a directionally neutral index butterfly so i do uh iron butterfly strategy and spy or spx depends on how i'm sizing it but that's a directionally neutral plane that yeah basically doesn't have a lot of upside risk the main risk is a severe decline in the market right that's like a completely systematic strategy so that really does i don't lose sleep over that right and then the third way i'm trading is if i have an existing stock position such as one in tesla this is the exact example of when i use this if i have a stock position that's increased like absurdly in a short period of time and therefore the profitability of that position is really high then i'll actually look to hedge that position by using a put or put spread got it so i did that in tesla because the cost base is in the main portfolio that is the stock and option mix um the cost basis of tesla shares is like 210 okay and the stock price obviously is absurdly high it's shot way higher just a couple months and so going into the election and with all the uncertainty that's still brewing with coronavirus and everything i purchased some of the 300",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 57,
      "total_chunks": 96,
      "start_timestamp": "01:01:11",
      "start_timestamp_seconds": 3671.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3671"
    }
  },
  {
    "text": "the cost basis of tesla shares is like 210 okay and the stock price obviously is absurdly high it's shot way higher just a couple months and so going into the election and with all the uncertainty that's still brewing with coronavirus and everything i purchased some of the 300 puts to purchase two of the 300 puts in tesla got it and i bought those for 15 and those expired in i think november and so with that play the logic was tesla shares i've already seen this meteoric rise i have a lot of profits on the stock position but i can use this opportunity to buy these put options that are are really cheap now at that strike price because the stock price has gone so high and since my cost basis is 210 on the shares and i bought the 300 puts for 15 effectively like the minimum sale price for those tesla shares through november expiration is 285. so i love that the strike price of 300 minus the cost of the puts is 285 right history price in the shares is 211. so if tesla shares go to zero i'm guaranteed to be able to sell to share that at 285 essentially right effective sale price since i bought the 300 puts for 15 but like if tesla goes tesla goes to zero i don't think anybody's doing we're probably not gonna be on the computer very much yeah yeah who knows you never",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 58,
      "total_chunks": 96,
      "start_timestamp": "01:02:22",
      "start_timestamp_seconds": 3742.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3742"
    }
  },
  {
    "text": "to sell to share that at 285 essentially right effective sale price since i bought the 300 puts for 15 but like if tesla goes tesla goes to zero i don't think anybody's doing we're probably not gonna be on the computer very much yeah yeah who knows you never know um but selecting i think selecting trades is really hard it's trader specific because everybody has kind of the signals that they look for their own personal predictions these days i'm not trying to make an aggressive amount of predictions but i do options when i have a stronger conviction on a particular company or i just want leveraged exposure like let's say i have a hundred and twenty-five thousand dollars in an account and i'm already invested with a hundred thousand dollars of it right 25 000 left over so maybe instead of buying shares of the company that i'm bullish on long term instead of spending that larger outlay maybe i'll spend the same amount or a fraction of that and just turn it into an option play and therefore i can get exposure to that long-term move and i don't have to necessarily break the bank and doing it so i don't necessarily have to allocate the remaining amount of cash to that one position by using an option i can get the leverage but i still have limited downside if i'm wrong so yeah i love how i think about it but how to select",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 59,
      "total_chunks": 96,
      "start_timestamp": "01:03:34",
      "start_timestamp_seconds": 3814.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3814"
    }
  },
  {
    "text": "and doing it so i don't necessarily have to allocate the remaining amount of cash to that one position by using an option i can get the leverage but i still have limited downside if i'm wrong so yeah i love how i think about it but how to select trades is such a difficult topic because everybody has their own strategies everybody has their own stocks that they trade and their own philosophies i think that's a really difficult question to answer but i try to be i try not to make as many predictions in the short term as i can so i try to if i'm going to make it leverage option play typically it's going to have an expiration a couple years out and i think that's i actually love that strategy as well strategies me too maybe not right this second but i know i'm going to employ that strategy a lot in the future yeah my um so something that i've always appreciated my my mentor for is whenever i would feel like having an opinion on where an underlying was going he would essentially always just call me a idiot and he would always say like i'm worried about the wrong thing he's like stop worrying about where things are gonna go he's like start worrying about money management he's like right at the end of the day and he's really imprinted that on me where like for most of my trades right",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 60,
      "total_chunks": 96,
      "start_timestamp": "01:04:47",
      "start_timestamp_seconds": 3887.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3887"
    }
  },
  {
    "text": "always say like i'm worried about the wrong thing he's like stop worrying about where things are gonna go he's like start worrying about money management he's like right at the end of the day and he's really imprinted that on me where like for most of my trades right now and i truly mean it like i couldn't care less where the underlying goes because i i know what i'm gonna do if it plummets i know what it's gonna what i'm gonna do if it goes up and most of my strategies are covered strangle so a big part of it is just get ready to sit and wait and as long as you're comfortable with that and it takes it took me a long time to get there and once your account continues to grow it becomes easier and easier since you have additional capital to do other things with as you see fit but i love that you're talking about the longer term long options i very rarely buy premium but i do and i i kind of scold people that you know are dead set on only buying or selling i always feel like it's a pretty ignorant position there's a time for both right and the way that if i'm buying options it's typically a leap and i'll generally employ like some sort of ratio diagonal so i'll still sell calls against the longs right but in contrast to your approach where you'll go",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 61,
      "total_chunks": 96,
      "start_timestamp": "01:05:48",
      "start_timestamp_seconds": 3948.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=3948"
    }
  },
  {
    "text": "a pretty ignorant position there's a time for both right and the way that if i'm buying options it's typically a leap and i'll generally employ like some sort of ratio diagonal so i'll still sell calls against the longs right but in contrast to your approach where you'll go out of the money obviously paying less i typically goes i go very far in the money so i can try to limit theta decay on the position and make sure you know i'm capturing some intrinsic value but trade-off is it's more expensive but it's it's really cool to hear you talk about leaps because most people who are buying options they're cheap you know what i mean they want to buy it in the next two weeks because it's a low dollar amount but i've done it too i'm guilty as well i'm just just um yeah so i guess what you said kind of builds on what i was saying by talking myself out of trades is that like if i'm going to put on this 30-day option play that requires a specific movement to happen it could happen over the next three months or the next year but for me to put money on the line and say with high certainty that's going to happen in the next 30 days right those types of trades are they're much more like gambling they're much more speculative because i i use this term the path of the stock",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 62,
      "total_chunks": 96,
      "start_timestamp": "01:06:46",
      "start_timestamp_seconds": 4006.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4006"
    }
  },
  {
    "text": "year but for me to put money on the line and say with high certainty that's going to happen in the next 30 days right those types of trades are they're much more like gambling they're much more speculative because i i use this term the path of the stock price and basically what i mean by that is literally like the path of the stock price takes over a specific period of time option option prices and option positions are entirely dependent on the path that the stock price takes so for example if you're going to say netflix is overvalued it's whatever it is let's say it's 525 a share i don't know where it is right now and you think that netflix for sure is going to be below 600 in 30 days or 60 days so for that reason you might go out to the 60-day expiration cycle and you might short the 600 call option just by itself because you're you're very convinced that netflix is going to be below 660 days and with the stock at 525 it's a very high probability play because it has to go up more than 75 by expiration for you to lose money on that but what a lot of people overlook is even though that is a high probability strategy you have to keep in mind what the stock path would mean for your strategy so if the if the path of the stock was just flat",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 63,
      "total_chunks": 96,
      "start_timestamp": "01:07:53",
      "start_timestamp_seconds": 4073.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4073"
    }
  },
  {
    "text": "for you to lose money on that but what a lot of people overlook is even though that is a high probability strategy you have to keep in mind what the stock path would mean for your strategy so if the if the path of the stock was just flat and traded at 525 through the 60-day period then you're just gonna see steady decay on your 600 short call and you're gonna make easy money but let's say you short that same call and the other path that happens or a different path is the stock goes from 525 and adapts to 600 the next day well now your assumption on the prior day was yeah there's a good chance netflix is below 600 in the next 60 days which is a high probability event at that moment and you could collect a few hundred dollars on that option and you think it's free money but then if the stock price gaps higher in the very short term after you enter that trade now you have this massive unrealized loss on the short call and now you're thinking well if it goes to 700 then i'm gonna be out a huge amount of money and so maybe you close that short paul because you think that it's not worth the risk anymore you've already lost a lot you can't stomach losing any more right and then right after you get out of that call the stock price maybe goes",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 64,
      "total_chunks": 96,
      "start_timestamp": "01:09:07",
      "start_timestamp_seconds": 4147.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4147"
    }
  },
  {
    "text": "a huge amount of money and so maybe you close that short paul because you think that it's not worth the risk anymore you've already lost a lot you can't stomach losing any more right and then right after you get out of that call the stock price maybe goes a little higher gets sick gets to 610 but then it goes back to 575 550 goes up to 575 and at the expiration date of your call it's below 600 like you thought initially but since the stock path was not accommodative at all in the initial period and since you took such such huge heat initially you got shaken out so i think it's to look at an option position or a particular trade instead of just looking at like here's the max loss here's the max profit like here's the probability of profit that's all at expiration you have to think about what can happen before expiration which is the stock price path and what will be your reaction to those movements and i think thinking about the particular path that a stock price can take i think it can help you understand the risk and kind of what can go wrong as opposed to just saying netflix is at 525 there's really high probabilities that it's going to be below 660 days so i'm going to sell the short 600 it's going to be easy money which you could be right about your assumption but what",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 65,
      "total_chunks": 96,
      "start_timestamp": "01:10:12",
      "start_timestamp_seconds": 4212.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4212"
    }
  },
  {
    "text": "of what can go wrong as opposed to just saying netflix is at 525 there's really high probabilities that it's going to be below 660 days so i'm going to sell the short 600 it's going to be easy money which you could be right about your assumption but what happens in between entry and expiration and how do you react that can that can be a wild ride and it can be awesome i honestly are prepared for it i absolutely love that example i really do because i i also think a lot of people when they're setting up you know a higher probability trade let's just say that was uh 20 delta whatever it is and if you think about a lot of people forget the probability of a touch which is exactly that you know like there's a pretty good likelihood at some point your option is going to be underwater and exactly like you said even though your entire long-term assumption does in fact play out that shorter term touch assumption or just you know calculation also tends to play out and if you find yourself in that scenario where you're not ready to see your position underwater and then what that actually looks i love that i really do because a lot of people it seems like they're just so focused on the probability when they enter and then what that looks like at expiration and the money they're going to make you know",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 66,
      "total_chunks": 96,
      "start_timestamp": "01:11:19",
      "start_timestamp_seconds": 4279.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4279"
    }
  },
  {
    "text": "your position underwater and then what that actually looks i love that i really do because a lot of people it seems like they're just so focused on the probability when they enter and then what that looks like at expiration and the money they're going to make you know they forego kind of the interim i think that that's a really good conversation the other thing that my mentor talks a lot about is expectancy because everybody wants to talk about probability of profit everybody wants to talk about you know the likelihood of different things happening but that's like that's half of the equation that matters it doesn't mean anything you you exactly and like everybody wants to obsess over these different metrics and like you know like he always says he doesn't get it you know and i'm always i question him a lot on it and he's like at the end of the day you know the likelihood of something matters 50 the other is what is your average p l attached to those likelihoods because like like you're saying right there if you if you're getting shaken out on a really low paying but high probability trade typically really poor expectancy because as soon as you get that move against you it's going to wipe out 8 10 trades and then you know you're kind of sitting there holding that i i find that to be a really uncommon conversation with people because they don't",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 67,
      "total_chunks": 96,
      "start_timestamp": "01:12:21",
      "start_timestamp_seconds": 4341.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4341"
    }
  },
  {
    "text": "probability trade typically really poor expectancy because as soon as you get that move against you it's going to wipe out 8 10 trades and then you know you're kind of sitting there holding that i i find that to be a really uncommon conversation with people because they don't like to think through that in term it's it's i like that um i like that you bring that up another example would be uh i think i think talking about stock price paths is a very interesting thing and this is something that you kind of um you'll read about if you read about like more advanced option pricing documents stuff like that or you get into the more academic side of things i should say and you go like really deep on how these things work but the path is like it's it that's everything and not frustrating is what could happen before expiration right and that's kind of where options prices get their their prices from one of the i think it's called the binomial tree is one of the pricing so basically it's like here are all the potential paths of the stock through between now and expiration and if those paths or each path is successful here's what the option price will be and basically it takes all of the different potential paths and then basically takes like a weighted average of you know adoption price values and that's the option price sheldon talks so",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 68,
      "total_chunks": 96,
      "start_timestamp": "01:13:17",
      "start_timestamp_seconds": 4397.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4397"
    }
  },
  {
    "text": "and expiration and if those paths or each path is successful here's what the option price will be and basically it takes all of the different potential paths and then basically takes like a weighted average of you know adoption price values and that's the option price sheldon talks so that i think that's like a very that's a very crude way of explaining it and if there's anybody who is effective much more specific like with that knowledge and they understand exactly how that works then maybe there are some holes in what i just said but that's well there's like one there's one that's one way to to price an option is like yeah calculate all the potential paths based on the probability and then you take the probability weighted value of that option at each one of those paths and then that option price yeah but as i was going to say earlier another example would be if you're extremely bullish on a stock and you think it's going to go up a lot of people are gravitating towards the short term options maybe seven days out and they'll buy the ottoman call and let's say you put you know 10 of your account into that trade which is obviously a large percentage pretty much yeah um and over the the next seven days like the stock price kind of trends higher maybe it gets closer to your strike but it expires out of the money and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 69,
      "total_chunks": 96,
      "start_timestamp": "01:14:27",
      "start_timestamp_seconds": 4467.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4467"
    }
  },
  {
    "text": "put you know 10 of your account into that trade which is obviously a large percentage pretty much yeah um and over the the next seven days like the stock price kind of trends higher maybe it gets closer to your strike but it expires out of the money and therefore you just lost 10 and then the next week now the stock price just shot higher and your initial outlook was completely accurate except you just had the timing wrong another way to say is that the stock price path over the duration of your trade was not specific enough and you you didn't get that part of it right and therefore you were right overall but you were wrong with your trade yeah and obviously you'd have to kind of match up your time frame with your outlook but that's again you can still miss out regardless of what time frame you choose and so that's kind of that's how that's kind of how i think when i think about the more speculative plays because i'll admit like if i'm not trading a specific trading plan with the rules all laid out which is basically the s p 500 butterfly strategy right like that's a short-term strategy because the entry is 60 days out i know exactly how i'm going to size it relative to the account i know exactly what is going to trigger the trade to be closed and then i know exactly when i'm going",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 70,
      "total_chunks": 96,
      "start_timestamp": "01:15:31",
      "start_timestamp_seconds": 4531.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4531"
    }
  },
  {
    "text": "500 butterfly strategy right like that's a short-term strategy because the entry is 60 days out i know exactly how i'm going to size it relative to the account i know exactly what is going to trigger the trade to be closed and then i know exactly when i'm going to re-enter the trade so like that's not it is speculative still because it still requires the market to accommodate the strategy but the every single trade is man it's exactly the same right the sizing for each trade is exactly the same and so it's a very easy strategist to follow over a one year two year three year period and if you are going to allocate like a specific amount of your account to an active strategy like that i think it has to be rules-based just so you can number one keep your sanity but also if you have consistency with how you manage the position and especially if you've done back testing and you've seen some encouraging results from that even though it's not the same that's better than just you know choosing 10 different stocks every month choose your prediction and then structure all these different types of strategies around your predictions and they're all differently sized you're managing them all different then at the end of the day whether you're successful or not you don't know if it was luck or you if or if it was just from discipline so yeah so that's",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 71,
      "total_chunks": 96,
      "start_timestamp": "01:16:35",
      "start_timestamp_seconds": 4595.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4595"
    }
  },
  {
    "text": "different types of strategies around your predictions and they're all differently sized you're managing them all different then at the end of the day whether you're successful or not you don't know if it was luck or you if or if it was just from discipline so yeah so that's that's kind of like the really long answer this is still on the how do you choose trades thing i think but um yeah so like if it's if it's outside of a predetermined system with rules then i'm just fully understanding of the fact that i'm speculating you know yeah you have to accept that i talk a lot about like trading plan and strategy outlines for that exact reason because i always tell people unless you learn to like identify monitor and control variables one you can't replicate and two you can't make adjustments in any sort of calculated manner to see how things go so the way that i have my personal portfolio broken out is i call them core holdings which is probably exactly what you'd assume it to be and then i have a speculative portion and in the speculative portion there's a certain set of strategies that i'll apply and i have strategy outlines for all of them for that exact reason exactly what you're talking about because the shotgun blast leads to whatever results it's going to lead to and then who knows what it will be next time right yeah i think",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 72,
      "total_chunks": 96,
      "start_timestamp": "01:17:38",
      "start_timestamp_seconds": 4658.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4658"
    }
  },
  {
    "text": "of strategies that i'll apply and i have strategy outlines for all of them for that exact reason exactly what you're talking about because the shotgun blast leads to whatever results it's going to lead to and then who knows what it will be next time right yeah i think that's a great way to learn is to experiment a lot and do a lot of that and be very active but i think if you really want to use options systematically and you want to like a lot of people want to trade options for a living for income that's the case you're not going to do that by by just doing all random strategies and coming up with your own specific predictions each week or each month it's not going to happen because that requires you to be consistently predicting short-term stock price movements which nobody can do that consistently and the shorter time you go the more uncertain it is with whatever your prediction is so if i say the market's going to go up by if i say the market's going to go up tomorrow versus the market's going to go up over the next 10 years there's a big difference between those two statements right and the shorter the term the more it is like gambling i feel and if you are really really active without a plan i also think that is gambling because unless you have a very strict plan for each strategy",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 73,
      "total_chunks": 96,
      "start_timestamp": "01:18:37",
      "start_timestamp_seconds": 4717.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4717"
    }
  },
  {
    "text": "years there's a big difference between those two statements right and the shorter the term the more it is like gambling i feel and if you are really really active without a plan i also think that is gambling because unless you have a very strict plan for each strategy that you're trading and you're sizing them all the same then you can actually figure out all right this strategy i managed them all the same i sized them all the same my results were x then you that's you can actually kind of reverse engineer that and kind of study the performance much more so than if you have 20 different trading strategies you're using you have 20 different stocks and you have you're managing them all different ways and you're sizing them all different ways it's going to be much harder to attribute success or failure to one single point so yeah yeah and that's one of the things that i think is people mature as traders they start to identify the sustainability of what they're doing it's when i was in college i used to really enjoy trading forex and i was like pretty good at it and then as i you know started my career in the marine corps i stopped trading forex and it was weird to walk away from something i was doing well at but then when i did the post-mortem on it i realized like the amount of time it was taking",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 74,
      "total_chunks": 96,
      "start_timestamp": "01:19:38",
      "start_timestamp_seconds": 4778.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4778"
    }
  },
  {
    "text": "and then as i you know started my career in the marine corps i stopped trading forex and it was weird to walk away from something i was doing well at but then when i did the post-mortem on it i realized like the amount of time it was taking me to like adequately research what i felt comfortable doing before i was placing trades i was like this isn't sustainable man like there's no way i want or probably can continue this and that's again when i kind of came across my mentor i had that conversation with him he's just like stop worrying about direction start figuring out how to place trades and work around them based on you know money management like i said before and it's exactly like you're saying like if if you're trying to consistently like guess short term returns you're just leaving it up to chance pure chance and that's something that he talks a lot about and i i share on his behalf where when i was like in the phase where i was aggressively growing my account i tell people i target at least 15 return per year sometimes that will underperform the s p 500 a lot of other times it will outperform the s p 500 kind of just depending on where things lie and what he always taught me is once you're starting to get closer to retirement to draw on this account he's like you're out of",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 75,
      "total_chunks": 96,
      "start_timestamp": "01:20:40",
      "start_timestamp_seconds": 4840.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4840"
    }
  },
  {
    "text": "underperform the s p 500 a lot of other times it will outperform the s p 500 kind of just depending on where things lie and what he always taught me is once you're starting to get closer to retirement to draw on this account he's like you're out of your mind if you're going to continue using that 15 as your planning variable like especially when you depend on your income so he's like when you're doing your planning factor make sure you have enough money that you can crank that all the way down to five six percent somewhere in there and still get the amount of money you want per month in order to live off of it and that was just an eye-opening concept because you know 15 per year is really good you know it's nothing astronomical like you said there's that dude doing 30 for like 15 years but it's modest and it's something that's attainable and it was weird to me to hear him kind of even scold that once you're trying to reliably draw on it so i think it reinforces the point you're making that you you trying to trade in a way that you have to be correct and you need to perform well in order to get what you need to get can be one very stressful and then two sets you up for failure in a pretty big way right you got to have you got to have",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 76,
      "total_chunks": 96,
      "start_timestamp": "01:21:46",
      "start_timestamp_seconds": 4906.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4906"
    }
  },
  {
    "text": "a way that you have to be correct and you need to perform well in order to get what you need to get can be one very stressful and then two sets you up for failure in a pretty big way right you got to have you got to have a plan if you look at if you look at any professional trader meaning they they trade at a trading firm they have a trading plan right like 99 of them there's there's probably very few traders that you'll talk to that don't have any resemblance of a plan and they're just they're successful year after year just from just from their predictions that are coming out of their head yeah there has to be some sort of plan as the backbone if you are going to trade very actively and especially if you're going to put like a serious amount of capital into those strategies yeah yeah i something that um obviously i know that we're well over now and like i said i i really do respect your time so thank you something i'm really curious about on that same vein though in in your thought process i get the sensation that some people when they start trading and they're applying their time they feel like they deserve a certain return because they're applying that time i'm sitting in front of the computer all of this time i should get x return at the end of the year",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 77,
      "total_chunks": 96,
      "start_timestamp": "01:22:41",
      "start_timestamp_seconds": 4961.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=4961"
    }
  },
  {
    "text": "get the sensation that some people when they start trading and they're applying their time they feel like they deserve a certain return because they're applying that time i'm sitting in front of the computer all of this time i should get x return at the end of the year and like we've both been talking about again like i read a lot of white papers from mit university of california in everything unanimously in terms of those studies says the more you touch the computer the lower the average return is for those folks so i'm curious what your thoughts are in having those conversations with those people because that's something i find myself doing a lot like trying to have a conversation to save people from themselves and essentially letting them know that you know you don't deserve and at the end of the day like the more you touch the computer the worse off you are but a lot of people you know refute that have you had a conversation like that with anybody i'm curious how you'd approach that dialogue um i've had people through email correspondence that'll say that they've been emailing me for a while yeah they've been they've been learning for probably over a year in some cases um and they they kind of get discouraged because they feel like well they'll say things like you know there's so much to this option stuff like it's really really a lot and it's true",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 78,
      "total_chunks": 96,
      "start_timestamp": "01:23:44",
      "start_timestamp_seconds": 5024.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5024"
    }
  },
  {
    "text": "while yeah they've been they've been learning for probably over a year in some cases um and they they kind of get discouraged because they feel like well they'll say things like you know there's so much to this option stuff like it's really really a lot and it's true and the i'm not sure you're probably familiar with the dunning-kruger effect which is essentially as soon as you get involved in something new you feel like you're a genius and you know everything and then that's like the peak of the like introduction phase of learning something new and then the more you learn then it goes back into like negative territory which is like wow i don't know i don't know yeah and then as you continue to get more experience you get closer to that initial baseline where you realize that you know a lot but you still are you're still acknowledging the fact that there's more to know yes i think options training is a perfect example of that because as soon as you come out of the gates and you have like your first few months of learning you feel like you're on top of the world and you know everything and you're going to be rich and then months later or a couple years later you're continuing to learn and then you realize wow like everything in the past that i thought was a holy grail strategy it's about to be a holy grail",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 79,
      "total_chunks": 96,
      "start_timestamp": "01:24:56",
      "start_timestamp_seconds": 5096.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5096"
    }
  },
  {
    "text": "the world and you know everything and you're going to be rich and then months later or a couple years later you're continuing to learn and then you realize wow like everything in the past that i thought was a holy grail strategy it's about to be a holy grail strategy turns out that this is very very difficult there's a lot to know before you can even get to a playing field where you're not making you're not losing money from mistakes or not knowing something right you're losing money because you're wrong yes and options is one of the most humbling things because you could know everything there is to about options trading and still it does not guarantee that you're gonna make it still be wrong and that's a very difficult thing to swallow for most people yeah but it's true like there's just because you know everything about options and how they work the next step is to actually implement them in scenarios where they profit yeah there's no guarantee that you can do that consistently over time and so and so that's another reason why i i focus most of my savings into passively investing because i know that over a long period of time compound interest can can grow whatever i put in now hundreds of times thousands of times in some cases depending on whatever you put it into but i don't want to risk i don't want to risk having to be",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 80,
      "total_chunks": 96,
      "start_timestamp": "01:26:00",
      "start_timestamp_seconds": 5160.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5160"
    }
  },
  {
    "text": "because i know that over a long period of time compound interest can can grow whatever i put in now hundreds of times thousands of times in some cases depending on whatever you put it into but i don't want to risk i don't want to risk having to be right about every prediction that i make knowing that i'm going to be wrong on a lot of predictions right and i don't want to structure i don't want to structure my financial future around having to be right consistently in the short term over a long period of time it's just too stressful for me so dude so yeah like options is the more the more you know the better because you can avoid you can avoid catastrophic losses through mistakes or just not knowing something yeah but there is there is a certain amount of time you have to put in before you get to a point where you're pretty comfortable that you know like pretty much all there is that you need to know there's obviously always going to be more to learn yeah and like i i consider myself to be an expert but i know that i don't know everything there's always more to learn but once you get to that point where like you know everything or as much as you need to know to actually implement these things whenever you see fit and you know what's going to happen given certain scenarios with",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 81,
      "total_chunks": 96,
      "start_timestamp": "01:27:07",
      "start_timestamp_seconds": 5227.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5227"
    }
  },
  {
    "text": "that i don't know everything there's always more to learn but once you get to that point where like you know everything or as much as you need to know to actually implement these things whenever you see fit and you know what's going to happen given certain scenarios with this position it still doesn't guarantee that you're going to make money and that's that's a difficult thing to to digest but it's true yeah it's i i like to talk a lot about it in terms of you know like the the practical understanding versus the scholastic understandings a lot of people can go really far in their scholastic understanding of options or whatever they're doing but unless you learn how to like practically apply it it's you know just the scholastic understanding and you know because things scholastically should work out x y and z way it doesn't mean in a practical sense that it's going to so i think that it's honestly really impressive um on your end that you've kind of acknowledged and looked through the way that you trade and said yes you know i'm an options trader but financially it literally makes sense for me to have this kind of two-prong approach with passive investments an option i seriously respect that so much because a lot of people that start options trading i mean like i said i trade pretty much only options and there's just so many of us that i talk to",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 82,
      "total_chunks": 96,
      "start_timestamp": "01:28:09",
      "start_timestamp_seconds": 5289.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5289"
    }
  },
  {
    "text": "me to have this kind of two-prong approach with passive investments an option i seriously respect that so much because a lot of people that start options trading i mean like i said i trade pretty much only options and there's just so many of us that i talk to they again think that well if i just continue to trade i'll pick it up and i'll start making money and you know for a lot of people they just are throwing away their future wealth you know chasing something that they're just not performing on so i think that that's really awesome and i think um i think the situation you want to avoid and this is another reason why i buy you know i'm buying stocks and buying bitcoin because i'm a bitcoiner but i'm buying these things and investing long term because i don't want to be in a situation where if i was only trading options and in a year the stock market goes up 20 and i happen to lose money trading options then that's a bad situation to be in because it's horrible yeah because you don't want to see the market go up 20 when everyone else made 20 and you lost money because you didn't have any slice of that and so that's that's kind of another reason why i'm structuring that way and i just think it's i think it's irrational for me to think that i am so smart where",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 83,
      "total_chunks": 96,
      "start_timestamp": "01:29:18",
      "start_timestamp_seconds": 5358.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5358"
    }
  },
  {
    "text": "20 when everyone else made 20 and you lost money because you didn't have any slice of that and so that's that's kind of another reason why i'm structuring that way and i just think it's i think it's irrational for me to think that i am so smart where i my predictions are always going to be true yeah that's why i with the majority of my free savings i am investing that long term but like talking about rational versus irrational like i think the most rational thing for me to do or most reasonable thing for me to do would be to take all of my savings and just put it in a passive index fund and just put all of that money into the next one and just let it run it for whatever the rest of my life and let that grow but just because i i think that is the most rational thing for me to do doesn't mean i'm gonna not be irrational with a small portion of my mind i enjoy i enjoy making predictions i enjoy trading options yeah and i enjoy you know learn implementing the things that i've learned over the past few years so like just because just because there's like a an obvious like rational approach doesn't mean i'm going to actually follow that that's just that's just human nature that that's not just with trading that's with everything like i think everyone can agree the most",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 84,
      "total_chunks": 96,
      "start_timestamp": "01:30:26",
      "start_timestamp_seconds": 5426.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5426"
    }
  },
  {
    "text": "over the past few years so like just because just because there's like a an obvious like rational approach doesn't mean i'm going to actually follow that that's just that's just human nature that that's not just with trading that's with everything like i think everyone can agree the most rational thing for me to do would be to get up every day and i should probably work out every day exercise every day because that's going to be good for me long term but even though people know that they don't do that and so there's a you have to understand that like we're all human and we're going to do things that are irrational and it's it's fine it's it's i it's a really fun conversation in in kind of hearing that that side of things because i i am the dude that wakes up every day and works out because i know i'm supposed to but also eat i had pizza last night which i know i'm not supposed to do it's that same thing right why would i go 3 000 calories of chinese food i actually yeah that i'm glad i ordered orange chicken and generous chicken because i have leftovers that i get right now i get to indulge two days in a row that's beautiful there's only supposed to be a cheat sunday yeah but i mean i also i would argue that by continuing to trade options i mean who knows man",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 85,
      "total_chunks": 96,
      "start_timestamp": "01:31:34",
      "start_timestamp_seconds": 5494.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5494"
    }
  },
  {
    "text": "generous chicken because i have leftovers that i get right now i get to indulge two days in a row that's beautiful there's only supposed to be a cheat sunday yeah but i mean i also i would argue that by continuing to trade options i mean who knows man like you absolutely can continue developing your approach and just find the next thing that works for you because something that my mentor always told me is like when you're retired you can't draw monthly income via trading stocks not consistently so he's like you have to understand a way to use your capital to be if you want to draw for income right um but again like by continuing to trade options no matter what we're still developing a skill set that in the future very likely can be very helpful to us yeah that's a great that's a great point that's uh it's a positive point i feel like we've talked about a lot of maybe discouraging things today and i don't want to be discouraging whatsoever but what you just said is perfect because as i just said to you that i'm not trading options every single day i'm not like super super active with it but i do do it but there is there's always value and having knowledge so there's this quote that my brother said he said fortune favors the prepared mind i think this this guy louis louis pasteur said it initially yeah",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 86,
      "total_chunks": 96,
      "start_timestamp": "01:32:36",
      "start_timestamp_seconds": 5556.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5556"
    }
  },
  {
    "text": "day i'm not like super super active with it but i do do it but there is there's always value and having knowledge so there's this quote that my brother said he said fortune favors the prepared mind i think this this guy louis louis pasteur said it initially yeah and now i'm now that's how i close out my newer youtube videos perfect portion papers have prepared mine so even though it may not be in your best interest to be trading options like 30 times a day or whatever it is or using them actively and just because you know the kind of the odds are stacked against active traders like the more active you are the worse you'll do statistically speaking it doesn't mean that it's a bad thing to learn something because for example let's say you give up on options you don't know how options work because they're too complicated or you hear this conversation and now you're discouraged and they're like yeah that um and then you just you don't you don't learn about options and then let's say you have a million dollar stock portfolio that grows immensely over over a multi-decade period and then there is something that happens in the world where you have this prediction maybe that you want to protect against some very unfortunate outcome with your stock portfolio so one thing you could do you could purchase put options in the s p 500 index and that would",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 87,
      "total_chunks": 96,
      "start_timestamp": "01:33:39",
      "start_timestamp_seconds": 5619.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5619"
    }
  },
  {
    "text": "and then there is something that happens in the world where you have this prediction maybe that you want to protect against some very unfortunate outcome with your stock portfolio so one thing you could do you could purchase put options in the s p 500 index and that would effectively hedge your stock portfolio and if you understand the way that you could structure that to protect yourself against catastrophic loss if you're correct about this prediction but you only give up a small portion of your profits if you're wrong then if you understand options you know how to do that exactly you can structure that trade but if you have no idea how options work then there's no way you could ever use them in any situation that could benefit you when you could be implementing them with some sort of prediction that you have um and so i think there's a lot of value in knowledge i'm a i'm a huge bookworm myself i love learning i love reading about different perspectives just because i think anything that can broaden your perspective or see something from a different angle i think that is immensely valuable and so to go along with that i think there's excuse me i think there's a ton of value in understanding active trading having experience with active trading knowing how options work knowing how futures work how the financial markets work in general i think understanding all those things it's never",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 88,
      "total_chunks": 96,
      "start_timestamp": "01:34:53",
      "start_timestamp_seconds": 5693.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5693"
    }
  },
  {
    "text": "so to go along with that i think there's excuse me i think there's a ton of value in understanding active trading having experience with active trading knowing how options work knowing how futures work how the financial markets work in general i think understanding all those things it's never going to be a bad thing to know those things because when the time comes if you are prepared with this knowledge then there could be times where you say i know exactly what i need to do and i need to do it tomorrow because i already i don't need to learn i already know everything that i need to know for this particular play and here's what i'm going to do and i'm going to put this trade on and that's it you know if you don't have the knowledge and never spent the time learning about something then you're not going to be you can't identify that circle yeah you can't open that door for yourself yeah i think i think understanding options is hugely valuable and you learn a ton about financial markets and through the process of learning options you learn about yourself you learn about you know the the trading kind of psychology like everything that goes along with trading yeah i think a lot of value in all those things especially if you get to even if it's even if it's a thing where you get to a point where you realize you",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 89,
      "total_chunks": 96,
      "start_timestamp": "01:36:01",
      "start_timestamp_seconds": 5761.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5761"
    }
  },
  {
    "text": "about you know the the trading kind of psychology like everything that goes along with trading yeah i think a lot of value in all those things especially if you get to even if it's even if it's a thing where you get to a point where you realize you know maybe i don't want to be an active trader maybe i do want to be a passive investor but if you learn those things sooner than later it's going to be better than learning them later and it's based on you know your experience so yeah it's easier for you to deploy with conviction right like i'm so i'm so grateful that i have all the experience that i have because if i was if i didn't have a lot of experience in investing or especially active trading with options maybe i would just be getting into it today and maybe i have you know a hundred thousand dollars saved up that i saved up over the last 10 years yep and now i'm just starting to learn about options with no prior experience or knowledge but i have more money now and i'm learning with a larger larger stack of cash and now i make these mistakes let's say i wipe out 10 years of savings because i didn't understand how these things work and that's not a situation you want to begin so i think learning learning is learning about these things is going to always be",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 90,
      "total_chunks": 96,
      "start_timestamp": "01:37:04",
      "start_timestamp_seconds": 5824.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5824"
    }
  },
  {
    "text": "stack of cash and now i make these mistakes let's say i wipe out 10 years of savings because i didn't understand how these things work and that's not a situation you want to begin so i think learning learning is learning about these things is going to always be valuable because at the very least you can avoid landmines and knowledge and experience is always a good thing no matter what so yeah yeah and i mean i i think just like you're saying exploring different perspectives and you know life views and whatnot it's literally the entire purpose of this entire segment is exactly that because i do find a tremendous value in it and i know when i first started trading options like most i was struggling and not doing very well and then when i was able to like drill down mentor for like literally forced me to write a trading plan to pay-per-trades like take this seriously then for me i've been just so fortunate with the way that it is changed my trajectory and it's not from you know any sort of pure luck it's just from like taking the time to like truly sit down and understand these things in how i can apply them and i think for a lot of people you know no matter what capacity you choose to apply you know something like options or whatever there's just a lot of utility in them whether you're like me and",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 91,
      "total_chunks": 96,
      "start_timestamp": "01:38:05",
      "start_timestamp_seconds": 5885.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5885"
    }
  },
  {
    "text": "sit down and understand these things in how i can apply them and i think for a lot of people you know no matter what capacity you choose to apply you know something like options or whatever there's just a lot of utility in them whether you're like me and you trade them exclusively or like you and you trade them as a component of a larger portfolio the biggest thing about trading and i think dovetailing off your psychology comment man it's individual to the person man everybody works differently you have an incredible amount of self-awareness so do i in the sense that like i know i don't know so i just try to do what i know and learn as much as i can and that's generally my approach and like your self-awareness has led you to a place where you know you can get sleep now you're comfortable with what you're doing stuff like that because there's so many people i mean i mean you saw that kid that killed himself because of some that wasn't even real right you know what i mean like just it's just insane so i totally agree with you that you know just taking the time to get the education is super important and helpful yeah and as a as a final note on that i think having experience with active trading and having experience with options but mostly just like having experience being super active in the markets can",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 92,
      "total_chunks": 96,
      "start_timestamp": "01:39:09",
      "start_timestamp_seconds": 5949.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=5949"
    }
  },
  {
    "text": "you know just taking the time to get the education is super important and helpful yeah and as a as a final note on that i think having experience with active trading and having experience with options but mostly just like having experience being super active in the markets can make you a much better passive investor as well because it can teach you it can teach you about the impulses that you feel in certain situations and then it can teach you that the best thing to do is probably nothing you know it's like with your option positions you could you could be swayed to deviate from your trading plan because of some short-term movement and when in reality you know that you have to follow the trading plan and you can't you shouldn't touch it right so from the traditional investing long-term investing perspective if you are buying stocks let's say you buy this company that you love and then the next month the stock's down 30 if you have a lot of market experience and active trading experience then you'll know that things don't always go according to plan right in fact more often than not they don't go according to plan if you're equipped with that mindset i think it can be very informing and it can help you make better decisions overall so i i definitely attribute whatever whatever future success i have with passive investing i think a large part of that success",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 93,
      "total_chunks": 96,
      "start_timestamp": "01:40:07",
      "start_timestamp_seconds": 6007.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6007"
    }
  },
  {
    "text": "they don't go according to plan if you're equipped with that mindset i think it can be very informing and it can help you make better decisions overall so i i definitely attribute whatever whatever future success i have with passive investing i think a large part of that success is going to be attributed to my experiences with more active approaches so i think having the active approach for having the active experience can make you a better long-term investor and more passively it's powerful honestly i've never i truly have never sat down to think of it that way and that's a really powerful comment and i literally as i hear you talking about i couldn't agree with the sentiment more i think that that makes a ton of sense dude so the other day experience from saul that's it fact never never a bad thing to have knowledge or experience so yeah don't don't let this conversation discourage you if you're an aspiring obstructor we basically we we kind of just talked to talks through years and years of experience and kind of the psychological rollercoaster that you have over that whole experience too so hopefully people that are just getting started or maybe just a couple years in hopefully those people can can learn from the things that we talked about today yeah man and you know like i said i i seriously can't thank you enough for your time it's super dope talking with you",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 94,
      "total_chunks": 96,
      "start_timestamp": "01:41:14",
      "start_timestamp_seconds": 6074.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6074"
    }
  },
  {
    "text": "that are just getting started or maybe just a couple years in hopefully those people can can learn from the things that we talked about today yeah man and you know like i said i i seriously can't thank you enough for your time it's super dope talking with you about this stuff i'd love to do a follow-on session with you at some point um there's definitely a lot more that i want to explore with you but um until next time you know like i said thank you so much for your time looking forward to uh to chat with you again yeah for sure thanks for having me all right brother we'll catch you later sounds good have a good rest your day yeah",
    "metadata": {
      "video_id": "UNsis2_Blb8",
      "title": "Chris from ProjectOption Pt1 | Money Talks",
      "url": "https://www.youtube.com/watch?v=UNsis2_Blb8",
      "upload_date": "2020-10-06T01:15:39Z",
      "duration": "PT1H43M7S",
      "channel_name": "Outlier Trading",
      "description": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel: ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been refining his trading approach since.\n\nStay in touch with Erik:\nTwitter & Instagram: @ esInvests \nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7\nFB Group: https://www.facebook.com/groups/esinvests",
      "content_summary": "Chris is a derivatives and equities trader with nearly a decade of experience. He has his own YT channel  ProjectOption and was a blast to chat with. He used to work at TastyTrade and have been ref...",
      "chunk_index": 95,
      "total_chunks": 96,
      "start_timestamp": "01:42:30",
      "start_timestamp_seconds": 6150.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UNsis2_Blb8&t=6150"
    }
  }
]