[
  {
    "text": "What's up everyone? Welcome back to the LR podcast. We have you, Winston Claire hanging out with his pets. And also you have a pretty cool picture of one up above your head as well. I noticed. But it looks like you have the the think tank ready to have a conversation about options trade and a. Yeah, looking forward to it. Let's go. Sounds awesome. So starting zoomed out zooming in you and I have talked a few times and I like kind of getting deeper and deeper into detail. Most people are familiar with your background. I do want to talk a little bit about your book later retail options trading that you wrote with Andrew Mac, which is a really good read. I was actually set to talk to him. He was going through some health stuff, but I'm set to reach back out to him soon and also chat with him. But to kick off at a high level, thinking about 2024, if you were to recap 2024 from your own trading and market lens, what sticks out to you any lessons learned anything draw your attention from last year specifically. Well, the only thing I really remember is being slightly unusual day was the August the fifth. I think it was the Monday after Japan, Japan dropped Sunday night. Yes, the people futures were down a lot, I think 3 and everyone was like, oh my god, this is going to be terrible. It's going",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 52,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=0"
    }
  },
  {
    "text": "really remember is being slightly unusual day was the August the fifth. I think it was the Monday after Japan, Japan dropped Sunday night. Yes, the people futures were down a lot, I think 3 and everyone was like, oh my god, this is going to be terrible. It's going to be terrible. And the next day, nothing really happened to me to it absolutely bananas, right? The big went up to I think mid 60s, in today. From I can't remember where it opens like around 20, I think it close in the mid 30s. That was a, that was a very unusual day. It's almost like, and I don't want to be like one of these people who are like the reason this happened is because there were a lot of shorts concentrated. I mean, no one knows that stuff. I mean, basically that's a good filter. If you're listening to someone on YouTube or Twitter or something, if they start going on about that stuff, you can probably tune out a lot of the other stuff basically too. But it was very interesting the way that VIX massively over reacted. Yeah. But that wasn't the interesting thing. The interesting thing was the SP VIX went above the NASDAQ VIX. And that happens almost never. Like about two and a half, three percent of the time, depending on the look back your area you've got. So to me, that was people, people ask me like, you know, what's",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 52,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.64615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=98"
    }
  },
  {
    "text": "The interesting thing was the SP VIX went above the NASDAQ VIX. And that happens almost never. Like about two and a half, three percent of the time, depending on the look back your area you've got. So to me, that was people, people ask me like, you know, what's the right. Should I look forward to what I do a trade? What should I be looking forward to try and get edge? The best way to do it is to know what something normal is like. You know, don't think about the abnormal just become so familiar with how things usually are, but then something different happens. You're like, oh my god, that's, that's not right. And then you can look for what's not right. And it's sort of a different way of approaching the world. I don't know if you've heard this story about the Chinese man who was sent to the Jade carving master to try and learn to carve Jade. And so every day the master gives him a piece of Jade and says, just hold it in your hand, just hold it. That's all he did. And I think students like, this is ridiculous. How am I learning from this in the master's like, you know, just trust me. After a year, student goes, wait, this thing you gave me isn't Jade. That's what you should be looking for when you're looking for edge as well. You should become so familiar with the normal situation",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 52,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.29230769230773,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=197"
    }
  },
  {
    "text": "am I learning from this in the master's like, you know, just trust me. After a year, student goes, wait, this thing you gave me isn't Jade. That's what you should be looking for when you're looking for edge as well. You should become so familiar with the normal situation that abnormal situation like leaked out and punches you in the face. So it's sort of the way I'm to told a detective looks at a crime scene. They kind of look at the whole thing and take it in. And it's like, what's not right here? They don't look for the thing that's standing out so much just look for the normal stuff and then like, it's kind of like a wears lolly, I guess. That thing doesn't fit. And I think trainings like that as well. And that was a very good example. If you know the relationship between the NASDAQ, Vex and Vex and you see that, you've done all the hard work. That's free money. And people get to wound up then on, but how do I trade it? Do I do straddles, do I do triangles, do I do futures. And honestly, at the point you found that dislocation, you can do about a million things and you'll make money. So the point is finding that standout situation. That's where good trades come from. People get to, it's special options. They get to wound up in the mechanics and the Greeks and all that stuff.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 52,
      "start_timestamp": "00:04:55",
      "start_timestamp_seconds": 295.9384615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=295"
    }
  },
  {
    "text": "you found that dislocation, you can do about a million things and you'll make money. So the point is finding that standout situation. That's where good trades come from. People get to, it's special options. They get to wound up in the mechanics and the Greeks and all that stuff. And should I do three week options? Should I do one week options? No, and that's such a minor part. It's not unimportant. Call the little things, the little things for a reason. Right. It's that big first observations where the money is. And honestly, that's about the only thing I can remember about last year. That was like a, I mean, obviously other things happen, but that's the standout thing for me that. And situations like that obviously happen all the time if you looking at enough things in different areas. That was that was an interesting. Well, I think the thing and I actually would like to understand in one fully agree on like the box finance talking points, right? Like summing up a complex system to a single tagline is effectively meaningless. But when you do see that kind of move that isn't supported by the subsequent move in the index, obviously the high level summary of that is people expected more than what happened. Okay, great. But for that, just looking at SPX VIX by itself. For that kind of spike to occur. Does that level of a spike mean anything to you? The fact that",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 52,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.58461538461546,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=394"
    }
  },
  {
    "text": "move in the index, obviously the high level summary of that is people expected more than what happened. Okay, great. But for that, just looking at SPX VIX by itself. For that kind of spike to occur. Does that level of a spike mean anything to you? The fact that it shot up that much on that information? Well, I think it's the difference between descriptive and predictive. Like when the VIX does that in the SP doesn't, it's pretty easy to come up with some story for what's going on and you're probably right. Right. It's probably a vol liquidation event. It's probably a lot of people will be person, trouble to trouble and they had to blast out of their VIX position or their SP options. Because otherwise the SP would have gone down quite a bit for the VIX to do that. On the other hand, going forward. Oh, what? Like how do I trade on that? And that's where the difficult it is. And I think. I think there's a tendency for people to things right people have stories. And so they always like to put a reason on top of an observation. And in this case that that reason is probably right. But it doesn't mean anything. It's kind of like, you know, you see the analysts on NFL Sunday, right? They know a lot about football. They really do. Like most of them are in the hall of fame. If you think you know",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 52,
      "start_timestamp": "00:08:13",
      "start_timestamp_seconds": 493.2307692307693,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=493"
    }
  },
  {
    "text": "case that that reason is probably right. But it doesn't mean anything. It's kind of like, you know, you see the analysts on NFL Sunday, right? They know a lot about football. They really do. Like most of them are in the hall of fame. If you think you know more about football than Jimmy Johnson, you're the idiot, right? He knows more than anyone ever going to forget. But he can't gamble on football at all. Like his picks a garbage. And it's knowing that kind of information or knowing why the VIX did that and it's liquidation event or knowing that, you know, the stock went up this much on earnings because, you know, of this line and the balance sheet. So what? That's not how you're going to make money. And I think in most things in life, knowledge is very correlated to success. But in trading, that kind of knowledge really isn't helpful. And I think in a lot of ways it can be dead from mental because it leads people. I don't know. I wouldn't say overthinking, but putting like discretionary overlays and filters and stuff on top of things. So I don't know if I want to get into this right now because it's a long story. But I was talking to someone at work about this today. I think it kind of fits. So let's say you've done some back tests, right? And you've done all the good stuff and you haven't done",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 52,
      "start_timestamp": "00:09:51",
      "start_timestamp_seconds": 591.8769230769232,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=591"
    }
  },
  {
    "text": "I want to get into this right now because it's a long story. But I was talking to someone at work about this today. I think it kind of fits. So let's say you've done some back tests, right? And you've done all the good stuff and you haven't done overfitting and you haven't got the free parameters. And you've just, I don't know, let's say the back test is I'm going to sell ESMP zero DTE options on the open every day. I'm going to sell the trend. And you look at four years of data. You've got a thousand data points and you see the PL distribution. Like, right, it's a great trade. I have an edge or at least I had an edge in the past. I'm going to do that trade. And then you do that trade for a month. And because I keep telling people they should keep records, see what's going on, try to learn. What they do and this is completely understandable is at the end of that month, I'll say, well, I've learned. I've just trade on a Thursday into half an hour after the opening. And I don't know. Don't do it after two o'clock in the afternoon. But they've now essentially come up with a trading strategy based on 20 observations. That's got three free parameters in it. Right. And they're original. One was so much better and had a thousand observations and no overfitting. And they just absolutely decimated",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 52,
      "start_timestamp": "00:11:30",
      "start_timestamp_seconds": 690.5230769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=690"
    }
  },
  {
    "text": "it after two o'clock in the afternoon. But they've now essentially come up with a trading strategy based on 20 observations. That's got three free parameters in it. Right. And they're original. One was so much better and had a thousand observations and no overfitting. And they just absolutely decimated that by thinking that their knowledge is helping. And because you've added three parameters, you're now going to need like a thousand divided by square root of three observations. Times square root of three observations to have the same statistical evidence as your original system. So learning like that is a terrible idea. You know, keeping records is really important. Doing trades is really important because I will tell you about execution. And it will tell you about intra trade volatility. And I'll tell you about adverse selection. And that's really hard to practice. But trying to sort of improve the edge based on your knowledge based on a month of trading. It's almost certainly hurting you. And I think that's where that sort of Jimmy Johnson level of knowledge hurts you. Because you've essentially basically decided you're going to completely ignore your real practice. And just override that with three stories. Because people like stories. And you want to learn, right? Oh, no, that's not true. Some people do. A lot of people don't like learning. They don't like thinking. But let's say you do, right? And you work hard and you want to learn. It's very easy to",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 52,
      "start_timestamp": "00:13:09",
      "start_timestamp_seconds": 789.1692307692309,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=789"
    }
  },
  {
    "text": "three stories. Because people like stories. And you want to learn, right? Oh, no, that's not true. Some people do. A lot of people don't like learning. They don't like thinking. But let's say you do, right? And you work hard and you want to learn. It's very easy to learn the wrong stuff. Whereas if you're, I don't know, if you're a. Businessist, you can't really learn the wrong stuff. All the stuff is right. It might not be relevant, but it's all right. You don't learn stuff is good. Trading is all like that. Some trading is hard. And that's one of the reasons I think it's hard is you can put a lot of effort in and actually it hurts you. Well, you bring up another point kind of set it without saying it that of just the path of the return sample as well. And I think that that can be really confusing to people. So dovetailing off of that idea. If there is a trader that did back test in approach. And then as they're ingesting new information, how would you recommend or discuss to them different methodologies to integrate the new information that they're getting into their test effectively versus just kind of using those random changes based on a super small sample. Right. Well, if it's about something like that first election or execution, the stuff you're learning is really good. It's good learning stuff. Right. So leave that aside. Let's say you've",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 52,
      "start_timestamp": "00:14:47",
      "start_timestamp_seconds": 887.8153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=887"
    }
  },
  {
    "text": "getting into their test effectively versus just kind of using those random changes based on a super small sample. Right. Well, if it's about something like that first election or execution, the stuff you're learning is really good. It's good learning stuff. Right. So leave that aside. Let's say you've got the, I think it's better to get it half an hour after the open idea. Okay. You observing that means nothing. What you have to do is do your test again based on that. But then you have to handicap your act test because essentially what you're doing is introducing a look back bias into your back test, right. So if your original back test gave you, I don't know. Making up some numbers, right. If your original back test gave you a sharp of two. I would want that new augmented one to give me a probably a sharp closer to three. Because every time you're adding something to it, you're making it less robust. So you've got to have a really good reason for thinking why, why half an hour. What is what does that mean? You know, the reason has to become before the. The testing and the statistics is otherwise you'll test a whole bunch of things and you'll find something. So the worst thing you could do in that situation is say, well, I think 930, what is 30 or whatever time donor in. I think that's the right time. Oh, that didn't work.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 52,
      "start_timestamp": "00:16:26",
      "start_timestamp_seconds": 986.4615384615386,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=986"
    }
  },
  {
    "text": "and the statistics is otherwise you'll test a whole bunch of things and you'll find something. So the worst thing you could do in that situation is say, well, I think 930, what is 30 or whatever time donor in. I think that's the right time. Oh, that didn't work. Let's try 15 minutes. Let's, oh, let's try 20 minutes. And you end up coming up with that ridiculous rule that popular and Indian markets a few years ago. I think it was called the 9 20 travel. Where you sold a straddle at 9 20. That's the important thing. And that's almost like a red flag, right? If it looks at 9 20, but it doesn't work at 19 or 9 45, explain to me what's special about 9 20. So it's better to start with, you know, the observation that 9 20 is special because of, I don't know, I mean, it's not in that case. And then test that. Rather than just say, well, I've noticed in the three weeks I've been doing this that that was a better time. That's where the danger comes. So, as you're talking about it, I can obviously follow how you differentiate between descriptive elements when they matter and when they don't matter. But for a new retail trader, it like what you're talking about here, I feel would be confusing. And in the context of the VIX spike, we say the reason doesn't matter, right? It's just the observation that",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 52,
      "start_timestamp": "00:18:05",
      "start_timestamp_seconds": 1085.1076923076923,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1085"
    }
  },
  {
    "text": "differentiate between descriptive elements when they matter and when they don't matter. But for a new retail trader, it like what you're talking about here, I feel would be confusing. And in the context of the VIX spike, we say the reason doesn't matter, right? It's just the observation that this is abnormal. And then in this case, we have an observation that is abnormal, but now the reason does matter. I fully, by the way, agree with you and I follow your logic. But how would you lead a basic trader to reconcile those two instances? Well, I think the VIX thing. The single observation that the VIX went up when the SP didn't. It helped me. But if I'm watching the VIX and I say, oh my god, the VIX is above the NASDAQ mix, that's a prey. I'm going to know why that's happened. I know that that happened like 2 of the time in the past. And so that's a great opportunity. And it's not dependent on what's going to happen to the VIX in the future because the VIX did this. It's just a straight-mean reversion. That relationship is wrong. So I think a lot of things can be based on analyzing distortions in things that are usually true. And I can't tell you what those things are because I don't know exactly how you'd trade. But like in my world, I'll look at the ratios of the volatility between all the index indices. You",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 52,
      "start_timestamp": "00:19:43",
      "start_timestamp_seconds": 1183.7538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1183"
    }
  },
  {
    "text": "of things can be based on analyzing distortions in things that are usually true. And I can't tell you what those things are because I don't know exactly how you'd trade. But like in my world, I'll look at the ratios of the volatility between all the index indices. You know, like recently, the Dow has been out of whack relative to everything else. Doesn't really help you because they don't trade on the same degree of liquidity, but it's an observation. Look at the relationship between the VIX and the VIX. There's a very strong relationship between those two. And then they get stretched. That's usually a sign that the VIX itself is the thing that's going to revert back. The VIX is a volatility measure, right? Those are the other money volatility. What's the relationship between those two? What happens when that gets out of line? There's the skew index. And you can get the skew from the risk reversal. What happens when they get out of line? So all those sort of things or even as simple as like, I don't know. The 5-year-10-year yield curve usually behaves like this. And basically all of these things are mean reverting trades, right? I'm saying this relationship is so strong when it gets out of line, it's going to come back. The VIX thing, it's telling you, you know, the VIX is cheap relative to VIX. You want to sell VIX options and buy the VIX. That kind of",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 52,
      "start_timestamp": "00:21:22",
      "start_timestamp_seconds": 1282.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1282"
    }
  },
  {
    "text": "mean reverting trades, right? I'm saying this relationship is so strong when it gets out of line, it's going to come back. The VIX thing, it's telling you, you know, the VIX is cheap relative to VIX. You want to sell VIX options and buy the VIX. That kind of thing. So I think the best way to do it is to look for relationships like that. And I think looking for a single signal to forecast a single thing. Like what does this mean for the VIX going forward? I don't know, that's a difficult question. But what it looks like to me is the VIX versus the NASDAQ VIX is crazy. I couldn't tell you the VIX is crazy. The VIX goes crazy all the time, right? That's not a trade I'd want to do just purely based on that. I think knowing what these relationships are, that's that, and I story about the J, right? That I held the J for a year. You're not picked this up overnight, right? The other sort of valuable things for you to learn. Looking at those things, it's not like overlaying lines on charts. It's actually doing statistics on things that are related. That's a useful thing. So yeah, I can't really remember the second part of the question you asked. No, it's completely okay. I think you hit it during that. But it opens a follow on question. We know that the world of trading obviously is difficult, multi-variate.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 52,
      "start_timestamp": "00:23:01",
      "start_timestamp_seconds": 1381.0461538461539,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1381"
    }
  },
  {
    "text": "that are related. That's a useful thing. So yeah, I can't really remember the second part of the question you asked. No, it's completely okay. I think you hit it during that. But it opens a follow on question. We know that the world of trading obviously is difficult, multi-variate. And sometimes traders can go through paths where things they might be observing or seeing might not actually represent reality. But we obviously need to see things in order to understand and build these relationships and find distortions for a newer trader that can't really tell the difference between those two. Do you have any ways to help navigate that? Yeah, come up with the simplest thing you can come up with. Like especially people with technical backgrounds like engineers, they try to engineer the market or they try to engineer their system. So they will take the observation, the European option, throw the price. Instead of saying, well, the simplest way to do that is I'm going to sell a straddle every day. They will say, well, what if I sell straddle when the SP's above it's 200 day moving average? Or what if I sell a straddle when the VIX is above this? And they keep adding more and more stuff onto it. And every time they do that, they are taking the risk that they're putting one of the curious, portrait things on. I mean, it's very unlikely that all the things are putting on are actually",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 52,
      "start_timestamp": "00:24:39",
      "start_timestamp_seconds": 1479.6923076923076,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1479"
    }
  },
  {
    "text": "the VIX is above this? And they keep adding more and more stuff onto it. And every time they do that, they are taking the risk that they're putting one of the curious, portrait things on. I mean, it's very unlikely that all the things are putting on are actually meaningful. It's quite likely none of them are meaningful, but people want to over improve something that works. So they want to take something that works and give them a sharp ratio of one. And they're like, okay, I'm going to work on this until I get to be a sharp ratio of two. That is very tempting, but it's the wrong way to do it. The better way to do it is come up with something completely different. Might also have a sharp ratio of one. And now you're not going to find perfectly anti correlated things, but they don't have to be perfectly anti correlated. You know, instead of just selling zero DCE options on the SPX, maybe sell them on the cues as well, maybe sell them on IWM as well. And people will be like, well, those things are 100 correlated and not. You know, they might only be 80 correlated, 80 and 100 are not the same thing and they really do help. So I would say keep things way simpler than you think you should. And also real eyes. Have a good idea of how much money you can expect to make and what",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 52,
      "start_timestamp": "00:26:18",
      "start_timestamp_seconds": 1578.3384615384618,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1578"
    }
  },
  {
    "text": "might only be 80 correlated, 80 and 100 are not the same thing and they really do help. So I would say keep things way simpler than you think you should. And also real eyes. Have a good idea of how much money you can expect to make and what runs profile you can expect. You know, the number of people who think they can make 1 a week, a scholarship. You know, unless you've got a really miniscule account or you're really lucky, 1 a week means you're as good as Jim Symers. Think about that for a second, right? That's like you're taking up both and you're going to be as good as Rory McElroy at the end of the year. I mean, that's just not going to happen. But if you take up both and say, you know, I want to have a 25 handicap in a year, well, you can probably do that. Equally with, especially with options, people are like, well, I want to collect the risk premium, but I don't want to lose more than three times when I make an average. It's like, yeah, I want to do that too. But if you cap your losses that aggressively, you're not going to make any money. So what you're telling me is you want to risk premium, but you don't take any risk. The risk premium is only there because you have more balls than the person who's buying the options from you. And",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 52,
      "start_timestamp": "00:27:56",
      "start_timestamp_seconds": 1676.9846153846156,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1676"
    }
  },
  {
    "text": "cap your losses that aggressively, you're not going to make any money. So what you're telling me is you want to risk premium, but you don't take any risk. The risk premium is only there because you have more balls than the person who's buying the options from you. And if you don't, if you don't like the risk profile, well, that's not the trade for you. So I guess that's the sort of thing. Keep it really simple. I mean, don't find something else that's also really simple. And don't. Especially with risk premium, right? You kind of have to just accept that it's there. I mean risk premium is really hard. Like there are things. If you want to time the market, there are things you can time. But if you think you're going to time the volatility risk premium or time the equity premium. So you're buying dips. If you can do that, you shouldn't be doing that because it means you're good enough to apply those methods for something else that will make you a lot more money. Like Warren Buffett, right? Expional investor, but he's only beating the SP by a couple of percent a year on his good years. So unless you've got a massive account, all the amount of effort you have to do to beat the SP by two sendage points. I mean, you're probably better off getting a job at Starbucks. You think of it as an income dollar per hour,",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 52,
      "start_timestamp": "00:29:35",
      "start_timestamp_seconds": 1775.6307692307694,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1775"
    }
  },
  {
    "text": "year on his good years. So unless you've got a massive account, all the amount of effort you have to do to beat the SP by two sendage points. I mean, you're probably better off getting a job at Starbucks. You think of it as an income dollar per hour, the amount of efforts you're putting in. So if you can do all that, do it on something else. Like predict stuff where the predictability is higher. Like I don't know, future spreads, right? Really strongly mean reverting. Look at five years, ten years, two years and the interest rates. Very strongly mean reverting. There's a deafening pattern there. Apply all your claiming hopes and dreams to that. And then, you know, if it's working, fine, it's the same technique you can apply to the stock market. But don't start with the hardest thing put first. You know, start easy because there's no. You don't get extra points for doing the hard stuff. You know, the guys who made all the real money on the floor with the guys who found that easy loophole. They weren't the guys who tried to solve the hardest problems. This echoes something I've heard you mentioned before. And it's something that I've always thought about in some different settings. And I think that's the reason why I think this idea of like focusing on your strengths, like the market is the kind of place where it tends to benefit people who focus on their",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 52,
      "start_timestamp": "00:31:14",
      "start_timestamp_seconds": 1874.2769230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1874"
    }
  },
  {
    "text": "you mentioned before. And it's something that I've always thought about in some different settings. And I think that's the reason why I think this idea of like focusing on your strengths, like the market is the kind of place where it tends to benefit people who focus on their strengths. Obviously, you have to fix like gross deficiencies, but you're not compensated quite as well for, you know, bringing up deficiencies to be your future strengths. Over your trading career, how did you find your trading strengths? Okay, so I'm going to do that really annoying thing people do where I'm going to go back into that question a little bit before I answer that next question. Yes, true. Love that. Good. You might have to remind me of that last bit. Gotcha. What I said there is very much applicable to you if you're a solo trader or you're trading in a pod at a food. Because then you, you can avoid the things you're bad at. Right? You don't have to do the things you're bad at. But if you're part of a team in like a real big trading firm or a bank, you don't have those choices to make. Sometimes you will have to do the things you would want to do. So, you know, you might not be any good at computer programming. But if you're a quantum bank, you're going to have to do computer programming. So you're going to have to fix",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 52,
      "start_timestamp": "00:32:52",
      "start_timestamp_seconds": 1972.9230769230771,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=1972"
    }
  },
  {
    "text": "those choices to make. Sometimes you will have to do the things you would want to do. So, you know, you might not be any good at computer programming. But if you're a quantum bank, you're going to have to do computer programming. So you're going to have to fix that whole. It's a little bit different. The things you need to be good at. Be a retail as opposed to institutional. So bearing that in mind. I don't know how I found my strengths to be honest. I don't think I did. I think other people did because they put me in situations as I was working for other people. And I think they put me in situations where I could make them the most money. And I think that's why I think I began to realize that these were the things that I could do, which were valuable in the market. So I think it's often easier for other people to recognize what you can do. And what you think you can do. Because what you want. What you think your strengths are probably highly correlated with what you want them to be. So yeah, I don't think I really sat down and said, you know what? I'm going to do. I think it was my boss at the time saying, why don't you go and do this? So, but I was lucky because. My first boss who I'm still really good friends with. He was really good.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 52,
      "start_timestamp": "00:34:31",
      "start_timestamp_seconds": 2071.569230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2071"
    }
  },
  {
    "text": "I really sat down and said, you know what? I'm going to do. I think it was my boss at the time saying, why don't you go and do this? So, but I was lucky because. My first boss who I'm still really good friends with. He was really good. You know, he gave me a lot of leeway to do stuff and with strengths comes weaknesses. One of my weaknesses is I'm not very good at grinding stuff out. I'm not going to be bored and going to do something else. And so he was very good at putting me in a situation where I could do that. Do projects here and there, go on to the next thing, go back, do this and that. So I was very lucky. And I think to be honest, anyone in any career has to have a bit of luck like that. You know, you could have put exactly me. In that same time with a different boss and things. I've worked out, you know, there's a lot of luck involved. And I think being able to find a mentor like that is exceptionally important. And I'm not going to be able to tell you how to do it. So I don't know. I think a lot of it's just luck. You know, there'll be plenty of people on LinkedIn will tell you what's about having a big network and blah, blah, blah. But those people who are always networking and coming",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 52,
      "start_timestamp": "00:36:10",
      "start_timestamp_seconds": 2170.2153846153847,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2170"
    }
  },
  {
    "text": "to tell you how to do it. So I don't know. I think a lot of it's just luck. You know, there'll be plenty of people on LinkedIn will tell you what's about having a big network and blah, blah, blah. But those people who are always networking and coming to events and stuff. Not just a moan. The big thing about someone you want to mentor is you like them. And those people, those LinkedIn type people like it's someone like them. But to me, that's just annoying. Well, I feel like it's also really superficial relationships there too, right? Because you kind of know what's going on. I'm networking just to network. And that's a much yeah, shallower style relationships. But to your earlier point, it does sound like if you do a good job keeping a trading log in like good documentation. At least get some sense of your potential strengths. Obviously, you need a large enough collection period, but that could be maybe a spot to start for something like that. Now, yeah, and I think people. I think that people are looking too much at the numbers that that keeping track of. And I'm trying to learn what those numbers tell them in terms of age and stuff. I kind of see it now as much more of a kind of a meditation type thing. Kind of you put yourself in a situation where you're thinking vaguely about the market, but not about any specific",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 52,
      "start_timestamp": "00:37:48",
      "start_timestamp_seconds": 2268.8615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2268"
    }
  },
  {
    "text": "to learn what those numbers tell them in terms of age and stuff. I kind of see it now as much more of a kind of a meditation type thing. Kind of you put yourself in a situation where you're thinking vaguely about the market, but not about any specific thing. That's sort of how ideas come to you. Look, I mean, it's a cliche, right? But I often have ideas in the chat because I've just got up. I'm still thinking my touch consciously about what I was thinking when I was asleep. I'm getting ready to go to work. I sort of think back to things I was thinking about yesterday, but got stuck on. I think it's that kind of process like when the market closes, I really enjoy that half an hour afterwards. Where I'm just writing down, you know, this strategy made this amount of money. I did many trades, got as many fields, my average film quality was this and this. I just like doing that before the open is like half an hour before the open is great. You know, you're like going through your little procedures. It's like being a pilot, right? Going through the checklist and you're excited. You're about to get to do something you like. So that's way more fun than like one o'clock in the afternoon, like in a day like today. Well, I'm just sitting around waiting for the day to end. Okay, it's just read some",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 52,
      "start_timestamp": "00:39:27",
      "start_timestamp_seconds": 2367.5076923076927,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2367"
    }
  },
  {
    "text": "Going through the checklist and you're excited. You're about to get to do something you like. So that's way more fun than like one o'clock in the afternoon, like in a day like today. Well, I'm just sitting around waiting for the day to end. Okay, it's just read some stuff played a game with Sudoku. Don't care about the basketball. I just want to go home. But before the market's open and after it's closed, that little bit of time. I think that's important. The more you think out market, the more you're going to have subconscious thought processes help. So I think I'm a bit more of a believer in that stuff that I used to be. What's something that you used to firmly believe in with respect to markets that you've kind of found to be. Not accurate. Okay, so. I wrote a blog on this recently. On whole. No, it was on a private discord thing. That was stuff from my first book, which I no longer believe, or it's certainly not to the degree I believed it. A lot of that was kind of technical stuff. Like I don't believe the sampling distribution of volatility is particularly important. I don't believe it's as important to be really good at hedging as I used to think it was. That kind of thing. I think for options trading, the big change I've made is in volatility forecasting. I used to think it was the basis for every",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 52,
      "start_timestamp": "00:41:06",
      "start_timestamp_seconds": 2466.153846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2466"
    }
  },
  {
    "text": "is particularly important. I don't believe it's as important to be really good at hedging as I used to think it was. That kind of thing. I think for options trading, the big change I've made is in volatility forecasting. I used to think it was the basis for every trading strategy. Now I can I still do it. But. I don't know that I really benefit from it at all anymore. I think all those gosh models and so forth. I think most of that is priced in most of the time. And when you see a thing like the VIX as that fix when you see something like that blow out. The actual specific model you're using to measure volatility or that relationship doesn't really matter because it's such an extreme event. So it's like if you're looking at all these different stocks, right? You want to see the one that has the most overpriced volatility. The best forecast for volatility in the world might say volatility should be 20.1. So a really simple model might say it should be 21. You know, but if volatility is 22, in either of those cases, would you do a trade? But if volatility was 30, you do a trade no matter what. You know, so I think if you're looking for big distortions, you can now. Because you know 20 years ago, there weren't nearly as many things to trade. I couldn't sign up for some scanner for like 20",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 52,
      "start_timestamp": "00:42:44",
      "start_timestamp_seconds": 2564.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2564"
    }
  },
  {
    "text": "But if volatility was 30, you do a trade no matter what. You know, so I think if you're looking for big distortions, you can now. Because you know 20 years ago, there weren't nearly as many things to trade. I couldn't sign up for some scanner for like 20 bucks a month. You know, all that stuff's out there now. If you're looking for big distortions having a really good time series model. I mean, I just probably wouldn't bother with it at all, to be honest. I don't think it's really going to make you any money anymore. It leads to a broader. Not like philosophical question, but definitely thoughtware question. I definitely noticed throughout my life that people that tend to do things longer, longer tend to continually simplify like what they're doing and get really good at staple components of whatever that thing is, whether it's things in rugby, whether it's in trading, Jiu Jitsu, like a lot of these things I see that people have been doing for a long time. It really does seem like over their careers things become simpler. And it sounds almost similar in a way to what you're doing at a higher level. What do you make of that trend? Is that something that you agree with or disagree with? And if so, what's your observation? I think it's probably true, but I think part of it is because a lot of the experience is a thing, right? If you're",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 52,
      "start_timestamp": "00:44:23",
      "start_timestamp_seconds": 2663.446153846154,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2663"
    }
  },
  {
    "text": "a higher level. What do you make of that trend? Is that something that you agree with or disagree with? And if so, what's your observation? I think it's probably true, but I think part of it is because a lot of the experience is a thing, right? If you're trading some, if you're being trading like, I don't know how long I have now 30 years or something, there's a lot of stuff that I kind of just know because I've been doing it so long. And that matters, but I might not be able to explain it to someone when I'm actually just teaching them the con day one, because I might not even know that I know that. So I think sometimes when you see that the process is simplified, it's because of there's a lot of that complex knowledge behind it that is now implicit rather than explicit. But I do also think you do simplify things because you realize the important things more. Like at the beginning, you have to do your best, you should always do your best, right? At the beginning, you have to really try to be really good at every part of the process because you don't know what the more important parts are. So I definitely think that's a factor as well. So like when I said about hedging, right? And I'm talking about dynamically belting hedging and no one who's not a market maker should be doing this anyway.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 52,
      "start_timestamp": "00:46:02",
      "start_timestamp_seconds": 2762.0923076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2762"
    }
  },
  {
    "text": "of the process because you don't know what the more important parts are. So I definitely think that's a factor as well. So like when I said about hedging, right? And I'm talking about dynamically belting hedging and no one who's not a market maker should be doing this anyway. But I just don't think it's as important as I used to think it was. So that would now be something you do still I'd have an algorithm for it, but it would be down the list of things. And it will probably never get to the top of the list of things I have to improve because it's just not the most important thing. So I think that's also an effect as well. So yeah. I think it's funny. It's funny you referenced your original book. I was reading that not too long ago just kind of poking through it. A lot of the stuff that you produce, at least from a writing perspective, it seems that there are maybe some elements that you could argue could be geared more towards institutional side of things, whether it's market making or something else. Obviously there's clear material directed towards the retail side of things right there go your latest book for sure. What like why those two different audiences for you, why do you write materials for both of them? It wasn't a plan. I was talking to someone who was an editor and she said I said there are",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 52,
      "start_timestamp": "00:47:40",
      "start_timestamp_seconds": 2860.7384615384617,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2860"
    }
  },
  {
    "text": "retail side of things right there go your latest book for sure. What like why those two different audiences for you, why do you write materials for both of them? It wasn't a plan. I was talking to someone who was an editor and she said I said there are no good books or professional options traders and she said already right one. And so that was a book basically aimed at market makers, because it was all about dynamically hedging complex positions. So by the way, I don't believe any of that stuff about psychology in that book and I don't really believe a lot of the stuff about sizing in that book either but that's way more what I don't believe about that's way more nuanced. It's really criteria and it's really important in a different way. The second book was like okay I think Nadenberg's got the job right up at a introductory book and then the third book was much more on the on the buy side. It was like quantitative traders for quantitative traders who literally want to positionally trade, but you're not dynamically hedging. So it's a different thing. So I guess each one kind of aligned with what I was doing at the time. The last one didn't. That just sort of happened by accident really. It came about because first will retail has been huge over the last five years. I think it's a lot of trade and I think it's the",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 52,
      "start_timestamp": "00:49:19",
      "start_timestamp_seconds": 2959.3846153846152,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=2959"
    }
  },
  {
    "text": "kind of aligned with what I was doing at the time. The last one didn't. That just sort of happened by accident really. It came about because first will retail has been huge over the last five years. I think it's a lot of trade and I think it's the most important thing that's happened to the industry ever. I think it's fantastic. I think a lot of professional traders. I hate gatekeepers in anything, but it strikes me as very odd that you could be a professional trader and not think it's a good thing when your industry is expanding. That book came about largely because I'd been booking to Andrew through DMs and privately and stuff for a long time. And I always thought. I always thought in general retail could bring ideas from outside the industry. You know, because at a certain point everyone in the industry has read the same books. They've gone to the same classes. You don't get new ideas from those people. The idea was retail can bring you stuff and Andrew's really has done that. Like I've learned a ton from him. So that book really came about as a. We were just trying to sort of throw down the conversations we'd had. And if someone on Amazon said, look like it'd be rushed. I wouldn't say it was rushed, but it was definitely done in a hurry. And because we didn't. We wanted to put it out in the hurry specifically.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 52,
      "start_timestamp": "00:50:58",
      "start_timestamp_seconds": 3058.0307692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3058"
    }
  },
  {
    "text": "just trying to sort of throw down the conversations we'd had. And if someone on Amazon said, look like it'd be rushed. I wouldn't say it was rushed, but it was definitely done in a hurry. And because we didn't. We wanted to put it out in the hurry specifically. We wanted to get it out before the election because we thought there'd be a lot of opportunities. Then we didn't quite make that. I think we got it out two days before, which is probably point points for people. But we wanted it to be kind of an immediate thing. Certainly not as polished. I don't like the writing in it, but I think the ideas in it are really good. I can see that person's point on Amazon. There was another person who wrote that there's nothing new in there. That is not going to make it because. Literally the entire section about finding inefficiencies is completely new. It's never been done anywhere in any book on anything in any other kind of trading. So we were that was largely Andrew, by the way, but we were really happy with that. But I'm not the whole thing is kind of a mess because if you want to talk about options. You've got to talk about Greeks, you've got to talk about implied volatility. But we didn't want to write 50 pages on those things before you get to the next thing. So it's all jumping around and. It's",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 52,
      "start_timestamp": "00:52:36",
      "start_timestamp_seconds": 3156.6769230769237,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3156"
    }
  },
  {
    "text": "kind of a mess because if you want to talk about options. You've got to talk about Greeks, you've got to talk about implied volatility. But we didn't want to write 50 pages on those things before you get to the next thing. So it's all jumping around and. It's not going to be your first book, right? It shouldn't be. And I think we say that start. But so I don't really like it as a book. But I think the contents excellent. Well, even off of the point on. There's nothing new in there. I can definitely see the non-dessurning readers experience if they've read your other books. And they just saw similar topics for some of the things that you covered in your other books. But I actually noticed a lot of variance in even some of the topics that I've seen in multiple of your other books. So yeah, it's. You've seen this more than I have, but there's never a shortage of critics. I always would point to those people and say, where's your book? I would love to. I think people have this idea that. You know, they sometimes I get questions is like, I read this book in this book. What am I reading next? And at a certain point, I mean, you've read the stuff you need to read. I just started. Yeah, now reading about trading is not trading, right? It's like you could read a lot of books on rugby.",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 52,
      "start_timestamp": "00:54:15",
      "start_timestamp_seconds": 3255.3230769230768,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3255"
    }
  },
  {
    "text": "I read this book in this book. What am I reading next? And at a certain point, I mean, you've read the stuff you need to read. I just started. Yeah, now reading about trading is not trading, right? It's like you could read a lot of books on rugby. Eventually, you've got to go and play a game. So I think people always think there's another secret there. There's another thing they should know. And after a certain point, there really isn't. Particularly with the mechanics of options. I mean, what do you want me to say about gamma? It's there. It's all been said. Yeah, I mean, it's always really tempting when you get a critic like. I don't mean criticism if it's valid criticism, right? But when someone does something that's clearly more of a reflection on them in the book. Like, you know, I don't know what to tell you. Or as you say, it's a certain. Someone who isn't very discerning. You know, I mean, at a certain point, you can't care about those people too much either. There are opinions really don't matter, right? Yeah, well, tends to be lazily informed. One of the things that I find interesting with respect to sizing is you go into the concept of continuous Kelly, which is. I actually think is really, really pertinent. I mean, I think that's why people just, you know, viewed in the binary sense. And then also overlaying that with fractional because",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 52,
      "start_timestamp": "00:55:53",
      "start_timestamp_seconds": 3353.969230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3353"
    }
  },
  {
    "text": "things that I find interesting with respect to sizing is you go into the concept of continuous Kelly, which is. I actually think is really, really pertinent. I mean, I think that's why people just, you know, viewed in the binary sense. And then also overlaying that with fractional because regular Kelly can be a little bit scary. Are there other optimization models that you think are worth loosely exploring with respect to sizing and risk outside of Kelly? Yeah, I think there are lots because. I think that's why people who was the risk manager at AQR finance professor been around forever notes everything. He won't say that Kelly is the optimal solution to a problem that no one actually has. And that. What Kelly does is it will maximize your long run route. No one really is around for the long run in that sense, right? People really even if they think in long run terms, they want to have more money in five years than they do now. And Kelly's not going to guarantee you that you can have the best edge in the world. And Kelly might take you 1,000 down to one cent before it goes ballistic and makes tons of money. So I think you have to start with the concept behind Kelly that if you have more edge, you bit bigger. You have more risk, you bit small. You should bet proportional to the size of your account. But there's a lot of",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 52,
      "start_timestamp": "00:57:32",
      "start_timestamp_seconds": 3452.615384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3452"
    }
  },
  {
    "text": "goes ballistic and makes tons of money. So I think you have to start with the concept behind Kelly that if you have more edge, you bit bigger. You have more risk, you bit small. You should bet proportional to the size of your account. But there's a lot of other things you've got to sort of overlay on that too. Like you have to have an idea. What's the probability of me finishing up at the end of year? Because especially if you're an institutional trader, that's what you want. Because if you finish down, you're not going to get a bonus and you're probably get fired. So having a probability based model of probability of making money in a certain time, that is a valid thing to look at optimizing as well. And I talk about that in the first book, but I'm like, I called sit brown. The problem with that is as you get close to that time period at the end, we're going to end up taking massive bets. If you just follow his rule. So you have to sort of put a whole bunch of caveats on that one as well. And the other thing is you don't want your money to go from a thousand down to one cent. So you have to incorporate some sort of risk control. And Kelly doesn't have that because Kelly's like, look, the risk control is you've asked me to throw your ban crawl. I'm doing exactly",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 52,
      "start_timestamp": "00:59:11",
      "start_timestamp_seconds": 3551.2615384615387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3551"
    }
  },
  {
    "text": "thing is you don't want your money to go from a thousand down to one cent. So you have to incorporate some sort of risk control. And Kelly doesn't have that because Kelly's like, look, the risk control is you've asked me to throw your ban crawl. I'm doing exactly what you asked me to do. Now, don't tell me that it's too volatile. That's not my problem. This is what you asked me to do. So you've got to put something on top of that. That's also kind of based on sit brown stuff. I talk about that in the position option trading book. Basically what I do is I split my account into a risky bit and a safe bit. And then I go full Kelly on the risky bit. And I read out between those. Typically 90 of the risk free bit. So that gives you a big upside possibility. But you're not going to lose more than 10. So it's kind of setting a floor. And I prefer to do that then use fractional Kelly. The guys who used fractional Kelly, it goes back to the blackjack. They have a hard stop at the end of each trip. You know, they have a ban crawl for that trip. So they've always kind of got a risky part and a safe part as well. So everyone always says no one uses for Kelly. People don't really use fractional Kelly either. You've got your house, right? You're not",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 52,
      "start_timestamp": "01:00:49",
      "start_timestamp_seconds": 3649.9076923076927,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3649"
    }
  },
  {
    "text": "each trip. You know, they have a ban crawl for that trip. So they've always kind of got a risky part and a safe part as well. So everyone always says no one uses for Kelly. People don't really use fractional Kelly either. You've got your house, right? You're not mortgaging everything you own to put in your trading account. And then go full Kelly on that. So your house is like out of the safe part of your ban crawl. So anyway, that's what I do. So I think you don't have to use Kelly. But if you don't understand it, you really haven't thought very deeply about size. Now, when you're thinking about the general trajectory for a trader, you mentioned one thing that I'm always, I don't know, I'm not shocked by, but I see it where it feels like when I talk to newer traders, they have a lot of things that they want, right? Like they want a good return. They want really consistent returns. They don't want big draw downs. They don't want to spend a lot of time and so on and so forth. When you're talking with traders trying to guide them into like the right mindset, when it comes to like even how to approach this problem, what kind of expectations to even have? How do you approach that? I don't know. Is there a trading problem? Or is that just a life problem? You know, because I think if you",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 52,
      "start_timestamp": "01:02:28",
      "start_timestamp_seconds": 3748.5538461538463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3748"
    }
  },
  {
    "text": "into like the right mindset, when it comes to like even how to approach this problem, what kind of expectations to even have? How do you approach that? I don't know. Is there a trading problem? Or is that just a life problem? You know, because I think if you talk to someone who was, I don't know, a cabinet maker, right? I tell you, I want to make the greatest furniture in the world. I want to sell it to these people. I want to own as chain of stores. I don't want to work on Sundays. I mean, they've all got multiple goals as well. So I'm not sure that's entirely a trading specific thing. The thing that I think is most important, though, is. You've got to have a very good understanding of the edge you've got. And the natural variance that comes with that edge. Because you can't take an edge and then put a stop on it. And keep all the good stuff. So you've got to first before you do anything in terms of risk control or draw down or anything. You've got to have a really good idea of before I do any of that stuff. What is the distribution of my results look like? And you have to be basically happy with that distribution. And then like with selling straddle say, then you can be like, well, okay, I don't want to lose my house. So what is the absolute maximum I",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 52,
      "start_timestamp": "01:04:07",
      "start_timestamp_seconds": 3847.2000000000003,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3847"
    }
  },
  {
    "text": "of that stuff. What is the distribution of my results look like? And you have to be basically happy with that distribution. And then like with selling straddle say, then you can be like, well, okay, I don't want to lose my house. So what is the absolute maximum I can lose? And I don't mean. Oh, I'd be sad if I lost three times the straddle. I mean, the market doesn't care if you're sad or not, right? But it's legitimate to say if I lose 30 times the straddle price, I'm in a bit of a problem. So having that idea of knowing the natural distribution and then putting it in a catastrophic edge, that makes sense. And then you can calculate how much am I throwing away by doing that? And then you see is it's still worth it. So I think basically you're not going to get all that stuff until you really understand the edge first. Because everything comes from edge. That's funny. And I think people want to sort of wrap up that edge in a risk profile they like as well. And that's not always the case. In terms of that other stuff, you don't want to work too hard, you do all that. Just from an attitude standpoint, if you don't think about this all the time, you're probably not going to be good enough, right? But some people out there who think about stuff all the time. So sometimes you'll find",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 52,
      "start_timestamp": "01:05:45",
      "start_timestamp_seconds": 3945.8461538461543,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=3945"
    }
  },
  {
    "text": "you don't want to work too hard, you do all that. Just from an attitude standpoint, if you don't think about this all the time, you're probably not going to be good enough, right? But some people out there who think about stuff all the time. So sometimes you'll find a trade, you know, like I don't know, I saw options over the weekend that takes two minutes. But I'm not doing it because it takes two minutes. I just happened to find that because it's like anything right? Go back to my cabinet maker. You don't become the best cabinet maker in the world by kind of wanting to do it. You become good because you really that's what you do. It's what you are, right? Now, the other thing though is if you're really good, you're probably not going to want to not do it very often. But also if you're really good, you're going to end up with money. And money's going to buy you the ability to do lots of different things like that as well, right? You can have you can employ someone at that point. Watch your trades. You know, you can employ someone which means you can take three weeks off in the summer and go somewhere else. So making money takes care of a lot of these problems. But I'd be very wary of someone who said I don't want to put too much time in. I think most people I know",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 52,
      "start_timestamp": "01:07:24",
      "start_timestamp_seconds": 4044.492307692308,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4044"
    }
  },
  {
    "text": "which means you can take three weeks off in the summer and go somewhere else. So making money takes care of a lot of these problems. But I'd be very wary of someone who said I don't want to put too much time in. I think most people I know who are good put too much time in. You know, because they're always thinking about it. Probably not always in a really productive way. Yeah, and I imagine that's got to be the case from like a professional side of things, right? Because it's what you do. I think the path for a lot of retail traders is it's something that they try to do in addition to like a standard profession. So understanding that paradigm and I know that we're coming up on time here. How would you walk one of those traders onto like a realistic target, right? Obviously to your point, they're not going to be able to fit everything exactly how they want and you know continue to do this other stuff. But obviously they're also saying, well, can I do this as like a supplement or can I do this to help me grow? What kind of like realistic guidelines or targets or just ways of thinking about it. Would you give somebody like that? Well, first I'd be very careful about. Are they doing this because they really want to do this? They're going to make them some money like learning how to play",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 52,
      "start_timestamp": "01:09:03",
      "start_timestamp_seconds": 4143.138461538462,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4143"
    }
  },
  {
    "text": "kind of like realistic guidelines or targets or just ways of thinking about it. Would you give somebody like that? Well, first I'd be very careful about. Are they doing this because they really want to do this? They're going to make them some money like learning how to play daily fantasy sports or something. Does you like it? And you might make some money. If you're doing this to supplement your income, that's a really bad thing because income is like a steady stream of money trading is very much not. So if you need that money from trading, you should not be trading. Or something. After that, there are very low touch ways of trading. So you can certainly be have a full time job and still do this stuff. A lot of the most successful trades I've got are overnight. Right. So you put them on the clothes, cover them in the morning. You're pretty much done. So that'll be like 15, 20 minutes trading. You know, there's earnings trades like that. There's the weekend trade overnight things, not as. All these things go through ups and downs, right? But those things are all very low patch. And even if you want to, you can't adjust them because the market's closed. Which is actually another good reason like good is because you can't over complicate them and fuck them all up. So there's that. And there's also a lot of other options trades. Kind of evolve at",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 52,
      "start_timestamp": "01:10:41",
      "start_timestamp_seconds": 4241.784615384616,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4241"
    }
  },
  {
    "text": "And even if you want to, you can't adjust them because the market's closed. Which is actually another good reason like good is because you can't over complicate them and fuck them all up. So there's that. And there's also a lot of other options trades. Kind of evolve at a fairly low frequency. You know, like buying options before earnings. You know, you buy them two weeks before and you just let them go. Let them breathe. You'll do better with that if you go to your day job and just pick them once in a. So I think in a lot of cases, a lot of these kinds of trades. You're probably going to do better if you aren't like fully on the more the time. So I think it's definitely possible. In that regard. And it sounds like one of the main elements there is like. It in approach it. Something more so to your lifestyle. And what can work like to your exact point, right? Like if somebody's not able to check the phone during the day. Or is it really just the same way that you're trading an overnight thing that you can take off in the morning? Then that seems to fit the broader requirements that they have. Obviously, there's a drawback to that. It's not fully going to be optimal necessarily, but it's something that broadly fits. Yeah, I just emphasize to people to start. Find trades that have edge and then ask",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 52,
      "start_timestamp": "01:12:20",
      "start_timestamp_seconds": 4340.430769230769,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4340"
    }
  },
  {
    "text": "in the morning? Then that seems to fit the broader requirements that they have. Obviously, there's a drawback to that. It's not fully going to be optimal necessarily, but it's something that broadly fits. Yeah, I just emphasize to people to start. Find trades that have edge and then ask yourself, can I do this trade? attention you can give it or whether you can psychologically deal with it or whatever. Don't say, you know what, I need a trade that's this and this and this. So I'm going to do this. You've got to start with the edge and then ask yourself, can I do that? You know, like, oh, you think it's scary selling options? Okay, but buying options is just, you're going to lose all your money. So just because something's scary doesn't mean you can automatically just do the thing that isn't scary. Like, that's the wrong way around. What it means is, if you think it's scary to sell options and that's fine, it just means that trade's not for you. Well, go and find another trade amongst all the hundreds that have edge that is for you. So as long as you start with that process, this trade won't make money. Is it a trade I can do? You know, because like, I don't know, capital structure arbitrage, that makes money, but it's not a trade I can do because, you know, I can't trade convertible bonds at billion dollar clicks. So there's plenty",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 52,
      "start_timestamp": "01:13:59",
      "start_timestamp_seconds": 4439.076923076924,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4439"
    }
  },
  {
    "text": "that process, this trade won't make money. Is it a trade I can do? You know, because like, I don't know, capital structure arbitrage, that makes money, but it's not a trade I can do because, you know, I can't trade convertible bonds at billion dollar clicks. So there's plenty of things out there and you then will find that are not for you. So you just have to keep looking, but it always starts with edge. Don't start with your other requirements, your other requirements are not unimportant, but the market's not hit a market. Right. Okay, we are nearly at time. I'd one, one other question at a curiosity. You obviously spend a lot of time specialing in volatility. Have you tinkered or explored with, I hate the term it's so cringe-worthy, but you'll know what I mean. Like different kinds of options flow. Like if you're seeing things like big volume over OI or like those kinds of things, have you tinkered with those and if so, what's your experience? Yeah, I have there's some acronym for it. Like, essentially, it's a volume weighted, a volume weighted open interest by Sprite, right? So you're on and it does have limited predictable power for the stock going forward. It does. But the bad inference from that is to say, well, I'm going to book for Paul Walls or big hedging things and that's like the only game in town. It is an effect, but it's a minor effect",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 52,
      "start_timestamp": "01:15:37",
      "start_timestamp_seconds": 4537.723076923077,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4537"
    }
  },
  {
    "text": "does have limited predictable power for the stock going forward. It does. But the bad inference from that is to say, well, I'm going to book for Paul Walls or big hedging things and that's like the only game in town. It is an effect, but it's a minor effect and usually it's not an effect at all. Sometimes it is like around expiration, you'll see pins to strikes and stuff. So that it's a real thing. I think the danger is when people think it's a really important real thing. And what they're really telling me is I, who am not a professional trader, know more about how options should be hedged than Susquehane. You know, all those guys do all day is hedge options. So there is a way of the world right now, which will tell you, you know, experts know the least about any problem, which I would have to disagree with. I want to buy no, you know, an expert. But yeah, it is an effect. And it also there is, if you're doing very high, you know, minute by minute trading, you can sometimes see a big options trade and piggyback on that, like a big call buyer. But the problem is it's actually quite difficult to know if it's a call buyer or a call seller. You know, you've got to actually be looking at the order book level and see who initiated it. How long it was on the order book, all",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 52,
      "start_timestamp": "01:17:16",
      "start_timestamp_seconds": 4636.369230769231,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4636"
    }
  },
  {
    "text": "a big call buyer. But the problem is it's actually quite difficult to know if it's a call buyer or a call seller. You know, you've got to actually be looking at the order book level and see who initiated it. How long it was on the order book, all that kind of stuff. It's not easy to do that kind of stuff. I think I'd probably put that down in the, it's a, it's a thing, but is it the thing you should be doing? It's not the easiest thing, you know, I'll do the easiest stuff first. Makes sense. Awesome. Last question, then we'll get you out of here. You have your new book. It's available pretty much everywhere, right? Like I've seen it online all over the place, retail options trading with Indra Mac. Do you have anything else in the pipeline? Any more books we can expect? I doubt it. I said when I'm thinking, well, I haven't got anything to write about. Like I only wrote this because Indra wanted to do it. So if he wants to do something else, I'd be happy to do it just for the amount of stuff I learned from him. Okay, so I'll probably, I'll proud him. I've got a few papers I'm working on, but nothing on the book side. Yeah, but you should talk to him. Most of the really innovative, different stuff in that was from him. So he's got a really interesting way of",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 52,
      "start_timestamp": "01:18:55",
      "start_timestamp_seconds": 4735.015384615385,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4735"
    }
  },
  {
    "text": "from him. Okay, so I'll probably, I'll proud him. I've got a few papers I'm working on, but nothing on the book side. Yeah, but you should talk to him. Most of the really innovative, different stuff in that was from him. So he's got a really interesting way of looking at the market. I could see it. And one of the things that was actually kind of fun is compared to the people that, I don't know, I just hate people that bitch about stuff without like good cause because I actually found both of your writing styles fascinating. Like you literally could immediately tell when it's a switch in some of the like the actual sections and you can kind of pick up some of the context about how you both just view things. So I'm actually really looking forward to connecting with them. I had a chance to talk to him just a little bit. He seems absolutely awesome. So yeah, I'll definitely look to bring them on. And then for your papers, are these going to be like published on SSRN or where do your papers tend to land? But yeah, I mean, they'll probably end up on SSR in first. I mean, you can, any idiot can put anything on there. So typically you dump something on there and then go through the whole referee and process, which takes like six months. Yeah, I mean, we submitted something, I don't know, last September and it's",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 52,
      "start_timestamp": "01:20:33",
      "start_timestamp_seconds": 4833.661538461539,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4833"
    }
  },
  {
    "text": "up on SSR in first. I mean, you can, any idiot can put anything on there. So typically you dump something on there and then go through the whole referee and process, which takes like six months. Yeah, I mean, we submitted something, I don't know, last September and it's still going through the process. And that's not uncommon. I didn't realize the lag was that much though. I mean, that's, oh, it could be over a year easily. Yeah, that's like no one reads journals anymore. Everyone reads the preprints and then we're getting in the journal as kind of a validation. But no one reads the journal first. It's all preprint stuff. Yeah. Well, awesome, you and absolutely awesome to hang out. Is there anywhere that you want to send people to? Obviously, I'll throw a link to the book, but anywhere else that you want to send, send people to check your stuff out. I'm on LinkedIn, like technically, I hardly ever go there because I don't understand why anyone wants to. It's all seems pretty boring. And you can find me if you go to whole technical blog, I usually write something very non-technical once a week. Very short, very non-technical, like 7800 words. Yeah, I'll throw a link to all those for everybody. But in the meantime, as always, it's a pleasure. I know that sometimes you'll say that you don't know what to talk about, but I always find stuff interesting in your perspectives,",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 52,
      "start_timestamp": "01:22:12",
      "start_timestamp_seconds": 4932.307692307692,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=4932"
    }
  },
  {
    "text": "week. Very short, very non-technical, like 7800 words. Yeah, I'll throw a link to all those for everybody. But in the meantime, as always, it's a pleasure. I know that sometimes you'll say that you don't know what to talk about, but I always find stuff interesting in your perspectives, refreshing. They're fun. So thank you for taking the time to hang out. Thanks so much. Interesting talk to you again. Have a good",
    "metadata": {
      "video_id": "uOY6kRco6r4",
      "title": "Euan Sinclair on How to Build Options Strategies That Work | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=uOY6kRco6r4",
      "upload_date": "",
      "duration": 3802.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 52,
      "start_timestamp": "01:23:50",
      "start_timestamp_seconds": 5030.953846153846,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uOY6kRco6r4&t=5030"
    }
  }
]