[
  {
    "text": "What's up outliers, Eric here. We're going to talk about zero DTE strategies for small accounts. For those that don't know, I trade zero DTEs literally every single day. It's a big part of my book. And in general, I think they're very difficult to apply in smaller trading accounts, but the goal of this video is to walk you through a little bit about the background of zero DTEs, how it can make sense. And then to give you some ideas on how it might be able to fit into your portfolio, but it's a tight squeeze. That's all there is to it. I'm thinking of this from the context of like a 10,000 account and under, but ideally, we would be trading something way more than that and you'll see why that matters so much. So let's dive straight in and get to it. So what are zero DTE options? Well, there are essentially options that expire the same day. So today's the 10th of September, if I traded, which I did, zero DTEs, it means I trade options that are expiring the very same day. That's all. And what's the idea behind this? Well, a lot of people think it's fast, easy money, which I guarantee you it is anything but that. However, there is a significant opportunity available in zero DTE options. So here are a couple studies that you can take a look at. This is called zero DTE trading rules. And then this one",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=0"
    }
  },
  {
    "text": "people think it's fast, easy money, which I guarantee you it is anything but that. However, there is a significant opportunity available in zero DTE options. So here are a couple studies that you can take a look at. This is called zero DTE trading rules. And then this one is called retail traders love zero DTE options, but should they? And these talk a bit about the phenomenon of zero DTE options. And I'll explain exactly what this is. And for those that are in the Patreon, you can download I have a file that kind of compiles all of these studies for ease, but these are all free and accessible for everybody. You can just look them up on SSRN. So what's the profit mechanism for zero DTE options? In this case, I'm primarily looking at variance risk premiums. What is that? Simply put, it's the tendency for implied volatility to trend over historic volatility. I have a video that goes into zero DTEs in detail that I'll link to below. It's literally an entire playlist, but there's one specifically called master zero DTE options that I'll share with you so that you can learn way more about the background. I want to kind of build off of that spend less time on the theoretical background and talk about the application. So this is essentially variance risk premiums. And what you'll notice is these yellow lines represent implied volatility, which is forward looking. These white lines represent historic",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:01:35",
      "start_timestamp_seconds": 95.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=95"
    }
  },
  {
    "text": "the background. I want to kind of build off of that spend less time on the theoretical background and talk about the application. So this is essentially variance risk premiums. And what you'll notice is these yellow lines represent implied volatility, which is forward looking. These white lines represent historic volatility, which is backwards looking. And you'll notice that in general, the yellow lines are above the white lines in general. There will be periods that the white lines come above the yellow lines, but it's not always. And you'll also notice some very specific qualities about the lines when it does that, which we'll talk a little bit about more in detail. So what's going on here? Again, not to rehash the other videos, but to get everybody level set, this is simply the tendency for options to be priced too richly with respect to volatility, compared to what the market ends up moving, which again, that's what historic volatility is. So we're expecting in pricing in more movement than is actually happening. And this is very persistent. Again, you can check out those studies, not take my word for it. I will always do my best to connect you with resources that you can look at for yourself. And if we look back over a longer-term timeframe, again, you'll see that this is generally the case. There will be periods where it's not. Again, take a close look at those periods because it's an important factor. So that's",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:03:11",
      "start_timestamp_seconds": 191.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=191"
    }
  },
  {
    "text": "you with resources that you can look at for yourself. And if we look back over a longer-term timeframe, again, you'll see that this is generally the case. There will be periods where it's not. Again, take a close look at those periods because it's an important factor. So that's in a nutshell, what zero DTE options are all about. So what's the signal? Exactly what we just talked about. Now, that signal can be caused by event-related things. So maybe an FOMC announcement is coming out and that's driving up volatility or just the overall persistence of variance or spring-moms, which again, is a documented phenomenon. Now, one really important admin note here is for people that sell volatility very often here, the idea of, you know, we sell vol when it's high and buy when it's low. That's actually not exactly correct. It's kind of a simple way to create a rule of thumb, but it's not representative. And I'll show you what that means. Really, this signal and what matters in this case, what we're measuring is IV over HV. This can happen if implied volatility is high or this can happen if implied volatility is low. And I'll show that to you. So if we take a look at this period here, we can see over the past year, which this is what's showing you, again, that's what the aggregation is of the chart, you'll see that this is actually the highest period of volatility over",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:04:46",
      "start_timestamp_seconds": 286.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=286"
    }
  },
  {
    "text": "And I'll show that to you. So if we take a look at this period here, we can see over the past year, which this is what's showing you, again, that's what the aggregation is of the chart, you'll see that this is actually the highest period of volatility over the past year, where short-term vol and then for 30-day vol, it's the second highest compared to this period over here. So volatility on a relative basis is very, very high in this instance. Yet, realize volatility or historic volatility is even higher. So this is an example where if you sold volatility when it's high, it didn't matter because you still got beat out by price. So again, the important is the relationship between implied and historic. That's actually what these purple lines plot for us. I can get rid of all these yellow lines and just have these purple lines because it's charting the difference for the same time frames between these. And again, for those that are in the Patreon, there is a download available in the shop that's free for all Patreon members that has this very thingscript for you. It's one that, as you can tell, I use all the time because it helps me visualize this. So that's the signal. Now, when it comes to capturing, I'm gonna use things like short options. I use short strangles or short straddles, but that's not going to work for small accounts because if you are on",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:06:22",
      "start_timestamp_seconds": 382.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=382"
    }
  },
  {
    "text": "tell, I use all the time because it helps me visualize this. So that's the signal. Now, when it comes to capturing, I'm gonna use things like short options. I use short strangles or short straddles, but that's not going to work for small accounts because if you are on a regulation T account, it's gonna be probably hundreds of thousands of dollars. If you wanna sell a 20 Delta short strangle, for example, in SPX. So then we have to think about, and for those that are curious in a portfolio margin account, it's like 75,000. So that's gonna be heavy for most smaller traders. So then how can we think about a way to run this approach? Well, I back tested it for us, so that we have some data that we can look at. Again, the way that I do this is ideally built on a process that's deployed long-term. So that's why back testing something like this, it actually doesn't involve a lot of discretion. It's kind of generally running the strategy. And that's why you'll notice I have this concept of occurrence-based and careful discretion because I am still discretionary. There are certain conditions that, based on my personal strategy, will lead me to enter or not enter or delay in entry, but you have to be so careful about it because the performance of all this specific kind of strategy, it's kind of an aggregate numbers sort of thing. As you have more and",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:07:57",
      "start_timestamp_seconds": 477.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=477"
    }
  },
  {
    "text": "based on my personal strategy, will lead me to enter or not enter or delay in entry, but you have to be so careful about it because the performance of all this specific kind of strategy, it's kind of an aggregate numbers sort of thing. As you have more and more occurrences, the output will approximate towards the value of the strategy. So if you start cutting too many occurrences because of discretion that's skewed in some way, that will drastically impact your results. So using discretion is completely okay, but you have to very carefully track it so that you're not killing the output of the system. So let's take a look at a couple studies. Again, the other videos in the playlist have huge study sets on this. So I'm gonna skip through some of the high points. I already know, based on my studies, that the better entry times are later in the day. So this is looking at Eastern Standard Time, essentially 13, 30, or 1400 entry periods, tend to be best. So I carry that through the study. This is just looking at short calls, deltas, long call, short put, long put deltas, the lot size in this scenario is looking at a too lot. And then these are all gonna be zero DTEs. There's no max profit applied to any of them, but there is a stop loss applied. And again, this is based on what I've seen previously that not having a max",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:09:33",
      "start_timestamp_seconds": 573.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=573"
    }
  },
  {
    "text": "size in this scenario is looking at a too lot. And then these are all gonna be zero DTEs. There's no max profit applied to any of them, but there is a stop loss applied. And again, this is based on what I've seen previously that not having a max profit tends to increase the performance, you can again, go back to the playlist that I referenced before that goes to all of this super foreign detail. So this is looking at a 10 delta strangle, 15 delta strangle, 10 delta strangle, 15 delta strangle, at 13, 30, 1400 respectively. And you can see that these are good performing strategies. The reason why I show you the difference in a half hour between these is to show general robustness around the time frame. Then I take a look at adding wings. So I have a 10, 15 strangle, but I'm buying the five delta wings for both. I do that at 13, 30 and then 1400. You could see at 13, 30, it does not do well. You can see one important difference here though. Take a look at the width of the spread, five points versus 10 points. Take a look at the change in PL. It's much, much, much higher performing at the wider spread with no PL management applied. Then when we take a look at 1400, which is, again, I'm just picking a time period. I'm not trying to optimize it heavily. I'm just trying to",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:11:08",
      "start_timestamp_seconds": 668.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=668"
    }
  },
  {
    "text": "a look at the change in PL. It's much, much, much higher performing at the wider spread with no PL management applied. Then when we take a look at 1400, which is, again, I'm just picking a time period. I'm not trying to optimize it heavily. I'm just trying to show you a concept. So if we take a look at 10 delta, 15 delta again, doing the entry at 1400, notice that the performance increases massively for the kind of wider iron condors. Well, really for this. But again, take a look at the width of strikes and take a look at the impact of performance. So the first takeaway you can grab from here is that wider is better. Now, this is going to be dependent on what your account can afford. Because if you're doing something like a 15 delta and five delta, we can look at it together really quick. Let's grab, I'll use a 1DTE. It's not going to matter because it's a defined risk trade. But let's sell this 15 delta and buy the five. And then let's do the same thing on this side. We'll sell the closest to 15 and then we'll buy the five. And then let's take a look at what that grabs us for margin requirements for grand. So even if you have a smaller account, again, if you have a 5,000 account, this is now your entire account in a trade that's kind of dangerous. And the other",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:12:44",
      "start_timestamp_seconds": 764.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=764"
    }
  },
  {
    "text": "buy the five. And then let's take a look at what that grabs us for margin requirements for grand. So even if you have a smaller account, again, if you have a 5,000 account, this is now your entire account in a trade that's kind of dangerous. And the other problem you have is if you have a 5,000 account, you're risking 3,265, which is way too much. So you might have to start playing and that's why I show you with a stop loss and you actually notice it really improves the performance of the strategy for both. Now, a really important note, this is in a frictionless environment. This is not including fees. This is not including spread, which would absolutely chew these to pieces. The performance for all of these will contract meaningfully. So one of the ideas is to decrease occurrences number of trades. It's to decrease the number of legs as much as possible. And we want to try and touch the trade as little as possible once it's on because fees are quite detrimental. Now, the last thing I wanted to show you, however, is that the 10 point Y 20 delta did not perform quite as well. It had a decent win rate, but still underperformed. But again, the 20 delta, five delta without profit management absolutely crushed the 15 delta, five delta without profit management. So there's absolutely an important argument to be made for managing profit on the iron condors or",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:14:19",
      "start_timestamp_seconds": 859.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=859"
    }
  },
  {
    "text": "perform quite as well. It had a decent win rate, but still underperformed. But again, the 20 delta, five delta without profit management absolutely crushed the 15 delta, five delta without profit management. So there's absolutely an important argument to be made for managing profit on the iron condors or their spreads that are being used. But again, in a non-frictionless environment that includes fees and transaction cost, there is absolutely a cost associated with it. So let's talk about a couple other things really quickly. I want to highlight this path dependence. And I actually asked you to pay attention to this earlier. Path dependence is essentially one of the properties you'll find in returns in general and volatility really amplifies it because volatility does this thing called cluster. Where when it goes through a transition, it tends to hang out in a new place for a little while before it transitions again. So if we take a look at short term volatility, which is the white line and the bright yellow line, you'll notice that when it's breached, it tends to be breached for a few days before it comes back down. So for example, in this case, December 20th, it was still okay with slight VRP. Then on the 21st, we actually turn negative. Then if we go to the 22nd, we're still negative. If we go to the 26th, we're negative, go to the 27th, we're coming back to break even. So what I'm highlighting in",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:15:55",
      "start_timestamp_seconds": 955.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=955"
    }
  },
  {
    "text": "December 20th, it was still okay with slight VRP. Then on the 21st, we actually turn negative. Then if we go to the 22nd, we're still negative. If we go to the 26th, we're negative, go to the 27th, we're coming back to break even. So what I'm highlighting in this instance is for me, if I get stopped out and I know that volatility is starting to expand, I actually might not place some trades. On additional, that's the discretionary portion because I know volatility tends to cluster. It's very infrequent that you'll see where this white line like this here, where historic volatility exceeds implied and it's only for a day. It's infrequent that I see that. So a lot of the times when I'm trading variance risk premiums, I will wait until historic volatility on a short term timeframe is less than implied volatility. Because again, if you just do it ad nauseam, completely indiscretionary, you'll get these results which are still good, you can optimize them a little bit. So zero DTE for beginners in specifically small accounts, I think that they absolutely can be applied, but they have to be very, very, very carefully used. Because for example, even if you have a 10,000 account, and you look at the 15 and fives, and you're like, wow, that's pretty good, 49,000 return on a two lot. Well, here's the problem. The max loss is 1650. So even if you have a 10,000 account, that's way",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:17:30",
      "start_timestamp_seconds": 1050.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=1050"
    }
  },
  {
    "text": "Because for example, even if you have a 10,000 account, and you look at the 15 and fives, and you're like, wow, that's pretty good, 49,000 return on a two lot. Well, here's the problem. The max loss is 1650. So even if you have a 10,000 account, that's way too big of a loss on an individual trade. Because these again are path dependent and you need a number of occurrences in order for the returns to approximate. So if you have a 10,000 account, you might actually have to look at a slightly suboptimal 10 and five wide, so that your max loss is now contained to 860 bucks, which I actually would argue is still a little bit too high. You might have to be even tighter than that. So the main issue that small accounts are going to find when trading something like this is the ability to put on something that is logical, that makes a decent return, that still captures the benefit of what the structure is and what the profit mechanism is without giving up too much profit in order to reduce max risk. That's the main issue that these are gonna run into. Now, the last thing I wanna highlight is for me, if I'm gonna let them go into expiration, it has to be European style options. If it's not European style options, then you have the risk of assignment and that opens a big problem. The other benefit to using",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:19:06",
      "start_timestamp_seconds": 1146.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=1146"
    }
  },
  {
    "text": "into. Now, the last thing I wanna highlight is for me, if I'm gonna let them go into expiration, it has to be European style options. If it's not European style options, then you have the risk of assignment and that opens a big problem. The other benefit to using something like SPX as compared to other products, you can use something like XXXSP, which is slightly smaller, it's gonna be less liquid and the problems you're gonna face in this in terms of spreads are gonna be exacerbated, but it's also doable, but the other benefit you get is section 1256 of the tax code where 60 of the gains are gonna be long term, and 40 will be short term, which will be at your rate. The last note is that when it starts to suck is when it's important to keep doing the strategy because the way that this works if you follow the math, on your average win, it's 200, for I'm just picking this 10 Delta here randomly. Your average loss is 4.65. So as soon as you have one loss, it's at least wiped out two wins. And again, that's in a frictionless environment. It probably would be a little bit worse than that. If we're looking at the spreads, it's even worse still. If we're looking at the 10 shorts, 5 longs, you have 107 average win with 220 average loss, not terrible, but then if you're doing the 15 and 5s, to",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:20:41",
      "start_timestamp_seconds": 1241.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=1241"
    }
  },
  {
    "text": "It probably would be a little bit worse than that. If we're looking at the spreads, it's even worse still. If we're looking at the 10 shorts, 5 longs, you have 107 average win with 220 average loss, not terrible, but then if you're doing the 15 and 5s, to 20 average win, 714 average loss. So really, really difficult to make these up without giving yourself enough runway to get enough occurrences on. So another thing that I like to look at, and I can look at in a future study if we'd want, is the propensity for average losing streaks, so that you have an idea of what that looks like. I use that pretty heavily in all of my strategies, so that I can at least have an understanding of what is likely to occur. It's not limited to that. You can always have longer streaks, but it gives me some ideas. So it doesn't feel like I'm flying quite blind. So hope the video's useful, specifically zero DT options for small accounts. It's a tricky prospect, but can be done. SPX again is the preferable tool, in my opinion, but something like XSP is also viable, and it will trade at a tenth the size as SPX. It'll give you similar performance overall to what I just showed. The difference is the spreads will be worse, so your actual performance will be a little bit different, but otherwise the rest of the theory and all that",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:22:17",
      "start_timestamp_seconds": 1337.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=1337"
    }
  },
  {
    "text": "and it will trade at a tenth the size as SPX. It'll give you similar performance overall to what I just showed. The difference is the spreads will be worse, so your actual performance will be a little bit different, but otherwise the rest of the theory and all that stuff applies all the same. As always, any questions, let me know, be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "UPNR9270_48",
      "title": "0DTE Strategies for SMALL Trading Accounts",
      "url": "https://www.youtube.com/watch?v=UPNR9270_48",
      "upload_date": "",
      "duration": 941.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:23:52",
      "start_timestamp_seconds": 1432.5,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UPNR9270_48&t=1432"
    }
  }
]