[
  {
    "text": "how did I go from consistently underperforming the market to consistently beating the market well this video is exactly how it's through trading plans strategy outlines and trading logs this is the work of trading so my goal in this video is to walk you through how I approach all of those different tools what's up everybody Eric here welcome back to all the outliers and shout out to the patreon family you guys make content like this possible for everybody else so if what I do helps you in any way consider signing up let's get straight to it so how did I go from underperforming the market really consistently over my first 5 years I think there was one year that I outperformed the market and even in that year technically I was still negative I was just less negative than the SP 500 how did I go from that to where I'm at now where as I look at my performance from 2018 to 2022 this shows my returns on average were 24.6 my compound annual growth rate was actually a little bit lower than that but that's about my compound pound annual growth rate from when I started in 2007 until the last full year in 2022 how did that happen well it is from this from Trading documentation so what's the purpose what are these tools for the first thing is for organization the markets literally have infinite variables you as the trader cannot be",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 0,
      "total_chunks": 23,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=0"
    }
  },
  {
    "text": "I started in 2007 until the last full year in 2022 how did that happen well it is from this from Trading documentation so what's the purpose what are these tools for the first thing is for organization the markets literally have infinite variables you as the trader cannot be another uncontrolled variable the problem with that you're never going to see the same Market twice it'll have you know similarities but it's never the same thing so if you do not have a good understanding of what works optimally when and when you should use different tools you kind of just bounce between things like if you ask yourself right now how did you do 6 months ago you might not know but if you don't have good trading logs to go back and look to see then what good is the information that you mastering that time frame if it's only as good as your memory so organization forces you to track these things so that you can optimize over time which that's number four but you'll hear hear me reiterate that a few times it's a thought exercise the second purpose for doing these things is so that you are not building the plane as you are flying it what that means is think about when you are in a stressful scenario when you don't really have a clear plan of action what tends to happen to people some people like to climb mountains I like to",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 1,
      "total_chunks": 23,
      "start_timestamp": "00:01:01",
      "start_timestamp_seconds": 61.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=61"
    }
  },
  {
    "text": "that you are not building the plane as you are flying it what that means is think about when you are in a stressful scenario when you don't really have a clear plan of action what tends to happen to people some people like to climb mountains I like to build planes in the air if you're in a kinetic scenario people very frequently will freeze when you're in a financial trading scenario from the comfort of your home you still might mentally freeze you still might make bad decisions typically we do when we're under a lot of pressure without any preemptive thought this is the same thing in the Marine Corps if you're in the military you definitely have gone through planning exercises and the main purpose of those planning exercises is to have an idea of what you're going to do but we fully acknowledge that what we end up doing rarely looks exactly like what we're planning but that plan gives you something to go off of because my boy Mike Tyson set it the best everybody has a plan until they get punched in the mouth so the whole idea behind that is we have an idea of what we're doing and then we can adjust as needed off of it but it gives us a starting point and that leads us into planning because I ask my community regularly like hey what what are your trading objectives and I'm actually really surprised how frequently",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 2,
      "total_chunks": 23,
      "start_timestamp": "00:02:04",
      "start_timestamp_seconds": 124.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=124"
    }
  },
  {
    "text": "an idea of what we're doing and then we can adjust as needed off of it but it gives us a starting point and that leads us into planning because I ask my community regularly like hey what what are your trading objectives and I'm actually really surprised how frequently I get really insane objectives or none at all some of them will say oh I'm just trying to practice this strategy what's the point of that like what is the point of that the whole point of trading is to make money if everything you're doing in trading is not in the purpose of making money you literally are wasting your time that's harsh man so when we're planning out our efforts we should always go back to what is our goal and then make sure everything we're doing serves that ultimate goal sure if you want to learn random things here and there go for it but the whole idea is that it should be pretty specifically designed to move you closer to your end state that should be clearly defined optimiz ation without this it's very difficult to get better as I look back at my returns again using my first 5 years they're unimpressive my first two years were negative that's also cuz I started in 2007 but my third fourth fifth year they were all positive but they were like trailing the market by like tenths of a point I wasn't outperforming the market so",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 3,
      "total_chunks": 23,
      "start_timestamp": "00:03:05",
      "start_timestamp_seconds": 185.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=185"
    }
  },
  {
    "text": "again using my first 5 years they're unimpressive my first two years were negative that's also cuz I started in 2007 but my third fourth fifth year they were all positive but they were like trailing the market by like tenths of a point I wasn't outperforming the market so what I was doing wasn't working objectively and because I started this process of outlining what I think I'm doing via the plans I have my strategies in terms of how I think I'm going to trade my different tools and then logs to validate them I was able to objectively look at the information and say this is not working these things look to show the best promise let me try to develop these further without that we are just running in circles and that leads to the fifth point if you don't go through this process of creating these tools you lose so much time and effort when I talk about things like paper trading one of the beautiful Parts about it is not just to validate a strategy without losing money but it's because you were learning along the way and you're creating a data set I cannot overemphasize that part enough creating a data set drastically increases your efficiency because then it's not a guessing game you don't look at the market and say hey the Market's behaving like XY or Z what should I try next as you build out this toolkit you know what",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 4,
      "total_chunks": 23,
      "start_timestamp": "00:04:04",
      "start_timestamp_seconds": 244.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=244"
    }
  },
  {
    "text": "cannot overemphasize that part enough creating a data set drastically increases your efficiency because then it's not a guessing game you don't look at the market and say hey the Market's behaving like XY or Z what should I try next as you build out this toolkit you know what works best so it drastically decreases the amount of wasted effort that you can then feed back into your system again to further optimize and then accountability I'm not going to go through the whole psychology of trading and what that all looks like that's a whole other conversation but suffice it to say that we all have an ego none of us like being wrong and we don't like reconciling when we are at fault unless you get good at it unless you get used to it so accountability in your trading plans via trading logs all of these different tools it forces you to take accountability for the things you can control and to optimize those things to make sure that you are controlling them and fixing them in case they're not working for example if you have a mental stop and then the trade goes past your stop and you don't do anything and then you have this giant loss even though you had that stop written in your trading plan but you just didn't let it go you're to blame you know exactly who dorked that trade up and it's you so it forces us to",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 5,
      "total_chunks": 23,
      "start_timestamp": "00:05:05",
      "start_timestamp_seconds": 305.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=305"
    }
  },
  {
    "text": "stop and you don't do anything and then you have this giant loss even though you had that stop written in your trading plan but you just didn't let it go you're to blame you know exactly who dorked that trade up and it's you so it forces us to come to terms with our own performance which is absolutely massive so now that we understand why this stuff so important and why I spend so much time talking about these concepts with you guys let's get into what the trading plan looks like so mine typically has somewhere around 8 sections big sections and then it's just massive now mine is literally like 380 Pages as it sits that's because my trading plan has evolved it's not even I don't even label as a trading plan anymore I label as wealth development it has my real estate stuff in there my Angel Investing stuff in there because what I'm doing in terms of tracking applies to all of my business ventur so these are the primary sections and I'll walk you through each of these so that you have an idea of what they look like so that when you download the free guide at the end you kind of have a jump start on what this thing should look like the very first section purpose and goals there's nothing you know fancy here this is one of the most interesting things about trading in my opinion is that",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 6,
      "total_chunks": 23,
      "start_timestamp": "00:06:05",
      "start_timestamp_seconds": 365.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=365"
    }
  },
  {
    "text": "you download the free guide at the end you kind of have a jump start on what this thing should look like the very first section purpose and goals there's nothing you know fancy here this is one of the most interesting things about trading in my opinion is that I am by all accounts average all accounts the reason why my performance continually outperforms the market is literally because of structure organization stuff like this I'm not super smart I just make sure that I'm using the best information I have to inform my decision-making so purpose and goals there's two sections to that we have the desired end State this is what we're trying to accomplish in investing in totality and then we have kind of midterm objectives I typically break this out 6 month maybe I don't do that anymore myself but you know you can I used to I used to do 3 6 9 12 but we have short-term objectives so stuff that's less than a year one-ear objectives 5year objectives 10e objectives again inspect what you expect the whole purpose of this is to force you to think through what you're doing and it's funny because my mentor trading Mentor is the one who literally forced me to start thinking about a trading plan specifically strategy outlines that was the main thing he was harping on and once I realized how impactful that was I started building it out into all of these other",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 7,
      "total_chunks": 23,
      "start_timestamp": "00:07:05",
      "start_timestamp_seconds": 425.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=425"
    }
  },
  {
    "text": "funny because my mentor trading Mentor is the one who literally forced me to start thinking about a trading plan specifically strategy outlines that was the main thing he was harping on and once I realized how impactful that was I started building it out into all of these other things I bring that up to your attention because do not get overwhelmed here I'm going to run through a bunch of with you guys don't look at this and be like wow this is so much I don't even know where to start even if you have no clue where to begin this process start right here purpose and goals open up the example that I'm sharing with you guys or open up a blank word dock put these sections in there and just start so many people could literally transform their lives if they just start doing don't let your dreams be dreams yesterday you said tomorrow so just do it and then you can fix fix it as you learn more as you go along you're not going to have all the answers don't worry about all of that what you need to worry about is the mental hurdle of allowing that to not permit you starting something just start so now we know what purpose and goals is this is just giving us guide right what are we trying to do here General market notes this is a large section of my trading plan that walks",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 8,
      "total_chunks": 23,
      "start_timestamp": "00:08:05",
      "start_timestamp_seconds": 485.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=485"
    }
  },
  {
    "text": "mental hurdle of allowing that to not permit you starting something just start so now we know what purpose and goals is this is just giving us guide right what are we trying to do here General market notes this is a large section of my trading plan that walks through a ton of things this I would consider broadly optional for you but there's a couple things in here that I would implore you to include if you would the first thing here I have is structure this literally is how does the market work how do options work I have like an entire section on the history of options you don't have to do all that that's just cuz I'm a nerd about this Music but what you should pay attention to are mechanisms how markets operate that's important AKA what does a broker do that's important for you to understand how does the impact the market how do different economic factors impact the market those kinds of things are good to build out over time studies is exactly what that sounds like I spent a lot of time reading through different things different report outs from the big Banks different studies off of academic papers and I track the outputs of that it's useful for me you don't have to do that this one I do think you need observations this is literally where you just capture what you saw happen in the market and what that",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 9,
      "total_chunks": 23,
      "start_timestamp": "00:09:05",
      "start_timestamp_seconds": 545.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=545"
    }
  },
  {
    "text": "big Banks different studies off of academic papers and I track the outputs of that it's useful for me you don't have to do that this one I do think you need observations this is literally where you just capture what you saw happen in the market and what that means to you the reason why this section is so important is because this starts getting our brain tailored towards Pattern recognition that serves you massively in the long run so I highly encourage you to include that section the next we have this is actually backwards boom we're back at it and it's fixed so what we look at in the third section is analysis so in here I'm looking at things like just how do I think about conducting analysis and for me I actually have a video coming out soon on technical analysis but I'm very interested in having an efficient process meaning I start with really big filters that get rid of most things and then I hone in over time to the best possible tools for me to look at products for me to look at and the reason for that is because there's a lot of things out there to trade but I tell you what you can get rid of a lot of them again as an options Trader if they don't have options boom get rid of a ton of stuff right there stuff like that so my overall guidance here for",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 10,
      "total_chunks": 23,
      "start_timestamp": "00:10:09",
      "start_timestamp_seconds": 609.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=609"
    }
  },
  {
    "text": "lot of things out there to trade but I tell you what you can get rid of a lot of them again as an options Trader if they don't have options boom get rid of a ton of stuff right there stuff like that so my overall guidance here for Section 3A is think about how you can do whatever you do efficiently and then when you look at technical analysis tools fundamental analysis tools I have kind of subsections under each of these I have what tools I use and then I kind of created a library of everything that I've experimented with and that's on purpose the reason being is I'm able to tie things I've tested to an actual note section on outlining what the tool is and then what my experience was using that tool so then if I ever want to go back to the archives and say hey maybe I'll dust this one off and try it again I'm not starting from scratch again I I can literally recall all of these different details and again you could start with the simplest things for technical analysis you could start with trend lines and just write out how you think you will use them this all feeds in and evolves over time so don't get overwhelmed up front and then systems this is actually where I capture known entire trading systems can slim for example that goes into my analysis tools you can put that",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 11,
      "total_chunks": 23,
      "start_timestamp": "00:11:11",
      "start_timestamp_seconds": 671.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=671"
    }
  },
  {
    "text": "write out how you think you will use them this all feeds in and evolves over time so don't get overwhelmed up front and then systems this is actually where I capture known entire trading systems can slim for example that goes into my analysis tools you can put that wherever you want really but that's where I track notes on known developed systems for me to reference that's all now trade checklist super simple this is just where I write out a generalized pre and post- trade checklist the reason why I use the term generalized is because each strategy will have specific things that matter to it that belong in the individual trade checklist but there are things that apply to everything so when I think about generalized pre-trade checklist it's literally things like looking at the broad stock market and seeing what the overall trend is what is the trend of the sector that you want to trade or the stock that lives in that sector what's that sector doing stuff like that is earnings coming up for the product that you're trading are there any announcements all of those kinds of things fall into the general category that apply to literally every single thing that you put on the idea here admin know don't make this massive because if you make your pre and post post- trade checklists too big you're not going to do it you're just not going to do it so make this",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 12,
      "total_chunks": 23,
      "start_timestamp": "00:12:02",
      "start_timestamp_seconds": 722.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=722"
    }
  },
  {
    "text": "category that apply to literally every single thing that you put on the idea here admin know don't make this massive because if you make your pre and post post- trade checklists too big you're not going to do it you're just not going to do it so make this efficient put things in there that matter to what you're doing but don't put stuff just for the sake of it again because you will lose adherence now portfolio management this is a big section this is where I break down allocations so that's how I put my portfolio into core and speculative I have a video out on portfolio management that talks about this stuff but this is where I get into detail on how do I treat my core allocations how do I treat my speculative allocations how do I allocate money from the entire portfolio into those two buckets how do I think about risk management there's two levels to risk management in my opinion there's the portfolio level that applies to everything you have on your book at a given point in time and then there's the individual trade risk management protocols I Define that stuff here here how I think about utilizing the account and then what metrics I need to track in order to assess my performance in service of this desired end State and my objectives again don't let this stuff overwhelm you if this section seems way too massive way too much",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 13,
      "total_chunks": 23,
      "start_timestamp": "00:13:00",
      "start_timestamp_seconds": 780.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=780"
    }
  },
  {
    "text": "here here how I think about utilizing the account and then what metrics I need to track in order to assess my performance in service of this desired end State and my objectives again don't let this stuff overwhelm you if this section seems way too massive way too much stuff going on in there literally just put risk management and think about how you're going to manage risk in your portfolio cuz you need to do that no matter what now let's take a look at strategy outlines you'll notice over here that there's actually kind of a a section and for each strategy outline there are a handful of key sections that I look at this says that there's more four main sections and I actually think that that's correct because there's the executive summary setup management and Analysis this fifth section can be tied either to the individual strategies or later down the line actually in section s which is notes and rfis so this is kind of like a bonus section but these are the main pieces to a strategy outline the executive summary literally is like the assd test this is do you understand how this strategy works it should be three to five sentences in outline exactly how this thing makes money as if you're explaining it to a child this is purposefully designed to just make sure that you have a solid understanding of what this thing is the second section here is",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 14,
      "total_chunks": 23,
      "start_timestamp": "00:13:57",
      "start_timestamp_seconds": 837.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=837"
    }
  },
  {
    "text": "this strategy works it should be three to five sentences in outline exactly how this thing makes money as if you're explaining it to a child this is purposefully designed to just make sure that you have a solid understanding of what this thing is the second section here is the setup so this is what we're looking for how this thing makes money how do we scan for whatever the strategy calls for what technical fundamental analysis indicators are you going to use and what do you need to see from them how do you expect to allocate money to this strategy how do you expect to outline your initial outlay how much money you're going to use up front and then any scaling protocols either in or out all of that should be built out into your setup section management is exactly what that sounds like how do you intend to manage the trade throughout the life cycle there's kind of three main things you can consider there's time bound management there's profit management Loss Management you can start with those sections or you can take a look at what I have here for your own but again this is forcing you to think through how you're going to manage to this position before it goes on even before you like find what's going on for this position you should have all of this outlined for yourself analysis so when we're building out our trading log and we're",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 15,
      "total_chunks": 23,
      "start_timestamp": "00:14:57",
      "start_timestamp_seconds": 897.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=897"
    }
  },
  {
    "text": "this is forcing you to think through how you're going to manage to this position before it goes on even before you like find what's going on for this position you should have all of this outlined for yourself analysis so when we're building out our trading log and we're making sections for each of our strategies this tells us what Details Matter for this strategy for example if I'm trading zero DTE SPX variance risk premium strategies so call it short strangles short straddles zero DTE I really don't care what the onee trend is I really don't care I might care what the 5day trend is or what the average daily range is those might matter to me I also might care about the variance risk premiums IV versus HV but then if I'm trading something like ratio diagonals I don't really care about IV versus HP so this is where we like put down what things matter to our strategy and how do we track them this is what's going to feed our trading log setup later and then again this RFI tracking section I'll pull it up over here as well well but in terms of the individual strategies this is just what do you want to test for that individual strategy maybe you want to try instead of zero DTE 5 DTE maybe you want to try 14 DTE this is just where you hypothesize different permutations of your strategy and then you test them",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 16,
      "total_chunks": 23,
      "start_timestamp": "00:15:54",
      "start_timestamp_seconds": 954.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=954"
    }
  },
  {
    "text": "the individual strategies this is just what do you want to test for that individual strategy maybe you want to try instead of zero DTE 5 DTE maybe you want to try 14 DTE this is just where you hypothesize different permutations of your strategy and then you test them now in terms of the broader trading plan this notes and RFI section I highly encourage you to actually start with this first one which is a self assessment sounds super lame boring esoteric whatever the reason why this is important is because this forces you also how do you like that uh Arrow right there really nailed that didn't I I'm using the mouse so chill out oh that's not good either there we go that's better you must be joking the reason why this is so important is because it starts to force you to look at yourself and start analyzing yourself if you're going to do this longterm and be successful guess what you need to do analyze yourself if you think about the difference between different Traders we all have access to the same tools you have the same platform I do you now are going to have the same trading plan outline that I do you're going to have the same technical analysis tools that I do so on and so forth yet there is such a massive variance in performance why it comes down to the individual to the trader so this is where",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 17,
      "total_chunks": 23,
      "start_timestamp": "00:16:59",
      "start_timestamp_seconds": 1019.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1019"
    }
  },
  {
    "text": "to have the same trading plan outline that I do you're going to have the same technical analysis tools that I do so on and so forth yet there is such a massive variance in performance why it comes down to the individual to the trader so this is where we acknowledge that aspect and we try to find things that we're good at and then specifically for our weaknesses we need to make sure that it doesn't impact our trading and if it does we need to create known controls about it so what I mean by that is if you're impulsive if you go into things too quickly this is where I would literally list that out as a weakness I'm impulsive I tend to do things without fully analyzing them to control this I'm going to force myself to complete the pre-trade checklist for every position I put on before entering the trade something like that also in here is where I'm going to list out my performance reviews I like to look at my performance every single month kind of an in-depth Deep dive so I literally would just write down you know for September this is how I did this is what worked well this is what didn't work well this is what the market did so that I have a log of what works when then I also have kind of this section for audits this is kind of important to include because I",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 18,
      "total_chunks": 23,
      "start_timestamp": "00:17:55",
      "start_timestamp_seconds": 1075.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1075"
    }
  },
  {
    "text": "is how I did this is what worked well this is what didn't work well this is what the market did so that I have a log of what works when then I also have kind of this section for audits this is kind of important to include because I believe it is really wise for Traders to embrace external audits have other people look at your and give you feedback if they start reading through your trading plan and they're like hey well what do you do in this scenario that tells you that you're not defining that quite well enough and you probably should think through it because if there's too much variability in Your Capacity to deploy there's a good chance that you are going going to pick route a sometimes route b sometimes and then you're not going to understand what works best over the long run now let's take a look at the trading log very quickly and then a couple last things beyond that the trading log for me is super simple I use Excel you can use Google Sheets you can automate some of it if you're so inclined I do but I really am an advocate of the process of inputting the trades the reason why I'm an advocate for that is it gets you closer to the data as compared to just porting things over via an API or something like that now I have the first tab is just kind",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 19,
      "total_chunks": 23,
      "start_timestamp": "00:18:50",
      "start_timestamp_seconds": 1130.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1130"
    }
  },
  {
    "text": "really am an advocate of the process of inputting the trades the reason why I'm an advocate for that is it gets you closer to the data as compared to just porting things over via an API or something like that now I have the first tab is just kind of a portfolio summary and different calculators so that's actually what this is right here just literally summarizing the portfolio I have a binomial tree calculator here this is kind of like a a workshop version I'm actually looking at producing a version of this for the patreon family that's what this is it's a work in progress variant of that but I have things like how the market is doing year-to date stuff like that and then I also have you know different calculators expectancy blah blah blah blah blah this is something you can build out over time the reason why I like the portfolio summary section though which will live over here is because it summarizes the key notes from the individual strategy tabs so the reason why I have individual strategy tabs is because the things that I need to track are different and it's very difficult to combine all of that into one tab so each strategy has its own Tab and that's it so all of the individual strategy tabs then feed into the portfolio summary and then I have another section where I run different studies maybe you're curious how a 50-day crossover",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 20,
      "total_chunks": 23,
      "start_timestamp": "00:19:44",
      "start_timestamp_seconds": 1184.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1184"
    }
  },
  {
    "text": "difficult to combine all of that into one tab so each strategy has its own Tab and that's it so all of the individual strategy tabs then feed into the portfolio summary and then I have another section where I run different studies maybe you're curious how a 50-day crossover works works and you start back testing it well don't just do that and not track what you're doing because then that data is only as efficacious as your memory is don't do that what you should do is consider something like this like this where you track the results of your study now you have a reference point it might not be perfect it might not be the best study on planet Earth but it gives you something again when we're going through this trading log it gives us an opportunity to validate strategy performance we get to see how our portfolio is behaving and then we get to test our hypothesis and quantify the outcome because lots of people have very Rosy Recollections about how good things went when really they might not have gone that well so it forces us to reconcile that so those are trading plans strategy outlines trading logs I talk about these all the time because they are absolutely pivotal it is work but it's something that evolves over time so you don't have to get stuck in the mud early on start simple and build on it if you have any questions",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 21,
      "total_chunks": 23,
      "start_timestamp": "00:20:41",
      "start_timestamp_seconds": 1241.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1241"
    }
  },
  {
    "text": "plans strategy outlines trading logs I talk about these all the time because they are absolutely pivotal it is work but it's something that evolves over time so you don't have to get stuck in the mud early on start simple and build on it if you have any questions comments concerns any anything that you want to dive into a bit further let me know this is where Traders are made this is where people become outliers by doing this work be an outlier see you guys later",
    "metadata": {
      "video_id": "utJ76_O6BNI",
      "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
      "upload_date": "20231122",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
      "content_summary": "Content about Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
      "chunk_index": 22,
      "total_chunks": 23,
      "start_timestamp": "00:21:42",
      "start_timestamp_seconds": 1302.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1302"
    }
  }
]