[
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 1,
    "total_chunks": 23,
    "text": "How did I go from consistently underperforming the market to consistently beating the market? Well, this video is exactly how it's through trading plans, strategy outlines, and trading logs. This is the work of trading. So my goal in this video is to walk you through how I approach all of those different tools. What's up everybody? Eric here. Welcome back to all the outliers and shout out to the Patreon family. You guys make content like this possible for everybody else. So if what I do helps you in any way, consider signing out. Let's get straight to it. So how did I go from underperforming the market really consistently over my first five years? I think there's one year that I outperform the market. And even in that year, technically, I was still negative. I was just less negative than the SB 500. How did I go from that to where I'm at now? Where as I look at my performance from 2018 to 2022, this shows my returns on average or 24.6. My compound annual growth rate was actually a little bit lower than that. But that's about my compound annual growth rate from when I started in 2007 until the last full year in 2022. How did that happen? Well, it is from this from trading documentation. So what's the purpose? What are these tools for? The first thing is for organization. The markets literally have infinite variables. You as the trader cannot be another uncontrolled",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=0"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 2,
    "total_chunks": 23,
    "text": "in 2007 until the last full year in 2022. How did that happen? Well, it is from this from trading documentation. So what's the purpose? What are these tools for? The first thing is for organization. The markets literally have infinite variables. You as the trader cannot be another uncontrolled variable. The problem with that, you're never going to see the same market twice. It'll have similarities, but it's never the same thing. So if you do not have a good understanding of what works optimally when and when you should use different tools, you just bounce between things. If you asked yourself right now, how did you do six months ago? You might not know. But if you don't have good trading logs to go back and look to see, then what good is the information that you were mastering, that time frame, if it's only as good as your memory? So organization forces you to track these things so that you can optimize over time, which that's number four, but you'll hear me reiterate that a few times. It's a thought exercise. The second purpose for doing these things is so that you are not building the plane as you are flying it. What that means is think about when you are in a stressful scenario, when you don't really have a clear plan of action, what tends to happen to people? Some people like to climb mountains. I like to build planes in the air. If you're",
    "start_timestamp_seconds": 58.16,
    "start_timestamp": "00:00:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=58"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 3,
    "total_chunks": 23,
    "text": "as you are flying it. What that means is think about when you are in a stressful scenario, when you don't really have a clear plan of action, what tends to happen to people? Some people like to climb mountains. I like to build planes in the air. If you're in a kinetic scenario, people very frequently will freeze. When you're in a financial trading scenario from the comfort of your home, you still might mentally freeze. You still might make bad decisions typically we do when we're under a lot of pressure without any problem to thought. This is the same thing in the Marine Corps. If you're in the military, you definitely have gone through planning exercises. And the main purpose of those planning exercises is to have an idea of what you're going to do, but we fully acknowledge that what we end up doing rarely looks exactly like what we're planning. But that plan gives you something to go off of. Because my boy Mike Tyson said it the best. Everybody has a plan until they get punched in the mouth. So the whole idea behind that is we have an idea of what we're doing, and then we can adjust as needed off of it, but it gives us a starting point. And that leads us into planning. Because I ask my community regularly, like, hey, what are your trading objectives? And I'm actually really surprised how frequently I get really insane objectives or none",
    "start_timestamp_seconds": 122.72,
    "start_timestamp": "00:02:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=122"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 4,
    "total_chunks": 23,
    "text": "and then we can adjust as needed off of it, but it gives us a starting point. And that leads us into planning. Because I ask my community regularly, like, hey, what are your trading objectives? And I'm actually really surprised how frequently I get really insane objectives or none at all. Some of them will say, oh, I'm just trying to practice this strategy. What's the point of that? Like, what is the point of that? The whole point of trading is to make money. If everything you're doing in trading is not in the purpose of making money, you literally are wasting your fucking time. That's harsh, man. So when we're planning out our efforts, we should always go back to what is our goal, and then make sure everything we're doing serves that ultimate goal. Sure. If you want to learn random things here and there, go for it. But the whole idea is that it should be pretty specifically designed to move you closer to your end state that should be clearly defined. Optimization, without this, it's very difficult to get better. As I look back at my returns, again, using my first five years, they're unimpressive. My first two years were negative. And that's also because I started in 2007. But my third, fourth, fifth year, they were all positive, but they were like trailing the market by like tenths of a point. I wasn't outperforming the market. So what I was doing wasn't working",
    "start_timestamp_seconds": 183.44,
    "start_timestamp": "00:03:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=183"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 5,
    "total_chunks": 23,
    "text": "unimpressive. My first two years were negative. And that's also because I started in 2007. But my third, fourth, fifth year, they were all positive, but they were like trailing the market by like tenths of a point. I wasn't outperforming the market. So what I was doing wasn't working objectively. And because I started this process of outlining what I think I'm doing via the plans, I have my strategies in terms of how I think I'm going to trade my different tools, and then logs to validate them. I was able to objectively look at the information and say, this is not working. These things look to show the best promise. Let me try to develop these further without that we are just running in circles. And that leads to the fifth point. If you don't go through this process of creating these tools, you lose so much time and effort. When I talk about things like paper trading, one of the beautiful parts about it is not just to validate a strategy without losing money, but it's because you were learning along the way and you're creating a data set. I cannot overemphasize that part enough. Creating a data set drastically increases your efficiency because then it's not a guessing game. You don't look at the market and say, hey, the market's behaving like X, Y, or Z. What should I try next? As you build out this toolkit, you know what works best. So it drastically",
    "start_timestamp_seconds": 243.92,
    "start_timestamp": "00:04:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=243"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 6,
    "total_chunks": 23,
    "text": "a data set drastically increases your efficiency because then it's not a guessing game. You don't look at the market and say, hey, the market's behaving like X, Y, or Z. What should I try next? As you build out this toolkit, you know what works best. So it drastically decreases the amount of wasted effort that you can then feed back into your system again to further optimize and then accountability. I'm not going to go through the whole psychology of trading and what that all looks like. That's a whole other conversation. But suffice it to say that we all have an ego. None of us like being wrong. And we don't like reconciling when we are at faults unless you get good at it, unless you get used to it. So accountability in your trading plans via trading logs, all of these different tools, it forces you to take accountability for the things you can control and to optimize those things to make sure that you are controlling them and fixing them in case they're not working. For example, if you have a mental stop and then the trade goes past your stop and you don't do anything and then you have this giant loss, even though you had that stop written in your trading plan, but you just didn't let it go. You're to blame. You know exactly who dorked that trade up and it's you. So it forces us to come to terms with our",
    "start_timestamp_seconds": 308.56,
    "start_timestamp": "00:05:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=308"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 7,
    "total_chunks": 23,
    "text": "anything and then you have this giant loss, even though you had that stop written in your trading plan, but you just didn't let it go. You're to blame. You know exactly who dorked that trade up and it's you. So it forces us to come to terms with our own performance, which is absolutely massive. So now that we understand why this stuff is so important and why I spend so much time talking about these concepts with you guys, let's get into what the trading plan looks like. So mine typically has somewhere around eight sections, big sections, and then it's just massive now. Mine is literally like 380 pages as it sits. That's because my trading plan has evolved. It's not even, I don't even label as a trading plan anymore. I label as wealth development and has my real estate stuff in there, my angel investing stuff in there because what I'm doing in terms of tracking applies to all of my business ventures. So these are the primary sections and I'll walk you through each of these so that you have an idea of what they look like so that when you download the free guide at the end, you kind of have a jumpstart on what this thing should look like. The very first section, purpose and goals. There's nothing fancy here. This is one of the most interesting things about trading in my opinion, is that I am by all accounts average. All",
    "start_timestamp_seconds": 368.96,
    "start_timestamp": "00:06:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=368"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 8,
    "total_chunks": 23,
    "text": "guide at the end, you kind of have a jumpstart on what this thing should look like. The very first section, purpose and goals. There's nothing fancy here. This is one of the most interesting things about trading in my opinion, is that I am by all accounts average. All accounts, the reason why my performance continually outperforms the market is literally because of structure, organization, stuff like this. Not super smart. I just make sure that I'm using the best information I have to inform my decision making. So purpose and goals, there's two sections to that. We have the desired end state. This is what we're trying to accomplish in investing in totality. And then we have kind of midterm objectives. I typically break this out six months. Maybe I don't do that anymore myself, but you know, you can. I used to, I used to do three, six, nine, 12, but we have short-term objectives. So stuff that's less than a year. One, your objectives, five year objectives, 10 year objectives. Again, inspect what you expect. The whole purpose of this is to force you to think through what you're doing. And it's funny because my mentor, trading mentor, is the one who literally forced me to start thinking about a trading plan, specifically strategy outlines. That was the main thing he was harping on. And once I realized how impactful that was, I started building it out into all of these other things. I bring that",
    "start_timestamp_seconds": 424.08,
    "start_timestamp": "00:07:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=424"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 9,
    "total_chunks": 23,
    "text": "trading mentor, is the one who literally forced me to start thinking about a trading plan, specifically strategy outlines. That was the main thing he was harping on. And once I realized how impactful that was, I started building it out into all of these other things. I bring that up to your attention because do not get overwhelmed here. I'm going to run through a bunch of shit with you guys. Don't look at this and be like, wow, this is so much. I don't even know where to start. Ta-da-da-da-da-da-da-da. Even if you have no clue where to begin this process, start right here. Purpose and goals. Open up the example that I'm sharing with you guys. Or open up a blank word doc, put these sections in there, and just start. So many people could literally transform their lives if they just start doing shit. Don't let your dreams be dreams. Yesterday, you said tomorrow. So just do it. And then you can fix it as you learn more, as you go along. You're not going to have all the answers. Don't worry about all of that. What you need to worry about is the mental hurdle of allowing that to not permit you starting something. Just start. So now we know what purpose and goals is. This is just giving us guide, right? What are we trying to do here? General market notes. This is a large section of my trading plan that walks through a",
    "start_timestamp_seconds": 485.52,
    "start_timestamp": "00:08:05",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=485"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 10,
    "total_chunks": 23,
    "text": "of allowing that to not permit you starting something. Just start. So now we know what purpose and goals is. This is just giving us guide, right? What are we trying to do here? General market notes. This is a large section of my trading plan that walks through a ton of things. This I would consider broadly optional for you. But there's a couple things in here that I would implore you to include if you would. The first thing here I have is structure. This literally is how does the market work? How do options work? I have like an entire section on the history of options. You don't have to do all that. That's just because I'm a nerd about this shit. But what you should pay attention to are mechanisms. How markets operate? That's important. A.K.A. What does a broker do? That's important for you to understand. How does the Fed impact the market? How do different economic factors impact the market? Those kinds of things are good to build out over time. Studies is exactly what that sounds like. I spend a lot of time reading through different things. Different report outs from the big banks. Different studies off of academic papers. And I track the outputs of that. It's useful for me. You don't have to do that. This one I do think you need observations. This is literally where you just captured what you saw happen in the market and what that means",
    "start_timestamp_seconds": 544.56,
    "start_timestamp": "00:09:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=544"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 11,
    "total_chunks": 23,
    "text": "banks. Different studies off of academic papers. And I track the outputs of that. It's useful for me. You don't have to do that. This one I do think you need observations. This is literally where you just captured what you saw happen in the market and what that means to you. The reason why this section is so important is because this starts getting our brain tailored towards pattern recognition. That serves you massively in the long run. So I highly encourage you to include that section. The next we have this is actually backwards. Boom, we're back at it and it's fixed. So what we look at in the third section is analysis. So in here, I'm looking at things like just how do I think about conducting analysis. And for me, I actually have a video coming out soon on technical analysis, but I'm very interested in having an efficient process, meaning I start with really big filters that get rid of most things. And then I hone in over time to the best possible tools for me to look at products for me to look at. And the reason for that is because there's a lot of things out there to trade, but I tell you what, you can get rid of a lot of them. Again, as an options trader, if they don't have options, boom, get rid of a ton of stuff right there. Stuff like that. So my overall guidance here for section",
    "start_timestamp_seconds": 609.68,
    "start_timestamp": "00:10:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=609"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 12,
    "total_chunks": 23,
    "text": "of things out there to trade, but I tell you what, you can get rid of a lot of them. Again, as an options trader, if they don't have options, boom, get rid of a ton of stuff right there. Stuff like that. So my overall guidance here for section 3a is think about how you can do whatever you do efficiently. And then when you look at technical analysis tools, fundamental analysis tools, I have kind of sub sections under each of these. I have what tools I use and then I kind of created a library of everything that I've experimented with. And that's on purpose. The reason being is I'm able to tie things I've tested to an actual note section on outlining what the tool is and then what my experience was using that tool. So then if I ever want to go back to the archives and say, hey, maybe I'll dust this one off and try it again. I'm not starting from scratch again. I can literally recall all of these different details. And again, you could start with the simplest things for technical analysis. You could start with trend lines and just write out how you think you will use them. This all feeds in and evolves over time. So don't get overwhelmed up front. And then systems, this is actually where I capture no entire trading systems. Can slim, for example, that goes into my analysis tool. You can put that wherever",
    "start_timestamp_seconds": 670.0,
    "start_timestamp": "00:11:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=670"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 13,
    "total_chunks": 23,
    "text": "out how you think you will use them. This all feeds in and evolves over time. So don't get overwhelmed up front. And then systems, this is actually where I capture no entire trading systems. Can slim, for example, that goes into my analysis tool. You can put that wherever you want really. But that's where I track notes on known developed systems for me to reference. That's all now trade checklist. Super simple. This is just where I write out a generalized three and post trade checklist. The reason why I use the term generalized is because each strategy will have specific things that matter to it that belong in the individual trade checklist. But there are things that apply to everything. So when I think about generalize pre-tree checklist, it's literally things like looking at the broad stock market and seeing what the overall trend is. What is the trend of the sector that you want to trade or the stock that lives in that sector? What's that sector doing? Stuff like that is earnings coming up for the product that you're trading. Are there any announcements? All of those kinds of things fall into the general category that apply to literally every single thing that you put on. The idea here, Edmund, no, don't make this massive. Because if you make your pre-imposed post trade checklists too big, you're not going to do it. You're just not going to do it. So make this efficient. Put things",
    "start_timestamp_seconds": 721.04,
    "start_timestamp": "00:12:01",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=721"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 14,
    "total_chunks": 23,
    "text": "that apply to literally every single thing that you put on. The idea here, Edmund, no, don't make this massive. Because if you make your pre-imposed post trade checklists too big, you're not going to do it. You're just not going to do it. So make this efficient. Put things in there that matter to what you're doing. But don't put stuff just for the sake of it. Again, because you will lose adherence. Now, portfolio management, this is a big section. This is where I break down allocations. So that's how I split my portfolio into core inspeculative. I have a video on portfolio management that talks about this stuff. But this is where I get into detail on how do I treat my core allocations. How do I treat my speculative allocations? How do I allocate money from the entire portfolio into those two buckets? How do I think about risk management? There's two levels to risk management in my opinion. There's the portfolio level that applies to everything you have on your book at a given point in time. And then there's the individual trade risk management protocols. I define that stuff here. How I think about utilizing the account. And then what metrics I need to track in order to assess my performance in service of this desired end state and my objectives. Again, don't let this stuff overwhelm you. If this section seems way too massive, way too much stuff going on in there, literally",
    "start_timestamp_seconds": 779.6,
    "start_timestamp": "00:12:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=779"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 15,
    "total_chunks": 23,
    "text": "utilizing the account. And then what metrics I need to track in order to assess my performance in service of this desired end state and my objectives. Again, don't let this stuff overwhelm you. If this section seems way too massive, way too much stuff going on in there, literally just put risk management and think about how you're going to manage risk in your portfolio because you need to do that no matter what. Now, let's take a look at strategy outlines. You'll notice over here that there's actually kind of a section. And for each strategy outline, there are a handful of key sections that I look at. This says that there's more or main sections. And I actually think that that's correct because there's the executive summary setup management and analysis. This fifth section can be tied either to the individual strategies or later down the line actually in section seven, which is notes and RFIs. So this is kind of like a bonus section. But these are the main pieces to a strategy outline. The executive summary literally is like the acid test. This is, do you understand how this strategy works? It should be three to five sentences in outline exactly how this thing makes money as if you're explaining it to a child. This is purposefully designed to just make sure that you have a solid understanding of what this thing is. The second section here is the setup. So this is what we're",
    "start_timestamp_seconds": 838.96,
    "start_timestamp": "00:13:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=838"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 16,
    "total_chunks": 23,
    "text": "to five sentences in outline exactly how this thing makes money as if you're explaining it to a child. This is purposefully designed to just make sure that you have a solid understanding of what this thing is. The second section here is the setup. So this is what we're looking for. How this thing makes money. How do we scan for whatever the strategy calls for? What technical, fundamental analysis indicators are you going to use? And what do you need to see from them? How do you expect to allocate money to this strategy? How do you expect to outline your initial outlay? How much money you're going to use up front? And then any scaling protocols either in or out? All of that should be built out into your setup section. Management is exactly what that sounds like. How do you intend to manage the trade throughout the life cycle? There's kind of three main things you can consider. There's time bound management. There's profit management, loss management. You can start with those sections or you can take a look at what I have here for your own. But again, this is forcing you to think through how you're going to manage this position before it goes on. Even before you like find what's going on for this position, you should have all of this outline for yourself. Analysis. So when we're building out our trading log and we're making sections for each of our strategies, this",
    "start_timestamp_seconds": 899.52,
    "start_timestamp": "00:14:59",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=899"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 17,
    "total_chunks": 23,
    "text": "how you're going to manage this position before it goes on. Even before you like find what's going on for this position, you should have all of this outline for yourself. Analysis. So when we're building out our trading log and we're making sections for each of our strategies, this tells us what details matter for this strategy. For example, if I'm trading zero DTE, SPX, variance risk premium strategies, so call it short strangle, short straddles, zero DTE, I really don't care what the one your trend is. I really don't care. I might care what the five day trend is or what the average daily range is. Those might matter to me. I also might care about the variance risk premiums, IV versus HV. But then if I'm trading something like ratio diagonals, I don't really care about IV versus HV. So this is where we put down what things matter to our strategy and how do we track them. This is what's going to feed our trading log setup later. And then again, this RFI tracking section, I'll pull it up over here as well. But in terms of the individual strategies, this is just what do you want to test for that individual strategy? Maybe you want to try instead of your DTE, five DTE. Maybe you want to try 14 DTE. This is just where you hypothesize different permutations of your strategy and then you test them. Now in terms of the broader trading plan,",
    "start_timestamp_seconds": 955.04,
    "start_timestamp": "00:15:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=955"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 18,
    "total_chunks": 23,
    "text": "you want to test for that individual strategy? Maybe you want to try instead of your DTE, five DTE. Maybe you want to try 14 DTE. This is just where you hypothesize different permutations of your strategy and then you test them. Now in terms of the broader trading plan, this notes an RFI section, I highly encourage you to actually start with this first one, which is a self assessment. Sounds super lame, boring, esoteric, whatever. The reason why this is important is because this forces you, also how do you like that arrow right there? Really nailed that, didn't I? I'm using the mouse, so chill out. Oh, that's not good either. There we go. That's better. You must be chill, Vian. The reason why this is so important is because it starts to force you to look at yourself and start analyzing yourself. If you're going to do this long term and be successful, guess what you need to do. Analyze yourself. If you think about the difference between different traders, we all have access to the same tools. You have the same platform I do. You now are going to have the same trading plan outline that I do. You're going to have the same technical analysis tools that I do, so on and so forth. Yet there is such a massive variance in performance. What? It comes down to the individual, to the trader. So this is where we acknowledge that aspect. And we try",
    "start_timestamp_seconds": 1021.12,
    "start_timestamp": "00:17:01",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1021"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 19,
    "total_chunks": 23,
    "text": "that I do. You're going to have the same technical analysis tools that I do, so on and so forth. Yet there is such a massive variance in performance. What? It comes down to the individual, to the trader. So this is where we acknowledge that aspect. And we try to find things that we're good at. And then specifically for our weaknesses, we need to make sure that it doesn't impact our trading. And if it does, we need to create known controls about it. So what I mean by that is if you're impulsive, if you go into things too quickly, this is where I would literally list that out as a weakness, I'm impulsive. I tend to do things without fully analyzing them. To control this, I'm going to force myself to complete the pretrait checklist for every position I put on before entering the trade. Something like that. Also in here is where I'm going to list out my performance reviews. I like to look at my performance every single month, kind of an in-depth deep dive. So I literally just write down, you know, for September. This is how I did. This is what worked well. This is what didn't work well. This is what the market did so that I have a log of what works when. Then I also have kind of this section for audits. This is kind of important to include because I believe it is really wise for traders to",
    "start_timestamp_seconds": 1075.12,
    "start_timestamp": "00:17:55",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1075"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 20,
    "total_chunks": 23,
    "text": "well. This is what didn't work well. This is what the market did so that I have a log of what works when. Then I also have kind of this section for audits. This is kind of important to include because I believe it is really wise for traders to embrace external audits. Have other people look at your shit and give you feedback. If they start reading through your trading plan and they're like, hey, well, what do you do in this scenario? That tells you that you're not defining that quite well enough and you probably should think through it because if there's too much variability in your capacity to deploy, there's a good chance that you are going to pick route A sometimes route B sometimes and then you're not going to understand what works best over the long run. Now, let's take a look at the trading log very quickly and then a couple of last things beyond that. The trading log for me is super simple. I use Excel. You can use Google Sheets. You can automate some of it if you're so inclined. I do, but I really am an advocate of the process of inputting the trades. The reason why I'm an advocate for that is it gets you closer to the data. As compared to just porting things over via an API or something like that. Now, I have the first tab is just kind of a portfolio summary and different calculators.",
    "start_timestamp_seconds": 1131.44,
    "start_timestamp": "00:18:51",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1131"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 21,
    "total_chunks": 23,
    "text": "of inputting the trades. The reason why I'm an advocate for that is it gets you closer to the data. As compared to just porting things over via an API or something like that. Now, I have the first tab is just kind of a portfolio summary and different calculators. So that's actually what this is right here. Just literally summarizing the portfolio. I have a binomial tree calculator here. This is kind of like a workshop version. I'm actually looking at producing a version of this for the Patreon family. That's what this is. It's a work and progress variant of that. But I have things like how the market is doing year to date, stuff like that. And then I also have different calculators, expectancy, blah, blah, blah, blah. This is something you can build out over time. The reason why I like the portfolio summary section, though, which will live over here is because it summarizes the key notes from the individual strategy tabs. So the reason why I have individual strategy tabs is because the things that I need to track are different. And it's very difficult to combine all of that into one tab. So each strategy has its own tab. And that's it. So all of the individual strategy tabs then feed into the portfolio summary. And then I have another section where I run different studies. Maybe you're curious how a 50-day crossover works and you start back testing it. Well, don't just",
    "start_timestamp_seconds": 1185.84,
    "start_timestamp": "00:19:45",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1185"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 22,
    "total_chunks": 23,
    "text": "each strategy has its own tab. And that's it. So all of the individual strategy tabs then feed into the portfolio summary. And then I have another section where I run different studies. Maybe you're curious how a 50-day crossover works and you start back testing it. Well, don't just do that and not track what you're doing. Because then that data is only as efficacious as your memory is. Don't do that. What you should do is consider something like this, like this, where you track the results of your study. Now you have a reference point. It might not be perfect. It might not be the best study on planet earth. But it gives you something. Again, when we're going through this trading log, it gives us an opportunity to validate strategy performance. We get to see how our portfolio is behaving. And then we get to test our hypothesis in quantify the outcome. Because lots of people have very rosy recollections about how good things went when really they might not have gone that well. So it forces us to reconcile that. So those are trading plants. Strategy outlines, trading logs. I talk about these all the time because they are absolutely pivotal. It is work, but it's something that evolves over time. So you don't have to get stuck in the mud early on. Start simple and build on it. If you have any questions, comments, concerns, anything that you want to dive into a bit",
    "start_timestamp_seconds": 1244.48,
    "start_timestamp": "00:20:44",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1244"
  },
  {
    "video_id": "utJ76_O6BNI",
    "title": "Ultimate Trading Blueprint: Trading Plans & Trading Logs Explained",
    "url": "https://www.youtube.com/watch?v=utJ76_O6BNI",
    "upload_date": "20231122",
    "duration": "PT22M11S",
    "channel_name": "Outlier Trading",
    "description": "💡 Join the Outlier Pro Patreon Community for weekly livestreams, private community, market & trade analysis, direct Q&A, & more. https://www.patreon.com/OutlierTrading\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n► Learn About Erik. https://www.outliertrading.io",
    "chunk_index": 23,
    "total_chunks": 23,
    "text": "time because they are absolutely pivotal. It is work, but it's something that evolves over time. So you don't have to get stuck in the mud early on. Start simple and build on it. If you have any questions, comments, concerns, anything that you want to dive into a bit further, let me know. This is where traders are made. This is where people become outliers by doing this work. Be an outlier. See you guys later.",
    "start_timestamp_seconds": 1306.24,
    "start_timestamp": "00:21:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=utJ76_O6BNI&t=1306"
  }
]