[
  {
    "text": "Newsflash, if you trade or invest, you're going to lose. We all lose. The point, though, is that you don't want to lose in the aggregate. You want to lose in individual circumstances so that you can get smarter about your strategy and thus make more money. If you get into this investing and trading world with the idea of never losing any money, you're not going to make any money. So in the video today, I want to walk us through an example on what this can look like pretty frequently and then most importantly, at the end of the video, I'm going to walk you through exactly how to maximize your losing trades because there is an opportunity in every single one of them if you know where to look. What's up, everybody? Eric here. Welcome back to all the outliers. And if what I do helps you in any way, consider signing up for the Patreon. I really appreciate your guys' support. Okay, let's get to it. How to maximize losing trades. So here we have a post from options. I purposefully went to the options subreddit versus Wall Street bets or something like that because people on Wall Street bets, they're just slinging money. What I call them? Fun coupon. Yeah? Hoping that something works. And what I mean by that is you're not really getting a great sense of people who are attempting to manage reaSkin make money. You're just seeing people who are trying",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=0"
    }
  },
  {
    "text": "on Wall Street bets, they're just slinging money. What I call them? Fun coupon. Yeah? Hoping that something works. And what I mean by that is you're not really getting a great sense of people who are attempting to manage reaSkin make money. You're just seeing people who are trying to hit the lottery. Oh my God. Jackpot, baby. So I'm calling that from the group in its entirety. And we're focusing on people who think they're trying to make money in a sophisticated manner. Yep, options trading. So with that, I want to highlight a few things from this excerpt and what you can learn from this person so that you don't have to make the same exact mistakes if in life, but trading specifically, you are one of those people that has to touch the stove in order to realize it's hot. If you say, oh, I only learn from my personal experience, you're not going to make any fucking money in this business. There is too steep of a learning curve to be that ignorant, to not be able to learn from other people's mistakes and successes. So get rid of that right out of the gate. Let's learn from a mistake. So this week might be the end for now to my trading career. I have key triple Q calls that expire this week. We dove hard at the moment. I'm still holding on to them to salvage what I can. But I have essentially hit",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:08",
      "start_timestamp_seconds": 68.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=68"
    }
  },
  {
    "text": "Let's learn from a mistake. So this week might be the end for now to my trading career. I have key triple Q calls that expire this week. We dove hard at the moment. I'm still holding on to them to salvage what I can. But I have essentially hit about 400 left in my account. So let's see what this person has done to put into context. I've been trading for almost a year. That's the first thing that keys out to me almost a year that's a very short duration starting in September of 2019. I had plenty of success going up and even success on the way down after the COVID crash in March. I started out with about 7,000 in September. The account peaked a little over 90,000 by April of 2020. For those that have the bullshit detectors going off that's smart. That's not to say that this didn't happen. But that is a insane return. How insane of a return? Well, let's take a look from September 2019 to April 2020. That represents a 1,100 in 85.71 return or an 8,000 annualized return. That's what this person did. Now, they probably were saving adding money to the account. But right out of the gate, we have this crazy expectation that's now been set after a very short time frame. This is a blink of an eye in the time frame of trading. Okay. So now let's take a look at what happened subsequently. We",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:02:14",
      "start_timestamp_seconds": 134.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=134"
    }
  },
  {
    "text": "money to the account. But right out of the gate, we have this crazy expectation that's now been set after a very short time frame. This is a blink of an eye in the time frame of trading. Okay. So now let's take a look at what happened subsequently. We see fast forward to July. And I'm down to 400. That represents a negative 99.56 return on their money. So recap. They went from 7,000 to 90,000 down to 400. There is so much you can learn from this. It's not funny. Let's take a look at a couple of these things. The first one. It says, over the past day and weekend, I've been sick mentally. Feel like throwing up. I want to know how I can cope with these losses mentally. Although my initial principle is money I was willing to lose. The idea of getting out of the game and the fact that I lost 99 of my portfolio is hard to swallow. All right, let's talk about it. The very first thing I see here obviously is a insanely emotional human being in general. This is not good. Not even just in trading, but in life. If you go through these emotional roller coasters, one, you gain nothing from it. Two, you detract your ability to think rationally and make good decisions. Three, you go through this awful cycle. There's no benefit from going through this kind of emotional cycle. Now, to be clear, I'm not",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:03:20",
      "start_timestamp_seconds": 200.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=200"
    }
  },
  {
    "text": "If you go through these emotional roller coasters, one, you gain nothing from it. Two, you detract your ability to think rationally and make good decisions. Three, you go through this awful cycle. There's no benefit from going through this kind of emotional cycle. Now, to be clear, I'm not saying don't have emotions. We all have emotions. It's ignorant to think that you could just, whatever, I don't have emotions anymore. You do, but you can acknowledge the emotions like this person is trying to, how can I cope with these losses mentally? So they're trying to, there is really late to the punch. They're waiting until it's super painful and now they're trying to figure out how to cope emotionally. So right out of the gate, I can see a contradiction in what they said. My initial principle is money I was willing to lose. Then they're saying the fact that I lost 99 of my portfolio is hard to swallow. This is a contradiction inherently so. Here's the deal. It is okay. The reason why it's okay is because guess what? We say things all the time that we think at the time we mean, but then when it happens, we don't mean. Humans are notorious for that kind of behavior. So this is where actually visualizing how you think you will feel and actually putting yourself in the scenario and saying to yourself genuinely, what do I think? Because what they are trying to do here",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:04:27",
      "start_timestamp_seconds": 267.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=267"
    }
  },
  {
    "text": "when it happens, we don't mean. Humans are notorious for that kind of behavior. So this is where actually visualizing how you think you will feel and actually putting yourself in the scenario and saying to yourself genuinely, what do I think? Because what they are trying to do here is money I was willing to lose. They were trying to distance themselves and create psychological separation from their investing principle, which is very wise. They didn't take this seriously. The reason why I know they didn't take it seriously is literally in the same sentence. They say, I lost 99 of my portfolio is hard to swallow. If you were willing to lose the money, why is it so hard to swallow? Again, it's because we don't want to lose. We don't want to lose that money. So being honest with yourself about this first part, meaning you were not willing to lose this amount of money because you're obviously having a huge problem coping with it. This tells me we weren't honest in this step, which most of us aren't. This is the same thing you see with the New Year's Resolutioners. Oh, this year's different. I'm gonna be fit. I'm gonna go to the gym. I'm gonna clean up my diet. Humans say all sorts of shit in the moment, in the comfort of that moment, that they immediately drop as soon as it becomes slightly difficult. You think you're gonna wake up early until the alarm",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:05:32",
      "start_timestamp_seconds": 332.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=332"
    }
  },
  {
    "text": "be fit. I'm gonna go to the gym. I'm gonna clean up my diet. Humans say all sorts of shit in the moment, in the comfort of that moment, that they immediately drop as soon as it becomes slightly difficult. You think you're gonna wake up early until the alarm goes off at five and you're like, well, I'll do it tomorrow. I don't want to do it today. The problem with these kinds of things is you create this insanely slippery slope that then sets you up not even for a trading slash investing failure, but a lifetime of this vicious cycle. So we need to plan efficiently, which I'm gonna get into in just a second. And then there's greed. Here's the deal. Greed is not inherently bad. Oh, what? You're not supposed to like greed. What do you mean, greed's not bad? Greed is a huge motivating factor. I am greedy. I have enough money to live comfortably for the rest of my life if I so choose. However, I still want more because I want more opportunity. It's not just that I want to make more money so that I can be Scrooge McDuck. I like having more money because it allows me to also help more people to benefit more businesses by being a patron of them. Things like that matter a lot. So don't inherently dismiss greed is bad. Now where greed becomes bad is when it's oppressive. When you make poor decisions because",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:06:34",
      "start_timestamp_seconds": 394.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=394"
    }
  },
  {
    "text": "having more money because it allows me to also help more people to benefit more businesses by being a patron of them. Things like that matter a lot. So don't inherently dismiss greed is bad. Now where greed becomes bad is when it's oppressive. When you make poor decisions because your want of money is so great. If my greed, for example, was so excessive that I couldn't be happy unless I had a hundred million dollars, that is awful greed. Because then I'm essentially dismissing an entire possibility for a healthy, fulfilling life because I don't have this one super greedy metric. So you have to figure out what level of greed you have but then you have to be comfortable with the outcome. This person had an 8,000 annual return looking at them. Then they had a 100 draw down. This is what greed gets you in a lot of instances. Then this guy walks into my office and says, those same banks got greedy. They lost track of the market and I can profit off of their stupidity. So what I recommend for overcoming greed is again, this planning phase, which we're going to get into actually right now. Let's talk about growing from losses. Learn to lose well. What does that mean? We walk through a bunch of things from that scenario that can help us understand this idea of losing well. But here are some questions to help you with this idea of losing well.",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:07:32",
      "start_timestamp_seconds": 452.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=452"
    }
  },
  {
    "text": "right now. Let's talk about growing from losses. Learn to lose well. What does that mean? We walk through a bunch of things from that scenario that can help us understand this idea of losing well. But here are some questions to help you with this idea of losing well. How do you feel after that losing trade, losing week, losing month? Again, bear yourself to yourself. All of this is useless unless you are honest. If you feel some type of way that's telling you something, if you genuinely do not feel perturbed in any way, that's where we want to be. If you have winning trades, you should not be elated. You should not be ecstatic. It just means you're going to be emotional to the other degree. We want to be even keeled. That is a much better way to live your life. Then as part of losing well is we have an opportunity to see how this fits into our system. So if we have this losing trade, we get to ask ourselves some more questions. Like, did I maintain proper sizing? Did I manage the trade according to my plan? Again, going back to this comfort seeking side of our mind, there's a lot of times when we have a trade plan that's written out, that's logical, that makes sense, that we then immediately want to violate because of all of these emotional forces. Sometimes even if you don't fully believe in your trading plan,",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:08:40",
      "start_timestamp_seconds": 520.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=520"
    }
  },
  {
    "text": "comfort seeking side of our mind, there's a lot of times when we have a trade plan that's written out, that's logical, that makes sense, that we then immediately want to violate because of all of these emotional forces. Sometimes even if you don't fully believe in your trading plan, as long as it involves managing risk, you are far better off managing the risk, following the trading plan, than updating the trading plan as needed. Because if you start to allow yourself to violate your trading plan to early, one, it's useless, two, you are opening up again, this very slippery psychological slope that is very difficult to reel back in later down the line. So did you manage it correctly, not only pertaining to did you follow your management plan, but did you as the operator behind the keyboard do the right steps? That matters almost equally as much as the actual edge development side of the strategy. How does this losing trade fit into the broader strategy performance? Guess what? Any strategy is going to have losing trades. We should be able to assess each of those losing trades and say, yes, I expected this. This is within the risk control parameters that I set. I said, I'm going to have an 8 stop loss. It's time for me to get out done and done. If you had a trade where you said, I had an 8 stop loss, but the loss is way bigger than I",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:09:48",
      "start_timestamp_seconds": 588.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=588"
    }
  },
  {
    "text": "within the risk control parameters that I set. I said, I'm going to have an 8 stop loss. It's time for me to get out done and done. If you had a trade where you said, I had an 8 stop loss, but the loss is way bigger than I thought it was. That tells us something. We need to make some adjustments, which leads us into optimization. This is where we get to feed the cycle of information. So if we look at the performance of the strategy by itself, and then the portfolio, are you happy with it? Are you satisfied with your performance as the trader? Is there anything you missed that led to a losing trade? For example, if you were selling premium and then earnings popped up that you didn't know about, you missed something. That means you could have done something better. You need to integrate something else into your process. Are there new ideas that I want to test as a result of this loss? The name of the game here is looking at your process as a trader as feeding a system that we want to optimize over the long run. We're not looking at each individual losing circumstance as the end all be all because it's not unless you have awful risk control metrics. You have to control risk first and foremost. You can't invest no money. So risk control has to come first. But beyond that, every single data point",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:10:53",
      "start_timestamp_seconds": 653.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=653"
    }
  },
  {
    "text": "not looking at each individual losing circumstance as the end all be all because it's not unless you have awful risk control metrics. You have to control risk first and foremost. You can't invest no money. So risk control has to come first. But beyond that, every single data point you get to collect from both winning and losing trades allows you to optimize with the correct mindset. Remember, the obstacle is the way. Losing trades are difficult for our ego. We don't want to look at them. We want to exhibit the disposition effect where we cut winning trades too quickly, let losing trades run too long. But all of that is an opportunity for you to get better as a trader and optimize your system. If there's anything that I left out here, don't forget to throw it in the comments or share what your favorite one is. Like, subscribe, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "uVw2BEE2sbo",
      "title": "Optimizing Your Losing Trades: Techniques for Better Outcomes",
      "url": "https://www.youtube.com/watch?v=uVw2BEE2sbo",
      "upload_date": "",
      "duration": 766.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:11:51",
      "start_timestamp_seconds": 711.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=uVw2BEE2sbo&t=711"
    }
  }
]