[
  {
    "text": "We're two and a half years into a bear market. If this market makes a new low, it's going to be the fifth longest bear market in history. And everyone is discouraged. The breakout, last fall of the day is failed. The markets acting terrible. People are fearful and they're looking away. And they're going away. The running away, exactly classic fool rookie move. Major trends can occur. Change three to four days. It can change everything can change. And now it's like, well, the war is escalating. The government's probably going to get shut down. We have two idiots running for president. One's my idiot. There's a lot of reasons to be very nervous right now. And the market is down trending down in four days. This market could look completely different. You're always three to four days away from a major market turn up or down. And right now, the feeling I get from talking to people, seeing the market in my PL is we're getting really close to a new bull market. And everyone's looking down.",
    "metadata": {
      "video_id": "UZhHIQqsLts",
      "title": "5th Longest Bear Market in HISTORY with Jim Roppel | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=UZhHIQqsLts",
      "upload_date": "2023-10-07T15:45:01Z",
      "duration": "PT50S",
      "channel_name": "",
      "description": "💡 Join the FREE Outlier Community Discord:  https://discord.gg/hYGZUEJpve\n📧 Join the Outlier Insights Investing Substack: \nhttps://esinvests.substack.com/\n📈 Support the channel and gain access to exclusive content!: https://www.patreon.com/erik_esinvests\n📺 Subscribe and join the weekly Monday Night YouTube live session! https://www.youtube.com/esInvests\n🦅 Follow on Twitter for Investing News & Stock Market Updates: https://www.twitter.com/esInvests\n💻 1 on 1 Coaching: https://www.esinvests.com/coaching\n\n▬ AFFILIATES  ▬▬▬▬▬▬▬▬▬▬\n► 50% off Options Omega Backtesting: https://optionomega.com/register/esinvests\n► Barchart Premium - Try for FREE: https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► Benzinga Pro - Get 35% Off using Promo Code esInvests35: https://benzinga.sjv.io/esin\n► Discounted Stock Rover Analysis & Screener - Browse plans and sign up here! https://www.stockrover.com/esinvests-plans\n►Signup to Financial Juice for the Latest Market News - https://rl110.isrefer.com/go/SETH/esinvests/\n► Grab Some Outlier Merch: https://esinvests-shop.fourthwall.com\n\n▬ VIDEO DETAILS ▬▬▬▬▬▬▬▬▬\n#trading #stockmarket #jimroppel\n\n\n▬ ABOUT ERIK  ▬▬▬▬▬▬▬▬▬\nMy name is Erik, I'm a Marine veteran, options trader, real estate and angel investor. From 2007, I spent over 30,000 hours honing my skillset and became a first generation millionaire before 30. I'm is passionate about self-development, life experiences, human performance, and helping others grow. I launched the esInvests YouTube channel and the Outlier community to share his experience and empower others to proactively craft their futures. \n\nDISCLAIMER:\nThe content presented is for informational purposes only and should not be considered as financial advice. esInvests, its affiliates, and employees are not responsible for any investment decisions made based on the information presented in these videos. All investment and trading activities involve risk, and viewers should carefully consider their financial situation, investment goals, and risk tolerance before making any investment decisions.\n\nAny opinions, news, research, analyses, or other information contained in these videos are provided as general market commentary and do not constitute investment advice. esInvests does not guarantee the accuracy, completeness, or reliability of any information presented in these videos and is not liable for any losses or damages arising from the use of or reliance on this information. Viewers are encouraged to seek professional financial advice from a licensed investment advisor before making any investment decisions.\n\nBy accessing and watching these videos, viewers acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=UZhHIQqsLts&t=0"
    }
  }
]