[
  {
    "text": "What's up, outliers? Happy Friday. I hope we all had a absolutely dope week. There's been no shortage of kind of interesting things going on for us to talk about. But as you know, tonight is options trading for beginners. So we have a pretty distinct agenda that I would like to hit and work through with you all. I want to specifically focus this idea of a trade checklist. And I specifically want to explore how we can think about kind of developing a systematic process before we place a trade. However, I would love to start with some broader QA or anything that we've covered so far that you have questions about. And I am happy to talk about it. Looks like we have a couple questions from the beginning. I'm going to hit those. But if you have anything that you want to hit in the beginning, throw it in the chat. And we'll spend a little time upfront about QA. And then a little bit later is when we'll dive into the specifics of building this trade checklist. How to think about it. Those kinds of details. There are a lot of different things that we can do in order to make something that's usable, but not a little too over the top. That's kind of a really important step in my opinion. Because if things are too arduous for us to fill out, for example, the probability of us actually adhering to that that checklist",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 94,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=0"
    }
  },
  {
    "text": "can do in order to make something that's usable, but not a little too over the top. That's kind of a really important step in my opinion. Because if things are too arduous for us to fill out, for example, the probability of us actually adhering to that that checklist or whatever else that we're referencing is very, very low. So that is the idea. I got to turn my air up because it is warm in here. We got the air rocking and rolling now. I think we're in a good spot. So before we get too far into the weeds though, you all know exactly how this goes. I'm going to say hello to everybody. I love checking out who we got hanging out here on a Friday to talk about some options trading. Let me move this chat over here so I can keep an eyeball on all of you. And I see we got Shrej J, Ruta Bega, Joey Elon songs, Ian J, Timmy Peparoni, he's fun. This name always slows me down. Grab a terrorist. That's it. Gravitarist, blizzy, M Ram, blizzy. That's a great name. I like that one. I don't know which one is my favorite. I don't see Roaring Titty. That's normally my favorite. I have to be honest. I do play favorites. Second favorite might be, oh, it's either Ruta Bega, Timmy Peparoni or blizzy. It's probably blizzy. Yeah. I think blizzy. I think you want it here, at least for",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 94,
      "start_timestamp": "00:01:39",
      "start_timestamp_seconds": 99.31489361702128,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=99"
    }
  },
  {
    "text": "is my favorite. I don't see Roaring Titty. That's normally my favorite. I have to be honest. I do play favorites. Second favorite might be, oh, it's either Ruta Bega, Timmy Peparoni or blizzy. It's probably blizzy. Yeah. I think blizzy. I think you want it here, at least for me in my world. That's a pretty good name. And we have a couple beverages to get us through. I got my water, seltzer, watermelon, and then I have the mango orange. This is the good spindrift. In my opinion, all right. Let us begin. So there was a question. It literally disappeared. I don't know where it went. That's actually super annoying. Did it disappear for you guys too, or is it just me? Interesting. There was a question that somebody dumped in that was sitting at the top. It was something about three rules or something like that. But it's completely gone from my screen. If it's gone for you guys, maybe they pulled their question back or whatever. But I do not see it at this point. Ruta Bega says, I saw the comment flashing disappear. I wonder if it's something with like going on. I don't know. Damn it. Well, I'm sorry. Whoever dropped that question and that's kind of a bummer that it's gone. Feel free to drop it back in. I was going to start with that. But since that's the case, let's pivot over and let's get into the heart and soul. So",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 94,
      "start_timestamp": "00:03:18",
      "start_timestamp_seconds": 198.62978723404257,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=198"
    }
  },
  {
    "text": "know. Damn it. Well, I'm sorry. Whoever dropped that question and that's kind of a bummer that it's gone. Feel free to drop it back in. I was going to start with that. But since that's the case, let's pivot over and let's get into the heart and soul. So let's talk about a trade checklist. When we think about this idea of a trade checklist, why is this important to us? And I know it's kind of a boring topic. It's not that fun. There's nothing really that quirky about it. It's not super engaging. However, oh, Emram, you the man. Thank you. It says, what are a few rules to live by when trading options? When you are determining your position, positioning into a trade, what are key indicators that you look out for before entering? Thank you so much, Emram, for getting that comment back up. Because I actually thought the question was really good. I felt bad that it had dropped off. Thank you for saving it. Okay, that's a fantastic question. So let's talk about it with this question specifically, if I were to think about a handful of rules to live by when trading options, the very first one is in my opinion, you need to focus on the profit mechanism first. That's one of the most difficult parts with options. Because when we're trading options, we want to start trading options very quickly. And I don't know if people fully understand how misguided",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 94,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.9446808510638,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=297"
    }
  },
  {
    "text": "options, the very first one is in my opinion, you need to focus on the profit mechanism first. That's one of the most difficult parts with options. Because when we're trading options, we want to start trading options very quickly. And I don't know if people fully understand how misguided that is, in my opinion, the reason why it's so misguided is because options are simply products. There are things we can trade. There are a type of security. If you don't have a good grasp of profit mechanisms, options won't help you. They will not save you. They do not generate some sort of inherent edge that you can tap into and take advantage of. It really is kind of problematic actually. So in my opinion, that's probably one of the biggest initial steps to focus on is to make sure that you actually identify profit mechanisms. So for those that are listening in, what do you think that means? Like what is that? When I'm talking about profit mechanisms like this, how do we do that? So if we think about the process of building a strategy, kind of trying to create success and doing this long term, I talk about this idea of profit mechanisms all the time. So what does that actually mean? How do we do that? There's really a handful of things that you can make money from in the stock market. It's starting there. So for example, if I'm looking at something like",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 94,
      "start_timestamp": "00:06:37",
      "start_timestamp_seconds": 397.25957446808513,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=397"
    }
  },
  {
    "text": "I talk about this idea of profit mechanisms all the time. So what does that actually mean? How do we do that? There's really a handful of things that you can make money from in the stock market. It's starting there. So for example, if I'm looking at something like SMCI, there's actually a profit mechanism in this stock right here that's going sideways. That's been range bound from 955 down to a low of 716, which 200 points is kind of big. But range bound for the product itself, there's a way you can trade this. And for something like this, I look more towards volatility because it absolutely has a volatility edge that is baked into it in terms of variance risk premiums. So profit mechanism simply put is how does something make money? Options is not a profit mechanism. So the first rule to live by when trading options is to focus first on the profit mechanism. The second rule to live by when trading options is you cannot take a haphazard approach to trading them. You have to go through the process of testing things to see not only what works well in general, but also what works well for you, the trader. You have the last say in terms of what makes sense for you. What doesn't make sense for you? That matters a lot. And I actually just finished a podcast episode with humble trader who was actually very, it was a great conversation.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 94,
      "start_timestamp": "00:08:16",
      "start_timestamp_seconds": 496.5744680851064,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=496"
    }
  },
  {
    "text": "what works well for you, the trader. You have the last say in terms of what makes sense for you. What doesn't make sense for you? That matters a lot. And I actually just finished a podcast episode with humble trader who was actually very, it was a great conversation. I enjoyed it a lot. And she has a completely different approach to markets than I do. She is essentially looking to trade intraday the vast majority of her book. And there's nothing wrong with that. But it's very different than what I do yet it seems like it's working for her. So does that mean that because it doesn't work for me, that it doesn't work at all? No, it means that we as individual traders need to find what works for us as individual traders. So rule number two in this case is once we identify some sort of profit mechanism that makes sense is you can't take this haphazard approach to things. You have to be pretty methodical in how you're going to try to learn and build strategies. It can't be this shotgun blast of randomly trying something for a little bit and then randomly switching over to something else for a little bit because you're not going to get you're literally not going to get anywhere like that. So let's rule number two. And then I would leave maybe rule number three. And for those that are in the chat, I just dropped a video",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 94,
      "start_timestamp": "00:09:55",
      "start_timestamp_seconds": 595.8893617021276,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=595"
    }
  },
  {
    "text": "over to something else for a little bit because you're not going to get you're literally not going to get anywhere like that. So let's rule number two. And then I would leave maybe rule number three. And for those that are in the chat, I just dropped a video about like how to create consistently profitable option strategies. And then I think I have another couple videos actually. This one's about like how to create a strategy in how to create a strategy in five steps. A lot of stuff on strategies. Don't I? Huh? Look at me go. And then I think I have one other video that I want to share with you guys that's more broad about essentially trading options. Successfully. Give me one sec. Let me see if I can find it real quick. This one. Perfect. So those three videos I think are reasonable views for you guys on the topic. So that's number two. And then number three is I think you can't be a bullshit artist. And like if I were to boil it down to three rules, that's that's probably it. What I mean by you can't be a bullshit artist is if you are unable to brutally and honestly dissect what you're doing yourself, your decision process. If you cannot, if you do not have the capacity to do that and you find yourself giving yourself excuses or saying, Oh, well, I was tired or oh, this or oh, that.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 94,
      "start_timestamp": "00:11:35",
      "start_timestamp_seconds": 695.204255319149,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=695"
    }
  },
  {
    "text": "is if you are unable to brutally and honestly dissect what you're doing yourself, your decision process. If you cannot, if you do not have the capacity to do that and you find yourself giving yourself excuses or saying, Oh, well, I was tired or oh, this or oh, that. This isn't going to work. It's not going to work. You cannot approach trading, especially something like options, which are so dynamic without taking full in utter responsibility for literally everything about what you're doing. So if I were to think about the three rules, essentially those that's what they are profit mechanisms first, you need a defined approach and you have you have to take responsibility for every step of what you do. I think that's kind of how I would boil it down. Policies they can generate an ordinate risk. They can. And that's that's one of the tricky things. It looks like the mic might be blowing out one second. It looks like it's like kind of loud for you guys. I don't want to kill your ears. So I just turned the mic down a little bit. Let me know if that's better. I can never tell how loud it is, but I don't want to be too loud. That might be, let me know if that's good. I if not you guys can always raise your volume up because my voice changes a lot in terms of how loud I am. So that's not always",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 94,
      "start_timestamp": "00:13:14",
      "start_timestamp_seconds": 794.5191489361703,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=794"
    }
  },
  {
    "text": "tell how loud it is, but I don't want to be too loud. That might be, let me know if that's good. I if not you guys can always raise your volume up because my voice changes a lot in terms of how loud I am. So that's not always listen or friendly, but I am I am emphatic about trading options. So that's how she goes. Ruta Biggest says it sounds fine. Great. That's good news. Good news for everybody. So yeah, those are kind of the few rules I would give. Then the next one here it says when you are determining your positioning into a trade, what are key indicators that you look out for before entering? That's actually great. That's like a perfect segue into this idea about trading trading options and creating like a trading checklist. So we'll talk about that a lot. The sheet says you need to reduce the speed to 0.75. That's so funny because when I talk about this stuff, I literally feel like I'm talking actually kind of slow because I try not to go overly too fast. But the way that my brain works with just about everything is I'm like grossly obsessed with efficiency. So I always look at it as more information in less time. If you ever like if you catch me when I'm out walking my dog or whatever, I almost always have my phone playing a podcast or an audiobook and it's literally at",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 94,
      "start_timestamp": "00:14:53",
      "start_timestamp_seconds": 893.8340425531915,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=893"
    }
  },
  {
    "text": "I'm like grossly obsessed with efficiency. So I always look at it as more information in less time. If you ever like if you catch me when I'm out walking my dog or whatever, I almost always have my phone playing a podcast or an audiobook and it's literally at least at 2.2 times speed. I typically try to get like to two and a half. Two and a half is really difficult because you have to like focus pretty damn hard. So yeah, it's interesting. But yeah, that's it's a funny joke anyways, I enjoy it. The sheet says I joked on discord. I love the speeches joke. We can always replay. Yeah, exactly that's exactly how I think about it is I try to be mindful of everybody's time. All right, so we will get into the trading checklist in a second. It looks like there's another question from Al Fons. Al Fons. Oh god, yo, these names are so freaking tricky. Al Fons, Z L. Okay, okay, my third grade teacher would say sound it out. Al Fons, ZO and then and then were were fucked because I don't know I don't know how to okay, third grade teacher. How do I sound out something? I don't know how to sound out. Dingo, Dingo, dyngio, dingo, alf, al, joey's helping me here. Alf, on ZO, dingo, alfons, oh dingo. That's weird. Sounds like a dingo, a chababy, alfons, oh dingo. That's from tropic thunder. I love that",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 94,
      "start_timestamp": "00:16:33",
      "start_timestamp_seconds": 993.1489361702128,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=993"
    }
  },
  {
    "text": "grade teacher. How do I sound out something? I don't know how to sound out. Dingo, Dingo, dyngio, dingo, alf, al, joey's helping me here. Alf, on ZO, dingo, alfons, oh dingo. That's weird. Sounds like a dingo, a chababy, alfons, oh dingo. That's from tropic thunder. I love that scene actually. It's absolutely hilarious, but to cross some fucking lines. Okay, so alfons dingo says why the focus on gm e there are plenty of stocks with consistent daily volatility. The gas twins have at average daily volatility of over 6 and every day for years. It's a great question. So first, I'm curious if you guys have an idea why I'm so enthralled by GameStop. There's a few things that feed into it. Trade J has got the joke. I love that. What do you mean you people? What do you mean you people? So what is it about GameStop? I've been trading for, this is my 17th year of trading now. So I'm coming up on 17 years. What is it about GameStop that you guys think I'm so interested in? Because to alfons, alfons, oh dingo to their point, it's clearly not about volatility. Gravitaris says puzzle to solve. That's a, that is the biggest component to it that I can think of. Benoit says it's an expos a human behavior that is also absolutely correct. Yeah. You guys are literally highlighting essentially all of the pieces that make it so special. The punchline is to",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 94,
      "start_timestamp": "00:18:12",
      "start_timestamp_seconds": 1092.463829787234,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1092"
    }
  },
  {
    "text": "puzzle to solve. That's a, that is the biggest component to it that I can think of. Benoit says it's an expos a human behavior that is also absolutely correct. Yeah. You guys are literally highlighting essentially all of the pieces that make it so special. The punchline is to why is because it is weird. That's what it comes down to. I have spent thousands and literally tens of thousands of hours in markets, tens of thousands. Like I look at this stuff a lot. I've seen a lot over that time frame. It is not common that I come across things, especially at this point in my trading career, that are weird, that are just weird. And something like GameStop is that it's just weird. It has so many things about it that make it weird. It has this element of what I would consider to be market manipulation happening. And again, you guys know that I do everything I can to be objective. I do everything that I can to look at data and call it objectively, especially with the GameStop stuff. Because so many people I find have been in it for so long that they default to everything being rigged and the systems bullshit and the guys trying to kill the little man and all that kind of stuff, which I get their sentiment. But it's not my sentiment. I don't align with that fully. I find myself towards the middle because there's other people",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 94,
      "start_timestamp": "00:19:51",
      "start_timestamp_seconds": 1191.7787234042553,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1191"
    }
  },
  {
    "text": "default to everything being rigged and the systems bullshit and the guys trying to kill the little man and all that kind of stuff, which I get their sentiment. But it's not my sentiment. I don't align with that fully. I find myself towards the middle because there's other people that are like, the market's perfect. Everything's perfectly priced. Everything's fair. That's also kind of bullshit. I don't agree with that either. I'm very much towards the middle. And when I look at something like GameStop, it has interesting price behavior. It has an interesting backstory and an interesting community. When I've been thinking the apes and really the GameStop community writ large for letting me be a guest in their space. Because I've said that a million times in its to truth, I view myself as a guest in the house. And I love how much people are willing to share with me about their experience with the product. There's literally an entire culture around it. Then you add on the layers of seeming nefarious actors from a short seller side. Then you add on the layer of Ryan Cohen essentially intervening while it's seemingly going under undergoing seller boxing. Then you add in some random ass dude from the internet that puts band-aids on his face and starts a live stream, pretending to be dead. And he has hundreds of millions of dollars and he trades the product the way he trades it. It's like everything about it",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 94,
      "start_timestamp": "00:21:31",
      "start_timestamp_seconds": 1291.0936170212767,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1291"
    }
  },
  {
    "text": "boxing. Then you add in some random ass dude from the internet that puts band-aids on his face and starts a live stream, pretending to be dead. And he has hundreds of millions of dollars and he trades the product the way he trades it. It's like everything about it is a freaking crazy story. It has all of the elements of an insane story. And if you look at the price behavior, it moves in such a way that has elements of predictability. I don't know what they are. And I want to know what they are. That's a big part of this is that there is there is some sort of solution to this thing because it moves in certain ways, whether it's from settlement cycles, FDD juggling, whether it's from op-ex tailwinds, whether it's from other ETF creation redemption cycles, it's hard to say. So the cliff notes version of why I've been very focused on GameStop from a personal perspective is that there's all of that interest. The second reason and then I'll leave it here so I'm not on the point for too long, but I think it's still pertinent is I think GameStop is a fantastic learning vehicle for people, even people in my community that like that have been with me since I started back in 2020. For people that have been with me over that time frame, they're mostly options traders. They're trying to become better options traders and that's that's their",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 94,
      "start_timestamp": "00:23:10",
      "start_timestamp_seconds": 1390.408510638298,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1390"
    }
  },
  {
    "text": "a fantastic learning vehicle for people, even people in my community that like that have been with me since I started back in 2020. For people that have been with me over that time frame, they're mostly options traders. They're trying to become better options traders and that's that's their angle on this stuff. Now to that end, you can learn so much about options derivatives, market, literally how the market operates through a vector like GameStop that you don't experience before that. So for people that are listening from my viewership that did not know about GameStop much before this conversation, how many of them would be really well versed on something like FDDs, even what it is, not even well versed, but know about it and know about how it could impact things or reg show. If you're not in a product like this, you don't see a lot of that stuff. So there is a ton, a ton of things that really fascinate me about the product on a personal level. It's something that's extremely, extremely tradable. I've made good money trading this and I intend to continue doing that. I already told you guys that that's one of the funniest things about this. Is the way that I stumbled across this, is it popped up on some of my scans for a few days and then I was just like, I'll speculate in this. And then all of a sudden it starts making these crazy moves.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 94,
      "start_timestamp": "00:24:49",
      "start_timestamp_seconds": 1489.7234042553193,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1489"
    }
  },
  {
    "text": "one of the funniest things about this. Is the way that I stumbled across this, is it popped up on some of my scans for a few days and then I was just like, I'll speculate in this. And then all of a sudden it starts making these crazy moves. I'm trading it just because of the way that I look at markets. And then I've started getting caught up on what was going on, the actors, because when I look at the original move, which I also trade it, that's like that's the thing is I'm not new to GameStop itself. I've traded it back here. You can't miss this kind of stuff if you're a trader. Like you know these things are happening and you try to make money with them. So I'm not new to the product, but I'm new to the story. That's the way I look at it. So, but it's something you can make a lot of money trading. Now, I have to admit, for a lot of people that are like solely in on GameStop, it pains me to see the way a lot of them trade it. It pains me to see people that take their life savings and they put it on zero DTE super far out of the money calls because of Bloomberg terminal guy on Reddit says I have super secret squirrel information that will change everything. That that sucks just from the perspective. I like the reason why",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 94,
      "start_timestamp": "00:26:29",
      "start_timestamp_seconds": 1589.0382978723405,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1589"
    }
  },
  {
    "text": "people that take their life savings and they put it on zero DTE super far out of the money calls because of Bloomberg terminal guy on Reddit says I have super secret squirrel information that will change everything. That that sucks just from the perspective. I like the reason why I started doing the YouTube channel thing in general, I say this a lot too. It's not because I have the fucking looks to be on camera. I don't belong on camera, but it's to try and help people. So it's painful to see people that I would love to try to help in some capacity still making those kinds of choices. That's always a bit of a bummer. But one of my hopes and the third thing I will say in terms of why GameStop interest me so much is I really, really do hope to share at least small tidbits of information that people can learn and integrate into what they're doing that will be useful to them. That's why I do all of this. So those are the reasons big answer, but it is a really dynamic product that I can go, I really can go on and on about this is why I'm doing a live stream with Newton tomorrow. You and I have talked, I mean, we text each other every day about GameStop and what's going on. So it's a mix of interest in product. It's a mix of one hell of a story",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 94,
      "start_timestamp": "00:28:08",
      "start_timestamp_seconds": 1688.353191489362,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1688"
    }
  },
  {
    "text": "and on about this is why I'm doing a live stream with Newton tomorrow. You and I have talked, I mean, we text each other every day about GameStop and what's going on. So it's a mix of interest in product. It's a mix of one hell of a story and puzzle. And it's a mix of a great learning vehicle that you can make a lot of money in. That's how I think about it. All right, back up to the questions though. Nick says, how do you typically handle position sizing on options? Good question. So let's think about that. If I'm thinking about sizing a position, where do you think the starting point is? Do you guys have any ideas? And I think I have a question. I'm not sure if it's in my handy dandy. This thing is becoming a bear, by the way. It's kind of fun. I'm just going to keep building this thing out until until it's like this disgustingly long. Can't even read it. There's so much crap in it. Deck. Paul says two to three percent risk. No, absolutely not. It's a good guess, by the way, but absolutely not. Any other guesses? I don't know if I have that in here. Well, we have another one that I have to add. Truck complain says risk tolerance. That is the closest answer. Roaring Titty, I will always say your name because I love it so much. Welcome to the stream, by",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 94,
      "start_timestamp": "00:29:47",
      "start_timestamp_seconds": 1787.668085106383,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1787"
    }
  },
  {
    "text": "other guesses? I don't know if I have that in here. Well, we have another one that I have to add. Truck complain says risk tolerance. That is the closest answer. Roaring Titty, I will always say your name because I love it so much. Welcome to the stream, by the way. Not Delta and Jase's allocation close. That's very close. All right, so let's talk about it. Here's the way I think about it. When I'm looking at sizing a trade, the very first thing I need to know is what does my portfolio look like and what does it need? Based on that, it's the first step. So let's pretend I'm in a world where the portfolio can take on any sort of risk, meaning it's open for anything. It's not restricted in any sort of way. And let's pretend that I don't care what I put on. I don't have some sort of strong directional lean and stuff like that. The reason why I'm foregoing all of those nuances is because they're important to call out. But if I go through them all, the answer is very, very long. So I'm trying to give you guys the important bits. And I also have a video that literally talks about this exact thing in depth. So I'll throw that in there for you guys. It's called how I size option straights. But here's the takeaway. The way I think about it, let's say it's something like GameStop. Great",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 94,
      "start_timestamp": "00:31:26",
      "start_timestamp_seconds": 1886.9829787234041,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1886"
    }
  },
  {
    "text": "important bits. And I also have a video that literally talks about this exact thing in depth. So I'll throw that in there for you guys. It's called how I size option straights. But here's the takeaway. The way I think about it, let's say it's something like GameStop. Great example. This would fall into the speculative allocation of my portfolio. So what this looks like is if I show you guys how I think about my portfolio. This. So when I think about this, I have two buckets. I have a core allocation and I have a speculative allocation. So when I'm trading something like GameStop, it falls into the speculative speculative allocation of the portfolio. So with that, it gets a different amount of money right from the jump. And how much money it gets is completely dependent on the current market circumstances as annoying of an answer as that is. It is the honest one. It's not a set amount. But let's say that the general parameters for speculative trades is no more than 25 of the account. And you might hear that and think that that's a whole lot. It can be a lot. I'm not afraid of putting a lot of the portfolio into a specific trade. I also give myself a massive, massive birth to work through. So in general, my speculative trades would get about 10. Maybe of the portfolio 5 to 10 probably in terms of risk. So Nick says, is the",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 94,
      "start_timestamp": "00:33:06",
      "start_timestamp_seconds": 1986.2978723404256,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=1986"
    }
  },
  {
    "text": "afraid of putting a lot of the portfolio into a specific trade. I also give myself a massive, massive birth to work through. So in general, my speculative trades would get about 10. Maybe of the portfolio 5 to 10 probably in terms of risk. So Nick says, is the PowerPoint downloadable on the paid side of Discord or Patreon? It is not. The reason why it is not is because it is nowhere near done. I'm using it honestly just as like a personal reference as I'm doing like different podcasts and I'm working with different platforms like Irvin and yeah, stuff like that. So it's just a place to reference stuff. I haven't really built it to be externally available. So anyways, back to the sizing. I'm focusing on the risk side of the equation. So you can size things based off of how much capital in the account you want to give something, which is okay, that's fine. That's still part of my equation by the way. But then there's also the sizing based on risk and it's a they go hand in hand. So let's say for example, I look at GameStop and let's say that I'm trading what size portfolio do we want to use for the example? We can use whatever example you guys want and then I'll tailor it to that. Try it. I would say at least 500. I knew it was going to be something like that. I hate that so",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 94,
      "start_timestamp": "00:34:45",
      "start_timestamp_seconds": 2085.6127659574468,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2085"
    }
  },
  {
    "text": "I'm trading what size portfolio do we want to use for the example? We can use whatever example you guys want and then I'll tailor it to that. Try it. I would say at least 500. I knew it was going to be something like that. I hate that so much. Yeah, Reese, I like that number like 20,000. I would say I was going to say at least at least 15,000. At least. So in worry Titt, roaring titties equation of 500 bucks, like if that's the portfolio size genuinely, I would just save my money. It's just you're just so you're just so much better off just saving the money. And I know that that's an annoying answer and I know that that's not going to move any merch in terms of selling courses and shit, but I don't have a course to sell by the way. But the point is it's such a disadvantaged amount of capital that the overwhelming probability in that scenario that you're going to do something productive is so unbelievably low. I wouldn't necessarily call it zero, but it is damn close. So I wouldn't do that. Now let's say that we have the 20,000 portfolio. And let's say that we're okay. In that case, I would be much more careful with how much risk I would allow on individual trade. I would definitely say I would not allow more than 5 risk. And if I was trading something like GameStop personally, it",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 94,
      "start_timestamp": "00:36:24",
      "start_timestamp_seconds": 2184.927659574468,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2184"
    }
  },
  {
    "text": "the 20,000 portfolio. And let's say that we're okay. In that case, I would be much more careful with how much risk I would allow on individual trade. I would definitely say I would not allow more than 5 risk. And if I was trading something like GameStop personally, it would be closer than like 2 risk. It's just because I know the way it moves. And with that little of an account trading a small account like that, your biggest your biggest job is to avoid drawdowns. It's not to aggressively grow the account trading because again, the probability of doing that with the small amount of money is so unbelievably low. And I don't say that to dissuade anybody. It's the exact opposite of what my objective is, but it's to be honest. And I've been doing this a while. So I say it with pretty strong conviction that I think for the vast majority of people trying to trade something like this with a really small account are probably doing more harm than good to themselves. I would never say don't trade it. It moves very, very interestingly. So that's why I say in the example of a 20,000 account, let's say that we choose to give the position maybe 2 risk. Now, the way that you're carrying the rest of the portfolio matters quite a lot. The reason why it matters so much is because depending on how you're trying to make your money will be",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 94,
      "start_timestamp": "00:38:04",
      "start_timestamp_seconds": 2284.2425531914896,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2284"
    }
  },
  {
    "text": "a 20,000 account, let's say that we choose to give the position maybe 2 risk. Now, the way that you're carrying the rest of the portfolio matters quite a lot. The reason why it matters so much is because depending on how you're trying to make your money will be a strong determining factor of how to set this thing up. So to cut through all of that and to start answering the question succinctly, let's say that you have really, really, really strong conviction in GameStop. And you absolutely want to have a portion of your portfolio here. Okay. So then in that case, if my conviction is really strong, maybe instead of 2, I would take the total risk allowable maybe to 5, but at 5, it's like done. You can't go back in. So I would try to split that 5 maybe into a couple of different trades knowing the way that this thing can work. So what that would do is then say of this 20,000, 5 allowable rest takes me to what, a thousand bucks. If I take 2.5 half of that, then that gives me essentially 500 risk per opportunity. That's what I would use to size the trade. So in this case, let's say that I wanted to put on a trade and I know from the jump what my max risk is going to be 500 bucks so that I can try to take more than one shot at this. So let's",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 94,
      "start_timestamp": "00:39:43",
      "start_timestamp_seconds": 2383.5574468085106,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2383"
    }
  },
  {
    "text": "use to size the trade. So in this case, let's say that I wanted to put on a trade and I know from the jump what my max risk is going to be 500 bucks so that I can try to take more than one shot at this. So let's say what would that look like? Well, there's another part of the equation that is to be considered in my opinion. And there's a couple different ways that you can think about it. But I could say, well, let's just say I think GameStop is going up from here. I probably would wait personally. Like if I were to play this like right now, I already told you guys I flattened my options trades back here. Like I'm I took the option trades down and I just have long shares right now that I'm holding. And one of the main reasons why I'm holding the long shares is more so just to support the movement is just to try to be a part of it with you guys. But anyways, so if though I wanted to trade this to the upside and I know that I can risk 500 bucks, I'm bullish. Then I would go through the strategy selection process figuring out what I want to put on, what duration, how it fits with the analysis, how it fits with the portfolio, yada yada yada. All of that though matters. That's why I mentioned it because without going through",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 94,
      "start_timestamp": "00:41:22",
      "start_timestamp_seconds": 2482.872340425532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2482"
    }
  },
  {
    "text": "I'm bullish. Then I would go through the strategy selection process figuring out what I want to put on, what duration, how it fits with the analysis, how it fits with the portfolio, yada yada yada. All of that though matters. That's why I mentioned it because without going through that process, it is semi less informed when you're actually getting ready to place your trade. So in this case, let's say that I decide that I want to go out to 20 September. And I want to put on a trade that's bullish. So maybe I pick. I hate these options. The reason why I hate these options is because they're they're like not liquid. Just like these are not much better. This looks like the best bet right here. Now this is also because the markets closed and all that kind of stuff. But these are 30 cents wide. So let's just call it these. And you could put on a trade in these. It would cost you 6.15. If we analyze this trade, the total risk in this trade right now is 6.15. That does not mean I'm going to hold this until these are zero. If I do that, I've made a massive error in what I'm doing. And I am straight up a sleep at the wheel. So in this scenario, I would say, where's my floor per game stop? Where do I think that I would essentially manage risk to the downside? So let's",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 94,
      "start_timestamp": "00:43:02",
      "start_timestamp_seconds": 2582.1872340425534,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2582"
    }
  },
  {
    "text": "I do that, I've made a massive error in what I'm doing. And I am straight up a sleep at the wheel. So in this scenario, I would say, where's my floor per game stop? Where do I think that I would essentially manage risk to the downside? So let's go to this on the 17th of May. The reason why I want 17th of May is just to cut this move out so that this part of the chart has some depth to it. Because right now it's all so flat and congested because of this move. So what I would do is change the range here. And what did I say May 17th? So we'll go to May 17th. Until today. And then we can look at it on a daily still. That's fine. I just want the chart to move a little bit so that I can see things. So in this case, I would determine where I think support is. And again, this is under the assumption of a bullish trade. So for me, you can literally see where I think it is, at least as of right now. This is where my initial stop would be set. 2329, that's where it would be flattened. Cool. Now I know where I would get out. So now I need to go back. And I need to see where I can size this trade at at 2329, which funny enough, it's literally like a one standard deviation down",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 94,
      "start_timestamp": "00:44:41",
      "start_timestamp_seconds": 2681.502127659575,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2681"
    }
  },
  {
    "text": "be set. 2329, that's where it would be flattened. Cool. Now I know where I would get out. So now I need to go back. And I need to see where I can size this trade at at 2329, which funny enough, it's literally like a one standard deviation down move. So right here, this one. So at that one standard deviation down move, I would lose 100. But I know I'm okay losing 500. So that means that I can actually increase my trade size. It's going to take up more money upfront, but I know I'm going to manage it. So in this case, instead of putting on one and using this as the total risk and the trade, because I know I'm going to manage it, in this case, maybe I do four. So then as long as the account can handle putting on a trade of this size, I don't know what this would be as a percentage of the total account. What is it? 615 times 42460. So it's about 10 a little over 10 capital allocation on the account. And I don't care so much about that. Now if you're in a capital constrained account, obviously you would care about that. And you have to be very careful about where you choose to place your money. And you would have to then say, okay, this would be the maximum allowable size based on my risk management protocols. Cool. We know the answer to that.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 94,
      "start_timestamp": "00:46:20",
      "start_timestamp_seconds": 2780.817021276596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2780"
    }
  },
  {
    "text": "account, obviously you would care about that. And you have to be very careful about where you choose to place your money. And you would have to then say, okay, this would be the maximum allowable size based on my risk management protocols. Cool. We know the answer to that. However, if we're in a, if we're in a small account that's constrained by size, then you might say, but I can't put two grand into this position. I need that money to be able to put into other stuff. So you've created a parameter for yourself right from the jump. We've looked at what we're able to risk. We've looked at what we can size it at given risk as the metric. And then we're bouncing it off the portfolio. This is how I would size this trade. The process that I just walked you through is about the same, but it looks slightly different. And I need to update the title to this video. Because we just talked a lot about sizing trades. And I think it's good. All right. Now, the other part of this equation before I would ever considering hitting the launch button is to validate the expected return of the trade. That's a really important step in this process. Because when I look at something like GameStop, one of the things I would need to do is say, okay, I know where my risk is. Right. So if I trade down at my risk,",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 94,
      "start_timestamp": "00:48:00",
      "start_timestamp_seconds": 2880.1319148936172,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2880"
    }
  },
  {
    "text": "validate the expected return of the trade. That's a really important step in this process. Because when I look at something like GameStop, one of the things I would need to do is say, okay, I know where my risk is. Right. So if I trade down at my risk, I know that I'm essentially risking two and a half percent of my portfolio. That's not an insignificant amount of money. So where do I think it might go and how reasonable is it that it might go there? Well, it's kind of one of the cool things about options is we can use that to figure this out. So let's say based on a chart perspective, this looks like where the ceiling is just about 28 and a half ish. Right. I can see that that's where these two hovered on. That's where it hit over here. Yada yada yada. Whatever you do for your technical analysis, let's just say that I think this might be 28 and a half to the upside. Okay, cool. What do I make at 28 and a half to the upside? I make a thousand and thirty three dollars. So now we're almost done with this process. I have where is it? Move. Here it is. So in the I'm grabbing excerpt from an expected return calculator that I have. So let's say that you have one trade that you're going to put on. And in this case, the profit potential on the",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 94,
      "start_timestamp": "00:49:39",
      "start_timestamp_seconds": 2979.4468085106387,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=2979"
    }
  },
  {
    "text": "done with this process. I have where is it? Move. Here it is. So in the I'm grabbing excerpt from an expected return calculator that I have. So let's say that you have one trade that you're going to put on. And in this case, the profit potential on the trade I told you guys is 28 and a half at that. It would be worth about 10, 21 ish. So let's say my profit potential is 10, 21 bucks. And the loss potential is negative. Would we say negative 400 ish? Something like that. Yeah. So in this case, it would be negative 400. So in this scenario, I'm thinking about putting on something that might make 10, 21 or it might lose 400. However, there's an important gap in this analysis. Do you guys know what the gap in the analysis is? And let me see if I can find that other window so I can just create like a blank slide for us to look at together. This will work fine. Time. That's part of it. That's not what I'm looking at here, but I like what you're saying. That's not it. One to two and a half. That's not it either. As soon as I post this in, you guys will then probably know exactly what it is. IV. Nope. Probability is trucking plane for the wind. Ding ding ding. That's it. So if I use this, I actually think I have a video coming out",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 94,
      "start_timestamp": "00:51:18",
      "start_timestamp_seconds": 3078.7617021276596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3078"
    }
  },
  {
    "text": "half. That's not it either. As soon as I post this in, you guys will then probably know exactly what it is. IV. Nope. Probability is trucking plane for the wind. Ding ding ding. That's it. So if I use this, I actually think I have a video coming out tomorrow about this. Let me double check. Yeah, that's funny. I literally have a video coming. Man, you guys are so good at like leading me into segues. There's a video I have coming out tomorrow called managing options positions in expected return, literally in GME. That's hilarious. But anyways, we can give you guys a preamble here. We're missing these two things. The probability of making money and the probability of losing money. Just because I say I'm going to try to make 1021. That doesn't mean I'm going to make 1021. That's not what that means at all. It just means that's what I'm trying to make. That's what I think is reasonable based on the chart. But that doesn't mean that that's in reality what this is. So then we need to go through the rest of the process exactly as you guys outlined. And the video tomorrow will go through the rest of that process. So I'm actually not going to double tap it here because it goes through literally the entire thing in depth. So I will share a link to the video that's coming out tomorrow. And it'll be out in the morning at",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 94,
      "start_timestamp": "00:52:58",
      "start_timestamp_seconds": 3178.076595744681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3178"
    }
  },
  {
    "text": "tomorrow will go through the rest of that process. So I'm actually not going to double tap it here because it goes through literally the entire thing in depth. So I will share a link to the video that's coming out tomorrow. And it'll be out in the morning at 715 AM. There you guys go. You won't be able to access it now because when it's scheduled, I wish YouTube would let me do that by the way. I think it'd be really cool if the video is scheduled and people could still see it. But for whatever reason when it's scheduled, you can't see it through the link. It's kind of annoying. That thing would be cool to like give you guys a sneak really peak. That would be fun. But this is what we need to fill in next because this is then how we determine the expected return on the position to then finally validate if this thing makes sense. So good, good point. All right, back into the chat to see if there's any other questions that we want to hit. Roryn TV says, do you use hotkeys? I'm really struggling to exit my orders fast enough, fumbling through order tickets. I do not. I do not trade anything that requires moving that fast. If I traded something that required moving that fast, I, I mean, I probably just wouldn't do it, to be honest, like if the speed of my execution requiring hotkeys to",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 94,
      "start_timestamp": "00:54:37",
      "start_timestamp_seconds": 3277.3914893617025,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3277"
    }
  },
  {
    "text": "fast enough, fumbling through order tickets. I do not. I do not trade anything that requires moving that fast. If I traded something that required moving that fast, I, I mean, I probably just wouldn't do it, to be honest, like if the speed of my execution requiring hotkeys to get in or out, that means I'm competing and doing the wrong thing in my opinion. That's a really tough way to make money trading personally. So no, I don't. Not really. Joey says, this is maybe think I've been too conservative, very likely. I absolutely do not, I do not doubt that. I think a lot of people have a terrible approach with respect to trade sizing. That's actually why I shared that other video as well. And it's, it's so important to get it right. Because if you don't do that, then you essentially don't give yourself an opportunity to make money. Like that's essentially what it comes up with. Noah, Noah's Ark, Noah, what up Noah? Noah says, I know you don't like spreading hyperfied, but I'd love your perspective and prediction on what potentially could happen with GME after this Max Payne. It's Max Payne. And I'm assuming that you're referring to the video that I made a little bit earlier today for those that haven't seen it yet. You could check it out here. It goes into the concept of Max Payne, a little more in depth and how it works. Just because I know",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 94,
      "start_timestamp": "00:56:16",
      "start_timestamp_seconds": 3376.706382978724,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3376"
    }
  },
  {
    "text": "I'm assuming that you're referring to the video that I made a little bit earlier today for those that haven't seen it yet. You could check it out here. It goes into the concept of Max Payne, a little more in depth and how it works. Just because I know for the GME crowd, the GME folks are like very, very interested in Max Payne. And I actually think sometimes it can be blamed maybe a little bit too much. But in this case, I do think, especially today that there's some element of it. But from a probabilistic scenario, the short answer is normally there's a reversion the week after. That's just citing the output of that study. So if you're a believer of that, then that's what you would expect. If you have a different way of synthesizing the recent market transactions or kind of the market trend, then it would be a slightly different answer because I think a couple of things going on with GameStop right now, one of which is small caps are down. And that just does not help GameStop. I'm not saying that that's like the primary profit driver. It's not. But it's also not something that's not involved in the equation. I don't know if I did the double negative right there. You guys will have to fact check me. But that is what that is what I think. So because if we take a look at this and we look at",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 94,
      "start_timestamp": "00:57:56",
      "start_timestamp_seconds": 3476.0212765957444,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3476"
    }
  },
  {
    "text": "also not something that's not involved in the equation. I don't know if I did the double negative right there. You guys will have to fact check me. But that is what that is what I think. So because if we take a look at this and we look at small caps, they're still pretty mixed. They're not doing terribly, but the majority of them are still negative. They're still bound. So that's a little bit of a problem. And it adds this just pull specifically to something like GameStop beyond the fact that literally the entire market was down today, like everything was down a bit today. So that doesn't necessarily help much. Now it's been running around this point of control for weeks now. We started moving about the point of control back on the 10th of last month, where it has just been transacting around this over and over and over again. It's literally just oscillating sideways through it. So people are very willing to transact here. That's what it tells me. And that's where the overwhelming volume has occurred. There's not that many people below this. So when I look at this, I do kind of question in terms of like how low does it go? Because it is struggling to be moved lower. It's had, I know it's so difficult to see because this chart is so flat because of this move. We can actually just get rid of it for a second. And I",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 94,
      "start_timestamp": "00:59:35",
      "start_timestamp_seconds": 3575.336170212766,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3575"
    }
  },
  {
    "text": "question in terms of like how low does it go? Because it is struggling to be moved lower. It's had, I know it's so difficult to see because this chart is so flat because of this move. We can actually just get rid of it for a second. And I don't know how to slide this thing down though. And by. So this to this was like a 20 return. So seeing something kind of come down after a 20 return and I oscillate sideways for a little bit, like that's okay to me. Now I don't think it necessarily has the wind at its back though. That is one of the problems I think we have here is when I look at the breadth of the market, this is starting to turn really not great. So we had net highs running for a while now. Like this is the first time we've seen them run like this since back in May. And we were definitely starting to gain a lot of steam. We hit a peak. And I mean, this is like a precipitous down move from this peak. We went from 458 net highs to 322 to 157 to negative 51. That is a big rotation in companies making highs. That is not insignificant. And then if we take a look at another index quick. So we don't just have to look at the the NASDAQ. I like looking at the New York Stock Exchange as well because",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 94,
      "start_timestamp": "01:01:14",
      "start_timestamp_seconds": 3674.6510638297873,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3674"
    }
  },
  {
    "text": "to negative 51. That is a big rotation in companies making highs. That is not insignificant. And then if we take a look at another index quick. So we don't just have to look at the the NASDAQ. I like looking at the New York Stock Exchange as well because it's a little more encompassing. It's just barely hanging in there still as compared to the NASDAQ. So that's what you're seeing here. It's not anything that I feel like it's not anything that you can kind of dismiss. And it's something that will serve as a bit of a headwind going on. So yeah, that's kind of the short term thoughts on what we're seeing here, at least in my opinion, for whatever that's worth. Model Blunder says it was a good video on Max Payne. Just watch it. That's awesome. Don't forget to like it. Helped me show up in the YouTube algorithm. We're still trying to grow, man. Right now my goal for the year was to hit 25,000 subs. And it looks like we're on track pretty strong. It looks like we might hit that in the next like maybe four weeks or so. That would be really, really cool. That has been my near that has been the annual target for a while. So yeah, anyways, back over to this. Kirby says, what beer are you sipping on? Just curious about your choice of recap beer. Oh, check out this recap beer. I got you.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 94,
      "start_timestamp": "01:02:53",
      "start_timestamp_seconds": 3773.9659574468083,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3773"
    }
  },
  {
    "text": "be really, really cool. That has been my near that has been the annual target for a while. So yeah, anyways, back over to this. Kirby says, what beer are you sipping on? Just curious about your choice of recap beer. Oh, check out this recap beer. I got you. There she is in all our glories. Actually, I don't know if does that come through? I can't tell if it gets hold on. There you go. It like hold on. There you go. There it is in it in all its glory. Bam, a little bit of spin drift, mango orange. I like this one a lot. It's my favorite. It's a good one. Let's see what else you guys got. Nick says we lost the 50 day MA watch for that to hold. That's probably a pivot point outside of the 200 week SMA. I don't know about the moving averages in GME. I'll actually take that as a homework item for you guys. I study moving averages on just about every product that I trade. I don't know them in GameStop. Moving average behavior in GME. I'll probably look at something like the maybe the nine, the 20, the 50, the one, 50, and the 200 probably just the 200 not the 150. I'll take a look at that and I will follow up with you guys. I owe you an answer there. I think for this specifically, it looks like yeah, it's hard to make heads",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 94,
      "start_timestamp": "01:04:33",
      "start_timestamp_seconds": 3873.2808510638297,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3873"
    }
  },
  {
    "text": "20, the 50, the one, 50, and the 200 probably just the 200 not the 150. I'll take a look at that and I will follow up with you guys. I owe you an answer there. I think for this specifically, it looks like yeah, it's hard to make heads or tails on how it behaves around right like this. It moves about it a lot. Nick says 5200 SMA or the best to watch. That is a really stand right. It's called the Golden Cross and it's called that for a reason. It's a very, very standard. The problem is for something like GameStop is it has its problems right like if you look at the lagging on the 200, which is picking up stuff like this. This lag in the 200 makes it difficult right like by the time you get the quote unquote death cross, which is 50 under 200. This thing will have already moved down 10 points right. It'd be a massive down move. So yeah, in standard products, I agree with you. The 50 200 is a very, very standardized moving average combination that's pretty efficacious. But in something like this, I actually am not sure if I would lean too heavily on it. I say that on all the videos that I'm analyzing GameStop is that I don't think that this thing follows a lot of the normal rules. So I always call that out because I think it's important, at least the",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 94,
      "start_timestamp": "01:06:12",
      "start_timestamp_seconds": 3972.595744680851,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=3972"
    }
  },
  {
    "text": "not sure if I would lean too heavily on it. I say that on all the videos that I'm analyzing GameStop is that I don't think that this thing follows a lot of the normal rules. So I always call that out because I think it's important, at least the way that I perceive its behavior around different technical levels is completely different. Cool. It looks like I'm caught up on the questions. Let's talk about this trade checklist now. This is a bit of an older one and I probably need to update it with a few things, but I think it's a good place to start. The way I look at a trade checklist, there's two pieces to it. There's a pre-trade checklist and then there's a post trade. I typically call the post trade and AAR after action review or after action report. This is just a military term, but it's a post trade checklist. This is the same thing. So if you hear me flow between them colloquially, that's what I mean. You have the pre-trade checklist and then you have the AAR. So let's talk about some of the bigger components of it and then we can discuss a little bit about how to create your own because that's what this is for. I'm going through this to give you guys ammunition to make your own. So the way that I'm picking this checklist up is that you've already gone through your trade analysis. You've",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 94,
      "start_timestamp": "01:07:51",
      "start_timestamp_seconds": 4071.9106382978725,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4071"
    }
  },
  {
    "text": "we can discuss a little bit about how to create your own because that's what this is for. I'm going through this to give you guys ammunition to make your own. So the way that I'm picking this checklist up is that you've already gone through your trade analysis. You've already found that it fits the portfolio and all of those kinds of things. We know we want to put the trade on. That's essentially where this is picking up from. So once that happens, we're going to verify that the product itself fits our general criteria and we know what's coming up. So the first step in this checklist for me is like a broad screen of the product and the environment. That's what this is. Then I'm going to make sure that I have a specific hypothesis. So the reason why this happens all the way down here in the trade checklist after I'm saying we already know I want to put it on is it goes like this. I'm looking, I know I want to be long in game stuff. I want to put a long trade on it. Okay. So I already have that idea. The hypothesis is there. However, the process that I was showing you in terms of building this, this is the hypothesis. So I have kind of that first stage of I want to be long this product. Okay, that's like the very high level. I'm going to look more closely at",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 94,
      "start_timestamp": "01:09:31",
      "start_timestamp_seconds": 4171.2255319148935,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4171"
    }
  },
  {
    "text": "hypothesis is there. However, the process that I was showing you in terms of building this, this is the hypothesis. So I have kind of that first stage of I want to be long this product. Okay, that's like the very high level. I'm going to look more closely at this thing. This is now actually building the hypothesis. Where do I think it's going to go? What's the probability of it going there in what time frame? It's why don't you start getting specific about what you're doing. So that's what's happening in the second step. Third step is based on what I find in the second step. I'm fitting a strategy that makes the most sense from my toolkit. The way that this works. And I realize I just need to like make a copy of this trade checklist in here. It'd probably be easier. But the way that this works is I go to this. Well, I mean, I'll actually go to this. I kind of know this well enough by now. But this is my stable of strategies. This is essentially 90 of what I do. If not more is just it's this one, two, three, four, five, six, seven, eight, nine. It's nine things that is the overwhelming majority of what I do. So I'm going to go to this list and I'm going to figure out what things fit the idea. What fits my thesis? So in this case, I want to be long",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 94,
      "start_timestamp": "01:11:10",
      "start_timestamp_seconds": 4270.540425531915,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4270"
    }
  },
  {
    "text": "four, five, six, seven, eight, nine. It's nine things that is the overwhelming majority of what I do. So I'm going to go to this list and I'm going to figure out what things fit the idea. What fits my thesis? So in this case, I want to be long game stop. Okay. Am I expecting a big move or a little move depending on the answer to that? That will narrow down what kinds of things that I would want to trade. So this the step I'm outlining now is going through your stable of strategies and fitting what fits your idea. That's the third step. So first step, we're making sure that the product is suitable. Making sure that there's nothing coming down the tracks that we don't know about earnings, stuff like that. Second step, we're quantifying and getting specific about our hypothesis. Third step is fitting the correct strategy. The fourth step is finalizing the PL management plan. So in this case, once we get through the hypothesis, we know it's going to go out. We know the probability of it going there. We know the expected return on the trade. This is where I am setting specifically how I'm going to execute the steps. Am I going to set an alert that is just above where my stop is so that I can exit it? Am I going to set a stop order? I did that today in T-Tribal Qs because I nibbled a little",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 94,
      "start_timestamp": "01:12:49",
      "start_timestamp_seconds": 4369.855319148936,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4369"
    }
  },
  {
    "text": "setting specifically how I'm going to execute the steps. Am I going to set an alert that is just above where my stop is so that I can exit it? Am I going to set a stop order? I did that today in T-Tribal Qs because I nibbled a little bit yesterday at a really tight stop on the trade because I didn't trust it here. I'm getting in what I was considering to be really, really early. So I wanted to take some of the trade down if it continued to experience a bit of a down move. So this is where I'm getting into the specific details of how am I going to execute the PL management, which today I was stopped out, like almost right after the opening because I said it really, really, really tight on this, on the close from yesterday. So that's that step. And then the last step, this is where I am going to go over the whole trade to make sure that it's correct. Now I have to be honest with you, I don't do this anymore. Like I really don't. This isn't something that's part of my review process anymore. I spend so little time doing this. I think it's because I have a lot of confidence in my execution at this point. But I think in the beginning, going through this is important to make sure that you're not trying to put on a certain trade. And then you're",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 94,
      "start_timestamp": "01:14:29",
      "start_timestamp_seconds": 4469.170212765958,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4469"
    }
  },
  {
    "text": "I spend so little time doing this. I think it's because I have a lot of confidence in my execution at this point. But I think in the beginning, going through this is important to make sure that you're not trying to put on a certain trade. And then you're putting on a completely different thing because you fat fingered it and put on the wrong thing. That's that's a bad scenario. We want to avoid those. Essentially, it all costs. Those are terrible, terrible positions to have on. That unnecessarily nuke the return potential. So that's that. Now the very last thing from the pre-trade checklist is to input whatever it is into your trade log. So for this, I would need to outline the strategy. In this case, it was a ratio called diagonal. I actually think I'm going to rotate back in this to just using shares as compared to the options because the options are a little too liquid. I was noticing. So I like the leverage of the options. I'm not fully convinced yet on T-Triple Q's if I'm going to stick with the coverage stringlet or options. But I'm going back and forth because in back testing, I have an idea of how they both perform and I like them both fine. But the management of the strategy is about the same. It's mostly about the liquidity of the options. They're not terrible, but they're not good. So it creates a little bit of",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 94,
      "start_timestamp": "01:16:08",
      "start_timestamp_seconds": 4568.485106382979,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4568"
    }
  },
  {
    "text": "in back testing, I have an idea of how they both perform and I like them both fine. But the management of the strategy is about the same. It's mostly about the liquidity of the options. They're not terrible, but they're not good. So it creates a little bit of a problem when I'm trying to navigate positions like this. You can look at this. It's a 65 product, this strike, for example. And it's bid 1320 offered 1450. It's just too wide. So because of that, I'm slowly getting pushed. But then you'll find more liquid strikes like this. So the 70s that are 20 set. So anyways, a little bit of background on the product. But the less component of the pre-trade is to track the requisite elements of the position after we launch it. So let me take a pause there on the generalized pre-trade checklist. And see if there's any questions. Now for those that are in the Patreon, there's the Patreon shop that you guys have access to. I have templates for most of this stuff in there for you. I actually need to update this one for you guys. But you can get an idea there. But for everybody else, literally, you can just go through the stuff I was just showing you. And you can mirror your own from there. Alfonso says don't need RK and is use options buys. That's too funny. GME is closed above 30 only six times since 22.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 94,
      "start_timestamp": "01:17:47",
      "start_timestamp_seconds": 4667.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4667"
    }
  },
  {
    "text": "idea there. But for everybody else, literally, you can just go through the stuff I was just showing you. And you can mirror your own from there. Alfonso says don't need RK and is use options buys. That's too funny. GME is closed above 30 only six times since 22. All of them after his May 13th reappearance on X. Oh, I see. Roaring Titty was saying we shouldn't have to need Kitty. Yeah, yeah, I agree with you. Now with something like GameStop specifically, he is a big part of it. Like there's no doubt that he is a massive player in the movement of the product. But like as a trader in general, I couldn't agree with you more. You don't need anybody. That is literally the beauty of being a trader is even if you're a business owner, you need things because you need to have people that help you or if it's just you to like build whatever it is you sell. And then you need customers to then sell to like you need things in trading. You literally need nothing other than access to markets. Everything else is completely wrapped up in its own thing. You do not have to talk to anybody. You need nothing. So trading is one of the really cool things where it's like it is genuinely, genuinely a solo endeavor. Do you participate with other people? But it is a very, very solo endeavor. That's the cool part about it.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 94,
      "start_timestamp": "01:19:27",
      "start_timestamp_seconds": 4767.114893617021,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4767"
    }
  },
  {
    "text": "You do not have to talk to anybody. You need nothing. So trading is one of the really cool things where it's like it is genuinely, genuinely a solo endeavor. Do you participate with other people? But it is a very, very solo endeavor. That's the cool part about it. Matt says I bought a couple GME in the money 20s for September. With the recent Susclose, should I be concerned? Let's take a look at that in a second. Yeah, I'll happily take a look at that. Let me finish the AR section of this. And then because the AR section is pretty short and then we can take a look at that. I'm happy to. So this is essentially what I would wrap up with for the AR process. It doesn't have to be long. It can be whatever you need it to be in the beginning. As you're going through and thinking about creating a trade checklist and like in AR process, the first thing that I would ultra mega highly recommend to you guys is that you make it something that you will follow. It is so unbelievably worthless to build something that might track every detail or data point you could ever possibly need in your entire life. It is entirely, entirely worthless if you don't use it. So I cannot recommend enough that you pick things that make sense for you. This first step is to simply track what happened. This second step is",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 94,
      "start_timestamp": "01:21:06",
      "start_timestamp_seconds": 4866.429787234043,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4866"
    }
  },
  {
    "text": "detail or data point you could ever possibly need in your entire life. It is entirely, entirely worthless if you don't use it. So I cannot recommend enough that you pick things that make sense for you. This first step is to simply track what happened. This second step is to look at what happened in the context of the entire strategy system that you run. So for example, if I'm trading the ratio call diagonal in T triple Q's and I get stopped out today, I will then not only track the details on that for the individual trade, but I will look at the performance of the strategy as a whole. I will look at the performance of my interactions with the individual product. So those kinds of things give me a ton of information about what I'm doing and it helps me optimize the approach that I'm taking. So that's what that is. And I'm going to let my dog out really quick. I will be, be our B. All right, King. We are back in action. He is just ran into his bed and he's now in like this little tiny, curled puff ball. He's actually really hilarious when he lays down because he like hugs his back legs with his front arms. It's a, I mean, he's the most flexible thing I think I've ever seen in my life. It's actually very, very impressive. So that's essentially what I'm tracking in the second step though",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 94,
      "start_timestamp": "01:22:45",
      "start_timestamp_seconds": 4965.744680851064,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=4965"
    }
  },
  {
    "text": "really hilarious when he lays down because he like hugs his back legs with his front arms. It's a, I mean, he's the most flexible thing I think I've ever seen in my life. It's actually very, very impressive. So that's essentially what I'm tracking in the second step though is I'm feeding it back into the strategy. I'm making sure the strategy did what it was supposed to do. I'm making sure that there's no new data points that I need to take into consideration when I'm running that strategy in the future. All of those kinds of things. And then the last thing is I'm bubbling it up one more level to the entire portfolio is my portfolio behaving as it should did this trade fit and operate within the portfolio as it was supposed to those kinds of things. Now, notice how I don't do this like what was your emotional fucking feelings when you played like personally, I don't care about that because I am a entirely grown man and I'm going to manage my emotions as such. Now that's not to belittle other people that feel like they might need to do that. If you feel like you need to do that and to track it, then do that. But I would also let you know that if you feel like you need to do that, you probably have some much bigger problems coming down the pike with your trading to be completely honest. If",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 94,
      "start_timestamp": "01:24:25",
      "start_timestamp_seconds": 5065.059574468085,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5065"
    }
  },
  {
    "text": "feel like you need to do that and to track it, then do that. But I would also let you know that if you feel like you need to do that, you probably have some much bigger problems coming down the pike with your trading to be completely honest. If you're so emotional as a human being that you have to track and log your emotions when you're placing trades to not have problems, like how do you even fucking manage that is what it comes down to. Like to me, that is such a difficult, difficult way to try to operate with markets. So if that is you, do what you have to do. But what I'm highlighting is if that is something that needs to be baked into your process, it would be somewhere up here. And I know that that's really common for like day traders like right, your emotional well-being or whatever the fuck like I don't know to me. It's just like be a grown adult and behave like one. And it's okay. If you know that you're having a terrible day like we all have, I'm not saying I'm emotionless. I have them too. But if I know if I'm having a terrible day, I'm just not I'm not going to do things in the market that I don't have to. So yeah, Rointit, he says you get therapy for the reasons you screw up your trade. Yeah, yeah, exactly. That's actually funny. The",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 94,
      "start_timestamp": "01:26:04",
      "start_timestamp_seconds": 5164.374468085107,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5164"
    }
  },
  {
    "text": "But if I know if I'm having a terrible day, I'm just not I'm not going to do things in the market that I don't have to. So yeah, Rointit, he says you get therapy for the reasons you screw up your trade. Yeah, yeah, exactly. That's actually funny. The I have a dude that I bring on the channel once in a while that I think is really, really cool. And he does like the cognitive side of trading. It's very, very fun to interact with him. But I definitely notice a really significant departure in the way that I think about markets and the way that I think about trading. But I did an exercise with him on the last podcast I did with him. His name is Richard Freason. He's a great dude. And the funny thing about that interaction though is that like the exercise he had me do was so uncomfortable. I hated it. But I wanted to play ball, right? Like that's the whole point is to try and keep an open mind and try to do things. And there was cool elements of it. I'm always willing to try things and I'll try to focus on the the specific components. Yeah, truck complaints as Eric's inner bitch coming out on stream. That's exactly it. That was exactly it. Fuck, I hated that. But it yeah, the thing is I try to show you guys the different ways to do things. And I'm willing",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 94,
      "start_timestamp": "01:27:43",
      "start_timestamp_seconds": 5263.689361702128,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5263"
    }
  },
  {
    "text": "to focus on the the specific components. Yeah, truck complaints as Eric's inner bitch coming out on stream. That's exactly it. That was exactly it. Fuck, I hated that. But it yeah, the thing is I try to show you guys the different ways to do things. And I'm willing to try things. But yeah, I mean, it's not like I would go super far down that path. Yeah, that's kind of what it blows down to I suppose. Day swag, which if you guys didn't know, the only way to pronounce that is day swag. Don't don't mess that up. Don't disrespect us out here by calling them like disswag. Like you would think it's day swag. You guys got to put a little respect on his name. He says as a social worker and therapist, I love this. Yeah. Oh God, I would I feel like I would be a therapist worse nightmare at the, be honest. I just can't imagine that it would be a fun conversation with me. And I mean, I wouldn't blame them. Cool. All right, let's get over to your questions now. We have, I mean, really, we have a while left if you guys want. There was a couple other things I wanted to show you guys, not from a pre post trade checklist. So actually, let me wrap that section up. Are there any questions on this idea of a pre-trade or trade a our process? Does what we reviewed generally",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 94,
      "start_timestamp": "01:29:23",
      "start_timestamp_seconds": 5363.00425531915,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5363"
    }
  },
  {
    "text": "you guys want. There was a couple other things I wanted to show you guys, not from a pre post trade checklist. So actually, let me wrap that section up. Are there any questions on this idea of a pre-trade or trade a our process? Does what we reviewed generally make sense? And are there any components of it that you want to discuss further? I have to imagine it's probably like the most boring part of learning about trading and learning about options, but I'm not here necessarily to entertain you guys, although I like to have fun. I'm here to share the the way to do this, at least as far as I see it, and that is part of it. So, gotta share it even though that's not exactly gonna, that's not gonna get the people jazzed up that we do know. Cool. All right, so it seems like there's no questions there, which is fantastic. Here we go. Elon Song says, sometimes do a live trade and walk through it in detail. I suppose I could do that. Yeah, I suppose I could do that. Like I could record myself placing a trade and share that. Yeah, I would give that. That's a thing. Chewie says, do you write in paper? No, I do not. I use a giant Google Doc. So it used to be a Word Doc, but then I moved into a Google Doc so that I have a little bit more room",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 94,
      "start_timestamp": "01:31:02",
      "start_timestamp_seconds": 5462.319148936171,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5462"
    }
  },
  {
    "text": "Yeah, I would give that. That's a thing. Chewie says, do you write in paper? No, I do not. I use a giant Google Doc. So it used to be a Word Doc, but then I moved into a Google Doc so that I have a little bit more room to move. So this is what it looks like. The document is massive. You can see it like right now, it's over 400 pages. This is essentially where I do it. This is essentially where I track almost all of this stuff, but this is where I track a ton of stuff. But yeah, it's in a Word Doc like that. Rointitty says you could do it live with us with paper trade. Yeah, I would be completely down. I'm happy to do that. Rointitty, you know, I can't say no to Rointitty. It's impossible. So Root of Vegas says you could publish it as a book. Yeah, but it would be like Marcus Arraileus' Meditations. Most people would read that and be like, what the fuck is this? Because it's all written for me. It's not really written for other people to consume. So it would be, I imagine a nightmare to attempt to read for the normal reader. But yeah, Rointitty, if you guys want to do that now, I'm happy to. It'll take me a minute if I'm going to do it in detail, which again, I'm happy to do that. If you guys want to pivot",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 94,
      "start_timestamp": "01:32:41",
      "start_timestamp_seconds": 5561.634042553192,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5561"
    }
  },
  {
    "text": "a nightmare to attempt to read for the normal reader. But yeah, Rointitty, if you guys want to do that now, I'm happy to. It'll take me a minute if I'm going to do it in detail, which again, I'm happy to do that. If you guys want to pivot to that now, or we can take a look at any other questions you have, I think somebody is pointing me up to the top. Who was that? Let me see. Kirby says, don't forget Matt's calls before the next section. Yeah, where was that? Let me find them. Here it is. Oh, yeah, thank you. Thank you so much for the reminder. Matt says, I bought a couple of GMME in the money. 20 calls for September. Yeah, let's take a look at these bad boys. So September and it's the 20s. Okay. Got them right here. And it says, one for September, one for October. Okay. So we have another one out here. And it looks like the 20s at both, which is here. Okay. With recent sus clothes, should I be concerned? And there are new subscribers. Hey, shout out to you. Thanks for subscribing. That you just moved us one step closer to that 25k. So thank you very much. It takes a village. And then we get there. So thank you. So I wouldn't be concerned with the quote unquote sus clothes. I would be concerned with the price behavior. If you want this to",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 94,
      "start_timestamp": "01:34:20",
      "start_timestamp_seconds": 5660.9489361702135,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5660"
    }
  },
  {
    "text": "just moved us one step closer to that 25k. So thank you very much. It takes a village. And then we get there. So thank you. So I wouldn't be concerned with the quote unquote sus clothes. I would be concerned with the price behavior. If you want this to go up, it's not going up. So from my perspective, looking at your question, I would turn it back onto you. And I would say, where is your predefined profit and loss point? That is the very first step in this. Because whether or not I think you're in trouble really doesn't matter. Like it genuinely doesn't matter at all. What matters here is what you think about your own position. And you're approached to managing your own position. That's what I think at least. Because when I look at that, there's a reason why I exited my shit here. Right. So that gives you where where I'm at in terms of what I would be doing with positions. But the difference also is that like I'm a trader. My entire job as a trader is to find things that are moving the way that I want them to and then to interact with them. That's what I typically think. So I don't see any follow-ups from him just in terms of the PNL. That would be the question I have for you though. Matt, if you want to talk about your trade more, I'm happy to. But I would",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 94,
      "start_timestamp": "01:36:00",
      "start_timestamp_seconds": 5760.2638297872345,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5760"
    }
  },
  {
    "text": "then to interact with them. That's what I typically think. So I don't see any follow-ups from him just in terms of the PNL. That would be the question I have for you though. Matt, if you want to talk about your trade more, I'm happy to. But I would need to know two more things. I would need to know when you got into the trade and then what you're predefined profit and loss management protocols are. That's what I would need to see. Model Blunders alter. What says how far do you go back in your trading log when just are reviewing how strategies are performing? That's a great question. So I have it all built out into essentially data infrastructure at this point. So the way that I like I have data that goes back probably like usable data that goes back probably 14 years, something like that. I didn't have great logs for like the first four-ish years of what I was doing. So I have data that goes back that far. And then it's almost like applying moving averages. Like I like to have the entire population of data available, but I often segment it. So I would I'm much more interested in how things are doing recently and and stuff like that. That's the answer to that. Mark Khan says, what's your stop loss percentage? What does this have to do with? Mark, could you clarify just the origin of the question? Zach says",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 94,
      "start_timestamp": "01:37:39",
      "start_timestamp_seconds": 5859.5787234042555,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5859"
    }
  },
  {
    "text": "So I would I'm much more interested in how things are doing recently and and stuff like that. That's the answer to that. Mark Khan says, what's your stop loss percentage? What does this have to do with? Mark, could you clarify just the origin of the question? Zach says I got 25 and 30 in October was up nicely but held. Yep, that's the problem. Especially with the 30s being out of the money out here is just dangerous. Now the good part is and hats off to you for going far enough out in time. That was actually a highly educated move. Did you know to do that or did you live did you learn that on the channel here at a curiosity? Oh, who is this trade by the way? Where was this? Zach, Zach, did you did you go out? Would you typically go out in October or I learned that from you? Okay, awesome. Well, one that's one Pat myself on the back, but two, I'm actually really stoked that you did that because here's the deal. Take a look at your theta. It's three cents. So you're still losing a large percentage of this without a doubt. But if you compare that to the other people, what delta are you at? You're at a 50 delta. Compare that to the people here at a 51 delta and their options are worth let's call it 270. They're losing six cents a day. They're losing a",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 94,
      "start_timestamp": "01:39:18",
      "start_timestamp_seconds": 5958.893617021277,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=5958"
    }
  },
  {
    "text": "without a doubt. But if you compare that to the other people, what delta are you at? You're at a 50 delta. Compare that to the people here at a 51 delta and their options are worth let's call it 270. They're losing six cents a day. They're losing a massive, massive amount of the total value of these options on a daily basis. So they are in the definition of swimming upstream hardcore, hard for. So I'm actually really, really stoked that you went out that far. Now, even in your scenario, though, I would like, yeah, I think holding after this day was a mistake. Personally, while going a swag is out here again, hitting up the Jamaicans is good. So yeah, that's the thought on that. Obviously, happy to go further into in the detail. I'm going to get back. All right. Alfonso says in the likely IV Crush for Max calls September is historically the worst month for stocks in general. I don't know about the seasonality there. And the seasonality also is slightly dependent. So I wouldn't make big trade decisions off of seasonality like that personally, because it's not, it's really not, it's not the most efficacious thing. But it's, it is something to be aware of, I suppose. I don't, I don't hate being aware of that, but I wouldn't make that a big deal personally. At least the way I think about it. The next question I see is from Paul. And",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 94,
      "start_timestamp": "01:40:58",
      "start_timestamp_seconds": 6058.208510638298,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6058"
    }
  },
  {
    "text": "the most efficacious thing. But it's, it is something to be aware of, I suppose. I don't, I don't hate being aware of that, but I wouldn't make that a big deal personally. At least the way I think about it. The next question I see is from Paul. And Paul has a very hypothetical question here. And Paul's hypothetical is also we have 68 people on the stream. So first off, shout out to you guys. Second of all, if you guys can invite one more person and no more than that, that would be the most magical thing. Really, if we could just hover at the magical number for a while, that I think would make my night. So we might have to vote people off the island if it starts rising above that. But I mean, we just need to get one more human being in here. I feel like somebody has a friend that they could just open up their phone and just put it down even if they're not watching. Oh, damn it. We just lost three. We moved away from the magical number. That's the worst. You guys got me excited and then ripped it away from me. Unbelievable. Well, let's go back to Paul's very hypothetical. Paul says, Jimmy leaps from to the April low, to May 80 run. I'm curious if you sold a call. What that would look like. I have to read your question again from the April low. Okay,",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 94,
      "start_timestamp": "01:42:37",
      "start_timestamp_seconds": 6157.523404255319,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6157"
    }
  },
  {
    "text": "it away from me. Unbelievable. Well, let's go back to Paul's very hypothetical. Paul says, Jimmy leaps from to the April low, to May 80 run. I'm curious if you sold a call. What that would look like. I have to read your question again from the April low. Okay, so that's like here ish. 22 April. And then we held those leaps to 80. We didn't get to 80. So I don't know when this was. And then. So this looks like the scenario is we bought leaps here, held them through this. And then now we're looking to sell calls. Am I reading that correctly? Emory says 80 happened after I was okay, got it. I see. I got it. Let me see real quick. There's a there's a set in here for good old after hours. That's not it. Where was it? It's somewhere in here. Oh, no, no. Yeah, man. Is it in here? Here we go. Hmm. That's interesting. So I just asked it to show me the extended hours. And I don't see that move here. Kind of annoying, isn't it? I wonder what's up with that. Anyways, back to Paul's question. So Paul, help me understand quickly. If are you looking in the proverbial position, is your friend looking to sell a call now? Is that the question? And. Roingtony says reduce the time frame. Let's try. Do like this. I see. Do we have to go back? What time? Um, I'll fart",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 94,
      "start_timestamp": "01:44:16",
      "start_timestamp_seconds": 6256.838297872341,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6256"
    }
  },
  {
    "text": "help me understand quickly. If are you looking in the proverbial position, is your friend looking to sell a call now? Is that the question? And. Roingtony says reduce the time frame. Let's try. Do like this. I see. Do we have to go back? What time? Um, I'll fart down. Do I have to go? So it has to be like a daily time frame. So we have to look at, when was this May 14th? I just want to see it on here. May 14th. And then let's do. We don't need that. There we go. Like four hours maybe. Let there it goes. I see it now. Now, the Zah. Check that out. Great news. Great news for us. Thank you. My OCD is satiated. So thank you guys very much. Uh, Paul, you've, you've, Paul has left the chat. Paul, where'd you go? Oh, there's Paul. Welcome back, Paul. I thought you, I thought you dumped on me. So what, what are we trying to do here with this position? From my understanding, we have leaps from here that we just diamond handed through this until they're worth nothing. A quick admin note, not that this matters, but it's just so that the pedantic Reddit police don't get on you guys. When you're referring to leaps, it's leaps. So it's not like a, a leap or anything. Yeah, it's le ap a le ap s. And it stands, it's an acronym. It stands for something. Paul",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 94,
      "start_timestamp": "01:45:56",
      "start_timestamp_seconds": 6356.153191489362,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6356"
    }
  },
  {
    "text": "matters, but it's just so that the pedantic Reddit police don't get on you guys. When you're referring to leaps, it's leaps. So it's not like a, a leap or anything. Yeah, it's le ap a le ap s. And it stands, it's an acronym. It stands for something. Paul says no selling at that peak. What would the profit be? I see. Okay. Oh, and you're talking about selling a call. You would get murdered. Or do you mean buying a call? I have to go back up to Paul's questioning. And the fuck is it? Jamie leaps. I'm curious if you sold a call. I see what you mean. Okay. Man, that was a trick you want to get to. So here's what we're trying to do. You're saying in a hypothetical scenario, if you had gotten leaps at a on this day and you sold them, you top ticked them, you would have to do it during the normal market hours. So you wouldn't get to 80. We can see what the option would have been worth. I am now following you. Yeah, we could take a look at that. We got through it together. It's all right. So let's go back. One was the low. This was on the 16th of April. April 16th. And I'm going to structure the trade that I would. So I'm not going to ask you a bunch of insular questions about like how far out what delta's you would use?",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 94,
      "start_timestamp": "01:47:35",
      "start_timestamp_seconds": 6455.468085106384,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6455"
    }
  },
  {
    "text": "right. So let's go back. One was the low. This was on the 16th of April. April 16th. And I'm going to structure the trade that I would. So I'm not going to ask you a bunch of insular questions about like how far out what delta's you would use? Like I'm just going to set it up. How I would set it up. And I personally wouldn't use leaps in this case. I would I've been trading typically 90 DTE and in. So I'd probably go at most out to 18 October to split the difference with you. And then I'm going to target something around a 70 75 delta is what I want. These are a liquid. I don't like that. They're a dollar 10 wide. These are more liquid. I don't like that more. So these are a dollar 10. So that's about what you're going to get here is what it looks like. Those are a dollar 15. So yeah, this is this is what it is. And then. So let's say you get in for these at 340. Let's say that we're talking about a proverbial. Let's say that the trade allocation is going to get. I'm going to think on like a standard account size using like maybe like a hundred or a hundred or a hundred fifty thousand dollar account. Let's say that the total risk on the trade is maybe eight percent. So like a eight thousand dollar loss or something like",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 94,
      "start_timestamp": "01:49:14",
      "start_timestamp_seconds": 6554.782978723405,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6554"
    }
  },
  {
    "text": "get. I'm going to think on like a standard account size using like maybe like a hundred or a hundred or a hundred fifty thousand dollar account. Let's say that the total risk on the trade is maybe eight percent. So like a eight thousand dollar loss or something like that. So where do we think this thing can go to the downside? We have to get rid of this other one. So we have to pick a downside move to figure out like where the because it's like literally hitting lows. Go off further. I have to go off further still. This is crazy. Okay, so that's like lows lows, huh? That's like is low as this baby got. There it is. He's got to go back super far. So I would pick something like. At or below this. Oh, that. Let's see what that gets us. 853. So the way I look at something like this with such a tight stop. I might give it a little bit more room. Oh, no, it's not. Okay, yeah. So we're at 995. So we have some room to move here. This is good. This is much better. So let's say at 853. You lose 170. We're willing to lose up to like 8 grand. So we need to get like maybe 60. No, like 50 of these. Yeah, that's about right. 850, 8500. That's a little too much. So maybe take it down to like 45. 850. It takes us",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 94,
      "start_timestamp": "01:50:54",
      "start_timestamp_seconds": 6654.097872340426,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6654"
    }
  },
  {
    "text": "at 853. You lose 170. We're willing to lose up to like 8 grand. So we need to get like maybe 60. No, like 50 of these. Yeah, that's about right. 850, 8500. That's a little too much. So maybe take it down to like 45. 850. It takes us 76 hundred. That's pretty good. So yeah, so you would get these for 340. And then when was the peak of that? Was it May 14th? I said. Believe it's something like this. And then I will be right back again. I need to get a refill on salt or water. You guys know how it goes. All right. We are back in action. We are reloaded ready to rock and roll. Except we have a new salt or water. We went with coconut pineapple, which I feel like coconut pineapple is pretty good. It's still not my favorite. I like the watermelon one much more if I'm being honest, but it's still good. Got to mix it up. I really like those spin drips, but I can drink too many of them. So we have to swap it out. All right. So day swag is trying to figure out what Paul is asking. He's just trying to see what these options can be worth. If you get a big move in your favor. That's pretty much it. And it would be worth 220,400. That's the answer to your question. So in this case, and this is not necessarily at",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 94,
      "start_timestamp": "01:52:33",
      "start_timestamp_seconds": 6753.412765957448,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6753"
    }
  },
  {
    "text": "what Paul is asking. He's just trying to see what these options can be worth. If you get a big move in your favor. That's pretty much it. And it would be worth 220,400. That's the answer to your question. So in this case, and this is not necessarily at the peak, it looks like the peak already kind of happened. No, it's a, yeah, it's sort of been like right at the open. I don't even know if I can get that close to the open on this. Let's see. So yeah, in this case, you would have laid out let's do the math. It would be 340 times 45. So you would have laid out 15,300. And then you would have made 220,000. 220,410. Yeah. So that is, that's where you're at. Joey says it's a lot of unlikely. Yeah. I mean, the probability of people bottom-ticking and top-ticking it like that, it's so unbelievably low. Like a pock elliptically low is even how I would frame it. But I mean, to Paul's point, like it is cool to see what these could do, right? And to get to get a sense of how they might behave or something like that. So yeah, I like the idea here. All right, let's get back up. There was several other questions that I want to hit. And like I said, I'm not in a rush tonight. So I'm happy to run through as much as you guys want. Okay. Who",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 94,
      "start_timestamp": "01:54:12",
      "start_timestamp_seconds": 6852.727659574469,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6852"
    }
  },
  {
    "text": "something like that. So yeah, I like the idea here. All right, let's get back up. There was several other questions that I want to hit. And like I said, I'm not in a rush tonight. So I'm happy to run through as much as you guys want. Okay. Who cares says where did you get the data? I assume who cares that you're referring to the data for the trade log and the trade log data, the strategy data is my own from my own trades. And then the broader data that I use to analyze and back test stuff is from SIBO. I buy it from there. The next question I see here is from I Boy. And they're saying, what makes you enter a trade? Do you try to scalp based on short-term sentiment? Or do you build positions and companies that you believe in the long-term value? Not so much either of those, to be honest. My approach to trading is much less loyal, I would say. So what I mean by that is I have, again, this is why I built this thing because it is very useful for summarizing lots of stuff. So this is essentially what I do in options from my perspective is I trade directionally and I use options for leverage and I trade volatility. I trade both forms of structural alpha and I trade discretionary as well. So I would consider that more of a soft edge. So really what",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 94,
      "start_timestamp": "01:55:52",
      "start_timestamp_seconds": 6952.042553191489,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=6952"
    }
  },
  {
    "text": "is essentially what I do in options from my perspective is I trade directionally and I use options for leverage and I trade volatility. I trade both forms of structural alpha and I trade discretionary as well. So I would consider that more of a soft edge. So really what makes me enter a trade is generated from one of two places. Either when I'm looking at the portfolio, I will notice one of two things. The portfolio as a whole, it might need a specific kind of risk, meaning if I have a bunch of long deltas, I might need short deltas or if I have a bunch of short deltas, I might need long deltas. That kind of thing. That will then send me down a path in terms of what kind of trade I'm going to put on. Or I can identify an opportunity and then I can look to trade the opportunity. So really basing on both of those scenarios is how I end up placing a trade. But it's much less of I scalp or I trade X, Y or Z. I trade a lot of different things is the short answer. If you want to dive into any more specifics there, I boy, as you know, I am absolutely happy to dive more into detail. But that's the kind of the summary. Mark Khan says, if your options are shitting the bed and don't look good for the future, at what point do you",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 94,
      "start_timestamp": "01:57:31",
      "start_timestamp_seconds": 7051.357446808512,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7051"
    }
  },
  {
    "text": "to dive into any more specifics there, I boy, as you know, I am absolutely happy to dive more into detail. But that's the kind of the summary. Mark Khan says, if your options are shitting the bed and don't look good for the future, at what point do you cut your loss? You decide that before you enter the trade without a doubt. Again, that's why it's part of the trade checklist and it's why it's part of what I was showing you guys here. And this is part of what you will learn tomorrow in that video is all of this should be defined ahead of time. Like what one of the funny things about trading is that if you are a good trader, like a legitimately good trader, the actual act of trading is fucking easy. And I don't mean that in terms of hyperbole. Like it is easy because all of the work is done before you enter the trade. The trade for easy part. You just do all of the shit that you plan to do. So in this case, the easy answer to that specific question mark is you got it, you have to define that before you enter the trade. There's just no exception to that. If you're not defining it before you enter the trade, you have a massive problem that is going to rear its head sooner or later, where traders suffer from things like the disposition effect, where we don't",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 94,
      "start_timestamp": "01:59:10",
      "start_timestamp_seconds": 7150.672340425532,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7150"
    }
  },
  {
    "text": "define that before you enter the trade. There's just no exception to that. If you're not defining it before you enter the trade, you have a massive problem that is going to rear its head sooner or later, where traders suffer from things like the disposition effect, where we don't want to close losing trades because then it realizes a loss and that's a painful process. So is annoying as an answer of that that that is that is the day. Gravitaris says, how do you determine whether to take profit or roll to upgrade to lower strike price? That's easy. One, that's also generally part of my predetermined plan. But two, it depends on my my sentiment towards the position. So gravitarist for your question specifically, if you give me an example, I can work through it with you. And then we can work through, yeah, we can work through it together. And then just so you guys know, if you guys are dropping in new stuff to the chat, I am not seeing it because I'm way up at the top trying to catch up on these. Paul says, can you put alerts on an options value? Absolutely. You can put alerts on the options value. And you can also like place orders that are predicated on the options value, or you can create calculators essentially that do it for you, which is another really useful tool. So I have this here. I'll show it with you guys",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 94,
      "start_timestamp": "02:00:49",
      "start_timestamp_seconds": 7249.987234042553,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7249"
    }
  },
  {
    "text": "You can put alerts on the options value. And you can also like place orders that are predicated on the options value, or you can create calculators essentially that do it for you, which is another really useful tool. So I have this here. I'll show it with you guys this thing. So kind of from the same Excel book, you can do something like this. And you can do more, right? Like this was actually just specifically to show people the process of calculating what an option will be worth at specific stop points with a stock. But yeah, you can essentially see exactly what the option will be worth that if you want to rest orders or whatever. Charlie C2 says, been writing cash-secured puts and covered calls on GME, been making bank. Yeah, the problem is sooner or later, you're probably not going to like what happens. That's typically what happens with people that trade those. So yeah, I'm glad it's been working for you. That makes me very, very happy. But I would be very cautious with that strategy at the same. Kirby says, I think Mark was asking to you normally set trades at a standard stop loss, or do you have a max of 20 or something? Okay, Kirby, the answer to that is it's not it's not set standard across the board, but it is adjustable based on the strategy and what the portfolio needs. That's the way to think about that. All",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 94,
      "start_timestamp": "02:02:29",
      "start_timestamp_seconds": 7349.302127659575,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7349"
    }
  },
  {
    "text": "standard stop loss, or do you have a max of 20 or something? Okay, Kirby, the answer to that is it's not it's not set standard across the board, but it is adjustable based on the strategy and what the portfolio needs. That's the way to think about that. All right. Apollo says, do you apply just to individual trades or strategies campaigns as well? Could you clarify what we were talking about at that point? I don't remember. Ahmed says, do you use gamma to decide the regime of the market? Yeah, I don't really use it to decide necessarily the regime, but I absolutely pay attention what net gamma is. Because if you know the gamma exposure of the market, you can have a pretty good inference of what hedging behavior will have on the behavior of the product that you're trading specifically. So yeah, I definitely pay attention to net gamma. It's kind of not like a massively important component, but it is still something that is important to monitor, I think. Reese says, what would you consider a relatively safe play for picking options on GME that wrecks out that expires a few months? Trying to learn from my mistakes today. Well, I think the first thing is again, defining what you think you want to happen. And then from there, I would build something that makes sense based on your disposition. So for example, if I'm looking at GameStop and I want to be generally",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 94,
      "start_timestamp": "02:04:08",
      "start_timestamp_seconds": 7448.617021276596,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7448"
    }
  },
  {
    "text": "learn from my mistakes today. Well, I think the first thing is again, defining what you think you want to happen. And then from there, I would build something that makes sense based on your disposition. So for example, if I'm looking at GameStop and I want to be generally long GameStop, I don't know when it's going to explode because nobody does. I don't know if it's going to explode again, but it probably will. So I want exposure to it, but I don't know how far out to go. Well, you have a couple of things. One, the easiest solution in the scenario, honestly, is shares. And it saves you a lot of problems. Now, if you want to use options for the leverage or for whatever other reason, that's totally cool. And if doing that, I essentially would expect to manage the options as if it were stock, because again, I'm a trader. I'm not going to just hold this thing in general for most of the like for the base position. I caveat it, right? Because like I said, I have shares, but that's that's that's me being an emotional human being. That's not me being a practical trader. That's actually one of the cool parts about trading is sometimes you can do silly things like that. Not saying that holding shares is silly. But I'm saying what I'm doing with it is silly is I'm essentially just holding the shares literally just to participate with",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 94,
      "start_timestamp": "02:05:47",
      "start_timestamp_seconds": 7547.9319148936165,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7547"
    }
  },
  {
    "text": "a practical trader. That's actually one of the cool parts about trading is sometimes you can do silly things like that. Not saying that holding shares is silly. But I'm saying what I'm doing with it is silly is I'm essentially just holding the shares literally just to participate with you guys. I think I've given you guys this example already, but to reiterate it, I have shares of AMC that I bought years ago literally from a bet that I made with somebody on a YouTube livestream that I told them that I had shares and they're like, oh, when are you going to sell them? And I think I made a joke saying that like I would never sell them. So I literally I'm going to just have those shares of AMC in my account until I fucking die because I made a random bet with somebody on a YouTube live. So not everything is completely pragmatic. And I'm differentiating that, right? Because the way that I'm trading this to make money is one thing. The shares that I'm holding is another thing that's literally just like a participation component. Okay. So that whole thing aside is when I look at this, I would decide where I would want to get out if it breaks below. Like this is probably realistically where I would be looking. Like if there's some sort of dump below 18 to I don't think I would want to hold it below that if",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 94,
      "start_timestamp": "02:07:27",
      "start_timestamp_seconds": 7647.246808510638,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7647"
    }
  },
  {
    "text": "I look at this, I would decide where I would want to get out if it breaks below. Like this is probably realistically where I would be looking. Like if there's some sort of dump below 18 to I don't think I would want to hold it below that if I were to enter a trade. Now you can see that I already have a stop that's higher than that. And that's because I would reevaluate and adjust my position if it starts to fall below this level because things start to material change in terms of how it fits into the portfolio. So all of that sums up to how I think about the position itself. And I would say, okay, maybe I have an initial stop here at 2083. And then maybe I have a hard stop at 18 to something like that. So then if that's the position, I would then personally, depending on the timeframe, I wouldn't go out 300 days. And it's just because these are going to be not really liquid. And if you get a big move in your favor, which would be very cool, you're still going to take a massive haircut on the position just in terms of liquidity. So I wouldn't want to be that far out. I would probably want to be something like 90 days out no more than that. And it's literally for the sake of liquidity. So then I would find where I can find some",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 94,
      "start_timestamp": "02:09:06",
      "start_timestamp_seconds": 7746.561702127659,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7746"
    }
  },
  {
    "text": "on the position just in terms of liquidity. So I wouldn't want to be that far out. I would probably want to be something like 90 days out no more than that. And it's literally for the sake of liquidity. So then I would find where I can find some liquid options. I would expect the 20s. These are probably the most liquid ones. I know they don't see it, right? I know these are right now. But if the market was open, I would surmise that it would be these 20s. That would be tighter than the 15 spread here. So that's my guess, is that would go somewhere like that. And that's essentially how I would think about isolating where I would want to be. And then I would go through the sizing process, portfolio fit. Yeah, yeah, yeah, yeah, all that stuff. So that's that. All right, cool. I think I'm all caught up. Perfect. All right, I'm just getting caught up on now the most recent chats. Manscaped go. What a name. What a name. I love that. Manscaped goat says, can you explain the MOC and balance trade? Yeah, could you elucidate or I'm sorry, could you expand a little bit more on what specifically about that that you want to talk about? I'm happy to. I just need to know exactly what direction you're trying to go. Rory and Titi says, how can you be accurate that when the options price change dynamically? If",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 94,
      "start_timestamp": "02:10:45",
      "start_timestamp_seconds": 7845.876595744681,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7845"
    }
  },
  {
    "text": "could you expand a little bit more on what specifically about that that you want to talk about? I'm happy to. I just need to know exactly what direction you're trying to go. Rory and Titi says, how can you be accurate that when the options price change dynamically? If you're are you talking about I assume you're talking about this, the spreadsheet thing that I was making in terms of like telling me what the value of an option is going to be at a certain point. Is that correct? And if so, I can easily explain that. But I want to make sure I'm looking at the right thing. In the meantime while I'm waiting for rowing Titi or the man scape goat. Essentially he's asking about market on clothes and balancees. So it's kind of tricky, but a primary reason why you will see them is when people use market on closed orders. It's an order type. So if I go into on demand, the reason I'm going into on demand is so that I can pull up a trade and not flash like my entire account details, even though the one I'm using right now is my pass through account, it still has like stuff that I don't need out there. Well, this is kind of annoying. I thought maybe this would give us decent options. Oh, I forgot. This is the weird day. Of course, let's pick another day. Let's just come not that far.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 94,
      "start_timestamp": "02:12:25",
      "start_timestamp_seconds": 7945.191489361702,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=7945"
    }
  },
  {
    "text": "my pass through account, it still has like stuff that I don't need out there. Well, this is kind of annoying. I thought maybe this would give us decent options. Oh, I forgot. This is the weird day. Of course, let's pick another day. Let's just come not that far. We're going to the same. So I'm just waiting for this. There it is. So if we place an order, it doesn't matter which one. There's different times and forces you can choose and there's complex order types. So one of the order types you can choose is a market on close. So essentially, if you want to use the closing price for the day for your execution, that's what you would select. So those imbalances can happen with an influx of those. They can happen for other reasons as well. But I think I think the easiest way to think about it is because of just a flush of orders that don't have sufficient counterparts. So that's what market on close is and that's where the imbalances result from. Let me know if that if you have any follow-on for it. Let me see. Kirby says he's an options trader. He's like a play keeps his options open. Yeah, that's a good way to phrase it. That's kind of the idea. I think that's the idea of being a trader in general is to just try to find opportunities. That's the way to make money doing this. Emory says",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 94,
      "start_timestamp": "02:14:04",
      "start_timestamp_seconds": 8044.506382978723,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8044"
    }
  },
  {
    "text": "trader. He's like a play keeps his options open. Yeah, that's a good way to phrase it. That's kind of the idea. I think that's the idea of being a trader in general is to just try to find opportunities. That's the way to make money doing this. Emory says do you ever catch unicorns like these players that were buying one DTE on ribbon, AVGO crowd at the market close the day before their events? Sometimes it's seldom the case, but sometimes it's definitely not any sort of primary like profit mechanism that I try to pursue because it's not consistent to any significant degree. So yeah, in general probably less so, but I mean every once in a while I'll catch them. A lot of the reasons why I catch them is when they pop up on different scans or alerts. I actually that reminds me I need to build another alert too. There's another alert I need to update for like sequential stock gaps. Yeah. So sometimes like for something like crowd this one popped up on my radar simply because of this price behavior. So we had three consecutive gaps down that generally will pop up on a scan that I have. And then what I like to do is sort them by the move from the starts of the gaps to where it is now to look for severity. So it gives me an idea of like different things I can look for. This is",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 94,
      "start_timestamp": "02:15:43",
      "start_timestamp_seconds": 8143.821276595745,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8143"
    }
  },
  {
    "text": "on a scan that I have. And then what I like to do is sort them by the move from the starts of the gaps to where it is now to look for severity. So it gives me an idea of like different things I can look for. This is really interesting too though because I feel like this is kind of overdone to be honest. But this you can kind of pick up on something squirrely going on here pretty quickly I think. Gravitaris says GME 25 short put had a profit on Tuesday and wasn't sure if I should go for 20 call further out. When you say SP what does that mean to you by the way? Because that's it's really confusing to use that terminology. I guess I should correct it now for your own good. SP equals strike price. Yeah. Okay. So from like typical nomenclature that equal strike price. This equals stock price. Nope. Not that one. My bad. This one. Let me delete this other one. So I'm not confusing people. So K equals strike s equals stock price in normal parlance. Now you'll find some people my mentor is actually one of the people that um switch those he would use s for strike K for stock. But that like that's not normal normal use would be K as strike S as stock. So yeah. Anyways back to your question. You had the 25 strike had a profit and wasn't sure if",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 94,
      "start_timestamp": "02:17:23",
      "start_timestamp_seconds": 8243.136170212767,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8243"
    }
  },
  {
    "text": "the people that um switch those he would use s for strike K for stock. But that like that's not normal normal use would be K as strike S as stock. So yeah. Anyways back to your question. You had the 25 strike had a profit and wasn't sure if you should go for 20 calls out in further August. Are you comparing the two the two positions? I'm trying to understand the like what you're trying to solve for there. Are you talking about if you should have closed the 25s to then move into the 20s? Adding context to the role upgrade question. Oh I see. Yeah. So what I wouldn't even bother with that to be honest like if you have a stock if you have a position that did what you want and it's defined follow the plan for that position and then if you like it's still and you want to put on another position put another position on. But I wouldn't necessarily try to roll things on yeah. What unnecessarily it just kind of adds a layer of complexity that it probably doesn't have to be there. Day swag says I feel like the answer to my question is to keep them out of one to one ratio to ensure that I'm not exposing myself to a ceiling. But I'm still new to understanding your experience with them. Day swag are you referring to the covered calls? Is that correct? And if so I'll",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 94,
      "start_timestamp": "02:19:02",
      "start_timestamp_seconds": 8342.451063829787,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8342"
    }
  },
  {
    "text": "answer to my question is to keep them out of one to one ratio to ensure that I'm not exposing myself to a ceiling. But I'm still new to understanding your experience with them. Day swag are you referring to the covered calls? Is that correct? And if so I'll show you the exact problem. Let me know. Day swag if you're referring to covered calls there and then yeah obviously I can answer for you. Man scaped goat says what it makes sense to play a strangle into earnings best way to play options into earnings or is playing Pied the best way. Pied is different. So Pied is post earnings. Now leading into earnings there's a force that typically yields expanding volatility into the earnings release. So you can see that right here. Here's the earnings day. The yellow lines here is volatility. So this shows you like about as clear as day too. This is a great example because the stock was going up normally a stocks go up volatility goes down. But it didn't as the stock went up volatility was going up because starting about two weeks out you will see volatility expanding into the earnings release. So that takes you to about here and you can see it especially on the 30 day vol is when it started to slowly climb up and out. So in this case if I want to trade the volatility expansion and I don't have a directional disposition for",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 94,
      "start_timestamp": "02:20:41",
      "start_timestamp_seconds": 8441.765957446809,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8441"
    }
  },
  {
    "text": "earnings release. So that takes you to about here and you can see it especially on the 30 day vol is when it started to slowly climb up and out. So in this case if I want to trade the volatility expansion and I don't have a directional disposition for something like that I would use even ssh. Did I say without a directional disposition if I said without a directional disposition I would use long straddles. If I have a directional disposition I would use long options of some sort long single options. I don't use strangles as much for the build up. I typically use straddles and I try to gamma scalpel around them. So and then for a pd for those that don't know that stands for post earnings announcement drift and that's a really really well known market force by the way. It's highly defined and it's highly observable. So you can play the post earnings announcement drift either to the upside or to the downside but it requires the stock to make specific moves after the earnings. It has to have a significant enough of an earnings beat and then it needs to have a specific size gap that it makes. Let me grab the study for you guys right now. This. So this is a fantastic, fantastic study for you guys to check out. And there's this one that looks at the pre earnings announcement drift. There's a bunch of different studies. These are",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 94,
      "start_timestamp": "02:22:21",
      "start_timestamp_seconds": 8541.08085106383,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8541"
    }
  },
  {
    "text": "specific size gap that it makes. Let me grab the study for you guys right now. This. So this is a fantastic, fantastic study for you guys to check out. And there's this one that looks at the pre earnings announcement drift. There's a bunch of different studies. These are two of them that I think are kind of topical here. So this one. It shows this is kind of the part to highlight into. There's professional investors are looking at pd. Academic evidence shows strategy produces abnormal return of 2.6 to 9.37. So it's kind of talking about the severity of it in what it looks like. But there's very specific criteria that has to be met in order for post earnings announcement drift to take place. I don't know if they go into that into the conclusion or let me see real quick. No, no. Here we go. I'm just trying to see if in here it quickly highlights what needs to happen. It doesn't. So anyways, it's in here though, where it will show you specifically what criteria have to be met. So it's typically like at least a 10 gap and then a certain size beat on EPS. Something like that. Let me see. Lee says, what's up Eric? What brokers do you use pros and cons any favorites? Yeah, I use Schwab. I use think or swim primarily. So that's the platform. And the broker is Schwab. I like them so far. I started with",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 94,
      "start_timestamp": "02:24:00",
      "start_timestamp_seconds": 8640.39574468085,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8640"
    }
  },
  {
    "text": "on EPS. Something like that. Let me see. Lee says, what's up Eric? What brokers do you use pros and cons any favorites? Yeah, I use Schwab. I use think or swim primarily. So that's the platform. And the broker is Schwab. I like them so far. I started with TD Ameritrade and I started with them out of pure luck and then I've just stayed with them because I like them. I've always been able to negotiate my rates with them. I have fair rates that are definitely competitive for somebody that charges rates. I like the support that they provide the tools so on and so forth. So yeah, I like them. They swag says I was referring to risk management to the coverage strangle and was wondering if keeping a one to one ratio would help from that previous thing you said about you won't like when that happens. So maybe when something like when someone else is talking about covered call, I get we need racios to survive an issue of cap ceiling. Yeah, exactly. So exactly. I avoid the one to one ratios on anything that I want upside potential on, which is most trades. That's the trade off for placing the position like when you're holding shares of something like GameStop, there's you have downside risk. That's the penalty. That's the potential downside of holding the position. So the reward for the downside that you're exposed to is upward price movement. If you cap",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 94,
      "start_timestamp": "02:25:39",
      "start_timestamp_seconds": 8739.710638297873,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8739"
    }
  },
  {
    "text": "That's the trade off for placing the position like when you're holding shares of something like GameStop, there's you have downside risk. That's the penalty. That's the potential downside of holding the position. So the reward for the downside that you're exposed to is upward price movement. If you cap that, you've now taken away the reward for the risk that you're taking. So in this case, I would not want a one to one ratio. In this case for something like this, let's say I would buy you know, 500 shares of GameStop, whatever it is. And then I might sell two maybe three calls against it probably closer to two for something like GameStop specifically, which is primarily a pretty aggressive upside style trade. So yeah, that's the general thought there. Emoryam says, how do we feel about net options pricing effect as a relatively new metric? How do you incorporate it? Feels like feels interesting as options markets are increasingly driving the underlying performance. Yeah, that's actually really interesting because I only agree with you to a degree. There's a lot of really, really great studies on like the tail lagging the dog. I would argue that options markets still have an impact, but I don't, I haven't seen enough research to lead me to believe yet that it's driving the stock price. I'm unsure about that. Yeah. So at least that's like that's the general thought. Let me see if I can find a couple studies",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 94,
      "start_timestamp": "02:27:19",
      "start_timestamp_seconds": 8839.025531914895,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8839"
    }
  },
  {
    "text": "options markets still have an impact, but I don't, I haven't seen enough research to lead me to believe yet that it's driving the stock price. I'm unsure about that. Yeah. So at least that's like that's the general thought. Let me see if I can find a couple studies for you. That's not it. This one I think is it. Yeah, this one. So this is a study that I think is worth taking a look at. And we can take a peek at it real quick before it pop off. Not pop off in terms of like, you know, flipping out on somebody. We're not popping off like that, but we're going to pop off the stream in a minute. And then if you're unaware, I am doing a live stream tomorrow with Newton. So you should absolutely come hang out for that. But where's the actual paper? I have to find the paper. This isn't what I wanted. This is just showing us the some of the materials. Where's the paper? That's kind of annoying. I'm seeing if I can find the base paper for you. Thank you. This is another good one. It's slightly different. It's more about price informativeness. But I'm Ah, this one. That's a good one. And then I think this is the actual paper for that other one we were looking at. I'm saying this is it. There we go. So this is the full version of this paper. Is this guy?",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 94,
      "start_timestamp": "02:28:58",
      "start_timestamp_seconds": 8938.340425531916,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=8938"
    }
  },
  {
    "text": "more about price informativeness. But I'm Ah, this one. That's a good one. And then I think this is the actual paper for that other one we were looking at. I'm saying this is it. There we go. So this is the full version of this paper. Is this guy? So let's see. This paper tests the prediction and finds statistically and economically significant negative relationship between stock return volatility and net purchased option prices of investors who are likely to head. Hence we provide the first evidence for substantial and pervasive influence of option trading on stock prices. So these guys find specifically with respect to hedging the positions. So I think that there is something to be said there. But again, I think you have to ask the question of severity, which I'm not convinced that there's massive severity yet. All right, you guys. I am wrapped up for today. Thanks for hanging out. Really, really fun conversation. I love these. I am going to keep these up probably for a few more weeks and then just kind of transfer the Friday sessions just into a standard beginner session as compared to something that has like a set topic each time of some sort. Like the topics will become more random. Right now I'm keeping the topic still in a general order that I think makes sense for people that are learning options. So that's the goal. And we have the other thing I wanted to share with",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 94,
      "start_timestamp": "02:30:37",
      "start_timestamp_seconds": 9037.655319148937,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=9037"
    }
  },
  {
    "text": "topic each time of some sort. Like the topics will become more random. Right now I'm keeping the topic still in a general order that I think makes sense for people that are learning options. So that's the goal. And we have the other thing I wanted to share with you guys really fast before I pop off is what is this this one? I've updated this. So I'm still building this out as you can tell. This was the original version of the syllabus. This is kind of designed to be a list of videos that I think you should read or read. You should watch been on a stream for too long if you're talking about reading videos. But that I think you should watch in order. And then this is a more comprehensive list of sub topics that I believe belong into a broader list of more topics. So this list is much, much longer, but this is kind of designed to be a more holistic snapshot of essentially not knowing anything about investing to the concept of creating a sustainable practice and spreading into other asset classes. This spans essentially all of that. So if you didn't know updated version of that there. Vino says do we have access? Yes, this is free for everybody. So this isn't behind the Patreon or anything. This is for everybody. It's in I don't know if it's in most of the video descriptions. Maybe it should be. I don't",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 94,
      "start_timestamp": "02:32:16",
      "start_timestamp_seconds": 9136.970212765958,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=9136"
    }
  },
  {
    "text": "didn't know updated version of that there. Vino says do we have access? Yes, this is free for everybody. So this isn't behind the Patreon or anything. This is for everybody. It's in I don't know if it's in most of the video descriptions. Maybe it should be. I don't know if I've done that yet, but there's the link to it. Everybody's welcome to check it out, download it, whatever you want, but that's available for everybody. All right, you all being outlier. I'll see you this weekend.",
    "metadata": {
      "video_id": "v3Eiz9bpRK4",
      "title": "How to Size Options Trades & Build a Trade Checklist | Options Trading for Beginners Pt7",
      "url": "https://www.youtube.com/watch?v=v3Eiz9bpRK4",
      "upload_date": "",
      "duration": 7485.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 94,
      "start_timestamp": "02:33:56",
      "start_timestamp_seconds": 9236.28510638298,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=v3Eiz9bpRK4&t=9236"
    }
  }
]