[
  {
    "text": "Stop over emphasizing probability of profit. It is an important part of a more important equation that most traders don't pay attention to. And it's unfortunate because you can have a very high probability of profit and still a losing strategy, meaning as you deploy that strategy, you're not making money, even you have a 90 win rate like a lot of people look for. It is a way to see, shade our egos. We like high probabilities of profit. We don't like being wrong. Who doesn't like a good old winning trade? The problem is there's more to this story than just that one piece of the broader equation that is expectancy or expected returns, which I'm going to walk you through now. I want to explain what they are, how you can use them as a trader, how to create an excel tracker for it, and then how to interpolate the results so that you can optimize a strategy and make more money out there. What's up, everybody? Eric here. Welcome back to all the outliers. We're going to get a look at the expectancy. Like I said, pop is popular. Look at me go over here with my jokes. It's part of the puzzle and you can see this parabolic rise in probability of profit. It's actually comical. But the issue with it is it only gives us a small piece of the broader, more important puzzle, which is expectancy. Expectancy includes probably profit. It's one of",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 13,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=0"
    }
  },
  {
    "text": "my jokes. It's part of the puzzle and you can see this parabolic rise in probability of profit. It's actually comical. But the issue with it is it only gives us a small piece of the broader, more important puzzle, which is expectancy. Expectancy includes probably profit. It's one of the variables we need to input into the formula. But let's talk very quickly about expectancy. This is from statistics. It doesn't just apply to trading and applies to anything really. And we just modify it slightly for trading and it quantifies performance. It's a way for us to codify the output of a system and see how that system will continue to perform into the future. So that's where we get these two different views, historic and implied. We can see how a system performed or we can look forward and see how a system will perform going forward. And both of those are really important pieces to this. So what is the fabled equation? How crazy is it? As you can tell, it's unbelievably easy, very simple. We're going to take our win rate as a percentage times the average win. We're going to add the loss rate times the average loss. That's it. There it is. There's nothing to it. But for whatever reason, people aren't taking this step. They're looking at probability of profit. They're thinking that it's good enough and they're forgetting the rest of this equation. And let me show you why this is",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 13,
      "start_timestamp": "00:01:01",
      "start_timestamp_seconds": 61.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=61"
    }
  },
  {
    "text": "times the average loss. That's it. There it is. There's nothing to it. But for whatever reason, people aren't taking this step. They're looking at probability of profit. They're thinking that it's good enough and they're forgetting the rest of this equation. And let me show you why this is so important. Here I have a 100 trade sample system and we have 85 winning trades, 15 losing trades. So an 85 win rate. Our average win is 30. Our average loss is 170. And let's take a look at the expectancy here. What is that number to you? It's to me, it's zero. It means that you've won 85 of the time. But because of the rest of the variables in this equation, you make nothing. Actually, you would lose money once you add in commissions and whatnot. So this is my point. You can have a really strong win rate. But if you do not have a grasp on expected profit, you could literally just be losing money. Now where do we get this information? Where do we get our winning trades, our losing trades? You get it from your trading log that you have, right? That's tracking the performance of what you have written down in your trading plan, which you surely have, right? You get my point here. Without those two pieces, a trading plan and a trading log, one, without a trading plan, you're not even taking responsibility for what happens. You're just slinging trades",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 13,
      "start_timestamp": "00:02:13",
      "start_timestamp_seconds": 133.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=133"
    }
  },
  {
    "text": "the performance of what you have written down in your trading plan, which you surely have, right? You get my point here. Without those two pieces, a trading plan and a trading log, one, without a trading plan, you're not even taking responsibility for what happens. You're just slinging trades and hoping something works out. The bigger problem with that is what are you going to optimize? That's the next part of this video is I'm going to walk you through how to build this very quickly and then teach you how to optimize it. But if you're not going to, if you don't have an existing system to optimize, there's nothing to optimize. So the very first thing is down in the video description below, I'm going to throw a link to a video on trading plans and trading logs that will walk you through how to create them. The reason why it's so important is because as I talk about adjusting and optimizing these strategies, we have to understand the impact that it will have. So for example, let's say we change this system just a little bit and our average win goes from 30 to 35. What just happened here? Well, we now have a positively expectant strategy, but is it that simple? It might be that simple. It might not be. And what I mean by that is typically when we have an average win or an average loss and we start playing with those numbers,",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 13,
      "start_timestamp": "00:03:23",
      "start_timestamp_seconds": 203.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=203"
    }
  },
  {
    "text": "just happened here? Well, we now have a positively expectant strategy, but is it that simple? It might be that simple. It might not be. And what I mean by that is typically when we have an average win or an average loss and we start playing with those numbers, typically these numbers will change the number of wins and the number of losses. So it's important for us to be able to look at our trading plan and our trading log and say, okay, if instead of taking these down at 30 profits, I let them run to 35 profits. Maybe you just haven't thought to do that before and you were just being super wasteful and that's an easy win and none of this changes. That would be great. What's more likely to be the case as you have an optimized strategy and we're clawing our way to optimize just a little bit further is as we let this win rate run a little bit, then we're going to start to see maybe some more losing traits. And that's important for us to calculate because then we need to understand the trade off. If we start raising our win rate by 5 and we only add two more losing trades, are we profitable? This calculator will show you that. So there's a few broad concepts I want to share right now. I run my expected expected return by strategy. This is how I've been so successful this year",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 13,
      "start_timestamp": "00:04:23",
      "start_timestamp_seconds": 263.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=263"
    }
  },
  {
    "text": "win rate by 5 and we only add two more losing trades, are we profitable? This calculator will show you that. So there's a few broad concepts I want to share right now. I run my expected expected return by strategy. This is how I've been so successful this year in 2022 when the markets down 18 to 20 most of the year, I'm walking out at a tidy profit and it's because of this because I was looking at systems that worked in applying those and the systems that weren't working, I wasn't using them anymore. It allows me to rotate into what's working for the individual market environments. So let's talk really quickly how to build this and then I will walk you through how to optimize it. So winning trades, losing trades again, this should be pulled directly from your trading log which hopefully you sincerely do have if not, they're easy enough to build, but this is where we're getting this very first figure, your win rate and your loss rate. We're going to take winning trades, losing trades, that gives us our total trades. Then to figure out your win probability, you're just going to take your winning trades divided by your total trades. And then for your losing trade probability, you're going to take your losing trades, the number divide that by your total trades. That's how you get these percentages. If you wanted, you could just take 100 subtracted by this same, same,",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 13,
      "start_timestamp": "00:05:32",
      "start_timestamp_seconds": 332.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=332"
    }
  },
  {
    "text": "take your winning trades divided by your total trades. And then for your losing trade probability, you're going to take your losing trades, the number divide that by your total trades. That's how you get these percentages. If you wanted, you could just take 100 subtracted by this same, same, same, but the point being that's how you get those two figures. Then the average win and average loss. Again, this is when having a trade log becomes super handy. I have it auto calculate in Excel for me, but if you don't, you go through these 100 trades. You put them in Excel or whatever tool you want to use or if you want to do it by hand, which I don't recommend because it's very error prone. But then you figure out of the winning trades, what was the average win size of the losing trades? What is the average loss? Once you have that, you can make this right here, expectancy done. That's all there is to it. Now the expectancy ratio just turns this into division as compared to addition. That's it. It just gives you another way to look at the same information and then the our multiple, this is just telling us what is our profit divided by risk? What is our risk multiple? That's where our multiple is. And you could view that a lot of different ways. I'm not going to go into that into this video. It's less important. Really what",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 13,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=402"
    }
  },
  {
    "text": "the our multiple, this is just telling us what is our profit divided by risk? What is our risk multiple? That's where our multiple is. And you could view that a lot of different ways. I'm not going to go into that into this video. It's less important. Really what I want to highlight here is expectancy, not even expected ratio. Don't worry about that. Just worry about expectancy right now. What we want is this number to be as high as possible. We want expectancy to go up, up, up. So in this case, by letting our wins run a little bit more, our expectancy went up by 4 essentially. So that means that as you run this system, this is what you can expect to make. Now a couple things per trade by the way. Now a couple things to think about as we're creating these kind of structures. The historic looking data is one thing. The implied looking data is slightly different. You can imply how systems will work going forward. You can just increase the sample sizes based on the percentages of that specific strategy that you're running. You can say, okay, on average, I trade this this many times. And if I dump more trades into this, so instead of using 85 and 15, you already know your win and loss probabilities, you just throw in a bigger number and you're saying, if I continue doing the same exact thing, this is what I'll get.",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 13,
      "start_timestamp": "00:07:42",
      "start_timestamp_seconds": 462.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=462"
    }
  },
  {
    "text": "this this many times. And if I dump more trades into this, so instead of using 85 and 15, you already know your win and loss probabilities, you just throw in a bigger number and you're saying, if I continue doing the same exact thing, this is what I'll get. So it's a really useful way to forecast things out, but you have to remain sensitive to changes because it's a forecast. The underlying circumstances will vary a little bit or a lot of bit and that can really impact this. So it's important to continually update these as you go along. So you have the best picture available. Last thing, let's talk about optimizing this. As you look at this sort of layout and we're using expectancy as our primary lens, we have a couple levers we can pull. We can either total trades or overall, I don't necessarily worry about that too much. The first lever we can pull is how many winning and losing trades we have. There's different ways we can pull that lever, but that directly impacts your win probability and your loss probability. The other lever you can pull is your average win size and your average loss size. So let's talk about all these very quickly. If you want to increase your win probability, who doesn't, that's when we go through our trading plane. We figure out the best time to deploy specific strategy and we deploy that strategy in the best environment",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 13,
      "start_timestamp": "00:08:45",
      "start_timestamp_seconds": 525.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=525"
    }
  },
  {
    "text": "and your average loss size. So let's talk about all these very quickly. If you want to increase your win probability, who doesn't, that's when we go through our trading plane. We figure out the best time to deploy specific strategy and we deploy that strategy in the best environment we can find. Maybe this is timing your trades better if you're a day trader. Maybe this is being more selective when you are buying or selling strategies based on implied volatility percentile. There's a lot that goes into increasing your win rate, but that is the first and it will be strategy dependent. The first lever we can pull try to win more trades. Next, we go into the risk management side of the equation, meaning how are we trading profits and losses? As you saw in this example, I simply just said, okay, instead of taking profits at an average of 30, we'll take them at 35. See how that goes. Same thing for average losses. We could try to decrease our average loss. There's a few ways to do this that's actually picking low hanging fruit. One of the easiest things you could do is look at your losses and this is an average. There will be an average of this average so that you can figure out, okay, where are the outliers? Where am I doing really well managing losses? What are the losses that I'm just letting run real big? Maybe you see the scenarios",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 13,
      "start_timestamp": "00:09:45",
      "start_timestamp_seconds": 585.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=585"
    }
  },
  {
    "text": "your losses and this is an average. There will be an average of this average so that you can figure out, okay, where are the outliers? Where am I doing really well managing losses? What are the losses that I'm just letting run real big? Maybe you see the scenarios where you had your two biggest losses and figure out what happened there and just see what happens to this average loss. If you get rid of the biggest loss that you took on that strategy, if you can codify that out, that's an easy win. And again, it's the same thing for the average win. If you're just too trigger happy and you're taking trades down too fast, maybe you're just being too trigger happy and you could legitimately squeeze out another 5 of profit by just waiting. That could be the case. Some people are way too trigger happy, which is a very common investor slash trader trade. So it could be that simple or it could be your average wins are falling down in a specific environment depending on whatever you're trading. And you just stop trading in that environment and you pivot to something else. This is how we can make data driven decisions about your strategy and to optimize it. But notice how I keep referring back to this plan because if you say, let's say for example, there were two really big losing trades that skewed this average loss result pretty heavily. You can",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 13,
      "start_timestamp": "00:10:42",
      "start_timestamp_seconds": 642.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=642"
    }
  },
  {
    "text": "is how we can make data driven decisions about your strategy and to optimize it. But notice how I keep referring back to this plan because if you say, let's say for example, there were two really big losing trades that skewed this average loss result pretty heavily. You can modify that. You could say, okay, I took this average loss because I held it through earnings going forward. I'm not going to hold this trade through earnings and see how it goes. That will likely have a pretty profound impact on the overall profitability of the system. Name the game here. Ladies and gentlemen, is expectancy. Forget probability of profit as a standalone metric. It's important. It's part of this equation. This is probability of profit. Wouldn't rate. That's an important part of the equation. However, it is not the bell of the ball, which I would argue is expectancy or expected return. This is how we can see how strategies actually performed in different markets and then project that forward and make better trading decisions. If you made it to the end, don't forget to like the video. Subscribe to the channel. See you all later, be an outlier.",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 13,
      "start_timestamp": "00:11:44",
      "start_timestamp_seconds": 704.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=704"
    }
  },
  {
    "text": "outlier.",
    "metadata": {
      "video_id": "VDVb18yCyx8",
      "title": "Probability of Profit and Expected Return Explained",
      "url": "https://www.youtube.com/watch?v=VDVb18yCyx8",
      "upload_date": "",
      "duration": 773.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 13,
      "start_timestamp": "00:12:50",
      "start_timestamp_seconds": 770.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=VDVb18yCyx8&t=770"
    }
  }
]