[
  {
    "text": "Well, well, well, what's up everybody? It looks like we have a light crowd to start. So I'll give it a couple moments for folks to make their way in. And then we will, we'll kick things off. I'm also going to make sure that we are all posted out across. Social media, make sure we have our Twitter post up. And then I'll grab the chat in just a second. Make sure that we have the ability to communicate. I want to make sure I can say hi to everybody. Make sure it's cool. Cool. All right. So it looks like we're good. Let me grab the chat. There we go. We got Elon's songs, aka Liz. What's up? Good to see you Liz. Pleasure is always have opportunity to catch up. We got Brennan gate coming in. Hat and what up Brennan gate. Good to see you as well. Cool. We are getting our peeps in the house, our ducks in a row and we're getting ready to kick this thing off. I'm I in. That's a fun name. What's going on? I'm I in. I'm not sure if I recognize your name. So if you're new, welcome, if you're not new, sorry. I don't always recognize the names because there's there's not that many of them. Let's let's not pretend that like I'm some popular YouTuber. I'm not. But we also should not pretend that I have a good memory because I also don't. Brennan gate says",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "if you're not new, sorry. I don't always recognize the names because there's there's not that many of them. Let's let's not pretend that like I'm some popular YouTuber. I'm not. But we also should not pretend that I have a good memory because I also don't. Brennan gate says super low volume on GME today. Yeah. I kind of hit that a little bit in the GME update video. We'll dive really far into GME come next week or next week. I'm in it. Tomorrow, next week, tomorrow, we're going to do like a GME specific live stream to like really, really get into the weeds. I want to go through the recent bad bath and beyond case, which is kind of related to GME through Cohen and whatnot. We also got Mr Simpson or Mrs Simpson, fart Simpson to be specific. What up? Good to see you. All right. So today's session is designed to be a brown building in options trading portfolio. So I think this is the 10th session in this total series. And we've covered a lot like I was looking back at the topics that we've had listed so far. There's been a ton of stuff that we've hit, which is awesome. It's absolutely awesome. It's exactly what I wanted to be able to do. Now the game plan is for today. I want to go through this overview. And again, this is still interactive. Let the format here with there being a blackboard.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "of stuff that we've hit, which is awesome. It's absolutely awesome. It's exactly what I wanted to be able to do. Now the game plan is for today. I want to go through this overview. And again, this is still interactive. Let the format here with there being a blackboard. Think that this is like some sort of presentation style session. It's not. It's just to capture some things that I think will be useful for us to discuss. And then the game plan is once we get through enough of this, what we'll do is actually pop over here, going to on demand. And we will build a, we'll actually build a portfolio. Shrejish says, where's the manager of the outfit? Haven't seen that's a great point. One second, I'm going to get that bump. He just got all laid up here. Let's grab that and we'll get, we'll get the start of the show. Here he is. Ready to go. He's a little, he's a little disgruntled because I did just take him out of his bed. But as you can tell, he's ready to start talking about some options. He's eager even. How do you feel about portfolios? Do you have anything to say? Nothing. So really what he's trying to communicate there with the portfolio thing where there was kind of like a lack of a statement, that was actually very, very tactical, right? Because he was saying that the portfolio is very individual to the",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "portfolios? Do you have anything to say? Nothing. So really what he's trying to communicate there with the portfolio thing where there was kind of like a lack of a statement, that was actually very, very tactical, right? Because he was saying that the portfolio is very individual to the trader. So it is super important for the individual to build their own portfolio. That's what he's trying to say. So he does speak kind of in riddles. You have to pay really close attention. See like right now, he's saying you have to like face away from your problems. Whenever you see some sort of issue, you can choose to confront them dead on or you could essentially just rest your head on the shoulder because you've built a robust portfolio that can handle the problems for you. So he's really just dropping dimes if you guys aren't picking up all this stuff. That's what he's doing. I am going to return him to his bed so that he can get back to his supervisory duties. He literally just like laser straight to the bed. That's hilarious. So yes, Shrej, don't you worry about it. The boss is still in the house. He's still monitoring everything that's going on. He keeps it real. All right. So the rules for the road today is I'm going to run through some of the questions that we got in the beginning because some of these provide a bit of context. And then",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "in the house. He's still monitoring everything that's going on. He keeps it real. All right. So the rules for the road today is I'm going to run through some of the questions that we got in the beginning because some of these provide a bit of context. And then for this one specifically with Ian's question, we'll actually go through some examples together. So we'll hit that a little bit later in the session. Now as per always, the name of the game here is interact. So as soon as you have a question, let me know if there's something that we really want to go down a separate rabbit hole. I'll kind of make a note of that so that we can revisit it. But I want to make sure that we have a open conversation so we can really hit the stuff that you guys want to cover. So let's get into it. Shrejinger says, how does your only fans' income supplement your covered calls? Unfortunately, I get no income from only fans. I think that they actually are charging me to be on the platform right now. It's this weird thing, but they were talking about how ugly I am in that there's like an ugly tax, which is super frustrating because I see these other people on only fans that are crushing it literally making more in a year than I have in like a decade long period. So it's very soul, soul dismantling. But",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "how ugly I am in that there's like an ugly tax, which is super frustrating because I see these other people on only fans that are crushing it literally making more in a year than I have in like a decade long period. So it's very soul, soul dismantling. But yeah, so the only fans has been really tough out there. As I've kind of mentioned to you, I realize why they name it that it's because I am my only fan. So unfortunately, there's no dice. Brennan Gates says, when and why do you start trading? I started trading 2007 and I started trading because I had a teacher that introduced me to the idea of investing because he knew that I grew up poor and I wanted to figure out how to make a bunch of money. That was the idea. So I started trading in 2007 while I was in high school still. And I graduated high school, I think in 2009. And I started with kind of just buy and hold in the beginning and I did that for like three months, a little less than that. And then I started trading. I found options because I wanted to try to accelerate the timeframe because I was super impatient. And to be honest, I'm glad, I'm really glad I did because I don't know a lot of high school kids that are getting super deep into options. But yeah, that's essentially where it started for me.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "I wanted to try to accelerate the timeframe because I was super impatient. And to be honest, I'm glad, I'm really glad I did because I don't know a lot of high school kids that are getting super deep into options. But yeah, that's essentially where it started for me. And the main thing I would say at least over that path is that it's been a very generative process. But in the beginning, it's just so easy to make so many mistakes. And it's because there's no guardrails whatsoever. It's like anything else you do, there's safety mechanisms in place to prevent you from making really bad decisions that just not that just does not exist in the markets. For any of it says, imagine if they taught stock and option trading in high school, got to keep the poor poor. I don't think it's got to keep the poor poor. I don't necessarily go that route. But I do think that the vast majority of people trading is not for them. Like and again, that statistically bears out. So I think teaching like a financial health class would be so smart. I think that's drastically missing super basic stuff. Like talking about good debt versus bad debt, what a mortgage is. Like that kind of stuff in a class would be absolutely massive. And maybe they are doing that some places. They definitely did not do that where I went to high schools, kind of a rough place.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "stuff. Like talking about good debt versus bad debt, what a mortgage is. Like that kind of stuff in a class would be absolutely massive. And maybe they are doing that some places. They definitely did not do that where I went to high schools, kind of a rough place. I actually got stabbed in my hand in high school. So it wasn't like a super, yeah, I wouldn't call it a super enlightened place. Beyond that though, I think trading is one of those things that it's a very specific vocation that some people will connect really well with it. And then other people will not have a good time with it. And I think it's because trading coalesces two very different things. It requires the practical application and understanding of markets. So something that can be learned. And then it requires just nothing short of self mastery of like a human being. And that's really difficult to arrive at because everybody is very uniform or a non uniform. Sorry. And very individual, which is beautiful. But when it comes to something like trading, you can't, you really can't build something that applies to everybody, which is exactly what we're going to learn today as we go through the portfolio. And notice that even down to like risk tolerances and down to preferences for products, all of that is so, so individual to the person that it would be very difficult. So yeah. Bernie gets says agree, but trading",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "we're going to learn today as we go through the portfolio. And notice that even down to like risk tolerances and down to preferences for products, all of that is so, so individual to the person that it would be very difficult. So yeah. Bernie gets says agree, but trading would be more for people if they know, if they knew how to and didn't consistently lose money buying a lot of tickets on options. Yeah. And the fact of the matter is is like for most people that are first starting out, they can do themselves a giant favor by not trying to trade options right out of the gate and paper trading them. That's always the most boring, ugly answer that nobody ever likes hearing me say, but it is my honest opinion. I don't think that there's a better starting place than paper trading with options because here's the deal. They're not going to learn options even remotely well enough within a year to trade them successfully. It's just not going to happen. It's not going to happen. There could be really lucky streaks, but then the probability of you maintaining those streaks is essentially no. So I'm not saying don't trade for an entire year. You can, but the problem is is most people that start trading within that year, they're going to be miss sizing things. They're not going to see the risk that they have out. They're just going to make a ton of",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "I'm not saying don't trade for an entire year. You can, but the problem is is most people that start trading within that year, they're going to be miss sizing things. They're not going to see the risk that they have out. They're just going to make a ton of really dumb mistakes that can be countered otherwise. And pretty much all of the arguments I hear against paper trading are freaking terrible. It's so stupid when I hear people say stuff like Brennan gate says, I agree. And also this is bacon for Thor. I will, I will definitely, he doesn't do bacon, but we do like beef liver and salmon, like freeze dried salmon. So I'll hook them up with a piece tonight because you hooked them up. So I'll let them know that it came from our boy Brennan gate. Thank you very much. But I think the process of paper trading is just second to none. And I think having a thought behind the way that you do what you do before you start doing it is important. And essentially none of us do that when we first start trading options. So I mean, that's just how she goes. What I'm going to do right now is link into the chat of video about portfolio. Oh, this is coming out. That sucks. Maybe I'll make this one come out this weekend. Yeah, let me reconfigure this. So I actually have a video portfolio management for option",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "how she goes. What I'm going to do right now is link into the chat of video about portfolio. Oh, this is coming out. That sucks. Maybe I'll make this one come out this weekend. Yeah, let me reconfigure this. So I actually have a video portfolio management for option straighters. So I will schedule that to come out tomorrow so that it can kind of compliment this because tomorrow we're going to be how I trade options. So this one will get scheduled for the following week. There we go. Just read that schedule. So this video you won't be able to click into it yet, but you will you'll be able to grab it tomorrow. So that video, it's like 17 minutes long and it's just about portfolio management, kind of like a bunch of guiding concepts and things like that. So I think that will compliment a lot what we talk about today. So let's get into it portfolio management. That video that I linked is really going to give you more of the basis. Today I want to focus more so on the practical application and I want to build off of this. Where is it? This which we went over not too long ago. So this is a new slide because this is what's in the video. I keep forgetting. I got to put it over here. I always remember after I put it over there is again, I have migrated to the left side",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "This which we went over not too long ago. So this is a new slide because this is what's in the video. I keep forgetting. I got to put it over here. I always remember after I put it over there is again, I have migrated to the left side versus the right side. So this kind of goes through a lot of that stuff pretty far in detail realistically speaking on what I try to accomplish. And you can see that there's kind of three big pieces, disposition, portfolio position. And that's what we're going to work through today. The whole idea behind portfolio management in my opinion is to deploy your capital to meet your objectives. That's the high level purpose of portfolio management. And this doesn't apply to options. This applies to portfolio management writ large. So to that end, you'll notice that the first thing on this list is reverse plan. This is the process of starting beginning with the end in mind, which is from Stephen Covey's seven habits of highly successful people, efficient people. I forgot highly effective people. That's it. And so the very first thing we need to figure out is what are we trying to do with this portfolio? Then what I like to do is figure out what I'm trying to do in the long run and then break it down into sub targets. So for example, if I'm 20 and I'm trying to grow a portfolio to be worth",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "are we trying to do with this portfolio? Then what I like to do is figure out what I'm trying to do in the long run and then break it down into sub targets. So for example, if I'm 20 and I'm trying to grow a portfolio to be worth 5 million by the time I'm 50, that's the long run plan. So then how do I get from whatever my capital is at 20 to 5 million at 50? That now becomes the delta I have to cross. And I need to break that up into subsequent milestones so that I can make sure that I'm doing the correct things because a lot of what you'll find in this conversation today is really going to come down to the ability to consistently do something even though you might not see the results up front. So again, you all have seen this by now. This is on my website so you can all go tinker with it until your heart's content. That's the whole point. It's why I built it is because I literally use this all the time from anybody from the OG video days. You guys know I used to use this too. I didn't just like start using this because it's on my website. I literally used to use it from the dot gov website, but I just made one that's slightly better in my opinion for the way that I like to use it. So literally",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "used to use this too. I didn't just like start using this because it's on my website. I literally used to use it from the dot gov website, but I just made one that's slightly better in my opinion for the way that I like to use it. So literally it's why it's here and accessible to everybody. So let's say you're in your early 20s. You were able to save up maybe 10 grand. You had grandma who might have been giving you a bunch of money. Maybe you started doing what I did, which was working a bunch of different jobs. One of them was actually selling Christmas trees. That was so lucrative as like a young dude. I made so much in tips selling Christmas trees. It was insane. And I mean, like I worked at a bowling alley. I used to split wood for a dude. I used to help move shale. All I'm highlighting is that as a young man starting essential when I was 14, I started working and I started trying to find different things I could do in order to make more money so that I could save. I'm going to turn down the game just a little bit because it looks like I'm redlining. I don't know when. But I'm going to take this down to like two and a half. Let me know if that's a little bit better because I'm trying not to blow your ears out. So back",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "down the game just a little bit because it looks like I'm redlining. I don't know when. But I'm going to take this down to like two and a half. Let me know if that's a little bit better because I'm trying not to blow your ears out. So back over to this, maybe you maybe you have 10 grand and you're 20. So before you're 50, you have a pretty long runway. You're looking at something like 30 years or so. Let's say that you're going to kind of be on the higher end of the standard stock market return, which from right now is actually higher than this 12 period. Like if you're using like the last 20 years, it's a little bit higher now. So you maybe call it like 14 ish, something like that. So in this example, if you start with 10 grand, save you essentially just dollar cost average into the SP 500 index, not even dollar cost average, just lump sum it right in the beginning. You have half a million dollars. You have some work to do. You're not there. Now, the very first thing I want you to see is take a look at this. I built this for a reason so that you have to look at it whether you want to or not. And this is saying if you saved literally, literally 100 per month, 100 per month over this entire time frame, rather than 509, you have 937.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "a look at this. I built this for a reason so that you have to look at it whether you want to or not. And this is saying if you saved literally, literally 100 per month, 100 per month over this entire time frame, rather than 509, you have 937. You essentially double your money over this long run by doing this 100 per month. So the whole point behind this is that the long run, long run performance is completely built on short term performance executed consistently for the long run. This is something a lot of people miss out on. So again, if you literally just save 100, you essentially double your money in the same time frame, you cannot ignore this kind of stuff. So for me, when I'm thinking about portfolio management, this is the start. This is the reverse planning. This is the begin with the end in mind component. I decide how much I want to make over what time frame and then I start figuring out how do I get there? A great baseline is just dollar cost averaging or just buying into an index ETF like Spy. It's a great baseline because that tells you essentially what you could do if you just did nothing. If you just kept buying the SP 500, this is what it would look like. Okay, well, we said that we want 5 million though. So now we have a couple more levers that we have to",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "that tells you essentially what you could do if you just did nothing. If you just kept buying the SP 500, this is what it would look like. Okay, well, we said that we want 5 million though. So now we have a couple more levers that we have to figure out. One of them is maybe instead of saving 100 per month, maybe we save 500 per month. Now you're at 265. Halfway, not quite, but much closer. And again, if you save instead of 500, 600, now you're at 3 million. Okay, so now we're on to something. Now again, in the beginning of your young career in your early 20s, what's the probability of you being able to save 500 per month? I don't think it's that crazy, although I am a little bit out of touch with what opportunities are out there. But again, even when I was in the Marine Corps, I would make sure that I'm still doing other things. The point being is even if this is a little high for when you're really young, this is over this entire timeframe. So the expectation here is sure, when you're 20, do you have an extra 500 per month? Probably not. That might be close to what you're making for the month. By the time you're 30, you should be able to save 500 at least a month, if not more than that. Otherwise, you're missing one of the most important wealth development levers",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "an extra 500 per month? Probably not. That might be close to what you're making for the month. By the time you're 30, you should be able to save 500 at least a month, if not more than that. Otherwise, you're missing one of the most important wealth development levers of which there are three. And I have a video that I'm working on that talks about the more in detail, but the cliff notes version is the very first one is savings. You need a good savings rate, but you can't save your way to wealth. You need your money to work for you. You need to invest. So the first one is savings. The second is investing. You need to be able to earn money. The third one is growing your income. Make more money. Make more money. No substitute for that in the beginning. So anyways, you can play with this and you can see, all right, what gets me to my goal? If I do 750 a month, it gets me to 3,700. So I'm just going to keep tinkering with this until I get close to my number. Okay. Now I know my number. If I save 1100 per month on average, earning the standard, relatively actually guided down stock market return for those 30 years, starting with 10 grand, I now have my 5 million. Now again, this doesn't account for inflation and stuff like that, which you probably do want to think about.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "I save 1100 per month on average, earning the standard, relatively actually guided down stock market return for those 30 years, starting with 10 grand, I now have my 5 million. Now again, this doesn't account for inflation and stuff like that, which you probably do want to think about. But now we have a planning factor. We have a starting point because now on a monthly basis, there's a vision. And the vision is I need to save as much as I possibly can to get myself as close to this number as I possibly can so that I can get to this number in the time frame that I want. That's what this means. Now if you're like me, I don't want to wait till I'm 50. 50's fine. 50 now, especially with medicine and stuff like that's still pretty young and super mobile, super. Like it's a healthy place to be. But I wanted it way earlier than that. Go back to one, me being generally impatient. Second, being that I've told you guys this already, I was actually just talking to my mom before this. But my mom was going to rely on me. She never put that pressure on me directly. She never said, you know, Son, you got to do this for me. Nothing ever like that. But I also know that she doesn't have a retirement. I'm never retirement. So I needed to be in a position by the time I was in",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "put that pressure on me directly. She never said, you know, Son, you got to do this for me. Nothing ever like that. But I also know that she doesn't have a retirement. I'm never retirement. So I needed to be in a position by the time I was in my early 30s, really to support her. So I personally set a goal of 1 million by the time I was 30. And that was to really, really start this process. So you can see at year 10 at this rate here, that's only 300,000. So I had a lot more work to do. So where does that work come from? Well, now instead of just doing what the market does, I start looking at how can I do better than the market? So for example, maybe I add a 5 variance on this entire profile. And if we take a look at doing plus 5 over the market in this time frame, that takes me to 383,000. So closer, still not there. Still have to do even better than this. So then what? Well, that takes me to 19. So I would have to start going higher and higher. So for me, I relied heavily on living like a monk into my mid to late 20s in order to hit the threshold. In that same time frame, I was able to drive my returns up pretty massively, but I was targeting 15. And again, my goal was kind of",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "So for me, I relied heavily on living like a monk into my mid to late 20s in order to hit the threshold. In that same time frame, I was able to drive my returns up pretty massively, but I was targeting 15. And again, my goal was kind of like early 30s, call it by like 35. So if you're 20, that gives you like 15 years, essentially. And in that time frame, I would be, if you look at this right at a million dollars at a 19 return rate at this configuration. So what I'm highlighting for all of this is create a plan. I gave you some ideas on how I thought about my plan. I gave you ideas about the context behind at least the starting point, but you got to start here. You don't know what you're aiming for. How on earth are you going to hit it? It just makes no sense. So that's the begin with the end in mind. That's reverse planning. So now we kind of have some ideas. I'm my and says dividend stocks are great for additional income. They can be the problem is is that dividend stocks are almost always going to underperform things that grow in terms of capital gains. So if you're trading and your goal is, you know, you're at a point in your career where you're really focusing on income, nothing wrong with it at all. However, if you're trying to grow your",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "are almost always going to underperform things that grow in terms of capital gains. So if you're trading and your goal is, you know, you're at a point in your career where you're really focusing on income, nothing wrong with it at all. However, if you're trying to grow your money, dividends are not a great place to park your money. You'll make way more money on things that have aggressive capital growth for sure. So I don't have any issues with dividends, but I think traders is a lot of new traders mistakenly pursue them because it's kind of like sure money, right? You know, you're going to get your dividend. But there's an opportunity cost to that capital. In most places, they're paying less than the 6 dividend, right? So and I just showed you that the average market return for the past 20 years is probably closer to like 15 to 16. So for me, I mean, screw the screw the 6 like even if it's that high, most companies that were being realistic, it's like two to four. It's like not even close. So I would much rather take the capital gains risk of holding at least an index ETF because otherwise it's going to grow away too slow. All right. So let's start with Kenneth's question. If I can get it to look normal, there we go. So and I'll bring it up to the top. So Kenneth's question says, it seems to me that",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "least an index ETF because otherwise it's going to grow away too slow. All right. So let's start with Kenneth's question. If I can get it to look normal, there we go. So and I'll bring it up to the top. So Kenneth's question says, it seems to me that a lot of new investors start out picking the usual suspects and going trial error or start with a specific stock. They have a relationship with in my case, been holding GME since 21 and started looking at options in these shares as well. I feel that there's a great foundation to do so because I have such a deep understanding of GME of during three and a half years. So I want to start there because I actually think it's a big mistake. I think it's a giant mistake. The reason I think it's a giant mistake is because even though you can do well trading an individual stock over a time frame, it's such a myopic approach. And again, I would wager that if I dollar cost averaged into not even a leveraged fund, just QQQ over that time frame, it probably would outperform anything that was made in GME during those three and a half years, even with the squeezes. So yeah, to me, I think it's a bit of a mistake to become to myopic. That's not the route that I would go at all. I would be very thoughtful about what I was putting my",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "in GME during those three and a half years, even with the squeezes. So yeah, to me, I think it's a bit of a mistake to become to myopic. That's not the route that I would go at all. I would be very thoughtful about what I was putting my money into, which we'll talk about. But I think in the beginning, it's just such a better approach to just build a more holistic understanding of markets if you're going to be a trader. Now, to kind of this point, if you're not going to be a trader, if you're going to be an investor and you just want to buy the stocks that you like because you like those companies, that's cool. Totally cool. No problem at all. No problem at all. If you're going to be a trader, it's a big problem. Why on earth would I limit myself to one or two things? It doesn't make sense. The whole point of trading is agility. Like there's synonyms. The whole point of trading is to be active so that you can pivot to things that are working, that are not working, that have strength, that have weakness. Now some traders decide that they're going to be long only or whatever it is. However, even if you want to be long only, you can still find a lot of different things that might make sense for you. So yeah, to me, I think if you're investing in something because",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "some traders decide that they're going to be long only or whatever it is. However, even if you want to be long only, you can still find a lot of different things that might make sense for you. So yeah, to me, I think if you're investing in something because you really like a company and that's part of your game plan is to invest, invest, that's okay. But in trading, I think it's a big mistake. Paul says this post emphasizes emotional bonds too much. I didn't get through the rest or do you mean this? Because I do agree with you. Like the relationship component is slightly emotional in my opinion. And I agree with you like the Tesla cars owners liking Tesla. But again, like if they're investing, I don't care because this is like one of the most common ways to start investing by what you know is super common advice. So from an investing perspective, I don't mind. Go Bulls says that's what I've been doing mostly to I'm here to learn more. Yeah. And again, I never would want to, I always want to be very clear. There's a lot of different ways to do this. So if you're doing something else and it's working, go for it, right? I'm just kind of talking about the way that I think about things and the way that I've synthesized it over the years. But yeah, I think in trading your asset, your biggest benefit as",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "do this. So if you're doing something else and it's working, go for it, right? I'm just kind of talking about the way that I think about things and the way that I've synthesized it over the years. But yeah, I think in trading your asset, your biggest benefit as a trader is your ability to move your agility. And the idea of doing things like trading things in different directions, it's huge because again, even institutions, they have burdens that they have to go through. They have different filings that they have to make. They have a lot of reporting requirements that slow down their ability to move around. One of the only real benefits of being a retail trader is your ability to flip and move as fast as you want. You are as agile as you can be as a market participant. That's not all that glitters as gold. There's more, there's way more drawbacks to being a retail trader than positives. But there is a positive and that's probably the biggest one that exists. So I think it's really important to lean into that positive. So yeah. Brennan Gates says, would you still call it myopic to invest in GME knowing their current board and position? No, again, like if it's a long-term investment, I would say build whatever you want. But if, for example, if the question is more so like trading GME, that's different. I actually went over that in the video I did",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "to invest in GME knowing their current board and position? No, again, like if it's a long-term investment, I would say build whatever you want. But if, for example, if the question is more so like trading GME, that's different. I actually went over that in the video I did two days ago, right? Because I'm holding long shares in GME because I want to support the movement. I do think it looks good longer term. But I'm not trading options in it right now. This is not doing anything. So from a trading perspective, I would not just sit there and stare only at GME because it's not doing anything. I need to divert my attention to things that I can make money from. So from a trading perspective, if the idea is only looking at GME, it can work if it's moving for sure, right? There's nothing wrong with really dialing in your focus when it starts moving. But I mean, if we take a look at GME and we look at what it's done essentially from here, from the sixth, it's gone from 21 to 224. I mean, it's not moving. And companies do that. They will consolidate. That's what's happening here. This thing is consolidating. It's still trending up. It doesn't look bad here, but it's just not moving much. So for me, I'm way more interested in trading things that are showing movement that I can trade. Prouch Drake, great example of this. So it",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "consolidate. That's what's happening here. This thing is consolidating. It's still trending up. It doesn't look bad here, but it's just not moving much. So for me, I'm way more interested in trading things that are showing movement that I can trade. Prouch Drake, great example of this. So it hit this term low, started accelerating up and out. As soon as it starts breaking above these levels, it looks somewhat interesting to the upside, especially with how bought it was here. And then it's just been slowly grinding up and out. So in another example, from the fifth of August, this is gone from a low of 200 to 261. That's not an insignificant move. That's a very tradable move. Not huge, right? I'm not like purposely cherry picking like these home run giant plays like I'm showing you something that's super realistic that has recently happened. That was a great trade. So I think for stuff like this, it's showing movement. It deserves some more attention. So when I look at something like GameStop, it's a little bit different because it's just not moving that much. So that's that one. Now for Ian, as I already mentioned, we're actually going to take a look at Ian's configuration a little bit in the video, but let's pull this up so that it's easier to see. And Ian is asking a few example portfolio structures would be helpful. It's okay if the goals aren't the same as theirs. The examples",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "actually going to take a look at Ian's configuration a little bit in the video, but let's pull this up so that it's easier to see. And Ian is asking a few example portfolio structures would be helpful. It's okay if the goals aren't the same as theirs. The examples don't need to be optimized. It's just an example to see if you want to achieve X. Here's a way we can essentially set up a portfolio, which we can absolutely look, that's exactly what we're going to take a look at. So it's a great question. And then we have our hometown favorite, our boy, Shrey J. And he's asking about the idea of adding uncorrelated products into the mix. Do we have to venture outside of stock spawns as majority of them moving tandem with one another? This is a great question because it really, it hits a bunch of different things all at once. So the first one is in this example, I would demand to understand what's the point of the uncorrelated products. That's the starting point. Once I know why we're trying to add uncorrelated products and then for what time frame, then I can figure out what kind of stuff makes sense. So like for example, if you're trading volatility, volatility, the whole point of volatility is that it's a non correlated return. It doesn't care about price. That's the whole point of volatility is that it is price agnostic. You are trying to",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "figure out what kind of stuff makes sense. So like for example, if you're trading volatility, volatility, the whole point of volatility is that it's a non correlated return. It doesn't care about price. That's the whole point of volatility is that it is price agnostic. You are trying to trade, and this is if you're actually trading volatility, right? Where we're talking about gamma hedging, then delta hedging, like actually isolating vol. It's not correlated to beta. It doesn't care about beta. Now if the market trends, that's essentially it telling you that the vol hypothesis was wrong. But that's one very simple non correlated return that you can add to portfolio essentially at all times. Now the rest of it really depends on what's in the portfolio, but you can find non correlated products. They almost always exist. So the other trick to this though is that you have to analyze the correlation of things over the reference time frame. So the reason why that matters a lot is because correlations of things change. So for example, for the longest time, stocks and bonds typically inverse what happened during COVID and then post COVID, they both moved together. That messed up a lot of people because they built entire systems that was entirely predicated on these long term relationships that generally had been respected, but it's not perpetual. It's not always. So the way I would look at it is as I'm going through the rest of the",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "That messed up a lot of people because they built entire systems that was entirely predicated on these long term relationships that generally had been respected, but it's not perpetual. It's not always. So the way I would look at it is as I'm going through the rest of the portfolio, if I run into a point where it's like, I really want to add more risk to the portfolio, but I don't want to add directional risk one way or the other, then I would start to look at non correlated returns and see if I can find them. But that would really be done by beta waiting the entire portfolio and then finding things that essentially have no relationship with the SP 500 and there are stocks you literally can scan for it directly. So but the thing is that there's still systematic risk here. So for example, if you find a stock that's not correlated with the SP 500, that doesn't mean that if the stock drops, that your stock's not going to drop, it still probably will drop because it's still systematically attached. But if short of some sort of big forcing circumstance like a global pandemic or something else, then it means that it's going to kind of run around and do whatever it wants and not necessarily move in line with the market on the day to day. Now if you're looking for things that are non correlated to the SP 500 over longer",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "pandemic or something else, then it means that it's going to kind of run around and do whatever it wants and not necessarily move in line with the market on the day to day. Now if you're looking for things that are non correlated to the SP 500 over longer term timeframes, that's actually when I would look at things like commodity futures because you can find other things that are essentially completely different markets. You have to trade different markets at that point. If you're looking for like true non correlated returns, even during severe market movements up or down, you can find them. But it essentially requires moving into different markets. Currencies is another market. So your instinct here of venturing outside of stocks and bonds is spot on. Again, if you're going to that extreme, which I would imagine most people probably don't have to. So another great question. All right. So we talked a little bit about kind of breaking this long run, playing down into smaller timeframes. And then I talked really briefly about what this looks like. So the video tomorrow is going to go way further into detail on this. So I'm not going to labor the point too far now. But essentially all this is emphasizing for you is a top down approach. This is talking about starting with how you feel about the market to figure out what your portfolio should look like. Then making your portfolio look like that by",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "going to labor the point too far now. But essentially all this is emphasizing for you is a top down approach. This is talking about starting with how you feel about the market to figure out what your portfolio should look like. Then making your portfolio look like that by building each position in it so that they come together as a portfolio that makes sense for however you feel about the market. So a super quick example here that might be helpful is let's say that right now we look at the market. Let's take a look. And let's say you're bullish. You think that the market is on the route to recovery. You want long deltas, stuff like that. Okay. We can figure out how to do that. So right now the disposition is generally long deltas. I think again, the qualitative side of my brain is that we're in a really emotional market which I've talked about before, meaning very news driven event driven, which means that things can move a lot, which is going to inform my allocations to things, but overall on bullish. So it tells me that the overall tilt I want in my portfolio is slightly long. That's the starting point here. So let me grab my notepad. And let's get some more of everybody's favorite, which is Eric's handwriting. I'm pretty sure that this is like a crowd favorite, is it not? So I'm going to add like a little scratch pad",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "portfolio is slightly long. That's the starting point here. So let me grab my notepad. And let's get some more of everybody's favorite, which is Eric's handwriting. I'm pretty sure that this is like a crowd favorite, is it not? So I'm going to add like a little scratch pad thing so that delete it when we don't need it. All right. We'll grab our little free hand tool. All right. Here we go. So for the portfolio, we know we want long deltas. For the next part, that's actually pretty good handwriting. Come on. Give it to me real. That's pretty good handwriting. Is it not? Also, I should stand up. I've been taking a bunch of a set of medicine and ibuprofen. So my whole back, really, it's more so the leg doesn't hurt quite as bad, but then it can kind of sneak up on you. So you got to keep it, you know, keep it smart. Jonathan says, did you type that? Reece says pristine. Yeah, exactly. I mean, I can't imagine writing more clearly than that. I think Jonathan is, he might have actually found my secret. So I did just type that. That's a really tricky font to get. It's kind of like comic sands, but it's a little bit better. Yeah. So we know we want long deltas. Next we need to know how big the portfolio, okay, so now I'm standing so that the handwriting is going to change a little bit.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "really tricky font to get. It's kind of like comic sands, but it's a little bit better. Yeah. So we know we want long deltas. Next we need to know how big the portfolio, okay, so now I'm standing so that the handwriting is going to change a little bit. Let's see what we can do here. So the portfolio is going to be 100,000. And the reason why I use 100,000 is because you can divide by 10, multiply by 10 to make it whatever size you want. Of note, it's about the only thing you can make whatever size you want. Fun fact, is this example? So we know about 100,000. We know that we want to be long. We know that with the market where it's at, we have to decide how much of the account we want utilized and how much of the account we want in reserve for whatever subsequent movement we think may or may not happen. And all of this is going to be predicated on our strategies. So of this, we need to think about how we're going to split up this money. Where does this go? And this is the art of portfolio management. Is exactly this. It's figuring out where that money goes. So let's talk about it. This is just a quick recap for you all to understand how I typically think about trading and the kind of things that I look to do. So it's literally just for",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "of portfolio management. Is exactly this. It's figuring out where that money goes. So let's talk about it. This is just a quick recap for you all to understand how I typically think about trading and the kind of things that I look to do. So it's literally just for your reference, we're going to spend no more time on that. Now let's start with an example portfolio. Let's say that we have 100,000 account. Right here. That's kind of not there we go. 100,000 account right here. We want to make 15 per year, which means we need to make 15,000 over the year, which means we need to make about 12 fitty a month. How can we do that? Lots of ways. Literally, there are unlimited ways to crack that nut. I'm going to give you an example of one way that's pretty simple to follow, I think. So we know in the long run, stocks go up. There's positive drift. At the beginning of this, we started with this buy in hold proxy. We were saying what could we do if we bought and held the SP 500, right? Spy. So we started with that as the backdrop. So then the way my brain works is I think, okay, well, how can I do slightly better than that? I think of two things. I think of how can I add leverage? And the second thing I think about is how can I reduce the draw downs? Because",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "backdrop. So then the way my brain works is I think, okay, well, how can I do slightly better than that? I think of two things. I think of how can I add leverage? And the second thing I think about is how can I reduce the draw downs? Because if you don't participate in it as many of the draw downs, then you have a slightly more effective approach to not be in trades as they're completely unwinding, drawing the account down. So we can take a look at something like this. So this was a really, really quick back test of looking at a super simple strategy using SSO, which is a two time leveraged SP 500 product. And you can see that the average performance year over year for the last 10 years of this takes you just over 20. This is using a base 50 day moving average momentum strategy. Above the 50, we're in it and buying the crosses below. We get out until it crosses back above. That's it. So as we look at this, we can see that it performs pretty well most of the time, but then it has a rough year in 22. It's a big old drawdown. It's like 40 down on the year way, way unacceptable. So then we can think about if we wanted to really perfect the strategy, how do we address that year in 22 that really sticks out to me? But what I'm doing right",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "in 22. It's a big old drawdown. It's like 40 down on the year way, way unacceptable. So then we can think about if we wanted to really perfect the strategy, how do we address that year in 22 that really sticks out to me? But what I'm doing right now is I'm just coming up with a base system that is super simple to start with. And this would become the core allocation. So I'd say for the core allocation of the portfolio, I probably would run something like the coverage strangle on something like this, use a moving average momentum strategy, run the majority of the portfolio on this because in the long run, it's going to put me exactly where I need to be easy. So then that leaves us with a speculative allocation, 20 of the money. So now we have 20,000 to trade and attempt to amplify this. So why am I doing 80 of the money in this? Because if I do that at slightly over 20, this alone, essentially for the entire account would meet this threshold for the portfolio. And then this is a way for me to amplify. How can I make this better? So then we start figuring out how we want to deal with that 20,000. Do we set for me, I would start by setting what's the max risk? I would take per trade understanding that I need to make sure I can get enough iterations on. So",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "make this better? So then we start figuring out how we want to deal with that 20,000. Do we set for me, I would start by setting what's the max risk? I would take per trade understanding that I need to make sure I can get enough iterations on. So for example, if I have that 20 speculative allocation, I don't want to be too aggressive especially early on. Again, this is just obviously a random example. If this was actually my account, I would trade this quite a bit differently. But in this example, I would have no problem using most of this 20K on an individual trade for a speculative trade personally. But the risk on it would be very tight. I'm giving you another potential threshold you could use. So something like less than 5 of total account value per trade, which gives you about 5,000 of risk ability per trade of this allocation in total. So that means you can use all 20,000 on an individual trade, but you can only risk 5K of it so that it fits in with the broader portfolio objectives. So now we have parameters. We started with what we want to do in the ultimate long run. What are we trying to do? What are we trying to do long term? We have that. We've now broken it down into smaller time frames so that we know what we need to make per year, what we need to do per",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "to do in the ultimate long run. What are we trying to do? What are we trying to do long term? We have that. We've now broken it down into smaller time frames so that we know what we need to make per year, what we need to do per month. All of that is done. So now we're at the point where we need to find individual positions to do things. We already did that. For 80 of this portfolio, we know where it's going to go. Something like this done. So now what we need to do is figure out what specific positions fit into this. So I've just done the vast majority of the work for you. Now you have to help me do the remaining work. How do we find these positions? You guys tell me, what are your ideas? I gave you the parameters that I think make sense for the broader example. Now we need to figure out how do we use the rest of this 20? Where do we find the risk? So what do you guys think? What should we do to find this risk? There's again a million ways to do this. But I think it's a super important exercise now for you guys to start thinking about it. What do we think? I need to find some place to put 20,000. Where does that go? I'll sit here with you guys. I'm actually about to get my food order ready",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "this. But I think it's a super important exercise now for you guys to start thinking about it. What do we think? I need to find some place to put 20,000. Where does that go? I'll sit here with you guys. I'm actually about to get my food order ready for tonight, which is going to be Mexican, I think. I don't know how you guys feel about Mexican. I'm in different to it, but I really like the carne asada burritos. But there's this really gross thing called a California burrito where they put fries and shit in it, which is super. I don't know, that just sounds so disgusting to me. Like fries in a burrito. Maybe it's one of those things that tastes really good, but it just does not sound good to me. Big A says copy Pelosi, I love that. That's not a bad idea at all. Jonathan likes California burritos. I, God, dude, I just don't know how. I mean, they're not bad. I mean, I've never had one. I just don't want fries on a burrito. I do like adding Chipotle sauce, though, which I feel like is kind of a pretty white person thing to do, but it's good. All right, let's see what you guys. Big A says see which SP or QQQ are near 52 week lows. All right, let's do it. Literally, we now go into practical application. So what I'm going to do is go into on demand.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "person thing to do, but it's good. All right, let's see what you guys. Big A says see which SP or QQQ are near 52 week lows. All right, let's do it. Literally, we now go into practical application. So what I'm going to do is go into on demand. We are now back in time together. And I'm going to go back to a random point in time. Let's do 2016. I don't know much of what happened in 2016 off the top of my hand. I don't even know what kind of year that was. So we will start in 2016. So you guys, you guys drive me. You guys tell me what we're doing here. We have 20,000. We need to get to work. I'm going to start with getting our core allocation set up in the meantime. So let's take a look at SSO. Let's see if it's above a 50 day. Which one of these stupid lines is a 50 day? It's not above a 50 day. So I have nothing to do right now. I am unemployed. My trade, our 80 is off the table right now. Technically, I would rotate it into something like HYG, like some sort of yielding product. So we can simulate that as well. Let's see where HYG is at. Yeah, I would love that here. So in this case, I would just come in here. Apparently, there's no bit ask. I don't know why that is slightly confusing,",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "like HYG, like some sort of yielding product. So we can simulate that as well. Let's see where HYG is at. Yeah, I would love that here. So in this case, I would just come in here. Apparently, there's no bit ask. I don't know why that is slightly confusing, but we need to use 80,000. So essentially, 1,000 shares. Can we get a fill? I don't know if let's fast forward this. We'll do like nine, 45 is fine. And let's see. Answer replace. Rease says excess funds and box spreads. It's a great, it's a great point. What's the problem? What was the interest rate in 2016? Let's see. Interest rate in 2016. Yeah. So you, Rease, are probably a little too spoiled here. Jonathan says 4.5. That's not what I see. That's not what I see at all. I don't know unless chat GPT is wrong, but chat GPT is saying that the federal funds rate in 2016 from the beginning was 0.25 to 0.5. And this was after December 15, which was the first time that they raised rates in nearly a decade from about zero. So yeah, that doesn't exist. One of the main reasons why when I first was making YouTube content in 2020, I wasn't doing a bunch of stuff about box spreads, which is a big part of what I do, but it needs yields. So yeah, in this case, yield was 0.25 to 0.5. There was no yield. So I mean,",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "why when I first was making YouTube content in 2020, I wasn't doing a bunch of stuff about box spreads, which is a big part of what I do, but it needs yields. So yeah, in this case, yield was 0.25 to 0.5. There was no yield. So I mean, for me, that's not where I'm going. Whereas if you look at something like HYG, this is what is it? A 42 cents, so 0.42, it doesn't give me the yield here, so I have to figure it out. 0.42 divided by what 80 point at the 8. So it's like 0.5. So it's still, I mean, just the yields were non-existent here. The yields were absolutely abysmal. So yeah, but in any case, just simulating this through, let's put on a position in HYG so that we can have some sort of risk on. If I can get this to fill, maybe I can just do like a market order. Or not, because there's no bid ask. Was the market closed? Is that what's happening right now? January 1st. I'm so dumb. That's New Year's. So stupid. So stupid. Fun fact, the market's closed on New Year's. And when the market is closed on New Year's or any other day, you can't get a fill on your trade. In case you were wondering. So now let's try to get a fill. Let's just go for a market order. Ah, we're filled. So we have our yield trade on. And",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "the market is closed on New Year's or any other day, you can't get a fill on your trade. In case you were wondering. So now let's try to get a fill. Let's just go for a market order. Ah, we're filled. So we have our yield trade on. And then let's zoom this over. There we go. It doesn't let me see beta-weighted delta's because it's super annoying. So I'm not sure what the beta-weighted delta's are here, but this is very correlated with the SP 500 typically. So now let's take another quick look at SSO. See if it's time to put that. What the? I don't think that's right. I hate these leveraged funds back in time. They're really, really painful to use. So I'm just going to pretend the SSO HYG thing is going to happen in the background just because I don't want to keep dealing with this as a giant waste of time. So now we need to figure out the 20,000. Now, let's see what you guys think. HYG says see which SP or QQQ are near 52 week lows. Okay. So let's take a look at spy. Let's just continue with this thing. So Neon wants this covered calls on spy. Okay. Let's play that out. Right now for the rest of the portfolio, we're doing SSO which is levered two times spy. Now Neon is suggesting maybe we look at covered calls in spy which we can look at. Walk me",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "thing. So Neon wants this covered calls on spy. Okay. Let's play that out. Right now for the rest of the portfolio, we're doing SSO which is levered two times spy. Now Neon is suggesting maybe we look at covered calls in spy which we can look at. Walk me through how this would work. We have 20,000 to use in total. So if we're doing something like covered calls, it'll be pretty expensive in something like spy in my opinion. So how do we make this make sense? Because we know we need to make 12,50 a month to keep us on our target. You need 12,50 a month. And right now our fastball which is SSO is not on. We're waiting for the condition for SSO to be able to be put on. Which we also know SSO would not have been jacked up like that with spy being down here. So it's just kind of an artifact of the back test of the portfolio. So big as says a leaps diagonal in spy. So for me, I would probably x-snay that move personally. And it's again, if I'm looking at a ratio called diagonal, I needed to go up. If I'm looking at trading something like covered calls, I needed to go up. This is not going up. I'm looking at something that's largely going sideways. And it actually has a slight downtrend. So then the question is why would we put on something that is bullish",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "go up. If I'm looking at trading something like covered calls, I needed to go up. This is not going up. I'm looking at something that's largely going sideways. And it actually has a slight downtrend. So then the question is why would we put on something that is bullish and needs to go up in order to make money if it looks like that? What's the idea there? I'm seeing any other ideas that you guys had. Doctors A is to sell puts. All right, let's take a look at someone with some puts. Which again, for me, bullish. This is not bullish. Markets going down. Nian says I currently do call credit spreads to get my extra money. I also would not do that personally. But let's take a look at the puts scenario. So for the puts things first, puts again are bullish. And this is not going up. So I would be mindful of those factors combined. Now let's just take a look at the example. We need to make 1250. And again, right now our fastball is not on. Doctors A says buy puts. Okay. They're going to be more expensive now. But walk me through the trade. What trade would we put on? Doctors A is talked to me. So from this, what I really need to understand is how much money are we going to use in this trade? And then how do we build it? Tyler says neutral spreads like iron condors",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "through the trade. What trade would we put on? Doctors A is talked to me. So from this, what I really need to understand is how much money are we going to use in this trade? And then how do we build it? Tyler says neutral spreads like iron condors until a breakout. I don't hate that. So Tyler, in the meantime, if you want to start elaborating on your idea, like what kind of stuff we would look at and what kind of trades we would put on, we can take a look at those. And then doctors A is let me know what puts we're going to buy, what expiration we're going to, those kinds of things. Because what I what I'm hoping to show you with this example is an important process, which I'm not sure most people go through. So that's why I'm kind of getting into the specific details with these. So for example, for doctors A is let's say that he wanted to buy 74 DTE puts and we want to trade it similar to like what I would do in a ratio put diagonal. So I'm going to grab something that's in the money that's liquid. So let's take a look at like these 70 delta puts maybe or these the none of these are super liquid. So I'm kind of is what it is. But let's take a look at like these two tens. We buy these two tens that are 74",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "money that's liquid. So let's take a look at like these 70 delta puts maybe or these the none of these are super liquid. So I'm kind of is what it is. But let's take a look at like these two tens. We buy these two tens that are 74 DTE. So that takes up 1,278. Now we need a couple important decisions. The first one is where's the target? Where do we think that the SP 500 is going to fall to? So if I look at this and we're hanging around there, we're actually coming right up on a volume node kind of like right here is what I see. And I'm just using the volume nodes over here to get a sense of where prices. So you can see that there's a volume node. I just parked that on. So I would view that as near term support. So again, personally, I wouldn't trade a put diagonal here because to me it's just coming into support and I would need to know how I would need to see how it's going to move. But let's just play the example out. As I look at the trade, I might pick a price target. Where do I think it might go after it breaks through here? Well, the next volume node I see is like right there. And then let's say that we think we might get a bigger move for whatever reason that next volume node is right",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "might pick a price target. Where do I think it might go after it breaks through here? Well, the next volume node I see is like right there. And then let's say that we think we might get a bigger move for whatever reason that next volume node is right there at 193. So let's give ourselves the benefit of the doubt. And let's say our target is 193. So I'll go back into this trade and then I'll keep it out of one lot for now. And then I'm going to look at the analyze tab. And I want to see what it would be worth, which again, this is kind of, oh, maybe it'll update. Let's see. That's tricky because I wanted to see what it would be worth. If the stock was trading at 193, you can typically do that in the analysis tab again like this isn't, oh, this is the old one. That's why that's my bad. That's my bad. Let's see what you're going to see. There we go. So at 193, you'd have 427 bucks. So we need to make 1250. This would get us about a third of the way there, which is great. Or we might need to size it up. We could do a second one, but then we need to figure out where do we get stopped out? Well, the risk part of this trade, it looks like the first stop would be somewhere right around here, like the",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "is great. Or we might need to size it up. We could do a second one, but then we need to figure out where do we get stopped out? Well, the risk part of this trade, it looks like the first stop would be somewhere right around here, like the 201 handle. So then what's our PNL at 201? This is down 390 bucks. And if you remember, we said that we can risk up to 5,000 per trade. This is well within that tolerance. So so far so good. We're looking at a probability of getting stopped out at 390 and trying to get to 193, which would give us 419. Now what I would do is look at the probabilities of both of these circumstances. 193. And then the probability of hitting 20, what did I say 201? And I would calculate the expected return. So I'm going to grab a calculator right now. So the probability of us hitting this, which would give us like 410. So 410, which is done at 193. And then the loss was 390. And that happens at 201. So let's say that we're going to give this thing like 30 days to work or something like that. Again, normally I would use this tool here, which is the probability analysis tool. It's a little easier, but you don't need it. You can use the options chain all the same. So we can come out here and we can say, what's the",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "to work or something like that. Again, normally I would use this tool here, which is the probability analysis tool. It's a little easier, but you don't need it. You can use the options chain all the same. So we can come out here and we can say, what's the probability of us hitting 193? Well the probability of a touch is 73.85. So then there's a 73 probability of a touch there. And then what's the probability of a touch to 201? It's 93.81. 93.81. So this is a probability of a touch. 81. So this is a negatively expectant trade. This is a no trade for me. So this is an example of I would need to either update my expectations for where it might go. So one of the ways I might do that is by saying, OK, maybe 201 is too tight. Maybe we say if it gets above this next volume node, which this one's at like 203. So let's say if it gets up to like 204. And we can take a look at new probabilities here. We can say, what is it worth that 204? Now we're losing 684. So we have to update our probability matrix negative 684. And then we have to look at the probability over this 70 days of us hitting. What was the specific number 204 60? So the probability of hitting 204 is 7768. So this will still be a bad trade. Still negatively expectant. So this",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "update our probability matrix negative 684. And then we have to look at the probability over this 70 days of us hitting. What was the specific number 204 60? So the probability of hitting 204 is 7768. So this will still be a bad trade. Still negatively expectant. So this is a no trade. It doesn't fit. That's it. Good look. Good, good idea to look at. So now we can take a look at this iron condor trade. So Tyler, if you give me some details on, well, first before I go into the next example, is what I just did make sense to you guys from like a practical standpoint, like what I just went through. I just realized I didn't really take a pause after that. But I want to make sure that that makes sense because it's a really important process. And we just got through our first beverage, which is the spin drift make every time I do this. Spin drift mango, big fan, really like those a lot. It's probably the mango orange is probably my favorite. All right, so Liz is following us, which is great. As long as she's with us, that's essentially all that matters. And then the rest of you hula gins around your own. That's really what that boils down to. So now we're moving on to our next beverage, which is a strawberry lemonade. This one's pretty good too. That was just a celt or water though. So",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "essentially all that matters. And then the rest of you hula gins around your own. That's really what that boils down to. So now we're moving on to our next beverage, which is a strawberry lemonade. This one's pretty good too. That was just a celt or water though. So now we have to move on to the next trade idea. Now I'll kind of go through some of the things that I would do. The first thing I would be trying to figure out. Nian says in my model of a call credit spreads, 3K risk makes 1323 a month with 25 tax rate. Currently over 95 success rate, my one loss in one year is 50 capital close. Help me through the system. We can look at it together. But the again, the issue with really high win rates is the probability of a blowout at some point is super super real. But yeah, happy, absolutely happy to take a look at it. If you let me know the general parameters, we can run an example. But in the meantime, what I would be looking for is what is the market look like it's going to do. So right now net highs lows is trending negative. I don't love that. And the spy is coming down, cues is coming down, Russell's coming down. Essentially everything here is coming down. So what that means to me is I don't actually know if I want to go really long here",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "right now net highs lows is trending negative. I don't love that. And the spy is coming down, cues is coming down, Russell's coming down. Essentially everything here is coming down. So what that means to me is I don't actually know if I want to go really long here to the upside. I don't necessarily want to fade the indices either. So one of the things I would do personally is take a look within the sectors and find sectors that are not doing well broadly. So like this, XLU is not doing well. This is like the sick puppy, along with XLE. These are two trades that I like to the downside that look more prone to collapse. So this is kind of where I personally would start looking. And I can either fade the entire index itself or I can look what's within the index. I don't know how well the scan feature. Okay, that sucks. So I was going to scan with you guys, but you can't scan in on demand, which I mean, I guess that's fair. It's kind of difficult to code in little annoying because really what I would do here is go into the sectors and look for the underperforming stocks within those sectors. That's the first step to this idea. So I know it would be within XLE and I know it would be within XLE. But we can just use the indices themselves to start with and just kind of",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "into the sectors and look for the underperforming stocks within those sectors. That's the first step to this idea. So I know it would be within XLE and I know it would be within XLE. But we can just use the indices themselves to start with and just kind of follow that vibe. So let's take a look at XLU. XLU. And it doesn't look like it's crashing. It looks like it's relatively range bound. So this might be something that we can sell some options in. So maybe we can do something that's like, I don't want to go as far out as 46 ideally. We can take a look at what the theta is, which is super low. So that's no good for me. Maybe 32. Yeah, so something like 32 days, it'll be a little less liquid. So it's not my preferred expiration, but I'm hunting for liquidity here. And my disposition is slightly more to the downside. So I would look at something like this, like selling the 34 delta calls. And we can do like a few of those. I'll see what the actual risk is on these. And then I still would sell some of these puts, maybe like these 42 puts, but I would do it at a ratio. So maybe like two of those. And let's see what this looks like. We got to get rid of this one. It looks like nothing because again, we're in on demand. That is one",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "of these puts, maybe like these 42 puts, but I would do it at a ratio. So maybe like two of those. And let's see what this looks like. We got to get rid of this one. It looks like nothing because again, we're in on demand. That is one of the artifacts of this. But really what I wanted to see is what the total risk would be. I wonder if I split these up actually. Let's see if that'll work for us. So let's pretend that we just sell these first and see if we can get a risk profile. And we cannot bummer. Okay, can't get a risk profile. We can just swag it. So the way that I'm going to swag it is by using the options chain and seeing what surrogate options look like. So my stop here. Doctors they says why are we in on demand and not real time. So that we can ideally fast forward so that we can see what it would look like in the example. The other reason is to put us in an unknown time frame so that it's a little more efficacious for us to posture. It's like I really don't know what happens in the market here genuinely. I think if I'm not mistaken, I think 2016 ended up being an up year like less than 15 greater than 10. I want to say, but I don't know the path of that return. I have absolutely",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "like I really don't know what happens in the market here genuinely. I think if I'm not mistaken, I think 2016 ended up being an up year like less than 15 greater than 10. I want to say, but I don't know the path of that return. I have absolutely no idea what it looks like. So it's to try to like genuinely put us in a scenario where we're literally building a portfolio in a scenario. We don't know that ideally we can fast forward and see how it does. That's the idea. But the main point is whether it's a non-demand or not, the concepts here really remain the same. So what I'm working us through is we have the core allocation that we're going to flip on and off as it's time right now. It's time to be flipped off. That's okay. And then right now we're looking how do we use this 20,000 to find good opportunities. Now ideally, I would much like scanning would be a huge part of this. So we'll probably go off on demand so that we can scan because I at least want you to see that process. I think it's important. But we'll get through this. Nian says, after the opening hour, I sell a call credit spread 1 wide 3. What? 1 wide 3 premiums at least 10 over currents spy price for the next day close. The 1 wide 3 premiums doesn't make any sense. I sell a",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "important. But we'll get through this. Nian says, after the opening hour, I sell a call credit spread 1 wide 3. What? 1 wide 3 premiums at least 10 over currents spy price for the next day close. The 1 wide 3 premiums doesn't make any sense. I sell a call credit spread at 1 wide 3 premiums at least 10 over currents spy price. The other like I 1 wide is the spread from short to long collect but you don't. You're not going to collect 3 premium on a dollar wide spread like that just is not how it works at all. So let I mean, we'll look at it in an example really quick. We'll go to spy and we'll go to 1 wide. So 20 and I'm giving you the benefit by doing the at the monies. You get 58 cents. So yeah, like you don't collect 3 premium. Do you mean like 3 premium that gives you through no because you're saying 3K is 30 contracts. That doesn't look right at all to me. You're not going to collect more premiums than the width of the strikes. That's just structurally not going to happen. So then your math on 3K is 30 contracts doesn't work at all either. So I have no idea what you got going on but I think I would definitely encourage you to take a super close look at the math because what you just drop there is not right. It's",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "then your math on 3K is 30 contracts doesn't work at all either. So I have no idea what you got going on but I think I would definitely encourage you to take a super close look at the math because what you just drop there is not right. It's not accurate at all. All right, back to this. So when we're looking at weakness trying to find those trades, we were in what was it? XLE or XLU, both of these look bad. Yeah, XLU. So XLU, I'm more neutral in my disposition. It's slight bearish disposition. It's trending down. So that would lead me to want to sell a little bit more premium than buy. So using this 32 days, some shit like that, we can sell a couple more of these so we can sell five of them. Now what I'll do is because I can't see it in the risk profile because it's not popping up is I can just create what I call a surrogate option. I can see what these would look like given different moves. So if I go to the chart and I say where would my stop be? My stop would be let's call it 44. So from 42, 93 to 44, it's about a one point move to the upside. It's actually too tight, I think, but we can see what it would look like. So what I would do is pretend that these options moved one point against me.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "be let's call it 44. So from 42, 93 to 44, it's about a one point move to the upside. It's actually too tight, I think, but we can see what it would look like. So what I would do is pretend that these options moved one point against me. That means that my options would look like these 43s. So my options then from a surrogate sense would go from 37 cents to about 85 cents. It's about the change that would happen if we get that 1 move. So it helps me understand what the risk is. So if I get a dollar move against me, my premium is going to change from 37 to about 85. So then my risk, whatever the unrealized loss would be the difference between those two. So I'll take a pause there because I know the surrogate stuff typically starts losing people pretty quick. And I want to make sure that that makes sense for you guys. What I'm doing is I'm just mentally simulating if XLU moves a dollar against me, what my option would look like. So if I essentially move the option a dollar, these 43s would look just like my 44s as of right now if we get that dollar move. So then that means that they would be trading again for like 85 cents or something like that. So then I would take the, I think it's 84 cents. So 84 cents less the 37 cents that",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "like my 44s as of right now if we get that dollar move. So then that means that they would be trading again for like 85 cents or something like that. So then I would take the, I think it's 84 cents. So 84 cents less the 37 cents that I made. I'm not worried about that because that's originally the credit I get gives me 47 cents in risk, which is 47. The trade would be down 47 bucks if I get a dollar move against me. And give or take just it's a surrogate. Has that completely lost everybody? Because if so, I don't want to do that. And I'm happy to kind of just gloss over it a little bit higher. I'm trying to give you some tools on how I think about these things. But I know that it's kind of esoteric. It's a little bit weird. Okay, doctors A is his with us. He's a doctor. Of course, of course the doctors with us, we, you have doctor in your name. So Willie says a bit lost. That's fair. So the way Willie to think about what I'm doing is I am moving the options by pretending this moves. So for example, right now with spot price at 43, these are right at the money. Right, they're right here. If this pretend this moved a dollar and instead of this being 43, this is now 44, if this moves to 44, now our 44 options",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "by pretending this moves. So for example, right now with spot price at 43, these are right at the money. Right, they're right here. If this pretend this moved a dollar and instead of this being 43, this is now 44, if this moves to 44, now our 44 options would be at the money, which is what this is. These strikes that are colored like this, it means they're right at the money. And technically it's 44 or three. Because we're starting from 43 or three. So I'm just mentally moving the price of the underlying with whatever I want to check. In this case, it's 1 from 43 or three to 44 or three to see what my options would look like. So it means that my 44s would look like these 43s. And then I'm calculating what the loss would look like on those assuming these would be about 84 cents. And then we would sell these for about 37 cents. So it gives us 47 in unrealized loss at the time. So that's the start of the position. So now we know 47 is way too little. We need to definitely take more risk than that. So then if we do like a five lot or something like that, we would take our 47 times five, gives us 235 in risk, still super, super light. So we can take even more. So now we're at 470 in risk at a 10 lot. Again, ish. So then",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "So then if we do like a five lot or something like that, we would take our 47 times five, gives us 235 in risk, still super, super light. So we can take even more. So now we're at 470 in risk at a 10 lot. Again, ish. So then what I would do is actually go over to these 42s, sell some of these, maybe five of those. And then on the put side, where would I want to get stopped out? Probably below here. So like 42. I would call it like sub 42. So again, like a dollar to the other side. So then my 42s would look like the 43s, which is like a 20 cent variance, something like that. So then be like another hundred bucks a little, a little more than that. So then the total at risk here is still under 1,000 essentially. So then if we launch this trade, we would be taking in 610 bucks. So for me, this would be the first piece that would be added to the portfolio puzzle. Now it's super unlikely that that will get filled because it's a weird order and it's paper trade, but just to give you an idea. So that's the first trade. And I would go and find more until I'm able to hit my threshold of 1250 in profit. Now the caveat here is if I plan on managing these, I need to bake that into my plan. So for",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "just to give you an idea. So that's the first trade. And I would go and find more until I'm able to hit my threshold of 1250 in profit. Now the caveat here is if I plan on managing these, I need to bake that into my plan. So for example, let's say on this one trade, I took in 1,250 in credit. But if I'm planning on managing it at 60 max profit, well, it's still not 1250 on the month. I would need to do something else because even though I took into 1250 upfront on this trade, I know I'm going to manage it based on my plan. So I need to be ready to put on something else or put on other things in conjunction with it at the same time. So this is the idea here on how I start building a portfolio. So I'll take a pause here and see if that makes sense. If you guys have any questions, and then this is also the perfect time. If you have any other questions related to portfolio, options trading, something else that you're working on that you're interested in getting some feedback. Now is the perfect time for general broad questions about trading or whatever else. But if you have any specifics on this, happy to dive into it. Neon says, I sell a call by a call 1 higher, collect 3 credit. Yeah, it's not right. So that's why it's a credit spread",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "the perfect time for general broad questions about trading or whatever else. But if you have any specifics on this, happy to dive into it. Neon says, I sell a call by a call 1 higher, collect 3 credit. Yeah, it's not right. So that's why it's a credit spread and not a debit spread. Neon, Nathan is trying to help you, dog. I would be nice to Nathan because Nathan is trying to help you reason through your position because it's like what you're describing is completely wrong. So again, let's look at spy. Like we can look at an example together right now. This is using today's market. So we can go out to any any expiration. So in this case, 35 DTE. If I sell any option, it doesn't matter if it's at the money, in the money, around the money, none of it matters. I sell any option at a dollar wide. So if I do these 58s, 59s, I sell the money. So these 785s, and then I buy these 559s. This is a credit spread. I get 55 cents. That's not 3. What you're talking about is literally an impossibility. You cannot make more money than the width of the spreads. So if you tell me of a dollar wide spread, you cannot make more than 1 on the spread. Otherwise, it's an arbitrage opportunity. I would be picking those up in droves. I would sell my house to do more of them. It's",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "money than the width of the spreads. So if you tell me of a dollar wide spread, you cannot make more than 1 on the spread. Otherwise, it's an arbitrage opportunity. I would be picking those up in droves. I would sell my house to do more of them. It's not a thing. So my guess is you're making a mistake somewhere. I don't know where. But the way that you're talking about it is completely inaccurate. There's, yeah, there's just a mistake somewhere. I just can't tell you where, but I can tell you what's wrong. So yeah, that's that. Big A says, so if we needed money down the road to adjust the speculative, would we take it from the core? I would, that would be baked into the plan ahead of time for me. No. For me, the way that that would work is I would go through the standard sizing for the core and the speculative allocation as I always do. So for example, on that, on that speculative trade, I would decide before I put it up, how much money it gets. And then that's what it gets. So let's say, for example, in that case, I don't even know what that would have taken to put on. But let's say that the margin requirement was a thousand dollars to put on that trade or again, whatever it was. So if I allocate mentally 3,000 to the trade, but I'm only using 1,000 to put",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "case, I don't even know what that would have taken to put on. But let's say that the margin requirement was a thousand dollars to put on that trade or again, whatever it was. So if I allocate mentally 3,000 to the trade, but I'm only using 1,000 to put it on up front, then that leaves me 2,000 to mess with that trade a little bit more. And that 2,000 belongs to that trade. Inverse scenarios, let's say I allocate 1,000 to that trade, and that's the margin requirement to put the trade on. One, you're not giving it quite enough because the margin requirement is likely to move. But that means that there's nothing to add to it. So for me, in that kind of position, there's no management actually. It's just, does it hit one of my stops, yes or no? And if it does, then I get out. I wouldn't try to start rolling shit. I wouldn't try to complicate it like that personally because that's how you start tying up a bunch of money trying to defend a trade that's not working well. And then you have nothing to show for it after a few months. You might be able to get out of your trade for a scratch. But now we're really far behind on hitting our 2,50 target. So yeah, for me, that specific trade that we were outlining, I wouldn't sit there and try to adjust it. The trade would be whatever",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "months. You might be able to get out of your trade for a scratch. But now we're really far behind on hitting our 2,50 target. So yeah, for me, that specific trade that we were outlining, I wouldn't sit there and try to adjust it. The trade would be whatever it is. Either I'm correct and price stays generally within that band or goes down, which I would still make money. Or I'm wrong and it goes up and then I lose and then I move on to something else. That is just how it goes. So yeah, it's a good question. But the short answer to it is I would very, very much define it ahead of time. I think that that's super important. So I realized that the color of these is way too similar. It's very difficult to tell the difference. There we go. That's better. Big Ace, let me know if that answers your question. But that's the general idea. Dr. Zayah says, can you explain the Analyze tab and toss like I'm fine. I look at the graph and my brain shuts down. Yeah, let's do it for sure. I would love to. I think the Analyze tab is actually a really, really great tool. So what aspect of the Analyze tab are we talking about? And Dr. Zayah, give me something that you want to actually analyze. Like is there a specific trade that you're looking at that's hard to understand or what component",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "the Analyze tab is actually a really, really great tool. So what aspect of the Analyze tab are we talking about? And Dr. Zayah, give me something that you want to actually analyze. Like is there a specific trade that you're looking at that's hard to understand or what component of the Analyze tab? Coming down. All right, we good. If not, I can just come up with a general example if you'd like. Basically, how to read it, especially in a multi-leg strategy. Yeah, for sure. We can we can take care of that. No worries. Let's take a look. He says I click on builder, call credit spread, dollar, go up to 3 and turn on my contracts. Yeah, but I mean, that's not what it is, man. So I cannot say at all what you're doing, but it's not that. So just be super careful. I again, I'm not even going into this to try to like get you or to try to make you feel any type of way. It's literally to try to help you because I can like, again, I can just tell you there's something wrong with that. I don't know what because I don't have the position on myself and I'm not actually positive that you're explaining it exactly correctly. And again, that's not a dig at you, but I'm just saying based on the details you're giving me, it's something's wrong. And that's the problem with options is that that kind",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "I don't have the position on myself and I'm not actually positive that you're explaining it exactly correctly. And again, that's not a dig at you, but I'm just saying based on the details you're giving me, it's something's wrong. And that's the problem with options is that that kind of stuff happens literally all the time with people. So it is super difficult and it's easy to mess up. So yeah, just be careful. Waldo, I love you too, man. Thanks for coming to hang out. I'm glad that the channel is useful. That's exactly what we love to hear. All right, so let's take a look for Dr. Zayus about the analyze tab. Let's come up with a perspective trade. So let's take a look at spy. Well, actually, let's pretend we're building a trade for that same portfolio, but now we'll do it with like live stuff. I literally just took a trade down and cheat TGTX today that I would run again. Upstart looks good. Let's see how upstart looks. Yeah, I like upstart here a lot. So let's do, let's do something like 34 is this stop. I mean, this would be a better stop like 32. So this will get an alert at or below. And then we'll build a trade still bullish positioning for sure. And let's take a look at like these 63s. We want to trade it to the upside so we can take these are 20 wide. These are pretty",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "like 32. So this will get an alert at or below. And then we'll build a trade still bullish positioning for sure. And let's take a look at like these 63s. We want to trade it to the upside so we can take these are 20 wide. These are pretty narrow. These 35s. So we can grab these for like 685 685 bucks. We'll go to the analyze. 685. We need to use a little bit more money here. We need to add a couple more of these. What I'm doing is I'm creating. I'm creating a view for us to look at how this behaves at different price points. So what I like to do is I like to use standard deviations. So I'll do plus one standard deviation plus two standard deviation plus three. Then it will be spot price. Then I'll do minus one minus two minus three. And then you'll notice that there's two more down here that are just blank. That's so I can type in specific numbers that I think specifically normally my stops. So in this case, my stop would be probably like 32 or like 31 98 or just below that essentially. So if we go to here and I type in something like 31 90. So this trade would lose 15 77 to the downside here. So we can now grab our handy dandy Excel sheet and do our math. So in this case, we're risking 15 77. And then the",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "So if we go to here and I type in something like 31 90. So this trade would lose 15 77 to the downside here. So we can now grab our handy dandy Excel sheet and do our math. So in this case, we're risking 15 77. And then the probability of hitting 31 90. In our time frame, which is probably like 30 days ish. Probability of hitting 31 90 is like 45. So we'll give that a 45 probability of happening. And then to the upside, let's see what our near term target is. We got two years looks like consolidation. It's like literally in the congestion zone. But this is where this is where the next volume note is. Right there at 44 34. So then we go back in here. We go back in here. This one gets 44 34. And we would make three grand if it hits 44 34. What's the probability of us hitting 44 34. Like 38. So 38 and we would make 30 65 positively expectant trade. So this is good risk. So now let's talk about how we analyze this for a doctor. Zayas. So your y axis here is just PNL. So anything above this line here is positive below is negative. Then your x axis is the price of the underlying. I actually literally might make a video about this really quick. Because I've gotten more questions on this like how to read the analyze tab and think",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "just PNL. So anything above this line here is positive below is negative. Then your x axis is the price of the underlying. I actually literally might make a video about this really quick. Because I've gotten more questions on this like how to read the analyze tab and think or swim. Actually, let me take a note. Literally as soon as we wrap up. I'll make a video on how to do this. Because I think it would be useful for people and I actually get asked it relatively frequently. The reading analyzed. So this is still single leg trade. So for your example, I would then maybe sell some options here. So like maybe these maybe these sell like two of those. Maybe three. Yeah, that's cool. Then we'll zoom this in. So the reason why there's two lines is because there are options. They have a value today and they have a value at expiration. You see these dates down here in the corner. So the purple line is showing you today's date. The blue line is showing you the value of the option at expiration. So you'll see if I click this button down here and change the time. So like right here, I'm fast forwarding time. Do you notice how essentially these lines converge on one another until we get into the expiration for the short options? So that's why there's two lines. It's showing you two different periods in time. And then this is",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "change the time. So like right here, I'm fast forwarding time. Do you notice how essentially these lines converge on one another until we get into the expiration for the short options? So that's why there's two lines. It's showing you two different periods in time. And then this is just showing you the PNL of the position. And then the probability analysis gives you the ability to analyze the probability of things hitting this is using option prices to see the probability of hitting different points. So that's what this is showing you. The probability of hitting these different points. So plus three plus two plus one zero one two three standard deviations. That's what all these are. And it's letting you know the probability of hitting those within different time frames. So that it's easier to understand. That's actually why I like to use probability of touch. A big mistake here is people use probability of in the money. And then they'll get way more favorable probabilities. But if you're trading things based on stops. It's not about in the money. It's about what's the probability of touching in that time frame, which is what this looks at. So yeah, I'll make a video about this literally soon as we wrap up here. So you guys have it. Anything else you guys want to cover any last calls, any remaining lingering questions we want to dive into. And while we're thinking about that, I'm just going to open",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "So yeah, I'll make a video about this literally soon as we wrap up here. So you guys have it. Anything else you guys want to cover any last calls, any remaining lingering questions we want to dive into. And while we're thinking about that, I'm just going to open the door from a pup. Cool. Look and quiet out there. So the game plan going forward for these sessions is going to be less prescriptive now. So we've gotten through 10 sessions here. My goal is for the future sessions. I'm going to continue Fridays being specific for like options trading for beginners, but it will be much more ad hoc based on whatever you guys want to talk about. So it'll be really important for me to get feedback from you all. And whenever I'm making the post about the session to hear like what you guys want to cover so that we have a good agenda for the sessions, but it will be much more open-ended and it'll be still very, very geared towards beginners. So that wraps me up for today. As always, what if you guys need to just let me know. I will see you guys at the GME live stream tomorrow. And then for the outlier pro members, we have our next live stream on Sunday. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  },
  {
    "text": "you guys at the GME live stream tomorrow. And then for the outlier pro members, we have our next live stream on Sunday. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "vDyL0Aff0gk",
      "title": "Building an Options Portfolio | Options Trading for Beginners Pt10",
      "url": "https://www.youtube.com/watch?v=vDyL0Aff0gk",
      "upload_date": "",
      "duration": 5724.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 77,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vDyL0Aff0gk&t=0"
    }
  }
]