[
  {
    "text": "For those wondering, what kind of impacts the Trump tariffs might have on the broader market, you could take a look at a recent study by Goldman Sachs. And they explore a few different worlds based on what they think the total impacts might have in their expecting a cut in SP 500 index earnings by about 2 to 3. So some near term impact, but not necessarily massive. An important thing to pay attention to from a trader's lens is the vacuums that get created in the market that eventually get filled by different parties. That is a highly tradable idea. So make sure that as you're digesting all the information that's happening right now that you're always bringing it back to what's the trade opportunity. You know, I'll ask you a letter.",
    "metadata": {
      "video_id": "Vi9Cp6UvytQ",
      "title": "Tariff impacts to markets",
      "url": "https://www.youtube.com/watch?v=Vi9Cp6UvytQ",
      "upload_date": "2025-04-17T16:30:11Z",
      "duration": "PT49S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, direct Q&A, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=Vi9Cp6UvytQ&t=0"
    }
  }
]