[
  {
    "text": "What's up, everyone? Welcome back to the LR podcast. I have Jared here today to essentially let everybody know how messed up we all are in the head. I'm sure you have no shortage of insights into that side of the world. But before we get into talking about the psychology of trading, kind of the correlations that you found between different things like I seek off clubs. I know that there's some betting side of the stuff trading side. There's a lot of different ways to talk about like the mindset and the human psyche, which interestingly enough, Marines were not really the smartest group around, but we actually are pretty introspective. We like to spend a lot of time understanding what makes us tick. So I'm actually really, really eager to chat with you. So first, thanks for coming to hang out for a little bit. Yeah, happy to be here, man. Good to chat about this stuff. I know it's important for a lot of people that sometimes don't always have a framework to understand it well. People say, well, and that's actually a great starting point to be honest, because before we get into your background, we'll just kind of jump right in. One of the things I find so interesting is for newer traders, when you hear people talk about like trading psychology, it sounds like the hogwash. It sounds like just this random stuff that's in the ether around the world of trading. And",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "we'll just kind of jump right in. One of the things I find so interesting is for newer traders, when you hear people talk about like trading psychology, it sounds like the hogwash. It sounds like just this random stuff that's in the ether around the world of trading. And then once you trade for a while, you realize like at least in my opinion, there's no amount of psychology that will inherently create edge. You have to have some sort of system that is profitable, but you could have a very profitable system. And if you don't have the correct psychological constitution to execute it, good as it. So I actually wanted to talk to you about that. What comes first, the chicken or the egg, the edge of the psychology? The edge. 100. I mean, like military training, I mean, I know it offhand, not directly. They're training you to thrive in situations where you might die. And so the standard for that training is really, really high. So that your emotions are not going to do something that's going to get you killed. But I'm sure there's plenty of situations where that's not feasible. And somebody gets injured and so trading is no different. Like the training though often happens in the live market. There isn't really a good simulator that can actually help to inoculate you to that environment. So early on, traders are just kind of feeling their way around. Meanwhile, there's just a huge",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "injured and so trading is no different. Like the training though often happens in the live market. There isn't really a good simulator that can actually help to inoculate you to that environment. So early on, traders are just kind of feeling their way around. Meanwhile, there's just a huge swings in their emotions. But those huge swings in emotions, I think are largely to do with the fact that they have no idea what they're doing. And so you really need to have a very robust strategy. It does not have to be wildly profitable yet. But you have to have something that you can kind of anchor yourself to in order to then be able to tease out. Where are my emotions actually affecting my execution? Because when you are too new and don't have that, then it's easy to get sort of swept up in the frustration from losing. But like that frustration might be because you don't know what the F you're doing. And the fear might be because you don't know what the F you're doing. And so to not have a lot of confidence in is correct to get overconfident and think you know what you're doing is going to be really, really damaging. So the humility to be able to say, I need to establish a clear understanding of what I'm doing technically, strategically first is really, really important. There's definitely people in this space who say that trading is all about psychology",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "what you're doing is going to be really, really damaging. So the humility to be able to say, I need to establish a clear understanding of what I'm doing technically, strategically first is really, really important. There's definitely people in this space who say that trading is all about psychology and they are absolutely full of shit. There's no amount of tactics that can be replaced. There's no amount of mentality that can be replaced from poor tactics. I mean, the mentality, the mental game can only help to bring out what you know, it can't create it. What a great way to frame it. And you mentioned another thing there to dovetail off of it slightly. And you mentioned like this level of like overconfidence at some point. I've always been really interested in just research. I just enjoy reading different kind of stuff. You can find off of SSRN. There's a great paper that's called the behavior of individual investors. Anybody that's familiar with my work will know. I've cited that a million times. I think everybody should read it. One of the things they talk about in there is the Dunning-Cruelver effect. And I'm sure you're familiar with that. When there's this really interesting thing though, where I feel like people can be familiar with the Dunning-Cruelver effect, but I don't think familiarity with it stops people from still falling over that same edge. Do you think that there's some method for traders that, and for those",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "with that. When there's this really interesting thing though, where I feel like people can be familiar with the Dunning-Cruelver effect, but I don't think familiarity with it stops people from still falling over that same edge. Do you think that there's some method for traders that, and for those unfamiliar, well, maybe you could talk a little about the Dunning-Cruelver effect first in your lens, and then we can move on to the second part. Yeah. So, Dunning-Cruelver effect has two sides. One is that you don't even know what you don't know. And so as a result, you become overconfident. And I would classify these people in the American Idol contestants who have no concept of what a weak level singing looks like. And so they've kind of been in this bubble. They've gotten all the positive feedback because people need to get positive feedback. It need to have that belief in all those affirmations, yada yada yada, well, they're, you know, delusional. They do not have the skill to be able to properly determine where they rank. And so they naturally become overconfident. And interestingly enough, there's also a lot of research that describes how prevalent overconfidence is in Western society. And I don't mean that it's not, doesn't exist in in Eastern cultures as well. It's just, it's been researched more here. And so, you know, around 70 of people rate themselves as having above average intelligence, above average sense of humor, level of attractiveness. So,",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "is in Western society. And I don't mean that it's not, doesn't exist in in Eastern cultures as well. It's just, it's been researched more here. And so, you know, around 70 of people rate themselves as having above average intelligence, above average sense of humor, level of attractiveness. So, you know, and that doesn't account for the people who are on the other side of the Dunning-Furrier effect, which is those who are undervaluing what they bring to the table. So it might not be 20 of people overconfident. It might be even higher than that. So, yeah, the other side of the Dunning-Furrier effect is people who have a ton of skill, who end up having lower confidence because they falsely assume that everybody else knows what they know and what they have is just not that worthwhile. So what this really helps to show us is that confidence is not causal, right? Being confident for the sake of being confident, you know, could actually be quite dangerous. Because I have clients who, you know, are new and they objectively have more confidence than some of my other clients who have been doing this for 30 years. And that should not be. I mean, there's not a single chance in the world that if I was asked who I would bet on, making more money in 2025, that I would bet on the two-year newer trader. So confidence is not causal. And we're really looking at kind of",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "that should not be. I mean, there's not a single chance in the world that if I was asked who I would bet on, making more money in 2025, that I would bet on the two-year newer trader. So confidence is not causal. And we're really looking at kind of the underpinnings of your competency because that is ideally what should align your confidence. Super interesting. And obviously, you've spent a lot of time both. You've written a couple books, analyzing a lot of the psychology of trading. And you obviously have your client base. So you have a good sample of people that you've looked at. One of the things that I've always found so interesting is that there's this effect. It's obviously so obvious, but I just, I can't understand a way around it. The effect is if you are talking to that two-year trader and you're explaining to them, the stove is hot. If you touch the stove, you're going to burn yourself. And yet there are still, there's that compulsion to like have to touch the stove. Like you can't just take it second hand from somebody. Like what is that? And is there a way to coach people so that you actually can effectively learn lessons, you know, second hand without having to touch everything yourself? Yeah, I mean, some people are just experiential learners. And I would put myself in that category. If I'm going to learn a concept, I need to have kind",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "to coach people so that you actually can effectively learn lessons, you know, second hand without having to touch everything yourself? Yeah, I mean, some people are just experiential learners. And I would put myself in that category. If I'm going to learn a concept, I need to have kind of some experience to really be able to kind of anchor that concept to. So I can kind of learn it first, but very quickly, my mind is going to kind of start to wander and not really be that interested in like reading more concept. Like I need to just go experience it. And I need to go touch that stove. In trading, you can touch the stove. Make sure it's not like burning hot. It's actually going to like, you know, create, you know, six degree burns. You can scale down this thing so you can gain experience at very, very low cost and very, very low pain. But like gives you the ability to kind of stick your hand on the water and feel around and get a sense of it, gain some experience. So yeah, there are some people that just, you just cannot learn everything from the sidelines. You can gain concepts, you can gain wisdom, experience, gain knowledge from other people's experience. But then you have to again go and start to translate it for yourself. And then ultimately developing your own fingerprint, your own style as a trader. So yeah, some of it",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "from the sidelines. You can gain concepts, you can gain wisdom, experience, gain knowledge from other people's experience. But then you have to again go and start to translate it for yourself. And then ultimately developing your own fingerprint, your own style as a trader. So yeah, some of it is just that. But I think maybe more to your question is the people that have already started to put their hand on the stove and they themselves feel the heat. And they get burned. But then they keep doing it again. And that is a bit more complicated. Now we're getting into, you know, more of the kind of the underlying drivers with which compels us to do things. So for example, a lot of traders get into this enterprise or I should say a lot of people, they're not traders yet. A lot of people get into this enterprise looking to make money quickly, looking to make easy money, thinking that they can, you know, they see stuff on Instagram elsewhere, you know, driving lambos and beach houses and finer on the world and yadda, well, I want that to. And truly, they're no different than somebody who is, you know, going to buy a power ball ticket. But they are convincing themselves that it's, you know, more of a skill, which it is, but they're not actually interested in acquiring the skill. So, you know, where this is going to show up mostly and then just kind",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "is, you know, going to buy a power ball ticket. But they are convincing themselves that it's, you know, more of a skill, which it is, but they're not actually interested in acquiring the skill. So, you know, where this is going to show up mostly and then just kind of continuing to touch that fire, it's, you know, phoma, but something's ripping, you know, don't get in unless you have like a viable setup. And if you missed it, like, all right, it sucks. Stay out, hold your capital and wait for another opportunity that's going to present itself. Like, well, no, I want to make money quickly and easily. This seems like an opportunity to do that. And that compulsion, right, to objectively, you and I might say, well, you're actually sticking your hand right on that stove again. To them, they're blinded by that desire to make money quickly and easily. And that blocks out any perception in the moment that there is any, any danger, right, to them. It's just like, no, no, this, this still goes gold. Like, I have to put it up my hand on it in order to grab something. So that, that's just like one example of where, you know, those underlying flaws bias is wishes illusions can compel us to do some dumb things. So what got you interested in like the psychological element of the world, really? Because again, like we were talking about in the beginning, it's not",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "that's just like one example of where, you know, those underlying flaws bias is wishes illusions can compel us to do some dumb things. So what got you interested in like the psychological element of the world, really? Because again, like we were talking about in the beginning, it's not really relegated to just trading. You have actually a pretty varied background. Yeah, I've worked with golfers and poker players and, you know, professional gamblers, sports betters, eSport athletes, pool players, radiologists, lawyers, doctors, you know, business people. So it is like the psychology of performance. And what got you interested in it was like my own mental hangups trying to, you know, play professionally as a golfer. 97 tried to qualify for the US Open played amazingly well T-Degrean. Now the US Open has two, two, you know, kind of rounds of qualifying. This is the first round. So it's not like I'm, you know, I was like on the doorstep to actually playing in the open, but, you know, at 18, like I was close to, and that second stage, like you're playing with PGA tour players. Like this is, this is real. And, you know, I missed a bunch of putts, you know, of this line where, you know, putting it was my weakness, but, you know, the pressure really kind of got to me. And that was the first time that I'd ever played an event of that magnitude. I'd gotten good very, very quickly. Having",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "a bunch of putts, you know, of this line where, you know, putting it was my weakness, but, you know, the pressure really kind of got to me. And that was the first time that I'd ever played an event of that magnitude. I'd gotten good very, very quickly. Having been, you know, a baseball player, a tennis player, and, you know, kind of chose golf because I was 4-11 as a freshman in high school and, you know, figured it my, my prospects of playing professionally in that sport was going to be a little bit higher than baseball and tennis. So I just kind of dove into it. We got a good, really quickly. And then, you know, suddenly you have it as position where it's like, wow, you're like, you're on the doorstep of living a dream. And, you know, basically just kind of put them on my shoes. So it had, again, it happens once, like it's not that big a deal, but then in the, in the USM qualifier way to that year, same thing happens, like just play it awful. And now, you know, the kind of pattern starts to take hold. And I, you know, just like dove into golf psychology, read a bunch of books and trying to find answers to this issue. And generally speaking, my performance continued to elevate. Now, I was, this was like the summer after my freshman year of college. And I had one, two events at",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "you know, just like dove into golf psychology, read a bunch of books and trying to find answers to this issue. And generally speaking, my performance continued to elevate. Now, I was, this was like the summer after my freshman year of college. And I had one, two events at freshman year and, you know, one, a few more of the following year. And was an all-american in Division III, continuing to get better except, you know, when I would step out and play in some of these big, you know, events that were more aligned with my longer-term dreams. And so at that point, you know, it's like, all right, well, I'm not one to get just kind of, like, you know, try something. I wasn't going to turn professional without really feeling like I had an answer to this. And so I decided actually to derail my aspirations at that point and go and get a master's degree in counseling psychology. What I reasoned was missing from the sort of sports psychology, golf psychology equation at that point was an understanding of the causality. A lot of what I was reading, a lot of what was being expressed was very kind of behavioral in nature, meaning, like, you're feeling too much pressure. We're going to teach you to relax. You're not feeling confident enough. We're going to boost your confidence. You're getting angry when you get to calm down. It was, to me, kind of, ones and zeros.",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "was very kind of behavioral in nature, meaning, like, you're feeling too much pressure. We're going to teach you to relax. You're not feeling confident enough. We're going to boost your confidence. You're getting angry when you get to calm down. It was, to me, kind of, ones and zeros. And as I said, it worked, but not under the most intense pressure, heat, and stress, where any weakness is going to get magnified and ultimately affect you. But therapists, right, their job is to dive deep and to problem solve at very personal levels. And, you know, at the time I was thinking, maybe this was personal, what I've come to find out, find out is it's not always personal. It's more of these performance flaws, biases, wishes, illusions, how we're perceiving ourselves, our skill sets, the environment, our competitors, et cetera, those misperceptions, the flaws in which we're sort of seeing, you know, all of those factors ultimately create the emotional volatility. Now, yes, there can be personal issues that are, you know, that can be part of the equation there. It doesn't have to be. So I get my master's degree from Northeastern, you know, spend two years getting licensed as a therapist. And then as soon as that happens, you know, July 20th, 2005, I basically now like beginning to kind of incorporate my system or begin to build my system, which is combining those two things. And I moved Arizona, start working with golfers at",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "years getting licensed as a therapist. And then as soon as that happens, you know, July 20th, 2005, I basically now like beginning to kind of incorporate my system or begin to build my system, which is combining those two things. And I moved Arizona, start working with golfers at a local club and start building up a roster, worked with a gal who, you know, won on the LPGA tour, a few other professionals, some other good junior players. But ultimately, I kind of found traction in professional poker. There was a big enough base of people who understood that if they were not sharp, they were going to lose money. And, you know, golfers have a way of kind of convincing themselves that, you know, that it's more about, you know, hitting the range and hitting the punting green and working on their technique, which again, we talked about is important. But ultimately, when, you know, there's enough impairing your judgment is it's not just about that anymore. So, you know, started building up a big roster of clients in poker, wrote a book in 2011, that's a good poker. And in 2013, shortly after my second poker book came out, traders started picking up the first one, saying, you know, if you change the word poker to trading, it all went the same stuff. So I start building up a roster of traders and, you know, the land and institutional quiet where I'm flying in person, working",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "book came out, traders started picking up the first one, saying, you know, if you change the word poker to trading, it all went the same stuff. So I start building up a roster of traders and, you know, the land and institutional quiet where I'm flying in person, working with 40 of their traders over the course of four or five days and doing sessions all day and, you know, really kind of diving into that and, you know, start building up a roster of retail traders and, you know, independent people and some other opportunities along those lines. Landed gig with team liquid, which is one of the largest esport teams organizations in the working with the Dota teams and Counter-Strike teams. And again, environments, what I'm not, you know, an expert in golf is my, you know, primary of expertise, air of expertise, but I translated what I did there into poker, into trading, into esports, you know, and then into other areas. And, you know, in doing that have really kind of honed my system, you know, over all these years. And yeah, it applies in every environment. There's obviously unique applications, but at the end of the day, it comes down to, you know, us being human beings and, you know, we're just not that unique. We're not that special. At this point, you know, there's just not a lot of novelty in the underlying causality of what I see. There's a lot of variety",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "of the day, it comes down to, you know, us being human beings and, you know, we're just not that unique. We're not that special. At this point, you know, there's just not a lot of novelty in the underlying causality of what I see. There's a lot of variety and uniqueness of the people that I work with and the way that they experience those problems. But at the end of the day, it's just not that unique. We're not that special. Right. And obviously, you still have clubs to swing around. So how did golf end up going for you? 2007. This is sort of an interesting kind of note. Like I firmly kind of solved my issues at that point was playing some of the best golf in my life. So we're playing some mini tour events, you know, kind of the minor leagues of golf. And, you know, not doing terribly great, but like started to see some signs that like, okay, you know, I'm ready to kind of give this a go. You know, you kind of estimated that point. It's about, you know, 250 grand over three years of, you know, travel expenses, training, etc. to really make it worthwhile. Obviously a big expense didn't have the capital. Probably could go find it. But poker is like ripping. Like things are taken off. It's like, okay, you know, here's the fork in the road. I could take a risk on myself or I could",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "etc. to really make it worthwhile. Obviously a big expense didn't have the capital. Probably could go find it. But poker is like ripping. Like things are taken off. It's like, okay, you know, here's the fork in the road. I could take a risk on myself or I could continue to kind of go down this path and see, you know, and maybe I'll have another opportunity. Because truly like at that point, like poker was the safer bet. So, you know, I still played at a high level, you know, even more recently, this is, you know, now 20 years later. And truly what I've kind of come to is I love the game. But I'm incredibly happy with the coaching practice that I've developed and the work that I do. And yeah, I think I would not be as as fulfilled as a person if I was a professional golfer. I'm certain I'd be happy. I'm not saying that I wouldn't be happy, you know, having to live out a dream. But, you know, the road that's taken me here is uncovered aspects of my character, my personality, my ultimately my intelligence that I just never would have found otherwise. It turns out I was dyslexic. Didn't know that as a kid. You know, didn't really know it till I was in my 30s, which explains why, you know, education was challenging. Frankly, even now golf was challenging. I'm not saying that was the cause of my",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "have found otherwise. It turns out I was dyslexic. Didn't know that as a kid. You know, didn't really know it till I was in my 30s, which explains why, you know, education was challenging. Frankly, even now golf was challenging. I'm not saying that was the cause of my pressure, but certainly the way in which I made decisions out there was a little bit affected. So having, you know, uncovered a lot about myself, you know, through this has really been, I think a big source of what validates and fulfills me today, because I work at my own everyday coaching as now my primary area of performance. And I take my work incredibly seriously and, you know, want to be the best I can be with it. Yeah, that's super cool. It's, it's also really interesting to find, you know, the original idea of what we think the journey is going to look like and then kind of accepting the pivots as they come reminds me of I'm really big into martial arts and Jesus, you know, obviously part of that game. And there was a famous teacher, John Danahar. And he's very similar to this where he's not like personally had a massive jujitsu level career. He's successful, but he's not like some sort of renowned jujitsu player, anything like that, but he the people that he coached now are essentially the best in the world. So he definitely, it sounds similar to you like found",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "he's not like personally had a massive jujitsu level career. He's successful, but he's not like some sort of renowned jujitsu player, anything like that, but he the people that he coached now are essentially the best in the world. So he definitely, it sounds similar to you like found his calling. He found the thing where he really enjoys it, which is it's just always cool, you know, to see that match up with people. Totally. And I just wait, like, you know, sometimes, you know, the criticisms of people in my, you know, spot or, you know, like the guy that you're just mentioning, you know, it's like those who can't teach. But the reality is that those that do those that do oftentimes can't teach, right? Tiger Woods is an awful golf coach. He would be a terrible coach to most, most golfers. Right. Just be better. Oh, thanks. Yeah. He's good. He's good with other professionals because they kind of talk the same language. But when there's a huge skill gap, he's not capable of really like filling it. So yeah, it like kind of takes somebody. And I think what I've been able to bring to poker and trading, you know, specifically is like almost like an anthropologist, sociologist, kind of perspective where I've really like researched, you know, the way in which traders talk and experience these issues. And, you know, ideally kind of reflecting back to you, you know, where some of the",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "to poker and trading, you know, specifically is like almost like an anthropologist, sociologist, kind of perspective where I've really like researched, you know, the way in which traders talk and experience these issues. And, you know, ideally kind of reflecting back to you, you know, where some of the big holes are. And I'll just throw one example out here and I'll kind of turn the tip back to you. Like with FOMO. FOMO is an awful term because it's really, really imprecise. People talk about it like it's a problem. But, you know, if you went to the doctor and the doctor said, you know, we weren't feeling well and something was wrong. You know, it's clearly something was wrong. And he said, you know what, Eric, you're sick. Like, what, what does that mean? Like, you're sick. You know, just go home and get well. I mean, obviously that would be a horrendous doctor. You'd never go back to again. Right. Right. When a lot of traders say that they have FOMO, they're effectively saying the same thing. It's so imprecise that you're not really able to correct it. Right. Once you start to peel back the layers and understand that, you know, anger and overconfidence and alacacolifidence and fear can all produce FOMO, then we got, we've got it, you know, an avanous for being able to dissect it in how you experience it because that is what matters to being able to correct it. So",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "layers and understand that, you know, anger and overconfidence and alacacolifidence and fear can all produce FOMO, then we got, we've got it, you know, an avanous for being able to dissect it in how you experience it because that is what matters to being able to correct it. So things like that, even like greed, I mean greed. Your job is to make money. Like, is, is Tigerwood was Tigerwood's greedy because he wanted to win, you know, every major championship and every tournament and practically did like, oh, we, we, of course, he praised and it like Patrick Mahomes was not greedy trying to win a third Super Bowl on a row. Right. Didn't do it, but that doesn't make him greedy. So you're not greedy when you try to make more money. You're greedy when the execution of your tactics, go beyond what you know is sound. Right. When Patrick tries to make an aggressive throw into traffic, like, maybe we could say he was a little bit greedy early on. I'm not, again, it's to him, it's for him to decide. Right. Armchair quarterbacks, not really that great analysis, but the point is like, the greed is a determination based off of where your strategy got excessive. Not based off of some, you know, like overarching idea that is bad. Right. Traders make, you know, your job is to make money. That's the same thing as Tiger or Patrick trying to win championships. It's so funny",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "is a determination based off of where your strategy got excessive. Not based off of some, you know, like overarching idea that is bad. Right. Traders make, you know, your job is to make money. That's the same thing as Tiger or Patrick trying to win championships. It's so funny that you pivoted to greed because I literally wrote it down in my notebook to mention that one next. And it's because the funniest thing I find about greed is a lot of traders. I don't think it's actually the correct terminology, but I always call it like false attribution where they'll say, oh, I, you know, I got greedy so blank happened. And to your exact point, I always think of it from the perspective of, okay, yeah, there might be an element of that. But what about like, where was the presence of a plan of like an actual profit management point, loss management point, like these things that are typically predefined before you enter a trade, that kind of just sort circuits the greed. It doesn't matter necessarily if it's there. If you already have these areas pointed, the main thing is just to echo your broader point, where it's like, I feel like a lot of times people arrive at like these superficial answers that they think sound smart and self, you know, revealing, but really it's still just like the very tip of the iceberg. So to turn that. And a lot of times that",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "point, where it's like, I feel like a lot of times people arrive at like these superficial answers that they think sound smart and self, you know, revealing, but really it's still just like the very tip of the iceberg. So to turn that. And a lot of times that happens because people can't tolerate uncertainty. To say, I don't know why this happened is way harder to tolerate because like, you'd rather know something, rather than patch yourself to a false idea for the sake of not feeling unsure. And frankly, like, if you're unsure of something, that means you're, you're in a position where you actually can learn. Again, it goes back to that false confidence, right? If you're one of those people who are overconfident, in this case, overconfident, you're voted to dissect and diagnose your trading issues, well, then you're going to be in a position where you're never uncertain, which means you're never going to learn. What an interesting point. It just kind of becomes this vicious cycle that feeds on itself, which is the follow up. Yeah, the follow up I wanted to ask you there, which is so I feel like traders go through this series where they get to the point where they feel like they're self identifying these issues, right? Like I'm greedy. And that's what caused this to go bad. But obviously as we're talking about a lot of times, that's actually quite superficial. What are some methods that you",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "through this series where they get to the point where they feel like they're self identifying these issues, right? Like I'm greedy. And that's what caused this to go bad. But obviously as we're talking about a lot of times, that's actually quite superficial. What are some methods that you use to help traders move past that superficial top level analysis into the actual positive attribution of like, what's the feeding forces that are leading to this behavior? Yeah, so I'd say easiest way to do that is what I call a data collection worksheet. Free of freely available on my website, geratandler.com, backslashworksheets. But the basic ideas are pretty basic. So you're identifying in real time around your trading mistakes, the triggers for that what you think is greed or at least your emotions, the thoughts that you have in that moment, whether they're in your head or things you say out loud, you know, trying to kind of peel back the emotion, right? Describe what the emotion is in that moment. Describe the actions or the behaviors or the physical sensations you feel at that time, right? Are you kind of just like walked into a one chart when you should be having a book or kind of zoomed out focus? Are you toggling down to, you know, lower time frames? Yeah, are you just like turning off certain factors, you know, or indicators that might help you? How does your perception of the market change? How does",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "when you should be having a book or kind of zoomed out focus? Are you toggling down to, you know, lower time frames? Yeah, are you just like turning off certain factors, you know, or indicators that might help you? How does your perception of the market change? How does your perception of your positions change? How does your perception of your own strategy change? Be very, very detailed and capturing as much data as you can. You might not get all of those points, you know, at any one time, but you get like two or three. When I was sudden you start to create some some data that's going to help you gather more data, right? In other situations or in suit with clients, they'll have them print this out or have it on their computer and, you know, situation comes up where, right, they feel that phomo, they feel that greed, they feel that fear of losing the revenge trading, whatever, right? They are capturing as much data as they can in real time. After the trading days over, they'll go back review it at any additional notes they can. You do this day over day, all of a sudden now, there's going to be start, you're going to start to see some patterning, you're going to see if you see some repetition. And frankly, like I wrote the mental game of trading, like within mind that you could find like kind of comparing the data you",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "of a sudden now, there's going to be start, you're going to start to see some patterning, you're going to see if you see some repetition. And frankly, like I wrote the mental game of trading, like within mind that you could find like kind of comparing the data you find with what you see in the book. And then the book can help to kind of walk you through, you know, what might be underlying those particular issues. Yes, you can obviously spend some time reflecting asking yourself some questions and trying to figure out why you're experiencing what you're experiencing and get good answers. But the book, right, I'd say captures about 80 of what traders are experiencing. So it's definitely a little bit of a cheat code to be able to kind of dissect it for yourself, because I've given you a little bit of a road map to be able to do that. Yeah, that's it's super interesting. And another question I have, dubtailing off of this idea of self analysis. And this might be a little bit of the caveman side of my brain, but I've always found the juxtaposition between analysis and actually like root cause analysis to be useful. But then I feel like there's another layer of that where it's over analysis, where we're just like almost analyzing new problems into creation. Is that something that you've seen at all? And if so, like what are some methods for people to conduct",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "root cause analysis to be useful. But then I feel like there's another layer of that where it's over analysis, where we're just like almost analyzing new problems into creation. Is that something that you've seen at all? And if so, like what are some methods for people to conduct effective analysis where they're getting to an answer and then they're confident in this answer and then able to move on to, you know, the next piece. Well, the key word you said is confident. They call to an answer and they're actually not confident. It's the same reason why traders system hop, right, whether they're continually looking for kind of the next best thing because there's not a base of confidence that's being established. And ultimately, as I said before, it needs to come through competency, right? Your confidence is most aligned with your competence when it's when it's effective, when it's grounded. So, you know, if you're continuing to over analyze, then you have to come back and ask yourself like, do I feel like I have the skill to properly determine whether or not this is the problem or not? And if the answer is yes, then you have to invariably trust that first answer and then go research and test whether or not you were right or not. If the answer is I'm not sure or no, then get better at that analysis first before you go and start analyzing another problem because like it doesn't",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "you have to invariably trust that first answer and then go research and test whether or not you were right or not. If the answer is I'm not sure or no, then get better at that analysis first before you go and start analyzing another problem because like it doesn't mean or if you might choose to analyze another problem, but you're doing so in the spirit of trying to maybe solve something but also get better at that analysis. Like there's kind of two parts to it. You know, as a trader, as an independent, you don't have the ability to, well, I mean, that's why people hire me, right? It's like to kind of bring them on your team. But like, we know, if you're on a sports team, right? You have people naturally around you who you rely on to do that diagnosis. What really good coaches are able to do? Not just help you to analyze, but also figure out from a training standpoint how to be better, how to solve those issues. And if it's something mechanical, they'll find experts to fill those gaps and I mean, really good coaches know what not to focus on so that you can really zone in and focus on what you do when you're trying to be a coach for yourself from a mentality standpoint, from a risk management standpoint, from a technical standpoint, it's hard to kind of toggle between those, but it sort of begins with",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "on so that you can really zone in and focus on what you do when you're trying to be a coach for yourself from a mentality standpoint, from a risk management standpoint, from a technical standpoint, it's hard to kind of toggle between those, but it sort of begins with the honesty to say like, all right, you know what? I'm not very good at this thing yet. So let me just keep practicing and not kind of getting accessible. I think that's a way of slowing down that extra analysis. Yeah, that's super useful. It's interesting. Another thing I've come across that I'm interested your perspective on are looking to achieve things either. I don't know the correct terminology, but when you're trying to achieve something to achieve the thing or when you're trying to achieve the thing to avoid failure, I don't know the correct, I don't know what that's called, but yeah, I know I know either. Yeah, okay. Well, whatever that thing is, is that something that you've analyzed across your clients and have you come across any commonalities between specifically the trading world where if it's more effective when people are trying to hit something because they want to hit this versus avoid that or vice versa, they're both effective. The fear of failure, the fear of losing, the fear of being destitute, the fear of not being able to pay your mortgage and have your, like all those things, the hatred of losing, like",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "because they want to hit this versus avoid that or vice versa, they're both effective. The fear of failure, the fear of losing, the fear of being destitute, the fear of not being able to pay your mortgage and have your, like all those things, the hatred of losing, like all those things, like the all the avoidance motivators can be very, very effective. However, they're limited when, you know, like you're actually successful. You know, I mean, Jordan, Michael Jordan was famous for constantly needing people to think less of him and to slight him and to find that anger. That's what allowed him to be his absolute best. But he had to create it and he had to mentally manipulate his mind and he was an expert to be able to do that. It's hard for mortals to do that reliably and continue to find failure and fear at a high level. So invariably, the kind of go through those ways of like, all right, don't fuck up, don't fail. Don't go right. And then you're like, oh, okay, I can breathe the end. And then you've got to fall back down to earth only to kind of find that next pit. It's like, well, what's going to keep you kind of continuing to thrive? Some people right are much more motivated by their aspirations. And so yes, I think when you have a more pure motivation towards your goals, towards what you want to accomplish, there is",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "find that next pit. It's like, well, what's going to keep you kind of continuing to thrive? Some people right are much more motivated by their aspirations. And so yes, I think when you have a more pure motivation towards your goals, towards what you want to accomplish, there is an independence to that. Right, you're not relying on external outcomes to drive it. But sometimes maybe you're not as aspirational as you could be because what you envisioned your own potential to be is based off of your own perception of yourself, which could actually be too well. You might be capable of making eight figures a year or eight figures period and building that kind of wealth. But if you're only kind of aiming lower because you have a strange relationship with money, because you grew up poor or your parents weren't super supportive. And so you're having a little bit of that imposter syndrome, when you're having success, well, then that undervaluing may not give you the sort of authentic real aspirations. So there's not like kind of a one-size-fits-all that's going to help everybody. I think the end of the day is like, once you achieve some success and you find that you maybe need to be a bit more aspirational and less defensive in a sense, or you need to be more offensively minded, a little bit more in that kind of corrective place to fix some of the faulty perspectives you have to yourself.",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "some success and you find that you maybe need to be a bit more aspirational and less defensive in a sense, or you need to be more offensively minded, a little bit more in that kind of corrective place to fix some of the faulty perspectives you have to yourself. So you can actually be more offensive. And everybody's kind of got to figure out their own mixture and formula for what's going to allow them to be successful. I don't think there's a one-size-fits-all option, because we'll kind of solve it for everyone. Sure. So essentially, you haven't found some sort of stronger correlation or output if somebody is acting out of fear-based incentives versus aspirational, it's kind of just very specific to the individual. Yeah, got it. And I was smiling before because you started doing that thing again where I, in my defense, I wrote this one down earlier, but it was the very next thing I was going to move on to that you naturally started blending us into, which is this idea of trying to balance like thinking big, right? Aspirations, trying to not glass ceiling yourself, but then also being realistic and balancing the ever-present, you know, potential for failure. So for traders, are there any tips or tricks that you have with respect to helping them figure out like what the right focus is, what the right target is, which obviously will be highly personalized and commensurate with individual performance capabilities, but from",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "ever-present, you know, potential for failure. So for traders, are there any tips or tricks that you have with respect to helping them figure out like what the right focus is, what the right target is, which obviously will be highly personalized and commensurate with individual performance capabilities, but from a broader perspective? I think the biggest thing is not getting emotionally attached to the bigger vision. That's where your energy, when it get, or your emotions, when they get too attached to those bigger aspirations that they can cause a lot of problems. And I think people having done that before, maybe in other environments, and having gotten whacked and not being successful as they wanted to, and they end up kind of naturally like aiming lower, right? Because they don't want to get swept up in that emotionality. So you're really kind of band-aid in the problem by not engaging it versus like, no, have those massive aspirations, but use them to guide you to understand what's required in the next month, three months, six months, or as far out as you can plan. Generally, you get a year-out, like you're kind of making estimates and it's general ideas. But that's where your nose needs to be, like on the grindstone, doing the work day to day, really expanding your precision with your execution, with your improvement, with your learning, whatever mentality, technical risk management, all that is what matters day to day. But sometimes having those bigger",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "ideas. But that's where your nose needs to be, like on the grindstone, doing the work day to day, really expanding your precision with your execution, with your improvement, with your learning, whatever mentality, technical risk management, all that is what matters day to day. But sometimes having those bigger aspirations out there can place greater demands on your time, help to make you make better choices. I'm not saying you have to have them. You can want trading to be a really nice side-income that's going to give you the ability to take your family out on one nice trip a year, and that's your aspiration. Awesome. Make it happen. But the same thing is true. What's required to reach that outcome? Best way I can describe this is like results in process fit together. Results demand a certain process, which you're not really sure what it is yet, but you'll know based on the results. Over enough time. Did I do enough to achieve my goal? No. Okay. Well, let's retool and figure out. Yes. Cool. Okay. Well, what's next? Results and process fit together. It's not like a long journey. It's a journey with many destinations and those destinations that are predetermined give you feedback on your process. If it's just process with no outcome, then there's no wrong answers. So we want to have the ability to know whether or not your meeting targets are not. But we don't want to be emotionally attached to those",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "those destinations that are predetermined give you feedback on your process. If it's just process with no outcome, then there's no wrong answers. So we want to have the ability to know whether or not your meeting targets are not. But we don't want to be emotionally attached to those targets because that will demotivate us or blind us to the realities of what's required to give us a chance of getting there. And if we fall short, fine. Figure out how to fill that gap. Whether that means reaching outside of your immediate purview to do more research and find people who can help you to do that. Interesting. And you mentioned something in there that I'm really interested in, which is I found I'm a little more in that first group where I did grow up fairly poor. So my original goal was still at the time I considered really aggressive. Obviously, as I got close to it, became pretty modest in nature. And I found myself for a long time telling myself like, I'm okay with blank, right? Whatever this thing is. And then I started to realize that part of that was essentially me lying to myself and just being comfortable with where I'm at because it's comfortable there. And that's the reality and the prospects of potentially reaching induces failure potential and stuff like that. But I had like this really interesting just self reflection that I went through as they started identifying that. How",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "myself and just being comfortable with where I'm at because it's comfortable there. And that's the reality and the prospects of potentially reaching induces failure potential and stuff like that. But I had like this really interesting just self reflection that I went through as they started identifying that. How do you guide people through that process of setting good goals, but making sure that the goals aren't based on comfort where if somebody says to you like, Jared, I am I'm completely comfortable with just my trading being the side income. Whereas if they had the potential for the trading to actually be their full-time job, they would jump on it immediately. But they're concerned to make that jump. It's hard. I mean, I my you know, without talking to somebody, right? I think it's part of the question. Without talking to somebody, it's hard to kind of know where a little bit of that BS lies, right? Where something's just a little bit off. You know, like you said two things that I'll challenge you specifically on and maybe give those that are watching some ideas of like how to find this. But like, write out your goals and then write out the wise behind your goals. And if you find language that feels a little bit soft, feels a little bit wavy or undefined or unclear, well then that's probably an indicator. Right? So when you said, you know, I'm okay with X. That basically means that",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "and then write out the wise behind your goals. And if you find language that feels a little bit soft, feels a little bit wavy or undefined or unclear, well then that's probably an indicator. Right? So when you said, you know, I'm okay with X. That basically means that you're saying, I'm okay being okay. That's truly what you want. Well, then cool. Okay is enough. But is okay enough? Clearly it wasn't. That was one, two, I'm completely comfortable. Whenever time we add those superlatives or I don't know what the right word is, like adjectives on top of the comfort, it kind of tells us that we're trying to convince ourselves or something. Like I am comfortable with making this kind of money. I'm comfortable with the idea and I have evidence to prove that I'm completely comfortable. Are you? Are you trying to convince yourself of that? Those would be kind of a couple things to look out for. Yeah, super interesting. I very interesting, especially like the add-on language. That makes a lot of sense. I know that I don't have you for too much longer as you could tell. I literally can talk you ear off because as soon as you say stuff, more stuff gets written down and it's this vicious cycle for you. But don't worry, I may have promised you I'll keep it. But the next thing I wanted to talk to you though, one of the most fascinating things I",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "ear off because as soon as you say stuff, more stuff gets written down and it's this vicious cycle for you. But don't worry, I may have promised you I'll keep it. But the next thing I wanted to talk to you though, one of the most fascinating things I find about trading is that it's it's like very holistic. Meaning as a retail trader, you have to be researcher, you have to be the boss, you have to be the risk management department, you have to be this parser psychologist, you have to there's a lot of things you have to do and it feels like one of the things you mentioned earlier really stuck out with me, which is when you're dealing with some systems that add pressure, just about any of your weaknesses are going to eventually come to light. You're going to see them. Do you have any tips for traders as they might be newer, not fully sure what their weaknesses might actually be yet because they don't know what they are? Do you have any tips for those kinds of people to become more self aware of what some of those weaknesses might be? Look at other things you've done seriously. Hobbies don't really count because it's not really going to draw them out. The things that you really cared about will give you at least some guideposts to maybe like, you hate losing because you hated losing since you were a kid or",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "Look at other things you've done seriously. Hobbies don't really count because it's not really going to draw them out. The things that you really cared about will give you at least some guideposts to maybe like, you hate losing because you hated losing since you were a kid or you tend to feel a lot of pressure when you're taking tests or giving presentations or when you're really kind of under the heat. You're not really a confident person. You tend to be a little bit arrogant. You're a little procrastinator. You can see these patterns in elsewhere in your life and maybe they don't harm you in significant ways. They don't really kind of impair like you're again, happy and satisfied. But in trading, they're going to come out and they're going to be problem. You can kind of start to get ahead of it before you even develop the sort of technical precision to have a strategy that's going to maybe show some of these problems to be damaging and costly in trading ahead of time. Especially the ones that are related to work ethic and responsibility and discipline, motivation, those are ones you really want to get ahead of because they are absolutely going to slow you down. They'll be the barnacles on your ship here that reduce the friction or the increase friction and slow down your growth curve. So yeah, if you see any of that stuff, then absolutely get ahead of it. And",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "get ahead of because they are absolutely going to slow you down. They'll be the barnacles on your ship here that reduce the friction or the increase friction and slow down your growth curve. So yeah, if you see any of that stuff, then absolutely get ahead of it. And it doesn't mean I'm not saying like work ethic in this space sometimes means like knows the grindstone, you know, just full board. There is definitely a relationship where you got to start thinking about yourself as a performer. And you know, this is not like you're taking a test once. Like you're studying for the MCATs or studying for the GREs or whatever. This is not nine months of study before you start trading. I mean, I work for a handful of people that have done that, but they've already known that that is their style of learning. And they know that it works. You know, if you spend a year just studying before you start to enter the live market, you know, if you're not certain that that style is going to work, you are at risk of getting into the market with expectations that are way too high. Because I would think of the transfer from studying and preparing yourself and learning to the live market to like a funnel, right? Like you're only going to get a little bit through at a time, right? Our mind only has bandwidth for so much. And so when you",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "high. Because I would think of the transfer from studying and preparing yourself and learning to the live market to like a funnel, right? Like you're only going to get a little bit through at a time, right? Our mind only has bandwidth for so much. And so when you feel like you're really strong command of certain ideas, concepts, et cetera, you know, in study or even in the SEM, it may not necessarily all just kind of copy-paste over, right? It's going to take some time. So those faulty expectations are really damaging, you know, when you spend an inordinate amount of time studying before you actually, you know, kind of make the transfer. But that's just kind of one tip on top of the overall idea of what I was mentioning earlier and just kind of using past other performance environments to kind of help understand what what issues may affect you. Yeah, I love that. What a great way to try to add a little clarity to something that's truly ambiguous by using references like that. Super smart. I have two questions left. We only have time for one. So I'll let you pick the one that you like the most. One of them is really boring. So I'm actually not even going to pitch that one to you. I'm happy to go lightning, right? I can answer questions in five seconds if we need to. So beautiful. Okay, then let's do that. What are the",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "that you like the most. One of them is really boring. So I'm actually not even going to pitch that one to you. I'm happy to go lightning, right? I can answer questions in five seconds if we need to. So beautiful. Okay, then let's do that. What are the most common destructive behaviors you see in traders? They are assuming that they know the cause of their problems. Love that. What are the most common nefarious destructive behaviors for traders? The differentiation I'm making here is something that's commonly afflicts people, but people don't know. It's a normal reflection, meaning that it's something that impacts a lot of people, but it's commonly overlooked. I mean, I want to say revenge trading, but I know it's so commonly talked about. So maybe we'll go like desperation. There is such a deep desire because sometimes desperation where you're just really violating your rules in ways that feel so justified at the moment. You're either leveraging up, sizing up, eliminating stop losses, daily loss limits, etc. to sustain the hope that you can still make money today, make money in this trade, continue to move forward. There's not a lot of emotion that feels present in real time. There's just this compulsion that is driving you to violate all of your rules and it feels as I said, justified at the moment. That's probably the one that, again, it's not always in a very emotional experience. Sometimes it could be filled with",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "that feels present in real time. There's just this compulsion that is driving you to violate all of your rules and it feels as I said, justified at the moment. That's probably the one that, again, it's not always in a very emotional experience. Sometimes it could be filled with anger, but at the heart of that is a very strong weakness and confidence that underlies it. Interesting. Last one, easy one. What are some of the most common traits that you see in successful traders? I know you've answered this a million times, but you got to ask when you're talking to psychological dude. Same thing as anything else. You've got to have a love and a passion for it and that love and the passion translates into doing the work required. So it's the passion and the work ethic. It literally is no different than anything else. And the love and passion, some of you can't fake it. You can be infatuated by trading. You really enjoy it and still be good at it. But in order for you to be great, you have to love it. It has to be a part of you and that means that you're going to be obsessed by it. That obsession to others is going to look like gambling and being a workaholic and yada, yada, but again, nobody called tiger a workaholic. Nobody called Kobe and all the greats in any progression like workaholics. That's what's required to achieve your",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "that you're going to be obsessed by it. That obsession to others is going to look like gambling and being a workaholic and yada, yada, but again, nobody called tiger a workaholic. Nobody called Kobe and all the greats in any progression like workaholics. That's what's required to achieve your goals. And there are no choices at that point. Awesome. I made a promise. I intend to keep it. I do have more questions written down, but I will get you on another time to continue diving in. As you could tell, there's two things that I really like to pull out from this. The way that you look at things, the way that you analyze the world and trying to give people some ways that they can adopt some of them. But I also think that you did a really great job and I'm appreciative of trying to open the lens for people about different factors that I guess is a lot of people have varying levels of awareness of like all these different factors as they impact. So thank you so much for coming to hang out for a little bit. You mentioned your website earlier, but please, if you could also throw it in the description, but then anywhere else that you would like people to be able to find you, I think I found you on X. So I'll throw that in there as well. You did. I'm not super active on there right now. It's",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "if you could also throw it in the description, but then anywhere else that you would like people to be able to find you, I think I found you on X. So I'll throw that in there as well. You did. I'm not super active on there right now. It's social media has just been something that I've invested time into in the past and I'm just not interested anymore. I do also have a YouTube channel which, you know, shockingly has grown way more since I've been inactive there. So I've got a bunch of other recorded content that's sort of freeway available. And it's just Jared Tendler on YouTube. That's right. But yeah, websites best place to start, like free worksheets, got an ebook on intuition, you know, put out a monthly newsletter, monthly blog on new topics. I also have a private community called the Mental Gimma Trading Live. So if you want some support, you know, my coaching is 500 bucks an hour. This is 50 bucks a month and you get, you know, certainly a bit more accountability, community content, and, you know, an ability to have some interaction with me. That's not exactly like a one-on-one, but, you know, decent replacement for one-tenth the cost or maybe even more than. And then, you know, the mental game of trading, which is, you know, the book, freeway available, not freeway, it's available anywhere. You can go anywhere. Yeah. Software here, art cover, audio book, ebook,",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  },
  {
    "text": "a one-on-one, but, you know, decent replacement for one-tenth the cost or maybe even more than. And then, you know, the mental game of trading, which is, you know, the book, freeway available, not freeway, it's available anywhere. You can go anywhere. Yeah. Software here, art cover, audio book, ebook, etc. Awesome. Jared, thank you so much for coming to hang out for a little bit, sharing your expertise. I will throw links to that stuff in the notes below for everybody that's interested. And I definitely would love to connect with you another time. Good to see you. Yeah.",
    "metadata": {
      "video_id": "vnPwS5jRTtM",
      "title": "A Look Inside the Mind of a Trader with Jared Tendler | The Outlier Podcast",
      "url": "https://www.youtube.com/watch?v=vnPwS5jRTtM",
      "upload_date": "",
      "duration": 3204.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vnPwS5jRTtM&t=0"
    }
  }
]