[
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "What's up out live today? We're going to talk about how to actually build confidence as an obstinate or now you've been told actually pretty smart stuff things like believe in yourself. Trade your plan. Don't be greedy. Be patient. Yet, as you've heard these different things, you've gone and made the same smooth brain decision time and time again. Why does this happen? It is everything to do with confidence. Believe it or not. Now, there's a very dangerous piece of confidence called the Dunning Kruger effect. This is where when we first start learning something, we grow really, really fast. We learn a lot very quickly because you're starting from nothing. And then you think you know something at which point you typically make a big mistake. Then you realize that you don't know anything. And then over time, if you keep doing the thing, then you'll eventually figure it out. Now, one of the issues with building confidence as a trader is that this drop here is most often associated with a loss of capital. And most people that start trading don't have buckets of new capital to tap into. This, as it occurs, typically undoes years of effort. So the goal is to dampen this. It'll still happen, but the goal is to dampen it and learn how to actually build confidence in a way that's logical and makes sense. So this will be a little bit of a TED talk. But my goal is that",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 101.48,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "of effort. So the goal is to dampen this. It'll still happen, but the goal is to dampen it and learn how to actually build confidence in a way that's logical and makes sense. So this will be a little bit of a TED talk. But my goal is that the end of this video, you should have a pretty clear game plan on what you need to do. But then it's always down to actually doing it. So let's start. The first thing we need to do is master fundamentals of markets. If we think about this concept of confidence, one of the most common misconceptions is that you can just believe in yourself or that you can fake it until it actually starts to feel real. It is complete bullshit. There is one and only one way to build confidence in anything, including trading. And it's through the demonstration of a skill set and seeing the outcome being what you want it to be. So if I'm a basketball player and I've never touched a basketball and I have to hit 10 free throws in order to save my life. How confident am I going to be going into that? Not very yet if I'm Kobe Bryant, recipes who shot thousands and thousands of free throws, how confident would he be? Probably supremely, even though the stakes are pretty high. That's the difference between actual confidence and fake confidence, which isn't confidence. It's nothing. Confidence comes from the",
    "start_timestamp_seconds": 80.76,
    "end_timestamp_seconds": 185.92,
    "start_timestamp": "01:20",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=80",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "into that? Not very yet if I'm Kobe Bryant, recipes who shot thousands and thousands of free throws, how confident would he be? Probably supremely, even though the stakes are pretty high. That's the difference between actual confidence and fake confidence, which isn't confidence. It's nothing. Confidence comes from the demonstration of your skill set so that you can see the outcome. That in trading can be really difficult to get to because most people don't build the infrastructure to get to that point, which I will show you how. When we talk about the fundamentals, this is literally the very basics. This is going to invest a pediatop. And it's saying, what is the stock market? How does this thing work? And then it's going through this kind of very, very, very rudimentary high level research. Then if you're interested in derivatives and options, it's grabbing a book like this. Options is a strategic investment. It's a thick textbook. It's not a joke. It's 800,000 pages. But there's nothing in there that's that difficult, but it's working through the material. What I can tell you is that if you do just this, you start by going through invest a pediatop and you work through in stock market basics thing. You grab that book. Options is a strategic investment. You work through that book. By the end of that, you will absolutely be in should be more confident than without doing that. But this is the problem. Most people see",
    "start_timestamp_seconds": 158.6,
    "end_timestamp_seconds": 264.36,
    "start_timestamp": "02:38",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=158",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "pediatop and you work through in stock market basics thing. You grab that book. Options is a strategic investment. You work through that book. By the end of that, you will absolutely be in should be more confident than without doing that. But this is the problem. Most people see a 500,000 page book about something that's not inately intuitive. And then they don't want to do it. They want to see if there's an easier way. Again, if you do not master the fundamentals, you will have no confidence. Why should you? It doesn't make any sense. The next thing is actually understanding market effects. Most options traders begin options trading by learning different structures. What calls and puts are what volatility is in so on and so forth. The problem is, if you just start trading those different option structures trying to make money, you're really no better off than not knowing how to trade a stock and then using something you don't know. There's not anything magical in options. You don't learn the basics of options, then all of a sudden have an edge. So that leads to a really broken feedback loop for people where you're using the thing that you learned, you're trading these vertical spreads, you're trading iron condors, but then you're not making any money. Well, of course not because you're just using a structure in an asset. There is no profit mechanism there. So how do we learn about profit mechanisms? One",
    "start_timestamp_seconds": 245.42,
    "end_timestamp_seconds": 338.6,
    "start_timestamp": "04:05",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=245",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "using the thing that you learned, you're trading these vertical spreads, you're trading iron condors, but then you're not making any money. Well, of course not because you're just using a structure in an asset. There is no profit mechanism there. So how do we learn about profit mechanisms? One is you probably could guess there's tons of videos on that on my channel that you can look up. But the other thing you could do is do some cursory research. Get AI to help you out. One of the things you might find is an effect wrapped around ETF rebalancing effects or ETF inclusion effects or earnings effects or things that are actually deeply rooted in something we can explain. That's robust. The problem with these kinds of edges is that they're not what people want. They're not these make a million dollars overnight kind of edges. They're more grindy. You get a few points over a market return and people don't like that. Welcome to trading. This is the real life. The cool part is, once you accept that fact, it's still like really good money on stuff like that. But there's a step that has to be taken away from the dream phase of things. Next you have to learn how to test things if you don't know. The reason why this is important is because unlike basketball, the stuff that you test in trading is easy to mess up. And it's because there's a thing called",
    "start_timestamp_seconds": 316.24,
    "end_timestamp_seconds": 412.52,
    "start_timestamp": "05:16",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=316",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "taken away from the dream phase of things. Next you have to learn how to test things if you don't know. The reason why this is important is because unlike basketball, the stuff that you test in trading is easy to mess up. And it's because there's a thing called path. Path is how things happen to unfold. Does the stock market happen to go up three days in a row? Does it happen to go down 10% over the next two months? Well, depending on what strategy you're trading, you could be trading in completely viable strategy. But if that two month path doesn't fit your strategy, then you're likely to abandon the strategy because you're saying, well, this isn't working. Then you're going to something else. That doesn't work. To have to learn how to test things, a really great way to learn how to test things is to go to MIT OpenCourseWare. This is all completely free. And you can take a basic class on probability and statistics. You can take basic classes on things like hypothesis testing to actually understand how to test an idea. And again, if you hear this, you're like, damn, that sounds like a lot of work. No shit Sherlock. Just as Santa Claus ain't real spoiler alert, there's not this source of fast, easy money that you're going to be able to tap into for a long-term timeframe as a trader. It's not there. Embrace the suck. Do the work. The",
    "start_timestamp_seconds": 391.32,
    "end_timestamp_seconds": 496.4,
    "start_timestamp": "06:31",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=391",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "like a lot of work. No shit Sherlock. Just as Santa Claus ain't real spoiler alert, there's not this source of fast, easy money that you're going to be able to tap into for a long-term timeframe as a trader. It's not there. Embrace the suck. Do the work. The cool part is usual. If you do the work, then this shit becomes pretty easy. Genuinely. Is after you do the work. Then you need to test the damn ideas. So once you learn how to do that, then you've got to do it. You want to outline what you're doing in a trading plan. I have videos on that so that you can track your ideas. You'll learn that that's part of a testing process is to control variables so that you can observe and outcome. Then you can mess with different variables and see what the change in the outcome is. That then informs what things matter and what things don't matter. And then how you build something that's actually robust. Finally, you track what you're doing. You might start by back testing. Then you might start by forward testing. Then you might start by paper trading. And after that, you might move into a small amount of test capital. But there has to be some method for you to actually validate what you're doing and whether or not it works going back to exhibit a how do you build confidence. It's through the observation, the demonstration of",
    "start_timestamp_seconds": 473.96,
    "end_timestamp_seconds": 570.36,
    "start_timestamp": "07:53",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=473",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "after that, you might move into a small amount of test capital. But there has to be some method for you to actually validate what you're doing and whether or not it works going back to exhibit a how do you build confidence. It's through the observation, the demonstration of a skill set. This is how you demonstrate the skill set and then validate what's actually happening. The reason why people bounce between plans so much or strategies so much is because they're not confident in it. Why should they be? They've done next to no research and then they go through a weird path in markets that doesn't associate well with it. So then they abandon it. Then they hop onto the something else and then that vicious cycle continues. If you start this entire process by resting on profit mechanism, something that is fairly robust that we know exists, that then makes the rest of this stuff that much easier. Then you can branch off, go do the fun stuff, go try to find neat things that aren't necessarily as well researched. That might come and go the difference. For example, between market inefficiencies in risk premium. But there are things out there outside of this boring stuff. But this is the foundation. Be an outlier. See you later.",
    "start_timestamp_seconds": 554.2,
    "end_timestamp_seconds": 631.48,
    "start_timestamp": "09:14",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=554",
    "chunk_index": 7,
    "word_count": 221,
    "upload_date": null,
    "duration": 633.0
  },
  {
    "video_id": "VpPB0Bmpgpk",
    "title": "Confident Options Trading: Secrets to Overcoming Fear and Winning Big",
    "text": "there are things out there outside of this boring stuff. But this is the foundation. Be an outlier. See you later.",
    "start_timestamp_seconds": 625.0,
    "end_timestamp_seconds": 631.48,
    "start_timestamp": "10:25",
    "video_url": "https://www.youtube.com/watch?v=VpPB0Bmpgpk",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=VpPB0Bmpgpk&t=625",
    "chunk_index": 8,
    "word_count": 21,
    "upload_date": null,
    "duration": 633.0
  }
]