[
  {
    "text": "What a day. I thought it was going to be a slow week. There's a holiday, short trading week. And no, we have Warren Kitty coming out with a nine million 1000 share chewy position that we have to take a look at. We have a civil class action lawsuit that was launched and then subsequently unlaunched. We got to talk about that. Then we have to take a look at GameStop and the options activity going on there. So we have a full docket. Let's get straight into the details. We'll start with the easy stuff here. Let's start with these cases. And I find them very interesting. The very first thing to note is I'm always very upfront with the stuff I know about and the stuff I don't. I don't know anything about this. I'm just applying normal logic. So if there's any lawyers or anybody who know way more about this stuff, then I do I would love to hear you weigh in. But so far, here's what I'm seeing. And I will throw links to all of this in the notes so that you can look for yourself. It's very important to be able to fact check sources. So the 28th of June, we had a class action complaint filed against Warren Kitty by Martin Rativ and then other people. So obviously what they do is they pick somebody to represent the group and then they assemble the group later on. They find somebody that's",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "fact check sources. So the 28th of June, we had a class action complaint filed against Warren Kitty by Martin Rativ and then other people. So obviously what they do is they pick somebody to represent the group and then they assemble the group later on. They find somebody that's been damaged that is representative of a larger totality of people. And this thing is 40 pages. There's quite a bit of detail and it's something to the tune of pump and dump stock manipulation. That kind of stuff we can essentially skip through most of it. And I want to hone in on a few things and know the thing I don't want to hone in on necessarily is our boy Martin's 35 shares to which obviously is very, very damaging to him. Plus then think a thousand dollars total here or something like that. So let's not hone in on that. And let's talk about the broader thing here, which is really interesting because when I look at somebody like DFV, one of the primary complaints from this is that they felt that he owed Warren Kitty owed other people some sort of heads up that he was going to unwind his position, which is crazy to me. The dude is an individual investor that's not even making any recommendations whatsoever. Yet you have people like Jim Kramer who jump on TV and I'm not I'm not trashing Kramer either. I think it's okay to talk about your",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "going to unwind his position, which is crazy to me. The dude is an individual investor that's not even making any recommendations whatsoever. Yet you have people like Jim Kramer who jump on TV and I'm not I'm not trashing Kramer either. I think it's okay to talk about your opinion. But this is super frustrating when people try to essentially go for a money grab. And law firms like this are very, very smart. And what they do is specialize in kind of these contingent style cases where they're not collecting a bunch of money up front. They're trying to see if they have access to a pot of money that then they would get paid from that's probably even more than they could possibly make from one individual person up front. So there are entire law firms that specialize in this stuff. I have no idea if these guys do or don't. I don't know them from home the wall. But there are a few things I find fascinating about this whole thing. 28th of June, this thing comes out Friday. Then we see this today, voluntary dismissal, first of July. Hmm, crazy. Huh? You go through the effort of making this entire statement. You're grabbing some details again. This isn't like a ton of work for them. They have an entire staff that helps them. But that does take manpower and resources to build this. And they submit this Friday. And then Monday, they're like, nah, take",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "effort of making this entire statement. You're grabbing some details again. This isn't like a ton of work for them. They have an entire staff that helps them. But that does take manpower and resources to build this. And they submit this Friday. And then Monday, they're like, nah, take back sees. Never mind. Didn't mean it. Very strange to me. Don't know exactly what that means. I do know a couple things though that this without prejudice component means that they can refile at some point. There might be some gamesmanship going on because here's what I do know. These aren't dumb people. They're not playing checkers. They're playing chess. So I don't know what this turns into. But this time frame is confounding to me. I don't know the exact reason. Maybe somebody else does. But again, just from a logical perspective, this doesn't logically flow if you go into this because there must have been some sort of injection of new information that led to this change. But we don't know what it could be something as simple as they might want to try to take it to another place outside of New York. It's very, very difficult to tell. But something changed and it was material enough that they wanted to pivot. That's what we do know. So enough on the case for now, at least because it's gone for the time being something to keep an eye on though, because that is just an interesting",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "difficult to tell. But something changed and it was material enough that they wanted to pivot. That's what we do know. So enough on the case for now, at least because it's gone for the time being something to keep an eye on though, because that is just an interesting progression. Next up, let's take a quick look at some GameStop in general. First, and then we'll take a look at Chewie. And what might have happened there? Because when we take a look at GameStop, I'm not seeing a ton of options activity. Nothing that's necessarily jumping out to me as very novel. I'm seeing the same flattening across volatility for various expiration cycles. And let's take a look at Open Interest first. And I want to highlight a few things for you guys. The first one is there's still massive call skew on OI 721,000 calls against 464, 465. Give it to them on the put side. And then if we take a look at volume today, it's still very heavy. It's over 200,000, almost 300,000 calls traded against 128K on the put side. So very, very heavy there. For most of the volume we saw today, it's for the five July expiration. There's a couple interesting strikes that we need to take a look at. The 24's definitely saw a lot of action, the 25's. And then I'm going to guess these are the 30's. Yep. And then if we take a look at the Open Interest",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "for the five July expiration. There's a couple interesting strikes that we need to take a look at. The 24's definitely saw a lot of action, the 25's. And then I'm going to guess these are the 30's. Yep. And then if we take a look at the Open Interest though, notice how all the red here, this actually is a lot of activity in the 19th July. So this looks like people kind of playing the front month, but then starting to establish positions in the next primary expiration cycle, which is what I would expect to see based on liquidity. Plus again, with the holiday this week, I just this is a tough position, I think, for any sort of expectation of super heavy movement. But if we take a look at the OI on the 30's, it's 16991. And there was 16712 that traded today. That's very interesting to me. I'm very curious what this strike will look like tomorrow. Because if a lot of that is opening positions, that would be very surprising to me. We're on a short week. There is not necessarily a huge catalyst, especially after the news that came out today. So there's wouldn't overly surprised me if there's a lot of exits. But if we take a look here and here, so if we take a look at the 24's and the 25's, the 24's have essentially 12k of OI, but 19k of volume. So there's definitely tons of opening positions",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "there's wouldn't overly surprised me if there's a lot of exits. But if we take a look here and here, so if we take a look at the 24's and the 25's, the 24's have essentially 12k of OI, but 19k of volume. So there's definitely tons of opening positions there. And even more opening positions here at the 25's, over 10,000 calls opened. Now these are decent buys though. These are a little closer to the money, about a 30 delta, which again, you can check out that video on buying options, smartest for GME. People I continue to push that because I want to make sure the word gets out on at least having a model to assess how we're buying options as compared to what we've been seeing to a pretty significant degree of people being super cheap coming all the way out here to the 95's, which are now mid at 0.015. And we see 13,000 OI and 6500 transactions act there. They're less than a 0.01 delta and they have essentially no gamma and they're going to decay away. And like a day, I try to steer people out of those if possible just to get them to consider other positions essentially. But that's what's going on here in 5 July. Looking at 19 July, there's a huge position building at the 25's. This is up to 20,000, 21,000, almost at the 30's. There's 27,000 and at the 40's, there's 20,000. So this starts to",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "get them to consider other positions essentially. But that's what's going on here in 5 July. Looking at 19 July, there's a huge position building at the 25's. This is up to 20,000, 21,000, almost at the 30's. There's 27,000 and at the 40's, there's 20,000. So this starts to become really interesting to me because it's not quite severe enough necessarily for a gamma ramp per se. But this is a lot of activity going on and it's expanding pretty meaningfully. Because if you have 20,000 OI and 8,000 volume traded today, assuming a good chunk of that will be buying, that starts to build up. And speaking of building up, let's take a look at time and sales because there are a few things that stuck out to me today at least. First, I want to take a look at 250. That's what I'm filtering by to start. So we're looking for slightly larger positions. And I see a few things that pop out at my eyes, not worrying about the put side so much. Don't care too much there. Like these 125's, 90's, these are far out of the money, more yellow styles. They're smaller positions in terms of amount of capital. I don't really care about that. But there are a couple in here I do care about. So like this here, this looks like somebody selling short calls against long shares covered calls. These are all sales and they're at the 22 and 23 strike",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "terms of amount of capital. I don't really care about that. But there are a couple in here I do care about. So like this here, this looks like somebody selling short calls against long shares covered calls. These are all sales and they're at the 22 and 23 strike here in five July. So this person collecting a decent amount of money, selling premium. And again, my guess is these would be against shares because you can see where the underlying was traded when they put these on. The underlying was at 23. It was already over their strike when they established these positions. So this looks like they might want to get the shares called away and collect a few dollars doing it. That's what I pick up from that at least. Then we have this position down here. Where are you? This one is 20 September 22 call. There's 500 and there was 690 of these or I'm sorry, they traded at 690. There was 500 of these that traded at 690. And this I couldn't necessarily tell if it's a buyer or sale. I'm assuming it's a sale based on again, the broader context here, but it looks like people are starting to capitalize on a bit of the premium that's rolling in. The last thing I want to take a look at with you guys with respect to GameStop is as always, we'll take a look at the vault. This is for the out of",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "it looks like people are starting to capitalize on a bit of the premium that's rolling in. The last thing I want to take a look at with you guys with respect to GameStop is as always, we'll take a look at the vault. This is for the out of the money options. We're seeing the puts start to jump up as per usual. The call sides a little heavy but nothing crazy. What's most interesting here is if we clear up some of those noise, you'll actually see a volatility traders great friend, which is all of this inversion right in here. It's kind of difficult to see, but typically we expect to see these shorter term time frames actually to trade above these. So the fact that these are all inverted cross and over one another is a tradable event from a volatility perspective. All right. Now we have to talk about this. The fact that Roryne Kitty is indeed not a cat that's great clarification. We see that on the 24th of June, we have a pretty meaningful position, which is 9,000,000 shares. So the question is where did this come from? Because if we take a look on the 24th of June where Chewie was trading, this is not a small position. So if I drop in Chewie and then if we go to the 24th of June, let's give them a fair price. Let's say that we could have got in at like 25, which",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "look on the 24th of June where Chewie was trading, this is not a small position. So if I drop in Chewie and then if we go to the 24th of June, let's give them a fair price. Let's say that we could have got in at like 25, which would be low. I actually don't think we would have gotten a full fill there, but let's say we got in at 25 and let's take a look at the position, which is 9,000,000 shares. It's 225,000. Now I also see some conversation that he might have gotten in at 27. I'm not sure myself. I'm using a lower planning factor here because it doesn't actually matter what it is because the point rings true even with the lower planning factor of 225. And let's take a pause real quick. We're talking about an individual retail trader that goes by the name Roryne Kitty that's slinging 225 million. How can that not be fascinating to everybody? It's crazy. That's absolutely crazy. That's what I'm talking about right now, but I am. Here we are. So this is nuts. So this position goes on and he obviously files. Now I would not at all be surprised if he's already out of this thing. I would not at all be surprised. I think he technically would owe an amendment within 10 days from here. I'm not positive on that, but I think he would owe an amendment. So I wouldn't be surprised",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "not at all be surprised if he's already out of this thing. I would not at all be surprised. I think he technically would owe an amendment within 10 days from here. I'm not positive on that, but I think he would owe an amendment. So I wouldn't be surprised to see another 13G come out in the near future that might place him out of this trade. But the other question is how did he get into this trade? Because we know based on his last position, he had like 6 million a little over six, like six and a half. Maybe something just shy of that. So that's not 225. Again, giving them the benefit of the doubt. So where does that money come from? That really is a pretty big question. And as far as I see it, there's a few scenarios. In the military, we use course of action, color, which is kind of what it sounds like, how something might go down. And there's a few of them. There's more than this to be clear, but we like to think in three, I'm a simple person. So I picked three that I thought were probably representative of this. So we have the scenario where he might have sold to close GameStop shares to then buy chewy. And we'll talk about that. Probably, probably not. Don't know, really hard to tell. He could have traded chewy options, use the proceeds from that to then buy chewy.",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "representative of this. So we have the scenario where he might have sold to close GameStop shares to then buy chewy. And we'll talk about that. Probably, probably not. Don't know, really hard to tell. He could have traded chewy options, use the proceeds from that to then buy chewy. Also, in a vacuum, it seems doubtful, not impossible. Then we have this third color where he might have traded other things or a combination of things to then clear up enough capital in order to establish the position of chewy. That's my expectation. Coa three is that this might have been several factors that joined together to build this position as compared to completely flattening GameStop as compared to turning six million into 225 million just trading options. I know Richard was talking about that in his video. And again, it's we're in kitty like you can't put anything outside the realm of possibility, but just trying to apply a logical thought process. It seems really difficult. And we'll take a look at the chewy options. I literally downloaded all of them from all of last month to see what kind of positions could have produced that. So first, let's talk about coa one and my hesitation with this one. And it's actually from the conversation that I had with Richard. He showed me this really interesting piece of his incredible excel sheet that he's been building. And this stuck out to me in that he's explicitly called this",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "let's talk about coa one and my hesitation with this one. And it's actually from the conversation that I had with Richard. He showed me this really interesting piece of his incredible excel sheet that he's been building. And this stuck out to me in that he's explicitly called this out to me as well to be clear. This over the course of the different positions we've seen him have from 2020 on, he's never decreased his position from what we've seen. 250, 10,000, 50,000, 200,000, I'm sorry, 50,000, 100,000, 800,000, 800,000, 1 million, 5 million, 9 million, haven't seen it go down. So it doesn't seem like he's in the habit of unwinding a bunch of his positions to get in. The other thing though that I will say when I look at this is there's some really big expansion, right? 10,050, huge, 50 to 100,000, big, 1 to 2, 2 to 8, like it starts getting exponential here in terms of sizing. So then the question is, did he actually expect to park all 9 million shares into perpetuity? That's tough to say because it does lock up capital for him and especially to be able to play something like this. So let's take a look then at the Chewy Options thing. And again, this is kind of a all encompassing document that I use. Let's start by looking at long calls, however, and this is looking for through all of last month. The first thing I want",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "something like this. So let's take a look then at the Chewy Options thing. And again, this is kind of a all encompassing document that I use. Let's start by looking at long calls, however, and this is looking for through all of last month. The first thing I want to focus on is this 5,000 lot position. A lot of people are talking about funny enough, this actually isn't the biggest position that went on. Sometimes people get too focused on the size, remember, it's not all about the size. And we forget the price that goes along with it in some of these instances. So there are actually positions with a larger total value associated with it. So if we take a look at that, we can see that there's actually some really large positions that went on here, essentially in this block. So if we then filter on these what we would call larger positions and let's say that we want to make sure everything we're looking at is at least greater than 100,000 something like that. It limits our scope a bit to see what could have gone on here. Now if we take a look at these strike prices, I see the majority of them going on at 30, I also see 35, 25, those are the main ones that I'm keen into here. So then the question is, okay, maybe we got into Chui early. But the problem is then if we look at",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "at these strike prices, I see the majority of them going on at 30, I also see 35, 25, those are the main ones that I'm keen into here. So then the question is, okay, maybe we got into Chui early. But the problem is then if we look at some of these dates and we go back early, these are the smaller positions. So then it's like, well, then let's see where we have sales of those calls because he would have needed to unwind the position. We have to clear this filter because it's using a positive integer. We have to see where he would have unwind those calls. So then we would look at the short calls to see what would have happened after those long calls. And we do see these 30s. This is one day after on that previous expiration. So that could absolutely be something that happened because this is the 19 July. I got to find those 30s. This one. 19 July, 5,000 of them for 99 cents. So then let's say that we got those for 99 cents, 5,000 of them. And then let's flip back now to these short calls. Look at that same block, which would have been here. I see in unwind, actually, we can even filter this by the 30s so that we can look at that exact block down here. And let's look at that exact expiration. Is this? And let's see what happened. Absolutely enough here",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "at that same block, which would have been here. I see in unwind, actually, we can even filter this by the 30s so that we can look at that exact block down here. And let's look at that exact expiration. Is this? And let's see what happened. Absolutely enough here to unwind that entire position, potentially. There's not enough money made in my opinion. So we would obviously have to filter the stuff that went on after the original date. So again, if we flip back to those calls, the long calls, you'll see that they were put on what the 26 I said. So then looking at stuff that would have been put on or taken off after the 26. So we have to go to the 27 28th. Those are essentially your choices here. And let's see total size that would have came down. It would have been enough. But if we look at the total proceeds from the positions, it's just not enough. It's less than a million dollars. And you also have to take into account the cost to get into the position, which again, on that first block of 5,000 was like a buck. So I am not convinced that we traded options here in order to establish the position. Again, it's not impossible because maybe we were spread across more strikes or maybe we went into additional aspirations. That's the problem with this stuff is, you know, we're kind of piecing together what we",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "I am not convinced that we traded options here in order to establish the position. Again, it's not impossible because maybe we were spread across more strikes or maybe we went into additional aspirations. That's the problem with this stuff is, you know, we're kind of piecing together what we can see, but it's not definitive. And there's always going to be holes in all of this, which is kind of the beauty of it really as I think about it. But that does matter. What I'm highlighting here is that there's nothing that'll vertically jumps out of me and says, yes, here's a clear buying pattern. And that's essentially how I found his position so far. That's how I've ran with the positions I've seen, at least in the options in the cycle is by going through this process. So I don't see that. Where does that leave us? Probably a combination of things. There is a world where he traded some short calls around his shares. You can make a bit of money that way. There's a world where he could have sold some of his shares to probably get back into them. I assume, but to start causing a potential wave. There's a good chance that he might have traded some other things. I think that's less likely in terms of other products. My guess is it's a combination of everything we've seen and talked about here so far. So as always, I am enthralled by this",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  },
  {
    "text": "causing a potential wave. There's a good chance that he might have traded some other things. I think that's less likely in terms of other products. My guess is it's a combination of everything we've seen and talked about here so far. So as always, I am enthralled by this story. Cannot wait to see what happens next. I think Richard and I are actually talking about doing a live stream pretty soon because we're both just so fascinated and loved doing the investigative work behind this. This is a puzzle. We both enjoy looking at quite a lot with slightly different perspectives, which makes it even more fun to share perspectives. We will see what happens as always being outlier. Let me know if there's anything I should look at. See you later.",
    "metadata": {
      "video_id": "vys1T-VeyFg",
      "title": "INSIDE Roaring Kitty's CHWY Position & GME Lawsuit",
      "url": "https://www.youtube.com/watch?v=vys1T-VeyFg",
      "upload_date": "",
      "duration": 1245.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 19,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=vys1T-VeyFg&t=0"
    }
  }
]