[
  {
    "text": "What's up, everyone? Quick GameStop update. Take a look at the expiration that's coming up primarily because we are nearing the 5th of July and we do have a handful of options that are set to expire. So what's been going on here? Well, a lot. As you guys know, I'm actually doing a live stream with Richard Newton this Saturday at 5 p.m. Pacific time. The goal of that is to spend a little more time learning about this thing and diving into the details. We're going to explore some of the cycle theories. I have a couple pieces of research that I want to discuss with him as far as the grand theory of everything because this is still way too interesting to me. So the last couple days we did see some upward drift in price. It's nothing super crazy. But essentially we had a closed two days ago at 2333. Then yesterday we went up to 2398 and then today 2437. So we are getting a little bit of positive drift. Obviously everything here is so suppressed because of this recent move. But volume is anemic, which is behind my head. So let me move out of the way there you can see volume is just so light in here, which is really interesting. This also tells me from a broader perspective that if there were a bunch of people trying to short this thing into the dirt, they would not have a whole lot of",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "of the way there you can see volume is just so light in here, which is really interesting. This also tells me from a broader perspective that if there were a bunch of people trying to short this thing into the dirt, they would not have a whole lot of resistance ahead of them because the volume is so light here. So the fact that we're basing in here is just very intriguing to me. And it's essentially been within this very, very tight range from back here on the 10th of June, which is very close to where we can use last update, which I think if I'm not mistaken on the 13th here. And but we're essentially at like 29 to the upside there and then to the downside here, 22 ish, something like that. So very, very tight range. Now if we take a look at the options chain here, there's a ton of call activity. The majority of it is at the ask or higher. So these are people that are buying calls. There are also people that are buying puts. And when I look at the volume for today, this is a little bit slower than what we've recently seen. So if I kill off this three July, we look at the two July here, we were below 200k on the call side for the first time in at least a week. Then on three July, it's still sub 200k, but kind of a little",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "than what we've recently seen. So if I kill off this three July, we look at the two July here, we were below 200k on the call side for the first time in at least a week. Then on three July, it's still sub 200k, but kind of a little bit lighter than what we saw on two July. So when I look at this, I see a couple things. I see a really big position cropping up out here in the 19th July, the 125s. And this looks again like a very much giant quantity of lot of buying. So if we kill off this quantity restriction, and then if we go specifically to the 19th July series, and then let's take a look specifically at the 125s, what I want to show you is the size of these traits. And again, they're all just very, very small. The reason why the size of the trade matters is because it gives you some insight as to the entities that might be placing them because it's very rare to have really large institutions placing one lots, five lots, 10 lots. It's kind of a waste of time for them. So the majority of volume that I see in here are pretty small positions. There are a couple like this here, which is 1,208, but it's still only at 13 cents. So it's still not a very large dollar value trade. It's just a lot of contracts because it's so cheap.",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "the majority of volume that I see in here are pretty small positions. There are a couple like this here, which is 1,208, but it's still only at 13 cents. So it's still not a very large dollar value trade. It's just a lot of contracts because it's so cheap. So I'm not sure that there's a ton to read into just yet on these 125s, other than there are a good, gillian participants that are in it. That's very clearly the case here. And the most transactions I see definitely are on the on the buy side. So again, nothing that I write home about, but something that I keep an eye on. Now, as far as other larger transactions for today, it's really smaller positions. Now, one issue with time and sales on thinkorswim is that it just uses the quantity. Really, it's better to use like a dollar delta of some sort because there are positions in here that as a dollar value are actually bigger than this one, but smaller lot sizes. But even with that, there's not a ton of them like this one right here. This 125 in 16 August, if we grab our handy dandy calculator, we take a look at the size. So that's 598 times 65. It's a 38,000, 39,000 position. So still, I would consider that on the small side. That's again, like until we start getting over like 150,000 and a position like we're talking still pretty small trades,",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "handy dandy calculator, we take a look at the size. So that's 598 times 65. It's a 38,000, 39,000 position. So still, I would consider that on the small side. That's again, like until we start getting over like 150,000 and a position like we're talking still pretty small trades, especially in something like this. Now, the good part though is with all these different orders coming in at all these different strikes, a lot of these are still in the 5 July unfortunately and the reason why that's unfortunately is because we are very quickly coming up on expiration here. And my guess is a lot of this OI that's out here in 5 July is going to just get eviscerated. So there's 192,000 calls in here. Right now, GameStop is at 2437. So if we look at everything that's essentially below that, a decent bulk of these positions are going to come off. And there's a lot of the larger positions here, kind of like in this zone. Now, we're not fully building out follow on expiration just yet. So if we clear these off, we look at 12 July that's only 70K. 19 July is the next primary. This is where most people look like they're moving into and then 16 August is still lacking behind. So I'm still seeing the overwhelming majority of people playing these really short term timeframes in here. I don't think that's anything overly novel at this point. Now, what I think",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "primary. This is where most people look like they're moving into and then 16 August is still lacking behind. So I'm still seeing the overwhelming majority of people playing these really short term timeframes in here. I don't think that's anything overly novel at this point. Now, what I think we should do though is check out time and sales, but I think we should take a look specifically at the 12 or the 19 July expiration and see what's happening out there and what trends are emerging like that. So if we sort these by size so that we can kind of parse through a little more quickly, we do have those 125 blocks. We do have some in the money 24's. These are kind of interesting because again, this is a much smaller position here in terms of contract size, but in terms of dollar amount, this also is not trivial. And I want specifically though 19 July and let me get that series. There we go. 125's, those are the busy ones. We have that 24 block, 125's tons of tons at 125. So unfortunately, this is what we've seen a lot of. People kind of speculating super far out. I'm seeing some in the mid 20s and 30s, which is good. So if you come out here, let me take a look at those standard strikes 25s still relatively heavy, oh, I moderate volume. People are building into this though because over yesterday 3500 contracts were",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "super far out. I'm seeing some in the mid 20s and 30s, which is good. So if you come out here, let me take a look at those standard strikes 25s still relatively heavy, oh, I moderate volume. People are building into this though because over yesterday 3500 contracts were opened up. Same thing for the 30s. So I'm seeing net positive flows over the last day at least and my assumption would be that that would generally continue. Interestingly enough, that actually surprises me that so many the 125's came down. That's curious. Makes sense because there's still enough time left in these positions though to get some of your money back. But there hasn't been any sort of massive moves yet. And there's still 35,000 contracts out here. I find that really interesting with the crowd that's trading options in here is that they keep going to these super far out of the money strikes. Again, they can pay out great if you get your move. But if you don't get your move, it's just lighting money on fire and it's a generally low probability play. So for me, it's not how I'm playing it. You can see like I'm out here in the 18 October that is by design. The way I trade options is very different than I think a lot of people that are trying to make a quick buck here. Last note though, take a look at this flattening of open interest. This is",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "like I'm out here in the 18 October that is by design. The way I trade options is very different than I think a lot of people that are trying to make a quick buck here. Last note though, take a look at this flattening of open interest. This is interesting. So we've gone essentially from call OI being at least two two and a half times that of put OI. It's flattening massively. We're seeing 852K calls against 520 K puts. So we need to see what's going on with this net flow. My expectation is that as soon as GameStop starts showing some significant signs of life again that these will start popping off. And I also think there's been a moderate amount of distractions if we think about it with everything that was going on in costs today. We had chewy going on. We have sear it like there's just a just a ton of different names getting thrown around and people bouncing all over. So I think once this becomes a little bit more of the focus again, we'll see more flow into this. But overall, generally quiet here on the Western Front, not a whole lot sticking out to me as always though. If anything does, I will give you guys an update. And if there's any questions, anything I should go over, let me know. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  },
  {
    "text": "lot sticking out to me as always though. If anything does, I will give you guys an update. And if there's any questions, anything I should go over, let me know. Be an outlier. See you guys later.",
    "metadata": {
      "video_id": "w1FfibJhyUs",
      "title": "GME Options Flow Update",
      "url": "https://www.youtube.com/watch?v=w1FfibJhyUs",
      "upload_date": "",
      "duration": 605.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w1FfibJhyUs&t=0"
    }
  }
]