[
  {
    "text": "you you you you you you you you you you you you and you you I want to show you something let's say that you have a graph here and let's say that this side is piano with this being your zero line and then let's say your horizontal axis is just your number of traits here and in order of you placing them and let's say that This is what your sample looks like. Okay. So, we have one scenario here. Now, let's first start with this scenario. Let's say that you just open up your brokerage platform, you export your trade performance, and then this is what you see. What kind of decisions can we make off of this? Well, as I look at it, not that fucking many, because I have no idea what any of this is pertaining to. Is this one individual ticker? Is this multiple tickers? Is this one individual strategy? Is this multiple strategies? This means nothing to me, right? I can't use this information to help me make any piece of my system better. Now, let's kind of take the scenario one step further. Let's say that you are an enterprising trader in the outlier community. And you've watched videos from a pretty ugly look in dude about trade logs. And you understand that having a record of your trades is kind of useful. You don't really understand why it's kind of annoying to do. It's extra work that you don't feel",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 36,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=0"
    }
  },
  {
    "text": "in the outlier community. And you've watched videos from a pretty ugly look in dude about trade logs. And you understand that having a record of your trades is kind of useful. You don't really understand why it's kind of annoying to do. It's extra work that you don't feel enthused about. You much rather just make the money. But let's just give this random internet dude a shot. Let's see if this idea has any merit to it. And let's take a look at a different scenario. Let's say that the scenario here instead, rather than it just being an export of your brokerage statement. And let's say instead that this is your momentum strategy. Let's say that your holding period is anywhere from one to 35 days. Let's say that these are all long options. Let's say that they're bought anywhere from 60 to 180 DTE. Let's say that the holding, we already did the holding period up here. Let's say that the average risk is 1,000. And so on and so forth. So we have some details here to go off of. If I have a trade log that tracks these details, and this is the output of that strategy, I can now begin conducting a very useful analysis. I can say things like, is there a correlation between the holding duration of the position and the subsequent outcome? So let's say for the example, I'm looking at holding duration. And I notice that for trades that",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 36,
      "start_timestamp": "00:07:20",
      "start_timestamp_seconds": 440.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=440"
    }
  },
  {
    "text": "of that strategy, I can now begin conducting a very useful analysis. I can say things like, is there a correlation between the holding duration of the position and the subsequent outcome? So let's say for the example, I'm looking at holding duration. And I notice that for trades that are greater than 20 days held. And I go through and I want to highlight those trades that are greater than 20 days held. And this is the grouping of that that I get. I now have some really interesting data to start going off of. The first thing I can tell you is that the win rate is pretty damn good. The second thing is I might be able to understand a relationship between the average winning size and the average winning size. I can also say that something squirrely happened with this one compared to all of these. If I were to draw a line of best fit through these, it would completely exclude this point essentially and it would be something like that ish. So this isn't anomaly, something happened here. Something broke down in the strategy and I should understand what it is. And I think that's the first thing I can tell you is that I'm going to be able to understand what it is. The only way, the only way you can get to this level of information is if you have a robust trade process. If you do not have an actual process",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 36,
      "start_timestamp": "00:09:04",
      "start_timestamp_seconds": 544.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=544"
    }
  },
  {
    "text": "that's the first thing I can tell you is that I'm going to be able to understand what it is. The only way, the only way you can get to this level of information is if you have a robust trade process. If you do not have an actual process that you're following for your trades, that is highlighting literally just one element of this process. That example there is highlighting this after-action review. Stage of the outlier trading process. Another really important stage that you'll see us talk about in a little bit is the way that we place our trades. The reason why this matters is because if we do not control and isolate different variables, it is literally impossible for you to make educated decisions about how you might want to refine your strategy. Based on that prior example I gave you, maybe we start to analyze, well, maybe I should let the holding duration go a little bit longer on these. Because there's something in my setup that tends to take a little longer and maybe I should start experimenting with later entries. Or a million different ideas can come into your brain based on that one simple analysis there alone. Now, the only way that we can successfully control for these different variables is if we have a repeatable process we follow, one more placing trades. Even if there are different trades, even if there are different strategies, different trade ideas. All of that, totally",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 36,
      "start_timestamp": "00:10:38",
      "start_timestamp_seconds": 638.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=638"
    }
  },
  {
    "text": "one simple analysis there alone. Now, the only way that we can successfully control for these different variables is if we have a repeatable process we follow, one more placing trades. Even if there are different trades, even if there are different strategies, different trade ideas. All of that, totally cool. We can manage all of that. But by the end of the skill dev session for today, you should have a much better idea on how to build your own process to consistently place trades. The consistency element is how you control all these other variables so that you can start to figure out what might work, what might not work. Because as you know, and I know, the majority of traders don't do this. And they just kind of randomly go off of gut feel. And then they are shocked, flabbergasted, flored even, that the results are completely sporadic all over the place, nothing even usable. And then they wonder why trading is difficult. They blame the Fed, they blame other things for their terrible performance because they suck. So let's not do that. So let's talk about this outlier trade process. This is a way to do it. This is not the way to do it. There's lots of different ways. You can structure trades and build things that might work better for you. This is literally my rendition of what I find that tends to work. So the reason why I share these frameworks with you",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 36,
      "start_timestamp": "00:11:59",
      "start_timestamp_seconds": 719.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=719"
    }
  },
  {
    "text": "it. This is not the way to do it. There's lots of different ways. You can structure trades and build things that might work better for you. This is literally my rendition of what I find that tends to work. So the reason why I share these frameworks with you all are to give you a starting point. It's not to say that like use this framework, this is the correct framework. Genuinely, not the intention whatsoever. But a lot of people don't know where to start. So while I go through this trade process with you all, I want you not to focus too deeply on the individual elements and sub components. And I want you to be a thinking trader and say, okay, yeah, I got some inspiration. I got some ideas for this on how I could build my own that might fit a little better with how I do things. That's the output that should come from here. And I encourage you to rip what I do, rip the stuff that I give you. That's the point of me giving it to you and make it your own. Turn it into something that works for you, leverage the framework. If this framework works great by itself, beautiful, then use the framework. You don't have to change it. But don't be afraid to just take inspiration from things and then to make it your own. One of the really cool things about my experience in the military",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 36,
      "start_timestamp": "00:13:28",
      "start_timestamp_seconds": 808.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=808"
    }
  },
  {
    "text": "leverage the framework. If this framework works great by itself, beautiful, then use the framework. You don't have to change it. But don't be afraid to just take inspiration from things and then to make it your own. One of the really cool things about my experience in the military is a Marine officer is a lot of what I do as a trader and in the rest of my life is literally forged by my experience there. Literally this terminology after action review is literally directly from the military. And I make that up. They did. I use it. So that's the broader point. You'll notice that there are four stages as we look at the outlier trade process. And if I were to split these, there's kind of like a preparatory stage, there's an execution stage, and then there's a post trade stage. So the preparatory stage is one and two execution. Obviously is three. And then four would be the post-grade stage. So you'll notice that there are two preparatory and then one of the other remaining. Why would that be? Well, it's because as per usual, the preparatory stage is the most important. It's where all the work is done. The rest of this is wrote process that comes out of the first two steps here. So let's run through these really quick. I'm not going to spend a whole lot of time on it because I literally already have a video that goes through all",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 36,
      "start_timestamp": "00:14:38",
      "start_timestamp_seconds": 878.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=878"
    }
  },
  {
    "text": "the work is done. The rest of this is wrote process that comes out of the first two steps here. So let's run through these really quick. I'm not going to spend a whole lot of time on it because I literally already have a video that goes through all of this stuff. I want to spend a little more time working through some examples with you all to help you get a sense of how to like functionally implement it at a high level. And then obviously for the pro members during the case study tomorrow will go deep and will actually build like a outlier trade process for a specific strategy. So we'll actually go end to end. But I want everybody to have an idea of how to execute a process like this. So the first stage of my process is looking at the portfolio fit. The reason why I look at the portfolio fit is because at the end of the day, every single individual position you put on becomes part of the portfolio. And the way that that total portfolio behaves is the sum of all the individual parts. So if you treat each individual trade as if it is a vacuum, you start to set yourself up for a big problem. Here's an example of that. If we have, and by the way, feel free to throw any questions in as we go along again, I already have a video on this whole thing.",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 36,
      "start_timestamp": "00:16:00",
      "start_timestamp_seconds": 960.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=960"
    }
  },
  {
    "text": "trade as if it is a vacuum, you start to set yourself up for a big problem. Here's an example of that. If we have, and by the way, feel free to throw any questions in as we go along again, I already have a video on this whole thing. So you're not like interrupting me. This is designed to be back and forth conversation with you guys. I'll pull the chat up in just a second. I kind of just started getting into it. Now, let's say this portfolio fit thing. You and your kind of like, I don't really know how that might look. Well, let's say here's your portfolio. And let's say all you do is sell puts. That's all I like to do is sell puts. I'm going to sell puts in Apple and Amazon. In Nvidia. I'm going to sell some puts in maybe JP Morgan. Let's sell some puts also in what Costco maybe. So I'm kind of just building out this broad portfolio based on selling puts in all these different things. Cool. Now, all of these might be high probability trades. We might be thinking to ourselves, there's a really high probability for each one of these positions here to work out in our favor. Okay, cool. So what happens if what happened the last five days in the market happens? Well, the SP 500 over the last five days has gone something like this. This period here. So even though you",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 36,
      "start_timestamp": "00:17:11",
      "start_timestamp_seconds": 1031.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1031"
    }
  },
  {
    "text": "for each one of these positions here to work out in our favor. Okay, cool. So what happens if what happened the last five days in the market happens? Well, the SP 500 over the last five days has gone something like this. This period here. So even though you have all of these individual trades that in your mind are in different tickers, so you're nice and diversified. This and this and this are essentially the same trade. They're going to behave super similarly, especially during broad market movements. They become more correlated risk becomes more concentrated when you have higher volatility environments. So you might be saying, well, the JP Morgan and the Costco, they surely help me out, right? They set things a little bit different. So I'm getting diversification from there, maybe depends on how big the drawdown is and what the market's doing. What I can tell you is right now, it's not. If this was the case, you functionally now, you thought you had five individual positions, but really you have one position. And you're placing all these thinking that these are all different things that are going to help you out in offset one another, and they're simply not, especially as volatility starts to expand. So the way that all of these individual positions fit into your portfolio has to be carefully understood. Notice the emphasis there on understood, not saying that you can't do this, you could do this if you want,",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 36,
      "start_timestamp": "00:18:25",
      "start_timestamp_seconds": 1105.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1105"
    }
  },
  {
    "text": "one another, and they're simply not, especially as volatility starts to expand. So the way that all of these individual positions fit into your portfolio has to be carefully understood. Notice the emphasis there on understood, not saying that you can't do this, you could do this if you want, but you should be going into it eyes wide open. It could be the scenario that you just happen to really like all five of those companies and unlike the majority of people who say, oh, I would love to own this at this price, you actually do want to buy them. And you've thought through them in bad scenarios, if the market goes down 30, you still are interested, all that kind of stuff is legitimate in this case, and it's fine. There's no problem, right? You should do what's right for your portfolio, but you should be aware of what you're doing. And a lot of people on that kind of scenario are not. They're not aware. And then when there is a big broad market down move, they're not protected in the way that they thought they were going to be protected. That's a massive problem. So the other things that matter from the portfolio fit is, do these additional trades move me further towards my goal? You might be saying, what goal is that? Great question. Whatever goal you've defined, because as you know, this should have been done already. You should already know what your",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 36,
      "start_timestamp": "00:19:45",
      "start_timestamp_seconds": 1185.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1185"
    }
  },
  {
    "text": "the other things that matter from the portfolio fit is, do these additional trades move me further towards my goal? You might be saying, what goal is that? Great question. Whatever goal you've defined, because as you know, this should have been done already. You should already know what your trading goal is, what we're trying to accomplish here. If you don't have that, then it becomes really difficult to know how this fits into your portfolio. And if you're moving towards your goal, because that shit's undefined, how can it work super well? The reason why the goal defining element is very important is because then we can make sure our portfolio reflects something that can lead us towards that goal. But if the goal is undefined, you obviously can't do that. It won't work. So the portfolio fit in a nutshell is where we take a holistic look at the portfolio and then the individual prospect position that we're considering putting on and we're making sure that it fits, that it makes sense. This is a big puzzle that you're building, whether your puzzle is five jumbo pieces or if your puzzle is 50 pieces, meaning obviously each piece representing an individual trade, it can be different things. So because of all of that, you don't want to start building a portfolio that when you eventually look at the whole thing, you're like, wait a minute, this isn't what I thought this would look like. That's bad news,",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 36,
      "start_timestamp": "00:20:52",
      "start_timestamp_seconds": 1252.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1252"
    }
  },
  {
    "text": "piece representing an individual trade, it can be different things. So because of all of that, you don't want to start building a portfolio that when you eventually look at the whole thing, you're like, wait a minute, this isn't what I thought this would look like. That's bad news, bears. Okay, cool. So then the next step we have, profit, mechanism, and signal. So before we place a trade, before we place a trade, we should be able to clearly identify how this idea can be monetized. How does it actually make money? And what is the analysis that I have done to help me quantify the probability, how much money I think it might make? Those details, again, matter. So these things should be generally defined already from your strategy. The skill depth session we did a couple of weeks ago was on the outlier strategy process, which is exactly where we go through this stage for the individual strategies, this stage. And we say, what are the different ways I as a trader attempt to make money in the stock market? Okay, I try to trade things directionally, sick. That is one way you can make money. Well, how do I try to do that? Well, one of the things that I'm going to do is to make money in the stock market. I try to do that. Well, one of my strategies I try to use timing to get better entries. One of my strategies I",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 36,
      "start_timestamp": "00:22:03",
      "start_timestamp_seconds": 1323.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1323"
    }
  },
  {
    "text": "Well, how do I try to do that? Well, one of the things that I'm going to do is to make money in the stock market. I try to do that. Well, one of my strategies I try to use timing to get better entries. One of my strategies I try to use breakouts. One of my strategies I try to use post earnings announcement drift and so on and so forth. By defining them in their individual categories like this, you can then create a profile for each one of these profit mechanisms. So that then you know how it behaves. You know what makes sense, which will get into in a second. So that's why I'm going to explain to you how it is that in a second of the day, you know, when you're at a realize you're going to have to have a right to start the business. And so you know, if you don't do this and you're just kind of throwing on trades as they are, even if you're right, it's probably suboptimal what you're doing. There's probably a better way to get a better return on the risk you're taking. You're already taking the risk. Why not monetize it as much as humanly possible. And again, people don't do that because they're lazy. They're like, I'm just going to keep defaulting to the same thing that I do, because I know how to do this. Okay, well, you could do that, and if",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 36,
      "start_timestamp": "00:23:29",
      "start_timestamp_seconds": 1409.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1409"
    }
  },
  {
    "text": "the risk. Why not monetize it as much as humanly possible. And again, people don't do that because they're lazy. They're like, I'm just going to keep defaulting to the same thing that I do, because I know how to do this. Okay, well, you could do that, and if it works, it works. But you have to understand the lens that I talked to you from is, is that of a, like, a professional trader. Those margins matter. And for a casual trader, they might not care. But what they don't realize, again, is that they're already taking the risk. If you're taking the risk and not ringing out is much reward as you can possibly get out of this risk, in the long run, you have suboptimal performance. And there's no reason for it. Other than, again, just being lazy. So the second step here is where we're actually going to identify those traits to then help us build an idea. Once we get through and we understand the profit mechanism and the signal as we've defined it, based on whatever ticker it is that we're looking at and our analysis, we then now get to go in and begin building a trade. Notice how late this is? We're talking about literally a trade process. And it's not until step three that even really get into the concept of a trade because the trade literally comes this late in the process. All the work is done before. So",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 36,
      "start_timestamp": "00:24:20",
      "start_timestamp_seconds": 1460.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1460"
    }
  },
  {
    "text": "and begin building a trade. Notice how late this is? We're talking about literally a trade process. And it's not until step three that even really get into the concept of a trade because the trade literally comes this late in the process. All the work is done before. So let's start putting it together as we go through the rest of these because I think it will be a little more useful for you. So let's say that we look at our portfolio and the portfolio doesn't really have a specific need and a need can be I need to trim my long beta-weighted deltas. I need to add more long beta-weighted deltas. I need to move my risk out in time because the market's becoming more correlated near term. I need to get some short theta trades on because right now I have too much long theta that's eroding the value of the account and I would like to offset that slightly. I have too much Vega in the account right now and I'm holding a fucking Vama bomb that might go off and most people don't even know what that is and I do because I study and practice and I'm not going to be the sucker that gets ran over by one or I guess blown up by one. Those are portfolio needs. So let's just say in this example the portfolio need is no but we need to increase utilization. So this means that there's",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 36,
      "start_timestamp": "00:25:28",
      "start_timestamp_seconds": 1528.34,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1528"
    }
  },
  {
    "text": "and practice and I'm not going to be the sucker that gets ran over by one or I guess blown up by one. Those are portfolio needs. So let's just say in this example the portfolio need is no but we need to increase utilization. So this means that there's no real specific way we have to do it but we need to use more of the account. How do we arrive at this portfolio need? Again super simple. I look at the list of trades that I have on right now and I look at my pre-defined profit and loss targets for each. So let's say this trade's going to make me a hundred box. This trade's going to make me ten bucks. This trade might make me a hundred bucks and so on and so forth. That's the profit side and on the risk side as I look through all of these this one I'm risking ten. This one I'm risking one. This one I'm risking ten. Whatever. I'm just obviously throwing random numbers out. But let's say that you get through running your analysis and let me get myself out of the way one sec because this is about to be in the way for you. There we go. So now let's say you get to the bottom of your analysis here and you're going to potentially make two hundred ten bucks. Well let's say that your monthly target is three hundred bucks. Guess what? God do",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 36,
      "start_timestamp": "00:26:44",
      "start_timestamp_seconds": 1604.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1604"
    }
  },
  {
    "text": "is about to be in the way for you. There we go. So now let's say you get to the bottom of your analysis here and you're going to potentially make two hundred ten bucks. Well let's say that your monthly target is three hundred bucks. Guess what? God do something. This ain't it. We're not going to get there right now. This is not this. So this tells me I need to do some shit. Some's got to happen. Otherwise this starts to leave me to falling further and further behind and then you might be asking, well how do I come up with my monthly target? Great question. This is part of that goal setting function that we've talked about previously. This is defined ahead of time. So this is how I have no specific way to get to deutilization. The portfolio doesn't have any other needs as I review the portfolio, but it does have a utilization need that I'm not hitting right now. I'm likely to miss what I'm supposed to hit at the end of the month. And obviously this is under the scenario of assuming all of these are going to be profits, which anybody that knows anything about trading is that most of these are probably going to lose. You're going to be like, well, fuck, I got to put on a bunch more than. So you need to account for this. It's not just a function of counting up the profit and",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 36,
      "start_timestamp": "00:28:11",
      "start_timestamp_seconds": 1691.06,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1691"
    }
  },
  {
    "text": "anybody that knows anything about trading is that most of these are probably going to lose. You're going to be like, well, fuck, I got to put on a bunch more than. So you need to account for this. It's not just a function of counting up the profit and loss. The way that we would want to actually do this is by using the expected return down here, which includes the probabilities for each of these and then making the decision off of this. This is just a simplified version of that for you. Okay. So now we know what our portfolio need is. We have to use some money and we don't really have any specific rules, goals, guidelines for how we use the money. It may be used, however, but we need to increase our utilization so that we can hit our monthly target. Great. So we know what we're looking for. And let's say that we got into the market and we find a trade that looks interesting. Let's say that you want to trade gold to the upside. And let's say that this is because gold is been on a tear. The market is starting to roll over and yada yada yada all these other things. So the portfolio fit for this trade that we go out and find and come back. At this point, we might say, okay, how does this how does this trade fit into the portfolio? Well, if I have mostly",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 36,
      "start_timestamp": "00:29:39",
      "start_timestamp_seconds": 1779.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1779"
    }
  },
  {
    "text": "to roll over and yada yada yada all these other things. So the portfolio fit for this trade that we go out and find and come back. At this point, we might say, okay, how does this how does this trade fit into the portfolio? Well, if I have mostly long beta-weighted delta, this will add more, but it's lower correlated. Does that resonate with what I'm trying to build right now? If it does, cool. If not, okay. And if we start thinking that in terms of what impact does a prospective trade in here have on the Greeks for the portfolio? Well, let's say that right now I'm long theta and I'm okay with that. Or actually, let's say that we're short theta. So we're collecting money. We're definitely short Vega. And this would have kind of a smoothing effect on the portfolio Greeks. So it fits in well from that lens. Okay, cool. So now we move on to stage two. We've assessed how this thing fits into things. We now need to go to stage two. What's the profit mechanism? Well, the profit mechanism is we're seeing gold go up from 2650 to 2928 over the course of the last what three months. So we're expecting that to continue based on macroeconomic factors as well. So the primary profit mechanism is direction. And we're really approaching it from a momentum lens. Oh, so what do I know about momentum? I know momentum tends to hold up",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 36,
      "start_timestamp": "00:30:46",
      "start_timestamp_seconds": 1846.18,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1846"
    }
  },
  {
    "text": "course of the last what three months. So we're expecting that to continue based on macroeconomic factors as well. So the primary profit mechanism is direction. And we're really approaching it from a momentum lens. Oh, so what do I know about momentum? I know momentum tends to hold up best with things that have gone up for the last six months. I can rank and sort things momentum for commodities is slightly different. There's seasonality to it. So on and so forth. I can go through this entire archive of qualifying factors about this profit mechanism. How do you get that archive of qualifying factors for profit mechanism? Great question. You research them. You do the fucking work. So then I start looking at the signals. And I say, okay, short term moving average is starting to roll over as it's pulling back. The 20 day moving average is still positive sloping. Price is above the 20 all the moving averages are aligned appropriately. Standard deviation channels are upward sloping. Volume average is starting to contract on the day, but it's still remaining elevated over the last five days and so on and so forth. You can run through the entire breadth of technical analysis that's tied to this profit mechanism. Whatever you've previously deemed as relevant to this profit mechanism, this is where you look at it. And then you evaluate the idea based on the entire breadth of evidence based on everything that you typically look at",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 36,
      "start_timestamp": "00:31:58",
      "start_timestamp_seconds": 1918.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=1918"
    }
  },
  {
    "text": "the entire breadth of technical analysis that's tied to this profit mechanism. Whatever you've previously deemed as relevant to this profit mechanism, this is where you look at it. And then you evaluate the idea based on the entire breadth of evidence based on everything that you typically look at for this profit mechanism. You evaluate the idea against those. Day swag says what resources should someone use to get more proficient in understanding the larger market plumbing sectors rolling over and all of that. That's a great question. I think you should look at the market. So the way to do that is you can, I mean, man, Chatchy PT is such a revolutionary tool. It's not even funny. I would use Chatchy PT and I would have it help me classify different regimes that I'm interested in studying. So if you're interested in studying larger market plumbing or rolling over of broad sectors or things like that, I literally would have Chatchy PT help me identify historic periods where we can see these different sectors starting to roll over. Right? So one of the things you can do is go into bar chart or another resource like that and you can download the sector ETFs and you can look at their performance relative to one another if you want to do a little bit of coding. If you don't want to do a little bit of coding, that's okay. The other thing you can do is go to",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 36,
      "start_timestamp": "00:33:30",
      "start_timestamp_seconds": 2010.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2010"
    }
  },
  {
    "text": "and you can download the sector ETFs and you can look at their performance relative to one another if you want to do a little bit of coding. If you don't want to do a little bit of coding, that's okay. The other thing you can do is go to really any sort of resource that has it. I'm not sure all of them, but you can take a look at the performance for the broad market over different time frames. Maybe it's completely locked up. This started doing this and I don't know why, but it makes me furious. There it goes. So I can look back over this long term time frame and what do I notice? Well, I notice that a bunch of these things started crashing in here all together. What the fuck happened there? Go back and look. This is exactly what I would do. Like this is the exact process. I would follow to help me understand these historic market moves like this. So that's a great question. And a big part of it is literally just going through and kind of exploring a little bit of what you see from historic precedent. Okay. So now we have the profit mechanism defined. We looked at all our signals. We evaluated all of them systems or go. It looks like we can build our trade. Now we move into step three. And step three is when we actually scope out the trade. So in this",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 36,
      "start_timestamp": "00:35:01",
      "start_timestamp_seconds": 2101.38,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2101"
    }
  },
  {
    "text": "So now we have the profit mechanism defined. We looked at all our signals. We evaluated all of them systems or go. It looks like we can build our trade. Now we move into step three. And step three is when we actually scope out the trade. So in this case, do I want to be long futures? Okay. If I'm long futures, what's my PNL management plan going to be? Am I going to use stops? Am I going to use mental stop hard stops? Am I going to set specific price targets? Am I going to scale in or scale out? All of these questions can be defined here in the PNL management bullet point. The trade checklist is something you can build for yourself. It's essentially a series of things to make sure that you are ticking the correct boxes before you actually launch the trade off. So they are not potentially stepping in front of something that you don't even really know is there. That's generally a bad practice. So a great example of this is if I'm trading a commodity, I should know the seasonality. Is there some sort of seasonal effect coming up that I'm not aware of? I should look at that. If I'm trading an individual ticker, there should always be an element in a trade checklist to verify earnings dates. So that if there's earnings coming up, I'm aware of where it is. So that as I'm selecting my strikes and",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 36,
      "start_timestamp": "00:36:29",
      "start_timestamp_seconds": 2189.46,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2189"
    }
  },
  {
    "text": "I'm not aware of? I should look at that. If I'm trading an individual ticker, there should always be an element in a trade checklist to verify earnings dates. So that if there's earnings coming up, I'm aware of where it is. So that as I'm selecting my strikes and my aspirations, I'm taking that into account and so on and so forth. So this is where you outline those ideas. You make your decisions. One of the most important functions during this stage is the sizing and scaling. Because let's take a look at an example quickly together. Let's say that let's say I wanted to trade this PANW just because it's up. And let's say that I wanted to buy a call in it. I think it's a good trade and I want to go far out in time because I want the call to have plenty of time to work. I kind of want to hold the company for a longer term. I come out here. I apply a standard ratio diagonal style approach. I find stuff that's liquid. Yada yada yada. And I come in and I decide that these, the 175s come in at a 70 delta. Cool. So now let's say that I'm sitting here saying, well, I think the trade might go up to 195. It's pretty close. The market's starting to drift at direction. Yada yada yada. So I come in. I do my analysis and I say, well, what's it worth",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 36,
      "start_timestamp": "00:37:42",
      "start_timestamp_seconds": 2262.82,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2262"
    }
  },
  {
    "text": "70 delta. Cool. So now let's say that I'm sitting here saying, well, I think the trade might go up to 195. It's pretty close. The market's starting to drift at direction. Yada yada yada. So I come in. I do my analysis and I say, well, what's it worth at 195? It would be 387. I'm like, oh, I'm not so jazzed about that. I'd rather make more money than that. So I just jacked this up to a three lot. Now it's 1,000 and I like that number better. Okay, great. That looks so great. And then I'm like, well, where am I going to manage the risk in this trade? Well, I don't want to manage it here at 184 right below this because it's too tight. I don't want to manage it down here because I want to give the trade plenty of room to move. I'm using a longer term trade. I'm going to maybe I'll go all the way down here to the 165 166 handle. If it falls below that, it will be below all the moving averages. It will take it out. All these successive higher lows. And I'll call that a change of marketing condition. So we'll just call it 165. Okay, fine. I come in here. And then I take a look and it doesn't have to be in here, by the way. You can literally create your own graph for this in Excel. This is just here. It's easier.",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 36,
      "start_timestamp": "00:38:44",
      "start_timestamp_seconds": 2324.02,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2324"
    }
  },
  {
    "text": "change of marketing condition. So we'll just call it 165. Okay, fine. I come in here. And then I take a look and it doesn't have to be in here, by the way. You can literally create your own graph for this in Excel. This is just here. It's easier. So 165, I plot that in. And I say, whoa, shit, I'm trading a 100,000 account. This now is going to potentially be a 47,000 loser to make a thousand. That's fucked up. That doesn't make sense. I can't do this. That's a bad risk reward for the trade. So that's the entire purpose of this here determining sizing and scaling. Because if I define those profit and loss targets based on where I think it's going to go, I can assign probability using the options, chains. And then I can say, what sizing makes sense? This, first example, is what most retail traders do. They're too focused on what they want to see themselves make. And they're not paying attention to the risk side. And then all of a sudden, you see like, oh, shit, if I apply the trade as it's designed in my first pass, I'm taking way too much risk. Something needs to change. Now, this something can be, well, instead of giving it this much room, maybe I slide it up here to the 180 handle. Well, what does that change? It decreases my loss, but it increases my loss probability. Am I okay with",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 36,
      "start_timestamp": "00:39:46",
      "start_timestamp_seconds": 2386.66,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2386"
    }
  },
  {
    "text": "way too much risk. Something needs to change. Now, this something can be, well, instead of giving it this much room, maybe I slide it up here to the 180 handle. Well, what does that change? It decreases my loss, but it increases my loss probability. Am I okay with that? Maybe depends on your idea of the trade. Or I can come in here and say, well, damn, I really would like to make a thousand bucks, but it's more important for this trade to have enough room to move. Maybe it'll go higher. Maybe I'll size this down. If I take it back down to the one lot, I'm still risking one and a half percent on the portfolio. So it's a little on the high side, but it fits within the portfolio. I can rationalize this. I'm only making three hundred fifty seven, which is not really exciting. Maybe if it gets to that point, I can set a stop and then let it continue to run to try to squeeze it for a little bit more. This is where you go through that entire scoping process to figure out exactly how this trade should be built based on your idea. Once this is done, the trade is placed. We immediately go to the trade log and input all of the relevant details. What details are relevant? Great question. All of the details that you assigned based on the profit mechanism, based on the signal, based on",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 36,
      "start_timestamp": "00:40:50",
      "start_timestamp_seconds": 2450.1,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2450"
    }
  },
  {
    "text": "based on your idea. Once this is done, the trade is placed. We immediately go to the trade log and input all of the relevant details. What details are relevant? Great question. All of the details that you assigned based on the profit mechanism, based on the signal, based on the strategy. All of this is defined ahead of time. It's already sitting in your trading plan. And if you're sitting there saying, well, shit, it's not my trading plan. Fucking fix it means you have a problem. Fix it. It should be in there. Now the last stage of the trade is the trade. We see how it goes. And then it hits one of our PL management targets, whether upside or downside. And let's just play out the scenario in PW since we're in here. And let's say it's the unhappy path. Let's say it goes down and it moved all the way down here to 165 and we get stopped out. Damn sucks. I'm going to take the trade off. I'm going to take my 1567 loss and I'm going to input all of the trade data into my trade log that I need to complete the trade log, which the fun part is it's not that much that you need when the trade is exited. Most of the details for a trade log are there for you when you first put the trade on. When a trade exits, there's only a handful of new data points.",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 36,
      "start_timestamp": "00:41:54",
      "start_timestamp_seconds": 2514.74,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2514"
    }
  },
  {
    "text": "trade log, which the fun part is it's not that much that you need when the trade is exited. Most of the details for a trade log are there for you when you first put the trade on. When a trade exits, there's only a handful of new data points. There's a new date. There's a new ticker price. There could be a new volatility. There's your exit price. There's most of the stuff is already input when you first put the position on. And then if you have a good trade log, it's going to auto calculate all the pertinent details for you into something that's consumable so that you now have a simple way to view the performance of what you're doing. So this is the outlier trade process. The entire purpose of this is to take the strategies that we build from the outlier strategy process and then to literally execute them. That's the whole idea here. So happy to talk about any of the specific details in here if you have any questions about the way that this should work if you're hung up on any of these individual points, anything like that, let me know. And we can absolutely discuss it for you. And then in the meantime, I'm going to get my dinner order started. I don't know what we should get for dinner. Like a big problem. We can go through the markets if you guys want to. I still have like 15",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 36,
      "start_timestamp": "00:43:01",
      "start_timestamp_seconds": 2581.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2581"
    }
  },
  {
    "text": "And we can absolutely discuss it for you. And then in the meantime, I'm going to get my dinner order started. I don't know what we should get for dinner. Like a big problem. We can go through the markets if you guys want to. I still have like 15 minutes. Close this off. And then I need to move myself back over to the side. This is the right set. Ben. Let's see what you got. Ben says, do you prefer automated stops or mental stops? Or do you have different types for different situations? Yeah, your instincts are exactly correct. So I have a video that will probably be useful for you on risk management for options trading. The cliff notes version for that specific question is definitely relative. And it's based on the strategy. So if I'm trading a strategy that's much more process oriented. Right. So let's say it's something like zero DTE options. I had some of those or one DTE options. I had some of those on as well that from yesterday into today. So for those, they are essentially placed. And then they're just left. Meaning what happens is what happens. The trade is going to be size the ones that I put on yesterday were actually spread off because of the vault. And that's a scenario though where the stop is built into the trade itself. Then there are sometimes where I'm trading just short strangles, something like that. And in those",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 36,
      "start_timestamp": "00:44:11",
      "start_timestamp_seconds": 2651.22,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2651"
    }
  },
  {
    "text": "is going to be size the ones that I put on yesterday were actually spread off because of the vault. And that's a scenario though where the stop is built into the trade itself. Then there are sometimes where I'm trading just short strangles, something like that. And in those instances, I typically will rest a stop. Then there are cases where I'm trading ratio called diagonals where the stop would be a mental stop. It would be a series of alerts that I actually would scale out as it goes down. So it is highly, highly, highly situation and context dependent. Now one of the downsides, especially for like the zero DTEs and stuff like that is the stops can be a little bit frustrating specifically because when you use them, you have to use the stop market order. It's the only choice that's rational, but it's also a very annoying choice. The reason why it's so annoying is because when you use the stop market, you can get it a abysmal fill. But in the case of a stop market, we're literally telling ourselves, I am prioritizing getting out of this trade when I'm supposed to get out of the trade as compared to literally anything else. So you just kind of accept that as a byproduct of that preference. So yeah, it's definitely a glorious mix. I'm going to pop the door for the real quick. Ben says, what does portfolio management look like for drawdown? It",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 36,
      "start_timestamp": "00:45:48",
      "start_timestamp_seconds": 2748.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2748"
    }
  },
  {
    "text": "of the trade as compared to literally anything else. So you just kind of accept that as a byproduct of that preference. So yeah, it's definitely a glorious mix. I'm going to pop the door for the real quick. Ben says, what does portfolio management look like for drawdown? It would seem like you would be behind on profit. Could you expand on that a little bit? What you mean? Obviously happy to answer. I just want to make sure I understand the question is relaying it out. Then in the meantime, Paula says, is into likely to show peed? Let's see. Close this? No, it is not. Yeah, no. Travel says, if I'm doing a wheel, what would be the loss? If I would not expect to buy back with loss, initially it's undefined, but for ETF like spy, not really. So for plan, how does that fit? Yeah, it's a great question. So the way to think about it for stuff like that, the covered strangle, the wheel, any of those variants is the total capital risk. Like that is your max loss. So it's low probability, not planning on taking it, but that is the max loss. So that's typically what I account for personally. If there's a spot that you think you might exit, like if things weren't going well and you're like, yeah, I might get out here if it's, you know, looking kind of sketchy or not doing what I want, then in that",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 36,
      "start_timestamp": "00:47:05",
      "start_timestamp_seconds": 2825.54,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2825"
    }
  },
  {
    "text": "So that's typically what I account for personally. If there's a spot that you think you might exit, like if things weren't going well and you're like, yeah, I might get out here if it's, you know, looking kind of sketchy or not doing what I want, then in that case, you have to use whatever that number would be, even if it's a number you don't like. But if that's not the case, then yeah, it's whatever the capital would be that's going to be locked up for a while. Ben says you were showing how you were behind on profit, you would look for more opportunities. But what if the other side of the risk side is adding up, you still look for more opportunities, definitely. It's the only way to make money as a trader, you have to look for more opportunities. If the other side of the risk is adding up, it means we have to change some shit. Either we're not doing a good job figuring out what the market's doing and we're making mistakes or we're trading a strategy that doesn't fit the current market and we might have to dust off another strategy for the current current period. But yeah, absolutely. The only way to make money as a trader is to place trades and we're all going to have losing trades. So if you're having losing trades that are successive, meaning they're starting to ramp up, then it means that you have",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 36,
      "start_timestamp": "00:49:17",
      "start_timestamp_seconds": 2957.7,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=2957"
    }
  },
  {
    "text": "for the current current period. But yeah, absolutely. The only way to make money as a trader is to place trades and we're all going to have losing trades. So if you're having losing trades that are successive, meaning they're starting to ramp up, then it means that you have a fatal problem with literally your process as a trader that you have to identify and address. And this is exactly why the trade log is so important because it literally will it will literally show it to you. If you look through all of your different strategies and you notice that one of the strategies is suffering more than others during this period, that's kind of really important information for us to have. That's really important information for us to have. We can learn a lot from that data. So we might find that our bullish breakout trades are not working well, which fun fact, they're not going to work well right now given the broader market condition. So I already know to rotate away from those and move into other shit that tends to work better. Something that works really well right now or the different ideas that I've been talking about for some time, like the earnings plays are good trading, vol and indices is good. Like there's a lot of other things to pivot to during markets like this. So yeah, definitely there's a ton. There's a ton that you can analyze from your trade log",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 36,
      "start_timestamp": "00:50:26",
      "start_timestamp_seconds": 3026.42,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=3026"
    }
  },
  {
    "text": "I've been talking about for some time, like the earnings plays are good trading, vol and indices is good. Like there's a lot of other things to pivot to during markets like this. So yeah, definitely there's a ton. There's a ton that you can analyze from your trade log to then come up with a better decision because if you don't do that, it's just guessing. But yeah, you have to even if you're having losing trades, you can't stop because there's losing trades, they're going to be part of the game. Sweet. All right, gang. I think that wraps us up. I'm going to go feed the dude because Mel is not home. As always, if you guys need anything, let me know. Tomorrow you guys will see the outlier pro or not outlier pro, the outlier quick tips video every Thursday. I'm starting to drop a quicker video. That's not 20 minutes. And discusses things, hopefully trying to give you a quicker takeaway later left, something to grab and go. So you can see those on Thursday. You need anything? Let me know. You know, outlier. See you later.",
    "metadata": {
      "video_id": "w2DMt0P-sBo",
      "title": "Outlier Trade Process Overview | Outlier Trading Skills Development",
      "url": "https://www.youtube.com/watch?v=w2DMt0P-sBo",
      "upload_date": "",
      "duration": 3179.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 36,
      "start_timestamp": "00:51:41",
      "start_timestamp_seconds": 3101.62,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=w2DMt0P-sBo&t=3101"
    }
  }
]