[
  {
    "text": "What is quadruple, witching and why should you care? We're going to go through exactly that. I got this DM essentially asking if we could talk about quadruple, witching and you know it doesn't take much to get me ready to talk about some options and derivatives. So here we go. In short, it's pretty simple. It's when we have multiple kinds of derivatives that expire on the same day. So options futures, single stock futures, stuff like that. I actually made a little table to make it easier to tell and you'll notice there's actually more on here than just quadruple, witching and I'll explain exactly why. Double witching essentially happens monthly and it is not a big impact. So you could just essentially drop that off the bottom of your mind. It doesn't matter. Just know what to think. Then there's triple witching. This is kind of phased out when we started launching single stock future explorations. When this was added, it essentially all became quadruple witching. So triple witching is legacy. You'll hear people refer to that, but really they're referring to quadruple witching. And when does it happen? It's the standard expiration cycle for derivatives, which is the third Friday of the month. What months you might ask March, June, September and December. So what's happening here on quadruple witching days, which one of them is coming up very soon. Today's the 19th of June. We have stock options, stock index options, stock index futures and",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 7,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=0"
    }
  },
  {
    "text": "is the third Friday of the month. What months you might ask March, June, September and December. So what's happening here on quadruple witching days, which one of them is coming up very soon. Today's the 19th of June. We have stock options, stock index options, stock index futures and single stock futures, all that expire on the same day. A lot of explorations that all kind of line up with one another. The reason why this matters is because a lot of institutional driven market activity will kick off. There will be a lot of transactions that are coming in two different forms. We have market makers that are going to be hedging positions coming into expiration for a lot of individual products that may or may not correspond with one another. But then you're also going to have the speculators, the position holders, again, on the institutional side that have positions that are closing down that they have to reopen further out in time. This actually leads to different kinds of arbitrage and trading opportunities for more sophisticated traders, which we could do a video on at some point. But I want to walk you through most importantly, what the impact is to the market. It's kind of twofold. You'll notice that volume is typically going to go up and you'll notice that volatility tends to spike and then contract again, depending on the rest of the broad market cycle. But there definitely is a higher probability of",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 7,
      "start_timestamp": "00:01:06",
      "start_timestamp_seconds": 66.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=66"
    }
  },
  {
    "text": "what the impact is to the market. It's kind of twofold. You'll notice that volume is typically going to go up and you'll notice that volatility tends to spike and then contract again, depending on the rest of the broad market cycle. But there definitely is a higher probability of market volatility starting to kick off. So let's take a look at a few things. The first thing is I want to show you some data. This is from the past 10 years of quadruple liching cycles. And if we look in 2023, the dates for these, we have March 17th, June 16th, September 15th, December 15th. So again, you can kind of be a trend there, right? 16th, 15th, 17th, third Friday of the month. So we'll see what date that typically falls around. And then you can see obviously we're just confirming these months. So what this is actually looking at is the SP 500 performance for each of these five days before on the day of five days after. I also look at that for the VIX. This isn't really designed to be parsed through one by one. I've aggregated it for you here. And again, for anybody that's in the Patreon, you can download these. I'll throw a post and then for those that are not, you can just grab a screenshot. Now this is kind of the summary and what matters a little bit more. So you can see again, we have those same things.",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 7,
      "start_timestamp": "00:02:13",
      "start_timestamp_seconds": 133.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=133"
    }
  },
  {
    "text": "anybody that's in the Patreon, you can download these. I'll throw a post and then for those that are not, you can just grab a screenshot. Now this is kind of the summary and what matters a little bit more. So you can see again, we have those same things. SP 500 and the VIX five days before on the day of five days after. We have the average percent move, the percent positive moves, percent negative moves, max and min percent moves. Now the SP 500 for essentially around the event, it doesn't really move that much. It doesn't care quite a lot. What we do see that is kind of important is the number of positive events for the SP 500 before is statistically significant, 70.83 of the time. But this can also be attributed to other things like positive drift. So it's not necessarily quadruple, which yields this. It's not so much the case. And we could do a little bit of a deeper study to control for that hypothesis. None of it really matters that much. I'm just giving it to you for some general data points. Then on the day of the SP 500 actually has more negative days than positive. And the average move is 0.38 negative. So on the day of, we typically see the SP 500 contract a bit and then five days after, we actually still have a little bit of a negative skew, but overall positive average return. Again, that",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 7,
      "start_timestamp": "00:03:22",
      "start_timestamp_seconds": 202.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=202"
    }
  },
  {
    "text": "has more negative days than positive. And the average move is 0.38 negative. So on the day of, we typically see the SP 500 contract a bit and then five days after, we actually still have a little bit of a negative skew, but overall positive average return. Again, that just means that the positive moves are bigger than the larger occurrence of negative moves. So positive drift, very large. In terms of direct, tradable event, here the main things would be five days before on day of, you can come up with a simple hypothesis or you could try to trade the volatility. So then you can also take a look again at the VIX metrics. One thing I notice here that's actually very interesting is five days before we see the VIX tends to move down and that generally aligns with the normal relationship between the SP 500 and the VIX, SP 500 very frequently when it goes up, the VIX will go down. Not always, there's always exceptions and funny enough there's an exception baked into this. If you look on the day, even though there are more negative days for the SP 500, the VIX also tends to contract. So this very commonly is due to the market is seeing a slightly heightened fence coming into the event potentially. Then during the event itself, it's not necessarily producing a whole lot of fireworks. So then volatility also will contract even though the SP 500 has a",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 7,
      "start_timestamp": "00:04:24",
      "start_timestamp_seconds": 264.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=264"
    }
  },
  {
    "text": "tends to contract. So this very commonly is due to the market is seeing a slightly heightened fence coming into the event potentially. Then during the event itself, it's not necessarily producing a whole lot of fireworks. So then volatility also will contract even though the SP 500 has a very, very small down day on average. So the impact to you as a trader is kind of simple. You should be aware that it exists. Your positions likely depending on the position, not likely to be blown up because of this. This isn't something that should freak you out, scare you, anything like that. You should simply be prepared for increase market volatility, potentially increase in market volume. We also might not want to trade a whole bunch on the day because as volatility tends to increase, bit-ask spreads will widen out a little bit. But again, it's not that big of a change. So it really doesn't matter a ton. The way I look at this is this is kind of like a secondary force at this point. Markets have become way more efficient. As you go through this data, you'll actually see that the impact decreases as we get closer in time. So it used to be kind of a bigger deal back in the day, fewer explorations, bigger deal, not so much now. Still something to be aware of, but not a massive driver. So as always, if there's any other follow-up questions you have on",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 7,
      "start_timestamp": "00:05:31",
      "start_timestamp_seconds": 331.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=331"
    }
  },
  {
    "text": "we get closer in time. So it used to be kind of a bigger deal back in the day, fewer explorations, bigger deal, not so much now. Still something to be aware of, but not a massive driver. So as always, if there's any other follow-up questions you have on this or want me to take a look at, I am happy to be an outlier. See you guys later.",
    "metadata": {
      "video_id": "WBN4Ph5Qz38",
      "title": "Quadruple Witching Explained",
      "url": "https://www.youtube.com/watch?v=WBN4Ph5Qz38",
      "upload_date": "",
      "duration": 428.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 7,
      "start_timestamp": "00:06:45",
      "start_timestamp_seconds": 405.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WBN4Ph5Qz38&t=405"
    }
  }
]