[
  {
    "text": "Options are really cool because they let you trade a lot of different things. And one of those things is volatility. You can trade the behavior and the movement of a stock versus the price direction itself. And it provides another source of returns. So that when the market's going down or when it's not doing what we want, there's other ways we can make money. Now, one of the cool things you can trade is earnings. And right now this is STNE. They have earnings coming up. And if I show you this chart here, it's pretty interesting. This actually plots the volatility for different timeframes. And this is something I've shared before. Those that are in the Patreon, you can download the thanks script here for free. It's super simple to make. You can make your own effectively. What this is is we can see that starting typically about two weeks out before earnings, volatility implied volatility will start to expand. Both short-term and long-term. And then after the earnings release, typically speaking, we will see the volatility absolutely catastrophically contract. So we can trade both the expansion of volatility into the earnings release and then the contraction, those release. Be an outlier. See you later.",
    "metadata": {
      "video_id": "WbthjkVUU6c",
      "title": "Trading earnings with options",
      "url": "https://www.youtube.com/watch?v=WbthjkVUU6c",
      "upload_date": "2025-04-08T16:30:15Z",
      "duration": "PT1M9S",
      "channel_name": "",
      "description": "💡Trade alongside Erik and level up your strategy inside the Outlier Pro Community—get exclusive weekly livestreams, private chat access, market & trade analysis, direct Q&A, and more. https://www.patreon.com/OutlierTrading\n\n▬ RESOURCES\n► Free Guide for Beginner Options Traders. https://www.outliertrading.io/guide\n► Join the FREE Outlier Community Discord. https://discord.gg/hYGZUEJpve\n► Subscribe to the Outlier Insights Newsletter. https://outliertrading.substack.com/\n► Listen to the Outlier Podcast. https://www.youtube.com/playlist?list=PLAFDZ3YyC4rSe9h-s9XvtxktSm16-7-9L\n\n▬ DISCOUNTS\n► 50% off Options Omega Backtesting. https://optionomega.com/register/esinvests\n►50% off the ORATS Platform and Tool Suite! \nhttps://orats.com/esinvests\n► Barchart Premium - Try for Free. https://www.barchart.com/get-barchart-premier?fpr=xaiek\n► 5% off Unusual Whales Options Flow Platform. http://unusualwhales.com/referral#esinvests\n\n▬ VIDEO NOTES\n#optionstrading\n\n\n\n\n\n▬ DISCLAIMER\nThe content presented is for informational purposes only and any opinions, news, research, analyses, or other information contained are provided as general market commentary and do not constitute investment advice. Outlier Trading, its affiliates, and employees are not responsible for any investment decisions made based on the information presented. Outlier Trading does not guarantee the accuracy, completeness, or reliability of any information presented and is not liable for any losses or damages arising from the use of or reliance on this information. By accessing this content, you acknowledge and agree to these disclosures and terms of use.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WbthjkVUU6c&t=0"
    }
  }
]