[
  {
    "text": "What's up everybody Eric here? We are back with the Outlier podcast and I got my friend Jim Ropel here. He and I actually, we connected like almost a year ago and then we kind of, you know, fell off for a little bit, but I'm absolutely stoked to have you on. I have done a lot of homework and I follow a lot of what you talk about and I am really excited to dive into your approach to the markets because as we were talking about right before we started, a lot of what you do is different than what I do. And that's one of my favorite parts about the podcast. One is I get to learn about other approaches, but then two, we get to put different ideas in front of people and then let them see what works for them because there's a lot of ways to make money in the market. So welcome to the podcast. Thanks for taking some time to hang out. Thank you very much for having me here. It did take a long time to get this scheduled, but we're doing it. That's it. You know what? The thing is it's like, I'm not always great at stuff, but I'm pretty damn persistent man. So like, I'm always around. So whenever it lines up, it lines up. If it doesn't, it doesn't say lovey, but I'm actually really, really stoked that we had a chance to line up because like",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "it's like, I'm not always great at stuff, but I'm pretty damn persistent man. So like, I'm always around. So whenever it lines up, it lines up. If it doesn't, it doesn't say lovey, but I'm actually really, really stoked that we had a chance to line up because like I was telling you right before we started, I am not like a good friend, but I know Matt Cruz so pretty well here and I have talked quite a few times and I get a chance to talk about kind of like the, you know, small cab growth stock style style. That's a lot of, you know, cancel him based, but I know that you obviously had a relationship with Bill O'Neill, talked to me a little bit about your background. There's a lot of information out there. I'll put a link to your website in the notes below for people that want to like, really dive in and learn all about you, but to get like a high level summary, just to introduce you to the audience, at least my audience, so that they kind of an idea of where you're approaching this thing from just a quick background on how you got started in markets and kind of generally what your approach looks like. You know, my dad, my grandfather worked at Bailey Pindwell machines in the stamping plant. This is 80 years ago or more and Bailey came public and he got stock as an employee.",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "background on how you got started in markets and kind of generally what your approach looks like. You know, my dad, my grandfather worked at Bailey Pindwell machines in the stamping plant. This is 80 years ago or more and Bailey came public and he got stock as an employee. I mean, he was a factory worker and so my dad started to watch Bailey and my grandfather. My dad always talk about it and then I went to college and my two best friends happened to be both very much into the market. One of their fathers was a stock broker. I opened an account with him and just the people around me were in. Now my dad had no money. Okay, I don't want to confuse things. My grandfather had like, you know, 38 shares of that ballet or something. There we go. But my buddies were very into it and we studied the markets. The crash of 87 happened. I took four and a half years because I was persistent and to get there to graduate. In 87, I graduated. The crash really shaped me and I, when I did an interview for a job as a stock broker, which I didn't realize was a call, a cold call cowboy, wasn't a stock broker. There was no, you know, analysis going on. It was a sales job. I was hired and I was a loser in the markets for many years and one day I went to",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "stock broker, which I didn't realize was a call, a cold call cowboy, wasn't a stock broker. There was no, you know, analysis going on. It was a sales job. I was hired and I was a loser in the markets for many years and one day I went to the 7-11 where they had space invaders, that was a ballet midway machine and I got an IBD and investors business daily and I read it and then I read the bill's book How to Make Money Stacks and that was the game changer. My life immediately changed. Number one reason was I let my losses run when I was a kid. This is the long time ago. Okay. This is 1987. 1988, 89. I was fascinated by the markets and what they could do and I love the interaction of whether news, innovation, interest rates, politics, I mean, everything. It fascinated me. I loved it and I, a meet after I started cutting my losses. I started to implement better selection criteria and then technical analysis and my results, well, I immediately stopped losing money. Like, and then with time in learning how to implement, my results started to get better and very good and very, very good and I eliminated the boom bust and I became more consistent and then I started occasionally every few years to tangle up into a very big stock and I made some pretty big money a couple times and that's the background,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "get better and very good and very, very good and I eliminated the boom bust and I became more consistent and then I started occasionally every few years to tangle up into a very big stock and I made some pretty big money a couple times and that's the background, man. Yeah, it's awesome. It's so fascinating to me how many people I talked to on this that have so many similar aspects to their background and how this whole thing started. I think, you know, as you're talking about your just general interest in the connection between things, I 100 I'd benefit with that. It's like looking at the markets is one of my favorite ways to learn about our world because especially like all these different news sources are so political like you never can figure out like what the fuck I'm reading. But then when I'm reading about anything from a financial perspective, like they don't give a shit. Like if it makes dollars, it makes sense if it doesn't, it doesn't, but it's like typically a pretty decent way to consume information and the other thing you said that I really identified with is the disposition effect where traders tend to let losses run cut winners too short. I think that's like one of the first pivotal things that we all eventually change. So it's funny that you highlighted that one as well. Quick follow on question for you. When you first read Bill O'Neill's book,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "effect where traders tend to let losses run cut winners too short. I think that's like one of the first pivotal things that we all eventually change. So it's funny that you highlighted that one as well. Quick follow on question for you. When you first read Bill O'Neill's book, did you look at this optimistically and like did it click and you're like, oh, I've been doing this wrong. I think this will work or was it more of a I don't really know. Let me just try. See if it works. I'm curious how you approach the world of technical analysis specifically because a lot of people they'll say it's either voodoo or it's not, you know, that kind of stuff. I need to tell you a little bit about my disposition. I am very questioning account or intuitive. And if you tell me no, that means I'm going to do that. And my buddy gave me a book called a random walk down Wall Street. And I read it and I'm like, this is bullshit. I said, this is right for most people, but not except not people who are willing to do things that others aren't. And then I read about people who are the outliers. And I said, most people never be an exceptional outlier because they won't apply themselves. So I read Bill's book. And there are many styles. Many there's probably 30 styles on how to invest. You have to find one that",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "And then I read about people who are the outliers. And I said, most people never be an exceptional outlier because they won't apply themselves. So I read Bill's book. And there are many styles. Many there's probably 30 styles on how to invest. You have to find one that resonates with your nature. It's got to agree with your DNA. There are a lot of styles that work, but they won't work for the wrong person or they won't work if doesn't agree with you. And it agreed with me very well. And I coach so well. And I felt like through the book Bill was talking to me. And then I started to go to see him to when he would speak. Initially, he would speak for free. And then the price went to 300 bucks, then 500, then 10,000. And I went to see Bill probably two to three times a year starting in around 1990-ish until a few years ago. And so I also became an institutional customer of William O'Neill when I opened my first hedge fund where I would talk to Bill all the time. I mean, so I'm trying to answer your question. I might have gotten down a little bit of a tangent. No, it was perfect because essentially you were helping me understand how you approached the methodology and how it resonated with you. Because like I said before, when I actually just interviewed Tom Sausneroff not too long ago another",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "I might have gotten down a little bit of a tangent. No, it was perfect because essentially you were helping me understand how you approached the methodology and how it resonated with you. Because like I said before, when I actually just interviewed Tom Sausneroff not too long ago another time who's a big options trader not sure if you're familiar with him. He runs up pretty big network. And he came from the pits. And for him, he built Thinkor Swim, which is a pretty popular platform. And like when they first built it, it didn't have charts because they never used them. They all thought charts was like fucking wizardry. So the a lot of people I find have like this polar relationship with technical analysis, but it sounds like it really resonated with you. Like when you looked at it, you're like, this makes sense. I can get behind this idea. I think if you look at the book, all the market wizards books, you look at all the greatest traders in the world. There's only one that I'm aware of Michael Steinhardt who was a fundamentalist. All I don't like apps in terms. Everyone I'm aware of, Altaidist Steinhardt was a trend follower. And charts are a visual way to follow a trend. I don't really think charts are predictive. I think charts give you a clue of the trend and trends fail. Most trends fail. Most breakouts fail. Why is why risk management is so",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "of, Altaidist Steinhardt was a trend follower. And charts are a visual way to follow a trend. I don't really think charts are predictive. I think charts give you a clue of the trend and trends fail. Most trends fail. Most breakouts fail. Why is why risk management is so critical? That's kept me in the business for 30. I don't know. I started in 87. So whatever. How long that is? I don't know. If you try to trend follow when you don't have risk management, you're going to wipe out quickly. It's, in fact, the market will seek its level. It will find your weakness. If you're greedy, if you're impulsive, if you're fearful, if you're, I mean, whatever your weakness is, the market is going to expose you quickly. And you're going to learn about yourself very quickly. You're going to take a lot of losses and a lot of bruises. The number one key to spot a liar is I'm great. I'm the greatest. I'm killing the market. I've killed it every year for a thousand year. Lying. You talk to the greats and they are except for one or two that I know of. And the one guy who thinks he's great has not made any money. The other one is kind of great. And he has made a lot of money, but he's vocal about it. But people who are arrogant, the market will pound you down. It's going to beat you down. And",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "the one guy who thinks he's great has not made any money. The other one is kind of great. And he has made a lot of money, but he's vocal about it. But people who are arrogant, the market will pound you down. It's going to beat you down. And you, the market teaches you to be cautious and careful and not arrogant. The market will expose your arrogance if you're, you know, I mean, so anyway, there's another giant tangent for you. I love that tangent because I think, and that's one of the biggest things I always hypothesize trips a lot of technical traders up is when they apply their analysis, they start to say like this should happen. And they kind of create their own reality on what they think should happen completely for going the fact that the market doesn't give a flying fuck what they think should happen. It couldn't possibly care less. And to your point, that's where a lot of not speaking an absolute. It's so funny when you said that because I 100 resonate with that. I refuse to because if I'm looking at a chart, I actually like to apply technical and not, but I always view it as like probabilistic outcomes based on what I see, what is more probable here or what's the risk to reward here, not a determinant this should happen. May or may not. I don't know. The most technical patterns, whether it's a head and",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "and not, but I always view it as like probabilistic outcomes based on what I see, what is more probable here or what's the risk to reward here, not a determinant this should happen. May or may not. I don't know. The most technical patterns, whether it's a head and shoulders or a cup and handle or whatever you want to call it, the pattern will morph before it emerges out of the pattern. You think it's going to emerge out of. So that's why jumping the gun is such a flaw. And that's what I want to say. Yeah. So speaking of your kind of approach here and obviously you're talking a little bit about the specific timing element, everybody that I know that trades can slim, they tend to have their own twist on things. You know, they don't necessarily apply like purely what they see in the book. So based on your approach to canceling what's what does that look like? Is it a pure play based on what I've seen you talk about it doesn't necessarily seem that way. But I'd love to dive into kind of your approach to canceling. So I think the Japanese had it right. Why invent anything? I am a knockoff artist of a someone who's well known who is not a snake oil sailsman salesman who probably made a billion dollars. And if he didn't pay so much in taxes like Buffett, he probably worth billions. If I'm half as",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "had it right. Why invent anything? I am a knockoff artist of a someone who's well known who is not a snake oil sailsman salesman who probably made a billion dollars. And if he didn't pay so much in taxes like Buffett, he probably worth billions. If I'm half as good, half is good. And I only make 500 million. I'm probably going to be just chill with that. I am a not I don't deviate. Now there are some things that I've learned that I do apply, but they're almost tertiary. There's things about the market that I've learned that Bill didn't cover in the book. And I just I just knocked him off. And why deviate? If you want to build a birdhouse, why draw it up on a piece of paper yourself and you give by a book. And the guy's going to tell you exactly how to build the most beautiful birdhouse ever. Now again, the saying this difference between a hero and a crowd is one step forward. If you do what everyone else does, you're not going to be exceptional. But I'll respond to that with I saw Bill live in a room of 400 people in it. And he goes, how many people only buy new highs? I raised my hand and not a 400 people that were like five. The rules, the book reminiscences of a stock operator was written in the 1920, 100 years ago, roughly. The the the the the",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "400 people in it. And he goes, how many people only buy new highs? I raised my hand and not a 400 people that were like five. The rules, the book reminiscences of a stock operator was written in the 1920, 100 years ago, roughly. The the the the the manual is there, but people can't follow it. They either don't have the emotional intelligence, don't have the perseverance, don't it, you know, there's a lot of reasons people fail, but the the road map is there. So I am saying I don't want to you know, build the clock again without the manual, but I want to follow the manual. Most people don't won't do that. And Bill doesn't talk enough about emotional control. Which is really like I said, the manuals there, the it works, but you can implement it because they don't have the discipline, they don't have the patience, they're emotionally, you know, they're trying to survive. Okay, think about the and I'm a huge Republican. Okay, I was going to say it, but I sympathize greatly with a single mom with two children and a deadbeat ex-husband. How much, you know, what is her ability to get you clothes fed off to school, work grass off all day, get you guys home from school, get you dinner, and then hit her second job. We're in there, does she get to read Bill's book and then implement it and get 10 grand to start trading with?",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "to get you clothes fed off to school, work grass off all day, get you guys home from school, get you dinner, and then hit her second job. We're in there, does she get to read Bill's book and then implement it and get 10 grand to start trading with? Like, you know, there's a you have to be in the right position and I believe you make your own outcome. I totally believe in self-responsibility. You're you are where you are because the decisions you made, nobody else, everyone has curveballs. The meteor flies out of asteroid flying to life and smash your shit. That happened, it's how do you handle that? How do you overcome that? The losses I took when I was young were horrendous. It was emotionally beating, but I never gave up. Ever, you know, even I have bad years now. You know, I've been in the business since 87 to today. I probably have a bad year. I want to say this. People who lie say I'm up 30 every single year. Well, that's not possible with the method we use. If you're you're going to have very big years and then small losses in years, that's why Grooney made off suckered everybody because he promised the Holy Grail, which was unattainable. It was 1 a year, I'm sorry, 1 a month every month with no down months. It's impossible. Sounds good though. Yeah, it's great compound. You compound 12 out of year for",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "in years, that's why Grooney made off suckered everybody because he promised the Holy Grail, which was unattainable. It was 1 a year, I'm sorry, 1 a month every month with no down months. It's impossible. Sounds good though. Yeah, it's great compound. You compound 12 out of year for 50 years. How much money? Months. Literally tons. I think and that's actually funny that you bring that up because that's one of the things I've always revered about the way you guys trade is because you have this streakingness in your performance. Like when I talked to Matt, I came across as US investing championship performance, which is like 300 plus percent in a year. So I trade derivatives. I trade both sides, primarily options, sometimes futures depending on the product, but like my best year ever was just over 50 percent, which I'm super proud of that, but that's still like a sad, sad comparison to what you guys can produce. But I don't know. I don't know. You know, what are your down years? Like if you can keep your down years, it will single digits and you have a 50 year, every five years, and you have a bunch of 20 years, your 50 is huge. 300 with a 200 drawdown, or you know, an 80 drawdown. That's nothing. 50 up years with 9 max drawdowns, you're going to make money. Definitely. Yeah. And it's that's essentially what I've built my entire world around is the",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "have a bunch of 20 years, your 50 is huge. 300 with a 200 drawdown, or you know, an 80 drawdown. That's nothing. 50 up years with 9 max drawdowns, you're going to make money. Definitely. Yeah. And it's that's essentially what I've built my entire world around is the vast majority of the down years are small and they're super and frequent. Now I had down years when I first started, but to be also very clear, I've seen 50 once. So I have most of my time. It's somewhere in the 20s. So it's still very, it's still really good for me. I'm 32. I'm in the market since 2007. So 16 years. You're 100 years coming. It's in front of you. Well, I'll keep looking for it because it hasn't popped up yet, but I'm eager. If you wanted it'll come. Yeah. Well, and that's actually one of the cool things as the account has grown is I'm really receptive to different approaches. So for a while, I traded a lot of volatility. Valtility trading can be very boring. It's a more of a numbers thing and it's an aggregate, but it's very consistent. But I started developing different strategies. Still be a derivatives that let me take advantage of some of the things that you guys like to look at. So that's what I want to spend a little more time on. So you talked about there are things that you've learned that build didn't cover",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "developing different strategies. Still be a derivatives that let me take advantage of some of the things that you guys like to look at. So that's what I want to spend a little more time on. So you talked about there are things that you've learned that build didn't cover in the book. One of them you were talking about how you wanted him to talk more about emotional kind of side of things. But what are some of the specific market things that you've amassed over your career that you don't think Bill covered in the book? I am very much like Bill, a tremendous optimist. But I'm not a permabull. I will go to cash, but I understand there's bad periods. And Bill said, look, in a downtrend, you have to go to cash. But he never really explained about the magnitude of how long bears can be and how brutal they can be. And if you're not careful, how much you can lose, he said, look, just color your losses 7 and walk away. And he didn't really go into the pain you're going to endure even the greats if you persist in this endeavor. There's a, oh, God, you know, I could go through my thing and find some gym rules for you. I have 65 Bill rules. Bill's golden, since Bill's no longer with us. I now have the gym rules, which I probably know are near as valuable as the bill rules. But maybe",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "oh, God, you know, I could go through my thing and find some gym rules for you. I have 65 Bill rules. Bill's golden, since Bill's no longer with us. I now have the gym rules, which I probably know are near as valuable as the bill rules. But maybe I'll look some up, will you ask me another question? How about that? Yeah, yeah. I definitely want to hear more about the gym rules. So, yeah, when I think about a lot of what Bill taught me, it definitely was looking for strength. It's not really accepting anything less. And one of the things that he really encouraged me to adopt is a difference psychology when it came to specifically for bullish plays. But when I'm looking for bullish plays, I'm looking for reasons to say no. And as soon as I see one, then that's the reason it's time to move on to something else. Whereas I feel like a lot of retail traders, it's the inverse where they're trying to convince themselves to say yes. So when you're hitting a home run here, okay, there's 55 public, 5500 public companies, I am distilling that down to like four. I am so selective beyond incredible selectivity. I am looking for excellence across the board in all metrics. I won't put a trade on unless I feel I am being forced to buy or forced to sell. I don't ever anticipate I over after cutting losses, which is the",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "four. I am so selective beyond incredible selectivity. I am looking for excellence across the board in all metrics. I won't put a trade on unless I feel I am being forced to buy or forced to sell. I don't ever anticipate I over after cutting losses, which is the rookie mistake of rookie mistakes, not cutting losses. The second biggest rookie mistake is overtrating. And I over trade like a champion. I was a rock star at everybody. Every trade used to get a confirmation in the mail. And it was like a blizzard flew into my house when the mailed guy showed up. Anyway, I need the market to force me into it. And the more I trade, the more I lose, the more I get emotionally caught up in things, I'm no longer trying to pull the arm on the slot machine. I am not trading the less I trade, the better I do, the more patient to I be patient, emotional control, discipline, long durations, outlooks, look 20 years down the road in I'm going to be doing this for 20 years or more. These are all the reason people fail is all those reasons right there, man. So do we have some some gym rules? Yes. Perfect. Well, while scenarios are so abundant, but the markets are lie detectors and fair it out the truth. Price does not lie or it can't lie for very long. Think about the invasion of Ukraine, expectations were food",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "there, man. So do we have some some gym rules? Yes. Perfect. Well, while scenarios are so abundant, but the markets are lie detectors and fair it out the truth. Price does not lie or it can't lie for very long. Think about the invasion of Ukraine, expectations were food and energy shortages. Like they were talking about in Germany, they were going to freeze the death in the winter. Yes. And there was going to be, you know, the price of wheat was going to go to 50 million dollars of bushel. Price of wheat went down. And no one frozen Germany. Okay. I mean, I can go on and on and on about just false narratives. You have to remove your personal bias and forget the news and follow the price. But you can get really scared by there's going to be starvation. Like literally, you're talking about wheat prices, Russia's, sorry, Ukraine's the fourth largest wheat producer in the world. And you know, that's what a lot of people like subset they live on didn't happen. Let's see here. I can, you know, the greatest trader in my view is Stan Druckenmiller. He makes mistakes. He in 2020 got it wrong and he didn't make money. Oh God, I, you know what? Look, I hear something. Bill didn't really talk about this as much as I thought, but the average true market leader goes up about 94 to 98 weeks. It's it's four to six beat and",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "2020 got it wrong and he didn't make money. Oh God, I, you know what? Look, I hear something. Bill didn't really talk about this as much as I thought, but the average true market leader goes up about 94 to 98 weeks. It's it's four to six beat and raise quarters. The death, my definition of a true market leader is four to six beaten raised quarters. If you can get in a stock in the right size and sit that that's how you're going to make an absolute killing. And the the stocks that I've made the most money in were all through beaten raised quarters. It was Bill stressed earnings and earnings growth. But he rarely talked about beat and raise. The reason stocks move is because there's an earnings report. They beat, now the analysts have got to raise guidance. Do you know the estimates were a dollar. They blow it away. The next year they had to for two dollars. Well, they got to raise it to three. Now that new information has got to be discounted into the price and up goes the price. That's how you get beat and raise or I'm sorry, that's how you get prices to move. The new information now has to be factored forward. You know, Bill never talked about volatility contractions. Like the Bitcoin market right now is dead. The volume is dead. No one cares. AI has stolen Bitcoin's thunder. The story of Bitcoin has only",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "that's how you get prices to move. The new information now has to be factored forward. You know, Bill never talked about volatility contractions. Like the Bitcoin market right now is dead. The volume is dead. No one cares. AI has stolen Bitcoin's thunder. The story of Bitcoin has only become richer and the contraction and volatility. We're at some of the lowest levels of Bitcoin volatility in history. Along with whale accumulation. But anyway, dude, I don't I have to really sort these out because there's so many of them and I don't want to waste your time. Well, I read looking for them. I honestly, I like those ones that you shared anyways, but oh, Bill was a very heavy, Bill was a very heavy user of margin, which he talked about, but he didn't talk enough about it. He didn't talk enough about money management either. He would say, oh, you have an account with the hundred grand should buy four stacks. Like he didn't, he said, his money management was, you really shouldn't know more than seven rate stacks. Like he didn't go into that enough. Man, I do know how about I'll send you a couple of them. You can post it up on your website or when I love that. Yeah. Well, and you actually just hit another thing I wanted to ask you about, which is, you know, exactly the way that you think about managing your book because to your point, if",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "couple of them. You can post it up on your website or when I love that. Yeah. Well, and you actually just hit another thing I wanted to ask you about, which is, you know, exactly the way that you think about managing your book because to your point, if you want to catch these big runs, you can't be too spread out, right? If you have a little bit in a ton of different things, you get a giant move. It doesn't really fucking matter. But if you're too centralized, then obviously that presents its own issues. So how do you find that balance? This is an unbelievably good question because in markets like we're in right now, size kills, size kills, size kills in many ways. Most great money managers attract so much that their performance is diluted. It's like putting center blocks on an Olympic athlete. He is an Olympic athlete, but you wait a professional money manager down with too much. You know, I think can slim in a large scale is difficult to run over a hundred or two hundred million dollars. There's not enough liquidity in today's market due to the amount of takeovers and mergers and buybacks. This supply stock is shrunk. So liquidity's gone and you took out the specialist and the market makers and now it's run by algos. There's not enough liquidity. Like you being in the futures market, you could scale futures account into the billions. You really could.",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "and mergers and buybacks. This supply stock is shrunk. So liquidity's gone and you took out the specialist and the market makers and now it's run by algos. There's not enough liquidity. Like you being in the futures market, you could scale futures account into the billions. You really could. So what was the question? Well, quick caveat there, everybody. Eric is not scaling into the billions just throwing it out there. But not yet. No, I was asking essentially how you find the balance between having too big of a book where if you get your move, it doesn't really matter versus having too small of a book where you can get ran over if you're wrong. I just think Bill's stated method is very difficult for most people to implement because price will hurt you but size will kill you and Bill stresses concentration. But I literally will trade 100 lots in testing a new bull trend and I'll trade 400,000 shares in bull markets in one stock depending on the price. I'm looking to put 5 to 10 million in each position. So I'll just tell you sorry. There was a computer system that was used on the Chicago Stock Exchange many, many, many years back and this guy was the biggest trader on the floor in Chicago. He looked three doors down for me. I told him I had 27,000 shares of seabull systems in my personal account and he looks at me and that's just",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "the Chicago Stock Exchange many, many, many years back and this guy was the biggest trader on the floor in Chicago. He looked three doors down for me. I told him I had 27,000 shares of seabull systems in my personal account and he looks at me and that's just a long time ago. He goes son, he goes, I don't know how much money you have. He goes, but that sounds like an awful lot of stock and he goes, I'll just tell you price will hurt you but size will kill you and he was right. And I got stopped out of my whole position and lost money on a stock that went up like 800. And then I did it again in a stock called TheraGenix. It took a lot of me touching that hot burner to learn this lesson. On the other side of things, I think if you get more than 12 stocks or something around that position, you become the index. So it's hard to beat the index when you almost are the index. If you want to have outsized gains, you need to really concentrate that down to still end those big leaders, but now your volatility is going to go way up. Okay. So Bill didn't bill traded around his positions a little bit, but he didn't hedge and I do. When a stock gets extended, the bill never really talked about this very often. You need to understand the personality of",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "but now your volatility is going to go way up. Okay. So Bill didn't bill traded around his positions a little bit, but he didn't hedge and I do. When a stock gets extended, the bill never really talked about this very often. You need to understand the personality of a stock. And if it's personality is at 20 or 30 over the 50 day, it pulls back to the 50 day, you better start hedging because if you have quarter of your whole account in a stock and it goes down 30 and it only goes to a normal place, which is perfectly healthy, can you take that drawdown now throw margin on there? And let's assume that your other stocks are going to pull back the exact same time because the general market's probably going to be in a digestion. Bill didn't explain volatility and it looked, Bill made me. All right. My three hedge funds, my net worth is predicated on Bill. Bill speaking directly to me, paying attention to me, me knocking him off. I'm not knocking Bill. I'm just saying he should have told me the pain I was going to go through to get here. Yeah, definitely. Well, and still to your point, I find the same thing like I am woefully unoriginal myself. And a lot of what I did was predicated actually on a like a a mentor I found online. So it sounds like the start of a child predator scheme,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "here. Yeah, definitely. Well, and still to your point, I find the same thing like I am woefully unoriginal myself. And a lot of what I did was predicated actually on a like a a mentor I found online. So it sounds like the start of a child predator scheme, but it's not. It was a great, he was an army dude. That was just helping me out. But he was an option straighter. But it's the same exact thing where I feel like there's things that I've learned on my own that I've been able to apply and kind of adapt. And it sounds like that's what I took from what you were saying is that you still are an autonomous thinking human being, digesting information and integrating that into your process. When you look at these stocks and they're starting to run up 20, 30 above the 50 day moving averages, how are you looking to hedge them? Are you taking size off or you're using options? Are you putting on counter opposing trades? What's the hedge? I don't like to pay taxes. 50 of the money goes to the government. You talk about compounding with your fall your money or knock that down to long term gains at 20. So I don't want to dislodge my stock, especially my low cost stock. So I'm going to be selling in the money calls. And then if I'm right in the stock, come by the way, I don't ever",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "your money or knock that down to long term gains at 20. So I don't want to dislodge my stock, especially my low cost stock. So I'm going to be selling in the money calls. And then if I'm right in the stock, come by the way, I don't ever want to hedge my whole position. Because what if it blows off? All right, I'm going to hedge. I used to hedge like 20 and I realized that's nowhere near enough to dampen the effect of the pullback. So I'm generally going to hedge 30 to 50 of my long position within the money calls. That way, the volatility and the premiums going to time and volatility premium works for me. It erodes. So I have that going for me. It's in the money. It's generally I try to, you know, like 80 delta calls in the money short. Super deep. Yeah. Now the spreads big. But how else are you going to keep your stock and hedge yourself down 10, 15 or more? 10, 5, 10. So that simply I sell calls and I will trim off stock. Like this correction we're in right now was far greater than a garden variety pullback in a bit of bull market. There's a lot going on. We can discuss that at the end. Yeah. Yeah. Well, it is. And that's another thing I did want to start getting your take on anyways. But before then, there was a couple of questions",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "a garden variety pullback in a bit of bull market. There's a lot going on. We can discuss that at the end. Yeah. Yeah. Well, it is. And that's another thing I did want to start getting your take on anyways. But before then, there was a couple of questions I had from some of my community for you. One of which is when you're looking at the various can slim factors, how do you wait them? Are there some that you personally apply heavier weight than others? That kind of thing. Before I tell you this, you're talking about the fundamental metrics. I am a fundamentalist. I am a story. I understand Celsius, case growth, unit growth, total addressable market. More than I do. But once I have the story down, I'll just state this. I probably made about 90 of my net worth and about eight stocks in 35 in 3035 years. I understood the fundamentals intimately in every one of them. Like I really, really, really deeply understood what was going on. But as soon as I get that clear, let's just take that off the table. Relative strength, group strength, general trend of the trend of the general market. Relative strength is going to take you right to the best names in the whole market. Anybody looking at stocks, it's like here, forget there's no money involved. You can pick for free a Vega or a Hugo or a Lambo or a Ferrari. What are you",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "the general market. Relative strength is going to take you right to the best names in the whole market. Anybody looking at stocks, it's like here, forget there's no money involved. You can pick for free a Vega or a Hugo or a Lambo or a Ferrari. What are you going to take? I'm always going to go to the high relative strength for our ease. I don't want to let you go. I don't want to vote swagon. Relative strength is like a divining ride right to the water with all the money in it. Group strength up to down volume is wildly misunderstood or underutilized. A cumulative distribution earnings growth and earnings beat. That is, it's just like why would a stock go up if it wasn't expecting earnings growth and earnings beat. It's like I call it the cockroach theory. If you're going to look in an apartment and a cockroach comes out from onto the floor, rest assured there's 10 more under the counter. Earnings beats are not one off occurrences. They are usually serial earnings beats and repeat. Now you can not lean into that too much. They have to materialize. But when you have an earnings beat because of some new product, what do you think people are just going to run to the shelves and clear them off for one quarter and then they're never going back again? No, people are going to tell them the people. That's going to be an 18",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "an earnings beat because of some new product, what do you think people are just going to run to the shelves and clear them off for one quarter and then they're never going back again? No, people are going to tell them the people. That's going to be an 18 month story at least. There's relative strength up to down volume, group strength, tight. Now I'm going to go into technical. Weekly closes in the chart pattern is prevalent in nearly every, I didn't use every, I said nearly. I don't paint myself into a corner like a marina is about to get killed. There are just if you look at historical charts of the biggest winners in history, they have tight areas from two to five weeks and Baker Hughes right now just came out of and came back and broke out of about a five weeks tight area. Now what's it now for them? Say that again. Be our ticker for them. Be AR on a weekly. Yeah, I'll grab it and then we can take a quick look to if you want. I can share my I got it. And you said you want to use a weekly chart. Yes, sir. Three years, five years. What tickles your fancy? That's perfect right there. Look, look at your red key. Go back five, six, eight weeks and it's start the first red week. There's two red weeks. Keep go to the right. Go right, right, right, right up",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "weekly chart. Yes, sir. Three years, five years. What tickles your fancy? That's perfect right there. Look, look at your red key. Go back five, six, eight weeks and it's start the first red week. There's two red weeks. Keep go to the right. Go right, right, right, right up in the handle. Keep going. I'm on there. Yeah, look at those tight closes. One, two, three, four, is it four or five? It would be better on a bar chart and I don't want to waste time going to it. Five weeks in a row. You know, rarely. Yeah, it's five. Yeah. And the group is number the group strength is like, you know, out of 200, it's like three out of 200. It's it's almost it's elite elite group oils on a run. Um, I, I, my fund does have a position. I've been reducing it. Um, my lawyers love me that I just told you that. You gotta give them work. You gotta give them a job. Look, they can make their money up, building somebody else for a freaking lawsuit. I don't need one. Um, anyway, tight closes are a look, can slim is predicated on a detailed study of the biggest winning stocks in history and what characteristics did they possess? And it's all in Bill's book can slim. It's all there. Now, the one thing is a gentleman I know in a mirror crawl found that something like 30 or 40 of all big",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "a detailed study of the biggest winning stocks in history and what characteristics did they possess? And it's all in Bill's book can slim. It's all there. Now, the one thing is a gentleman I know in a mirror crawl found that something like 30 or 40 of all big winning stocks have no earnings, which is contrary to can slim. The difference is that when you have no earnings and you get into a bad market or a bear market, those stocks get pummeled more, right? Earnings bring durability and earnings bring institutions. And when there are no institutions in your stock because there's no earnings and somebody goes into dump 400,000 shares, who's there to buy it? If, you know, fidelity says I'm bid for five million shares literally. They're there to absorb your shares. But when you're looking at some market cap stock at three billion dollars and somebody wants to dump 300, 300,000 shares, there's no institutions in there. Earnings bring institutions, earnings bring liquidity. So there's a bunch. Yeah, well, and it makes a ton of sense too because I think, I mean, you can look at, you know, aggregate numbers of performance, but then I think there's you have to, you know, an interesting follow on study that comes to my mind for that is what's the probabilistic outcomes out of the total pool, right? Because my guess is, probabilistically, there's likely a higher percentage that have earnings versus not. But you might have",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "I think there's you have to, you know, an interesting follow on study that comes to my mind for that is what's the probabilistic outcomes out of the total pool, right? Because my guess is, probabilistically, there's likely a higher percentage that have earnings versus not. But you might have a large raw number with earnings. That would be my guess. I look, it's much easier for me to sit when I know there's earnings. Right. You know, biotech, I've been obliterated in biotech and I've made a fortune in biotech in a few conferences. But most biotech companies are research laboratories with no sales force. They're, they're, they're not even a product. They're working on a product. And if you go through clinical trials and they don't pass the FDA approval, goes to zero, basically almost goes to zero. Now, once you have an FDA approval and then sales occur, the amgens first reported earnings, second reported earnings, four quarters forward work, 32 cents against a penny. That's when they invented a epegid, okay? That was the beginning of the move where the stack went to Mars. It basically changed the world of medicine. If you had AIDS or you were going through chemo, your red blood cells were being run down. You did they injected you with this stuff and it ramped your red blood cells. So you could take more chemo, live longer with AIDS, it was a gain changer. And then they came up with Nupogen,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "you were going through chemo, your red blood cells were being run down. You did they injected you with this stuff and it ramped your red blood cells. So you could take more chemo, live longer with AIDS, it was a gain changer. And then they came up with Nupogen, which is a white blood cell replenisher. It changed medicine. That was not going to be a one quarter earnings beat. And that stack went to Mars versus some company that has no earnings whatsoever. It's just like sales growth. I have a rule, gym rule, that I won't put more than one or two per stocks in my whole portfolio into earning no earnings growth stocks. When the market is being led or augmented greatly by stocks that have no earnings growth, you're getting to a frothy market. You get a lot of IPOs that have no earnings, you're late in the game. The IPOs that are coming out now have earnings, okay? They are another rule. This is a rule. When the IPO window is closed, the first deals to come out are elite, elite, the best names. To in a bear market or after a bear market to get an institution to come up pony up cash, they're only going to do that for the greatest stock of the world. They're not going to do it on a maybe. They're gunshied to them and beaten up. So the best name you IPOs in bear markets are at",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "to get an institution to come up pony up cash, they're only going to do that for the greatest stock of the world. They're not going to do it on a maybe. They're gunshied to them and beaten up. So the best name you IPOs in bear markets are at the end of bears or new bulls. Those are good probabilities of being TMLs. Again, I don't like IPOs. 95 or 7 of all IPOs undercut their IPO opening trading day clothes within a year or two. The odds are terrible. Most of them are small illiquid speculative. I'm looking for more durable quality. You asked me variables. I'm backtracking. The comp rating. The comp rating is there for a reason. If you're buying a stock that is accommodating below 90, there's something wrong with your stock. It's not elite. When you were talking about the biotechs, I really resonated with that because in trading volatility with options that spend a lot of time there. It's kind of like the sewers. It's where things are not liquid. There's a lot of volatility. Literally the way I've learned to hedge out risk in those kinds of trades is to just have a large number of occurrences. Literally to have a large sample size. Sometimes even when you're trying to find the fucking door, it's not there because there's no damn liquidity. The biotech thought process you went down again, also very much resonated with me. I've spent a lot of time.",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "a large number of occurrences. Literally to have a large sample size. Sometimes even when you're trying to find the fucking door, it's not there because there's no damn liquidity. The biotech thought process you went down again, also very much resonated with me. I've spent a lot of time. But you learned a lot of super cool things. That's the fun part there, I think. Being in the markets, any daughter looks up their dad and overstates the grandiosity of the father. My daughter is like, I asked you a question. You know the answer to all this stuff. No, Sarah. I've been in the market for three or four million years. I've been in a trucking stock. I've been in a biotech stock. I've been in a plastic stock. I know this much about everything, but not enough to be valuable. Being in the markets is the most enlightening. I wonder after understanding economics, I'm incompetent to work at the Federal Reserve. I'm not an economist. I'm not that smart. But I understand economics enough to know a lot about the world and how the world works. I look at people in Congress. I'm like, they are incompetent. They are incompetent to do their jobs. The president made Ronald Reagan was not competent to be the drugs are, the housings are, the leader of the military and all the other branches. But he brought in experts from that industry that were in that industry for many years and",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "They are incompetent to do their jobs. The president made Ronald Reagan was not competent to be the drugs are, the housings are, the leader of the military and all the other branches. But he brought in experts from that industry that were in that industry for many years and were top dogs in that industry. If you if your presidential cabinet is not loaded with people from industry, you appoint them because of their clout or their donations, you're a charlatan. You're a schmuck. It's detrimental to engine man. Well, it's fascinating because I find markets in general find people that can balance theory and practical application, which literally transitions over from exactly what you were just talking about is this idea of needing people with some level of experience of both. When you look at your day to day habits, how much of it are you leaning on the theory of what you've learned versus the practical application of the skill set? Because I know for me, I spend a lot of time in theory up front understanding again, how derivatives work. All the different details because they're very nuanced products. But then after a while, you kind of just have a feel for them. And I think the feel, quote unquote, is a lot of subconscious processing that just is happening in the background from that learned experience. But on a day to day, I have my things I look for, but a lot of times, I",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "of just have a feel for them. And I think the feel, quote unquote, is a lot of subconscious processing that just is happening in the background from that learned experience. But on a day to day, I have my things I look for, but a lot of times, I can do a cursory overview and have a good quote unquote feel to whether or not this is the right place for me to be. Do you find the same when you're looking for your stocks or is each and everyone a very rigorous process? I find that finding stocks is easy by screening. It's just second nature to me. The real battle is when the markets open and you're being fired at and your emotions are running high, but I'm automatic. I have my stop losses. I know exactly where they are. I know from history when it breaks the 50 down volume, I watching the, I know exactly what to look for. But when the market's turning up, I have my Rolple report. I have my battle plan. You know, I'm in the turret. I'm ready to go. I have the plan. It's right in front of me. So I don't have to, I will run screens in the day for price up on volume. But I already know what those names are because I did all my research on Sunday. It's a combination. Like there's another quote. It says, education is pretty thin stuff without experience. And",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "So I don't have to, I will run screens in the day for price up on volume. But I already know what those names are because I did all my research on Sunday. It's a combination. Like there's another quote. It says, education is pretty thin stuff without experience. And I'll say something else. You can talk a lot and write a beautiful newsletter, but implementing whole another world, 90 of the game is implementation. It's kind of like what it's nice and say, everyone's got a plan until you get punched in the face. And the market is going to punch you in the face a lot. So it's a combination of both. It's both. It's it's experienced. It's really disciplined to implement your plan. Whether it's canceling or value or garper or whatever the heck you're doing, it's disciplined to not be led by your emotions or scared by your emotions or become greedy because of your emotions. Like I said, the book, you have options for a strategic investment behind you, green and white book. Okay, I read a book a million years ago. Anyone can read that book and probably make money if they implement the process. Yeah, I think it's totally fair. I think one of the things that would help people now is there's unlimited information out there. And I think that people find themselves in just analysis, paralysis, information overload. You can get to just this nintinoy level of detail with everything. But",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "process. Yeah, I think it's totally fair. I think one of the things that would help people now is there's unlimited information out there. And I think that people find themselves in just analysis, paralysis, information overload. You can get to just this nintinoy level of detail with everything. But you found a pretty efficient way to just generally call, you know, a large sample or a large population into a small sample, right? You have like your criteria that you're looking for. If somebody wants to get more efficient at scanning the market specifically for canned slim style stocks, because that's your area of expertise, what are some of the introductory scans you think they could start looking at on a daily basis? You mentioned price by volume. I'm curious if there's a couple others, not necessarily for them to go start slinging trades, but to develop pattern recognition, to develop an understanding of what things pop up in this pool and what they generally look like. Minimum liquidity is an absolute must. And I use about a hundred million average daily dollar volume below there is kind of that below 30 dollars a share, below 100 million dollars dollar volume is getting into the junk heap. Let's go below 50 million average daily dollar volume. RS above 80, 85. I don't even look at things below 90. In my newsletter, I almost don't cover stocks with RS below 90, comp rating, EPS in the 80s and 90s, at",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "dollar volume is getting into the junk heap. Let's go below 50 million average daily dollar volume. RS above 80, 85. I don't even look at things below 90. In my newsletter, I almost don't cover stocks with RS below 90, comp rating, EPS in the 80s and 90s, at least, you know, I'm looking for 99. Dude, you could, anybody can learn to scan with marketsmith in about a month. When you generate those names, how do you handle them? When you have a big position on and the market's pulling back because, you know, India threatened a new Pakistan overnight or there was a skirmish in the South China Sea and the Chinese shot down over fighters and the market gaps down thousand points on the open and you're long on margin. What do you do? Do you know what to do? Have you done it before? Do you have your, do you have your stops all in place? Will you pull the trigger? Or will you go, I know what's not going to be that big of a deal and then it goes down to a thousand points the next day. I mean, the scanning and finding those stocks is the easy part. That's you're not even, you're walking out of the dugout in the first inning to take your first swing. That's not even swinging at the ball. That's just figuring out what equipment you're going to use in the dugout. Where's your, what's your batting",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "those stocks is the easy part. That's you're not even, you're walking out of the dugout in the first inning to take your first swing. That's not even swinging at the ball. That's just figuring out what equipment you're going to use in the dugout. Where's your, what's your batting helmet? What bat are you going to use? Now you get up to the plate. The guy throw will give you the chin music. You know, I mean, you're swing outside the box. The implementation is process and emotional control is everything. And I am, you have to learn how to screen and know what criteria you're looking for. But anybody can tighten up those variables to where you're only generating 15 or 20 names. Now once you have that, now what? You're going to buy it extended. You're going to buy it in the bottom of a base or you're only going to buy it on a breakout when volume comes in. Inflammation. One of the things you mentioned, I forgot what podcast it was on, but it was actually really insightful for me when you were talking about kind of this idea of like a true market leader versus like the second and third place and how the difference in performance for the true market leader can be up 300 and the second place guy can be like 150. That's a massive difference between first and second place. How do you find first place? Screening forward is large,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "versus like the second and third place and how the difference in performance for the true market leader can be up 300 and the second place guy can be like 150. That's a massive difference between first and second place. How do you find first place? Screening forward is large, the matrix. Like if one has return on equity that's twice as good as the other one, little details matter. A horse that wins at the racetrack wins by a nose, but pays 20x, what the second place horse pays. I did a study from roughly 1950 call it the 2010ish of every group, the top five leaders in the group, the percentage gains and the difference between first and second and the difference between the performance of one and two was 100. How do you know? You screen for the matrix, but then the fundamental story. Which one is taking over the market? Okay. Monster, which very few people know was one of the very best acts ever in history. Celcius is now eating their markets. Knowing the story at Celcius is really important. No, what's the total addressable market? Which company has the variables that are slightly better than the other, the product? I mean, Bill would say to me, here's how I'll give you a bill gold. I'd ask Bill a lot, should I sit through earnings? I mean, be like, have you been to the store? Have you used the product? Have you been to Starbucks?",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "than the other, the product? I mean, Bill would say to me, here's how I'll give you a bill gold. I'd ask Bill a lot, should I sit through earnings? I mean, be like, have you been to the store? Have you used the product? Have you been to Starbucks? Do you have confidence in it personally? Do you count the cars in the parking lot? Using the product, having actual hands-on knowledge, what's your level of confidence? How much cushion do you have for the year? Is the market in a solid bull trend, a wishy-washy bull trend, or a bear market? What's the environment? Are we in an irrational, exuberance market, Alan Greenspan? Or are we in a full-blown bear with a pump and liquidity? These are all reasons why you would hold through earnings. You have to assume every earnings report, you could have a miss and it's going to gap down by over 20. If you cannot tolerate that, you cannot be in the stock. Or you have to hedge. Now, hedging into earnings is different than her hedging into a pullback because I would probably rather buy puts or do a put spread because I don't want to give away the upside. If I'm in that stock through earnings, I think it's going to beat and I don't want to give up my upside. So I'm willing to pay the big, but I'll actually probably sell the put a good bit lower because I don't",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "don't want to give away the upside. If I'm in that stock through earnings, I think it's going to beat and I don't want to give up my upside. So I'm willing to pay the big, but I'll actually probably sell the put a good bit lower because I don't want to pay all the big. Right, right, right. Yeah. And by the point, I want to buy the slightly below the money put closer to the money and sell the further. Yes. Because I just, dude, you know this, your futures, dude. What, four out of five options are eight and a half out of 10 go worthless. It's actually much lower than that. That's like a really, my ankle. Yeah, it's a really, really miscominated statistic, but the vast majority are actually closed before expiration. So it's like 60 plus are exited before expiration. And then nine out of 10 out of 10, tell by retail, go to zero. Well, that, that I think is pretty, pretty solid bet. Anything, anything, retail's fine. I think you can take a pretty good guess on that. Another thing I wanted to ask you, which you started talking about, but this is another question for my audience, which is one of the things I talk a lot about is if people are looking to trade directionally, whether it's bullish or bearish, to look for the corresponding sectors that are performing that way and then start narrowing down within those sectors, just",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "is another question for my audience, which is one of the things I talk a lot about is if people are looking to trade directionally, whether it's bullish or bearish, to look for the corresponding sectors that are performing that way and then start narrowing down within those sectors, just trying to stack as many things in favor of your thesis. How do you go about identifying just market breadth and then what sectors you view are strong performing versus weak performers? All right, net new highs, net new highs. The reason I never called this a bull market, I called it at best a transitional bull. When the market started to go up in January, February this year, the new highs never confirmed. Almost every most days throughout the year, we had negative net, we had negative, we had net negative new lows over highs. We never got into bull confirmed status. We had brief periods where they would new highs would elipse new lows, but not only that, the new lows right now are getting into dangerous territory. We are not in every bull market has pullbacks and that new lows exceed new highs, but they're marginal. 40 new lows a 100 new lows a day, 50 new lows. We're running big numbers here. We're not in a bull market pullback according to new highs new lows and the bull market never transitioned from a bear to a bull right there. Now that's one thing you asked me",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "new lows a 100 new lows a day, 50 new lows. We're running big numbers here. We're not in a bull market pullback according to new highs new lows and the bull market never transitioned from a bear to a bull right there. Now that's one thing you asked me to qualify. What was the other one on breath? You said breath and what was the breath was the first one and then the other is just analyzing sectors to find what sectors you like to the upside to the downside. I screened for everything. So I'm generally going to all of a sudden start to come up with diverging RS or RS leading RS. I screened for that all the time. Leading RS in a bear in a pullback is gold. It's pointing you right to what the market loves. So leading RS is a great screen, but when you start running screens like that or up to down volume over say 1.5, it's going to point you right to the leaders and also you're going to start see a whole bunch of crappities. Whether they're you know shipping stocks or hotel stocks or semiconductors and then I'll look at the group and then I'll distill down I'll break down into what's the leader within the group. Now here's the issue. Anybody can find those through screening, but how do you know which ones are viable and are you usually when you find it you're going to be late",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "at the group and then I'll distill down I'll break down into what's the leader within the group. Now here's the issue. Anybody can find those through screening, but how do you know which ones are viable and are you usually when you find it you're going to be late and it's going to be really extended. That's the third biggest mistake rookie mistake is buying extended. You're like I found the number one group. I found the leader in the group. It's got everything, but now it's it broke out from it's 75. It's 95. Now it's 20 points over the breakout from the digestion, but if you're a rookie just buy it and then it pulls back and you're like it was the right name. It was the right sector, but your timing was off. You don't understand congestion digestions. Bases, chart patterns form, they're just digestion. Whether it's a flat base, a cup and handle, a double bottom, what having shoulders, there are congestion areas with support and resistance. If you're buying extended from the last digestion, you're a rookie. That's probably the fifth one. Now how do you balance, especially if these are longer term thesis, right? Like if we're looking at a three year weekly chart, that seems like a pretty long thesis. If there's a breakout and I actually remember spending a lot of time in Bill Nuel's book on this because I found it so interesting, it seems fascinating to me how imperative",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "right? Like if we're looking at a three year weekly chart, that seems like a pretty long thesis. If there's a breakout and I actually remember spending a lot of time in Bill Nuel's book on this because I found it so interesting, it seems fascinating to me how imperative it is to get that initial timing right, even though this can be a really long thesis. It seems like it's a really long thesis. You would give yourself more time, more variance, but obviously his argument is you get to reduce a lot of risk if your timing is very good. So how do you find that balance between getting your timing as good as possible, but then also getting into something that you're expecting to run for the next year, whatever it is? Two things. Okay. The only time you're going to find a 99 comp stock with Skyhigh RS in a base is in a bear market because the second that bear market ends, I call basket balls underwater, it's just going to pop straight up and it's going to be extended a day. So if you don't catch it on that day, you're now buying extended and your risk is up. Now the second part of it is it's not just enough to catch it at the right point, you have to catch it in size. Probably one of the most underrated things and I can't overstress this. You should make, I said this is really",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "and your risk is up. Now the second part of it is it's not just enough to catch it at the right point, you have to catch it in size. Probably one of the most underrated things and I can't overstress this. You should make, I said this is really important. Well, cushion, the value of cushion is that you can't understand how valuable it is. If you don't have cushion and you are using risk management, you're living on a razor's edge. And if you're more on and you have a TML right after a bear market and it's up 20 and you take that gain, now what? Now what's extended? How are you getting back in? Over the 98.4 weeks, most TMLs go up like 400 to 1000. And you sold it up 20. At the end of the bear, fools move. So it's not just how do you catch it, not extended, but you have to catch it in size because to have, if you have 10 of your account and stack that goes up 100, your equity moved by 10. How often do you get 100 gainer? Well, then you better have more than 10. Now the problem is when you're transitioning from bear to bull and you're used to buying probing positions of 100 lots, but you really intend to buy 200,000 shares, but you're probing probing probing. So if you get traction, all of a sudden you get traction and you feel like you're",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "the problem is when you're transitioning from bear to bull and you're used to buying probing positions of 100 lots, but you really intend to buy 200,000 shares, but you're probing probing probing. So if you get traction, all of a sudden you get traction and you feel like you're beaten down because you're probably down for the year, you've lost money, you're in a bear, but you need to go put 20 of your whole account in a stack. At the right time, that is only done with experience. No rookie, very few, I would, I will bet every time that you get a guy who reads Bill's book at the end of a bear market, they are not going to get the right stock in the right size. I'm not, I'm going to buy, in the transition phase, I'm going to buy five or six stocks initially, probably by three on the follow through day. I'm going to have to, it's a, it's your building positions. Your most stocks I buy, I, I'm wrong, six or seven out of 10, don't work, even when I buy them on the breakout day. So that's three out of 10. It's just, it's a, it's a shifting matrix only to be understood through time, understanding deeply where you are in the trend in the market. What is the general mark? How is it acting? Is it appropriate now? These, these, this can take decades to learn. Okay, it's, there's no, I",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "just, it's a, it's a shifting matrix only to be understood through time, understanding deeply where you are in the trend in the market. What is the general mark? How is it acting? Is it appropriate now? These, these, this can take decades to learn. Okay, it's, there's no, I just explained it to you in a very cursory fashion, but to really learn it where you know, it's like catching surf. There's, there's normal waves, then there's gigantic waves, and then there's waves that come around every five years. Well, you have to stick around for 20 years to be through the five big waves periods to understand, man, now it's time to throw the hammer down. Okay, we got to open fire. Right now, it's, it is go time, you're in the breach, there's no flinching now, and it's worth the risk. That's when I can take risk. I'm willing, because I know that the odds are high enough where if I'm wrong, it's worth taking that risk, but in a crappy market, in a perfect 99 count stock that limps out of a base, I'll throw something at it to test it. It's more of a test. I'm not even trying to make money. I'm trying to determine if the market's ready for me to go all in. I'm waiting. It's like playing Texas Hold'em. I'm waiting for the right setup. What do I have? What's showing it's early? And now I want to, now I want",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "I'm not even trying to make money. I'm trying to determine if the market's ready for me to go all in. I'm waiting. It's like playing Texas Hold'em. I'm waiting for the right setup. What do I have? What's showing it's early? And now I want to, now I want to, well, I want to slow play it to get them all in, but I want, I need to ramp the, I need to ramp that pot up. I need to make it worth my while. I just said about 50 things. One of the things you said there, though, that actually really love to is just this idea of, like, remaining engaged, because I do believe at least for some traders, a lot of people sometimes go through periods where, especially the last few years, at least I know them, where they move to cash, they're not doing anything. And then they get really gun shy to do anything again, because they can't get the timing. They're not confident in what's going on. I actually really like this idea that you employ up kind of putting out these small, fueler positions. One to see, you know, what's working and to gauge the overall pulse of things. But two, I mean, it also gets you, still moving. You're still doing things. And I don't know if you find benefit from that momentum in your experience, but definitely from me, I find that useful. I'll find things sometimes that I don't",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "to gauge the overall pulse of things. But two, I mean, it also gets you, still moving. You're still doing things. And I don't know if you find benefit from that momentum in your experience, but definitely from me, I find that useful. I'll find things sometimes that I don't necessarily have the top most conviction in, but the probabilistic outcome still looks reasonable enough for me that I'm interested in it. I'm going to just say, I'm going to give you a little bit of my opinion. We're two and a half years into a bear market. If this market makes a new low, it's going to be the fifth longest bear market in history. And everyone is discouraged. The breakout, the last file today is failed. The markets acting terrible. People are fearful and they're looking away. And they're going away. They're running away. Exactly classic full rookie move. The major trends can occur, change in three to four days. It can change everything can change. And now it's like, well, the war is escalating. The government's probably going to get shut down. We have two idiots running for president. One's my idiot. There's a lot of reasons to be very nervous right now. And the market is down trending down. In four days, this market could look completely different. You're always three to four. The simple answer, you asked me a question with like 10 sentences. I'm going to answer with one sentence. You're always three to",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "to be very nervous right now. And the market is down trending down. In four days, this market could look completely different. You're always three to four. The simple answer, you asked me a question with like 10 sentences. I'm going to answer with one sentence. You're always three to four days away from a major market turn up or down. And right now, the feeling I get from talking to people seeing the market in my PNL is we're getting really close to a new bull market. And everyone's looking out. So you can't proper look away. The rookies look away. The guys who will never compound their money for 50 years are looking away right now. The people who are still engaged in the process. And I don't mean checking in. I mean studying a lot. They will be there. I learn this from a guy at my club. I don't want to give you the full story because it's too inappropriate. But he just said we're about to have a major market, a major move in treasuries. And he goes, it's not there now. He goes, but I guarantee you I'll be there when it is. Now, whether it came or not, it's not the relevant point. The point is he's a professional. And he'd been doing it for 30 years. He never looked away. I mean, dude, that's 30 more minutes on stuff. If you ask me one question, I ran away for five minutes with",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "whether it came or not, it's not the relevant point. The point is he's a professional. And he'd been doing it for 30 years. He never looked away. I mean, dude, that's 30 more minutes on stuff. If you ask me one question, I ran away for five minutes with the answer, which is perfect. That's what you're here for. We're here to listen to you talk. Not me. I have a fucking YouTube channel. And people see me talk all the time. So you're the star here. But you started actually diving a bit more into your current market assessment, which I did want to spend a few minutes on. So you talked about kind of this underlying sentiment that you think we might be turning a corner that there might be a bull market potentially in the cards. It takes only a few days to see a big change. Talk to me a little bit more about what you're seeing in the markets right now that give you that impression. Okay, let me preface this whole thing with. Let's hear it. America is the single greatest country in the world. Not by a little. It's the great history. If you're in India or anywhere Thailand, and you come up with a great idea in the world, the number one choice for you to go and start your company is America. And the number two choice is a wildly distant second choice. The world is run by dictators, despots,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "If you're in India or anywhere Thailand, and you come up with a great idea in the world, the number one choice for you to go and start your company is America. And the number two choice is a wildly distant second choice. The world is run by dictators, despots, thugs, criminals are in government. That's why the government works around the world outside. In Europe, it's cronyism. In America, we have the freest markets in the world. So I call it the golden goose a capitalism. The golden goose a capitalism is never going to be unless it's suffocated by socialism. The golden goose is going to produce the next blackberry, the next Starbucks, the next, what Wells Fargo United Airlines, Pan Am Airlines, IBM, Hubert Packer, Digital Equipment, all these companies because in America, it's one of the only places you can get rich and not in getting incarcerated or imprisoned or have it taken from you. To a certain mistake. To a certain mistake. Did you're lucky if you're not too lucky? Right. Right. But CEO of Luke Oils in Russia, sitting in prison, sort of 30 billion. He's got to be jailed. He's lucky that he just killed him. But the golden goose a capitalism is never going to stop birthing these opportunities. So you said it looks like we're going to have a bull market. I said you said that. It looks like we're going to have one now. We're always going to have a",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "just killed him. But the golden goose a capitalism is never going to stop birthing these opportunities. So you said it looks like we're going to have a bull market. I said you said that. It looks like we're going to have one now. We're always going to have a bull market unless we get suffocated by socialism. So there's always more. The guy's out here in the labs in the science park not too far from here. They don't care about a recession or a bad market. They're mixing shit and test tubes and splicing atoms and writing code. So the market, we just have to get the general market to get in gear here. Now let's take a look at history. I think the market topped. Not when the index tapped. It topped when the advanced decline line topped in February of 21, which means we've been in a bear for two and a half years. That is really long by historical standards. Now you can fight with me on when. But no matter how you look at it, you want to go from the top of the top of the the top, the Russell made. It's still long by historical standards. And I think it's longer than that. In order to assess where we're going to be, you can't look behind you. You can't look at what's happening today. You have to look what's going to be in 18 months. This is Stan Druckenner. In 18 months,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "long by historical standards. And I think it's longer than that. In order to assess where we're going to be, you can't look behind you. You can't look at what's happening today. You have to look what's going to be in 18 months. This is Stan Druckenner. In 18 months, the federal of crushed inflation. The Fed is not going to screw this up. They may kill the economy, but they are not going to let inflation get out of here. They could break the economy, which would then we're going to have a recession. But you know what, bear market or boom bear markets end in recessions. People like it's a recession. The markets are going up like I can't buy. So anyway, the Fed at the very least will not be raising rates in 18 months. They may raise rates two, three more times. They might raise what they might not raise at all. But 18 months from now, they are not going to be raising. So monetary policy will be eight. It may not be a tailwind if they're not cutting, but it's not going to be a headwind. Again, this goes back to the Golden Goose of Capitalism. I read a report from a very reputable source that said, AI, just fastener seat belt for this number, is going to increase global GDP by 15.9 trillion by 2030. 15.9 trillion. That doesn't include EVs. That doesn't include biotechnology. That doesn't include blockchain, crypto digital revolution. The",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "of Capitalism. I read a report from a very reputable source that said, AI, just fastener seat belt for this number, is going to increase global GDP by 15.9 trillion by 2030. 15.9 trillion. That doesn't include EVs. That doesn't include biotechnology. That doesn't include blockchain, crypto digital revolution. The innovation that we're sitting in front of right now is possibly the biggest I've ever seen. The advent of AI is going to be bigger than the internet. Okay, that's the promise. And I have every reason to believe that it is not 3D printing. Okay, it's not. This is real. If AI improves margins at most companies, but by three basis points, I'm sorry, by 3. What's that going to do to PEs and earnings growth? What if it improves it by 8? Where will we be when the Fed stops raising rates, a title wave of innovation, and now AI ramps everyone's margins up? Where's the market going to be then? But all they're looking at today is we might have one more rate hike, and the government's going to shut down in a week, and we've got two more runs running for president. They're so short term. If you're looking out a month, you're missing, you're damn you're driving your car through the rearview mirror. You're going to look through the windshield 18 months forward. The world's going to be radically different. We might, there could be some type of stalemate in the war in 18 months.",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "If you're looking out a month, you're missing, you're damn you're driving your car through the rearview mirror. You're going to look through the windshield 18 months forward. The world's going to be radically different. We might, there could be some type of stalemate in the war in 18 months. Russia won't have any people, nobody, people left to fight the war. They'll be dead. The sentiment is incredibly ugly. And I'm just telling you, those are my reasons. And by the way, if you look at the indexes, they remain in a massive cup and handle. You want to look at the NASDAQ? The only Russell, not the Russell. There's another breath measure. Until the Russell exceeds 2000, we're not in a bull market, in my opinion. We need to have net new highs overloads in excess of 150 a day every, you know, most days, and maybe as high as 400 or 500 a day, net new highs. So we're not there today. But don't take your eye off the ball. Okay? If you decide to, you know, this is time to double, re-double your efforts. This is no time to be looking away. This is if you're ever going to focus, you focus to the end of a bear. And I think we're very, very close. If we have to go into the year, I will be the most bullish person in the world. That'll be three and a half years of a bear market. Okay? You",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "ever going to focus, you focus to the end of a bear. And I think we're very, very close. If we have to go into the year, I will be the most bullish person in the world. That'll be three and a half years of a bear market. Okay? You won't be able to nail, you have to nail me down. All right, I graced. I actually think there's a lot of merit to your case. I believe a lot of the way that you're positioning. I got it. Yeah, joking passively. Oh, I know. I can be so wrong, dude. Listen, the markets could make a new low before this happens. I'm not saying today. Well, the part that I want to explore that you were talking about, that I am curious how you value this. And I'm going to put socks on now. It's my future cold. But do you think that the prospects of a recession could drastically extend the time frame that we're in a bear market? Because that's the thing that I agree with you in that. I believe that the Fed is very likely to not permit persistent expanding inflation. Like they've made that clear. And I actually, that's like other than them starting super late in my completely uneducated, unqualified opinion, I think they started trying to tackle this thing a little bit late. I do think that Big Daddy J. Powell has been pretty fucking clear about his mission here. And he's",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "clear. And I actually, that's like other than them starting super late in my completely uneducated, unqualified opinion, I think they started trying to tackle this thing a little bit late. I do think that Big Daddy J. Powell has been pretty fucking clear about his mission here. And he's been beaten that same goddamn drone the whole time. So I give him a lot of credit for that. But I am curious for the propensity here for us to have this overtightening cycle that then puts a pretty big wrench in our ability to smoothly exit this as compared to coming down in a fiery ball. I really don't know either way, but I'm curious how you kind of think about the unwind. So you're on to the lever that could extend this. The odds are the Fed will overtighten. That's historically the way they over they overlose in the overtighten. We've had an inverted yield curve for over a year, at least a year. The odds of a recession are but the counter to that. Well, first of all, if we have it, depending on how deep it is, people are going to have to slash at some p-ernie's. And that's going to elongate. I'm trying to say, yes, my answer to your question is yes, a recession is going to delay this for a bit. Depending on how deep that recession gets is going to predicate how deep how much it pushes it forward. But if we",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "p-ernie's. And that's going to elongate. I'm trying to say, yes, my answer to your question is yes, a recession is going to delay this for a bit. Depending on how deep that recession gets is going to predicate how deep how much it pushes it forward. But if we do that, think about the duration of this bear market. You pull rubber band out like this. It just goes back like that. When you pull it out like this, it goes, bam. If we have a bear market, a deeper bear because of a recession, we're going to stretch that rubber band so hard when it comes back. We're going to have a monster opportunity. This will be a generational wealth opportunity. But the other side of it is, and this is why the Fed is going to really, well, oil could kill the market for the Fed. Oil right now, the oil is the largest component of the CRB, which is running rates, which is running the dollar. Oil rates dollar, kryptonite, in an uptrend. If the labor market is so strong, the labor market, it's unbelievable how strong it is. So there's this juxtaposed issues the Fed is trying to deal with. I would not want to be the Fed. They pay into themselves in no corner. But they're going to win. And they should remain independent. Politicians are going to want a job on the Fed to loosen. And Powell's got to hold his ground. The",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "is trying to deal with. I would not want to be the Fed. They pay into themselves in no corner. But they're going to win. And they should remain independent. Politicians are going to want a job on the Fed to loosen. And Powell's got to hold his ground. The nightmare scenario is that they start to loosen when inflation is not dead. Now, I just don't think they're going to do that. As much as I give them no credit, because they're generally trying to preserve their power as opposed to do the right thing, I don't think they're going to screw this one up. And if they do, I have to change my case. And I am always in flux. I laid out my bull case. I've been doing this. I figured it out because my math is so bad. I've noticed for 38 years, my experience tells me we are at the precipice. We're within on a long, if we have to wait a year for a bull, I'll be shocked. But I will flex if the war breaks out into other continents, if the Fed preemptively lowers rates and inflation ignites. But I don't see that. That's not my base case. So again, I'm really, really, really bullish. My market temperature for a year out is a 10 max bullish short term. I'm a two. And after today, it's probably like a one and a half. But I'm looking way down the road. And here's the",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "That's not my base case. So again, I'm really, really, really bullish. My market temperature for a year out is a 10 max bullish short term. I'm a two. And after today, it's probably like a one and a half. But I'm looking way down the road. And here's the thing. If I said to you, Eric, you have to wait nine to 12 months to double your money. Are you okay with that? Would you do that? That's what we're looking at. This is not going to be if the bull market breaks out in a month, it's not going to be a garden variety bull. If we wait a year, I mean, dude, the opportunity almost seems like we want this to go on longer because of that potential momentum up and out. Well, you do. If you, yeah, if you told me I have the choice between nine to 12 months to double, four or five to wait 24 months to triple, I mean, I'll take the triple, triple and a half. You're logical and willing to wait in your patient. Most people want, right? Like you know the game, they said, we're going to put a dollar bill in the middle of five people every 30 seconds. And the longer you wait, the more we'll put in. And how long will they, until they grab the money? They always screw that up. Okay, people want it now. And that's another thing. People want to get rich",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "dollar bill in the middle of five people every 30 seconds. And the longer you wait, the more we'll put in. And how long will they, until they grab the money? They always screw that up. Okay, people want it now. And that's another thing. People want to get rich quick. They want to do it now. They want someone to give them the stock idea. Not the reasoning to find it. People are just, lazy. Are not very, you said about information and information overload. It's not lack of information that people don't succeed. It's like a desire to read the information. And then it's like a discipline to implement it. And it's like a perseverance to implement it for decades. You wonder why people don't get rich. So yeah, your case is right. I believe your case strongly. I'm going to run out of power. Anyway, that's it. Man, I believe strongly. We are at my 30X years of experience. Tell me. Dude, people, not just anybody, brilliant people, CEOs of major companies are saying, AI is the greatest opportunity in our lifetime. It is akin to the invention of electricity. All right, this is a. How do you balance hype, though? Because to be clear, I am actually of the same exact opinion of you. I really do think AI is revolutionary. But I also saw all of these different metrics talking about how the metaverse was going to be an 800 billion business within by, I",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "you balance hype, though? Because to be clear, I am actually of the same exact opinion of you. I really do think AI is revolutionary. But I also saw all of these different metrics talking about how the metaverse was going to be an 800 billion business within by, I literally think it was like 2025 or 2030 or something like that. It was like very quick. And that one, I honestly didn't really believe in. But still, I'm not the authority it could or could not happen. But my point is, you know, people can get a little emphatic about things. How do you structure that? How do you value that? I haven't bet it yet. Marked in a downtrend. When the trend turns up, I'm a trend follower. And I'm going to follow it as long as it goes. Okay, I watched the build out of the internet from ground zero IPO department at Morgan Stanley. Okay, I took a lot. I was involved in allocation of these deals. I mean, I did palm. I did red back brocade, tons of names, big names. And I watched the internet get built out and I watched the companies come public. And I watched what they did and I watched how Muslim didn't have. I've seen this before. This is not 3D printing. Okay, and the one rule I read to you was, think for yourself on face value. Did the metaverse seem to me you like, I'm going to",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "public. And I watched what they did and I watched how Muslim didn't have. I've seen this before. This is not 3D printing. Okay, and the one rule I read to you was, think for yourself on face value. Did the metaverse seem to me you like, I'm going to put, you know, the most unsexy thing you want to repel the opposite sex. Put head gear on your head. Okay, it's just, it's like there's lagging them. They're just paying the ass. The metaverse is going to have some uses. But on face value, when I looked at it, I didn't really, I kind of wanted to get lowered into it. But it's been the grandest failure. AI is already changing SaaS companies. Service now, Adobe HubSpot, the Palo Alto for security, the AI in the drug discovery for biotech. Now, this is, I believe this. Now, I haven't bet it because there's being right. And then there's being right at the right time. And this is not the time to day. But we get a follow through day late next week or early next week. And if we do, I'm going to probe it. And if I get traction, I'm going to build. But if we make a new low into the fall, into Thanksgiving, and you know, the IWC, the small, look, IWC almost made a new low for this whole cycle. The Russell is a base hit away for making a new low for the cycle,",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "traction, I'm going to build. But if we make a new low into the fall, into Thanksgiving, and you know, the IWC, the small, look, IWC almost made a new low for this whole cycle. The Russell is a base hit away for making a new low for the cycle, which will definitively make this the fifth largest bear market history. Okay. So I believe it. And I'm a huge optimist. But until the trend can curves with my thinking or confirms it, I don't bet it. It's an I have an opinion. And I don't bet opinions until the trend confirms my opinion. I will bet the trend against my opinion. If the trend moves in a direction, I don't believe it. I will. The I make mistakes and lots and lots of them. And when the trend turned up in the big seven in January, February of this year, I didn't bet it because I just thought the market was in. Look, I'm telling you after as many users I've been doing this, I make mistakes. Okay. But again, what separates the grades from the also ran and the losers is how fast you recognize your made a mistake and reverse your position and smash your ego. If you have a giant ego, oh no, I'm right. Mark it's wrong. And then Alga bye bye. You're out of the bit. You're you're you're out. What I like to tell what I like to tell people is, do you",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "mistake and reverse your position and smash your ego. If you have a giant ego, oh no, I'm right. Mark it's wrong. And then Alga bye bye. You're out of the bit. You're you're you're out. What I like to tell what I like to tell people is, do you want to be right or do you want to make money? And you got to pick one. And it's hard. I chose golf. My marriage, my wife and the stock market. Well, maybe we can how about pickleball, jujitsu, moitai. How can we work on this golf thing a little bit? Maybe we could slide a little extra cracker activity in there. I mean, dude, all these things take incredible amounts of discipline and being wrong. If you endeavor into almost anything and you're going to be great, you're going to be wrong a lot to get to the top. If you're not going to be wrong, you're not going to get there. You're not trying. Well, I feel like it also just proves that somebody staying in their comfort zone and has a certain circle of competence and you're not stepping outside of it because, you know, to your point. And I feel like when I look at a lot of traders, they also miss a lot of interesting opportunities. That's why I like options and derivatives so much is because early on, I never fell in love with trading up down sideways. I really don't give a fuck",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "point. And I feel like when I look at a lot of traders, they also miss a lot of interesting opportunities. That's why I like options and derivatives so much is because early on, I never fell in love with trading up down sideways. I really don't give a fuck which way the market can go and fucking circles. The fact of the matter is as long as I can find the correct strategies that fit the current market environment, that's literally all I care about. So I feel like your point on the death of ego and just setting your personal pride aside and just doing your absolute best to interface with the markets really resonates. I, in a lot of ways, people think I'm unusual and you know, there's a, I saw a thing today that said, just be happy with what you have. And then there's like the guy who's not happy with what he has and he wants to clump. They say, live a balanced life. Well, you can't be number one if you're living a balanced life because there's a lot of other people who are totally cool with being 100 all in on one thing. I spend my time in the markets golfing, eating and drinking with my family and friends. That's pretty much it. I don't do much. I travel a lot to play golf. I'm totally unbalanced. I am, I'm very happy with what I have and I don't do it. I",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "thing. I spend my time in the markets golfing, eating and drinking with my family and friends. That's pretty much it. I don't do much. I travel a lot to play golf. I'm totally unbalanced. I am, I'm very happy with what I have and I don't do it. I love the money. Let's not lie to ourselves. But I do it to be right. I do it to notice that politics are moving like this, interest rates are moving like this, innovations are moving like this, these patterns are setting up. This is the leading group. This is the leading stock. And all these variables culminate into something that I believe in and then I bet it. And then it works. The fulfillment, the level of satisfaction of being right trumps the money. I mean, again, I'm not, I'm 58, man. But doing this for a long time. I have enough money. I get revved up by the success, by being right, by playing strategic and figuring out all the moving parts and betting it and when it works, it's great. One of the most greatest feelings ever. So with that said, I like the game I've learned. I've expended an enormous amount of time and energy and emotional beatings to learn it. I think to learn a whole note like shorting, I mean, I do short. Occasionally, but I'm usually wrong. By the time this optimistic go short, that's a signal for all of you guys listening. But",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "expended an enormous amount of time and energy and emotional beatings to learn it. I think to learn a whole note like shorting, I mean, I do short. Occasionally, but I'm usually wrong. By the time this optimistic go short, that's a signal for all of you guys listening. But I don't, I am somewhat happy with the game I've learned. And I think the F necessary for me to learn another game like Polo not playing. Okay, out on that. Another method of investing. I like the model I use because I know it really works. And I'm good with, I guess I'm good at. I have very much so specialized. And yeah, I think when people bastardize a method, they can make it perfect and better, but usually they follow it up. Look, it bill was a billionaire. If I only make half a bit, you know, 500 million, I'll be just okay. And I'm not even remotely close. I'm doing better than I was a long time ago. You compound your money for 35 years. You'll see how much money you're only you're 16 years in, man. I'll be I'll be old enough to watch you another another 16 years. We'll see how much you compounded out. If you'll, you'll probably say enough. Well, yeah, well, we'll see. So far so good. No complaints. So yeah, I, and it's funny too because I, I'm very similar to you in that. A lot of what I'm doing is",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "another 16 years. We'll see how much you compounded out. If you'll, you'll probably say enough. Well, yeah, well, we'll see. So far so good. No complaints. So yeah, I, and it's funny too because I, I'm very similar to you in that. A lot of what I'm doing is processed driven. I'm at the point now where I've actually moved a lot of my investment capital into other stuff. Like I invest in commercial real estate now, regular real estate. And it's they're just interesting to me. And there's some really cool opportunities. It's a fun way to learn different things. But to your point, I feel like really embracing the process has served me very well. And I honestly think that's probably one of the only ways people are going to make it in anything that they're trying. Because again, like if when I play golf, right? I am I literally couldn't even feel comfortable labeling myself as awful. Like I shouldn't step foot on the fucking green. Like I don't belong there. And it doesn't even begin to scratch the surface. So it's like for you to get good at golf, it means you went through that same phase I did where you first stepped on it and you sucked. And then you probably just decided, let me see if I can do it again. And then you slowly have gotten better. And I'm sure, you know, over your time from playing golf that you've really invested",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "same phase I did where you first stepped on it and you sucked. And then you probably just decided, let me see if I can do it again. And then you slowly have gotten better. And I'm sure, you know, over your time from playing golf that you've really invested into that process. So it's it's really interesting to me to see somebody again, like you with another parallel, which is this process driven approach as compared to outcome driven approach. I think that that's pretty common across the threads I've seen. I never ever thought what has happened to me would have happened to me because I went to see Bill two or three times a year. I never thought I'd ever had fun. I just wanted to learn how to make money and use the market. I love the markets. I didn't I didn't know anybody would ever want to have me in a podcast. Like there was the farthest thing in my mind and I'm on a jet the California to go see Bill. But all that 30, you know, 30 years of going to see Bill. It this is what it's turned into. I had no clue when I started to play golf. I was afraid of T-boxes that had little ponds in front of them because I couldn't get the ball over the little pond in front of me. I don't know if you know what handicaps, but everyone had if you my handy cap",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "clue when I started to play golf. I was afraid of T-boxes that had little ponds in front of them because I couldn't get the ball over the little pond in front of me. I don't know if you know what handicaps, but everyone had if you my handy cap when I started was a 36. I got 36 strokes and the reason I was a 36 is because they didn't have a 46. I couldn't even play to a 36 handicap. But going to a golf pro once a month every summer for 20 plus years has brought my handy cap down into the mid single digits. I mean, it was 20 years of debt and I'm not a great golfer. I mean, I'm a good golfer. I'm better than most people. But I'm no scratch golfer. But it didn't. It took two decades or more. Investing has taken 30 plus years. And I still miss hit T-shots all the time. And I lose money routinely in the stock market. But I have a friend. I hang out with a lot of guys and you know guys boss each other's balls and hackle each other. And my buddy goes, ropely goes, you're a one trick pony. But it's a really good trick. It's one trick. I'm really, I'm, I, I, I hesitate to even say I'm good. I've had some successes. But the trick I've learned is a is a is a value is a value. If you're the",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "ropely goes, you're a one trick pony. But it's a really good trick. It's one trick. I'm really, I'm, I, I, I hesitate to even say I'm good. I've had some successes. But the trick I've learned is a is a is a value is a value. If you're the greatest male sorter in the world, you better invent a machine that sorts it for you because you're not going to make any money. I mean, the world does value packing bushels of corn. The thing that I engaged in the endeavor I chose, when you get it right, people are really willing to pay a lot to have you run their money. Okay, when you're the greatest quarterback, how many guys can throw for 500 yards in a football game or whatever? What's that worth? You bring in a winning team, you bring in a couple billion dollars with an ad revenue. Are they willing to pay a 30 million a year? Hell yeah. The guy saw on the beer in the stands. Don't want to give this shit about the ability to take five bucks and hand somebody a beer. Anybody can do that. It's not a valuable skill. But it doesn't mean he's not valuable as a human being. You know, you're the greatest person in the world. The skills he's chosen to master, cracking beers and handing them down a roll, guys, is no one gives a shit. Right. Yeah. Yeah. It's really interesting to see",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "skill. But it doesn't mean he's not valuable as a human being. You know, you're the greatest person in the world. The skills he's chosen to master, cracking beers and handing them down a roll, guys, is no one gives a shit. Right. Yeah. Yeah. It's really interesting to see and just learn more about your process. I mean, I've really, really enjoyed talking with you, to be honest. I figured that I was going to like you just based on the way that you have good energy in general and I find myself similar. Like I'm just stoked to fucking be here. So every time I come across other people that have a similar disposition, it stokes me up even more. But before we log off, I know that you have a couple different places. You know, people can check you out, learn about some of the things that you offer. Could you share a little bit about those? And then I'll also throw links in the show notes below. Dude, I really appreciate it. I enjoy doing this. Like I finished things like this and I looked at the clock. We've been doing this for a long time. I'm super happy. I'm, I will turn off this. This is my longest one to be clear. Dude, when we log off, I'm going to go, wow, man, I feel great. I'm energized by this. But thank you for asking about, well, here, this is the first roll report I",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "I'm super happy. I'm, I will turn off this. This is my longest one to be clear. Dude, when we log off, I'm going to go, wow, man, I feel great. I'm energized by this. But thank you for asking about, well, here, this is the first roll report I wrote in 1992. These are very, somewhat even dated. They're issue one through whatever. And in here, I cover, well, I disbanded it. But I restarted it about two months ago. Every Sunday night, I write a 50 to 70 page report covering every leading stack, every index, every variable that's important to the market, whether it's interest rates, the dollar, oil. I give you my comments. I give you my best ideas. And then on Wednesdays, I do a video where you can email in your questions. And I will answer questions for two hours. In the first part of it, I'll give market commentary. So there's a two-part package. You can get it at theroeplereport.com. If you buy the bundle of the Sunday night research report and the Wednesday of webinar, where I answer all your questions on Canceliver anything about the markets, it's like 40 off if you buy the bundle. And I think it's an amazing product. If you want to learn Canceliver, if I would have had, I never really got to talk to Bill one-on-one for maybe 10 years after I'd followed him. But when I became an institutional customer of a Neal and",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "you buy the bundle. And I think it's an amazing product. If you want to learn Canceliver, if I would have had, I never really got to talk to Bill one-on-one for maybe 10 years after I'd followed him. But when I became an institutional customer of a Neal and Company, he would call me. And I would call him and we talked, not weekly, but more than monthly. Had I had that access when I got started, I might be worth a half a billion dollars right now. I am here to teach you everything that I know without you having to lose a ton of money to do it. Let me, I've already taken the bruises. I will answer all your questions like if you're all my best ideas and I'm going to give you like 40 off if you buy the bundle. And thank you for asking. I really appreciate it. Subscribe, reside, subscribe. It's all around the world. It's awesome. It's two weeks free. That's awesome. Yeah, I think it's awesome. And to be honest, I'll probably take a look at it myself. And then I'll let people know how it goes. So I think that this stuff you talk about, the way that you approach the markets, it's, it's awesome. And I think that you have a really, really fascinating skill set. You talk about it in a really invigorating way. So genuinely, thank you so much for so much your time today and hanging",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "this stuff you talk about, the way that you approach the markets, it's, it's awesome. And I think that you have a really, really fascinating skill set. You talk about it in a really invigorating way. So genuinely, thank you so much for so much your time today and hanging out for a while. I had a blast chat with you. And I'll definitely follow up with you again to see if I can learn some more golf parlance. And then I mean, really, I just fucking hate that sport. So God damn boring and slow. But nonetheless, I still respect the skill that goes with it. I'm still hopeful I can get you on like the jujitsu mats or something for a little bit. It's a little more fun, I think. But we'll see. Before we go on to say two things. Number one, when I see a military truck going down the highway, I tell my kids salute them. We owe them everything. I have such reverence for the military, for the power we project around the world, for protecting everyone around the world, for the freedoms we have, it is all pred- freedom are free economics. Global trade is predicated on free shipping channels. That is all because of the Navy. The Marines, Toby Keith, Colin Marine. I love the military. And I'm not just saying this because you're military guy. I believe this sense I was young because of my dad. And I also want to",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  },
  {
    "text": "trade is predicated on free shipping channels. That is all because of the Navy. The Marines, Toby Keith, Colin Marine. I love the military. And I'm not just saying this because you're military guy. I believe this sense I was young because of my dad. And I also want to say, do not ever get too bearish. Always lean a little bit bullish, prudently, because the Golden Goose of Capitalism is never going to stop birthing these new innovative companies that are going to gentrify the poor in the world and ever make everyone's life better and create trillions of dollars. It's never going to stop. So right when you think the world's coming to an end, there's going to be a stack called the send communications. And it's going to run up 30 in three days. And then it's going to go up 2000. And there we're just around the corner from that right now. So anyway, thank you for the opportunity. I really appreciate it. We'll do it again maybe in six months. Sounds like a blast, man. Thank you so much. All right, buddy. Have a great afternoon.",
    "metadata": {
      "video_id": "WglROZAI_SI",
      "title": "CANSLIM Trend Trading with Jim Roppel | The Outlier Podcast Ep50",
      "url": "https://www.youtube.com/watch?v=WglROZAI_SI",
      "upload_date": "",
      "duration": 5699.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 84,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WglROZAI_SI&t=0"
    }
  }
]