[
  {
    "text": "Let's talk about trading in your IRA account. This is one of the less discussed topics because a lot of people kind of set and forget their IRA. And I actually think it's a mistake. If you're taking the time to build the skill set of trading and you're successful at it, there's no reason not to translate that over into your retirement accounts. So I'm gonna walk you through some different ways you can think about it, how I like to think about it. And then at the end of the video, I'm going to give you a couple actionable strategies that you could bounce around and see if they're a good fit for you or not to employ in your portfolio. What's up everybody? Eric here, welcome back to all the outliers and a shout out to the Patreon family. You guys make content like this possible if what I do help do in any way, consider signing up so that I can pay my editor to make these videos more fun for you to watch. Should you trade your IRA account? My opinion I would argue for yes. I think it makes sense and it's for a few reasons. The first one is if we look back at 2022, using my own account as an example, the SP 500 was down 19.4. Yet I ended up the year up 5.3 on my IRA, which was about a 15 return on an invested capital, 5 5.3 return on",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "few reasons. The first one is if we look back at 2022, using my own account as an example, the SP 500 was down 19.4. Yet I ended up the year up 5.3 on my IRA, which was about a 15 return on an invested capital, 5 5.3 return on the account itself. And this was with 32 trades. I did not interact with the portfolio much at all. Yet I grossly outperformed the SP 500. To me, this is why it's worth your consideration. So why only 32 trades if I'm trading my margin account way more than that? Well, it's for a few reasons. The way I approach my IRA is I want to optimize the long-term performance of the account. But I don't want to spend a bunch of time in there because again, I'm already spending a bunch of time doing a lot of other things. So my goal in trading an IRA account is actually wrapped right around efficiency. How can I very efficiently trade my portfolio? So there's a couple of things to keep in mind. The whole idea here is trading it is because it's tax-advanced. So depending on if it's a raw through traditional, there's different tax advantages that come with both. But the reason why this matters is because if you can optimize and achieve better returns here, you kind of double the effect because of the tax considerations. So that's why it's worth at least some of your effort. Now,",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "through traditional, there's different tax advantages that come with both. But the reason why this matters is because if you can optimize and achieve better returns here, you kind of double the effect because of the tax considerations. So that's why it's worth at least some of your effort. Now, as far as I see it, there are kind of two different ways you can go about this. You can either employ an inactive... Did I stutter? Yes, yes, he did. Style, where your dollar cost averaging into an index ETF. So you could do things like spy, IWM and the queues. You could do things like leverage ETFs if you're so inclined. And this is kind of what that looks like. So you can take a look at portfolio visualizer to get idea of different portfolio structures and whatnot to see how the performance goes. But the reason why dollar cost averaging is really important for those that don't know what that is. All we're doing is setting a regular cadence to buy things. So if your dollar cost averaging into spy, that means like every single month, you would put in the same dollar amount into spy. And this helps us streamline and smooth our returns. If you buy all of it at once, then there's a chance you might buy it when it's really high. And that doesn't benefit you in case it drops. But if you buy it every single month, well, that means that sometimes",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "this helps us streamline and smooth our returns. If you buy all of it at once, then there's a chance you might buy it when it's really high. And that doesn't benefit you in case it drops. But if you buy it every single month, well, that means that sometimes you'll buy it when it's I, sometimes you'll buy it when it's low, sometimes you'll buy it when it's in the middle, so that in the aggregate, you actually develop a pretty good cost basis. So that's really the idea for an active. You can pick something as simple as that. Then there's more active. Now, again, this is nowhere near as active as I am in a margin account, but you can kind of combine some of the benefits of this with the skillset that you've taken the time to develop via trading options, whether it's trend trading, but for me, I tend to look at the coverage triangle, which this probably is nothing new to anybody here. I actually have a recent video that goes through the coverage triangle in depth, which I highly encourage you to take a look at. But other things that makes sense in here, a ratio covered call in diagonals, which I have videos about both of those as well. All of them will be linked in the notes below, but I am not trading a lot of speculative trades in here personally. This is all core style trading, and what that looks",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "here, a ratio covered call in diagonals, which I have videos about both of those as well. All of them will be linked in the notes below, but I am not trading a lot of speculative trades in here personally. This is all core style trading, and what that looks like is typically the coverage triangle. And I'll show you what that looks like and how I employ it, because again, it's a pretty optimized approach for me. I'm not interacting with the account much at all. I'd probably look at it like once a month, if that. So let's take a look now at what we can trade in an IRA so that we understand what's available to us. So this is from Schwab. You're going to have to check with your broker on whatever they offer, but these are the different things you can do in a Schwab IRA account. These are kind of bigger descriptions on some of the things that you cannot do, like short selling, selling naked, or trading on margin. And then for those that are wondering that whether or not you can use like portfolio margin in an IRA account, you can not. Again, double check with your broker. So each be slightly different, but this is generally what you're able to do. So if you'll take a look, the coverage triangle fits into this, no problem. Now let's take a look at how I deploy the coverage triangle in a quick kind",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "Again, double check with your broker. So each be slightly different, but this is generally what you're able to do. So if you'll take a look, the coverage triangle fits into this, no problem. Now let's take a look at how I deploy the coverage triangle in a quick kind of overview style. The strategy itself is pretty bullish. That's where we make the most money, but it does okay in neutral market conditions. You can tailor it different ways to appeal to either income or growth. And then once you take the time to develop the strategy, it's really rinse and repeat. I'm not spending a lot of time each month doing this. This is why for the coverage triangle, I typically trade in index ETF. And I just cycle the product in there. Now for a year like 2022, when the market's down a lot, notice how this doesn't work well in bearish conditions. So how did I walk out unscathed? By dollar cost averaging in and by the short call component to the strategy. That's how I ended up making money. So all in all, I think something like the coverage triangle probably makes sense in quite a few people's portfolios, I have to center myself there. I was way off kilter throwing me off. But I think the coverage triangle is a great choice in an IRA account. It's something that you can build a sustainable position in an index ETF and US-based index ETFs continue",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "a few people's portfolios, I have to center myself there. I was way off kilter throwing me off. But I think the coverage triangle is a great choice in an IRA account. It's something that you can build a sustainable position in an index ETF and US-based index ETFs continue to make highs over time. It's not like what you see in Japan, meaning you can dollar cost average into something like this with your entire account. And still makes sense long term. Now, if you are a little more risk averse, you're trying to appeal to different portfolio objectives, you could build a split portfolio that you trade coverage triangles. So you can have your equity allocation again via index ETF. And then you can have a bond allocation that you also trade the coverage trend. The reason why it's such a great approach is because it allows us to dollar cost average in regularly. Overall, if it's a down market that actually gives us a lot of ability to make a bunch of money when we get a rebound because this is a longer term hypothesis. And then you're also trading short calls against it. So when things do go down, you start to hedge some of that risk and make a little bit of money, even when things are kind of trending flat. So let me know what you think. If it was helpful, don't forget to like, subscribe, share with your friends. Be an outlier. I'll",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  },
  {
    "text": "do go down, you start to hedge some of that risk and make a little bit of money, even when things are kind of trending flat. So let me know what you think. If it was helpful, don't forget to like, subscribe, share with your friends. Be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "who9YWwLSNg",
      "title": "Trading in IRA Accounts",
      "url": "https://www.youtube.com/watch?v=who9YWwLSNg",
      "upload_date": "",
      "duration": 444.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 8,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=who9YWwLSNg&t=0"
    }
  }
]