[
  {
    "text": "Eric here got another question on what is a tender offer? This is actually a really cool one and it happens to be really simple so easy conversation. So the question was essentially that the poster wanted to understand tender or tendering what it is. So a tender offer is essentially a conditional order for somebody to buy a certain number of shares of an underlying at a certain price. So let's say a big institution is trying to, and it's kind of the third bullet point here designed to establish a big stake which equals influence. You can see this in hostile takeovers or if a company is trying to take a public company and turn it private. Essentially what you do is you need to buy a majority of outstanding shares. So let's say that they want to buy 80 of equitable shares that are out. They offer a certain price and what happens then is the brokers take that offer to anybody who is a current holder of that underlying. And then essentially the investor gets to say yes, I want to sell, excuse me, I want to sell mine shares at this price. Or nope, I don't. And then you just keep your shares if you don't, but if you do say I will share my share, sell my shares at this price. Then what happens is there's two possible scenarios. One, if the threshold is met then there will be a transaction. The threshold being",
    "metadata": {
      "video_id": "wLaiOoVm99Q",
      "title": "Tender Offer Explained - What is the impact to investors?",
      "url": "https://www.youtube.com/watch?v=wLaiOoVm99Q",
      "upload_date": "",
      "duration": 188.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 3,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=wLaiOoVm99Q&t=0"
    }
  },
  {
    "text": "don't. And then you just keep your shares if you don't, but if you do say I will share my share, sell my shares at this price. Then what happens is there's two possible scenarios. One, if the threshold is met then there will be a transaction. The threshold being the number of shares they want it to buy. So again, if we have stock XYZ being traded and some company investment firm whatever the case wants to take over or control kind of the decision making within that firm for any number of reasons, they'll say, OK, I want to buy 80 of outstanding shares in company XYZ and I'm willing to pay 50 for it. So then what will happen is that will go out to all the folks who currently own shares. They'll say, do you want to sell do you do not those who say I will sell at that price. A transaction doesn't happen immediately. What happens is they need to get enough responses from people who commit to sell their shares at that price. And then once they hit that 80 threshold, the transaction will occur. If it does not meet that 80 threshold or whatever threshold they set, then there's no transaction. So that's what a tender offer is. It's essentially a way for certain companies to try to solicit people to sell their shares so that a firm or whoever is looking to buy all the shares can take a large stake",
    "metadata": {
      "video_id": "wLaiOoVm99Q",
      "title": "Tender Offer Explained - What is the impact to investors?",
      "url": "https://www.youtube.com/watch?v=wLaiOoVm99Q",
      "upload_date": "",
      "duration": 188.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 3,
      "start_timestamp": "00:01:19",
      "start_timestamp_seconds": 79.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=wLaiOoVm99Q&t=79"
    }
  },
  {
    "text": "or whatever threshold they set, then there's no transaction. So that's what a tender offer is. It's essentially a way for certain companies to try to solicit people to sell their shares so that a firm or whoever is looking to buy all the shares can take a large stake in a certain company ultimately and not ultimately but more often than not to gain influence or control over the decision making. I hope that explains the question. If you have any other following questions, let me know and I'm happy to explore with you. Take care.",
    "metadata": {
      "video_id": "wLaiOoVm99Q",
      "title": "Tender Offer Explained - What is the impact to investors?",
      "url": "https://www.youtube.com/watch?v=wLaiOoVm99Q",
      "upload_date": "",
      "duration": 188.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 3,
      "start_timestamp": "00:02:39",
      "start_timestamp_seconds": 159.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=wLaiOoVm99Q&t=159"
    }
  }
]