[
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you what the fuck just you you you you you you you you you what just happened and the rest was left behind you you you you stop the build it over the government. That's kind of old news. Yeah, we we already knew that. Let me consult that with it. Yeah, we already knew that. And it's already been headed over to the house, which the house is going to pass it, which we already know. So three minutes ago, while we started here, eight minutes ago, begun closing our argument to urge members to vote to reopen. Okay. This might be a little bit a tailwind, but yeah, this is super interesting, because it's already like we already know this. And this has already been priced in, but this is like right at 1701. Again, these moves here, it's important to know like how much money can be made in this. This is a nine, nine-bar move. It's not huge, but if you look at the overall, like change here, it's 21 points essentially. This is every point is worth 50 bucks in eminence. It's like a, there's a decent amount of money there. It goes and now it's starting to reject. This is very interesting. And the queues is leading pretty massively. This looks like",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 946.08,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "overall, like change here, it's 21 points essentially. This is every point is worth 50 bucks in eminence. It's like a, there's a decent amount of money there. It goes and now it's starting to reject. This is very interesting. And the queues is leading pretty massively. This looks like it's going to continue throughout that vote. The strange part, though, is that, again, like we kind of already know what's going to happen here. And we know that Trump will agree with it. And he's actually planning on doing a signing ceremony tonight. So, interesting. Rain says the market is best desperate to Hoover up games for any reason. I wouldn't frame it that way. I understand, and it's kind of a fun, it's a fun joke, but the market is so much smarter, man. Like it really is, sorry, I'm kind of very interested here. Wait, what the? There. Bitcoin. Next to the person, the movement bitcoin is absolutely interesting to me, because of really big argument for a long time about Bitcoin is that it was essentially idiosyncratic or even inverse correlated to the market. So this is a catalyst moving Bitcoin is very interesting. Monterities, nothing there is really standing out to me. Ball coming down. And now the Russell is just just starting to participate. It is just flat for literally a second. But still heavily led by tech. If it's moving this much tonight based on this tomorrow, probably going to see some decent",
    "start_timestamp_seconds": 907.84,
    "end_timestamp_seconds": 1092.72,
    "start_timestamp": "15:07",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=907",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "there is really standing out to me. Ball coming down. And now the Russell is just just starting to participate. It is just flat for literally a second. But still heavily led by tech. If it's moving this much tonight based on this tomorrow, probably going to see some decent moves. What does fall look like? Zero's have been really good. I've had to modify the strategy quite a lot. But zero's have been really good with this recent surge of fall. Yeah, so like, oh, look at that. Wow. Wow. The the term structure and the front. Wow. Where's the, I think we have a fucking visualizer somewhere. So I can show you what I'm seeing. Is this it? Here we go. Let me move this over. We have one day, two day, five day, and then we'll do eight days. Okay. I'm born 157. 15? 122. This is very, very not normal. This kind of kink in the Volkerv is this is like a very deep premium over the next two days compared to the following five and eight day. This isn't priced quite into the level of like a binary event, but this is very, very high of all for this really really short term cycle. Let's take a look if you can capture that in their vol plot here. They have a pretty good like super short term vol plot. Not really. Yeah, that's not doing a great job. Well, I guess it's doing okay because",
    "start_timestamp_seconds": 1063.6,
    "end_timestamp_seconds": 1237.32,
    "start_timestamp": "17:43",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1063",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "of all for this really really short term cycle. Let's take a look if you can capture that in their vol plot here. They have a pretty good like super short term vol plot. Not really. Yeah, that's not doing a great job. Well, I guess it's doing okay because this like this right here is showing one day. Yeah, okay. So this is doing it. It's just not plotting it where if you look at the one day on this, it's 12.9% right now. It's over 15 in SPX. So the front is very, very heavy. This is all, well, they're missing the like the real front. This one is only going out to nine days, which is kind of a bummer. I would have really like to see like super super super super short term. We have any other, what is this? The expiration. Yeah, okay. So this is at least we can visualize it here across the expiration. Kind of what I just actually plotted for you. That part's cool at least. What does this go to? Is this the front term? 21 Nov. It's not. That's still a primary term. Uh, I need to reach out to them and see if we can do a couple things for that tool. Because being able to visualize stuff like this would be super super helpful. The Clif notes version for what I'm seeing and thank you for bearing with me as I'm like digesting what I'm seeing is",
    "start_timestamp_seconds": 1212.88,
    "end_timestamp_seconds": 1317.88,
    "start_timestamp": "20:12",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1212",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "to them and see if we can do a couple things for that tool. Because being able to visualize stuff like this would be super super helpful. The Clif notes version for what I'm seeing and thank you for bearing with me as I'm like digesting what I'm seeing is this flip in the market is more profound than I think it should be, which tells me that the market has a higher severity expectation of the events itself than even what the wall surface has been showing. And that original move on the reopening of the government here really is when that first came through. This was the front run. So the majority of the move already happened, but it does lead me to question how much more is in there on this move because other than like my base positioning, which does lean long delta's. So I will still participate to the upside, but I'm wondering I don't have a specific trade on for this at this point because I really thought that the meat was already captured, which still looks to be the case. But with it moving quite this much, now the only thing that draws caution to me is the fact that the Russell's not participating. That doesn't make sense. Like if all of this is based on the government opening, maybe there's an argument to be made that there's a disproportionate impact to large caps versus small caps, but I'm actually not so sure",
    "start_timestamp_seconds": 1301.0,
    "end_timestamp_seconds": 1406.4,
    "start_timestamp": "21:41",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1301",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "caution to me is the fact that the Russell's not participating. That doesn't make sense. Like if all of this is based on the government opening, maybe there's an argument to be made that there's a disproportionate impact to large caps versus small caps, but I'm actually not so sure that that's true. So the fact that small caps aren't really participating in the same way is not worthy to me. So this is a decent move. What is this? Like 0.3% from the low, but from the open it's like flat. Again, here, let me switch this out. This is the many, they trade a little bit different, but actually put the index itself. This itself. Curious. Tomorrow might be a little bit more spicy, and you can see that involved. For sure, the fact that the front is this jacked up compared to even five days out. That's enough of all to, to cause some movement. That's, for am sure. Go back and hear really, really quick. I just want to see what the ranges are. So this is looking at 38 points so you can see that literally the term for tomorrow is already come down to 1486. That makes more sense. This wall will continue to move as the market moves, but this wall, that was really high when that was what? 1572, that's expensive. So this being now down at 1486, that makes more sense. Let's just take a look at the, at the money",
    "start_timestamp_seconds": 1386.04,
    "end_timestamp_seconds": 1513.04,
    "start_timestamp": "23:06",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1386",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "1486. That makes more sense. This wall will continue to move as the market moves, but this wall, that was really high when that was what? 1572, that's expensive. So this being now down at 1486, that makes more sense. Let's just take a look at the, at the money is really quick. So I'm seeing the out of the money puts at 11 and a half in the call at 168, which is about right. Hmm. Is he busy? Is he busy? Marlboro would be pretty interesting. Speaking of the markets more broadly, let me finish showing you what I wanted to show you quickly before I got completely sidetracked. Main notes, healthcare. Healthcare just cracked highs. Healthcare has been one of like the primary sources of strength and from a breath perspective. We now have 51% of names above in the S&P 500 above their 50 day moving averages, which is really good. That's like a standard momentum level that up. And if we take a look at net highs and lows, we can see that in general, it's being sustained. Now again, I do see that the NASDAQ is underperforming slightly, but not massively. New York Stock Exchange is like 102. Ish. So there's a decent number, but it looks like NASDAQ is what 74. So definitely underperforming slightly, but breath right now looks way healthier than it did before bar none. Lawrence says, you and would say sell puts. I think unfortunately that's an over-simplified take",
    "start_timestamp_seconds": 1495.08,
    "end_timestamp_seconds": 1632.0,
    "start_timestamp": "24:55",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1495",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "Exchange is like 102. Ish. So there's a decent number, but it looks like NASDAQ is what 74. So definitely underperforming slightly, but breath right now looks way healthier than it did before bar none. Lawrence says, you and would say sell puts. I think unfortunately that's an over-simplified take away from what he was talking about. He's really referring to their, at least if I think about, if I'm thinking about the example that you're thinking about, which I think I am, that's thinking inception, I suppose. Is he's referring to when vol is elevated and you want to play the contraction of vol, which is actually a really, really, really, really, really important note that's counterintuitive for most people. Here, well, we'll literally take a look at it. I love that as a topic. Or the options trading casuals, this will probably be, I don't know, this will probably mean nothing to you, but if it doesn't, please ask me, let's go to, what is this? The 17th, let's go to the 17th of last month. And let's just take a look at something. 17th. Here you are. We need to fast forward a little bit. We need to be closer to the end of the day as it was having its big rally. What the fuck? What the fuck? What the fuck? What the fuck? What the fuck? Oh, did I fuck up? Why got the wrong date? What date is this? What was right? 17th. What",
    "start_timestamp_seconds": 1601.2,
    "end_timestamp_seconds": 1717.28,
    "start_timestamp": "26:41",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1601",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "to be closer to the end of the day as it was having its big rally. What the fuck? What the fuck? What the fuck? What the fuck? What the fuck? Oh, did I fuck up? Why got the wrong date? What date is this? What was right? 17th. What the fuck did he get up? Wait, I'm confused now. Was it like literally the last 15 minutes? There it goes. It just wasn't updated. Either that or it's a data issue. Let's see. Right now it's buffering. Speaking of Eric's pet peeves, another one is this platform says pre-buffering. What? In the fuck is pre-buffering? How do you buffer before you buffer? You're either buffering or you're not buffering. But what is what the fuck is pre-buffering that shit makes no sense? We need to go towards the open, by the way. 0830 and just let this. Lawrence says it's just a buff. Yeah, it's just buffering. There literally isn't buffering before you buffer. That's like when people say it regardless. Ever a guard-litch drives me fucking crazy too. Ever a guard-litch is compared to a guard-litch. Like regardless already is saying the thing that you want to say. Why the fuck are we saying, ever a guard-litch? What I'm trying to do in case you're wondering why I'm continuing to change the time, I want to sell a put when it's actually like really, really high, which this, it will hurt us as it's coming down just because",
    "start_timestamp_seconds": 1699.96,
    "end_timestamp_seconds": 1809.0,
    "start_timestamp": "28:19",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1699",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "Why the fuck are we saying, ever a guard-litch? What I'm trying to do in case you're wondering why I'm continuing to change the time, I want to sell a put when it's actually like really, really high, which this, it will hurt us as it's coming down just because I want you to see what it looks like. It's just gotta get the time vile in. I couldn't make this exercise way easier. I didn't think it was going to be quite this. Okay. I'm going to, I'm going to simplify my life a little bit. Yeah, now you're good, relax. Let's do a one month and then let's do one month they can do 15, five minutes. Here we go. Let's back a little bit further. This will work here. This is like right after the open. That's on Friday. Like 06. Okay. Recess people misuse irregularly so much they added it to the dictionary. Yeah, dude. Like, that's when you know we're playing the wrong game. We are literally working with the absolute lowest common denominators at that point. There's no, like the word already is, it's already saying what you want to say. Why we add a more shit to it. But that's like standard English language is we just over complicate literally everything for the fuck of it. So that's just how it goes. All right, we should be able to get our trade on or fucking not. What is happening right now? I'm going",
    "start_timestamp_seconds": 1795.4,
    "end_timestamp_seconds": 1937.44,
    "start_timestamp": "29:55",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1795",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "a more shit to it. But that's like standard English language is we just over complicate literally everything for the fuck of it. So that's just how it goes. All right, we should be able to get our trade on or fucking not. What is happening right now? I'm going to go to 0631. Literally a minute after the open. I don't think it crater that hard right after the open. This thing's being so weird. But what I want to show you is how like selling a put can look on days like this even though from a directional lens, it looks like you will get blocked for the life of me. It's a minute, it's got to be something with the data at this point. Whatever, this is fine. Whatever man. Okay, let's sell a couple. What I'm going to do for the example I'm going to, as always, like we should never just look at one if we're going to do the exercise, we should look at a few. So let's clear out all of our random nonsense from this. Let's clear the formatting and let's take a look at a couple scenarios. I'm going to move this off to the side. So I can go a little faster. I will show it to you again. But I'm going to look at the 5DTE. I'm going to look at the 12DTE. And then we'll take a look at the 19DTE. And then we'll take a look at",
    "start_timestamp_seconds": 1914.72,
    "end_timestamp_seconds": 2017.12,
    "start_timestamp": "31:54",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=1914",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "this off to the side. So I can go a little faster. I will show it to you again. But I'm going to look at the 5DTE. I'm going to look at the 12DTE. And then we'll take a look at the 19DTE. And then we'll take a look at the 33DTE. And we are going to need the strike price. We're going to need the delta. We're going to need the premium. And that should be a decent starting point for us. Okay, so for the put side of the equation, please, no. It's all fucked up. It's all fucked up. Let me see if this is all fucked up across all of them. You mother fucker. Okay, so this one looks normal. So it looks like we're just not going to look at the weaklies with this data. Unfortunately, that's how she goes. So you only get to look at one. So sorry about that, but that's all you get. What I'll do is I'll look at a couple different deltas, at least. So you'll be able to at least explore that. The first thing that you should look at that, again, if you're used to trading options that should catch your eye is the deltas. Like why are the deltas so fucked up? The reason why the deltas are so fucked up is because this thing has an expectation about what is going to happen. And you can see that being priced in effectively real time. Spot",
    "start_timestamp_seconds": 2003.0,
    "end_timestamp_seconds": 2103.16,
    "start_timestamp": "33:23",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2003",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "that should catch your eye is the deltas. Like why are the deltas so fucked up? The reason why the deltas are so fucked up is because this thing has an expectation about what is going to happen. And you can see that being priced in effectively real time. Spot price. Spot price right now is 24.51. And let's take a look at the 30 strike. I'm just reorganizing all this for the new format. We're going to look at a 30 strike. We'll look at the 25 strike, the 20. And then we'll do that should be enough. Actually, no, we'll do one more. Let's do what like the 15. We'll get something that's like super proud of them. Okay. First things first. What are we. What do we see in for our deltas? Our 30, our 30 strike is a one delta for sure. Our 25 is probably, again, the math there is fucked up, but it's probably a point nine delta. The 20 is a point four six delta. And then the 15 is a point of six delta. Again, this, this is one of the coolest things about options is that it literally is telling you essentially what's going to happen. You just have to know how to read this, but it's literally telling you what's going to happen. The 25s are for 550, the 20s are for, I'm going to call it like a dollar 85. And then the 15s, those are for 12 cents.",
    "start_timestamp_seconds": 2082.16,
    "end_timestamp_seconds": 2194.48,
    "start_timestamp": "34:42",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2082",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "essentially what's going to happen. You just have to know how to read this, but it's literally telling you what's going to happen. The 25s are for 550, the 20s are for, I'm going to call it like a dollar 85. And then the 15s, those are for 12 cents. Okay. Here's, here's what we have so far. A few things that you should know, if we take a look at the percentage off of spot price, I don't really care if it's positive or negative, don't really pay any attention to whether or not it's positive or negative. It doesn't matter. I don't understand this fucking. I just cleared formatting. If I just cleared the formatting, why is it still giving me fucking dates or shit? It's ridiculous. You stupid Google sheets or smarter than that. Okay. So all of these show you essentially how far apart these are from moneyness. Again, don't worry if it's plus or minus it doesn't matter. Just look at the absolute number. The absolute number here is very interesting, isn't it? As we can see things that if we move in just these $5 increments, this is nothing even remotely close to linear. You can literally see where the market is expecting this to move towards here without it out. However, with it currently elevated, you can see the deltas as what they are. So now let's fast forward time. Joey, so this is going to be with spot price at 2451. That's",
    "start_timestamp_seconds": 2176.6,
    "end_timestamp_seconds": 2289.32,
    "start_timestamp": "36:16",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2176",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "You can literally see where the market is expecting this to move towards here without it out. However, with it currently elevated, you can see the deltas as what they are. So now let's fast forward time. Joey, so this is going to be with spot price at 2451. That's this grouping here. And we will repeat this exercise one or two more times so that you can see the difference. How the deltas move and how the premium changes. So what I'm going to do is first just fast forward towards the end of the day. And this will be literally intro day, same day but later. So this is spot price 2451 is when we started. This is at the open. This is at the close. Both of these are on 17 oct. I'm not going to do the opening close for all of them. By the way, I'm just doing it for this one because there was some movement on the date itself that I think is worth looking at. Okay. Let's take a look at our 30. Our 30 is still definitely delta of 1. Our 25 delta of 1 for sure now. The 20 is a 0.6 and the 15 is a 0.06. Very, very interesting. Again, I kind of feel sad for myself when I get so excited and say shit, like very, very interesting for this. But the shit is interesting. So fuck you. What is this? 595. 595. Let's take a look",
    "start_timestamp_seconds": 2263.12,
    "end_timestamp_seconds": 2387.16,
    "start_timestamp": "37:43",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2263",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "a 0.6 and the 15 is a 0.06. Very, very interesting. Again, I kind of feel sad for myself when I get so excited and say shit, like very, very interesting for this. But the shit is interesting. So fuck you. What is this? 595. 595. Let's take a look at the 20. The 20 is like 205 and then the 15 is what is that? Wait. Okay. Now, let's just see what's cracking. This is essentially what you would have collected if you had sold your puts at the beginning of the day. That's this line here. This is on 17 october. This is what, let me, let me look more clear. This is what they're worth towards the end of the day. The first thing that you should notice and the most interesting one here by far is this one. Reason why this one's so interesting is because over the course of a day, this thing went from a 0.46 delta to a 0.6 delta. That's a significant change. Again, if we just contextualize that as a percentage, I am not the guy that's just going to fucking do that in his brain, but I can do it with Google sheets. You get 30%. It's a huge change. Literally just over the course of a day. Again, this isn't like the front. These are 33 days to expiration because the front contracts didn't work unfortunately. All right. Let's just fast forward now. We'll just go like two days",
    "start_timestamp_seconds": 2360.24,
    "end_timestamp_seconds": 2480.08,
    "start_timestamp": "39:20",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2360",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "with Google sheets. You get 30%. It's a huge change. Literally just over the course of a day. Again, this isn't like the front. These are 33 days to expiration because the front contracts didn't work unfortunately. All right. Let's just fast forward now. We'll just go like two days and I think this will probably be enough because I really want to go through the collapse. Yeah, perfect. There's the collapse. Let's take a look at what these are at now. So this is now 21 October. And we will repeat this no-mas one more time. Move this off to the side. You got to change the spot. Press the plus one. That gets. Who was it? Like what? 21, 20. OK. So now we're at 17. 59. Our 30s, those now have adults of 0.75. The 25s, those have adults of 0.7. The 20s, those have adults of 0.51. And the 15s, those have adults of 0.06. The premium for the 30s is 11.7. The premium for the 25s is 6.95. The premium for the 20s is 2. 6. Oh, I totally forgot. 265. And then for the 15s, those are at 0.99. All right. Here's what we're at so far. So far, your current change in terms of premium from where you would have first sold these. And since we're selling, we wanted to go down. So I'm going to do the math in, oops, that's not. I'm going to do the math this direction. And you",
    "start_timestamp_seconds": 2458.48,
    "end_timestamp_seconds": 2612.44,
    "start_timestamp": "40:58",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2458",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "at so far. So far, your current change in terms of premium from where you would have first sold these. And since we're selling, we wanted to go down. So I'm going to do the math in, oops, that's not. I'm going to do the math this direction. And you can see where we sit. This is with spot at 17.59. Why does this matter with spot at 17.59? You can see all of your trades have lost money so far. But what's the important part? The important part here is that if you take a look at how much spot is changed from where you started, which was 6.92, that change is profound. If this thing dropped, 7 points, why is it that this is not 7 points? More. We would expect this was a delta of 1. That means for every 1 point moving the underlying, we would have expected this to change by 1. But it didn't. The delta in this premium is actually significantly less. This premium only moved by less than 2 points, 1.95. The premium here didn't change much, even though the underlying changed massively, the delta would have likely given you the expectation that it would have been a much more significant move. As you should guess, before we get into answers, let's go a bit further. We're going to go to 31 October. This originally was 33 days to expiration. Now we're at 19. I'm going to move this off side again.",
    "start_timestamp_seconds": 2584.08,
    "end_timestamp_seconds": 2734.08,
    "start_timestamp": "43:04",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2584",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "that it would have been a much more significant move. As you should guess, before we get into answers, let's go a bit further. We're going to go to 31 October. This originally was 33 days to expiration. Now we're at 19. I'm going to move this off side again. Let's take a look at example. Alternate. Let's take a look at the 30. The 30 is a delta of 0.78, a premium of 11.4. The 25 delta of 0.73, a premium of 665. The 20 delta of 0.52, premium, 2.34, call it 15. That's 8 cents with the delta of 6. All right. Really, really important lesson here in terms of the response of VIX changes. What's happened now from the beginning, our spot price has dropped 3.26 points. We're now a little bit deeper into this trade. We went from 33 days to expiration of 19. So a decent passage of time. If we look across at our P&Ls, our P&Ls here, are still in the red. But they're starting to shift. Notice how your P&L here went up, went up again, and is now starting to come down. But notice a fascinating change. The fascinating change here is that your delta's from the 30 and the 25 literally went up. Increase. Your delta's went higher. Yet your premium contracted. That's volatility. This is the kind of position where volatility has dampened this entire thing so far. If volatility had not been contracting, again, you would have gotten",
    "start_timestamp_seconds": 2703.64,
    "end_timestamp_seconds": 2881.64,
    "start_timestamp": "45:03",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2703",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "is that your delta's from the 30 and the 25 literally went up. Increase. Your delta's went higher. Yet your premium contracted. That's volatility. This is the kind of position where volatility has dampened this entire thing so far. If volatility had not been contracting, again, you would have gotten your face ripped off on delta's. So again, if we look at this 0.75 delta, if we look at what the delta impact here, this isn't accounting for gamma or anything, your premium should have gone up by $2.45. But your premium went down by 30 cents. Again, this is all kind of rough numbers. But what's the important factor here? The important factor here is that you have other effects, Vega and theta that have offset over $2 of premium impact. This is what you and is talking about, Lauren. When you're trading things like this, and you're essentially trying to run the contraction. That's kind of a bummer. We can't get to 19 November. I just realized I picked an expiration. That's ahead of time here. Let's just go to the 10th of November. That's the closest I can get us. And then we'll check it one more time. This is now 90's expiration. And, oh shit. Spot price is what? 1792. So, it's spot price at 1792. We should completely expect spot price or our premium to have gotten worse. Premium should go up pretty massively here. Let's see what actually happened. Delta for the 30s. Point",
    "start_timestamp_seconds": 2851.92,
    "end_timestamp_seconds": 2990.64,
    "start_timestamp": "47:31",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2851",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "time. This is now 90's expiration. And, oh shit. Spot price is what? 1792. So, it's spot price at 1792. We should completely expect spot price or our premium to have gotten worse. Premium should go up pretty massively here. Let's see what actually happened. Delta for the 30s. Point E2. Premium for the 30s. 11.5. For the 25s. 6.7. And 0.8. Seven. The 20s. 2. We'll just call it like 2.1. Premium here is 0.6. And then for the 15s, those are down to two pennies. 0.2. 2. We can't get to expiration unfortunately yet, just because the trade technically still open. But again, the key things to note. In this case so far, you're still losing money. All itself did not overwhelm the contraction in VIX. Now, well, what times it? We have time for one more example. So, I want to show you one more that we can take all the way, because it'll give you a good idea of what this actually looks like. But again, the most important thing to take away from where we're at right now is from the start of this exercise, we literally went down 6 points. These things started with deltas that were effectively deep in the money, right? 80 deltas. Yet, you're not seeing that relevant change in your premium and actually in these 20s, which have been in the money, and the delta actually went up again significantly, it actually contracted on its premium. The thing that you",
    "start_timestamp_seconds": 2940.48,
    "end_timestamp_seconds": 3096.64,
    "start_timestamp": "49:00",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=2940",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "deltas that were effectively deep in the money, right? 80 deltas. Yet, you're not seeing that relevant change in your premium and actually in these 20s, which have been in the money, and the delta actually went up again significantly, it actually contracted on its premium. The thing that you should pay attention to here as well as the fact that the further out of the the money's haven't moved, they've not really moved. So, if you started with this trade, you would have seen effectively no movement for the majority of it. But then at the very end as we get closer to expiration here, you're starting to see it drop off a little bit, which is also super cool. All right, let's take a look at one more. We're not going to do quite as many steps in one more. I just want to go back further so that we can play some of the things we've done. That we can play something all the way through. And ideally, we want to play something with a little bit more magnitude, because we didn't even get a chance to sell it when it was up here. We ended up selling it when it was down here, which is not ideal for this kind of thing. We need to get something like this. What was this? This was on two August. Let's go to two August. And let's see if it is even... Wait. I fucked up. I fucked up.",
    "start_timestamp_seconds": 3072.64,
    "end_timestamp_seconds": 3164.64,
    "start_timestamp": "51:12",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3072",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "selling it when it was down here, which is not ideal for this kind of thing. We need to get something like this. What was this? This was on two August. Let's go to two August. And let's see if it is even... Wait. I fucked up. I fucked up. What date is this? This. I want to see if it even lets us... Oh, of last year. There we go. There we go. Cool. This is great. And let's go a little bit earlier in the day. So let's do like 0930. This is specific time, by the way. Oops. It's... You want to... Silly thing. Let's see if it settles out. We'll give it a chance to pre-buffer. You know, that's super important process of buffering before you buffer. Completely logical. Makes it ton of sense. There we go. Okay. That's fine enough. Let's go a little bit earlier. We'll go to 730. I want to catch it when it's... Yeah, like up here in the 40s or 50s. I think that'll be at least a more extreme example which is it. And then we literally can... Take this, replicate it. I don't really care about the main thing we need is the days. Cool. This broken. Yeah, it's kind of broken, but... That looks correct. And that also looks correct. Okay, cool. We can take a look at two expressions which is also naturally. We'll grab one more. Again, we'll do this all at the same time.",
    "start_timestamp_seconds": 3137.64,
    "end_timestamp_seconds": 3279.64,
    "start_timestamp": "52:17",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3137",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "thing we need is the days. Cool. This broken. Yeah, it's kind of broken, but... That looks correct. And that also looks correct. Okay, cool. We can take a look at two expressions which is also naturally. We'll grab one more. Again, we'll do this all at the same time. But the first expiration that we'll look at is 14-awg, which is 90-to-e. And then the second that we will look at is 44-to-e. Don't need these. Spot price right now is 43-99. I guess I'll just do them both in line. I think that's a good idea. I think that's a good idea. I think that's a good idea. I think that's a good idea. I think that's a good idea. I think that's a good idea. I think that's a good idea. I think that's a good idea. All right. So, Spot right now, 43-99. Let's take a look at some strikes. That way. 90-to-e. We're going to look at something with a delta of 1. So, we'll pick the at the money. We'll just do the 45. And then we're going to try to find stuff with slightly lower delta. We'll go to the 19. Which is showing us what it thinks the at the money might look like. Which is a 49 delta. And then let's go to like a 15 delta that puts us at the 16, which is a 14 delta. Okay. And let's grab our premiums really quick for the 45s. The the",
    "start_timestamp_seconds": 3254.64,
    "end_timestamp_seconds": 3408.64,
    "start_timestamp": "54:14",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3254",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "showing us what it thinks the at the money might look like. Which is a 49 delta. And then let's go to like a 15 delta that puts us at the 16, which is a 14 delta. Okay. And let's grab our premiums really quick for the 45s. The the bed-ass spread on these, as you can tell, this is exactly how it goes. I'm going to use the way it can be most consistent. $67. And then the 16s are at like 20. And then let's go to the 44-DTEs really quick. And then I'm literally just going to fast forward one time. And we'll go like super far. The 45s, those are still your 1-2. And then we'll go to the 40-40-40. And then we'll go like super far. The 45s, those are still your 1-DTEs. And those are at 1955. The 19s here are at a 75-DTE. And those are for $1. And the last ones, the 16s, those are for 57 cents. And that is a delta, uh, win some five. Okay. The only thing I'm doing really quick is I'm reorganizing premium and delta because I noticed myself. Okay. The ordering, this is just part of my mental disease of having to be efficient. And this has us on five August. Let's go to 9, let's go to 14 August so that we can get to the expiration for these. And let's see what they would look like. We're going to do this exercise again.",
    "start_timestamp_seconds": 3386.64,
    "end_timestamp_seconds": 3502.64,
    "start_timestamp": "56:26",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3386",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "of my mental disease of having to be efficient. And this has us on five August. Let's go to 9, let's go to 14 August so that we can get to the expiration for these. And let's see what they would look like. We're going to do this exercise again. This will be on, I said, 14 August. And we will see what our spot presbyte. And we will see what our spot presbyte is. Oh. Let's go to our 45s. Those are whatever the current intrinsic value is. So I'm going to keep those at certainly those, the delta's here are fucked up. That's a delta of one without a doubt. And spot price is 17 16. So we can literally just figure out how far in the money. These are, which is like 20, 70, 4. So 27. Let's go to the 19s. No idea what these are reasonably priced at. Looks like about a dollar. So I'm just going to go with that based on the last. And the delta for those is a 0.38. And then let's go to the 16s. Last on that was two pennies. That looks about right. And delta on those is 0.29. And then let's go to 44. Well, originally 44 was the 18. Step. Why? Why do this to me? Thank you. 45s. We have a market here at least. These are 28, 15. Got to be a delta of. I'm going to go a gut instinct. I think those",
    "start_timestamp_seconds": 3483.64,
    "end_timestamp_seconds": 3631.64,
    "start_timestamp": "58:03",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3483",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "0.29. And then let's go to 44. Well, originally 44 was the 18. Step. Why? Why do this to me? Thank you. 45s. We have a market here at least. These are 28, 15. Got to be a delta of. I'm going to go a gut instinct. I think those are delta one. I don't think that. The 19s are 365. And those are adults of like 0.45 that I think we. And the 16s. Those are a dollar 34. And those are a delta of points. So here's what went down. Your spot price move. 26 points. And over the duration. You experience. A pretty significant loss on your nine. A expiration options. You saw pretty. Yeah, the nine day expiration of 45s that were a one delta. The 19s. This is really the main thing to pay attention to. What happened with these 19s and these 16s. With the 19s and the 16s. With nine days of expiration. Even though you sold the 19 puts. When the underlying was 43 dollars in 99 cents. 43 dollars 99 cents. You sold these then. The underlying dropped. 26 points. It went from. 399 to 1716. Yet the premium on your 19s went from a dollar 67 down to a dollar. With a delta dropping from 0.49 to 0.38. This is what you was talking about. Now the reason why I showed you the in the money's in the out of the money's is to give you a sense of how",
    "start_timestamp_seconds": 3593.64,
    "end_timestamp_seconds": 3747.64,
    "start_timestamp": "59:53",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3593",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "19s went from a dollar 67 down to a dollar. With a delta dropping from 0.49 to 0.38. This is what you was talking about. Now the reason why I showed you the in the money's in the out of the money's is to give you a sense of how they move. Because you noticed the thing that's wrapped around 50 delta's had a pretty significant drop. But if you take a look at the thing that was at like a 15 delta closer to the wings, not quite what we would consider like super far out of the money tails. But take a look at what happened to the premium here. It went from 22 cents to two. Delta went up from 14 to 29. This is the cool thing about trading. And this is why. So unique when you trade it is because it has a lot of very, very, very unique factors that most people genuinely don't understand that well. And I don't blame them because the shit is completely different than most of what you've seen. If I gave this scenario to anybody else, if I said you sold a 50 delta put. That was nine days to expiration. You sold a 50 delta put. The underlying dropped. Well, I'll put it in terms of a percentage so that it's not based on the price. The underlying drops 61% does your short put make money. I think the overwhelming majority of people myself included would absolutely",
    "start_timestamp_seconds": 3732.64,
    "end_timestamp_seconds": 3840.64,
    "start_timestamp": "01:02:12",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3732",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "days to expiration. You sold a 50 delta put. The underlying dropped. Well, I'll put it in terms of a percentage so that it's not based on the price. The underlying drops 61% does your short put make money. I think the overwhelming majority of people myself included would absolutely say no unless you include the fact that this is a volatility product. As soon as you tell me it's a volatility product, I know I have to apply a completely different mental model because of the uniqueness of how these things behave. This is the cool stuff. So Lauren, I hope that that example. Help, you know, tie the points together that you and was talking about because I think it's again super important stuff to be aware of, but this stuff behaves a lot differently. Then how you might expect what you get is the cool part. So any questions before I bounce for the evening. Anything that you'd like to touch on anything that you want to take a look at. And then in the meantime, in the meantime for tomorrow. We're doing skill development for the pro members and then the live stream on Friday the beginner stream. I actually think I'm going to slot in one additional episode. So the original plan for episode four so it was originally going to be five episodes now I think we're going to have six because I want to do something. The game plan is to talk about",
    "start_timestamp_seconds": 3811.64,
    "end_timestamp_seconds": 3931.64,
    "start_timestamp": "01:03:31",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3811",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "beginner stream. I actually think I'm going to slot in one additional episode. So the original plan for episode four so it was originally going to be five episodes now I think we're going to have six because I want to do something. The game plan is to talk about the concept of edge. I actually tried to make a post about it that when like really really poorly. I think it's just because again, Reddit is read it is what read it is. I want to explain a little bit around the concepts of what edge actually does and doesn't look like so that's my game plan or Friday. I think which I mean we might be able to bake that into the maybe we do that maybe we just bake it into the episode for already which is building a portfolio we can talk about edge there but I think it's important. Kirk says with that selling puts of all example work in GME during meme craze or similar meme names with elevated vault yeah similar concept. What it work exactly the same as some sort of index fall definitely not but yes this is actually the exact kind of thing that you would look for yeah exactly what Lawrence mentioning that that was one of the the. For sites examples that we discussed because it's stuff like game stop that has these kinds of very unique moves so your instinct is your instinct is correct. To eat",
    "start_timestamp_seconds": 3907.64,
    "end_timestamp_seconds": 4019.64,
    "start_timestamp": "01:05:07",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3907",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4035.0
  },
  {
    "video_id": "WN3YZaMHZYw",
    "title": "Breadth Signals and Government Shutdown - Stock Market Update",
    "text": "kind of thing that you would look for yeah exactly what Lawrence mentioning that that was one of the the. For sites examples that we discussed because it's stuff like game stop that has these kinds of very unique moves so your instinct is your instinct is correct. To eat all right gang that wraps me up I'll see the pro members tomorrow for your skill development live stream and then I'll see the rest of the outliers on Friday. The in outlier see you later.",
    "start_timestamp_seconds": 3993.64,
    "end_timestamp_seconds": 4029.64,
    "start_timestamp": "01:06:33",
    "video_url": "https://www.youtube.com/watch?v=WN3YZaMHZYw",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=WN3YZaMHZYw&t=3993",
    "chunk_index": 30,
    "word_count": 86,
    "upload_date": null,
    "duration": 4035.0
  }
]