[
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "What's up, outliers? Welcome back to that LAR podcast. I have a gust in here to tell us how trading is super easy. It's a way to fast, easy riches with minimal effort, stable, monthly income, and I'm really excited to learn the secret. So, up, gusts. Thanks for having me on. It's good. So, being is that I nailed that intro. The funny part is for those that obviously wouldn't know, but when we originally started talking, I had mentioned doing a podcast and you were like, that sounds kind of interesting, but I'm not sure would be exactly the right fit because my primary piece of advice is don't trade. And I actually thought it was funny because even though I do what I do, that's typically my advice. So, once we realized that we had that actually drastically uncommon, I'd love to unpack that because here we are two dudes on a podcast talking about trading where the basic advice is, don't trade, why do you think people are best off avoiding that? Yeah, look, I mean, I think a lot of people get into it for pretty, pretty believable reasons. Like, oh, they think that maybe this is a way to make money, maybe it's an easier way to make money than slogging away at some 95 job. I get to be my own boss. I get to do what I want. I've always had a passion for this, et cetera. So, I can get the",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 82.96,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "this is a way to make money, maybe it's an easier way to make money than slogging away at some 95 job. I get to be my own boss. I get to do what I want. I've always had a passion for this, et cetera. So, I can get the idea in the interest. But I think I'm a person of analogies and this is probably the first of many that I'm going to give you over the course of an hour, but I think you really have to understand that trading and financial markets is like playing in the NBA or playing in the NFL, except that there's no teams, there's no draft, there's no salary, it's just, there you go. There's JJ Watts trying to get through it, right? Like, that's it, that's the game, right? And so your prior should be before you even think about it or start that, like, okay, this is not going to be especially easy, especially because the JJ Watts of the world have resources that you can't even imagine up going up against you. So that's maybe my headline analogy about it. Well, and I think it's perfect. Could you double click a little more into the resource section? Because there's kind of a couple different ways to go about trading. I'm coming up on two decades and one of the things that I've obviously come to appreciate pretty quickly is that if you're like, get in real fit in, you",
    "start_timestamp_seconds": 70.24,
    "end_timestamp_seconds": 151.8,
    "start_timestamp": "01:10",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=70",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "click a little more into the resource section? Because there's kind of a couple different ways to go about trading. I'm coming up on two decades and one of the things that I've obviously come to appreciate pretty quickly is that if you're like, get in real fit in, you have to figure out where you can play. So can you talk a little bit about the the resource and side of it, that's actually a huge piece of the equation? Yeah, I mean, the thing you're saying, like, you hear it in poker, hopefully you hear it in poker where if you're at a table with nine other players and they're the best players in the world, it kind of doesn't matter how good you are, like, that's just not a game that you should be playing in. And so like you said, like table selection is everything in trading in poker in life, maybe. And so I want to say at the outset, like, I can, I know that there are profitable retail traders out there. I, you know, a couple of my friends do this for a living and they're on their own and they don't have any big infrastructure or resources or anything like that. But the reason they can do it is because they know what they're good at and they stick to that. And in particular, it's something that they figured out for themselves that works for them. It's not a system. It's not",
    "start_timestamp_seconds": 136.48,
    "end_timestamp_seconds": 211.56,
    "start_timestamp": "02:16",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=136",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "any big infrastructure or resources or anything like that. But the reason they can do it is because they know what they're good at and they stick to that. And in particular, it's something that they figured out for themselves that works for them. It's not a system. It's not a, it's just they figured out through a trial and error years of, like, trying to figure out out for themselves. The thing that kind of pains me when I see it online on Twitter or elsewhere is when you see somebody who is interested in this and then they drop some money for a course or something. And that course is teaching them how to, like, click, trade the S&P 500 futures and somehow they're going to make money there. Like you have to understand that the people you're trading against, they're incredibly profitable businesses for a reason, right? They bring in the smartest people they can, the payment bunch of money, they have access to computational resources, they have access to prime brokers, they have access to cost basis, they have access to capital, they have all this access that a retail trader can't possibly compete with the machines that they're, they're deploying, make decisions on more information than a retail trader can make in under a microsecond. Like you're just not going to win in that game. It's not to say there's no games you can't win at, but the set of games you can win at",
    "start_timestamp_seconds": 197.68,
    "end_timestamp_seconds": 267.76,
    "start_timestamp": "03:17",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=197",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "machines that they're, they're deploying, make decisions on more information than a retail trader can make in under a microsecond. Like you're just not going to win in that game. It's not to say there's no games you can't win at, but the set of games you can win at is pretty small. And you spent time at Jane Street is what, like, six years is that right? Yeah, that's right. So what were some of the conversations and problems that you guys are solving there to give people a sense of the other side and what you guys, you sneaky little, I'm just kidding, what you guys are up to? Yeah, look, I think when we do, I used to do a lot of recruiting and so people would ask us, like, so what is it that you do? And one of the best analogies that I heard, it wasn't mine, but I'm going to steal it shamelessly, it's the belonging sandwich business, right? Like if I can buy baloney, bread and cheese for like $3 a sandwich, make the sandwich and sell that sandwich for $4, that's a business, right? And that is what ETF market making is, that's what ADR market making is. It's a little bit what options, maybe ETF options market making is, it's a, right? It's understanding mechanical relationships between securities and then providing a service to the world. Market making is definitely providing a service to the world by always being willing to",
    "start_timestamp_seconds": 257.0,
    "end_timestamp_seconds": 337.92,
    "start_timestamp": "04:17",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=257",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "that's what ADR market making is. It's a little bit what options, maybe ETF options market making is, it's a, right? It's understanding mechanical relationships between securities and then providing a service to the world. Market making is definitely providing a service to the world by always being willing to buy and sell. That service has value, has value proportional to how volatile, roughly speaking to how volatile the security is. And so it makes sense that that can be a business, right? But the thing is, there's no real barrier to entry for this business. And so because of that, it's incredibly incredibly competitive. You have to be very, very sharp and you have to have extremely low cost and extremely good technology and really sharp people. Now in the game of market making specifically across different asset classes, it's also a completely different game than what a retail trader might be attempting to accomplish. Could you talk a little bit about the goal there versus retail trading? And the reason why I'm asking to explore this point is because a lot of times retail traders say to themselves, like, oh, I have to emulate the big guys. That's how I'm going to make money. I got a, you know, pretend and try to be like them. Right. No, I mean, that's obviously maybe a full game is what I would say. Right. Like the idea of a market maker is you don't really have an opinion about which",
    "start_timestamp_seconds": 321.68,
    "end_timestamp_seconds": 402.52,
    "start_timestamp": "05:21",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=321",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "how I'm going to make money. I got a, you know, pretend and try to be like them. Right. No, I mean, that's obviously maybe a full game is what I would say. Right. Like the idea of a market maker is you don't really have an opinion about which way the security will go. You just want to in principle collect the spread. Now that sounds really easy the way I said it, right? Like I just put some bids out here, puts a mask out here, see who shows up, blah, blah, wonderful. Except the big challenge with any kind of liquidity provision is the adverse selection, right? Like people are going to be really, really smart. And if you post a bad market, you're going to do all the bad trades you want. And if you post a good market, then like, yeah, you might get like a trade here there. And so the systematic adverse selection of market making is part of what makes it such a hard, interesting problem. Whereas retail trading, I would imagine not being a retail trader myself. I'm pretty uninformed. The honest is more about like can you identify some effects of misprice? Something that the world doesn't understand as well as you do. And then can you put a trade on that expresses that belief in a way that it's like cost effective and risk effective enough for it to actually make money for you? It's like a two stages",
    "start_timestamp_seconds": 393.52,
    "end_timestamp_seconds": 466.24,
    "start_timestamp": "06:33",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=393",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "of misprice? Something that the world doesn't understand as well as you do. And then can you put a trade on that expresses that belief in a way that it's like cost effective and risk effective enough for it to actually make money for you? It's like a two stages to the problem, right? Like you can identify all the inefficiency you want. But if you can't put the trade on it like efficiently, then it doesn't help you very much. The other thing you've talked about before is especially from like a self-directed lens is doing less. Why is that something you hard-bomb? But because every time you trade, you're paying somebody money, right? You're paying the broker money, you're paying like your counterparty money. Huh? I said, but there's no commission. I imagine that the no commission thing has been touched on in your podcast before. But yeah, like you're obviously always like every action you do has a cost to it, right? Even if it is your commission, let's just say it's your commission, right? It has a cost in terms of your attention, in terms of what you're paying attention to, in terms of what you have to manage from a risk perspective. So yeah, like putting a trade on in the simplest possible way is probably the thing you should do most more often than not, right? The interesting part about that with respect to trading specifically is this idea of sample size. And if",
    "start_timestamp_seconds": 445.52,
    "end_timestamp_seconds": 532.84,
    "start_timestamp": "07:25",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=445",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "have to manage from a risk perspective. So yeah, like putting a trade on in the simplest possible way is probably the thing you should do most more often than not, right? The interesting part about that with respect to trading specifically is this idea of sample size. And if you want to set something up so that you touch it as little as possible, but you also have to do enough to get a healthy sample size, how would you kind of balance that juxtaposition? Yeah, so I think that's where understanding some math comes in, honestly. And I'm not saying it's the only way to do trading. I'm not going to say here to say that, but I don't know of a way to do this without understanding a little bit about the math. I think it's pretty clear that if you're doing something where it's a lot of trades every day, then you're going to get to a high sample size pretty quickly, but probably just by the nature of competitive markets, the edges that you're exploiting are probably pretty small. And so it's going to take you some amount of time to figure out like, does this actually make money or not? Or you could go the other direction, right? Or you do some infrequent trades, once a day or once a week or whatever, right? You need probably fewer samples if that's a profitable trade for that strategy, because hopefully the edges on those kinds",
    "start_timestamp_seconds": 514.96,
    "end_timestamp_seconds": 589.0,
    "start_timestamp": "08:34",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=514",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "this actually make money or not? Or you could go the other direction, right? Or you do some infrequent trades, once a day or once a week or whatever, right? You need probably fewer samples if that's a profitable trade for that strategy, because hopefully the edges on those kinds of trades are much larger. So they're all kind of even doubted some sets. Which, or raise beautifully into the next general point on that, which is this idea of like even being able to like quantify your edge, because one of the fun things in retail trading, at least from my own experiences, there's some things I can look at, I can measure, and I can see robustness over duration. And other things, I'm the fucking clue why it's working, but I could see it, and it's kind of there. So could you talk about that seemingly thing that's you know, a granted, but it's actually a little more complex? Yeah, so it's funny. I talked to a friend of mine, former James, friend of mine earlier today, and I told him I was coming on this podcast, and he said, oh yeah, so he actually, he left a big trading company recently, and he's going to start out doing stuff that stuff on his own. Just great, I'm sure he's going to do great. And so he's been trying to understand more about sort of the retail side of things, and that's sort of thing. And what he",
    "start_timestamp_seconds": 575.64,
    "end_timestamp_seconds": 650.28,
    "start_timestamp": "09:35",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=575",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "big trading company recently, and he's going to start out doing stuff that stuff on his own. Just great, I'm sure he's going to do great. And so he's been trying to understand more about sort of the retail side of things, and that's sort of thing. And what he said to me is, I think pretty interesting, he said, look, I think a lot of these people who are retail traders have been successful for years and years, I believe that they are. Like, I don't doubt that a retail trader can make money, but just the way they talk about their trading, there's probably a bit of what you just said, right, where it's clear they have some edge, but they might not be thinking about it quite the right way, or maybe as optimally as they could. I think that gets back to something, I think you might have said earlier, which is it's an iterative process. Like, if you're doing the same thing today that you did last year, that you did the year before, etc., you're probably not going to do well. It's just such an iterative game of just trying to get just that tiny, tiny bit better every single day. There's also this really interesting thing early on where you don't know what you don't know, and then it's difficult to tell if what you're doing is actually value-add, or if it's path, what are some of the ways that you can think",
    "start_timestamp_seconds": 634.52,
    "end_timestamp_seconds": 714.52,
    "start_timestamp": "10:34",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=634",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "tiny, tiny bit better every single day. There's also this really interesting thing early on where you don't know what you don't know, and then it's difficult to tell if what you're doing is actually value-add, or if it's path, what are some of the ways that you can think of to explore that, to be able to stress test is this path, or is this some sort of value-add? Right, yeah, so I think a lot of that has to do with, I read a lot when people talk about retail trading about emotional control and staying with this thing. It's important to know that stuff. I'm sure that's important, but it's not nearly as important as having edge. There's no amount of emotional control that will turn a losing strategy into a profitable strategy. I think maybe my best answer that, again, talking to friends who do this is you need to have a small group of people that you can talk to, where you trust their judgment, they trust your judgment, and I'm not talking about a large, discord group, or anything like that. I'm talking about three, four, or five people, where you're talking most days, and you're saying, hey, this is a thing I'm seeing, like this is a sound reasonable to you, et cetera, getting that feedback from another set of eyes. I think is probably the thing that accelerates you the most, at least at the beginning. Maybe they're a little bit further",
    "start_timestamp_seconds": 690.44,
    "end_timestamp_seconds": 786.44,
    "start_timestamp": "11:30",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=690",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "and you're saying, hey, this is a thing I'm seeing, like this is a sound reasonable to you, et cetera, getting that feedback from another set of eyes. I think is probably the thing that accelerates you the most, at least at the beginning. Maybe they're a little bit further ahead in their journey than you are, and that helps you. It helps them too, right? I'm at this point pretty old, and yet I still get a ton out of talking to more junior people because it forces me to go back and think about fairly basic things from first principles. Why is this true? I know some fact is true, and they ask me like, but why? I have to sit there and think, why is that? And reconstructing it from first principles is immensely valuable to me in addition, hopefully, to the person who's asking the question. Which is also really cool because you touched on that in your book about some of the mentorship and tutelage you had, like when you first entered into the industry, could you talk about what some of that was like? What are some of the things that some of your mentors told you? I know a big part you harped on was good decision making, which I'm funny enough, kind of applies to everything. So, could you talk about that a little bit? Yeah, so the thing, I think trading has historically been taught in a very, it will stay",
    "start_timestamp_seconds": 771.8,
    "end_timestamp_seconds": 856.12,
    "start_timestamp": "12:51",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=771",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "mentors told you? I know a big part you harped on was good decision making, which I'm funny enough, kind of applies to everything. So, could you talk about that a little bit? Yeah, so the thing, I think trading has historically been taught in a very, it will stay soocratic way, where the person who's kind of senior is asking you questions, and hopefully there are good questions in order to make you think and understand things just through your own attempt at finding the answers. So, I think that definitely works. I think the best firms that I know of have done that and maybe put it on steroids by creating like extremely good training programs that kind of take you through the basics in a very structured way that is very useful. It's not a replacement for the other thing, but it's certainly an excellent, I would say. So, yeah, I think a lot of it is just what decisions did you make and why did you make them? And sometimes these decisions are very easy and mechanical and sometimes they're more subtle and like, and they all matter, right? Could you give an example of something that you would consider a good decision versus a bad decision? Obviously, super vague, so it can be about whatever topic you want to talk about. Let's just say that let's say that you have some strategy that says that after earnings stocks do something, right? Like momentum is a",
    "start_timestamp_seconds": 835.24,
    "end_timestamp_seconds": 919.96,
    "start_timestamp": "13:55",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=835",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "that you would consider a good decision versus a bad decision? Obviously, super vague, so it can be about whatever topic you want to talk about. Let's just say that let's say that you have some strategy that says that after earnings stocks do something, right? Like momentum is a very common one. Like it's been talked about in academic circles forever. So, this is probably talk about it. So, like I think this stock is going to have some momentum after earnings. And so, based on what you understand about the stock and about the price action. So far, you might say, okay, well, I think I think it's probably probably like a 50 basis point straight to to sell right now and buy it back in two days for something. Let's just say, right? Like I think it makes 50 basis points. And then you say, okay, well, how big do I want to make do this trade? Like that can be a good trade at $10 million and a herandest trade at $100 million. So, I think a lot of a lot of the problems that retail traders get on a much smaller scale, a lot of the problems they get into is because they size too big. I think it's the easily the number one mistake that your average retail active trader makes is just sizing way too big. As a percentage of your trading capital or whatever denominator you want to put on it, I",
    "start_timestamp_seconds": 900.68,
    "end_timestamp_seconds": 984.36,
    "start_timestamp": "15:00",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=900",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "the problems they get into is because they size too big. I think it's the easily the number one mistake that your average retail active trader makes is just sizing way too big. As a percentage of your trading capital or whatever denominator you want to put on it, I think most retail traders would be utterly shocked at how small the bets are that large companies put on as a fraction of the amount of money they have out there to trade with. Like for a really large company, a $100 million bet can literally just be like, I don't know, it's like a percent of whatever. Right? And so what does a percent? That's like a big bet. Right? We'll say like that's a percent of your trading capital or your available risk capital. That's a big bet. So what is a percent of somebody with a $100,000 account look like? Right? Well, that's a $1,000. That's a big bet. Right? I'm not saying that universally true. I'm not saying like one percent is always huge or anything like that. But the times you see people just kind of get in over their heads just because like they're sort of destined to go broke because even if they're trade did have edge, even if they're trade did have edge, your way past like some Kelly fraction or something like that. Like you're just going to go broke with probability one. Now, as you were talking about that, it",
    "start_timestamp_seconds": 965.32,
    "end_timestamp_seconds": 1046.44,
    "start_timestamp": "16:05",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=965",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "sort of destined to go broke because even if they're trade did have edge, even if they're trade did have edge, your way past like some Kelly fraction or something like that. Like you're just going to go broke with probability one. Now, as you were talking about that, it made me think of another concept related to what you're talking about before, which is the idea that retail traders are even starting the problem set from talking about like controlling the remoteions or behaving like a fucking adult. So if you were to think about a trader that has those under control, let's say that they can just behave like a professional. I know shocking concept, but maybe they don't apply some sort of unique unicorn to trading and they just show up and be a professional. And they start trying to figure out these sizing protocols. You mentioned something you know, fractional Kelly, which that's something you and Sinclair talks a lot about, seeming with each other, back in your spoke with. And it's like a good starting point, what are some of the tools that a place like Jane Street or some of these other firms use to determine their sizing? Right. Yeah. So I think we're not getting into too much detail about it. I think you'd certainly develop an intuition over time about like how big certain trades should be. In this sense of like this is a good trade. This is not a good",
    "start_timestamp_seconds": 1030.84,
    "end_timestamp_seconds": 1110.6,
    "start_timestamp": "17:10",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1030",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "to determine their sizing? Right. Yeah. So I think we're not getting into too much detail about it. I think you'd certainly develop an intuition over time about like how big certain trades should be. In this sense of like this is a good trade. This is not a good trade or this is a very good trade. This is a less good trade. Like this is roughly the size that we should be the active in. But there's also just absolute limits, possibly set by internally, possibly set by your prime broker where it's like, listen, I don't care how good you think this trade is. We're just not going to allow you to do to put a position on bigger than, I don't know, 50, 50 million dollars and some random stock, right? So I'm unheaded position in a stock that we're snuck in a little bit. And I think if you don't have a prime broker, then you should probably think about what those absolute limits are for you as well. But I think a lot of the value that having a really good set of people with a lot of experience to discuss this with, and that's kind of what happens at these large firms, is that you can sort of collectively arrive at something that seems reasonable. Doesn't mean that everybody's going to end up agreeing, but probably you're not going to go completely off the rails given that that's how you make this hit",
    "start_timestamp_seconds": 1092.2,
    "end_timestamp_seconds": 1169.0,
    "start_timestamp": "18:12",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1092",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "that's kind of what happens at these large firms, is that you can sort of collectively arrive at something that seems reasonable. Doesn't mean that everybody's going to end up agreeing, but probably you're not going to go completely off the rails given that that's how you make this hit it. In one of the things that really sticks out to me anytime I speak with anybody from the institutional side is it's very clear that there's a lot of structure. There's a lot of different processes and there's a lot of checks and balances, which obviously is a retail trader, you kind of become like all of that wrapped into one. So if you were to think about the primary processes that a retail trader would need to be able to like stand up for themselves to even have a shot at this thing, what are some of those processes? I actually have started to wonder whether there's any good universal answer to this. There's some of the other answers that we've already covered, right? Like there's don't don't size too big, that's one of them. And just all of the standards sort of behavioral biases that people might be subject to, cutting your winters short and chasing, well, I don't know, whatever they are. But I think outside of that, part of what I think I've learned is that different people can operate in pretty different kind of decision-making modes. I have a friend who's extremely, he is",
    "start_timestamp_seconds": 1153.64,
    "end_timestamp_seconds": 1238.44,
    "start_timestamp": "19:13",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1153",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "be subject to, cutting your winters short and chasing, well, I don't know, whatever they are. But I think outside of that, part of what I think I've learned is that different people can operate in pretty different kind of decision-making modes. I have a friend who's extremely, he is an extremely quantitative guy, PhD in operations research, I think, and what he what he does now as a solo retail trader is he'll read the news and he'll think about stuff and he'll sort of say to himself, I wonder what the price of this should be if this is true, and then he'll go look it up and he's like, I don't know, that doesn't look quite right. Okay, I guess that's a trade. I don't think that process would work for me, but it obviously works for him, right? Because it's kind of compatible with how he sort of approaches the whole thing. So yeah, I don't know if there's any kind of universal, I'm not aware of any universal thing other than maybe the sizing stuff. Got it. Yeah, and I think when we talk about this too, you bring in the settlement of like intuition and intuition is tricky because I mean, I come from a military background and we always say like, you know, you might be 25 years old, but you're in a thousand year old institution. Like there's warfare has been around for a long time, you can learn a lot without",
    "start_timestamp_seconds": 1218.2,
    "end_timestamp_seconds": 1307.56,
    "start_timestamp": "20:18",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1218",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "and intuition is tricky because I mean, I come from a military background and we always say like, you know, you might be 25 years old, but you're in a thousand year old institution. Like there's warfare has been around for a long time, you can learn a lot without doing it, but in those kind of institutions that you were in, obviously there's a ton of just institutional sophistication and knowledge that gets distilled around. Yep. What are the like most effective methodologies for that information to be shared? Is it when you both are looking at a screen and just kind of have an occasional conversation, is it through like some sort of structured process? Yeah, so I think it, I think it varies, but certainly and I don't think that this is invented. I know it's not invented at trading companies, in fact, probably the military invented it, which is like we'll say after action reviews or post more, as whatever you want to call them, right? Like these sorts of ideas of like I did a thing and then we're going to sit down and we're going to like evaluate our decision-making process, going into it and what happened and what we missed and what we could have known if, if and what we couldn't have known. Like sometimes things just go bad for you, right? Like nothing you can do about those. So that's definitely pretty powerful. I would even say and this is coming,",
    "start_timestamp_seconds": 1288.04,
    "end_timestamp_seconds": 1364.12,
    "start_timestamp": "21:28",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1288",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "and what happened and what we missed and what we could have known if, if and what we couldn't have known. Like sometimes things just go bad for you, right? Like nothing you can do about those. So that's definitely pretty powerful. I would even say and this is coming, I think, more from the rationalist community, if I am aware of this, is the idea of a pre-mortem. Like if you're going to do a big trade or something, it's kind of like if this goes wrong, how's this going to go wrong, right? I'm sure the military does this too, but it's the idea of like trying to anticipate what could go wrong and sometimes you can find the mitigation for it, sometimes you can't. Obviously, you can't look for monsters under the bed sheets either. So the pre-mortem can't be an exercise and like let's all hold our heads and decide not to do anything, right? But I think these sorts of processes can I think work pretty well, maybe if you're pretty self-aware on your own, we have to kind of discipline about doing it. Now, there's a long-standing problem I haven't been able to solve. So I assume you will have the answer. I am super confident. So in a lot of my conversations funny, you and I right before we started, I was talking about a response that I was making to something online about a labor trader, you know, pending, blowing up. And",
    "start_timestamp_seconds": 1354.6,
    "end_timestamp_seconds": 1439.16,
    "start_timestamp": "22:34",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1354",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "So I assume you will have the answer. I am super confident. So in a lot of my conversations funny, you and I right before we started, I was talking about a response that I was making to something online about a labor trader, you know, pending, blowing up. And I find it to be next to impossible to like explain, especially to again, like newer traders that they're not like too good or a defined small edge. So like you were just talking about momentum. Momentum, momentum has been around forever. So if you wanted to try to build some sort of trading system, not saying you're going to necessarily crush or you could crush it, but at least you're starting with something that's known, well, research and can give you an idea of what it could look like yet. Most of the time, they're more interested in, you know, just jumping into some sort of obscure option structure that they believe provides income or edge. Right. Do you have any tricks in the toolkit or redirecting a wayward trader towards the lights away from the dark? Right. So I think there's a few normal, I'd say like fairly standard wayward paths. I think the most common wayward path is paying for something you shouldn't pay for. Training course, some, like this is going to teach you the riches. This is a real true strategy that will never go wrong for you if you implement it right. If it",
    "start_timestamp_seconds": 1418.52,
    "end_timestamp_seconds": 1518.76,
    "start_timestamp": "23:38",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1418",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "standard wayward paths. I think the most common wayward path is paying for something you shouldn't pay for. Training course, some, like this is going to teach you the riches. This is a real true strategy that will never go wrong for you if you implement it right. If it went wrong for you, well, you must not have implemented it right. Like that kind of thing. I think the best thing that I have for that is what I call the money tree analogy. And so just like close your eyes, imagine that there's a special plot of land, which you don't own. You don't own the land, but you do own a tree on that land. And that tree gives off pure money. Right. That's its fruit. It's just pure money. Fresh Benjamin's, right? And so of course, the tree, like it grows, right. It sucks a lot of the nutrients out from the ground in this special plot of land. You can only grow in this special plot of land, right? So the question is, if you were the owner of that money tree, right? Like you're the person that owns this tree, but not the land on it, would you sell the tree or would you sell it seeds in particular? Because like your customers are just going to plant their seeds right next to your tree and then suck the nutrients out of the ground too, right? So like the analogy, hopefully, is quite clear",
    "start_timestamp_seconds": 1496.12,
    "end_timestamp_seconds": 1577.96,
    "start_timestamp": "24:56",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1496",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "on it, would you sell the tree or would you sell it seeds in particular? Because like your customers are just going to plant their seeds right next to your tree and then suck the nutrients out of the ground too, right? So like the analogy, hopefully, is quite clear if you have a strategy, like there's a gazillion possible strategies out there. If it's a profitable strategy, it's a pretty specific thing. It probably works in a pretty specific way. Like that's the special plot of land. And the strategy is the tree that like just gives off money. Like, would you sell that strategy? Like you just wouldn't, right? Like every single person that starts doing it beside you is now taking money away from you. So as a buyer of these sorts of things, you should be extremely suspicious. You should be very suspicious that this thing actually does make money because if it did, nobody would sell it, right? Like, and people can say, like the sellers can say all that they want, oh, like I'm just in it to help the little guy and blah, blah, blah, blah, blah. It's like, okay, I'm not going to say that's not true, but my priors and the other direction. And you actually talk a little bit about this, like general concept to, I found it interesting in your book about learning more so the process of like good decision making and then being able to apply good",
    "start_timestamp_seconds": 1559.72,
    "end_timestamp_seconds": 1643.4,
    "start_timestamp": "25:59",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1559",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "to say that's not true, but my priors and the other direction. And you actually talk a little bit about this, like general concept to, I found it interesting in your book about learning more so the process of like good decision making and then being able to apply good decision making to different stuff. So it's almost like there's value in starting with just good decision making and then not even necessarily worrying too much about the trading side of it until you feel ready to make that leap. Could you talk through that a little bit more specifically why in laws of trading you focus so much on the decision making process versus the the end of the month of fact or post-series announcement drift or you know these other very specific things. Yeah, so I would say the reason that I focus on it because it's the most general thing that I can think of because the momentum of effect, the momentum effect might come and go. Like the post-series announcement drift, it might come and go. You don't know that those are going to keep working if they still do or if they ever did. You probably did. But the thing that is generalizable if you're a trader is the ability to get to make a decision and the ability to get better because that's what's going to allow you to find the next thing before it appears in a book, before it appears in an",
    "start_timestamp_seconds": 1623.56,
    "end_timestamp_seconds": 1706.36,
    "start_timestamp": "27:03",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1623",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "probably did. But the thing that is generalizable if you're a trader is the ability to get to make a decision and the ability to get better because that's what's going to allow you to find the next thing before it appears in a book, before it appears in an academic paper, all of the best trades are almost by definition things that are not available publicly. That's where the money is. It's in all the weird stuff that you've discovered that nobody else has. And so that's kind of how at least I would hope that people can approach the business, right? The business of trading is being a person who is capable of finding new things, of developing them, and of exploiting them, and then when it's not as good anymore, finding the next thing. That's a thing that just generalizes. I think you talked about this in a recent podcast, if I'm not mistaken, but you were talking about the potential impact of technology AI on starting to consume these smaller spaces that used to be bastions for retail traders getting into the super-Eliquid dirty biotech lactar heroin trading, but markets of thin, especially on the derivative side, real thin. So sometimes there's something there, but you were talking about what that might look like going into the future. Yeah, so I guess it's a question of cost structure, right? Like if you think about an employee at a large profitable trading firm, that employee has to",
    "start_timestamp_seconds": 1694.04,
    "end_timestamp_seconds": 1786.44,
    "start_timestamp": "28:14",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1694",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "side, real thin. So sometimes there's something there, but you were talking about what that might look like going into the future. Yeah, so I guess it's a question of cost structure, right? Like if you think about an employee at a large profitable trading firm, that employee has to bring in a certain amount of trading revenue in order to be worth employee. That person, let's just say that person's median makes like a million dollars a year, right? That's what they make between salary bonus, whatever. So that person has to be bringing in more than a million dollars in order to make that worth it. And so is it worth it for that company to have one trader dedicated to looking at some illiquid pink sheet crap that probably makes on a good year, 100k, right? No, right? There's no value to that company. That, that like it's just sort of beneath the cost floor, right? And so that's an opportunity for a retail person, right? Now, imagine now that the cost to the company of being able to do that, like the cost per head, goes down because this person now has access to better tools, AI, whatever, let's look at a wider range of things and they can maybe aggregate 20 of these 100k little spots, little niches. Okay, well, now it is worth their time to actually go off and do it. So I think that's kind of the story of quant trading in",
    "start_timestamp_seconds": 1766.28,
    "end_timestamp_seconds": 1854.52,
    "start_timestamp": "29:26",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1766",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "AI, whatever, let's look at a wider range of things and they can maybe aggregate 20 of these 100k little spots, little niches. Okay, well, now it is worth their time to actually go off and do it. So I think that's kind of the story of quant trading in many ways is figuring out ways to become more efficient and kind of add a multiplier effect to human time so that more and more niches become worth pushing into. So what would you imagine like the next decade might look like for the trading space? I, so I think a couple of things seem pretty likely. Not necessarily retail trader related directly, but I think there's going to, there is already actually a consolidation in, in terms of the the cost of being able to, the technology cost of of doing trading just keeps going up. You see it most easily in options, I think, where used to be like, you could be a local in Chicago and kind of, you know, e-cout a living just trading options back and forth. Now the technology floors just extremely high and so a lot of the smaller options trading firms in Chicago have been put under pressure, they get bought by bigger places. So there's a consolidation in trading firms, I think, just because the, the, kind of non-recurring expensive doing trader trading just keeps going up. Right? So I think that consolidation is probably going to keep happening. The other",
    "start_timestamp_seconds": 1836.76,
    "end_timestamp_seconds": 1930.68,
    "start_timestamp": "30:36",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1836",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "Chicago have been put under pressure, they get bought by bigger places. So there's a consolidation in trading firms, I think, just because the, the, kind of non-recurring expensive doing trader trading just keeps going up. Right? So I think that consolidation is probably going to keep happening. The other big trend I would say in the last five to 10 years is obviously the rise of just retail traders in general, like there's just a lot more retail trading out there that has been incredibly profitable for trading large trading firms is that going to keep happening or is there going to be kind of a snapback or or something where the average person that's doing this realizes like, no, this is kind of, I'm kind of getting taken to the clean or slowly. And if that happens then I could definitely see some sort of like retrenchment in just the profitability of all these firms for a while. So I don't know, I think that part of it, I think is yet to be figured out. Yeah. The original explosion in retail trading makes sense, COVID stimulus people home. The persistence of it now starts to lead into gamification, accessibility. Yep. You, like, if you were to make an over underbet, do you think it continues to expand from here or do you think it starts to win? Every time I think we're at peak gambization of society, we manage to go even another step further. Like, oh,",
    "start_timestamp_seconds": 1915.0,
    "end_timestamp_seconds": 2007.08,
    "start_timestamp": "31:55",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1915",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "gamification, accessibility. Yep. You, like, if you were to make an over underbet, do you think it continues to expand from here or do you think it starts to win? Every time I think we're at peak gambization of society, we manage to go even another step further. Like, oh, yeah, the CME is going to start listing sports stuff now. Yeah. Right. Like, if if if you had told me that the CME was going to list sports betting even five years ago, let alone let alone 10, I would have taken any amount of action against that, right? There's just never ever ever going to happen. No, it actually just got announced. So I think it's a fool's game to say, like, no, this is it. This is as big as it's going to get. But at the same time, I think I do see some sort of like, it's just a vibe maybe that people are starting to realize, like, you know what, this is just kind of insane at this point. Like, if I can actually make money betting on whether Dilldo's gets thrown on WNDA and BA floors, like, okay, I think this is gone just to hair too far at this point. That's the bet that interests me. Now we're talking. As a participant or just as an interest editor, observer, either or. I mean, I give you can throw them at me. That would be a great bet. I'll zigzag. Well, it's it's",
    "start_timestamp_seconds": 1984.04,
    "end_timestamp_seconds": 2073.32,
    "start_timestamp": "33:04",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=1984",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "just to hair too far at this point. That's the bet that interests me. Now we're talking. As a participant or just as an interest editor, observer, either or. I mean, I give you can throw them at me. That would be a great bet. I'll zigzag. Well, it's it's also an interesting for Ray into the larger prediction markets where, you know, we now have CEOs during earnings calls that at the end of the earnings call, they're like, oh, yeah, wait, before I wrap up, let me rattle off a few words here. Do you think that there's any sort of positive effect from so many things being able to be speculated on? Right. So I think I think in principle, yes, like, it would be good. One of the things that trading teaches you more than anything else and and trading at a trading firm will teach you hopefully very well is that a bet is a tax on bullshit, right? Anytime you are forced to put your money where your mouth is, you start to go like, oh, actually hang on a sec. Me saying words isn't free. Maybe I should actually figure out whether I believe the words I'm saying, right? This is a wonderful, wonderful fact about betting betting in about prediction markets. And we should all be very, very glad that the idea of betting as a tax on bullshit being more well known in the world, this is good thing. This is",
    "start_timestamp_seconds": 2055.32,
    "end_timestamp_seconds": 2149.8,
    "start_timestamp": "34:15",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2055",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "believe the words I'm saying, right? This is a wonderful, wonderful fact about betting betting in about prediction markets. And we should all be very, very glad that the idea of betting as a tax on bullshit being more well known in the world, this is good thing. This is a very good thing. I think to the extent that the the kinds of things that we're paying attention to and betting on are useful and valuable and important, that's got to be good. To the extent that they are trivial and distracting from things that are important, probably not so good, right? Be aware of what it looked at it and you took a decent bet on yourself to like sit down and write a fucking book. That must have been no small task. What led to that? You spent a little while trading at a firm and then you said, I would like some pain in my life. Let me do this instead or what will led you there? It's a pain for no money. Not enough. Yeah. So Eric, just just were to the wise here writing a book, not to the path to riches for most people. I knew that going in, right? Because I knew that I did not want to write a trading book that said, hey, like here's a strategy to do X. I wanted to write the trading book that was more about principles and how you might want to think about",
    "start_timestamp_seconds": 2133.0,
    "end_timestamp_seconds": 2217.64,
    "start_timestamp": "35:33",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2133",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "people. I knew that going in, right? Because I knew that I did not want to write a trading book that said, hey, like here's a strategy to do X. I wanted to write the trading book that was more about principles and how you might want to think about things that didn't have any ways to obvious ways to make money. And so I knew that the audience for a book like that was small, but I didn't care. A lot of the genesis of the book was training material from when I taught either interns or new hires, et cetera. It started off just kind of as a little joke. The first law that I came up with, this was years ago, before I even thought of any book, was the idea that as a trader, you're never happy with the size you did. Because if it was a bad trade, you should have done zero. If it was a good trade, you should have done it bigger. No matter what happens, you're going to be unhappy. I called that the first law of trading. Then I came up with another couple and thought, okay, well, I can actually organize some kind of teaching around these ideas. So then when I left, I thought, well, I don't know, this seems pretty general. It's not really about trading. You see a lot of other things in the world where you look at it from a trader's lens and it's",
    "start_timestamp_seconds": 2206.44,
    "end_timestamp_seconds": 2283.88,
    "start_timestamp": "36:46",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2206",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "actually organize some kind of teaching around these ideas. So then when I left, I thought, well, I don't know, this seems pretty general. It's not really about trading. You see a lot of other things in the world where you look at it from a trader's lens and it's useful and it's productive to look at it that way. I thought, okay, let's give it a shot. And why, why a book versus any other medium, because I know that there's also like that's, I find for myself, like in terms of concentration, like sharing information, I actually prefer video just because you can convey a lot of information very quickly and easily. You can pick up subtle cues, writing is super challenging. You have to be very, very methodical, not just in what you write, but then how the person's going to read it and it's a lot of work. It is, and I think for me, the part of it was that I wanted that challenge. I wanted to try to see if I could actually write a book. I wanted to see if I, there's a joke that everybody has a book in them and for most people that books should just stay there. And I wanted to know if that was the case for me or if it was okay for it to come out, it doesn't maybe part of it. I also think, there's sort of this romantic notion if I'm being fully honest",
    "start_timestamp_seconds": 2267.4,
    "end_timestamp_seconds": 2342.68,
    "start_timestamp": "37:47",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2267",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "most people that books should just stay there. And I wanted to know if that was the case for me or if it was okay for it to come out, it doesn't maybe part of it. I also think, there's sort of this romantic notion if I'm being fully honest with myself, there's this romantic notion about writing a book just like it was done centuries ago. Could I do that? I feel somewhat more permanent in some sense. It's probably not the dollar or time maximizing thing to do. It's fully admit that. Yeah, and it's funny because I actually came across the economics of books from some of the other people on the podcast that have written books. It is one of those things where everybody thinks as soon as you write a book, you are now screwed to MacDoc, you have a lot of old coins to go swim in. But you talked about you talked about a lot of different stuff in your book. Do you have any examples of laws that didn't make the book? That were things that you're like this is kind of good by just as a fit. Yeah, so I think those those laws that didn't make the book either because they were just a little too trade-free and non-tradery enough, not general enough, ended up as big long tweet threads. Probably the tweet thread that I think people refer to back the most, even though I wrote it like, I",
    "start_timestamp_seconds": 2331.0,
    "end_timestamp_seconds": 2418.28,
    "start_timestamp": "38:51",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2331",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "those those laws that didn't make the book either because they were just a little too trade-free and non-tradery enough, not general enough, ended up as big long tweet threads. Probably the tweet thread that I think people refer to back the most, even though I wrote it like, I don't know, maybe four or five years ago now, is this idea that trading is about positioning? You don't get paid for the trades you do, you get paid for the positions you hold. So the idea of like, oh, I'm going to do this trade and I'm going to look for an exit, etc. I'm like, most of the time, I think that's just the wrong way to think about trading. You should be thinking about all the time, what is the correct position for me to be holding right now? Then what is the optimal action that I can take given cost, given risk, etc. to get me closer to that correct position? And so, yeah, the idea of trading not really being about the trade, but about the position, I think is like a really important fundamental concept that I think a lot of people just kind of get wrong. Could you explore that a little bit more? Why do you think they get it wrong? So I think a lot of people talk about like, oh, here's my entry point to my exit point and like, oh, this is like, I should put a stop loss",
    "start_timestamp_seconds": 2397.32,
    "end_timestamp_seconds": 2478.92,
    "start_timestamp": "39:57",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2397",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "of get wrong. Could you explore that a little bit more? Why do you think they get it wrong? So I think a lot of people talk about like, oh, here's my entry point to my exit point and like, oh, this is like, I should put a stop loss here and I should take profit here. I'm not saying those are like obviously wrong and not under all situations, but most of the time, like when should you exit a position when another one is better? Like, there's no like, oh, I should exit like five minutes later, I should exit like when it hits this price. And in particular, what this mindset teaches you is that the world does not care what your entry price was. And so your exit price should like your exit, you know, decision should not be a function of when you put it on, right? Like, maybe this trade was was is like, is profitable and maybe it's unprofitable. But the point is like, if the position now is profitable to hold, then you should hold it. And if it's not, then you should get rid of it. And the amount of money you made is completely irrelevant to that decision. To first order, ignoring costs, ignoring risk, etc. Sure. Let's go first, then. Order stop, right? That opens a fascinating paradox because then there's the part of it in terms of like risk sizing and making sure that you have a position",
    "start_timestamp_seconds": 2460.44,
    "end_timestamp_seconds": 2540.76,
    "start_timestamp": "41:00",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2460",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "you made is completely irrelevant to that decision. To first order, ignoring costs, ignoring risk, etc. Sure. Let's go first, then. Order stop, right? That opens a fascinating paradox because then there's the part of it in terms of like risk sizing and making sure that you have a position that does and end up consuming too much risk. Like you were talking about before, early on, the disposition effect letting losers run. So how do you think about balancing those two? Yeah, exactly. Right? So like I said, this principle of like, no, the world doesn't care what price you entered at. Yes, the world doesn't care, but I'm sure your broker does, right? And so that definitely matters, right? And but again, I think this gets back to bet sizing. Again, because most of the time, that should not be much of a, in most of the decisions you make, that should not be a factor. Right? Like, oh, shit, I have to get out of this position because it's either too big or it's consuming too much margin or whatever. Like, if that, if you get into that spot fairly often, then you're just trading too big. Like, most of the time, you should just be doing very boring trades that don't like enter into like any kind of like big risk calculus. It's just, okay, yeah, I think this position is, I think this stock is now at its fair value. There's no edge to holding",
    "start_timestamp_seconds": 2524.44,
    "end_timestamp_seconds": 2603.24,
    "start_timestamp": "42:04",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2524",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "Like, most of the time, you should just be doing very boring trades that don't like enter into like any kind of like big risk calculus. It's just, okay, yeah, I think this position is, I think this stock is now at its fair value. There's no edge to holding it. It's just risk with no edge. I should probably try to work out of it. That's it. Like, that's what, that's what most of your like trading decisions should look like or they are the opposite, right? Like, oh, I think this stock is undervalued. I should buy some. Throughout a lot of the conversation, and I find this a lot when I think about trading is like, it really is about this balance between kind of these competing forces. It seems like a continual balancing act. What are some of the tools that you learn either, you know, in your institutional career or just throughout your life in general that help you to create that balance? Because it really requires the ability to like switch quickly between different perspectives and then, you know, find a center point. You talked a little bit about, sorry, you just said, yeah, before you talk a little bit about using other people, right, to help with that decision making process. But let's forego that point. Let's pretend that you're alone on an island, I guess, in a computer, what, thanks Elon, Starlink, whatever. Yeah. But yeah. So for me, this is where",
    "start_timestamp_seconds": 2587.64,
    "end_timestamp_seconds": 2662.2,
    "start_timestamp": "43:07",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2587",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "before you talk a little bit about using other people, right, to help with that decision making process. But let's forego that point. Let's pretend that you're alone on an island, I guess, in a computer, what, thanks Elon, Starlink, whatever. Yeah. But yeah. So for me, this is where the fact that I am not a discretionary trader and never have been is probably where I start to become a not very useful resource to answer this question. Because my answer is always going to be like, you did all the work before, right? Like you define the strategy, you defined everything upfront. Like this is what I think the strategy should do. This is what I think it's sizing function should be like this is what I think it's risk-linit should be like, like, that's it. Like now I'm done. Like it's running. Right. It's doing whatever it is it does. And periodically, depending on the strategy, maybe, I don't know, once a week, once a month, once every six months, I should like run this analysis again, like maybe build a new model or or analyze my trading and make sure that like the thing that happened is the thing that the model kind of said should have happened. Like, is it was this an outlier performance when we're another? Like, that's sort of metal-level stuff. Yeah, you should be doing some of that. But sort of day to day, a huge advantage with a systematic approach,",
    "start_timestamp_seconds": 2645.24,
    "end_timestamp_seconds": 2723.48,
    "start_timestamp": "44:05",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2645",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "is the thing that the model kind of said should have happened. Like, is it was this an outlier performance when we're another? Like, that's sort of metal-level stuff. Yeah, you should be doing some of that. But sort of day to day, a huge advantage with a systematic approach, which is all the trading that I've ever done, is that you don't really get into this like, oh, like, what decision should I make now? Like, what should I do? It's just like, I don't know, I already defined it all. It's just it's running. And that's hard in the sense that you have to have a lot of confidence in the work you did upfront, but it's easy because day to day, it's easier day to day, because then you don't have to exhaust yourself with actually making decisions, but then it's hard again because if it's having a bad day, you just have to let that right, like, vote for the most part. It's funny because it's started that you said, you know, it's not necessarily the most useful answer, but the funny thing is is that's actually incredibly useful because if you think about the path, especially of retail, OST them you doing that, right, which is confounding to say, but most of them aren't even thinking about kind of devising the system before they do it. They're just kind of like, oh, I learned iron condors. Let me go, we go sell some of those",
    "start_timestamp_seconds": 2714.92,
    "end_timestamp_seconds": 2786.04,
    "start_timestamp": "45:14",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2714",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "especially of retail, OST them you doing that, right, which is confounding to say, but most of them aren't even thinking about kind of devising the system before they do it. They're just kind of like, oh, I learned iron condors. Let me go, we go sell some of those and make a bunch of money. So here's the thing, just because this is a hobby horse of mine and I'm just going to jump on it. The idea of options strategies as as there's ultimate public is like, batshit crazy. And I'll tell you why. Okay, like, the whole thing about options and options strategies is that this is a linear operation, right? So like, you cannot take two losing trades and some them and turn it into a winning trade, right? So like, if whatever complex strategy you've come up with is a profitable trade, then at least one of those legs has to be profitable. Okay? Maybe all four or five or eight of the legs that you're engaging in are profitable legs of the option strategy, but I bet you they're not. I bet you like, if it's profitable at all, I bet you one of them is profitable and I bet you three of them are losing you money. And so maybe you should think about doing the profitable thing and not do the things that don't lose you money and manage risk a little bit better and you'll probably come out better in the",
    "start_timestamp_seconds": 2769.64,
    "end_timestamp_seconds": 2853.32,
    "start_timestamp": "46:09",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2769",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "them is profitable and I bet you three of them are losing you money. And so maybe you should think about doing the profitable thing and not do the things that don't lose you money and manage risk a little bit better and you'll probably come out better in the end. I think we got to clip that part specifically because I spent a lot of time talking about structure strategy and the multi-leg, omnidrag in that people build. So I really glad you mentioned that. Now talk to me a little bit about the broad process to creating a strategy. And I know there's a lot that goes into that, but if you were to think of like the major muscle movements and how you go about that, what does that look like, at least at the institutional side of stuff? Yeah, so I think it depends a little bit on on what you're good at. And I think it this gets back to the first thing that we talked about, which is like really being self-aware about what is the differential edge that you have in the market or that you might have in the market? And so years ago the way I tried to think about and come up with strategies was something that I actually enjoyed doing a lot of, which is just staring at ticks. Like I would literally just stare at the book like this, like I would stare at it. Now would see",
    "start_timestamp_seconds": 2839.08,
    "end_timestamp_seconds": 2909.72,
    "start_timestamp": "47:19",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2839",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "years ago the way I tried to think about and come up with strategies was something that I actually enjoyed doing a lot of, which is just staring at ticks. Like I would literally just stare at the book like this, like I would stare at it. Now would see like, oh, like that dude like Penny that other dude and then this other guy came down a little bit and then like these were pretty illiquid stocks. We're not talking ESR into you. We're talking stuff where you can actually see it in real time. And then like oh, oh, like five-lock guy, he's back, right? Like oh, where is he in the book? Oh, he's up there. Oh, he's kind of taken up, right? And so this would sort of give you ideas about about like just things you might want to to try. And so then and so then to the batmobile, right? Like and where the batmobile is this like massive trove of data that you have collected for the last 10 years. And all of the tooling that lets you like just really, really quickly study an idea and do it properly and not fool yourself and not have looked ahead bias and all this stuff. And 98% of the time you would do this and be like oh yeah, okay, that doesn't make any money, right? Like it better than just incinerating money by random we fit the coin, but that's not like just",
    "start_timestamp_seconds": 2897.16,
    "end_timestamp_seconds": 2969.64,
    "start_timestamp": "48:17",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2897",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "yourself and not have looked ahead bias and all this stuff. And 98% of the time you would do this and be like oh yeah, okay, that doesn't make any money, right? Like it better than just incinerating money by random we fit the coin, but that's not like just not helping anyone, right? Everyone's in a wild. You will come up, come up with something where it's like oh, actually I think there's like I think there's something here, but I think it's a little piece of a larger pattern. And then you so I used to do that a lot, right? Like I used to really stare at text a lot and and I got a lot of ideas only a tiny fraction of which we're good, out of doing that. I think now the company I'm at now, that is very much not the approach. The approach is very much a all in-depth on machine learning where there's no like human's staring at ticks. It's it's much more meta-level like how can we construct the machine that figures it out on its own. And so I certainly had to adapt kind of how I think about things a little bit in this sort of new world, but it's it's just as fun. Yeah, talk to me a little bit about the the new project. I know that you can't go super far in a detail, but that is a completely different way of thinking. So how have",
    "start_timestamp_seconds": 2951.72,
    "end_timestamp_seconds": 3024.04,
    "start_timestamp": "49:11",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=2951",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "a little bit in this sort of new world, but it's it's just as fun. Yeah, talk to me a little bit about the the new project. I know that you can't go super far in a detail, but that is a completely different way of thinking. So how have you melded with that so far? Yeah, so the company it's a small trading start-up here in Prague, which is where I live now. And it was founded by a bunch of X-D-Mind scientists. Like they were they were the ones who built the first poker agents that could beat humans. And then they unified it with the deep my day-gen's that were the best at chess and like these sort of had this sort of game playing reinforcement learning background and they thought, okay well let's try trading. Now there's like a long history of academics and other people saying, oh just apply my cool technique to trading and that often doesn't go well. But I think these guys are obviously I thought obviously that these guys really had something and the reason I say that is because I would say in traditional quant we'll say machine learning style quant trading you have this idea of a big huge system that produces a fair value. Like what is the thing that I think that I'm trading worth right? And then you have another system that's like a bunch of human juristics that say like how do I turn that",
    "start_timestamp_seconds": 3007.64,
    "end_timestamp_seconds": 3089.16,
    "start_timestamp": "50:07",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3007",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "quant trading you have this idea of a big huge system that produces a fair value. Like what is the thing that I think that I'm trading worth right? And then you have another system that's like a bunch of human juristics that say like how do I turn that fair value into a set of trades that I should do in order to exploit that knowledge right? I guess the idea of the company is using reinforcement learning we can just learn all of that end to end. So like data comes in decision making agent comes out and it's up to us to sort of figure out the algorithms that make the training algorithms that make that make money and not lose money. The fascinating part of that is it almost reminds me of spoofing actually where there's probably a lot of other people doing this and so the information works by asked I asked these guys it's like how do you know that this agent that you're training isn't going to do some illegal shit? Yeah, they're really good. Absolutely, like you hit the nail on head right when you part of the reason the huge part of the reason that the quant trading has been divided into this like figure out a fair value and then have a bunch of jurists have turned it into trades is that humans can look at these juristics and say like that thing is doing something it shouldn't right when",
    "start_timestamp_seconds": 3071.72,
    "end_timestamp_seconds": 3150.04,
    "start_timestamp": "51:11",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3071",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "of the reason that the quant trading has been divided into this like figure out a fair value and then have a bunch of jurists have turned it into trades is that humans can look at these juristics and say like that thing is doing something it shouldn't right when you sort of handed over to the machine and the machine maybe discovers like a way to second like if I put out a huge bid here and a tiny off you know like you could totally figure that out right it probably would and so part of the challenge for us is making sure that the machine absolutely does not do that and we have some approaches to that to sort of cracking that but yeah like that is an absolutely a huge concern with systems like this. In how do you think about the concern maybe your guys this machine and model is doing what it's supposed to but what about everybody else that might be doing this and whether or not they play by the same rule? Yeah so I guess I'm not super concerned about what other people are doing if our agent makes money like if our agent's making money and we know that we're not doing anything even remotely close to illegal and doing so then then all all is good and believe me like regulators and brokers etc all have an incredibly large interest in making sure that you're not doing anything stupid",
    "start_timestamp_seconds": 3138.2,
    "end_timestamp_seconds": 3214.12,
    "start_timestamp": "52:18",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3138",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "if our agent's making money and we know that we're not doing anything even remotely close to illegal and doing so then then all all is good and believe me like regulators and brokers etc all have an incredibly large interest in making sure that you're not doing anything stupid and if you're in this game for the long haul you have a very big interest in not doing anything stupid. So I'm actually not super concerned about that I think the interesting question and there's been there have been cases in the past where a very very very sensible strategy from your like human rules I'm saying a very sensible strategy from your bot or your machine in or axe in a weird way with a very sensible strategy from another guy and the sort of the emergent behavior is supposed to look really really bad so like let me give you a classic example if you have time so I think it's yeah please instruct it so let's say that your your your machine is a market maker in a very illiquid very wide stock right and so if it's very illiquid and very wide like probably you want to be like the best bid right let's just say like you want like this is the good side the bid side is the good side right so like whoever's got a bit out there you just penny them right but the thing is like your your opponent the",
    "start_timestamp_seconds": 3197.32,
    "end_timestamp_seconds": 3270.44,
    "start_timestamp": "53:17",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3197",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "want to be like the best bid right let's just say like you want like this is the good side the bid side is the good side right so like whoever's got a bit out there you just penny them right but the thing is like your your opponent the other market maker has the same strategy and so then like he pennies you and then you penny them and then he pennies you and so you do this like what we just call it the penny war we like where they just kind of like you see it in the market data like do do do do do do do do and then one of them says oh wait a second this is way too much I'm canceling and then the other guy sees oh there's nobody behind me I can go back down to here and so you see this like sought to of pennying in these little quick stocks regulators hate seeing that it looks horrible it just looks like manipulation it looks like every bad thing you could imagine even though both agents are doing very very sensible things and so you obviously have to like write in some logic to detect like whether your machine is in a penny war so that it like learns not to get into a penny war just part of the game and I have to imagine like those kinds of problems just cascade and to like that's a simple",
    "start_timestamp_seconds": 3259.88,
    "end_timestamp_seconds": 3325.16,
    "start_timestamp": "54:19",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3259",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "write in some logic to detect like whether your machine is in a penny war so that it like learns not to get into a penny war just part of the game and I have to imagine like those kinds of problems just cascade and to like that's a simple example right so it's just got to become that this massively huge problem set to deal with so when you're approaching problems there do you find that it's kind of like you're working on a specific piece with the broader context in mind like how do you even start that process? Yeah I mean I think it you sort of go up and down the abstractions pretty frequently right like sometimes you're you're really really in the weeds like like what's our latency to this like what how can we make this like you know microcyte and faster whatever like it's a tiny tiny problem you're super focused on and then sometimes you zoom all the way out to like well what should we be trading in six months or or 12 months or or 18 months like where you know what's the next thing to attack like and and just everything up and down the scale um I think the way we approach it is in a very collaborative way like we we definitely think of ourselves as trying to construct a shared mental model of what we're doing and what's important and what and like what's going on",
    "start_timestamp_seconds": 3313.24,
    "end_timestamp_seconds": 3391.4,
    "start_timestamp": "55:13",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3313",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "just everything up and down the scale um I think the way we approach it is in a very collaborative way like we we definitely think of ourselves as trying to construct a shared mental model of what we're doing and what's important and what and like what's going on so that people can sort of self-organize and kind of divide the work naturally that way instead of having a bunch of managers and stuff yeah yeah and obviously you feel like you guys have to have some sort of competitive advantage against all of the other firms that you're talking about what like obviously can't go super far into detail but what's the essence of that yeah so I would say to be clear we have a lot of disadvantages being a small company like we're definitely less you know well funded than than the big boys um but I think one of our advantages is that we can move very very quickly like we we're very small and if we can keep velocity high then we can adapt not necessarily to market conditions or anything like that but we can sort of adapt what we're doing hopefully quicker than others I think that's maybe one thing um and the other thing is we believe this idea of like end to end training of an agent is is the way of the future but the problem is it's what I call the codac problem for a lot of existing",
    "start_timestamp_seconds": 3378.52,
    "end_timestamp_seconds": 3457.56,
    "start_timestamp": "56:18",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3378",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "than others I think that's maybe one thing um and the other thing is we believe this idea of like end to end training of an agent is is the way of the future but the problem is it's what I call the codac problem for a lot of existing very profitable companies where like you can't really kill the golden goose on your way to try to do this new thing and so we're organized from day one to do it this way right if that bed is correct then we should be able to move faster than others and get there before others if that bed is wrong then like we go out of business and we lose everything so it's like it's fine right but that's that's the startup right right no it it makes a ton of sense because it's like a more sophisticated higher capitalized version of a retail trader but not quite the same size as institutions because that's one of the benefits of the very few that retail traders have is you could be completely long and then immediately flip completely short and just a couple seconds with consulting nobody so there is a little bit of advantage to speed there so it makes complete sense that you guys are like to exploit that funny enough that's generally the Marine Corps philosophy is speed so yeah I think that that resonates really well I had just a couple more questions for you the",
    "start_timestamp_seconds": 3443.48,
    "end_timestamp_seconds": 3521.88,
    "start_timestamp": "57:23",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3443",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "a little bit of advantage to speed there so it makes complete sense that you guys are like to exploit that funny enough that's generally the Marine Corps philosophy is speed so yeah I think that that resonates really well I had just a couple more questions for you the first one specifically is when you think about the book that you wrote I've never written a book so I've never had the experience but I'm guessing you might be an experience where you look back at it and there's something in there you're like a fucking nail that and then there's something that you're probably like I wish I did that slightly different yeah is that true and if so could you share with those are yeah so I would say I think the chapter on edge I think I really like I think it holds up I think the yeah so it's interesting like when you're at an institution like you drink the cool aid and I'm that saying that's a bad thing right but you just sort of have a way of looking at the world and ever since I wrote the book I've met so many people and that sort of expanded my notion of what the landscape of profitable trading can look like and so especially when I talk about like in the last chapter like adaptation and when I talk in the first chapter actually about like why are you even doing this why",
    "start_timestamp_seconds": 3502.6,
    "end_timestamp_seconds": 3593.0,
    "start_timestamp": "58:22",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3502",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "people and that sort of expanded my notion of what the landscape of profitable trading can look like and so especially when I talk about like in the last chapter like adaptation and when I talk in the first chapter actually about like why are you even doing this why are you even trading I think there's stuff there that I would I would probably say I am too dogmatic about that I have a perspective that is probably a little bit too narrow relative to what I think is reasonable now. There enough and as expected from any high performance person I've ever met I do it does not miss me that you spent way more time on the negative thing than the positive thing the positive thing was like a sentence so I want to point that out to other people because that's a really common trait that I find with people like we do that the military and obviously people that we're trying to do well right you spend a little more time there which is funny. The other thing I wanted to just probe you on slightly is if you were to speculate on what the world of institutional trading will look like over the next five ten years how is that landscape going to change do you see consolidation do you see more spreading out from I would say this is like your consolidation but consolidate I think the investment banks will continue to get",
    "start_timestamp_seconds": 3575.96,
    "end_timestamp_seconds": 3659.24,
    "start_timestamp": "59:35",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3575",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "world of institutional trading will look like over the next five ten years how is that landscape going to change do you see consolidation do you see more spreading out from I would say this is like your consolidation but consolidate I think the investment banks will continue to get disintermediated like a lot of stuff that that used to go through investment banks doesn't go through investment banks like trading companies are are now like making VC investments that was like unheard of ten years ago right but now they do it all the time right they used to go through some investment bank and some vehicle or something to you know if they even did it at all or maybe it was the owners of the company that did it outside of that vehicle now they do it too so I think like risk capital should probably always for the most part live with the people taking the risk and I think that's just going to continue to be the case and I think as these companies become more successful and larger they're just going to sort of keep eating away at more of what this like these like investment banks that are now public companies like that's not the right structure for this kind of risk taking like public companies are should not be in the business of of doing that sort of stuff and yeah like and banks have become these incredibly boring incredibly regulated institutions",
    "start_timestamp_seconds": 3645.4,
    "end_timestamp_seconds": 3725.24,
    "start_timestamp": "01:00:45",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3645",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "like investment banks that are now public companies like that's not the right structure for this kind of risk taking like public companies are should not be in the business of of doing that sort of stuff and yeah like and banks have become these incredibly boring incredibly regulated institutions that we're nothing happens it's probably actually good for the world so that's definitely a trend that will probably continue I think obviously they're still room to run in terms of middle income countries getting richer and getting more kind of yeah like moving up the scale and they're being people there like like a really a growing middle class that then obviously is thinking about their future and investments there so I think the developing world still has a lot of growth left in it like a lot so I think that's that's going to be great for the world. I love that two last ones seconds last looks like a really good piece of advice that you've got and literally from anywhere that has helped you in the different pursuits that you had and it's broad but you do have a really interesting background right you've balanced between like really different things some same but some different yeah talking about that yeah so I think a thing that I feel like I've learned is and I think I maybe I've said it before on other podcasts but I still definitely believe it is life is long like life",
    "start_timestamp_seconds": 3709.24,
    "end_timestamp_seconds": 3801.4,
    "start_timestamp": "01:01:49",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3709",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "like really different things some same but some different yeah talking about that yeah so I think a thing that I feel like I've learned is and I think I maybe I've said it before on other podcasts but I still definitely believe it is life is long like life isn't short life is long like you have time to to dive into something and get really really really into it and hopefully get really good at it and get become an expert at it and then you can go do something else and get really good at that thing too and it's not and the thing I hope that I've discovered is that the thing you were doing 12 years ago somehow informs the thing you're doing now like it might seem like it's a completely different thing but it all sort of combines it all helps and so this idea Chris I've done this he who's a friend he said he sort of he put the finger on it he said oh yeah you're just doing serial PhD after serial PhD it's just you're not doing it in a university and that's actually fairly accurate like my my number appears to be roughly six years like I seem to do like I seem to make a big change every six years or so so I don't know but seems like a pretty good way to go I think it's huge and I actually resonate with that quite heavily",
    "start_timestamp_seconds": 3783.08,
    "end_timestamp_seconds": 3867.32,
    "start_timestamp": "01:03:03",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3783",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "number appears to be roughly six years like I seem to do like I seem to make a big change every six years or so so I don't know but seems like a pretty good way to go I think it's huge and I actually resonate with that quite heavily from like bouncing between things looking for new experiences so what do you think is next obviously you're in your current thing and you know that will sustain for however along but what else interests you yeah look I mean if this if this goes well I'll definitely be here for for a few years um I think there's just a lot of this could be a really big company this could be really something interesting but after that I don't know I think I I dream of figuring out a way to to help young people start their own companies and and what I mean by that isn't like oh just like right a bunch of angel checks or something like that but I think one of the things that I'm reasonably good at is is like town identification and that sort of thing I would like to figure out how to like put together little groups of like three or four like young super smart knowledgeable people and just kind of like kind of given the kick and interaction and maybe some money and it's like okay now like go like this is your thing and like find",
    "start_timestamp_seconds": 3854.12,
    "end_timestamp_seconds": 3931.08,
    "start_timestamp": "01:04:14",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3854",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "out how to like put together little groups of like three or four like young super smart knowledgeable people and just kind of like kind of given the kick and interaction and maybe some money and it's like okay now like go like this is your thing and like find the next group of three or four people that like would work together well as a team and then like they go off and do their thing I think that might be like a good semi retirement thing to to do for a while what a cool project too because you'd learn a lot about a ton of different stuff which is absolutely awesome exactly yeah so we covered actually quite a lot and first I genuinely want to thank you because you're also want to completely different times zone so I know that the timing is a little tricky but first thank you so much for coming to hang out I do have on my notes that we kind of missed the fast easy money part maybe we circle back to that we we get that in the few we just forgot about it obviously it's there but it's just wasn't here yeah on that's something to think you know one of the one of the most important things for me you know might sometimes I come off as like irascible and and like ill tempered on Twitter it's not really my intent it's just that it really really",
    "start_timestamp_seconds": 3919.88,
    "end_timestamp_seconds": 3985.96,
    "start_timestamp": "01:05:19",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3919",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "just wasn't here yeah on that's something to think you know one of the one of the most important things for me you know might sometimes I come off as like irascible and and like ill tempered on Twitter it's not really my intent it's just that it really really like deeply deeply offends me when I see like people getting scanned by and like in trading is one of those places where it happens a lot like people just get scanned because they don't like you can't get scanned like from from a language teacher like I'm learning check right now I'm trying to I'm failing at it but I'm trying to like if my language teacher is like bad or isn't doesn't know the language I will find out the second I go to the store and I try to say something like I'll be able to tell right whereas like the person you're buying some trading instruction from like you're probably just not going to be able to tell if it's a scam or not until much later and many many dollars later and that's part of why these scams just kind of keep popping up come again and again and again so it's it's actually funny I mentioned it earlier that I didn't really get into YouTube to like do this stuff but it ended up on kind of becoming a thing funny enough it's it's actually for that exact reason because I grew up relatively",
    "start_timestamp_seconds": 3973.88,
    "end_timestamp_seconds": 4059.24,
    "start_timestamp": "01:06:13",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=3973",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "again and again and again so it's it's actually funny I mentioned it earlier that I didn't really get into YouTube to like do this stuff but it ended up on kind of becoming a thing funny enough it's it's actually for that exact reason because I grew up relatively poor and the thing that gets me the most is that the people that are getting scams are the ones that don't have the money to get scanned so you're literally they're literally playing on people's like literal dreams and taking a fucking money which drives me crazy so I actually love the personality fuck those guys so I say the more you could do it keep up the fight for folks that want to get a hold of you you're on X so I can obviously throw a link to your profile in the notes is there anywhere else that you want to direct people to your book I'll throw a link to that yeah boss of trading I think yeah I mean my DMs are open at least I think they are so you know happy to the people want to ask questions or want to talk or whatever I'm usually pretty accessible for what you ask for but okay you've heard it here first you could show up to his house and talk trading so on that and I'm just kidding absolutely awesome hanging out man definitely look forward to catching up I hope you enjoy the",
    "start_timestamp_seconds": 4039.16,
    "end_timestamp_seconds": 4115.88,
    "start_timestamp": "01:07:19",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=4039",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 4125.0
  },
  {
    "video_id": "Wxndr3Ady24",
    "title": "Agustin Lebron: Ex-Jane Street Trader on Why You Should Trade | the Outlier Podcast",
    "text": "whatever I'm usually pretty accessible for what you ask for but okay you've heard it here first you could show up to his house and talk trading so on that and I'm just kidding absolutely awesome hanging out man definitely look forward to catching up I hope you enjoy the rest of your weekend and thanks for sharing some of your knowledge and time all right thanks all right really enjoyed it be guys",
    "start_timestamp_seconds": 4099.88,
    "end_timestamp_seconds": 4119.8,
    "start_timestamp": "01:08:19",
    "video_url": "https://www.youtube.com/watch?v=Wxndr3Ady24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=Wxndr3Ady24&t=4099",
    "chunk_index": 63,
    "word_count": 74,
    "upload_date": null,
    "duration": 4125.0
  }
]