[
  {
    "text": "What's up outliers? Quick market update for today was going to do it via a regular video, but I figured might as well open it up to the pro community in case you guys have anything you want me to take a look at. Feel free to throw it in the chat as we move along. But in the beginning, I want to talk about the broad market behavior for today. Talk about some earnings moves. And then I also want to talk about some earnings moves from earlier today. And then also after the close. So let's dive right in. So first things first, looking across the broad markets, we continued a little bit of a recovery today, which is slightly interesting because if you were paying attention to the release of broad economic data, you saw GDP come in quite negative, negative 0.3. It was consensus at 0.3 or has 0.5. So this is one of the first actual declines that we've seen like this since I want to say around 2020 or so. So this means, yeah, so it's first declines since early 2022. I mean, so this is driven primarily from imports ahead of tariffs and that absolutely craters net exports. And funny enough, there's actually a little bit of debate going on with the courts regarding Trump's implementation of the tariffs, which is also worth noting. We'll see how that pans out. It looks like Senate badded it down, but we'll see how that all",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "that absolutely craters net exports. And funny enough, there's actually a little bit of debate going on with the courts regarding Trump's implementation of the tariffs, which is also worth noting. We'll see how that pans out. It looks like Senate badded it down, but we'll see how that all flushes out through the system. Now the market after hours is actually up a little bit. We see Eminis Russell and Nasdaq all up specifically focused, though, within Eminis and Nasdaq Nasdaq leading the group. What's going on here? Well, so far, it looks like some positive post-close earnings. So we'll talk about those in a little bit too, but a couple more economic data points that I think are worth your time. The first one, ADP employment change, quite light. So came in at 62K against the consensus at 115 and forecast of 110. It was about half what it was expected to be. This shows that overall employment is actually starting to slow a little bit. And the reason why this matters is because this is obviously tracking the private sector. So you get a slightly different view of employment unemployment here. And this is growing slower than expected. And there's also the very strong likely impacts of things like automation going forward. And I wonder how this will incorporate all that. By the way, it's not like they're not thinking about that. It's not that big of an impact just yet. Anyways, I'm thinking longer term because",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "expected. And there's also the very strong likely impacts of things like automation going forward. And I wonder how this will incorporate all that. By the way, it's not like they're not thinking about that. It's not that big of an impact just yet. Anyways, I'm thinking longer term because it's very likely to see this metric guy down on average in the longer run due to the net probably contraction impact of artificial intelligence integration into different workflows because it will definitely lead to some job hiring. But I think it will lead to broader unwinding realistically. Now, if we take a look at personal income, this came in a little bit better. So the consumer looks to be in a fairly okay spot here. It came in at 0.5. And you can see compared to what it was essentially year over year-ish, quite a bit, quite a bit different. I think now when we look at this metric more broadly, it's a early warning system when it comes to how the consumer is positioned. So to see income being a little more resilient, however, spending also ticked up a little bit. So we have to see how this flushes out. Overall, I think the main headline on the day is GDP. This is obviously our first look at GDP. And I mean, you can just take a look, right? Like absolute massive, massive change compared to effectively what you've seen since 2022, early 2022 I should add. We",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "flushes out. Overall, I think the main headline on the day is GDP. This is obviously our first look at GDP. And I mean, you can just take a look, right? Like absolute massive, massive change compared to effectively what you've seen since 2022, early 2022 I should add. We have to zoom it out a little bit further to actually see the full effect. So that's the broad economy, not a lot highlight beyond this. Now, tomorrow, Thursday, you have manufacturing, PMI, and then jobless claims. So now let's take a look at some of the bigger stories so-called on the day we'll click in and see just what we recap from bar chart before we take a look at a couple other things if anything jumps out to us here. We get economic news. We know this, stagnation risks, increased undercut stocks after Wednesday's reports. We already know about the GDP move, corporate earnings, Wednesday mixed. I think mixed is, I think that's selling it a little short. I guess super micro did kind of collapse. So I guess, okay, fine. And Norwegian cruise lines, they also collapse 7. This is actually interesting because Norwegian cruise lines, this might be, let's take a look. This might be reasonable for a fade. So let's take a look at these guys. NCLH. What was it expected at? Be it a little bit, it was expected to come in at two cents. So this is all on the forecast then. The",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "might be, let's take a look. This might be reasonable for a fade. So let's take a look at these guys. NCLH. What was it expected at? Be it a little bit, it was expected to come in at two cents. So this is all on the forecast then. The fact that it's down, gap down like this, it is definitely way more to do with forecast than anything. Let's take a look. Inplied volatility percentile still 72. Big, big, big, vol contraction on the day though relative. This is 1.7 standard deviation down move for vol. And that yesterday was a 1.1 standard deviation down move on vol. So vol is contracting. That's 30 day vol, by the way. And let's take a look at NCLH. Just take a look at the options chain really quick. A little bit of put skew. A lot of activity today on the put side coming in at the offer. So those were being bought. And then also calls being bought though, majority. So I don't necessarily see the market leaning super heavy one way or the other. Has like a quick overview of it. If we take a peek at the broader movement today. Let's see. All I'm doing is I'm seeing if there's a potential post earnings announcement trip to the downside. It doesn't technically qualify. But sometimes in the near term, there can be reasonable continuation to the downside. So like this, I actually don't love for a downside play.",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "movement today. Let's see. All I'm doing is I'm seeing if there's a potential post earnings announcement trip to the downside. It doesn't technically qualify. But sometimes in the near term, there can be reasonable continuation to the downside. So like this, I actually don't love for a downside play. The fact that you see call premiums and the day slightly positive means that we're starting we being the broader market starting to bake in potentially a floor, not expecting like a massive velocity continuation to the downside. So nothing there that leads me to think that there's a some sort of great opportunity there. We could then expect to manufacture activity China negative for global growth prospects after once they knew show China's April manufacturing PMI fell. Well, there's a lot of turmoil going on between the US and China from a manufacturing import export dynamic. So this doesn't surprise me. Mortgage applications collapsed actually quite a lot. They came down 4.2. And the housing market hasn't been quite as topical yet. But there's a good chance that we'll see the housing market become a little more integrated into the broader conversation, especially as the broader market seems to be holding okay. We start looking at other potential leading indicators like movement into housing market and stuff like that. So going back to the broad market though, if we take a look at the primary indices, you will notice that most of them are pretty happy after hours. But",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "be holding okay. We start looking at other potential leading indicators like movement into housing market and stuff like that. So going back to the broad market though, if we take a look at the primary indices, you will notice that most of them are pretty happy after hours. But take a look at the overall movement here both in spy and QQQ. Both of them are hovering off. And neither one of them are really decisively breaking above these term highs that you have to take out to resume this broader uptrend. Now it's still early right because we're still posting higher lows higher term lows. So that's a good thing. It's a sign of consolidation. But this isn't anything that's knocking my socks off in terms of yeah, this looks like velocity. This still looks like a very edgy market. And you can see that confirmed by volatility still hovering in the mid 20s. This typically doesn't happen if the market is rallying decisively. You normally will see vicks falling off a little bit more. But it's not. And it's because pretty much anything that's going on right now is about the exact opposite from decisive that I could think about. So if we take a look though after hours, some of the drivers, I was just looking at meta, you can see meta actually had pretty solid earnings. They're trading right now at 578, 579 closed at 549 right on the nose, which is super rare, kind",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "could think about. So if we take a look though after hours, some of the drivers, I was just looking at meta, you can see meta actually had pretty solid earnings. They're trading right now at 578, 579 closed at 549 right on the nose, which is super rare, kind of fun to see. And they came in at 643 expected at 521. So I mean, that's a pretty massive beat. So right now if we just eyeball where this is set to open, if it continues this into tomorrow, it'll be somewhere around here. So pretty significant up move now the game is to see how it reacts after the open to see if that move is sustained or to see if that move starts weakening off. Because again, this is also still very much so in a broad decline, right? So if we look at just this general trend line from where we sit today compared to prior highs, this is absolutely still in this broader downtrend. So that's one name that seems to be doing pretty well after hours. And then another that's my eye was Microsoft. So Microsoft also had really solid earnings. They came in at 346. They were estimated at 320. And after hours right now they're trading at 422 after closing at 395. So 422 literally puts them up here. The big move if this is held tomorrow. So these are really big companies. The propensity for post earnings announcement drift and stuff",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "at 346. They were estimated at 320. And after hours right now they're trading at 422 after closing at 395. So 422 literally puts them up here. The big move if this is held tomorrow. So these are really big companies. The propensity for post earnings announcement drift and stuff like that a little bit up in the air. But nonetheless something worth keeping an eye on. Now last couple notes before we just have an open conversation if there's anything that you would like me to take a look at. Last couple notes. One of them is talking about some of our recent earnings plays that were on our hit list. We had three on the hit list for Tuesday PM Wednesday AM. I want to talk about those that came out this morning. The ones they AM group of that. So there was Caterpillar. And this one overall actually was a really solid trade. I'm mentioning this one because I almost chose not to take this trade. And I'll show you why. And it has everything to do with the severity of these prior moves that we see. So you can see that it moved outside the range essentially five times out of the last year or last 12 reports. I should say not last year. And a big difference though is when I'm measuring this I like to wait the near term earnings a little heavier than the really longer term earnings. So the out of the",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "essentially five times out of the last year or last 12 reports. I should say not last year. And a big difference though is when I'm measuring this I like to wait the near term earnings a little heavier than the really longer term earnings. So the out of the last six releases there was two instances and out of the last four releases there was one. So this isn't anything I would consider like a prime candidate like we've talked about in some other names. But this one stayed with this stayed inside its expected range. WDC is one that did not stay within the expected range. This was tracking in implied move about 7.2. And if we take a look at WDC, they came in at 7.98. So about eight. So this was a small loss on the short strangle. Not bad. And the reason why it's not bad is because Vols still had a pretty good sympathetic move here. But in the front expiration, I should clarify, longer term Vol actually expanded a little bit, which is a little bit telling, believe it or not. And then a net new add to the list that I typically do not trade is IP. And this one actually looked completely fine. So it moved down 4.09. Again, this is at the close. This also isn't at the open or midday, which is worth noting because even something like WDC, it didn't do too bad because I didn't wait until",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "do not trade is IP. And this one actually looked completely fine. So it moved down 4.09. Again, this is at the close. This also isn't at the open or midday, which is worth noting because even something like WDC, it didn't do too bad because I didn't wait until the end of the day to close it. But this was an expected move in this one of 8.1. So about half the expected move, plenty of edge in this trade. And yeah. So now we have our earnings list to take a look at for entries tomorrow, all of the Wednesday PM Tuesday trades, Tuesday AM are already on. So the last group of trades to take a look at are all of the Tuesday PM or Thursday PM trades flash Friday AM. I normally don't like to trade Friday PM, although you you generally will see a couple of them. They're just not my favorite. So this will be the last group of stuff really for this earnings week. So for Tuesday PM, we eyeball this quick. We see Apple. I don't know why I keep saying Tuesday PM. It's Thursday PM. So regardless, that my brain apparently can't grasp that fact, believe. So Apple, AIG, AM Gen, Amazon, BB AI. I'm just eyeballing the names that I generally have a relationship that I might trade. And then I'll go back through if I need to. LUMN will take a look at probably not though MNST almost assuredly",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "can't grasp that fact, believe. So Apple, AIG, AM Gen, Amazon, BB AI. I'm just eyeballing the names that I generally have a relationship that I might trade. And then I'll go back through if I need to. LUMN will take a look at probably not though MNST almost assuredly not, but we'll look at it, reddit. That's actually one I'm very eager to take a look at riots for sure. We'll look at Roku, sure. TWLO will look at X. We will look at and let's take a look at Friday AM. I see the CVX, DD, XOM, maybe they haven't been as attractive to me. So we'll see if we'll see. But this gives us a pretty good list to start with. So we'll just run through those. I'll run through those later and then I'll share an output with you all on how these end up looking. But that's the broad list that I'm looking at. Last couple notes I think worth mentioning. So I was eyeballing a potential move from SSO into Upro for the coverage triangle. Not done yet. But I am starting to eyeball making that switch not for a long term change, but for a shorter term change. And the main reason for that is because with the size of the down move, I've positioned myself in SSO in an okay place. But I still expect potential for broader market down move. So by moving from SSO into Upro, I essentially can maintain",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "for a shorter term change. And the main reason for that is because with the size of the down move, I've positioned myself in SSO in an okay place. But I still expect potential for broader market down move. So by moving from SSO into Upro, I essentially can maintain the same position that I have on now using a little bit less money, which gives me greater scaling capability. So it's kind of like what's going on in T-Triple Q's. It's not time to do it just yet, but it is something that I'm taking a look at. So that's mostly what we have going on. We're mostly going to be looking at earnings tomorrow and to see if there's any other random ideas that pop up. So if there's anything that you'd like to take a look at, feel free to let me know. And then in the meantime, I'm just going to run a run through a couple scans that I get to see if anything looks interesting. So this one is consecutive down days. We looked at this recently and something I like to do here is just see if there's continuation potential for some of these names. So I'm kind of just popping through like this one right here. So this kind of drift post earnings, although not a ton of move is actually tradable. And this 173 expected and a miss at 136 is actually advantageous. Or not necessarily some sort of big giant",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "these names. So I'm kind of just popping through like this one right here. So this kind of drift post earnings, although not a ton of move is actually tradable. And this 173 expected and a miss at 136 is actually advantageous. Or not necessarily some sort of big giant downside move, but generally for short calls, the downside to this is if you take a look at the open interest, there's effectively nothing. There's very little to do here. 2,000 calls against 1,000 puts 56 contracts traded today. So this trade so thin that I mean, if you had a small account and you were tinkering with like single lots, maybe, but really nothing to do there. Let's take a look at consecutive updates because there are a few team us is on our list. And this is following a post earnings gap down on a B. That's real curious. So this is a leave it alone kind of name. I mean, it's had consecutive updates. It was great and all for it. But this continues to be the freaking gold mine. The most unassuming name on planet earth that continues to perform pretty well is Kroger, man, like Kroger throughout this entire thing. Look at it. Kroger don't care about not tariffs. Kroger continues to just reliably expand. So this is one I've been trading. It's so slow. It's so boring. But it's decent from providing a slightly non correlated return source. It's not the most liquid thing.",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "Kroger throughout this entire thing. Look at it. Kroger don't care about not tariffs. Kroger continues to just reliably expand. So this is one I've been trading. It's so slow. It's so boring. But it's decent from providing a slightly non correlated return source. It's not the most liquid thing. But in this name, I'm specifically leaning on selling as compared to buying. And it's just because it really doesn't move that much. Right. So you can even take a look at this reference move from like 69 to 73. It's not a bad move. But it's not much. So because of that, I prefer just using some short options. And it's not it's not uncommon to just rotate in and out of positions in this for me. Let's take a look at just a couple more. I want to look at some of the longer term performances. So here, let's take a look at one year. This is one year performance up. Palantir is picking up steam here. So Palantir is scaling back up to term highs. And it has earnings on the fifth. So we'll have to see how that's panning out. Let's take a look at what the options positioning into earnings looks like. I mean, just massive call ski relative. And 29 of calls came above the offer. 32 of the puts came in. Bit or below. So these are just people building out bullish positions, which is this has been on a tear recently. Right.",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  },
  {
    "text": "the options positioning into earnings looks like. I mean, just massive call ski relative. And 29 of calls came above the offer. 32 of the puts came in. Bit or below. So these are just people building out bullish positions, which is this has been on a tear recently. Right. So if we take a look over what is this from the seventh of April. So essentially the last month. It's a 80 move in a month. So bad. So this continues to be a really high growth name. I'm trading it via long calls. And it's just to get some direct upside exposure, but still not having a ton of capital out to allocate into some other ideas. So that's what I got for you all today. As always, if you need anything, you can let me know. Hit me up in the discord. I'm going to go finish cooking dinner, be an outlier. See you guys later.",
    "metadata": {
      "video_id": "WYfQsFADTfo",
      "title": "GDP, MSFT, META, & Unusual Options Flow - Stock Market Update | Outlier Options Trading Live",
      "url": "https://www.youtube.com/watch?v=WYfQsFADTfo",
      "upload_date": "",
      "duration": 1332.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 16,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WYfQsFADTfo&t=0"
    }
  }
]