[
  {
    "text": "What's up, outliers? Today I got a video for you walking you through the covered strangle option strategy trading in leveraged ETFs while the market is down anywhere from 20 plus in the tickers that I'm trading. So we're going to talk about the positions, the management that I've been doing for the outlier pro members. This will be familiar to you because I provide slightly more periodic updates on this portfolio. But nonetheless, there's some really important learning points that I really want to share with you all. And again, the whole goal behind this is just to give you some ideas on different ways to do things, ways to think about the market and especially the covered strangle strategy. Some of the different ways to trade it especially when things are not going our way like they are right now. So as things sit today, I am trading the covered strangle in a couple tickers. The two for the sake of this video are here. Now this is all part of a model 600,000 portfolio. All I've done is take in my actual portfolio, take a small chunk out of it, split it into the covered strangle in a series of different names. And I'm just using it to show essentially one of my poor strategies, how I use it in different stuff. So what's happening here is in T-Triple Qs, I have a 150,000 allocation to that strategy, and then SSO 275K. And you'll take a look",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=0"
    }
  },
  {
    "text": "a series of different names. And I'm just using it to show essentially one of my poor strategies, how I use it in different stuff. So what's happening here is in T-Triple Qs, I have a 150,000 allocation to that strategy, and then SSO 275K. And you'll take a look at the current utilization for both, which is 75 and 77 respectively. That's how much money I'm using in the positions as they sit today. And we will talk through all of that. A couple key notes that I want to highlight for you specifically. The first one is if we take a look at T-Triple Qs, when I first started this exercise sharing this portfolio segment, and I've really built this portfolio to talk about it with you all as an example, T-Triple Qs was trading at 75. As of the close on Friday, it's trading at 53.86. So that marks it down, negative 28. T-Triple Qs is down quite a lot actually from when this whole thing began. So what I do in these kinds of things is I employ a series of different tactics. And I want to talk to you about those tactics. But first, let's take a look at broadly what's been happening in the market. We know that there's a ton of volatility. A lot of this is wrapped around the different tariffs. The reason why that matters so much is because that effectively means that the short-term price movement of the stock market",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:01:00",
      "start_timestamp_seconds": 60.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=60"
    }
  },
  {
    "text": "take a look at broadly what's been happening in the market. We know that there's a ton of volatility. A lot of this is wrapped around the different tariffs. The reason why that matters so much is because that effectively means that the short-term price movement of the stock market comes and goes as fast as the other. And that's because it's so news-driven. So catalyst-driven that you will get pretty significant price pops and then collapses. Literally, you can see that represented here when VIX straight up went above 60 on the 7th of April. It's a massive relative move on something like the VIX, especially given the broader landscape that we're in. Now, my overall hypothesis here is that we are in no way out of the woods. I think that it's very likely that we continue to see negative pressure stemming from the tariff conversations. I also think that the market favors the downside more broadly, although that there's always upside potential like we're seeing here. I've looked at things like the cop report and whatnot. And we can see that large speculators have not been buying this dip at all. So all of that to be said is my analysis of the market in general at a high level is bearish. I think it's favoring the downside and least until new data comes out. Now, there is a little bit of a near-term turn going on. And you can see that in SSO, which is a",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:02:09",
      "start_timestamp_seconds": 129.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=129"
    }
  },
  {
    "text": "said is my analysis of the market in general at a high level is bearish. I think it's favoring the downside and least until new data comes out. Now, there is a little bit of a near-term turn going on. And you can see that in SSO, which is a two times leverage ETF where it's closing above these local highs. So that's good. And it did post a higher local low. So this starts to show the reversal in a trend, but it's super early. And it really would need to do quite a lot in order to actually buck this broader trend that you see going on. So there are some signs of recovery just not much. And T triple Q's is a fairly similar story, not a whole lot different in terms of the broader analysis. This is the three times leverage ETF of NASDAQ. Okay. I want to talk to you about the positions specifically and the management of them because I think there's a couple important lessons here to learn with respect to trading the coverage strangle as markets are going down. So you can see that there's a bunch of different trades on here. I don't want to get bogged down in like a full recount of everything. But what I want to show you specifically is as of 7 April, I ended up unwinding 800 shares with the basis of 64 for 4195. So that represents the 17,880 dollar loss. That's on the",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:03:20",
      "start_timestamp_seconds": 200.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=200"
    }
  },
  {
    "text": "I don't want to get bogged down in like a full recount of everything. But what I want to show you specifically is as of 7 April, I ended up unwinding 800 shares with the basis of 64 for 4195. So that represents the 17,880 dollar loss. That's on the seventh of April. Now you might be asking Eric, why would you do that? You're trading the coverage strangle, which a big part is holding inventory and waiting for a recovery, which is absolutely true. But there's a lot we can do in the meantime to get to a profitable position faster, especially if the broader thesis is the market is continuing to rotate down. So if you take a look at 7 April, it's here. And what happened on this day is we literally were in this aggressive down move continuing to the downside. So I took the opportunity to make an adjustment as it was rallying. And this is the adjustment that I made. I essentially track what the total loss was on the book shares. So again, 17,880. And then what I do is I put on an options position here that you can see that effectively covers the cost of the losing trade. So again, 7 April, I closed these book to loss for 17,880. Also on 7 April, I sold in the money options. They were 82 delta puts at the 63. And I collected 21 dollars, which the net credit on that represents 16,800.",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:04:29",
      "start_timestamp_seconds": 269.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=269"
    }
  },
  {
    "text": "covers the cost of the losing trade. So again, 7 April, I closed these book to loss for 17,880. Also on 7 April, I sold in the money options. They were 82 delta puts at the 63. And I collected 21 dollars, which the net credit on that represents 16,800. So that still represents a small loss. I wasn't concerned about that small loss because once I factor in what I've made from the call side of things, it doesn't really matter. So that was the original adjustment made here. And the entire purpose of this, again, was to move out of the equity with the basis of 64 into options, short puts, which now have a mobile basis. And I already reduced the basis from 6430 to 63. It's the first series of a campaign of trades. Then effectively, what I do is continue managing, rolling these options, adding new legs, taking other legs off. That's what this follow on subsequent series of trades is. And you can see really all I'm doing is realizing profits as we're going down where I can and taking trades off. And I'm using the near term market movements along with changes in my trade size in order to try and make more progress on the basis. So if you take a look, we started at these 63s here. And then we were able to add a little bit of size and take it down to the 60s. Now this is a different",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:05:41",
      "start_timestamp_seconds": 341.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=341"
    }
  },
  {
    "text": "my trade size in order to try and make more progress on the basis. So if you take a look, we started at these 63s here. And then we were able to add a little bit of size and take it down to the 60s. Now this is a different trade over here with the 60s. That's another one that I was rolling that's not tied to this one. So the main thing I want to show you here is that by moving out of the underlying, my basis is now mobile. I can move it. I can adjust it. I can move as the market moves, capturing the opportunities as the market rallies to look for slightly better rolling opportunities to then continually manage my basis. So if you take a look at what is existing now, I have everything is out in 20 June. Both of these are part of rolled options. But I was actually able to roll one series of those options actually out of the money now. They were out of 40 delta and it's up to a 10 lot and those took in 533. And then I have a 10 lot at the 60s still. So net net overall, everything included with what's happened. T triple Q's is down 28.2 from where I started this. This again is essentially an unrealized profit or loss. This is making the assumption that we would have bought the entire size at 75 and then just held. So",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:07:04",
      "start_timestamp_seconds": 424.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=424"
    }
  },
  {
    "text": "still. So net net overall, everything included with what's happened. T triple Q's is down 28.2 from where I started this. This again is essentially an unrealized profit or loss. This is making the assumption that we would have bought the entire size at 75 and then just held. So this is an unrealized loss in this case with the basis of 75. And now we have our position which has a realized loss of 14,500 but a net realized total PNL of positive 382. That's essentially if I take either these trades come off at a full profit or I get assigned on these. Then I realized this entire credit of 14 860. And then I would have managed basis here of like mid to high 50s. So it would be close to a scratch given where he triple Q's is today. What I'm showing you is by trading the coverage strangle rather than holding shares and essentially just being down 28. I'm able to do different things. And in this context right now, if these expire out of the money, I will actually be up 0.34 which is really nothing to write home about but given the context and the comparison about what the basis was in the original trade from the jump. This is exactly what makes this such an effective strategy even during down markets. You have to have a really firm plan. It's essentially the same campaign I'm running in SSO at a slightly different",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:08:18",
      "start_timestamp_seconds": 498.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=498"
    }
  },
  {
    "text": "and the comparison about what the basis was in the original trade from the jump. This is exactly what makes this such an effective strategy even during down markets. You have to have a really firm plan. It's essentially the same campaign I'm running in SSO at a slightly different scale. But right now, I'm purposely saying you'll notice in all short puts across all the coverage strangles. I bet it's a slightly different story that one I could take on shares if I wanted simply because it's been behaving a little bit differently. That's a whole other video for another day. But specifically for SSO and T triple Q's with my broader market hypothesis, what I want to do is actually continue rolling these and let's say for example, I can get these off for a full profit or near full profit. I'm not going to relay out another 10 lot and consume 75 utilization of the allocation. I actually want to scale this down if I can. But right now, I'm in the process of managing existing trades and again, using what options allow me to do, which is to remain highly adaptable. So as always, if you have any questions, let me know being out there. I'll see you later.",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:09:39",
      "start_timestamp_seconds": 579.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=579"
    }
  },
  {
    "text": "have any questions, let me know being out there. I'll see you later.",
    "metadata": {
      "video_id": "WyzHPgbxb5k",
      "title": "Covered Strangle Option Strategy in TQQQ | Live Trade Update",
      "url": "https://www.youtube.com/watch?v=WyzHPgbxb5k",
      "upload_date": "",
      "duration": 655.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:10:48",
      "start_timestamp_seconds": 648.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=WyzHPgbxb5k&t=648"
    }
  }
]