[
  {
    "text": "What's up, outliers? Quick GameStop video because I didn't talk about it yesterday in the market outlook. So I want to level set on the week as it stands out ahead and just keeping it a buck. I don't see a whole lot. Right now it still seems fairly quiet in here. We had a really interesting GME live stream. We do this every Saturday at 5 p.m. Pacific time. And the last one we took some time digging into a little bit of GameStop's older transaction. And one of the things that we did notice that was kind of interesting is that if we go into the dark pool feed to just see what kind of transactions are happening and different sizes, we filter this by 5,000 shares. Again, this is specifically for shares. I'm going to filter by GameStop. And we can see that there have been a bit of a run of these 5,000 share blocks. And it's been ebbing and flowing. Now one of the curiosities we had during the live stream was, hey, what did this look like before the cat came back in May? So what we did was actually go back and take a look at essentially what transactions took place through this entire period at that block level. And we can see if we go all the way back, we can see a bunch of them in late May. But if we filter this down and we're like, okay, what does it",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "a look at essentially what transactions took place through this entire period at that block level. And we can see if we go all the way back, we can see a bunch of them in late May. But if we filter this down and we're like, okay, what does it look like the very beginning of May? I think he came back on the 12th if I'm not mistaken. So if we take like 1 to 10 May, nothing. And then if we go to April out of curiosity and take a look, nothing. But then if we go 13 to 24, we see them really starting to pick up a little bit later. Right? So if you take a look at 21, 22. So what this tells me is a lot of these transactions actually got kicked off by a lot of the movement that we saw. And I don't necessarily think that the 5,000 block trades mean a whole lot. I know a lot of people are generally assigning that to roaring kiddie is kind of like a calling card sort of thing. But I think it's a little misplaced. And the reason is because we saw him move 5,000 block lots of options. And that's for a very specific reason. 5,000 lots in options is a much bigger position than 5,000 shares. 5,000 shares is actually quite small on a comparative basis. And just in terms of the market liquidity, it's completely different. So I think some",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "move 5,000 block lots of options. And that's for a very specific reason. 5,000 lots in options is a much bigger position than 5,000 shares. 5,000 shares is actually quite small on a comparative basis. And just in terms of the market liquidity, it's completely different. So I think some people are maybe mistakenly associating the 5,000 the 5,000 lot options trades that he was making. And then we see these dark pool trades hitting at 5,000 blocks thinking, oh, maybe it's him. And I get why everybody's curious. I'm curious to nobody's doing. How could you not be? It's literally, this is literally like one of the most interesting stock market stories that I've ever come across my 17 years doing this. It's fascinating. But again, my job I see as a trader is always to try to look at things as objectively as possible. And like nobody really has any sort of ownership over 5,000, especially when it comes to shares. It's a nice round number. And it doesn't really jump out at me as any one single entity. And again, like we can go back through a bunch of different time frames and see that this has been going on primarily since we started seeing the movement in the beginning mid-May and to June. So I thought that was generally interesting going through that exercise this past weekend. We actually didn't finish. We have to go through a part three of analyzing Rory and Kitty's old trades,",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "been going on primarily since we started seeing the movement in the beginning mid-May and to June. So I thought that was generally interesting going through that exercise this past weekend. We actually didn't finish. We have to go through a part three of analyzing Rory and Kitty's old trades, which we're going to do this coming Saturday. I think we're in 2021 now. So we're essentially going literally update by update, understanding what the market looked like, what kind of decisions were being made, what kind of trades were being made, what kind of money was moving in and out of the account. Just to again, dive in because it's absolutely fascinating. And so this I think is a data point to be aware of. But it's nothing that's jumping out at me as like it maybe as big of a deal as we might think it is. So if we take a look at today, we can see that there is a handful of these. If we clear out this 5,000 filter, you'll notice that there are still tons of these trades that are just way larger. So what it tells me is that people that are positioning at 5,000, it's because we explicitly we being the royal we whoever's doing this, they explicitly want 5,000 or 5,200. Right. It's not because they're doing it because of a liquidity thing like what we saw when roaring kitty was buying 5,000 lots of options. That was a liquidity consideration.",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "at 5,000, it's because we explicitly we being the royal we whoever's doing this, they explicitly want 5,000 or 5,200. Right. It's not because they're doing it because of a liquidity thing like what we saw when roaring kitty was buying 5,000 lots of options. That was a liquidity consideration. This not so much. This just looks like what different entities want to scoop at. And again, there's plenty of liquidity. There was a 62,000 share transaction today that cleared on the dark pool 1.26 million right through no problem. So there's that. Now if we do take a look over at GameStop and we take a look at the options activity. And I'm actually going to look over this month so far. And let's filter by just people that are buying calls and see what this looks like. So we saw these transactions come through already. We already kind of have the whole deal on those that these came and went. So if I throw the bid back in, you'll see those drop right off. And beyond these trades, it has been exceedingly quiet. Now the again, my assumption is that these are tied together in some sort of way, meaning, you know, whoever made this series, there's more of them further down. But whoever made this series in the 22 and a half probably did these, we don't have that definitively yet. But that's what it looks like. And if I zoom this in a little bit now",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "way, meaning, you know, whoever made this series, there's more of them further down. But whoever made this series in the 22 and a half probably did these, we don't have that definitively yet. But that's what it looks like. And if I zoom this in a little bit now and just kind of look over the past, you know, week and today, we had the 17 of Jan 2025's. There was a big trade that went through at the 20s over a million dollars, big, big trade. But that was back on the 11th. And this is kind of a longer term exposure. One of the things I'm noticing is for most of these bigger trades, right? So we see 2025, 2025, 2025. Most of these greater than 100,000 premium, which is a bigger trade for sure, they're out into 2025. We're not playing these really aggressive one month, two month, three month front expiration trades. So what that tells me is that there's just a change in positioning compared to what we've seen previously. And if we take a look at the total premiums out there, it's just a little bit lighter, essentially. So if we look at open interest right now, there's 630,000 calls against sub 300,000 puts. That is actually notable call skew in terms of total positions. But this is the difference. If you take a look at these different color bars, you'll see that they're definitely his representation in the 20s. And we typically",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "open interest right now, there's 630,000 calls against sub 300,000 puts. That is actually notable call skew in terms of total positions. But this is the difference. If you take a look at these different color bars, you'll see that they're definitely his representation in the 20s. And we typically run pretty front month heavy, but you'll actually see that in 18 oct, there's quite a lot out in 17 Jan, there's quite a lot. So what I'm noticing is that there's being build out of the next primary expiration. And then this front expiration is actually a little bit lighter than it's been historically. So 167,000 out of the 630, that's relatively light for the front expiration cycle than what I've seen. So there's not necessarily a direct takeaway other than the kind of undercurrent of GameStop from an options perspective is slightly different than when it's been a little bit more active. We can see total volume way more calls traded today, 101,000 versus 22,000 puts. But if you'll notice, 40 of those were at the bid or below. Tell us that those are people selling calls. And I understand why because if we take a look at the GameStop chart, it kind of dropped off after earnings and it's been just trending sideways. And even before this drop, which seems big on the chart, but it's actually not that significant, it's been trending sideways essentially from the first of August, something like that, just a general sideways",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "the GameStop chart, it kind of dropped off after earnings and it's been just trending sideways. And even before this drop, which seems big on the chart, but it's actually not that significant, it's been trending sideways essentially from the first of August, something like that, just a general sideways trend. And so now the name of the game is what's the next catalyst that starts to move things a little bit. My guess is that will be some shred of news, either from Rowan Kitty or if the GameStop leadership starts talking a little bit about their plans with their literal pool of gold coins that they have at their disposal. And if we take a look at the volume volume is starting to slow down. So on earnings on the 11th kind of right after earnings, we see that there is a spike of volume 28.9 million, then it dropped to 9.5, then it dropped to 8, then it dropped to 5.9. So volume is downward sloping in here. So that also tells me just from a general trading perspective, it's getting really quiet. Now what does that mean? I don't know. Volatility has come down a lot. Implied volatility percentile right now is only 38 percent, which volatility is a raw figure is still quite high. It's like 90 percent, but for something like GameStop, that's relatively low. So yeah, bit of a quiet period as far as I see it, the next video on GameStop, I'll",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "Implied volatility percentile right now is only 38 percent, which volatility is a raw figure is still quite high. It's like 90 percent, but for something like GameStop, that's relatively low. So yeah, bit of a quiet period as far as I see it, the next video on GameStop, I'll go a little bit deeper into seeing if there's any interesting positioning and options as I looked through the chains. Nothing was jumping out at me. This 20 set is kind of all over the place. People are still building out kind of the standard fare, but it's just all generally smaller sizes. We're still seeing more activity on the further out of the monies. This continues to be the case anything from these three deltas out to these one deltas. I've talked about that ad nauseam, so I won't beat that drum anymore on why I think for retail traders. That's typically not a great approach. I got to do whatever's right for you, but there's smarter ways to buy options in my opinion and something like GameStop. But that is what it is. So that's what we're sitting for now. Your boys keeping an eye on it. As always, if there's anything I should take a look at, let me know be an outlier and I'll see you all later.",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  },
  {
    "text": "always, if there's anything I should take a look at, let me know be an outlier and I'll see you all later.",
    "metadata": {
      "video_id": "X1Hca7h6eBQ",
      "title": "GameStop Options Analysis",
      "url": "https://www.youtube.com/watch?v=X1Hca7h6eBQ",
      "upload_date": "",
      "duration": 626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 10,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=X1Hca7h6eBQ&t=0"
    }
  }
]