[
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 47,
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you you Then if you take a look at the 28 March, you can see 123 vol. That's actually heavy vol on a comparative basis. Now this is absolutely something I'm going to trade this week on the coverage strangle that I have in GameStop. I'm going to adjust it to trade the earnings vol because it's so heavy. And with the coverage strangle, I'm effectively trading short call, short put, which is a standard earnings play, but in the scenario of the coverage strangle, I really don't care which way it goes. I don't have to worry about taking it down and just realizing the volatility side of the trade. There's another element of the position. So I'm definitely going to trade this vault because it's very high. Now if we take a look at the total positioning, I don't believe that this is correct. 2000 against 3000. I don't think that's right. There we go. That's more correct. 571 against 175. Now let's take a look in the 28 March 41 against 10. So that's roughly roughly four to one, not quite. 21 March is 110 against 30. So still very heavy in the front expiration, very heavy in the front expiration. And I don't",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=0"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 47,
    "text": "That's more correct. 571 against 175. Now let's take a look in the 28 March 41 against 10. So that's roughly roughly four to one, not quite. 21 March is 110 against 30. So still very heavy in the front expiration, very heavy in the front expiration. And I don't see any sort of anomalous heavy call versus put volume or open interest, leaning into earnings compared to everything else. It looks like it's generally just kind of spread across the board here. So that informs me that it doesn't look like there's a bunch of people positioning right now, heavily into the earnings move. That's all. Sometimes you can pick up small cues like that, leading into earnings if something has anomalous put call skew or in terms of open interest or big heavy volume leading into earnings, which typically would start about last week through this week. If people are going to be positioning heavy, you know, with some sort of expectation of a move, but that's not happening right now. So just kind of a standard earnings release. We'll see how it goes. So all that stuff aside, do you guys have any questions on GameStop specifically just the overarching landscape that were in anything like that? And then if not, I'm going to pivot us over into the DD library. So I'll give you guys a second if you have anything that you want to take a look at. I haven't gotten any emails about GameStop",
    "start_timestamp_seconds": 1101.96,
    "start_timestamp": "00:18:21",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1101"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 47,
    "text": "just the overarching landscape that were in anything like that? And then if not, I'm going to pivot us over into the DD library. So I'll give you guys a second if you have anything that you want to take a look at. I haven't gotten any emails about GameStop in a while. So my sense of things is that the longer term GameStop holders are kind of hunkering down here and just continuing to hold. And I think a lot of the more transient people that kind of, you know, get super interested when things are super active. I get the sense that a lot of that is starting to fall off and strip away. The other thing I've been noticing is I used to get a lot of emails with different expectations and different theories around GameStop and, you know, the cycles and all that stuff. And I've all about stopped getting those kinds of emails, which again leads me to believe that a lot of people are starting to see that the theories aren't necessarily playing out. So yeah, just to give you broader context on what I'm seeing from my perspective. Cool. Let's get into the D2 library. We're out where we left off. I know that we did lower. I think we might have done this one, the iceberg order. Yeah, we did this one for sure. So I think we have this one next, which is the Moas preparation guide by Socrates. That's actually",
    "start_timestamp_seconds": 1173.24,
    "start_timestamp": "00:19:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1173"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 47,
    "text": "D2 library. We're out where we left off. I know that we did lower. I think we might have done this one, the iceberg order. Yeah, we did this one for sure. So I think we have this one next, which is the Moas preparation guide by Socrates. That's actually really great. H says on the coverage triangle adjustments, are you taking everything down and shuffling to the closest DTE post earnings? And what are you basing your delta zone? Great question. So what I'm going to do is evaluate what I have out, which I actually don't know. I'll tell you right now. Right now I'm dominantly out in 17 April. So I have some short puts out there that I almost expect to be able to roll them in time, meaning come in and time. So if we take a look at 28 March, I have the 23s and the 21s. The 23s are at the money. And let's see what those are trading for right now. So they're trading for two 15 ice sold them for two. So those are losing 15 cents. So what I might do is just take them down for a 15 cent loss. Take it on the chin, eat it, and then take it into the 28 March and actually reestablish somewhere in here, probably like the 22s. But what I would do is size them up a little bit. So I would move from a five lot to a six lot,",
    "start_timestamp_seconds": 1253.68,
    "start_timestamp": "00:20:53",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1253"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 47,
    "text": "loss. Take it on the chin, eat it, and then take it into the 28 March and actually reestablish somewhere in here, probably like the 22s. But what I would do is size them up a little bit. So I would move from a five lot to a six lot, I think. And then I also have the 21s that are here in 17 April. The 21s are currently trading for a small discount than what I got them for. I sold them for 153. They're trading, call it like 112. So for that one, I'll probably just take those down. I'll take those down for a tiny profit and then I'll scoot them in as well. So I'll use that two lot to size up the 23s that I'm going to take down for, again, like a probably a 15 loss. Then I'll fully establish the short puts in this expiration cycle. And then on the call side of things, I literally just adjusted those. But I have the 17 April the 28s. And those were out for a dollar. So those are already in profit. So I'll take those in as well. Oh, wrong one. I was going to say that seemed way too fast. The 28s. Yeah, so those are trading about break. So what I would do for these is probably after the weekend, a little bit will come out of these. And hopefully with the vol siphoning into the front expiration, a little more vol",
    "start_timestamp_seconds": 1331.16,
    "start_timestamp": "00:22:11",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1331"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 47,
    "text": "to say that seemed way too fast. The 28s. Yeah, so those are trading about break. So what I would do for these is probably after the weekend, a little bit will come out of these. And hopefully with the vol siphoning into the front expiration, a little more vol will come out. So I'd be able to take these down close to a scratch. And then I will move those in as well. So those will come into 28 March. And then I'll probably re-center those on. Guessing like the 26s, the danger with the 26s is my basis right now is 28. So I wouldn't want to get too deep on the basis, especially around earnings, because things can move pretty heavily. But I would feel comfortable with the 26s. I think that that's completely fine. Unburdened croissants says was dexter into coverage triangles. It's funny that you mentioned dexter, because I never really watched the show. I think I watched maybe like one episode, because the idea sounded kind of entertaining. And I just remember the scene where he essentially made a kill room, right? Like you put up all the plastic and stuff to do his thing. And what sticks out to me, unburdened croissant, is I was literally just talking with my mother-in-law. She's an artist. She makes different paintings. I don't really care that much about art, to be honest. But like because it's from my mother-in-law, I just love it. I love her",
    "start_timestamp_seconds": 1411.68,
    "start_timestamp": "00:23:31",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1411"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 47,
    "text": "thing. And what sticks out to me, unburdened croissant, is I was literally just talking with my mother-in-law. She's an artist. She makes different paintings. I don't really care that much about art, to be honest. But like because it's from my mother-in-law, I just love it. I love her skill. Like this, she did this. That's actually of my actual car. You kind of can't see the whole thing. But like she painted that. So everyone's in a while. I'll hit her up and see if I can convince her to do something new. Long story short, she just got new carpet in. And I used that same reference effectively. I was just like, oh, we're going to have to set you up with like a dexter room. So I think it's kind of wild that there's been two dexter references within like three days for a show that's old as fuck. And I don't think anybody watches. So that made me chuckle. And to take a guess at that, I have to think so. Because I think he did like the plastic bag, which is exactly what that is. So yeah, I think you're right. I think you're dead on the money. Dead on the money. H, does that answer your question though with respect to what I'm based on the Delta? Because the Delta is always just based on the kind of risk that I want the position to have. With bringing them in so far, these",
    "start_timestamp_seconds": 1489.64,
    "start_timestamp": "00:24:49",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1489"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 47,
    "text": "dead on the money. Dead on the money. H, does that answer your question though with respect to what I'm based on the Delta? Because the Delta is always just based on the kind of risk that I want the position to have. With bringing them in so far, these options are going to have a ridiculous amount of gamma comparatively. So that means that the Delta is going to change super, super fast. And that's just kind of what is expected for something that moves as heavy as GameStop. But that's also why like I wouldn't trade naked earnings with something like GameStop. And then the normal earnings place to play the volatility contraction is like selling a straddle, selling a strangle. But a big way that you manage risks in those kind of positions is through the sizing of the trade. But unfortunately the sizing itself wouldn't be enough in this kind of trade for me at least. So what I do here is I would either spread off the risk. Or I would force a absolutely the smallest position I could think of. And the reason for that is because through earnings you can have things that really start to bounce around and move a lot. So you can have a really dangerous position kind of like holding a little bit of a hand grenade through through an earnings release. So there's ways to do it responsibly in something like this. If I wanted to trade earnings",
    "start_timestamp_seconds": 1565.92,
    "start_timestamp": "00:26:05",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1565"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 47,
    "text": "really start to bounce around and move a lot. So you can have a really dangerous position kind of like holding a little bit of a hand grenade through through an earnings release. So there's ways to do it responsibly in something like this. If I wanted to trade earnings outright, I would cap the risk. I would buy the wings somewhere. Because the covered strangle it already is a covered position. So it doesn't matter to me. Cool. Let's now take a look at I actually think we might have read this one. Okay, yes. So we read the old one. I remember seeing this one. So they're talking about the Moas preparation guide, which it's good to be prepared. We're talking about what they're going to do having. Yes. So this is all stuff that we've seen. Yeah. I mean, unless there's anything in particular as I flip through this, that's interesting to you guys that you want to look at. There's really nothing to. There's really nothing to highlight. Do you feel bad that? I don't think they had I don't think they got their movie yet. Okay. I remember seeing a little bit about this one a little while ago when we read the original one and it's fine. The thing that I appreciated about it is that it was talking about planning and anybody that knows me and what I do as a trader, like I actually really respect the planning side of things. But",
    "start_timestamp_seconds": 1638.56,
    "start_timestamp": "00:27:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1638"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 47,
    "text": "a little while ago when we read the original one and it's fine. The thing that I appreciated about it is that it was talking about planning and anybody that knows me and what I do as a trader, like I actually really respect the planning side of things. But I mean, a lot of it's just kind of. I don't know. It's hard for me to put a word on it. So yeah. Hey, yo, why not? What up? Age says that does. I'm starting to get my port adjusted to have more short theta against it. And I've enjoyed learning about the thought presses via videos and these streams. That's awesome. Yeah. That's literally one of my primary objectives for showing you all the coverage strangle and literally using my own money and a small allocation for it because for those that don't know what I did is I pulled the community and I said like, what's an average size for game stop holdings for people? And that's how we arrived at using 25,000. So I just took 25k and then I put it into a coverage triangle allocation to trade game stop and to use it as an opportunity to show people like different ways to use that kind of strategy, which I really do think are highly relevant to you. And the reason why I think it's so relevant is I think we have it in here. Are these the latest? 90? Yeah. This is the",
    "start_timestamp_seconds": 1740.72,
    "start_timestamp": "00:29:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1740"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 47,
    "text": "an opportunity to show people like different ways to use that kind of strategy, which I really do think are highly relevant to you. And the reason why I think it's so relevant is I think we have it in here. Are these the latest? 90? Yeah. This is the latest. So the reason why I think it's relevant is because if we take a look at the move in game stop from when I started this exercise, right? I tracked the price from when I started the exercise, which was 2431. And the current price, this is saying is 23 or five. So let's correct. And so that represents a 5 decline, a 5.2 change. If you take a look at the portfolio as it sits, I am literally sitting on an unrealized loss right now. And even though the stock itself is losing 1,300, this is in the open trade that sits, that 1,300 bucks is still being overwhelmed by the rest of the money that's being made from here, here, here, and here. There's 2540 right now in total option premium that's either realized or open, tied to the broader trade. So the reason why this matters is because even though the trade itself is slowly working, it's not doing exactly what we wanted to do just yet, but that's kind of how she goes. With that as the case, the position itself is still profitable for me. Based on the capital that I have in the",
    "start_timestamp_seconds": 1808.64,
    "start_timestamp": "00:30:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1808"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 47,
    "text": "is because even though the trade itself is slowly working, it's not doing exactly what we wanted to do just yet, but that's kind of how she goes. With that as the case, the position itself is still profitable for me. Based on the capital that I have in the trade, it's actually a 7.5, it's up 7.5. While the broader market is down for the underlying, I'm trading a 5.2. That's the whole point of the coverage triangle. The coverage triangle isn't going to look super sexy when the market's going straight up. That's when you have to increase your shares. But with the market doing what it is now, that's why I've pivoted so hard where the stock requirement is so very light and the cash secured put requirement is much heavier. It allows me to do this. And again, this is nothing, nothing crazy. It's nothing to write home about. I'm not like sitting here saying like, wow, this is the coolest stuff on earth. This is what I implore people to remember. This is a sustainable way to use options to amplify in equity position. And again, I know that like the sustainable path isn't necessarily the sexiest path, but it's it's working, right? And it's something to think about because right now, in terms of a realized PNL of 1478, from when I started, I can now buy 1,500 more of GameStop than when I first started. And the person that just bought and held",
    "start_timestamp_seconds": 1897.66,
    "start_timestamp": "00:31:37",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1897"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 13,
    "total_chunks": 47,
    "text": "the sexiest path, but it's it's working, right? And it's something to think about because right now, in terms of a realized PNL of 1478, from when I started, I can now buy 1,500 more of GameStop than when I first started. And the person that just bought and held equity right now, their overall value is down 5. So that's the big difference here. And that's why I think that this is something I hope that you find useful. I don't know if you guys can hear that. There's a helicopter flying over my house. Let's see if I can figure it out. Teach 53. All right, spider says I picked up some call options yesterday. GameStop may second second. Hold on, GameStop may second 24. Execution price 238. What do you think? I assume spider that you bought them. Is that a correct assumption? And if anybody else has a position that you want to look at in GameStop, now's a perfect time to happy to do it. Like we can go back and forth between the DD and what you all have going on. Let's see, you're out in 2 May. Drag price is 24. I mean, I don't like it. I don't like to trade at all personally. Yeah, I think that I think that that's a really tough trade. Spider says why I curious. Yeah, happy to expand. I don't like just saying, like don't like it and leave it at that. But I also",
    "start_timestamp_seconds": 1976.3,
    "start_timestamp": "00:32:56",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=1976"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 14,
    "total_chunks": 47,
    "text": "I don't like it. I don't like to trade at all personally. Yeah, I think that I think that that's a really tough trade. Spider says why I curious. Yeah, happy to expand. I don't like just saying, like don't like it and leave it at that. But I also don't like overvalent hearing my opinion if people don't want it. So yeah, happy to explain a bunch of things. The first thing, I don't like using the weekly explorations because take a look at the bid-ass spread. It's almost a dollar wide. It's absolutely atrocious in terms of the liquidity that you're getting here. So let's take a look. This is a really great exercise. What the hell is all this stuff? Get to that later. This one we can, this can all move. Over there. So I want to show you something. So if we take a look at your position, which is, let's take a look at today. And then you're in two May. You're looking at the 24 strike. The bid right now is 1.8. The offer is 2.62. So let's just get some context here on what this is. So this is your strike price. This is the bid. This is the offer. If we take a look at the bid-ass spread, it's 82 cents. If we take that 82 cents and normalize it into a ratio, the back ratio. This is not really a term I just make it up. All I'm doing is",
    "start_timestamp_seconds": 2073.26,
    "start_timestamp": "00:34:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2073"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 15,
    "total_chunks": 47,
    "text": "This is the bid. This is the offer. If we take a look at the bid-ass spread, it's 82 cents. If we take that 82 cents and normalize it into a ratio, the back ratio. This is not really a term I just make it up. All I'm doing is I'm saying, okay, based on the strike price, how wide is this bid-ass spread? So there's, I mean, it doesn't really matter which way you choose to do the ratio. I normally do the spread itself as a percentage. So the spread itself represents a 3.42. It's 3.42 of the strike that you're trying to trade. And that doesn't mean anything to you and I don't expect it will. But let's take a look at something else for a comparison, just for a benchmark. Let's take a look at Apple. We'll use the same expiration to start and we'll use the same at the monies. So for this Apple trade using the same expiration, the strike here that we're looking at is the 2.15. So 2.15, these are offered at 9.30. I'm sorry, bid at 9.30 offered at 9.80. And then these we can just drag them down. Let's take a look at them by comparison. What do you notice? What jumps out at you right from the get go? What's the difference here? Absolutely massive liquidity difference. Literally a tremendous liquidity difference. So when traders like you unknowingly go into these kinds of options, literally like genuinely, the only",
    "start_timestamp_seconds": 2179.66,
    "start_timestamp": "00:36:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2179"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 16,
    "total_chunks": 47,
    "text": "a look at them by comparison. What do you notice? What jumps out at you right from the get go? What's the difference here? Absolutely massive liquidity difference. Literally a tremendous liquidity difference. So when traders like you unknowingly go into these kinds of options, literally like genuinely, the only thing you're doing is giving the market makers an egregious amount of money. And that's not to make you feel any type of way. This isn't to put you down. I hope it doesn't come off like that. I'm hoping that this is educational. I want the lesson to stick because it's a really important lesson, especially for people that trade something like GameStop. This isn't the market makers to be clear. This isn't the market makers just trying to hurt GameStop traders. That's not it at all. In this context, GameStop is massively volatile. Anything that has massive volatility is immediately going to have wider bid aspect. Because it's more dangerous for a market maker literally to trade those things. And we see it right when they're getting caught off guard in a gamma squeeze, that's painful for them. So that's the first thing is literally based on the bid aspect of loan, you are overpaying an obscene amount. The next thing is if we take a look at theta, let's take a look at theta as again, we'll do theta to premium. So the premium you said that you got was, let me find it again, 238. Let's",
    "start_timestamp_seconds": 2285.5,
    "start_timestamp": "00:38:05",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2285"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 17,
    "total_chunks": 47,
    "text": "bid aspect of loan, you are overpaying an obscene amount. The next thing is if we take a look at theta, let's take a look at theta as again, we'll do theta to premium. So the premium you said that you got was, let me find it again, 238. Let's take a look back at your option, GME. And let's take a look at the theta on that. It's a three cents. So you're losing 3 per day in holding it. And 3 a day that doesn't, I mean, that doesn't sound like a lot, right? It's 3. That's not crazy. But again, everything here is relative. If we take this theta and we divide it by the premium and then we put this as a percentage, this means that every single day for the near future, you're losing 1.25 of your original investment every day. It just goes away. 1.25 gone. Here's why this matters to you so much. And again, this is another point that I really, really hope to drive home is if we analyze buying this option, to simulate your position. And let me get rid of these. Don't need those. I want you to pay attention to something. If we got these for 238. And again, we can see that our theta right now is 281. So it rounds up to three. That's why it's .03, but 281 here. I want you to pay attention to this purple line relative to the blue line. The",
    "start_timestamp_seconds": 2367.46,
    "start_timestamp": "00:39:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2367"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 18,
    "total_chunks": 47,
    "text": "attention to something. If we got these for 238. And again, we can see that our theta right now is 281. So it rounds up to three. That's why it's .03, but 281 here. I want you to pay attention to this purple line relative to the blue line. The purple line represents today. The blue line represents at expiration. I want you to pay attention to what happens if price goes up, meaning this direction. With the purple line where it sits right now, if price goes up, you notice that you start enjoying that profit faster, almost immediate. It goes up as soon as the direction of the trade accommodates. But let's take a look what happens if we fast forward time. What I'm doing right now, two things. I want you to pay attention to two things as I click this button. What I'm doing is I'm fast forwarding time. I'm simulating time passing. I want you to pay attention to this red hash line. That red hash line represents the break even today for your option. Pay attention to the red hash line where it goes. The second thing, I'm going to zoom it in more. The second thing I want you to pay attention to is the purple line relation to the blue line. Let's do this. Let's see what you see. I'm going to fast forward a week. We'll go five trading days. So I'm going to go through the weekend. So today and",
    "start_timestamp_seconds": 2478.9,
    "start_timestamp": "00:41:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2478"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 19,
    "total_chunks": 47,
    "text": "The second thing I want you to pay attention to is the purple line relation to the blue line. Let's do this. Let's see what you see. I'm going to fast forward a week. We'll go five trading days. So I'm going to go through the weekend. So today and tomorrow, and then I'm going to go five days from there. So this is simulating past tomorrow. Now let's go five days. So 16. So this is Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday. This puts you into the next trading week. What did you notice? What just happened there? Two things happened that are very, very important to you as the long option holder here. What did you see? I'm going to open door for you. Mr. Spyder, what did you see in that display? I'm doing this for you. So I want to make sure that you're following. H says the break even is moving up surprisingly fast. So that's a super phone, a friend moment from H. That's correct. Spyder, does that make sense? The reason why I'm, Spyder says losing money is what I saw. Purple is getting closer to blue. That's correct. Good. That's good. The reason why I'm honing in on this so much is because it literally pains me to see so many new options traders trading something as nuanced as GameStop and just losing money. I really hate to see that because I know the people that are losing the money or",
    "start_timestamp_seconds": 2561.86,
    "start_timestamp": "00:42:41",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2561"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 20,
    "total_chunks": 47,
    "text": "The reason why I'm honing in on this so much is because it literally pains me to see so many new options traders trading something as nuanced as GameStop and just losing money. I really hate to see that because I know the people that are losing the money or the people that don't really have the money to lose. When I see influencers online that are joking around about trading options, I don't care at all because I know that they have tons of money and it doesn't matter. It's just a game. But I know a lot of the people that are trying to trade GameStop like this are actually trying to make some money to better their lives in some way and it's just not happening and it's not the market's fault. It's entirely our fault as the trader but it's a knowledge issue. So just for the context on why I'm spending the time on this with you is because this is not unique to you. This is literally endemic to GameStop options traders across the board. So what I'm doing right now is I am grabbing a video for you that goes through all of this. I just got to find it here. So spider, this video is for you but I want to recap what just happened and there's just a really important function of what happened right now. As soon as the stock is above 2334, your option is profitable. You would be",
    "start_timestamp_seconds": 2653.38,
    "start_timestamp": "00:44:13",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2653"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 21,
    "total_chunks": 47,
    "text": "this. I just got to find it here. So spider, this video is for you but I want to recap what just happened and there's just a really important function of what happened right now. As soon as the stock is above 2334, your option is profitable. You would be making money. If I fast forward time like I did before and we move this forward a week and change, you now need the stock to hit 2390 in order to get just to break even. So the reasons why I don't like your option. First is because you're trading a weekly expiration, which is supremely illiquid. The second thing and what I mean by that is if you just take a look at the primary expirations, take a look at the difference here. This is 40 cents wide. It's even further out in time than your 48s. So typically as you go further out in time, bid us spreads wide and more but literally it's 40 cents wide. It's what half the gap of what you paid for these 48 DTE options. The second thing that I don't like is because you are within the 60 day window, these options are going to decay insanely fast. And I want to show you this. That's that red line moving to the right. But I want to show you quickly and then we'll move on how this will work. Right now, the theta that you're looking at is 3 cents. If",
    "start_timestamp_seconds": 2708.74,
    "start_timestamp": "00:45:08",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2708"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 22,
    "total_chunks": 47,
    "text": "options are going to decay insanely fast. And I want to show you this. That's that red line moving to the right. But I want to show you quickly and then we'll move on how this will work. Right now, the theta that you're looking at is 3 cents. If we fast forward a week over the course of that week, your theta remains 3 cents. So no change, still the same 3 cents, but notice that your premium is less. So what that means is even though the theta is not accelerating, the theta as a ratio to the premium left in the option is absolutely accelerating massively. And again, we can use it as an example here. So the midpoint on these right now is 211. So let's just take a look at what happens if we go from 238 to 211. And again, remember, we're looking at the theta relationship relative. So right now your theta is essentially 1.26 of your premium. So now let's go to 211, which is what your options would be worth in a week. It's now 1.42. So we went from 1.26 to 1.42. So again, what this means is it exacerbates that scenario I showed you earlier. That the longer it doesn't give you the move you need, the bigger move you need. So it makes it very difficult to make money like that. So then let's go in just another couple weeks. So if you go into 17 April, well,",
    "start_timestamp_seconds": 2803.38,
    "start_timestamp": "00:46:43",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2803"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 23,
    "total_chunks": 47,
    "text": "that scenario I showed you earlier. That the longer it doesn't give you the move you need, the bigger move you need. So it makes it very difficult to make money like that. So then let's go in just another couple weeks. So if you go into 17 April, well, shit, the option is now worth less. And theta just stepped up to now 0.04. So this problem becomes parabolic. That's what I want you to take away from this. So what that means is by buying an option literally during the main section of the decay curve, this is just like a slide deck that I built to give references like this. It's like a random smattering of shit. This is where you are in terms of the theta decay curve. Do you notice how when you're further out in time, the theta decay curve really is not that steep? Pretty mellow. But if we plot the slope once you get within 60 days, I mean, really from 90 to 60, really starts to steep and steep and up, but not crazy. But as you get in from 60, it literally goes parabolic. So all of this summarized, the reason I don't like that option is because the bit-ass spread is terrible. And because with the long option selected, these are going to decay away insanely fast. And unless you get the move that you need very quickly, you will not have much to show for it unfortunately. So",
    "start_timestamp_seconds": 2884.02,
    "start_timestamp": "00:48:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2884"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 24,
    "total_chunks": 47,
    "text": "reason I don't like that option is because the bit-ass spread is terrible. And because with the long option selected, these are going to decay away insanely fast. And unless you get the move that you need very quickly, you will not have much to show for it unfortunately. So yeah, that's why. I hope that the information at least itself is useful on that like it makes sense. This is something that I just see, you know, GameStop option traders do a lot. And as you can tell, it really is like, it's like painful for me because I hate seeing people lose money like that. It just sucks because it's so preventable. It's so preventable. But it is just a, it's just a knowledge gap unfortunately. So I hope that explains it. Spiders says, thanks. I will hold for a week and get out. Yeah. And the thing is, is the other thing you could consider is you could spread it off if you wanted. That's okay. And that'll salvage the position where it is. But yeah, if if this were me and that was my position, I would personally want to manage it quickly. But if I still have that same idea, make sure you watch that other video, I sent, but what I would do is I would go further out in time, actually, I would go out to something like this 125 days. And I would go deeper in the money, like a 68 delta,",
    "start_timestamp_seconds": 2959.38,
    "start_timestamp": "00:49:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=2959"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 25,
    "total_chunks": 47,
    "text": "still have that same idea, make sure you watch that other video, I sent, but what I would do is I would go further out in time, actually, I would go out to something like this 125 days. And I would go deeper in the money, like a 68 delta, the options are more expensive here. But if you take a look at the theta for these options, it's two pennies. Even if they slide to add the money, it's two pennies. And again, remember the ratio here, this is two pennies again, something that's almost twice the price of what you have. So it means that the total impact to the trade is much, much less than what you will face. So yeah, a couple of ways to think about it. All right, let's take a look at another one of these. DDPs. DTCC is finished. Okay. The naked trading scandal is much worse than you may have first believed. I think, well, I think we all believe that it's probably notably bad. The real shares in your account hold the same exact rights as any other, but behind the curtain DTCC is historically covered up the FTDs and mass naked shorting using C EBE counterfeit electronic book entries. This is the DTCC ways of maintaining this reverse Ponzi scheme. This is why a non-standard dividend would ruin them. That's actually kind of interesting as they cook books for everyone that DTCC is in trouble. I actually kind of",
    "start_timestamp_seconds": 3034.1,
    "start_timestamp": "00:50:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3034"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 26,
    "total_chunks": 47,
    "text": "mass naked shorting using C EBE counterfeit electronic book entries. This is the DTCC ways of maintaining this reverse Ponzi scheme. This is why a non-standard dividend would ruin them. That's actually kind of interesting as they cook books for everyone that DTCC is in trouble. I actually kind of like that because this goes back to even the function that we see of the voting rights around proxy votes, right? Like the fact that there's so many extra votes happening that shouldn't exist. So this, I actually kind of like this idea. Let's see how's the cards extraordinate inside into the inner work as a DTCC. Okay. If you haven't read his letters, DTC, I have a, all right. Let's see. So they're going to use NSS for naked short selling, system-ac issue for years. This is correct. There were some changes that didn't impact anything that's correct. Naked short setting was meant to curb the fraud and protect investors. I argue that the pump and dumps would riot without the ability to sell shares that couldn't borrow. Like the leady shareholder advocates are generously offering their services in the fight against pump and dumps. They're offering to step up volunteer. Yeah. They're generously volunteer to take the investors money and exchange for seed artificially raising the supply. This of course immediately does damage to the investment. Okay. Okay. So it says after naked shorting is done what now, the would be victim in the shareholder advocate now fundamentally",
    "start_timestamp_seconds": 3118.58,
    "start_timestamp": "00:51:58",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3118"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 27,
    "total_chunks": 47,
    "text": "up volunteer. Yeah. They're generously volunteer to take the investors money and exchange for seed artificially raising the supply. This of course immediately does damage to the investment. Okay. Okay. So it says after naked shorting is done what now, the would be victim in the shareholder advocate now fundamentally of goals that are opposite the buyer wants the stock to go to the moon. The naked short seller wants this business to go bankrupt. Thanks. The question, why would an entity volunteer into protect against fraud still take money of the investor? Okay. The maximum amount of shares that can legally be sold short is governed by the number of shares that can legally be borrowed. NSS ignores this mechanism. We know this DTCC enables this further due to the fact that the share can be lent up multiple directions. We know this. This is the reason for FTDs and hundreds of percent. Yeah. That's exactly spot on. So how does this play in a game stop? Okay. So they're saying how do you know if you have shares effectively? And I mean, the thing is one thing to note here is that there's a difference between like your shares and whether or not they're quote unquote real and then what might be happening on the back end with your shares. But depending on your view of ownership, one of the ways that you can do this is I mean, pretty much what a lot of people did with",
    "start_timestamp_seconds": 3216.18,
    "start_timestamp": "00:53:36",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3216"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 28,
    "total_chunks": 47,
    "text": "shares and whether or not they're quote unquote real and then what might be happening on the back end with your shares. But depending on your view of ownership, one of the ways that you can do this is I mean, pretty much what a lot of people did with their shares, which is direct frustration. If you lock them up, then they can't be moved around like that. But it doesn't really change the back end issue because effectively what we're saying up here is that they and this is true is like they don't need your shares necessarily, right? Because each share can be loaned out in multiples. So they literally don't even need yours technically. Okay. Imagine, let's see if I hold on to shares, it's the same as one share. I have legal rights. Okay. Okay. Let's see. You thought you were buying shares from a real shareholder. You see in the number of shares you're brokerage account, why would you even think for a second that the shares aren't even there? Well, again, like this is another like misconception to be honest. The idea that like this is the same thing that if if you put a million dollars into the bank and if you go to the bank and you're like, can I go look at my million dollars, they're going to tell you no, they're going to tell you that the money's not there. They're going to tell you that if you want",
    "start_timestamp_seconds": 3280.42,
    "start_timestamp": "00:54:40",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3280"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 29,
    "total_chunks": 47,
    "text": "put a million dollars into the bank and if you go to the bank and you're like, can I go look at my million dollars, they're going to tell you no, they're going to tell you that the money's not there. They're going to tell you that if you want to withdraw a million dollars for the bank, you literally have to give them like a week's notice. It's crazy. So that's because like your physical money isn't sitting in the bank. They're loaning it out. The money is out doing things. That's how the bank makes money. So it's the same thing when it comes to the shares. Like just as I go to the bank, I have rights to that money. It's still my money, but it doesn't mean that it's just sitting there parked in the bank. The bank is going to do stuff with it. That is what happens with your shares unless you opt out of it. So the fact that if you open up your account and you see shares, it doesn't inherently mean that like your shares are sitting there parked in the account for you, it just means that you have rights to those shares. And this is also why it's really important for people that invest to actually read the broker agreements. The broker tells you all this just like the bank tells you all this if you actually read the bank documents when you're putting your money into the bank.",
    "start_timestamp_seconds": 3371.62,
    "start_timestamp": "00:56:11",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3371"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 30,
    "total_chunks": 47,
    "text": "to those shares. And this is also why it's really important for people that invest to actually read the broker agreements. The broker tells you all this just like the bank tells you all this if you actually read the bank documents when you're putting your money into the bank. So it's the same thing here. So just the thing to note is that like in this case, you don't, it's not even expected that the shares are there. Like we don't expect again, the broker tells you that the shares aren't going to be sitting there unless again, you opt into that. So let's see. Seeds that the DTCC do not represent what you think of shares. They're packed. Okay, so literally just talked about that. Okay, so because the DTCC are complicit in ensuring that this fraud is covered up every time, a shareholder tries to exercise the rights and attach to only real shares. These are not real shares. Do not have the rights. Okay. However, they have to maintain the illusion that they have these rights to not expose the fraud. I think this is conflating two different issues personally. I think that this is tying in the rights of share ownership. And I think it's tying in naked shorting, which are two disparate issues to highlight. But let's continue. DTCC won't turn around and say you can't sell. Yeah. So what happens if a non-standard dividend is issued, the DTCC can't cook the books and",
    "start_timestamp_seconds": 3423.86,
    "start_timestamp": "00:57:03",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3423"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 31,
    "total_chunks": 47,
    "text": "in the rights of share ownership. And I think it's tying in naked shorting, which are two disparate issues to highlight. But let's continue. DTCC won't turn around and say you can't sell. Yeah. So what happens if a non-standard dividend is issued, the DTCC can't cook the books and are forced to reconcile the float back down to its issued amount. Sure, it's have to close their positions. They need everyone to cancel out their fake borrow. What if no one sells? Okay. Because I, oh, that was it. My bad. I thought there was because I actually don't disagree with this. Well, that I don't disagree with the concept here that if they forced a special dividend, it does force a reconciliation. Now, I don't know actually the back end well enough to intelligently speak and definitively say that they're forced to reconcile the float back down to its issued amount that I don't know. And it's because it wouldn't surprise me if there's ways to circumnavigate that and simply just to get the special dividend to the actual shareholders because they know who the actual shareholders are. But yeah, interesting. I actually like this one. I don't think that the DTCC is finished, but I do like what they're talking about and I get it. This is cool. I like just clicking on this one quick. I like this one because it's an Oberos. Yeah, there it is. So for those that don't know, I have a",
    "start_timestamp_seconds": 3505.22,
    "start_timestamp": "00:58:25",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3505"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 32,
    "total_chunks": 47,
    "text": "think that the DTCC is finished, but I do like what they're talking about and I get it. This is cool. I like just clicking on this one quick. I like this one because it's an Oberos. Yeah, there it is. So for those that don't know, I have a tattoo on the left arm of an Oberos, which is super cool. I'm glad that they have one in there. It's neat. All right, let's take a look at this one. Home Depot Hank 69. Kind of a fun name. Let's see. Oh, geez. Okay. I mean, this one's okay. This one just has like a lot of fluff. All right, let's see. Okay, good. Enough joking around time to get serious. Perfect. That's where I'm at. There's been absolute slew of data about FDD's dark pools rule changes, which still so interesting to me is that we continue to demonize dark pools and don't actually fully understand them. I think I now understand how all this fits together and have just made a GME theory of everything. Okay, let's see. Eventually FDD cycles the idea that because shorts have continually shorted GME, covered it with borrowed shares and used naked shorts, the shorter exposure is multiple hires than the actual shares of GMEs and existence. Yep. Because of this. And the SEC rules forced in the cover every 35 days. They're a predictable price and volume hikes on the chart, which I think we've identified as not fully accurate,",
    "start_timestamp_seconds": 3586.26,
    "start_timestamp": "00:59:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3586"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 33,
    "total_chunks": 47,
    "text": "naked shorts, the shorter exposure is multiple hires than the actual shares of GMEs and existence. Yep. Because of this. And the SEC rules forced in the cover every 35 days. They're a predictable price and volume hikes on the chart, which I think we've identified as not fully accurate, right? Is that the general consensus across the community? Because that's definitely been my observation. That's what we've talked about. But I don't know if that's like widely adopted across the community net community yet or not. So if you could fill me in there, that would be super helpful. As every FDD cycle passes, prices to cover get more and more expensive. And more and more shares are required to maintain their position, which makes it progressively more expensive and progressively increases their position. Why? Why? Can somebody explain that to me? I don't know why they're drawing that conclusion. I get up in the door. I don't know why we're saying this definitively that as every FDD cycle passes, the prices to cover get more expensive and that they have to get more shares. I'm sure that it's something in one of the prior posts, but I just don't see the mechanics of that. Yeah, I just, I think that that's a big leap that's being made because it doesn't like, there's no underlying forcing function from the market that would cause that to be the case. But anyways, let's continue. Because heavy naked shorted probably started in",
    "start_timestamp_seconds": 3677.94,
    "start_timestamp": "01:01:17",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3677"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 34,
    "total_chunks": 47,
    "text": "don't see the mechanics of that. Yeah, I just, I think that that's a big leap that's being made because it doesn't like, there's no underlying forcing function from the market that would cause that to be the case. But anyways, let's continue. Because heavy naked shorted probably started in 2020. Each passing month or exposure increases drastically because naked short gives them double the obligation they must cover the short and the naked created share. This is why I believe that the current short position is multiples higher. Again, this is also making a like a really, really, really big leap. G.C. says one Thor, I got you. He just laid down in his bed. But no. Now I did just trim up his face. So you can see his eyes now. Check out those eyeballs. He's a little on the grumpy side because it's pre-dinner right now. He would like his dinner. Is that correct? But Mel's not here and I'm in here. So he's having to to keep it real. But I mean, he's here. He's doing the thing. You see him? He sees his eyeballs. He's good. Check this out. Oh boy. Who knows how to do that? He also does face licking. That happens too. He's good little dude. Well, feed him in a hot minute. You got it G.C. I know what it's like. Anytime, I remember when I was in college. I love dogs. So anytime I had a chance to see a",
    "start_timestamp_seconds": 3768.58,
    "start_timestamp": "01:02:48",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3768"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 35,
    "total_chunks": 47,
    "text": "do that? He also does face licking. That happens too. He's good little dude. Well, feed him in a hot minute. You got it G.C. I know what it's like. Anytime, I remember when I was in college. I love dogs. So anytime I had a chance to see a dog, I was always stoked. So all right, let's continue. This why I believe the current position is multiple hires. I just think that's a giant assumption that's not really based on something we can prove. Similar to the January squeeze, eventually the pressure would be too much forced out. Yeah. I mean, I think we're honestly, I think we're based on a faulty premise, to be honest. This is another thing is like the flow trading off exchange that doesn't suppress the buying pressure technically. And this is the other thing. See, like this is the thing that this is the thing that I think is interesting because we talk about we talk about the basics like here about like their reading tons of posts about dark pools. But then we're citing the dark pools here as if it's even remotely close to the same as internalization and relevant to suppressing of the buying power. Like the reality is that again, like dark pool orders hit the consolidated tape within 15 seconds, typically a couple seconds after the transaction. So this isn't actually that. Okay. ETF shorting. We know this. All right, let's see how they're saying how it",
    "start_timestamp_seconds": 3853.94,
    "start_timestamp": "01:04:13",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3853"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 36,
    "total_chunks": 47,
    "text": "to suppressing of the buying power. Like the reality is that again, like dark pool orders hit the consolidated tape within 15 seconds, typically a couple seconds after the transaction. So this isn't actually that. Okay. ETF shorting. We know this. All right, let's see how they're saying how it all fits together. After the cycle, dark pool, OTC activity, ETF shorting, upcoming rules that could benefit us. First, dark pool, OTC data indicates what we already know. Edge funds are in a giant fuckery hole in a bus. They borrowed shares, covered those borrowed shares, borrowed shares. I don't think it proves this. They've been repeating this forever, which is why the price of GME is still so high and volatile. I don't think that's it either. They do most of the covering in dark pools to suppress buying pressure. This is again, incorrect. Transactions that occur in dark pools, they don't suppress buying pressure. It still hits the consolidated tape and do other shady things in this dark pool so it goes unnoticed. Yeah. More over GMEs, on balance volume is always perplex me. How could OBV still be this high post squeeze? The DD on dark pools explains that they are covering in dark pools to suppress buying pressure. OBV shows that. It won't show that. This means that apes did not sell post squeeze and that the hedge funds did indeed use negative shorts to create artificial selling pressure. I do believe that that absolutely can",
    "start_timestamp_seconds": 3934.66,
    "start_timestamp": "01:05:34",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=3934"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 37,
    "total_chunks": 47,
    "text": "explains that they are covering in dark pools to suppress buying pressure. OBV shows that. It won't show that. This means that apes did not sell post squeeze and that the hedge funds did indeed use negative shorts to create artificial selling pressure. I do believe that that absolutely can be the case. I'm not convinced that it's hedge funds. I don't think we can definitively say hedge funds. But I do think I'm not saying it is or isn't. I'm just saying I don't think we can isolate them and say it is them. OTC data also explains the low volume. The funds are covering. Again, this is not correct. So volume being low is nothing to do with the transactions going on in dark pools. Again, it hits the consolidated tape. I'm not trying to keep saying that point, but I'm just literally going through this piece by piece and reiterating where it applies. This also explains the random one PM jumps in by volume that I noticed in a previous post. It doesn't explain that. So one of the things that you'll notice in by volume at specific times throughout the day, it's typically the first hour of the day and the last hour of the day. You'll almost always see that trend. And that's where broad market liquidity occurs. This happens in every ticker. So if we take a look at a five day, 15 minute chart, that's actually we need a little more compressed time.",
    "start_timestamp_seconds": 4029.94,
    "start_timestamp": "01:07:09",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4029"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 38,
    "total_chunks": 47,
    "text": "of the day and the last hour of the day. You'll almost always see that trend. And that's where broad market liquidity occurs. This happens in every ticker. So if we take a look at a five day, 15 minute chart, that's actually we need a little more compressed time. Let's take a look at a, I'm going to zoom this out to be like a five day though, so that we can see more iterations of it. This will be a five day, five minute. What I want you to notice is take a look at the volume, typically at the start of each day and then at the end of each day. There will be spikes throughout the day as different entities to choose to transact at those times for different reasons, but at the beginning of each day and at the end of each day, you're going to see the same spike. This is not unique to GameStop. The last comparison we use is Apple. If we look at Apple spike in the beginning of the day, I get the end of the day. If we take a look at spy, the SP 500 index ETF, I can be getting the day, I get the end of the day. This is always the case. And this is for two broad reasons. I actually have a video that goes over the details of market liquidity and why you see this trend. And I'll show you that video here,",
    "start_timestamp_seconds": 4098.66,
    "start_timestamp": "01:08:18",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4098"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 39,
    "total_chunks": 47,
    "text": "can be getting the day, I get the end of the day. This is always the case. And this is for two broad reasons. I actually have a video that goes over the details of market liquidity and why you see this trend. And I'll show you that video here, but it has everything to do with when different periods open up in the market that other activities are going on. And that's exactly why, beginning of the day, end of the day, it is trains never late. It's always there. So anyways, back to this. So this, the random jumps at 1 p.m. That's way more likely to be an individual entity that's processing their orders at that point for some reason. And that can be for a lot of different reasons. That's why you notice in all those others tickers that we looked at, their absolutely your periods where it just shoots up. And it's typically one volume bar, whether it's five minutes, 15 minutes, it's typically tied to a small number of trades because it's so easy to be excessive volume in those more quiet periods as compared to the total volume of the busier periods or the total volume of the day. Okay, furthermore, dark pool, T.C. data provides almost irrefutable evidence that there's still fuckery of foot with GameStop. Again, I have no idea how dark pool does that. The shorts have indeed dug themselves into a hole that they cannot get out. Do not",
    "start_timestamp_seconds": 4154.42,
    "start_timestamp": "01:09:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4154"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 40,
    "total_chunks": 47,
    "text": "the total volume of the day. Okay, furthermore, dark pool, T.C. data provides almost irrefutable evidence that there's still fuckery of foot with GameStop. Again, I have no idea how dark pool does that. The shorts have indeed dug themselves into a hole that they cannot get out. Do not see how it proves that. The exposure that the short funds have is astronomical. Again, I, and I'm not saying this to just say like I don't agree with it. I like I genuinely don't see how OTC data or dark pool data are proving any of these definitively. Unless for some odd reason, all apes sell the moas will in fact happen and it will happen big. I don't agree with that either. Like I don't think that these things lead to that scenario. And the other thing I will continue to remind the apes of, I think that apes need to hear this for their own good is that if broad market entities interfered with the prior squeeze that we had, by turning off the buy button, why would in any world going forward, they not intervene again and just allow it to go further? Right? Like it doesn't make sense. So one of the massive inconsistencies I see with these kind of dds is we say things like there's massive fuckery going on and that the game is rigged that everybody's in cooats with one another that everything is fake, artificially suppressed. But then we think that",
    "start_timestamp_seconds": 4226.34,
    "start_timestamp": "01:10:26",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4226"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 41,
    "total_chunks": 47,
    "text": "doesn't make sense. So one of the massive inconsistencies I see with these kind of dds is we say things like there's massive fuckery going on and that the game is rigged that everybody's in cooats with one another that everything is fake, artificially suppressed. But then we think that there's going to be this uncontrolled squeeze that's just going to go. Right? Like it just logically doesn't make sense. So the argument I'm posing here is that because there are clear, there is clear evidence that manipulation occurs in different ways. FTD is one of the main, one of the main vectors that occurs in it. We can see it. It is there. It is bullshit. There's no way that you should be able to have more than 100 of the float short. Right? It just doesn't fucking make sense. So absolutely. Then we can also see the incestuous relationship with a place like Citadel that somehow has a hedge fund arm that's making directional bets and ideas and also has a market making arm. As if there's not going to be crossover between those. That's utter bullshit. It's the same thing with fucking Congress trading. As if the decisions Congress is making when they're placing their individual stock trades is not somehow based on information that they have access to. Right? Like it's just insane to even suggest that. So those things aside, I think that if there is that scale of manipulation, it doesn't really then reconcile",
    "start_timestamp_seconds": 4312.82,
    "start_timestamp": "01:11:52",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4312"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 42,
    "total_chunks": 47,
    "text": "decisions Congress is making when they're placing their individual stock trades is not somehow based on information that they have access to. Right? Like it's just insane to even suggest that. So those things aside, I think that if there is that scale of manipulation, it doesn't really then reconcile why we think that this kind of massive painful move for those very same entities would occur. It's kind of, I mean, to me, it's just counterintuitive. That's all I just, I haven't seen a good explanation for how that, how that relationship makes sense or how it would play out. I just broke my pen. So I'm trying to, it's the worst. Keep myself for that. What is that? What the fuck? Guys, I just, I just fucked up bad. I guess this thing has to be here. Okay. I think I got the, oh, we'll figure that out later. That's a fun game. All right, let's continue. Yeah. Headphones are indeed in a deep hole, not covered, trading in high volumes and dark pulls. Again, I don't really agree with that. GMEs insanely hard to borrow and there's very little demand for it. I do agree that it was very hard to borrow. That was actually one of the most interesting elements of GameStop that unfortunately has changed a little bit with the recent at the markets. But I do fully agree that GameStop being in a place where, I mean, I don't know, I think of it",
    "start_timestamp_seconds": 4404.1,
    "start_timestamp": "01:13:24",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4404"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 43,
    "total_chunks": 47,
    "text": "was very hard to borrow. That was actually one of the most interesting elements of GameStop that unfortunately has changed a little bit with the recent at the markets. But I do fully agree that GameStop being in a place where, I mean, I don't know, I think of it as GameStop was super well positioned while it was hard to borrow to cause this broader context, like this broader confluence of things to occur. So that I actually fully agree with. I think that that's completely accurate. So yeah, on the same point there, figured out how to fix my pen, by the way. That's called OCD where you can't stop thinking about something until it's done, but it's done. OTC data adds credence to the idea that FDD cycle is getting more and more expensive. Okay, so let's see if it expands on that. Why isn't some will coming in to take advantage, benefited the squeeze. There would be new rules, DD coming to play because Wall Street has access to better, more accurate data. While it's with the DTCC, put all these rules liquidation bankruptcy and oversight after the GME squeeze. I don't that unfortunately didn't expand on that in the way that I hope it would because I still don't understand that point. I don't see the evidence behind it. Inclusion four, Wales have purposely sideline themselves and are waiting for the proposed regulatory rules to take effect so the squeeze doesn't destroy the financial system.",
    "start_timestamp_seconds": 4514.34,
    "start_timestamp": "01:15:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4514"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 44,
    "total_chunks": 47,
    "text": "on that in the way that I hope it would because I still don't understand that point. I don't see the evidence behind it. Inclusion four, Wales have purposely sideline themselves and are waiting for the proposed regulatory rules to take effect so the squeeze doesn't destroy the financial system. The courts are using dark pools to suppress buying pressure to drop the price by rapidly trading between each other. That doesn't make sense. The squeeze will happen once the availability of shares to borrow is completely dried up, which seems to be rapidly approaching, which obviously know. With the benefit of hindsight, it wasn't right. FDD cycle is persistent and exemplifies the naked shorting problem. I do agree that it identifies elements of the naked shorting problem. I don't think that it exemplifies the details of it because I actually think that FDD cycle is just one measure that helps us look into it, but I don't think it's, I think there's more to it. This is always bad practice. This is saying each of these days is between T33 and 35. What we're doing is very standard statistical flaw in analysis and this is called overfitting. We're essentially looking at a period of interest historically and then we're trying to figure out how the data fits. I've ran broad data analysis on GameStop, both pre and post at the market offerings to see literally every variation of time-based cycles that I could find. Literally, that's everything from T",
    "start_timestamp_seconds": 4592.66,
    "start_timestamp": "01:16:32",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4592"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 45,
    "total_chunks": 47,
    "text": "looking at a period of interest historically and then we're trying to figure out how the data fits. I've ran broad data analysis on GameStop, both pre and post at the market offerings to see literally every variation of time-based cycles that I could find. Literally, that's everything from T plus zero, T plus one, T plus two all the way out. Then it was also with calendar variations to see what the correlation is between these various durations and subsequent stock price movement. It's generally broadly not correlated. That's just from a higher level. It would be true. I want to emphasize not my opinion. I love many possible catalysts. It's talking about potential reasons, which I think are all fair. We can postulate different catalysts and I don't think there's anything wrong with that. Ftd cycle slowly chewing away. At shorts, obviously, we've not seen that. The dark pool data does not confirm that. If you have fun, read this. I do want to read this because I do not, again, the thing that I want to continually remind everybody of. My goal is not anything related to hype things up or break things down and to diminish the potential impacts. My entire lens, generally of the world, but particularly markets is the best attempt I can possibly conjure up at objective analysis. That is literally my goal standard. It's because it's how I trade. It's the only way to make money in markets. If I approach markets,",
    "start_timestamp_seconds": 4680.82,
    "start_timestamp": "01:18:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4680"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 46,
    "total_chunks": 47,
    "text": "the potential impacts. My entire lens, generally of the world, but particularly markets is the best attempt I can possibly conjure up at objective analysis. That is literally my goal standard. It's because it's how I trade. It's the only way to make money in markets. If I approach markets, what's the lens of what I want to see? That's a really great way to lose money because the market doesn't give the slightest fuck about what I want to see. The market is going to do whatever the market is going to do. So anyways, they know more than us. There's no way there's no way they'll let this happen again. It's been trading sideways. Yep. What's happening to GME is not normal. 100 correct. At the highest level, that is one of the easiest takeaways to always circle back to in that the performance of GameStop is not normal. That is completely correct. This is completely correct. I completely, completely, completely agree with this. This is one of the best points they've made in this. Interesting. Yeah. I mean, I liked the overall intent behind the piece and I liked the way that they were trying to think things up. Again, I think that there's a lot of misunderstandings at a fundamental level, but I mean, I still enjoyed it. I thought that it was at least like, again, like I always appreciate an honest, sincere attempt at rigorous analysis and I can appreciate it as that. So",
    "start_timestamp_seconds": 4786.02,
    "start_timestamp": "01:19:46",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4786"
  },
  {
    "video_id": "XEk0OnFpybI",
    "title": "XEk0OnFpybI",
    "url": "https://www.youtube.com/watch?v=XEk0OnFpybI",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 47,
    "total_chunks": 47,
    "text": "things up. Again, I think that there's a lot of misunderstandings at a fundamental level, but I mean, I still enjoyed it. I thought that it was at least like, again, like I always appreciate an honest, sincere attempt at rigorous analysis and I can appreciate it as that. So I enjoyed looking at that one. So interesting. Yeah. Pretty cool stuff. I think that wraps me up for today. As always, if you guys need anything, let me know. I'm going to go feed Thor. And I'll see you all around on the next stream on the next time we're hanging out in the discord, whatever it is. But if you need anything in the meantime, you can always reach out. Be an outlier. Be an ape. See you later.",
    "start_timestamp_seconds": 4870.18,
    "start_timestamp": "01:21:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=XEk0OnFpybI&t=4870"
  }
]