[
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "What's up outliers? Welcome back to the Outlier podcast. We have a very familiar green chicken coming to hang out with us and talk to us really about the world. But there's a few things that are really high on my agenda with you before we get into details. Always below Dumburg and friends. Could to see you all things for coming back and hanging out for a bit. Eric, always a pleasure to talk to you. We've just shot it before you hit record about your growth and success, congratulations. Well, deserved. I appreciate it. I think that's a very generous take, but I appreciate the sentiment. Speaking of growth, I actually figure that's a perfect place to start because throughout this year, at least from my lens, more of a trader lens, there's a lot of broad themes that I noticed, expanded and then some kind of fizzled out into nothing. If you were to look back over the years so far, understand that there's still a month left today's one December, but if you were to look back, what are some of the themes this year that you really think grew in scope and really gained steam? Yeah, it's fascinating time to be an observer and in your case probably more so than us at least in a public markets in participant. I think obviously 2025 is the year of the AI arc and the whispers of a bubble in the public markets. We participate in the",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 93.48,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "Yeah, it's fascinating time to be an observer and in your case probably more so than us at least in a public markets in participant. I think obviously 2025 is the year of the AI arc and the whispers of a bubble in the public markets. We participate in the private markets. We happen to be founding investors in a small AI startup and that we're heavily involved with. And we see what's going on in the private markets. It is, we've lived and invested privately in many mani-manias and this is certainly a mania. It doesn't mean that the world isn't going to radically change because of AI or that huge amounts of money can't be made during a mania, but all good traders would know you have to know when to leave the dance floor. Our whole philosophy is to build businesses you're proud to own and if somebody comes along and wants to overpay for it, then you hit the bid. Just like if your own stocks that you're happy to own and if it rises too high, maybe you shave a little bit off. So the arc of AI has been fascinating. We sort of had a little bit of the air come out of the balloon here. I would say, you know, what's thinking forward for 2026, the continuation of that arc, a lot of smoke around in video, Eric. A lot of questions being asked. You know, any time a company is writing a",
    "start_timestamp_seconds": 75.16,
    "end_timestamp_seconds": 154.2,
    "start_timestamp": "01:15",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=75",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "a little bit of the air come out of the balloon here. I would say, you know, what's thinking forward for 2026, the continuation of that arc, a lot of smoke around in video, Eric. A lot of questions being asked. You know, any time a company is writing a memo to sell side analysts explaining that it's not an end-around fraud. Broadly speaking, that's a bit of an issue. The other arc, of course, has been the crypto arc. I think a big story is the Michael Sailor situation and his financial engineering. Some interesting investing opportunities there, I think. These perverts that pay 10, 10 and a half percent look pretty interesting in a falling interest rate environment. But of course, the fact that finally, and I think correctly, the equity stack itself is traded below NAV is probably the market doing what the market does. It is a fascinating concept. What he's trying to do, it seems highly flawed to us. I mean, signing up for perpetual delusion of the equity stack. I mean, in the long run, that's a zero because all the Bitcoin goes for the perverts into the bondholders and less Bitcoin moons. So I mean, at least he's totally transparent about it. And as wonderful disclosure, everything is about the books. There's no, I don't think there's any fraud going on there. But the Michael Sailor story and Jim Chano's shorting it and going long, the classics sort of arbitrage trade going long,",
    "start_timestamp_seconds": 141.04,
    "end_timestamp_seconds": 232.06,
    "start_timestamp": "02:21",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=141",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "I mean, at least he's totally transparent about it. And as wonderful disclosure, everything is about the books. There's no, I don't think there's any fraud going on there. But the Michael Sailor story and Jim Chano's shorting it and going long, the classics sort of arbitrage trade going long, Bitcoin, I believe he did. Kind of a bit of an interesting one. For us, then, the recent weakness in crypto as we end the year, coinciding with the weakness in AI, has a bit of late 2007 type field. That's what we're talking about. And for being honest, the last sort of big bubble that we can remember. So those are the two big arcs on the energy side. I think as we correctly predicted, all as well, all as calm, the long term real price of all commodities is lower. And we did now that Canada currently call pretty good, we're publishing on that on Wednesday a little follow up. Maybe a slight victory lap and then a future set of predictions about Canadian energy as well. We'll clicking into the AI arc and more specifically the context of a bubble. It's really easy to, well, people tend to get nervy near market tops, even though the market spends the majority of its time within, you know, 5% of all-time highs. How do you analyze like a true bubble and put your finger on it as, I don't just think that this is in most periods, you forriya",
    "start_timestamp_seconds": 216.84,
    "end_timestamp_seconds": 305.72,
    "start_timestamp": "03:36",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=216",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "to get nervy near market tops, even though the market spends the majority of its time within, you know, 5% of all-time highs. How do you analyze like a true bubble and put your finger on it as, I don't just think that this is in most periods, you forriya aggressive growth, but like I actually think that this is a bubble. Well, there's always a bubble somewhere. It's just human nature. So our whole philosophy is don't try to short them, learn that the hard way, right? Don't try to fade them. Stick your hand out and grab some of the money, you know, it's some of the best private investments we've made fed into the SPAC boom. My meant SPAC boom was a little bit bubble. It was a bit of a free money machine for a while because you could raise this money and pay people interest and put it in T-Bills and then if you found your deal, you found your deal. So our whole general philosophy is to build businesses your happy own because they cash flow. And then if a SPAC boom comes along and somebody wants to take something public at a ridiculous price, well, you let it. That's the private markets. Now, the public markets side of things. When you, you know, we don't participate all that much in the public markets, I have a small yellow account that I occasionally, you know, do a little bit of action and I'll talk",
    "start_timestamp_seconds": 287.0,
    "end_timestamp_seconds": 373.6,
    "start_timestamp": "04:47",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=287",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "price, well, you let it. That's the private markets. Now, the public markets side of things. When you, you know, we don't participate all that much in the public markets, I have a small yellow account that I occasionally, you know, do a little bit of action and I'll talk about that maybe offline at some point. But nothing major, you know, it's totally material compared to say the size of the do-per-business and how important that is to us. And by the way, we would never invest in things that we're writing about and if we did, we would disclose it. So if you just go back and look at the 25 year chart of the NASDAQ, there's lots of bubbles between them and now and look at the chart. So timing bubbles, you know, if I was forced to be in the public markets, I would just dollar cost average in and, you know, reinvest the dividends by a mix of, you know, reasonable companies and dividends stocks and some growth stocks and Senate and forget it. Unless you're an skilled trader, very difficult to time the markets and trading is different from investing. Of course, as you know, better than anybody trading, as we were just, again, talking about before we hit, Gord was, is a combination of developing an edge and excellent bankroll management. You know, it doesn't take much of an edge in the casino to make money, which is why card counting is illegal.",
    "start_timestamp_seconds": 358.52,
    "end_timestamp_seconds": 442.0,
    "start_timestamp": "05:58",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=358",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "know, better than anybody trading, as we were just, again, talking about before we hit, Gord was, is a combination of developing an edge and excellent bankroll management. You know, it doesn't take much of an edge in the casino to make money, which is why card counting is illegal. But even then, when you're counting cards, you still have to manage your bankroll properly and the house, of course, has an infinite bankroll and you don't. And so draw down risk, you know, sometimes you just get a run of ad lock no matter how good the odds are against you or for you. And so trading is a skill. I do believe, for example, that people can successfully trade for a living, people do it. It takes a special mindset. I personally don't have it. I could tell you what my two failure modes as a trader are if you're interested. One is I'm a hunch and buncher. So I think I have a reasonable edge and I put too much on. And then the other is I just watch bad bets die, slowly. And I'm not good enough yet at cutting those losses too quickly. But I know that. Yeah, I know that about myself. And so, you know, only takes so many significant losses in your life to realize that maybe you should try to do something else. Like what you're good at, like build a business. And so that's what I do with my time.",
    "start_timestamp_seconds": 427.72,
    "end_timestamp_seconds": 498.36,
    "start_timestamp": "07:07",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=427",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "know that. Yeah, I know that about myself. And so, you know, only takes so many significant losses in your life to realize that maybe you should try to do something else. Like what you're good at, like build a business. And so that's what I do with my time. I think it makes obviously a lot of sense, especially the self-waring aside of it. Yeah, trading is fascinating to fascinating thing. But I mean, look, I can't fully give it up. I mean, it's kind of fun. It's nothing like the euphoria of a quick double on a call option or, you know, but at the same time, you can't convince yourself that your genius and you should do this for living either unless you have a strong track record. Look, I mean, intellectually understand what needs to happen. Translation of that knowledge into emotional execution as we're 99% of the people who can't make it go of it. Failed. And I'm in that crowd. I'm still glad you got the yellow account. That makes me happy by itself. So that's good. Yeah, I'll not tell you some stats have been fun. Let's just say the sharp ratio on that is very low, even though the regency is great. Because the volatility is pretty high. But the fun ratio. Yeah, I mean, it was an account that I found that had a couple of thousandth. But I actually forgot existed and I just been yellow trading it up. I",
    "start_timestamp_seconds": 486.88,
    "end_timestamp_seconds": 558.88,
    "start_timestamp": "08:06",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=486",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "that is very low, even though the regency is great. Because the volatility is pretty high. But the fun ratio. Yeah, I mean, it was an account that I found that had a couple of thousandth. But I actually forgot existed and I just been yellow trading it up. I got it very high. It came back down low now. It's in a good spot again. You know, speaking of getting super high and coming back down, you mentioned Michael Sailor and MSTR, which has been really something to watch. And I'm near positive that you guys have a better handle on it than I do. It is when I look at it, I really do get this genuinely feels like a Ponzi scheme thing going on. And it's not maybe directly, but it's not a Ponzi scheme because a Ponzi scheme involves sub to future and fraud. And I don't believe that Sailor is engaging in either of those or certain elements. And he has widely disclosed exactly what he's doing, which is essentially a leverbed on the price of Bitcoin. And I'll openly sacrifice in the equity stack to do it, which is the bizarre part. So what do I mean by that? If you pull up your Bloomberg and you type MSTR, F8, CAST, and you get their cap table, you see there's a Ponzi bonds that are ahead of the equity in line. Now there's a Ponzi preferred that are ahead of the equity in line.",
    "start_timestamp_seconds": 543.96,
    "end_timestamp_seconds": 632.08,
    "start_timestamp": "09:03",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=543",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "do I mean by that? If you pull up your Bloomberg and you type MSTR, F8, CAST, and you get their cap table, you see there's a Ponzi bonds that are ahead of the equity in line. Now there's a Ponzi preferred that are ahead of the equity in line. Just on those bonds needs to be paid. Microsoft itself doesn't really cash flow the company, whatever it does, who knows what it does. So you want to micro-stradig your A. Sorry, micro-stradig, what did I say? I heard Microsoft, but my name has been probably. No, it's probably me. So micro-stradig, it doesn't cash flow. It's software business doesn't really cash flow. Certainly not compared to the volume of liabilities that are accumulating on the balance. She now on the other side of the balance sheet are the assets that are being procured with the newly issued debt and preferred stock preferred stock. You could think of it as basically debt. The problem with this approach, leveraging your balance sheet to acquire an asset is this asset doesn't cash flow. So the only way in which this debt can be repaid if it has to be, if you can't be refinanced, is to new stock. More patchly, especially with the preferred stock. If you read the fine print, they could stop declaring dividends, but those things accumulate and they could pay them in stock. All the various instruments have different rules and nitty-gritty that will come into play eventually.",
    "start_timestamp_seconds": 619.64,
    "end_timestamp_seconds": 701.68,
    "start_timestamp": "10:19",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=619",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "be refinanced, is to new stock. More patchly, especially with the preferred stock. If you read the fine print, they could stop declaring dividends, but those things accumulate and they could pay them in stock. All the various instruments have different rules and nitty-gritty that will come into play eventually. But if you just dilute for whatever, you end up with what I call the A and C situation, the movie theater company, Adam Aaron, famous CEO. So what I'm saying is he has told his and Bob away the equity. He's printing shares to service the massive debt problem what he should have done was declared bankruptcy, recat lies and come out as a concern. He's not choosing to do that because he says any value of the equity above zero's worth staying public for, but you're destroying huge amounts of shareholder value in the process. So not zero is indistinguishable from zero with a big enough number and the denominator. And if you just look at the numbers, shares outstanding for A and C, that number is huge. It's literally many, many, many, many multiples of what it was before COVID. When you capture all the delusions and ten-for-one splits and all that other stuff. So Michael Seller in a slower way is doing the exact same thing to micro strategy stock, which is at the money just did a $1.4 billion buffer that he claims will get him 21 months of interest and dividends for his debt",
    "start_timestamp_seconds": 676.56,
    "end_timestamp_seconds": 777.56,
    "start_timestamp": "11:16",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=676",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "ten-for-one splits and all that other stuff. So Michael Seller in a slower way is doing the exact same thing to micro strategy stock, which is at the money just did a $1.4 billion buffer that he claims will get him 21 months of interest and dividends for his debt stack. Okay. So 1.4 billion of delusion every 21 months now, we know. Right. So not only do these, the holders of these instruments stand senior to the common in the case of a liquidation. They also basically can wipe out the company, if it can't wipe out the equity, if it can't afford to pay its debt. So they can take it bankrupt. And then you'll get, if you're lucky, some of the Bitcoin value that's left over assuming that the liquidation of micro strategy would encourage the price of Bitcoin. And so it's a risky thing. There's not a Ponzi. It's very well disclosed. He is making a leverage bet on the price of Bitcoin and if Bitcoin goes to the moon, he's fine. This is exactly what people who are investing in him want. It is unbelievably well disclosed. And so there you have it. Didn't not zero. He's going to run the equity AMC style to quote not zero. And then if Bitcoin grows big enough, where you have fixed liabilities and the equity gets the excess. So I get it. But that's a strategy that he's doing. So I wouldn't say it's a Ponzi. But",
    "start_timestamp_seconds": 761.0,
    "end_timestamp_seconds": 848.68,
    "start_timestamp": "12:41",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=761",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "zero. He's going to run the equity AMC style to quote not zero. And then if Bitcoin grows big enough, where you have fixed liabilities and the equity gets the excess. So I get it. But that's a strategy that he's doing. So I wouldn't say it's a Ponzi. But I would say it is, if Bitcoin never reaches 100,000 again, how is that equity not zero? When you plan out long enough, I mean, it's effectively a zero. If you look at like AMC stock is lost 99%. To me, 99% of the heart percent aren't really all that distinguished. And it leads to a follow up, which fully agree on not being a Ponzi. I think that's a good way to describe it. So I appreciate you walking through that. But I'm curious about if you were to ballpark a probability doesn't really get a specific number. But like a probability of liquidation in something like MSTR, do you have any figures in mind and if not, how would you? Very low. Very low. Actually this is not well understood. I think he never actually has to sell the Bitcoin. He could just print shares. Look at how many shares Adam Aaron has printed at AMC. Look once you're a mean stock, there's always going to be liquidity. Now you have to be ruthless about it and you have to care not at all about the people who are buying that paper from you. But he could print,",
    "start_timestamp_seconds": 835.2,
    "end_timestamp_seconds": 918.0,
    "start_timestamp": "13:55",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=835",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "many shares Adam Aaron has printed at AMC. Look once you're a mean stock, there's always going to be liquidity. Now you have to be ruthless about it and you have to care not at all about the people who are buying that paper from you. But he could print, he could print stock indefinitely. And pay off the debt, keep the Bitcoin and hope for a rebound. And that's what he'll do. My point is the equity is like the weakest instrument in that whole cap-table Eric. And yes, you have that upside. But that upside keeps growing as he issues more dividends and buys Bitcoin at ever higher prices. It doesn't cash flow. The whole leveraging up to buy an asset that doesn't cash flow is a really unique experiment and it's almost guaranteed to come at the expense of the equity. How could it otherwise? How is he going to pay the 1.4 billion that's due every 21 months that we just learned? That's before he does anything more. And so that has to come from the comment. I guess the interesting thing there in my opinion then is if we think that there's over relatively low probability of liquidation, then that infers that we expect there to be permanent demand for the underlying. Well, how many months out of COVID are we with AMC and they're still doing at the market after at the market? I mean, yes, once a meme stock always a meme stock.",
    "start_timestamp_seconds": 905.56,
    "end_timestamp_seconds": 981.72,
    "start_timestamp": "15:05",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=905",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "probability of liquidation, then that infers that we expect there to be permanent demand for the underlying. Well, how many months out of COVID are we with AMC and they're still doing at the market after at the market? I mean, yes, once a meme stock always a meme stock. Because I was going to be traders. There's the liquidity. You can do all the ant or financial shukanery. It looked as no shortage of banks. And I'll ask you to have to take a feed to help them do it. And so yeah, I mean, the AMC traded 6 million shares that I just pulled it up. No, it's not used for. I'm like, it used to be, but it's still there. This volume, you can do a V-Wop and issues and shares. But yeah, like in before, let's see here, before COVID, this is using Bloomberg. AMC had, I think, like, see, I pulled it up. Like that 500 million shares outstanding now. And before COVID, they had 15. So he's taken the share count from 15 to 500. And the best investment in AMC all along was the high yielding debt paper, which is going to get paid by the 10% coupon. You could have bought it for a much higher yield than that at its lows. And off you go. And so the debt holders are going to win an AMC, not the common. In fact, just pulling up to see what the yield is on",
    "start_timestamp_seconds": 966.96,
    "end_timestamp_seconds": 1050.16,
    "start_timestamp": "16:06",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=966",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "paid by the 10% coupon. You could have bought it for a much higher yield than that at its lows. And off you go. And so the debt holders are going to win an AMC, not the common. In fact, just pulling up to see what the yield is on their security. Yeah, like you're getting 11.8% yield to hold some paper. That's a due in 2029. There's no shortage of yield clippers that would mind a few percent of that in their portfolio. And he's printing stock to pay that coupon. And that's what Michael Seller, who long before he would sell Bitcoin, because that would be a total complete failure of the entire strategy. He would print shares of AMC and say when Bitcoin goes to 10 million, it's not going to matter what you do with Shenzhen's. That's what I think. It's one of the most interesting market situations on the board. I follow very closely. If for no or the reason I look at a weird way, I admire him because he is going all in with conviction on something that he believes he has an edge on. Now, it's a shareholders money. I'm sure he's a big shareholder. I haven't looked. I know he had been selling for a while. But he is an interesting person. And all hard of the beliefs what he's doing. And so good for, you know, capital markets, free markets, as long as everyone's aware of the risks in their",
    "start_timestamp_seconds": 1037.8,
    "end_timestamp_seconds": 1128.16,
    "start_timestamp": "17:17",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1037",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "a big shareholder. I haven't looked. I know he had been selling for a while. But he is an interesting person. And all hard of the beliefs what he's doing. And so good for, you know, capital markets, free markets, as long as everyone's aware of the risks in their portfolio disclose, which, again, I give them full credit for. They are incredibly well disclosed. Go ahead, knock yourself out. It's interesting. When you see valuable below nav, wouldn't that inferred some sort of decreased interest in the underlying? Probably speaking, microstrategy is a closed ETF, right? And they always trade against discounts in the nav. And so what was unusual is that it was trading for a premium to now. And given his strategy, he was smart to sell as much stock as he could because if you want to own Bitcoin, that means your stock is over in price relative to Bitcoin. And so you've sell stock and buy Bitcoin. He closed his own arm. What did he do? But yeah, close then ETFs tend to trade for significant discounts. We saw this with the Sprat, your A&M ETF for a while. We saw this with, well, with the various hedge funds that went public like Bill Actman's Fund, I believe trades traded at us and even began discount at one point. I don't know what it's doing today. But when you can't, you know, force the arbitrage, then you tend to get a discount. And so this",
    "start_timestamp_seconds": 1109.36,
    "end_timestamp_seconds": 1202.36,
    "start_timestamp": "18:29",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1109",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "the various hedge funds that went public like Bill Actman's Fund, I believe trades traded at us and even began discount at one point. I don't know what it's doing today. But when you can't, you know, force the arbitrage, then you tend to get a discount. And so this is a more natural outcome. But it does limit his financial flexibility to buy more Bitcoin. Hmm. Well, can't wait to see how the stack goes. We're all going to get a front row seat to it. I mean, I don't know how it could go any other way than what we've laid out. But what do I know? I mean, markets are funny sometimes. Yeah. And if you look across the market, what else just generally sticks out to you. I imagine there's got to be some interest on the energy side or even the commodity side. Yeah. I'm amazed at how so few people realize that the long term price of all commodities, long term real price of all commodities is lower. We still get people pushing this whole peak cheap oil nonsense. We've laid it out in article after article after article and we've had a pretty good run of mostly well grounded predictions that pan out back to sort of developing a energy and energy management. And that's why people pay to subscribe to us. But like just take for example, the oil to gas ratio in the U.S. That number blew out to 55 when",
    "start_timestamp_seconds": 1182.36,
    "end_timestamp_seconds": 1277.32,
    "start_timestamp": "19:42",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1182",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "good run of mostly well grounded predictions that pan out back to sort of developing a energy and energy management. And that's why people pay to subscribe to us. But like just take for example, the oil to gas ratio in the U.S. That number blew out to 55 when we wrote a piece called generational arbitrage and on an energy content basis. The ratio of the price of oil expressed in barrels divided by the price of natural gas in dollars for moving BTO. That ratio should be around six. The traded up to 55. We pointed that out. I said this has to close. We did a follow up when it dropped down to 25 said this might even go below six eventually. And here we are today as we're talking it's trading at 12. So Henry Havana natural gas times 12 is WTI oil today. And we still think it has further go. That's because physics is a great edge generator. Physics says that key to seat things that do the same thing can't self or different prices. And definitely investments will be made to close that arbitrage. Especially when it widens out an anacrisprint like that. You know, 55. A ratio of 55 when energy says it should be six. And we're seeing that play out all year slowly grinding. You know, we see that we've called on your show several times I believe that the equilibrium price of oil is 55. And here we are,",
    "start_timestamp_seconds": 1257.36,
    "end_timestamp_seconds": 1347.32,
    "start_timestamp": "20:57",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1257",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "You know, 55. A ratio of 55 when energy says it should be six. And we're seeing that play out all year slowly grinding. You know, we see that we've called on your show several times I believe that the equilibrium price of oil is 55. And here we are, you know, peak oil still decends away like fusion and oil trading in the high 50s. Maybe 60 for WTI. You can see where this has to go. And yet people are blind to it. So for example, every historical market indicator that crude oil traders, you know, retail partners like me and you would use is invalid now because they're all backwards looking and they don't correct for technology. And in the US or in gas are produced together now. And so you have a classic byproduct situation, which again. People say, oh, what's the break even price of crude oil on the permit and our answer is you there is not. You have to know the price of gas too because they're both produced at the same time. If it was $10 million a million B2 natural gas, the break even price of crude oil on the permit would go negative. Because they'd give it away just like they do with natural gas now. They produce them both at the same time. And so once this glut of natural gas in the permit gets on stock and it will because all arbitrage is closed, you could see a",
    "start_timestamp_seconds": 1329.32,
    "end_timestamp_seconds": 1407.32,
    "start_timestamp": "22:09",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1329",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "would go negative. Because they'd give it away just like they do with natural gas now. They produce them both at the same time. And so once this glut of natural gas in the permit gets on stock and it will because all arbitrage is closed, you could see a real headwind to oil. Because you have all this extra oil now that you're producing when you're producing a natural gas for AI, for example. That's a real threat to the long term price of oil. So the commodity markets have actually been pretty boring because they're well supplied and commodity markets are boring when they're well supplied and the price goes lower. If you doubt our view that the long term price of all commodities is lower just plot any of them announces a goal. And see for yourself. So you know, I probably the most exciting market this year besides AI and crypto of course has been precious metals and gold. And so we watch that pretty carefully too. On those there's obviously been a meteoric price in golden silver and it's interesting because sometimes there is like a clear catalyst. Sometimes there's not sometimes it's a bunch of different things that cause a move but one thing I've found so far, especially with metals is there really isn't like a well accepted consensus that I've come across in terms of why the most happening. And you guys haven't opinion on that depends on the two metals of",
    "start_timestamp_seconds": 1396.32,
    "end_timestamp_seconds": 1485.32,
    "start_timestamp": "23:16",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1396",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "of different things that cause a move but one thing I've found so far, especially with metals is there really isn't like a well accepted consensus that I've come across in terms of why the most happening. And you guys haven't opinion on that depends on the two metals of course because I think they are different markets. And we follow gold much more closely than silver just and full disclosure. But in the silver market it seems like we're having a classic sort of squeeze on physical and some people are standing for delivery and silver is being moved around the world and getting a little funky and you know squeezes can be very profitable if you're long. Not so much if you're short but at the same time they tend not to persist the supply the fundamental supply demand for silver. You know especially if sold is going to struggle under Trump. It seems seems to me the long term not super bullish but you know it's trading about 58 today. Good for my friends who are long it. I'm going to the different story I think gold is systematically replacing or at least displacing part of the demand for US treasuries as a neutral reserve assets. Driven by mostly the sanctions war and the freezing of the Russian or reserve assets which has. Now for much of the world made those debt instruments no longer neutral if the political wins of a US president and can can",
    "start_timestamp_seconds": 1468.32,
    "end_timestamp_seconds": 1552.32,
    "start_timestamp": "24:28",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1468",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "demand for US treasuries as a neutral reserve assets. Driven by mostly the sanctions war and the freezing of the Russian or reserve assets which has. Now for much of the world made those debt instruments no longer neutral if the political wins of a US president and can can basically. Allow them to default in their debt obligations by not giving you your money back which is what this is. Then they're no longer neutral. There the political weapon of. Western leaders and we happen to have a pretty volatile leader in the White House today. Love a merciless. Nobody would doubt that he's he's is call options on Trump would be expensive if you know what I mean. And so the neutrality of US treasuries or you know European debt has been erased. I think that was a catastrophic blunder that history will recognize as such in due course. And gold in order for it to play. And so the role as a neutral reserve asset needs a bigger market cap than it had. Who knows where it goes from here. One of the questions we we ask ourselves Eric is who gets hurt if old if gold goes higher. The US would want gold to go higher because they could revaluate their gold and free up a lot of room for Scott best into maneuver. People who own it don't care if it goes up. Who cares if it goes to 10,000 or 20,000 or 50,000. In",
    "start_timestamp_seconds": 1534.32,
    "end_timestamp_seconds": 1628.32,
    "start_timestamp": "25:34",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1534",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "goes higher. The US would want gold to go higher because they could revaluate their gold and free up a lot of room for Scott best into maneuver. People who own it don't care if it goes up. Who cares if it goes to 10,000 or 20,000 or 50,000. In a way. And so not calling for those prices but gold gold initially metal and I think it is. You know almost exclusively driven by. The shock and reverberations of the sanctions mortgage for us after the war in your cranes started in 2022. Speaking of the war in Ukraine. What do you think? You know, wars are hard to lose. We've been on here several times with you and we've had a bit of a. Outlier opinion, but I think that opinion is proving to be. Mostly correct the winning side isn't suing for peace, you know. And so all of this talk about ceasefire on the freeze the lines and you know all that stuff rush of course is brushing all that aside. What I find fascinating is. Trump's inability. Well, let me say it this way. It seems to care an awful lot about the opinions of people who obviously hate him. Which is a fascinating thing. So the European leaders hate him. Starmers leadership team came over here and campaigned for Harris. The neocons and Washington hate him. And yet whenever he gets close to a deal with Putin he gets talked out of it by",
    "start_timestamp_seconds": 1606.32,
    "end_timestamp_seconds": 1696.32,
    "start_timestamp": "26:46",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1606",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "people who obviously hate him. Which is a fascinating thing. So the European leaders hate him. Starmers leadership team came over here and campaigned for Harris. The neocons and Washington hate him. And yet whenever he gets close to a deal with Putin he gets talked out of it by a combination of the European Zelensky and in the neocons and perhaps he doesn't feel he has the political power to just say. That is a wash of my hands. Good luck. With the war, but don't get caught, wasn't peach cover you crane like. There's no great fondness for Donald Trump, I bet you. Zelensky certainly based on the White House meeting. You know, where he advanced gun and do it. He certainly has no love. Lost for advanced. And so I it is a fascinating situation. I don't know what Kushner and and Woodcoff are bringing to Moscow on this trip because it sure seems like. the Europeans and Ukraine have rejected this 29 point police plan or whatever is floating around. And Russia is just slowly doing what Russia does, which is the grinding war of attrition, moving slightly from west to east every day, a new village, a new strong point. They have more people than Ukraine, they have more weapons than Ukraine, they have more money than Ukraine, they have more energy than Ukraine, and they're just going to grind away into the achieve their objectives. And so I think we're at this point where",
    "start_timestamp_seconds": 1679.32,
    "end_timestamp_seconds": 1761.6,
    "start_timestamp": "27:59",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1679",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "village, a new strong point. They have more people than Ukraine, they have more weapons than Ukraine, they have more money than Ukraine, they have more energy than Ukraine, and they're just going to grind away into the achieve their objectives. And so I think we're at this point where we wrote a piece a couple of weeks ago, you may have seen it called forcing function. But I think ends the war as Ukraine is broke. The real dagger to Ukraine was when Trump stopped the money train, and Europeans can't afford it. I think they're running 100% budget deficit there, they're taking in half in taxes, then what they need to spend, 140, 150 billion dollar whole, over the next couple of years. And that nobody wants to pay it. Certainly Europe's not going to pay it. There's no political support to pay it in the US. That's going to drive what I think will be a hyperinflationary crisis soon. And that will collapse. Ukraine's ability to stay in the war and they will have to sue for peace on warstorms. Then there seem to be on offer here. Last point I'd say, impossible to know what's really going on. So much propaganda, so much misinformation. Europeans in particular flood the field with it. We read everybody's propaganda. I'll tell you without hesitation that the worst in the world is the British propaganda. It is unbelievable how much garbage comes out of the British mainstream press, over lies,",
    "start_timestamp_seconds": 1746.56,
    "end_timestamp_seconds": 1834.8,
    "start_timestamp": "29:06",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1746",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "going on. So much propaganda, so much misinformation. Europeans in particular flood the field with it. We read everybody's propaganda. I'll tell you without hesitation that the worst in the world is the British propaganda. It is unbelievable how much garbage comes out of the British mainstream press, over lies, you know, total manipulations. The British people are soaked in propaganda. Anytime we comment on this, we'll often get an angry subscriber or listener, Senate and email. And inevitably, they're from the UK. Because our views are so different than what they see every single day in the newspaper on television that it's just they can't believe that somebody recently while educated would hold our views. When you read everybody's propaganda, you have a far better chance of understanding what's really going on. What do you think of the perspective that the fact that the war really hasn't come to an end yet is actually positive for Ukraine if Russia wanted to like really impose its will? It seemingly could, but hasn't. Yeah, we just put a doomsday on this called World War 3, how we got here and where we're going. I forgot about doomsday. I just didn't have that so much. We love it too. It's a great, great little side business. It's all set on on it. Yeah. That was like a 50-minute presentation where we walked through, you know, from the year 2000 to the war in Ukraine and then the war in Ukraine and then",
    "start_timestamp_seconds": 1810.72,
    "end_timestamp_seconds": 1911.44,
    "start_timestamp": "30:10",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1810",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "that so much. We love it too. It's a great, great little side business. It's all set on on it. Yeah. That was like a 50-minute presentation where we walked through, you know, from the year 2000 to the war in Ukraine and then the war in Ukraine and then where we're going, which we believe is multiple wars in the Western Hemisphere. It's a gift to the punchline. So even the way the war is described is wildly different. So in Russia, Putin and his leadership described as a special military operation. They have not gone formalization. One of Putin's objectives seems to be minimal disruption of the everyday life of Russian citizens. We have friends who know people in Russia and they tell us that to those people not much has changed. Yes, it's not my tunnels anymore. It's got a slightly different name, but there's still hamburgers there and you know, they still have, it's not Starbucks anymore, but they still get very good coffee, served by the same people. And if you read Russian propaganda and we do, rather well, then I read Ukrainian propaganda too, you will find contrary to what people believe in the West, open and sometimes harsh criticism of Putin for not being aggressive enough in the war in Ukraine. Being too worried about, you know, is Donald Trump somebody could even kind of deal with, let's just finish this thing militarily. Let's pull up another million soldiers. Let's go full war",
    "start_timestamp_seconds": 1893.76,
    "end_timestamp_seconds": 1984.96,
    "start_timestamp": "31:33",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1893",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "West, open and sometimes harsh criticism of Putin for not being aggressive enough in the war in Ukraine. Being too worried about, you know, is Donald Trump somebody could even kind of deal with, let's just finish this thing militarily. Let's pull up another million soldiers. Let's go full war footing and he has resisted that. And in fact, if there weren't to be a regime change in Russia, it would come from the right. And you would get somebody like a Medvedev instead of a Putin who is either play acting or, you know, is doing his best Trump in personation on Twitter. But there's a strong feeling in Russia that Putin is playing this too slow and it's coming at the expense of Russia. And that, in fact, the red line that was crossed in November, when Long Range, Western Basimists was relaunched into 32014 Russia. He was muted in his response and anticipating the Trump would soon return to office and that Trump was summoned with whom business could be done. And so all this talk about, you know, Thama Hawk missiles kind of put Putin in a bind domestically. And that's why he came out publicly and said that the response to such a escalation would be a quote overwhelming, which is unusual for him to say. Now, if you're Ukrainian, none of this sounds familiar to you because you're living under bombardment. Your energy sector has been severely damaged. Your thermal water systems, which are",
    "start_timestamp_seconds": 1963.12,
    "end_timestamp_seconds": 2050.88,
    "start_timestamp": "32:43",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=1963",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "and said that the response to such a escalation would be a quote overwhelming, which is unusual for him to say. Now, if you're Ukrainian, none of this sounds familiar to you because you're living under bombardment. Your energy sector has been severely damaged. Your thermal water systems, which are critical for for winter heating happen, you know, severely damaged. Again, we think this is obvious war crimes. The, you don't need to attack the heating system of the civilian life in Ukraine to achieve a war aim. But nonetheless, all wars are basically criminal in our view, which is why we're so violently opposed to them. But nonetheless, you know, the way in which Putin describes the war versus, I remember in the early days because, you know, we were kind of critical of John Kerry. He was a climates Arab back then in the early weeks of the war. He was openly worrying about the climate impact of the war, which was seemed rather silly. But he said, you know, the last end of the European media describes this as a quote, unprovoked total war of aggression. And so if you think this is an unprovoked total war of aggression, then the relatively slow grinding move from West to East that Russia has achieved seems like stalemate, seems insufficient relative to the disparity between the two powers. If you're Russia, you're trying to liberate these four regions. That's the language they use, not my language. And they've got",
    "start_timestamp_seconds": 2033.52,
    "end_timestamp_seconds": 2125.6,
    "start_timestamp": "33:53",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2033",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "of aggression, then the relatively slow grinding move from West to East that Russia has achieved seems like stalemate, seems insufficient relative to the disparity between the two powers. If you're Russia, you're trying to liberate these four regions. That's the language they use, not my language. And they've got 100% of one and 80% of another one and 75% of the other two. This of course is, you know, the Dombas, which is two regions, and then Kersan and Saperhorja, I've never thought I would learn these places on the map, but because we follow the war every day I've come to. And so if it is a special military operation with a limited deployment of treasure and blood. And every day the field tilts ever more into your favor. The belief inside of Russia is of course that wars of attrition are one suddenly. And the Ukrainian army is by many reports nearing exhaustion. Fighting heroically, the biggest victims in all of this are the people of Ukraine. I mean, let's be the honest, that country will emerge from this crisis destroyed, which is one of the great tragedies of our time for sure. But again, the propaganda, you have to sort of read all sides. Lastly, I'll say, next time there's a big global world-beating news story, you know, like that dominates the global headlines. The great exercise is to read how eight different countries are framing it. You'll never look at the news the same way",
    "start_timestamp_seconds": 2106.16,
    "end_timestamp_seconds": 2197.04,
    "start_timestamp": "35:06",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2106",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "you have to sort of read all sides. Lastly, I'll say, next time there's a big global world-beating news story, you know, like that dominates the global headlines. The great exercise is to read how eight different countries are framing it. You'll never look at the news the same way again. So read how China frames it all Israel frames it all Iran frames it Russia, Ukraine, Britain, US, Canada, Mexico. To take aid countries, go read the English language version of their most popular newspaper and see how they're covering the story and your mind will be blown. You will then have a visceral appreciation for the bath of propaganda that we're all swimming in. It's a really curious opinion and I appreciate you going into the nuance of it just because it seems like if Russia felt confident enough in their ability that we would have more of a Crimea where happens, it's done and then they get what they want, they move on. So, obviously, yeah, I've slightly different perspective on how it's going out, but that's rather humor there. Let me explain that because Crimea is a 90% Russian, right, voted as we said in this. So the first thing that we try to do when we analyze situations that are steeped in propaganda is let's find some indisputable data that everyone agrees is not manipulated. And so for this, the data we said along was the results of the 2010 election in Ukraine by region.",
    "start_timestamp_seconds": 2180.08,
    "end_timestamp_seconds": 2269.44,
    "start_timestamp": "36:20",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2180",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "So the first thing that we try to do when we analyze situations that are steeped in propaganda is let's find some indisputable data that everyone agrees is not manipulated. And so for this, the data we said along was the results of the 2010 election in Ukraine by region. And there were two candidates in that election. One was pro-Russian and one was pro-European. This was the great debate I read with fascinating interest over the weekend, a 2014 article published in the Washington post by none other than Henry Kissinger. And when you read that article, it's pretty fascinating. He's pretty present. Crimea historically is Russian, 75 or 80% of the people that live their speak Russian, they voted in huge waves for the pro-Russian candidate. And on the other side of the country, they were voting 90% for the pro-European candidate. So when you look at that map of outcome by region, heat map, red, Russia, blue, Europe, it looks like a country on the verge of civil war. Now, Crimea, they were welcomed and then between 2014 and 2022 Ukraine, with NATO's help, built the whole bunch of fortifications along the other four regions. And these are the formations that Russia is fully grinding through today, whereas Crimea did not have such fortifications. And the Russian army was mostly welcomed. And so that's the big difference I think is the time between 2014 and 2022 at eight years to build up an army, to build up",
    "start_timestamp_seconds": 2258.0,
    "end_timestamp_seconds": 2342.96,
    "start_timestamp": "37:38",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2258",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "are the formations that Russia is fully grinding through today, whereas Crimea did not have such fortifications. And the Russian army was mostly welcomed. And so that's the big difference I think is the time between 2014 and 2022 at eight years to build up an army, to build up fortifications, to inject a bunch of weapons into Ukraine. There was a civil war in the Dombasins, as I'm sure you know, before 2022, there was shell and going on. And they tried to separate. And there were violence on both sides. And civil wars are messy. And I'm not making a judgment call. I'm just observing that there was a civil war going on. And so in those eight years, Crimea, if Russia had wanted to go into the other regions as well, I think they would have found it a much easier thing back in 2014 than it is today. And again, if you're Putin and you're worried about minimizing your casualties, then certain way to go about things. So, that's right. Yeah, which is interesting, because I find the ultimate irony is the longer it goes on actually overwhelmingly the more casualty they face. There are arguments in the Russia. Yeah, it's actually like, let's just rip the bandade off. Right. You're actually articulating the argument on Putin's right. Well, yeah, I think if it just in context of the decision making cycle, because at least the way that I look at it, there's likely a series",
    "start_timestamp_seconds": 2323.92,
    "end_timestamp_seconds": 2409.92,
    "start_timestamp": "38:43",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2323",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "in the Russia. Yeah, it's actually like, let's just rip the bandade off. Right. You're actually articulating the argument on Putin's right. Well, yeah, I think if it just in context of the decision making cycle, because at least the way that I look at it, there's likely a series of reasons why Russia and specifically Putin hasn't come in heavy handed. He's not a soft guy. I don't think he's looking at this. Like, let me try to do this with a soft touch that's never been a style. So, to me, if there was an overwhelming capability to do this entire war in a week, even if it's a bloody week, it will still be way less bloody than years of this thing going. So, to me, the fact that he hasn't done that is actually very, very telling in terms of his perception of his position. Well, I think he also, sorry, God. I was just going to summarize with, I think if he thought he could get away with it, he would. So, I think you're forgetting a couple of things. Yeah. Russia has a huge military industrial complex, just like the US, and there's probably a whole bunch of people in Russia who've gotten very rich from this war. And when you're in the bomb making business pieces of working capital problem, just like Ukraine, just like the US, there's probably a significant amount of corruption in Russia. Bomb is a rich person, sorry, wars",
    "start_timestamp_seconds": 2394.48,
    "end_timestamp_seconds": 2479.36,
    "start_timestamp": "39:54",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2394",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "a whole bunch of people in Russia who've gotten very rich from this war. And when you're in the bomb making business pieces of working capital problem, just like Ukraine, just like the US, there's probably a significant amount of corruption in Russia. Bomb is a rich person, sorry, wars of its person's racket, man. Like, you know, there's an enormous amount of money being made in the US, in Europe, and in Russia over the war. And it's mostly being fought in former Ukraine, in territory, not in pre-14, pre-2014, Russia. And so, you know, there's entire industries that have been spooled up. Tax payer money has been funneled towards it. And like you said, I'm doubted the many fortunes being made on, unfortunately, on the backs of the soldiers who are actually fighting and dying for this war. And so that's just one of the tragedies of life. Like, look, what's going on with Venezuela? Like, okay, we're not going to do Ukraine anymore. We've got to keep the name concept. So, let's go get a war going, you know, in the Western Hemisphere. It's hard not to be cynical, but such a mental model works. And, you know, if it works, it predict future events, then that's a useful one. Yeah, it's super interesting. One, one last question on that, then I, I want to pivot to something else. But if you think it's about money, which don't disagree, war obviously is a massive, massive revenue generator.",
    "start_timestamp_seconds": 2459.68,
    "end_timestamp_seconds": 2548.8,
    "start_timestamp": "40:59",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2459",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "know, if it works, it predict future events, then that's a useful one. Yeah, it's super interesting. One, one last question on that, then I, I want to pivot to something else. But if you think it's about money, which don't disagree, war obviously is a massive, massive revenue generator. Then why, why this structure for this war? I mean, realistically, they could have had an even easier time executing a similar strategy in Crimea, even though Crimea itself is a populace was more welcoming. That doesn't mean Ukraine is a country was willing to just let them go. So, they could have waited for resistance and then spark a war there to, you know, drive revenue for a while, probably on an easier structure, because it's not as defensible. So, they could equally as slow. So, this, if we go a little bit deeper into the sequence of events, when the war first started, Russia made huge moves. Sorry, just the current one, not Crimea. Yes, the current one. Yeah, the 20, 20, you know, soldiers outside of Kiev, you know, a Zelensky kind of panic. There was a deal on the table. There was negotiated in Istanbul. It was initial by both sides. Who knows the full history, but as it's told now, Boris Johnson famously, Flutikiev and Tosolinsky, not the sign that the ill in that NATO would would give Ukraine all the weapons it needs to inflict their quote strategic defeat on Russia. So, I think",
    "start_timestamp_seconds": 2528.88,
    "end_timestamp_seconds": 2626.8,
    "start_timestamp": "42:08",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2528",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "was initial by both sides. Who knows the full history, but as it's told now, Boris Johnson famously, Flutikiev and Tosolinsky, not the sign that the ill in that NATO would would give Ukraine all the weapons it needs to inflict their quote strategic defeat on Russia. So, I think Putin was surprised at the scale of the military supplies and other assistance being fed to Ukraine. And so, Russia moved very far very quickly and then it got pushed back quite far, actually. And 22, 22, 23 was about Ukrainian counteroffences. And in late 2023, the large, Ukrainian counteroffensive was defeated by Russia that failed. And then since then, because I follow these maps every day, it's been a slow grinding one way traffic from West to East, where a war of attrition has been fought. But I think Putin, you know, in Russia, this is what they tell themselves. We are at war with 27 member states of NATO. Now, as we said in our Zoom Zoom, not all the best weapons were sent, but they were sent in volume hundreds of buildings, weapons were sent, challenger tanks, Abrams, you know, F-16s. Of course, not the F-35s, but F-16s. Yeah, you name it. Pretty good, steady there at weapons were sent in volume. And lots of quote-unquote mercenaries fighting over there. And, you know, and so on. But you're never going to win a logistics war against Russia from over here, especially when your logistics depends on China",
    "start_timestamp_seconds": 2608.4,
    "end_timestamp_seconds": 2707.76,
    "start_timestamp": "43:28",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2608",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "F-16s. Yeah, you name it. Pretty good, steady there at weapons were sent in volume. And lots of quote-unquote mercenaries fighting over there. And, you know, and so on. But you're never going to win a logistics war against Russia from over here, especially when your logistics depends on China as much as it does. And China's clearly picked its side in this conflict that is feeding enormous amount of resources to Russia, helping withdrawums. We don't doubt for a second that Russia is sharing everything it's learned about these NATO weapons systems with China in anticipation of a potential conflict in Asia. And so there's a, it is absolutely true that Ukraine is fought heroically. They had enormous assistance from the West. All the in 400 billion euros is when you add it all up. There's a lot of money here. And, you know, Russia has large of an economy as it is and has a commodity powerhouse as it is. Still had to spool up, had to re-orient it is just now cranking out drones. You know, they say a thousand a day by the end of the year of these large Geron drones. I guess they're called that. And so what we're seeing now is an attack on Ukraine's energy grid, the likes of which we haven't seen an attack on the thermal water grid. And attack on the realm that work. And so it is again, sad. By the way, I wish, for example, that the",
    "start_timestamp_seconds": 2685.6,
    "end_timestamp_seconds": 2773.52,
    "start_timestamp": "44:45",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2685",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "that. And so what we're seeing now is an attack on Ukraine's energy grid, the likes of which we haven't seen an attack on the thermal water grid. And attack on the realm that work. And so it is again, sad. By the way, I wish, for example, that the Istanbul Agreement had gone through and were at this scale and for this length of time could have been avoided. Back then it was just two regions. By the way, who gone some Doness that the two regions that make up what people call the Dombas and now it's four. And the Russians say that, you know, if they conquer the four and Ukraine still keeps fighting, then it would be six would be eight and they'll eventually just take everything to the west of the Nipur river, including Kiev. I doubt they can do that. And without going full mobilization, like you know, I talked about earlier, but that's what's being set amongst each other in Russia on Russian television and Russian newspaper. It's incredible. Like the whole thing is absolutely fascinating. It's a really, really interesting play on a lot of human factors, which in obviously the cycle of wars just everything. So, yeah, look, I- I- I- If the first Gulf War was the first television war, this is the first internet war. And that's the thing that's amazing about this war is you and I, it's been an hour of day going through open source of",
    "start_timestamp_seconds": 2756.56,
    "end_timestamp_seconds": 2838.0,
    "start_timestamp": "45:56",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2756",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "of wars just everything. So, yeah, look, I- I- I- If the first Gulf War was the first television war, this is the first internet war. And that's the thing that's amazing about this war is you and I, it's been an hour of day going through open source of intel and see what's going on, satellite images. So there's all these mapping projects, that are trying to map the line of combat contact. And there's three variety of of them. There are those that come from Ukraine, most famously deep state, for example. There's plenty of Russian mapping projects. And then there's a few that try to be neutral. And the thing is they all kind of self-check each other because you can't be too far off the consensus, otherwise everybody knows what your bias is and that you become an unreliable project. And so you could Google Deep State map and you could, you know, do a time series as a, all kinds of time series of the map. And there's one on YouTube, which I'll pull up, you know, if we keep talking about this. But there's one that puts a daily map of the entire war from 2022 to today at once a month. So look, December one, we'll come out on December 1st. And you could just see, you could follow the initial wave of Russia going in and then slowly beating back by the Ukraine's and then it stops and then it stays pretty",
    "start_timestamp_seconds": 2821.52,
    "end_timestamp_seconds": 2898.8,
    "start_timestamp": "47:01",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2821",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "from 2022 to today at once a month. So look, December one, we'll come out on December 1st. And you could just see, you could follow the initial wave of Russia going in and then slowly beating back by the Ukraine's and then it stops and then it stays pretty steady for a long time. And then now it's starting to move back. And these are the sort of consensus views of all three sides. And so it's kind of hard, like when you see what's going on to then not read propaganda for what it is. And so you can find all main earth stuff. Now that doesn't mean that it will be true. You have to develop sources that you begin to think are reliable and trust over time. But even bad propaganda is good in tell. What the British are telling themselves is a day of point, especially if you've become skilled in the art of reading their propaganda. And so this is where we are. I think my, our view still is that there is no negotiated settlement. This will be settled militarily. Terms will be dictated. And one side will capitulate. Probably pretty obvious we think that cycle B. But there's no world in which Putin is going to compromise. There's a let's he could accept Putin's demands. And so when you have still make like that, then you just as Trump says have to let them fight it out. Well, the like I always",
    "start_timestamp_seconds": 2885.84,
    "end_timestamp_seconds": 2964.72,
    "start_timestamp": "48:05",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2885",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "think that cycle B. But there's no world in which Putin is going to compromise. There's a let's he could accept Putin's demands. And so when you have still make like that, then you just as Trump says have to let them fight it out. Well, the like I always really appreciate your perspective and thank you for exploring it with me. The definitely differences in general nuances. But I think the general consensus pretty aligned that war is hell. So oh yeah 100%. Look at we are wildly anti war for this very reason. Who wins in this war? Nobody wins the Russian stone. You crane insertly don't win. The West doesn't win. You know, Europe is bankrupted itself. US, you know, neutral reserve assets status has been severely damaged. I mean, there's no winners in this. So Russia gets to occupy four regions that have been bombed out. Okay. Now they got to spend to rebuild those. The winners, of course, of the military and industrial complex and all the people that make money by building bombs. But you know, don't count me amongst them. Depending on how the war concludes regardless of, you know, the way we arrive there. What would your opinion then be on gas going from there? Natural gas? Yeah. The real-time price of all-commonity. The long-term real price of all commodities is lower in gases. No different. We arrive at our equilibrium price of oil of $55 by taking $10 land at LNG.",
    "start_timestamp_seconds": 2947.6,
    "end_timestamp_seconds": 3042.8,
    "start_timestamp": "49:07",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=2947",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "arrive there. What would your opinion then be on gas going from there? Natural gas? Yeah. The real-time price of all-commonity. The long-term real price of all commodities is lower in gases. No different. We arrive at our equilibrium price of oil of $55 by taking $10 land at LNG. It's under that today now in Europe. Gases cheap. LNG is still more expensive than pipeline gas. But long-term gas gets cheap in real terms. Always. As more and more pipelines are built and midstreamers reduce the friction of bringing gas to market. Supply is basically infinite. And so yeah, lower. I mean, we're pretty much at equilibrium price now. LNG can't go much lower than here. And people in the supply chain still make money. And so that's kind of a, you know, we might punch through this floor. But then if you go low enough, that might be a buying opportunity because it has to come back to the equilibrium price. We we arrive at that equilibrium price by saying, you know, $4 million in BTO and the US is great for local drillers. And then tack on six bucks to get it from there to Europe. And you get 10 everybody earns their cost of capital at that price. And so that's how we arrived at our 55-dollar equilibrium price for oil that I mentioned earlier. And that's been a pretty reasonable, you know, physics-based market edge to have in the back of your mind. Makes sense.",
    "start_timestamp_seconds": 3023.68,
    "end_timestamp_seconds": 3110.8,
    "start_timestamp": "50:23",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3023",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "you get 10 everybody earns their cost of capital at that price. And so that's how we arrived at our 55-dollar equilibrium price for oil that I mentioned earlier. And that's been a pretty reasonable, you know, physics-based market edge to have in the back of your mind. Makes sense. And I want to be thoughtful of your time. I have one more question here. Looking out at 2026, it seems now more than ever and increasingly so at energy continues to be center stage. And obviously, your guys' work is primarily all trickles back to energy. But if you look out over 26 of their any surprises that you expect might come with respect to energy. Yeah, I see the political revolutions all across Europe in the aftermath of the war, assuming the war comes to an end. Wars are hard to lose. Europe went all in. When you go all in and you lose, you have to suffer the consequences. I could see political revolution in Germany for sure, perhaps the collapse of the EU itself. No air in the world is there a more sorry batch of political leaders without skill than in the European Union. And I would include Britain in that regard. I think Britain, frankly, is a failed state. Could see civil war in Britain. It's coming pretty close to that. The it was just reading today on zero heads, it's somebody got arrested for posting a photo of themselves with a gun while",
    "start_timestamp_seconds": 3092.24,
    "end_timestamp_seconds": 3191.6,
    "start_timestamp": "51:32",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3092",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "I would include Britain in that regard. I think Britain, frankly, is a failed state. Could see civil war in Britain. It's coming pretty close to that. The it was just reading today on zero heads, it's somebody got arrested for posting a photo of themselves with a gun while they were in the US on social media. They went home and they were arrested. Did you know that Britain has arrested 12,000 people for online, hate speech they call it? Like this is not a free country anymore. You have a leader who's at 10% popularity that can't be out since they'll 29 except for them within his own party. They're drowning in debt, running big deficits. They brought in huge inflow of immigrants who were taxing the system as well. And so it's hard to see Britain, how Britain will emerge from 2026 will be interesting. Let's put it that way. So again, all depends on when the war ends. I think there'll be a huge reckoning. Once that war is over and what has actually been going on there becomes more widely known. This is a huge amount of propaganda. Of course, the thick and appropriate amount of the whole campaign. But watch watch Germany, political revolution in Germany, European Union itself. And then Britain we're mostly interested in Europe because of that's the biggest disruption to energy flows at cause the energy crisis that was ongoing when we emerged as doomburg. And so we always watch",
    "start_timestamp_seconds": 3169.36,
    "end_timestamp_seconds": 3259.76,
    "start_timestamp": "52:49",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3169",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "of the whole campaign. But watch watch Germany, political revolution in Germany, European Union itself. And then Britain we're mostly interested in Europe because of that's the biggest disruption to energy flows at cause the energy crisis that was ongoing when we emerged as doomburg. And so we always watch it very carefully. That's probably most interesting. Then the last thing I'd say is obviously 2026 is going to be the year of war in the Western hemisphere. But as well as just the opening act that I would see regime changing Cuba. These protests in Mexico have all the hallmarks of a Western NGO color revolution attempt on Mexico. Tensions with Colombia. We're about to see the Trump of Chile elected. May lay, of course, as in Trump's camp. So if you just go up and down, southern part of the Western hemisphere and bluntly put people into pro-trop and not pro-trom buckets. The not pro-trom buckets are going to be in force and tension. One quick follow-up on the amount of turnover and overall strife that you first see in Europe. You touched on it really briefly. I'm just curious if you could maybe double click one more layer. In terms of the impact that all of that turnover can have on the energy sector. So Germany could turn back on the remaining Nord Stream pipeline. Pipeline gas could flow through Poland again. For example, there's the weight Europe used to run was cheap energy from Russia, cheap",
    "start_timestamp_seconds": 3244.16,
    "end_timestamp_seconds": 3341.04,
    "start_timestamp": "54:04",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3244",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "layer. In terms of the impact that all of that turnover can have on the energy sector. So Germany could turn back on the remaining Nord Stream pipeline. Pipeline gas could flow through Poland again. For example, there's the weight Europe used to run was cheap energy from Russia, cheap labor from eastern Europe, and healthy export markets to China. All three of those are gone now, especially in Germany. So the way you pivot from where you are to where you were is to begin to go back in that direction. It's summing the Russians. We're willing to sell the energy to Europe, which is a whole different question altogether. So they could make fracking legal. They could stop destroying their nuclear power plants, mindlessly, and turn a few of them back on. They could, you know, the British could make drilling for oil and gas easier in the North Sea, and not tax energy companies at 78% marginal rates. These are all policy choices that are choking Europe. And when you have a political revolution, what happens is the opposite of those choices become the policy. And so that's why we're watching Europe so carefully. Because again, we in that presentation, we just showed, you know, the hydrocarbon production consumption numbers by select region, right? And the US is, well, North America is a net hydrocarbon exporter of significant size. So you just take coal natural gas in oil. How much does Mexico can in the US produce?",
    "start_timestamp_seconds": 3316.96,
    "end_timestamp_seconds": 3419.92,
    "start_timestamp": "55:16",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3316",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "in that presentation, we just showed, you know, the hydrocarbon production consumption numbers by select region, right? And the US is, well, North America is a net hydrocarbon exporter of significant size. So you just take coal natural gas in oil. How much does Mexico can in the US produce? How much does Mexico can in the US consume? That delta is what's available for export, coal, natural gas oil. Russia's a huge hydrocarbon exporter. Europe consumes 38 exigules. The hydrocarbons and only produces five, which is remarkable. You know, the southern part of the Western Hemisphere consumes 20 exigules and produces 22. So it's fine. It's balanced. The US is like plus 17 exigules, Russia's plus 2425. And so you can see just this gaping hole in Europe's strategic economic positioning. It doesn't produce itself. It doesn't produce itself. Actually, so it has to pay to cost a capital for everyone else who does. And you can't have heavy industry as we like to save. If you're not self-sufficient energy, you don't get to have nice things. The only really chance you have is to be super high-end like Taiwan is on semiconductor. So they're an energy vessel, but they're made themselves into Spencer, both of their global economy for now by being very, very good at producing high-end semiconductors and chips. And so it's in everybody's interest that Taiwan gets at hydrocarbons. And because they're so far on the high and the manufacturing that they can afford to",
    "start_timestamp_seconds": 3403.2,
    "end_timestamp_seconds": 3489.84,
    "start_timestamp": "56:43",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3403",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "they're made themselves into Spencer, both of their global economy for now by being very, very good at producing high-end semiconductors and chips. And so it's in everybody's interest that Taiwan gets at hydrocarbons. And because they're so far on the high and the manufacturing that they can afford to pay up, but you can't have steel plants and you can't make artillery shells and tanks and boats and planes when you're buying everything from China. Because China could turn it off as we're seeing with the rare earths. And it's just prohibitively expensive. And so steel is leaving Britain. Steel is leaving Germany. The auto industry is going to suffer a big time. The chemical industry in Germany's devastated. The BSF existed at the other end of a pipe of natural gas from Russia. Period. That's how BSF, one of the great chemical companies of the last 120 odd years were not longer. Definitely longer. They've been crippled by this. Chemical factory after chemical factories closing in Europe, those will never be reopened. You never get permits to reopen those. And some, you know, Europe will become, if it stays on the current course, a tourist attraction. A little more. Yeah, full-tower is kind of cool. Yeah, a lot coming. It's beautiful architecture, sure. But you got a mystery. You know, I mean, the thing, US listeners should be so grateful for the American oil and gas industry. It's actually the anchor of US geopolitical power going forward. It",
    "start_timestamp_seconds": 3474.16,
    "end_timestamp_seconds": 3571.44,
    "start_timestamp": "57:54",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3474",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "more. Yeah, full-tower is kind of cool. Yeah, a lot coming. It's beautiful architecture, sure. But you got a mystery. You know, I mean, the thing, US listeners should be so grateful for the American oil and gas industry. It's actually the anchor of US geopolitical power going forward. It worked for the shale revolution. The US would be in a world of hurt. There's some of it in Europe. But thankfully, we've crafted natural gas. If it's a climate, we have hundreds of co-generation facilities, which produce power and steam that form the foundation of a still, pretty successful manufacturing industry and the foundation for a rebirth of that industry that Trump is trying to execute. I have a list of notes for our next conversation, because that immediately gets me interested to talk about nuclear power and stuff like that. But I know that you have chicken things to do. Yeah, most of that got to take my afternoon nap. So. Yes. Well, you have a very specific, it's not, you put it lightly there. It sounds like yeah, I just like to take a nap. But like you have a very specific sleep cycle. So, yeah, it's not like a casual, this is like really important. Really to keep on the cycle. Yeah, it's it co-exist with our writing cycle, which as you know, it's hard to produce you know, 2,000 words, research write edit, publish, promote, and defend 2,000 words every four days. Means you have",
    "start_timestamp_seconds": 3542.56,
    "end_timestamp_seconds": 3638.8,
    "start_timestamp": "59:02",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3542",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "not like a casual, this is like really important. Really to keep on the cycle. Yeah, it's it co-exist with our writing cycle, which as you know, it's hard to produce you know, 2,000 words, research write edit, publish, promote, and defend 2,000 words every four days. Means you have to be pretty disciplined with your time. Mixing all of our podcast appearances. This is why we don't have a, we have a no meetings lifestyle where we just don't accept outside meetings and we other than podcasts and we just focus on feeding the beast, as we say, you know, wake up, show up, make the number go up and repeat. I love it. Thank you sincerely for sharing your perspective and taking the time to go through some of the nuances of this stuff. One of my biggest hopes for people that listen to our podcasts is exposure to different opinions ideas and how to think about the world. And I think you provide a really, really great framework. Sometimes people will get a little angsty about some of the takes, which to me is always, uh, they, they've missed the boat in that scenario. And they're focusing on the wrong thing. So, thank you for what you do. Yeah, two things real quick. Um, the only thing worse than being wrong in this business is having no opinion. Um, that's one. And two, we never get offended by, authentically held views play the express. And so, our,",
    "start_timestamp_seconds": 3622.48,
    "end_timestamp_seconds": 3704.8,
    "start_timestamp": "01:00:22",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3622",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "on the wrong thing. So, thank you for what you do. Yeah, two things real quick. Um, the only thing worse than being wrong in this business is having no opinion. Um, that's one. And two, we never get offended by, authentically held views play the express. And so, our, our brand ambition is that you will get our authentically held views and we will express them lightly. And if that anger is you, that's a you problem, not, not a me problem or, or an us problem. And so I really appreciate, you have me on always enjoy our discussions. You find everything at doomberg.com. Of course, um, look forward to the next one. And actually, I, I'll throw a link to your website below. You guys have a bunch of recent paper that you put out. I see war or three, cover up a thother, close loop. You guys have just absolutely been on a tear with a lot of these topics more recently. So, there would be a link to that for everybody. Is there any where else that you want to send anybody in addition to that? Yeah, we have a second sub-stack classics run aloud that a co-founder of Dumburgan, its editor and chief has started in September. Um, it's all about curating the best of literature and presenting it in this, the Dumburgan very, very high production value. Really brave stuff shows you the depth and breadth of our team as well. And you",
    "start_timestamp_seconds": 3688.56,
    "end_timestamp_seconds": 3764.16,
    "start_timestamp": "01:01:28",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3688",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 3789.0
  },
  {
    "video_id": "xFkLh7gIGVo",
    "title": "Doomberg: The Energy Revolution is Here | The Outlier Podcast",
    "text": "that a co-founder of Dumburgan, its editor and chief has started in September. Um, it's all about curating the best of literature and presenting it in this, the Dumburgan very, very high production value. Really brave stuff shows you the depth and breadth of our team as well. And you know, building a new social media platform from scratch has been fun and challenging and interesting and gives us a little bit of a throwback to when we first started doing the gorilla marketing around Dumburgan. Really great stuff. You can find it at the Dumburgan page. We have a tab for it. Or you can go to classics. Read aloud.subsect.com. Really great stuff. Thanks a lot. Appreciate the opportunity to talk to you soon. Beautiful. See you guys.",
    "start_timestamp_seconds": 3748.64,
    "end_timestamp_seconds": 3786.08,
    "start_timestamp": "01:02:28",
    "video_url": "https://www.youtube.com/watch?v=xFkLh7gIGVo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=xFkLh7gIGVo&t=3748",
    "chunk_index": 53,
    "word_count": 129,
    "upload_date": null,
    "duration": 3789.0
  }
]