[
  {
    "text": "What's up, everyone? Happy Monday. We're going to do a quick recap here. I specifically just want to take a look at CrowdStrike in GameStop in this video because we have the YouTube live session later today to drive into the broader markets because there's a lot going on for us to take a look at. So let's pivot away from all this noise and let's take a look at CrowdStrike first really quick. And boom, there it is. I had a short on in there today because it just gaped down and I did not see that getting better. It was a very basic thesis about it is basic as you could possibly get bad news. And with a gap down on top of that, it just looked like the sellers were coming out and they did. If you take a look at this volume candle behind my head right here, this volume candle was 90 sale volume. There was just nobody wanting to step in front of this thing and that's really what led to this big red candle all the way down. So this I surprised me a little bit. It looked like it was starting to mellow out especially because we had the candle come down. Touching the 200 is whatever I guess it's something I don't care so much about that. It's just the fact that there was a candle because what that tells me like this WIC because it tells me that people were",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "mellow out especially because we had the candle come down. Touching the 200 is whatever I guess it's something I don't care so much about that. It's just the fact that there was a candle because what that tells me like this WIC because it tells me that people were still selling selling selling and then sooner or later somebody started buying right. That's what moved it back up. So the fact that it went down here and then moved back up, it indicated to me that people might be willing to start buying this thing. And then today just nope, gap down all the way down and notice how little tiny this WIC is. This is just massive sale volume all day. Not a lot of people wanting to transact in there. So what does this mean? Well, this is why when I talked about this over this past weekend, I set two alerts to the upside and downside and I specifically said, I'll trade at either direction. I don't care. I still think this move is probably overdone when we finish getting the news. I think the reason why it's not overdone right now is because the market is still synthesizing the impact and the overall severity of things which clearly we don't have a firm grasp on just yet. So that's that interesting. Now let's pivot over to GameStop because there were a couple of people that hit me up today asking about a bunch of put",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "is still synthesizing the impact and the overall severity of things which clearly we don't have a firm grasp on just yet. So that's that interesting. Now let's pivot over to GameStop because there were a couple of people that hit me up today asking about a bunch of put volume in the stock and it looks like folks were seeing a lot of put sales is what they tell me. So I thought we could take a investigative look together and see what's going on in here. So let's dive right in. The first thing I noticed is we're still so range bound. We have this low over here, which is not using the WIC using the body. The body of this is somewhere around like 23 and a quarter, something like that. And then to the upside, again, just using the body is not the WICs. It's like 2850, something like that. So we're just so range bound in here. And we're seeing a little bit of life just in terms of upward pressure. But if you take a look at the candle today, it's still not super bullish. So it was 48 sale volume today. So what this tells me is that there are still people trying to fade this, but there are just a slight, slight edge in people wanting to buy it, which I do find interesting. I also find interesting that it crossed over slash under on the CCI. I'll get myself out of",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "this tells me is that there are still people trying to fade this, but there are just a slight, slight edge in people wanting to buy it, which I do find interesting. I also find interesting that it crossed over slash under on the CCI. I'll get myself out of the way real fast so you could see right there's the CCI. I don't care a ton again about technical analysis in this specific product because it is so different in how it behaves. I see people say all the time like, Oh, it respects this perfectly. And it's like, no, it doesn't man. Like it doesn't that's why it does this is because it does other stuff. So the main thing I'm trying to emphasize is when you're looking at something whose price behavior is not solely determined by whether or not people are valuing the company higher than they did yesterday, there are other forces at play. And it's important to acknowledge that because if the idea here is that you can run technical analysis in here, like standard technical analysis, like you're you're going to have a hard time. You're going to have a really hard time moving and playing with this thing because the other thing like just from a general price movement perspective, something to go from essentially all the way down here to shoot up to this. It's like that's an abnormal movement. It's what makes it so cool. So I would just encourage",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "moving and playing with this thing because the other thing like just from a general price movement perspective, something to go from essentially all the way down here to shoot up to this. It's like that's an abnormal movement. It's what makes it so cool. So I would just encourage people to keep an open mind when it comes to looking at the product. You'll see that I still overlay some level of technical analysis, but it's a sliding scale. If I'm trading something like this is compared to the indices, the weight that I'm going to apply on technical analysis is going to be completely different rightfully so because they behave very differently. So let's take a look at these options chains. The first thing I noticed is that volume today was heavy, but light. Here's what I mean. From an overall volume perspective, we're just under 200,000 contracts. That's relatively light for GameStop. It's heavy in the sense that this 200,000 call volume was opposed by just 46,000 puts. So really big call skew volume on the day, and we're back at it yet again with the majority of this being for this coming Friday. I've learned one of my favorite sayings that they use that you guys use in the the aid community, which I'm continually just loving learning about, but they'll say that it's always tomorrow. I actually love that so much. We use similar sayings in the military. We'll say things like the easiest day",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "of my favorite sayings that they use that you guys use in the the aid community, which I'm continually just loving learning about, but they'll say that it's always tomorrow. I actually love that so much. We use similar sayings in the military. We'll say things like the easiest day was yesterday and bullshit like that, but it reminds me of that, or it's just like it's always tomorrow because I mean, this is just a lot of volume for a seemingly quieter period. But again, that's what makes this thing so interesting is that a quiet period could be quickly not a quiet period. To prove that point and to provide the counter to my own statement there, this was a real quiet period. It had a high of 15, a low of 10, and it was just kind of training around in here. And then all of a sudden, it was no longer quiet, like pretty quick. So I understand that. Now again, the way I would structure my trades and a lot of stuff is very, very different, but that doesn't matter. So let's take a look instead at some of this open interest now where we're starting to see more call, oh, I building out still as a waste to go in order to get to like it's at least two times put a lie, right? So the put a lie on this right now is 37, I'm sorry, 371,000 compared to 622 K on the",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "starting to see more call, oh, I building out still as a waste to go in order to get to like it's at least two times put a lie, right? So the put a lie on this right now is 37, I'm sorry, 371,000 compared to 622 K on the call side. So this isn't the same ratio. We've seen previously when it starts getting like super, super bullish. Now let's take a look at the time and sales and see if we can find the series of put trades that people are talking about. People are saying that there's a bunch of like bullish put trades that come out. So the first thing I'm going to do is kill off these spreads. I don't really care to see spreads in this context. So I nuked those. The next thing is I'm looking at both calls and puts both buys and sales in here. And there are different ways we can filter this. So what I'm going to do is start by filtering and looking at just the put side to see if I can find where all these puts were coming in. So here's one block right here that I can see clear as day. So these, the market was 162 by 182. So this came technically towards the mid of that market, but it's closer to the bid side. So this tells me that looks like a sale that looks like somebody sold 847 of the 25 puts",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "I can see clear as day. So these, the market was 162 by 182. So this came technically towards the mid of that market, but it's closer to the bid side. So this tells me that looks like a sale that looks like somebody sold 847 of the 25 puts expiring into all that's what that looks like to me. And you can run through and do that kind of analysis all the way through here. So in this case, for the 26 July expiration, the 24 and a half puts, these look like somebody bought them because the market was 59 by 66. These came in at 66. That's looks like a purchase trade. Now again, the kind of syntax that thinkorswim uses if it's red, it's telling you that it likely was sold. And then if it is green, it likely was bought. So if we sort these by quantity to kind of see where the bigger trades came in, I don't see this giant sale volume that people were alluding to. I do see sales for sure, but I also see a lot buying of puts. So all I'm kind of pulling away with here is that this doesn't look conclusive to me either way that there is massive, massive, massive amounts of one or the other. It looks like a bit of a mixed bag. Now to get a cleaner view, we can take a look at something like this from our buddies over unusual whales,",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "this doesn't look conclusive to me either way that there is massive, massive, massive amounts of one or the other. It looks like a bit of a mixed bag. Now to get a cleaner view, we can take a look at something like this from our buddies over unusual whales, which they have a need or tool, right? It's just cleaner to see. And we can take a look. We want to see instances where we transacted at the bid and we want it just for the puts and we want it for today, which is what this is looking at. And there is a couple big trades. No doubt. So we have out in 2026, two of them. And that's important to know. So we have the, what are these? The 120's and the 125's out in 2026. We're the more near term into August. We have the 25's. So these are big, but not crazy, not absolutely insane for what we've seen. Now if we open this up to take a look at the premium that's been transacted in here, it's a little bit of a different story because I actually see another thing that's way more interesting to me, which is this. Take a look at that. That is a series of calls out in 2025 and 2026. So these are long dated, kind of boring for the near term stuff. But take a look at this. They're getting punched in relatively consistent timing, 500, 500, 500,",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "to me, which is this. Take a look at that. That is a series of calls out in 2025 and 2026. So these are long dated, kind of boring for the near term stuff. But take a look at this. They're getting punched in relatively consistent timing, 500, 500, 500, 500, 500, all at the 20's. And they're bringing in a lot of money. So this is somebody that's selling calls. They sold 463,000 there, four hundred six. Like this is a ton of money that they brought in. This here's easily over 3 million worth of premium, especially if this is also the same person, which I probably would guess it is. So these 20's got cracked with a ton, a ton of short premium that somebody with a pretty big position is building this up. So if we have 500, 500 contracts, that gives us 50,000 shares times one, two, three, four, five, six, we'll start there. That gives us 300,000 shares right there. Then we have essentially, let's call it another 50, 100. I mean, this is a pretty massive position is kind of what this boils down to. I'm probably seeing something to the tune I'm guessing of like maybe four hundred thousand shares a little over that, especially because I just noticed it goes even further down here that they were that they were still hitting these. Now, this is a really, really interesting trade to me. Because from me, from a trading perspective, the",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "guessing of like maybe four hundred thousand shares a little over that, especially because I just noticed it goes even further down here that they were that they were still hitting these. Now, this is a really, really interesting trade to me. Because from me, from a trading perspective, the prospect of selling premium that's all the way out there in 2025 is fascinating. The reason why it's fascinating is because it doesn't move that much. So if we go out here to 17, Jan 25, I think that's one of those work, right? Does 17, Jan's? This one. Okay, or no window. One sec. There it is. There it is. A little bit of a delay. Yeah, 17, Jan 25's. So as I look at those, I look at the 20's, they're in the money. So that's good from a perspective of essentially hedging a potential downside. So if you have a really big position and you want to hedge some of the downside, you can sell those calls in the money because if they fall out of the money, you've made a ton of money. Now, the other interesting thing that I find about these 20's is if you look at the theta, they're getting two pennies a day. It's just not that much money, especially if they had instead came into something even as close as the 25's, but like the 32's, 39's, even the 60's. If we take a look at something like those 20's, there's",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "you look at the theta, they're getting two pennies a day. It's just not that much money, especially if they had instead came into something even as close as the 25's, but like the 32's, 39's, even the 60's. If we take a look at something like those 20's, there's still at least to add an extra penny a day, which might not sound like a lot, but on a position that size, it's actually quite meaningful. And 60 days within 60 days is right as theta decay starts to really accelerate. So that position is very interesting to me. And that looks like somebody building a position that has a lot of shares because that's the reason why these would be sold in my opinion is against shares. They could be sold naked, definitely. To me, that would be madness, especially on something that can move the way that this thing does to sell those in the money. I would say that this is far more indicative of somebody who has shares that they would not mind selling at 20 if they had to. And they're collecting a bunch of money to do it. That's what that is. Now from the other trade that I saw today that was really interesting was the 362 lot at the 20's. Again, same expiration. This is out though in 2026. And these came in at the offers to somebody bought these and they bought almost 500,000 worth of this position. So there's",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "from the other trade that I saw today that was really interesting was the 362 lot at the 20's. Again, same expiration. This is out though in 2026. And these came in at the offers to somebody bought these and they bought almost 500,000 worth of this position. So there's a lot of big volume coming into this thing. If you take a look at the premium that's being transacted and remember the last couple of times I showed you this, we see like a handful, maybe 10, 12 positions with total premium above 100,000. Now if you take a look at this, it's literally this whole entire top of the screen that's above 100,000. Now if we limit this specifically to people that are buying calls, you'll see that it's slower. We do have that giant half a million dollar position. But beyond that, it's much slower. So this to me looks like people settling in not necessarily playing these really short term giant upside moves, but moving around established positions. That's my best guess as it sits right now. We'll see. As always, we'll see. It's fun to keep an eye on this. It's fun to see where it goes. If there's ever anything you want me to take a look at, let's boy, no, I love looking at this stuff being outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  },
  {
    "text": "it goes. If there's ever anything you want me to take a look at, let's boy, no, I love looking at this stuff being outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "XG_sFyM1oeo",
      "title": "Market Update - CRWD & GME",
      "url": "https://www.youtube.com/watch?v=XG_sFyM1oeo",
      "upload_date": "",
      "duration": 886.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XG_sFyM1oeo&t=0"
    }
  }
]