[
  {
    "text": "WARNING Audio file is very small 4386 bytes This transcript may be empty or incomplete because the audio file could not be properly downloaded. YouTube may have blocked download attempts for this video. you puts up outliers today. We're going to talk about applying military methods to options trading. Why would we do this? Well, that little OG over there, that's me and OCS officer candidate school. And I was a platoon sergeant reporting in my platoon for an inspection. This was the CEO of the installation. And the military has shaped a lot of who I am. And a lot of what I do in the markets is actually adaptations from what I've learned over my entire life. And a good bit of that was spent preparing and then being a marine officer. So I think for a lot of people, especially those that don't go into the military, there's a lot that we can learn to help others through their trading path that might not have had this same experience. Now it's way more than just, oh, being disciplined. That's like table stakes. You have to be disciplined to do just about anything decently well. So it's way more than that. And you'll see actually we're going to walk through seven core concepts. I'm going to give you seven examples for each one of those core concepts. And then I'm going to show you the civilian or the trading version of all of these core concepts on how",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 17,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=0"
    }
  },
  {
    "text": "more than that. And you'll see actually we're going to walk through seven core concepts. I'm going to give you seven examples for each one of those core concepts. And then I'm going to show you the civilian or the trading version of all of these core concepts on how you can lift the core concept, shift it to your paradigm as a trader to amplify what you're doing. So the first question is why even do this? Why am I bothering talking about any of this? Well, it's because if we take even a quick basic overview of markets, they are complex markets have a lot going on. Anytime that you have a really complex system, we use simplifying tools. It's because it helps our minds get our arms around the problem so that we can efficiently solve it. This is also why in any sort of science, you'll see that they make assumptions. Assumptions that they literally know are not factual, but the assumption helps them continue on the problem solving path. So this process of creating structure and a way of thinking about things is literally essential to your survival as a trader, because not only are you in a very competitive space, but you're in a competitive space with essentially zero structure provided around you. So you're going to find a lot of the concepts that we're going to talk about are really designed to help with that exact problem set. So the first core concept",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 17,
      "start_timestamp": "00:00:53",
      "start_timestamp_seconds": 53.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=53"
    }
  },
  {
    "text": "you in a very competitive space, but you're in a competitive space with essentially zero structure provided around you. So you're going to find a lot of the concepts that we're going to talk about are really designed to help with that exact problem set. So the first core concept is that of preparation. In the military, we use things called TDGs, taxical decision games. The purpose of a TDG is to put you in a scenario. We paint a scenario, and then we say, boom, magic has happened. And you're now in this scenario. What are you going to do? Talk about it. Walk us through it. And we do this in a bunch of different ways. They can happen in a conversation. It can happen via a sand table exercise. We call those stexes. But the whole point behind this is that the first time you're seeing a problem should not be when the real problem exists. So you'll see how this translates beautifully into trading. You'll also see things like IPBs. This is where we want to actually gain intelligence on the battlefield before we go step on to it so that we kind of know what clothes should we bring? Is it going to be hot? It's going to be cold. Even down to what the weather is like, how does that impact our assets that we might use? All of these things in the preparation stage are designed to give us an idea of what",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 17,
      "start_timestamp": "00:02:07",
      "start_timestamp_seconds": 127.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=127"
    }
  },
  {
    "text": "clothes should we bring? Is it going to be hot? It's going to be cold. Even down to what the weather is like, how does that impact our assets that we might use? All of these things in the preparation stage are designed to give us an idea of what we're doing, how we're facing things, how we're going to train our Marines or other forces to execute the job that's expected of them. And it's also understanding the enemy side of things. So the enemy side is really important in the light of trading. You can think of this in the context of other market participants, although they're not enemies, they are other participants that influence what we do. So how does this translate into being an actual trader? Well, you can start by studying. You can take some time to understand the landscape as it sets the reality as it is for traders. You can take the time to understand and prep the battlefield by knowing who's in it. What exists there? All of these preparation elements literally lend to understanding yourself, getting yourself trained and capable of doing a job. This is learning how to trade, understanding the endeavor that you're trying to undergo in the case of trading. We're trying to make money by applying ourselves to capital markets. But it's also understanding what other people's experiences have been in that same endeavor. So we can identify common failure points and then move around them. This",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 17,
      "start_timestamp": "00:03:13",
      "start_timestamp_seconds": 193.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=193"
    }
  },
  {
    "text": "the endeavor that you're trying to undergo in the case of trading. We're trying to make money by applying ourselves to capital markets. But it's also understanding what other people's experiences have been in that same endeavor. So we can identify common failure points and then move around them. This preparation phase is probably one of the most important things you can do as a trader. This will lend into things like paper trading. It will lend into taking the time to understanding what we're trying to do. The only difference is from a military perspective, it's easy to take this shit seriously because you know you might die, even if you do it well, but the probability of you dying if you don't is really good. So you want to avoid that at all costs, obviously, and we want to be able to successfully do our job and come back and trading the stakes are nowhere near as high. So people regularly just kind of, throw them off, which is a giant next. Let's take a look at the planning process. Planning is essentially where we take the preparation phase. We combine all the skills, everything that we learned, and we start to create an actual concept of what we're going to try to do. So in the Marine Corps, we use something called McPepe, which is the Marine Corps planning process. It has these several steps, problem framing, co-development, co-war gaming, co-accomparrison, orders development, and the execution. We",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 17,
      "start_timestamp": "00:04:22",
      "start_timestamp_seconds": 262.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=262"
    }
  },
  {
    "text": "and we start to create an actual concept of what we're going to try to do. So in the Marine Corps, we use something called McPepe, which is the Marine Corps planning process. It has these several steps, problem framing, co-development, co-war gaming, co-accomparrison, orders development, and the execution. We literally can translate every single one of these into trading equivalent. So the whole point of this planning process is to take a really big, broad problem and figure out how to break it down into consumable parts for analysis and then figure out what the best path forward is for us. So problem framing is guess what? What we did in preparation. That's where we conduct that analysis using things like SSRN to understanding the standard experience for a trader. This is where we grab a couple of books and we do a little bit of reading. And we understand what we're trying to do. We're trying to make money through trading. Co-development then is how do we think we're going to go about doing this? And this is where you can employ things like the outlier strategy process that I've built for you, the outlier trade process that I've built for you, how to paper trade as a active trader built that for you as well, how to create a trade checklist. Also have done that. The whole point is all of these different videos that I've created for your reference are designed to give you a framework",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 17,
      "start_timestamp": "00:05:29",
      "start_timestamp_seconds": 329.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=329"
    }
  },
  {
    "text": "I've built for you, how to paper trade as a active trader built that for you as well, how to create a trade checklist. Also have done that. The whole point is all of these different videos that I've created for your reference are designed to give you a framework to work off of. So the CoA development helps us understand how we're going to try and accomplish this goal. CoA war gaming is when we take these different courses of action. I don't think I said that yet, CoA is course of action. When we take all these different courses of action and we compare them against each other. So what you'll notice is in the outlier strategy process in step three, let me grab it right here. You see where it says, outline fitting structures, identify how to make money from the profit mechanism, create a list of structures, test performance and analyze, identify the best fit for that profit mechanism. Guess what this is? This is CoA war gaming. As I'm figuring out different structures that might be able to make money from a market effect, I'm going to compare them all and I'm going to pick the best one. That's literally this. These two steps, CoA war gaming and comparison of the results. Order's development is effectively where we build our strategy. How are we going to run this process? And I have videos, like I mentioned, for literally all of these. So we'll throw links",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 17,
      "start_timestamp": "00:06:42",
      "start_timestamp_seconds": 402.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=402"
    }
  },
  {
    "text": "the best one. That's literally this. These two steps, CoA war gaming and comparison of the results. Order's development is effectively where we build our strategy. How are we going to run this process? And I have videos, like I mentioned, for literally all of these. So we'll throw links to those in the notes below and the execution is doing the thing. So next up, we have ruthless objectivity. One of the coolest things about the military culture in general is nobody cares about your feelings. Actually really important. It's not that your feelings don't matter. And I say that partially in just because the military is actually really, really thoughtful about our people as much as we can be. But what we do not do is beat around the bush at all. Nobody has time for that. Grow some thicker skin. And anybody that's familiar with my channel the way I interact with our people. Again, you can see artifacts from all of this in how I live my day to day life. And it's really important though, because ruthless objectivity allows us to accurately identify things to make adjustments. What doesn't work well is if you can't decode and if you can't take actual criticism. So in the military, you'll see this come up through things like standards and culture. People in the military that we would deem fat by most normal people, most normal people like you guys were crazy to consider that fat. But in",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 17,
      "start_timestamp": "00:07:45",
      "start_timestamp_seconds": 465.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=465"
    }
  },
  {
    "text": "decode and if you can't take actual criticism. So in the military, you'll see this come up through things like standards and culture. People in the military that we would deem fat by most normal people, most normal people like you guys were crazy to consider that fat. But in the Marine Corps, absolutely. We think that person's fat. If they look like probably a normal person average, it's a way that we enforce a standard. And that culture is actually a good thing. And the last thing I'm going to mention here is healthy peer pressure. We always think peer pressure is bad. It's taught as a bad thing. It's not always bad. Peer pressure leads us to rise to a certain level of performance of behavior, because that's what's expected of us by our peers. So from a trading equivalent of this step, this is where you conduct those ruthless, ruthless self assessments. It's where you strip yourself bare to yourself and you analyze your decision making. And you don't give yourself out. Oh, I was impatient on that because of this and I won't do it again. No, you were impatient in that. You broke the rules. Bad. How can we fix it? The only way you can get to that level is if you actually call it what it is in your accurate. So that self assessment process, we use things like trade logs. The importance of a trade log is because it gives us quantitative",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 17,
      "start_timestamp": "00:09:00",
      "start_timestamp_seconds": 540.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=540"
    }
  },
  {
    "text": "Bad. How can we fix it? The only way you can get to that level is if you actually call it what it is in your accurate. So that self assessment process, we use things like trade logs. The importance of a trade log is because it gives us quantitative feedback on what we're doing so that we don't have that disconnect between what we think we're doing and what we're actually doing. A great example of this is in the Marine Corps, you have physical standards. You have a PFT physical fitness test, a CFT combat fitness test. You get grades for those. You go to the shooting range. You get a score on the rifle and pistol range. Those literally are your trade logs because they show you your performance and you have to look at them. They're part of your ability to grow within the organization. If you suck at any of them, you're not going to be around very long. So trade log is the exact equivalent of this for a trader because it gives you that direct feedback that you literally need in order to survive. Emotional regulation. This is where we start entering that layer of discipline. And the things that we do in the Marine Corps are really simple and other services do this exact same thing, which is stress inoculation training. The whole idea is we're trying to put you in the best comparative scenario that we possibly can to actually being",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 17,
      "start_timestamp": "00:10:15",
      "start_timestamp_seconds": 615.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=615"
    }
  },
  {
    "text": "layer of discipline. And the things that we do in the Marine Corps are really simple and other services do this exact same thing, which is stress inoculation training. The whole idea is we're trying to put you in the best comparative scenario that we possibly can to actually being on a battlefield. So that when you eventually end up on a battlefield, it's not your first time in anything even close to this. So the equivalent for this in trading is actually pretty simple. I think there are a few things you can do. The first one is slowly start with exposure therapy, exposing yourself to the things that make you uncomfortable, not just in trading, but in general, because that starts to build some level of resilience. A really important thing I think applies in trading is paper trading. Now, most people dismiss paper trading because it's not real money. It's not the same thing. And I always give this exact example. Man, I'm I glad the military doesn't think we shouldn't train because we're not actually being shot at by an enemy. So we're not going to bother training. And make zero fucking sense. The thing is we acknowledge training will never be the same thing as actually doing the job and completing missions against a adversary near peer is even more difficult. But we still do those steps because it helps us. And we take it as seriously as we can. If you take trading and",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 17,
      "start_timestamp": "00:11:24",
      "start_timestamp_seconds": 684.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=684"
    }
  },
  {
    "text": "we acknowledge training will never be the same thing as actually doing the job and completing missions against a adversary near peer is even more difficult. But we still do those steps because it helps us. And we take it as seriously as we can. If you take trading and paper trading very seriously, you literally get into the mindset that this is your money. All of a sudden, it carries some weight because guess what? If you look at it, you're like, oh, I can't take it seriously because it's not real money. It's gonna be as soon as you actually start trading with real money. Guess what? Now it's real money. So the idea is to get that same level of experience as much as you can before you make the jump to get all those stupid mistakes out of the way. The other thing I'll mention here is the whole life approach. The reason why I mentioned this whole life approach is actually because if you try to be disciplined in one thing and then not something else, it doesn't work that well. You kind of have to run these concepts across what you do. So even something like emotional regulation, if you get super happy and then super sad and you go through that cycle, not saying whether it's good or bad, but that doesn't work well in trading because that's where revenge trading starts coming in. That's where despair starts coming in. The way as",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 17,
      "start_timestamp": "00:12:33",
      "start_timestamp_seconds": 753.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=753"
    }
  },
  {
    "text": "something like emotional regulation, if you get super happy and then super sad and you go through that cycle, not saying whether it's good or bad, but that doesn't work well in trading because that's where revenge trading starts coming in. That's where despair starts coming in. The way as a marine officer were trained is you're kind of supposed to be that even keel. That doesn't mean that you can't be happy. It doesn't mean that you can't be sad. But rather than having happy and sad movements like this, we try to have them like this so that they're a little more measured tempered less deviation from our standard disposition leads to better decision making. Adaptability in the Marine Corps, we have a really, really fun saying adapt and overcome. And it's because that really becomes the way that you succeed in the military. Because the planning process is always funny because you go through all of these stages, you come through all of this analysis and then you start actually doing the thing and nothing happens the way you thought it was going to be. And Mike Tyson obviously is the fantastic quote, everybody's got a plan to they get punched in the mouth. That's a fantastic quote and it literally represents life. So then why do we go through planning? It's because the planning process itself is equally if not more valuable than the output of the planning. And going through that allows us to be",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 17,
      "start_timestamp": "00:13:42",
      "start_timestamp_seconds": 822.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=822"
    }
  },
  {
    "text": "to they get punched in the mouth. That's a fantastic quote and it literally represents life. So then why do we go through planning? It's because the planning process itself is equally if not more valuable than the output of the planning. And going through that allows us to be way more adaptable because we're able to understand in the military, we call it a commander's intent. It's the ultimate thing that we're trying to accomplish in the trading world. The commander's intent is whatever your goals are as a trader and then decentralized execution is how do we actually attain that goal? Now in the military and also as a trader, we need to adapt a Bayesian style of thinking Bayesian analysis is where we update our understanding of things as new knowledge comes out. So one of the best possible ways you can be adaptable as a trader is you focus on the process in far less on the outcome. That's one of those really weird things that it sounds like means nothing, but it really is the way to find success long term as a trader. It's where you are less concerned with how each individual trade comes out in the wash and we focus so much more on executing a sound process because in the long run, your returns as a trader literally are a measurement of your ability to adhere and execute a sound process that's positively expected risk management. We use a lot of",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 17,
      "start_timestamp": "00:14:45",
      "start_timestamp_seconds": 885.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=885"
    }
  },
  {
    "text": "comes out in the wash and we focus so much more on executing a sound process because in the long run, your returns as a trader literally are a measurement of your ability to adhere and execute a sound process that's positively expected risk management. We use a lot of risk management in the military and it's because we do a lot of risky things. The main thing I want you to pay attention to from a military perspective to things. The first one is what we call operational risk management. We use something called a RAM, risk assessment matrix. What we try to do is we have two columns. We have the probability of something occurring and then the severity. That allows us to understand what kind of controls need to be put in place. To put this in the context of a trader, if you're putting on a trade that has a very low probability, but if that probability happens, it wipes out your account. Guess what? It still is important enough that you have to manage it. The idea of a risk assessment matrix and this kind of process is we're trying to frame risk in a way that we're not accepting unwarranted risks and that the risks that we are accepting have a commensurate reward. The way that you can do that as a trader is literally by developing your own RAM. You can use things like a trade checklist. You can employ portfolio level circuit",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 17,
      "start_timestamp": "00:16:03",
      "start_timestamp_seconds": 963.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=963"
    }
  },
  {
    "text": "way that we're not accepting unwarranted risks and that the risks that we are accepting have a commensurate reward. The way that you can do that as a trader is literally by developing your own RAM. You can use things like a trade checklist. You can employ portfolio level circuit breakers, which I have an entire video that talks about all these risk management approaches as a trader. We'll link to that below that you can then think through all of these things at a time in a trade management plan and then avoid taking stupid risks that you don't even know are there. That one time you sold puts on a company because it had IV and you didn't know that had earnings coming out. That kind of thing. The last one after action reviews. You'll absolutely have heard me refer to this before. It's called an AAR and we ask ourselves a few questions. What was supposed to happen? What actually happened? Why did it happen? What can we do better next time? Literally that exact thing applies to you as a trader. The way that I conduct this AAR process is I think of it following individual trades. I conduct a weekly mini AAR, look over the entire portfolio. I do a monthly deep AAR. It's typically like several hours, three to four hours of combing through everything, identifying trends. Then every single year, I have a holistic AAR that literally takes me almost two weeks that",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 17,
      "start_timestamp": "00:17:22",
      "start_timestamp_seconds": 1042.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=1042"
    }
  },
  {
    "text": "trades. I conduct a weekly mini AAR, look over the entire portfolio. I do a monthly deep AAR. It's typically like several hours, three to four hours of combing through everything, identifying trends. Then every single year, I have a holistic AAR that literally takes me almost two weeks that I go through everything I did. But this process of conducting an AAR in a structured way leads to finding things that you can employ smarter going forward. This is exactly how you apply military strategies and decision-making to trading options. See you later.",
    "metadata": {
      "video_id": "xGZUHMXt9Fc",
      "title": "Instantly Improve Your Options Trading with Military Strategies",
      "url": "https://www.youtube.com/watch?v=xGZUHMXt9Fc",
      "upload_date": null,
      "duration": 1150.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 17,
      "start_timestamp": "00:18:24",
      "start_timestamp_seconds": 1104.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xGZUHMXt9Fc&t=1104"
    }
  }
]