[
  {
    "text": "you you you you you you you you you you you you you you you you you you you you You you you and again. Take a look at this. What what what what am I doing wrong here? G M E maybe I'll just click it. Okay, so you just can't hit enter. That's good to know. It was like why am I looking at the same thing over and over again? So if we take a look at the just last 12 quarters, right? And we poke through we see the expected ranges have been quite volatile and there's if I were trading this for earnings, this would be a tough one for me for two reasons. One because it has really big severity of moves and they're in both directions up and down. And when it's reporting earnings normally, you can see even when it's within the expected range, the majority of instances, it's at the very end of the range. So here here here here here it's like at the very end of the range. There's not a lot of money to be made from a whole perspective on something like this, which is difficult. Now the cool part is since I'm trading a coverage strangle in it, then I'm essentially already in the position. So it doesn't necessarily matter a whole lot to me. And I think still even right now I'm pretty much all in options. Yeah, I'm just in puts that are in",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 47,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=0"
    }
  },
  {
    "text": "the cool part is since I'm trading a coverage strangle in it, then I'm essentially already in the position. So it doesn't necessarily matter a whole lot to me. And I think still even right now I'm pretty much all in options. Yeah, I'm just in puts that are in 20 June. I'm in the 28s. So those are probably coming up due on time to exit, but not quite yet. If we get a decent price move, I probably would consider just starting to build an actual equity position. I've been slow in general on building equity positions in my coverage strangle just because of the way that the market is positioned. It's not really worth the cost to carry. Right. And when I say cost to carry, I don't mean outright in terms of like financing costs and stuff like that. I literally just mean the opportunity costs of holding the position. And also shame on me. I haven't even said hi to you guys yet. Sorry, just like I got excited. Just jump right into it. Looks like we got he's Tanner. Dookie pie. There we go. Sounds right. H. A nod. Oh no, there's an end there. Oh shit. This is going to be one of those ones. We're going to go back to that one. Lauren Matthew in Scott. Get to see all of you. The fuck do I say this name? I feel like I've done this one before. And a non a non",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 47,
      "start_timestamp": "00:11:10",
      "start_timestamp_seconds": 670.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=670"
    }
  },
  {
    "text": "there. Oh shit. This is going to be one of those ones. We're going to go back to that one. Lauren Matthew in Scott. Get to see all of you. The fuck do I say this name? I feel like I've done this one before. And a non a non a non that's my best guess. A non. I feel like I've done this before. Every once in a while I come across names and hear that are just very very just as I said that just as I was literally saying I come across names and hear that can be very difficult to say. The next comment that pops up in the chat is from very fat cow. That's awesome. Runs me like Xbox gamer tags. If you play Xbox you know what I'm talking about those gamer tags are fucking wild. So Matthew says you're using thinkorswim for looking this up. I'm watching from my phone. So listen via audio. No, this what I'm doing right now is I'm using unusual whales. Thinkorswim has the same thing. The only difference in thinkorswim is it's not as neat of a display. And I also don't think it plots this here which is like the the actual expected move. It just plots the implied vol realize vol and then price movement. So it's a slightly different view. This one is just a little more convenient because it puts everything in one spot. One of the things I found with like",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 47,
      "start_timestamp": "00:12:31",
      "start_timestamp_seconds": 751.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=751"
    }
  },
  {
    "text": "here which is like the the actual expected move. It just plots the implied vol realize vol and then price movement. So it's a slightly different view. This one is just a little more convenient because it puts everything in one spot. One of the things I found with like using different trading platforms and stuff is for the longest time I was so reluctant to to pay for anything. And it's because I would always say like oh it's available. I'll just do it myself. And I did that for a really really long time. The thing is there's like a lot of stuff right? So the thing is that's like a really poor person's mindset which is fine. That's how I grew up. But it actually is a limiting factor. So what ends up happening is the amount of time it takes me to build all of the different things that I otherwise could pay and access and use is completely different. Now you guys all know I have an affiliation with them. So I have a deal with them the platform and stuff like that. They're not sponsoring any of this stuff. But it's literally like a tool that I use. So those kinds of relationships I always feel like work well because it's like a natural again. This is a natural thing that I would use. I'm actually in the process of trying to get back into either some sort of terminal. I don't know if",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 47,
      "start_timestamp": "00:13:50",
      "start_timestamp_seconds": 830.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=830"
    }
  },
  {
    "text": "tool that I use. So those kinds of relationships I always feel like work well because it's like a natural again. This is a natural thing that I would use. I'm actually in the process of trying to get back into either some sort of terminal. I don't know if I want to go and grab a Bloomberg terminal. They're really not that crazy expensive. They're more than what would be reasonable for most people. But the thing is is like they're kind of fun for the information that they provide. But in terms of like how it actually would impact my functional trading, it would be about NIL. However, the amount it would impact content creation would be massive because there's a ton of really cool information in there. But then there's also other versions. Other like tier platforms like that kind of like icon and stuff like that. There's also SP global IQ. Those ones are pretty solid. But this has most of what I need. And from earnings and stuff like this, this is pretty good. H says, Scarelli is trying to build a competitor. Another terminal. Yeah, that's cool. I think that's good. I think the more competitors you can get in the space, the better, especially what's stuff like this because information really like it really is a premium. And there's a lot of I don't want to say withholding, but it's pretty damn close to that. There's a lot of gated information. Now I'm",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 47,
      "start_timestamp": "00:15:05",
      "start_timestamp_seconds": 905.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=905"
    }
  },
  {
    "text": "more competitors you can get in the space, the better, especially what's stuff like this because information really like it really is a premium. And there's a lot of I don't want to say withholding, but it's pretty damn close to that. There's a lot of gated information. Now I'm okay with that by the way. That's okay because I also think people have gotten so spoiled where we just think everything should just be free for us, especially retail traders were the worst. We think everything should be free and it's psychotic because as soon as even as soon as you set up an entity to trade through, if it's an LLC or something else, you have to pay for shit. You have to pay for quotes for streaming. Like you have to pay for normal stuff that most other entities have to pay for. It's just retail traders have gotten so used to this Goldilocks deal and as always, you should pay attention to why that would be. Why is it that if I have an entity that's registered to trade, I have to pay for all this shit except for retail so much of that shit is free. Why would that be? It tells you a lot about the infrastructure. It's really funny because there's a lot of these small subtle cues like that that show the reality that people just go straight over the head. They don't even notice it. H says the brokers are just",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 47,
      "start_timestamp": "00:16:25",
      "start_timestamp_seconds": 985.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=985"
    }
  },
  {
    "text": "free. Why would that be? It tells you a lot about the infrastructure. It's really funny because there's a lot of these small subtle cues like that that show the reality that people just go straight over the head. They don't even notice it. H says the brokers are just generous, right? Exactly. Just great people. They just want everything. They just want the best for you. It's hilarious. For those that aren't out of curiosity, actually genuinely out of curiosity, do you know what I'm talking about? I'm curious as I'm joking around who is unaware of what I'm actually talking about here because it's not like an inside joke but people genuinely might not know. H says we couldn't possibly be cattle like liquidity sort of. I actually wouldn't say that's the main thing because the liquidity provided by retail is not insignificant, especially depending on what the underlying is. So there definitely is an element of liquidity but it's actually even more broad than that. There you go. Matthew says free equals you are the product such revenue source. Fucking bingo. What a perfect way to frame that. For those that don't know how this works. So you have a broker and they provide access to markets. So let's just pretend these are all like streaming quotes. They provide access to markets. And there's some brokers like IB for example. They have institutional level clients that still use them as in actual brokers. So it's not just",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 47,
      "start_timestamp": "00:17:45",
      "start_timestamp_seconds": 1065.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1065"
    }
  },
  {
    "text": "you have a broker and they provide access to markets. So let's just pretend these are all like streaming quotes. They provide access to markets. And there's some brokers like IB for example. They have institutional level clients that still use them as in actual brokers. So it's not just all retail brokers. But if you're using something like Schwab, it's generally retail broker. There still are some institutional level clients through there. So if you have retail and then if you have institutional and again, institutional means a ton of things. This isn't just like the people that most people don't like like market makers and stuff like this. This is this and by the way, there's not really a ton of reasons not to not like market makers but that aside. The retail side of this equation, we have completely different access to the broker and then to the exchanges than an institution. So if you think of things like streaming, which is literally just getting live data, this is free. This is paid for them. And it goes on and on with a lot of different things in this way. However, it's super important to understand the relationship between broker and retail because exactly as Matthew sniffs out the reason why retail has provided this access is for a couple very specific reasons. One, retail typically equals smaller. Typically. And this will even be used at this kind of logic in really well known research papers where,",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 47,
      "start_timestamp": "00:19:14",
      "start_timestamp_seconds": 1154.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1154"
    }
  },
  {
    "text": "relationship between broker and retail because exactly as Matthew sniffs out the reason why retail has provided this access is for a couple very specific reasons. One, retail typically equals smaller. Typically. And this will even be used at this kind of logic in really well known research papers where, for example, if you read the latest paper on zero DTEs SPX, they essentially are assuming that if you trade more than a one lot, your institutional or if you're trading naked options, your institutional, which is funny because I don't consider myself institutional, but I absolutely would fall into that categorization there. So anyways, the assumption is smaller. So this means less money. So less money means that in order to pay for things like quoting streaming stuff like that for general access, that cost money, that amount of money can be prohibitive that can literally stop your ability to access. Let's say if you're starting with a 5,000 account and you've got to pay what's called 200 a month in access, this is a meaningful amount of this is what 4 the meaningful amount of your money just just for access in a month. So the broader point here is it tells you a few things. One, it tells you that retail typically isn't making the fucking money because if they were making the money and it was relatively easy to make the money and people know you can make the money, then this initial startup cost is",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 47,
      "start_timestamp": "00:20:30",
      "start_timestamp_seconds": 1230.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1230"
    }
  },
  {
    "text": "here is it tells you a few things. One, it tells you that retail typically isn't making the fucking money because if they were making the money and it was relatively easy to make the money and people know you can make the money, then this initial startup cost is palatable. But we know that not to be the case. We know that most fail. So the reason why the broker gives you this beautiful access, the reason why they give you really cool stuff like education is because they want you to trade. They want you to trade as often as possible. They want you to interact with the platform as much as you humanly can. And it's because what they're doing is they make a little bit of money off of you. When you send your order through, you might have a commission if it's an options contract, if it's equity, that's essentially gone at least on the front end. Then as they route your order, it doesn't typically go directly to the exchange. Oh no, there's a break right here. And this break right here starts with them pooling orders. You get a bunch of different orders in here. Then there's literally firms, market making firms, other entities that will straight up buy this order flow. And then they will complete the circuit. Why the fuck would they buy your order flow? Again, you can deduce exactly what's happening here. So going all the way back to",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 47,
      "start_timestamp": "00:21:56",
      "start_timestamp_seconds": 1316.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1316"
    }
  },
  {
    "text": "in here. Then there's literally firms, market making firms, other entities that will straight up buy this order flow. And then they will complete the circuit. Why the fuck would they buy your order flow? Again, you can deduce exactly what's happening here. So going all the way back to this mindset that retail traders have everything should be free, it's such a broken way of thinking. And it literally is just part of the same poverty, stricken mindset because the only reason why shit is free for you is because they are making money off of you. That's why it's because they're making money off of your order flow. Your broker side, the broker of arrangements and agreements that they have with the various firms that they partner with. There's I.B. agreements that you have to look at. Then the market making firm is able to either make money by just making money, making markets for the order flow, but they can also take directional bets based on whether or not it seems informed order flow. It's crazy. It's really, really cool. Now, and notice how I say that, it's really cool. The reason why it's so cool is because this provides an insane amount of access that otherwise would not be there. You just have to accept the world as it is and just learn to maneuver through it. Just because this is the case doesn't mean that any of this is necessarily out to get you. It",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 47,
      "start_timestamp": "00:23:08",
      "start_timestamp_seconds": 1388.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1388"
    }
  },
  {
    "text": "because this provides an insane amount of access that otherwise would not be there. You just have to accept the world as it is and just learn to maneuver through it. Just because this is the case doesn't mean that any of this is necessarily out to get you. It means that we live in the structure that we live in. If retail traders somehow magically got good at trading, some of this absolutely would change because that actually breaks this. They don't want this shit anymore. Same thing for anybody that internalizes your trade. Like they don't want it because they're internalizing an informed trade that they know they're probably going to fucking lose on. So they have to hedge it all the way through in order to make the fractions of a penny on the back end. So that kind of stuff would all evolve pretty quickly. So this is another reason why you should be thankful that trading is hard and why most people fail at it. It is the only reason why there's an opportunity here that's all there is to it. So anyways, back the game stop and back the earnings. My guess is earnings will probably be pretty be pretty mellow. So if we take a look at EPS estimates, they were expected at nine cents in Q1, Q2, they're expected at eight cents, Q2 year over year, Q2 estimate was down at dime. So I mean, this is what the path to profitability",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 47,
      "start_timestamp": "00:24:35",
      "start_timestamp_seconds": 1475.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1475"
    }
  },
  {
    "text": "will probably be pretty be pretty mellow. So if we take a look at EPS estimates, they were expected at nine cents in Q1, Q2, they're expected at eight cents, Q2 year over year, Q2 estimate was down at dime. So I mean, this is what the path to profitability looks like, right? Negative, scratch, scratch, it's like positive, positive. Now another estimate for positive. This is the path to profitability. It's not super sexy, but this is a company that has a big turnaround that they need to navigate now. So when we're coming into earnings, my full expectations is probably pretty mellow, probably sideways, unless there's some sort of broad market catalyst, which you guys all know, it's always one fucking tweet or X or truth or whatever the fuck around the corner that you can think of. We're seeing, you know, a beautiful marriage being just broken down shotgun style in front of our faces, which is hilarious. Just the way that the whole thing is going is so entertaining. I don't know, it's so funny to me like when I see people that are watching like dramas on TV or stuff like that. It's like literally just watch the news. You'll learn a little bit about the world around you and this shit's even crazier. It's literally insane. It's awesome. There's always stuff to look at. So let's take a quick look at what the options look like in here. And there's a couple things that",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 47,
      "start_timestamp": "00:25:44",
      "start_timestamp_seconds": 1544.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1544"
    }
  },
  {
    "text": "just watch the news. You'll learn a little bit about the world around you and this shit's even crazier. It's literally insane. It's awesome. There's always stuff to look at. So let's take a quick look at what the options look like in here. And there's a couple things that we should peek at. First thing is let's just take a look at the general chain. Pretty quiet. The 20 June cycle is setting up to be pretty big based on the broad OI that I see. They're still pretty meaningful call OI skew. But as per usual, a ton of these are super, super, super, super far out of the monies. So let's take a look at 20 June here. I mean, all the monies in the call side for mill and call premium who 69 on put. So I mean, just huge skew skew skew skew skew. This is the very standard, the very standard upside expectation that people are paying, paying through the nose for. This is interesting. That's really interesting. Oh, I think this is a lot of that position we saw getting built out a while ago. Yeah, on the tails, there's a little bit more on the put side, but in terms of expiration, but pretty much all the premiums on the call side, that's without a doubt. Let's see if there's any interesting trades. I already looked at this, but I'll look at it with you guys. All our filters are off. Okay.",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 47,
      "start_timestamp": "00:27:33",
      "start_timestamp_seconds": 1653.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1653"
    }
  },
  {
    "text": "more on the put side, but in terms of expiration, but pretty much all the premiums on the call side, that's without a doubt. Let's see if there's any interesting trades. I already looked at this, but I'll look at it with you guys. All our filters are off. Okay. So, I'm trying to see if there's anything new from when I looked last. Lots of like the put side is pretty busy. I'm going to turn that off for now so I can see easier. And then let's get rid of the sales. One of the reasons why you're going to see tons and tons and tons of calls being sold is because for those that have shares, the ball is still heavy and it's still typically worth selling on the call side. So if you take a look at 20 June, this ball is very rich, very, very rich. It's not outpacing the put side at the tails, but at the more usable strikes where people are going to be in the proximity of spot price. So if you're looking at like a 15, 15 strike on this side, we'll just take a look at an example. So if we take a look at a 15 strike, that's still a one Delta. So let's go to like a 20 Delta, something that's still pretty far out of the money. 21 Delta, Val here is 81 seven 81.7 21 Delta here. Val is 126 62. So what I'm showing",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 47,
      "start_timestamp": "00:29:22",
      "start_timestamp_seconds": 1762.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1762"
    }
  },
  {
    "text": "if we take a look at a 15 strike, that's still a one Delta. So let's go to like a 20 Delta, something that's still pretty far out of the money. 21 Delta, Val here is 81 seven 81.7 21 Delta here. Val is 126 62. So what I'm showing you is it's why when you use the volatility surface, you have to be perceptive slightly because even though the tail looks like it's so much higher than the call side and that could lead somebody to inaccurately be like, oh, this has like crazy putt skew. There's just not much in the calls. It's just not the case. There's a ton. There's a ton in the calls, especially when we normalize based on Delta for again, things that are within a certain bandwidth of at the money, whatever that is, which is right now it's like 29.5. So we actually have pretty significant callsque in those closer strikes in terms of all. So the like the wall surface is so unbelievably useful for understanding the way that the market is expecting things to move and in what severity. It's not always cracked, but it gives just incredible starting point, I think. And it's something that I literally use all the time because it gives you just a super streamlined view. Now with something like GameStop that's so prone to skew across a ton of different factors, it can be a little more difficult to perceive everything there because things",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 47,
      "start_timestamp": "00:31:00",
      "start_timestamp_seconds": 1860.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1860"
    }
  },
  {
    "text": "I think. And it's something that I literally use all the time because it gives you just a super streamlined view. Now with something like GameStop that's so prone to skew across a ton of different factors, it can be a little more difficult to perceive everything there because things can be so weird. But nonetheless, this looks like generally standard coming into earnings. Like that's kind of what I see. There's not like crazy huge trades coming in. 20 June op X is absolutely going to be busy. And that's because there's a ton of premium in that cycle that's going to have to do something. So we'll get we'll get a look at it and see how it ends up flushing out. But what I'm mostly going to be looking at is how do things shape up into earnings. So the next couple days is a perfect time to keep an eye out for things like any sort of big unusual options activity and stuff like that because that'll show like specific earnings driven positioning. So this is a really good time, like a really good window. Just keep an eye open to see if anything catches your eye so far, not so much. All right, let me grab the DD library because I'm on a timer here. So I want to at least get through hopefully a couple of these. I have to figure out where the fuck we are. I think we did this one. I",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 47,
      "start_timestamp": "00:32:22",
      "start_timestamp_seconds": 1942.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=1942"
    }
  },
  {
    "text": "eye so far, not so much. All right, let me grab the DD library because I'm on a timer here. So I want to at least get through hopefully a couple of these. I have to figure out where the fuck we are. I think we did this one. I think we might be on this one. Does that sound right? Maybe this one. So did it all securities been fine 58 times for violating finra reg show SEC several instances of document is willful naked shorting in d's 2020 they reported an increase in their short positions 127 year over year calling bullshit. Okay. Let's see. I'm just trying to see like what the let me start at the back and go go the other way. Sometimes starting with the conclusion is helpful for me. It's kind of like reading the abstract of a paper. I just want to know like what what are they posing to us right now? Where's the conclusion? Can't tell who's responsible for the flash crash and game stop. I don't think anybody can. This just wasn't market manipulation is laughable. All right. Here we go. The pressure being placed on hedge funds to deliver has been higher and the shift storm of corruption is coming to a head. Unfortunately the dirty tricks and Fud will continue. There's several catalysts coming up. However, desperate times that for measures. Okay. So this seems like this person is more just expressing frustration. And I don't see",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 47,
      "start_timestamp": "00:33:56",
      "start_timestamp_seconds": 2036.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2036"
    }
  },
  {
    "text": "deliver has been higher and the shift storm of corruption is coming to a head. Unfortunately the dirty tricks and Fud will continue. There's several catalysts coming up. However, desperate times that for measures. Okay. So this seems like this person is more just expressing frustration. And I don't see a lot relating to. I don't see a lot relating to like the broader theory on game stop and stuff. Okay. I do want to take a look at this part though. Did it else a conglomerate? Yep. We know this. Managing a lot of money. The value of those options changed dramatically in short amount of time. Yep. Okay. So this is just saying that they're in a lot of stuff. Well, COVID we've all heard stories of brick and mortar going bankrupt become very profitable to bet against the continuity of these companies. So big fox like Citadel decided to up their portfolio by 127 and a half. So this is not true. In terms of like the implication that they're trying to arrive at. I just realized the bottom of this is cut off. You guys sorry. Squeeze it up. The implication that they're trying to allude to here. So think of it this way. When we think of brick and mortar stores going bankrupt during COVID. Well, let's as always rather than speculate. Let's investigate. So in the US, how many publicly traded and non publicly traded. Companies. When bankrupt during COVID. Let's see. And we're",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 47,
      "start_timestamp": "00:35:38",
      "start_timestamp_seconds": 2138.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2138"
    }
  },
  {
    "text": "to here. So think of it this way. When we think of brick and mortar stores going bankrupt during COVID. Well, let's as always rather than speculate. Let's investigate. So in the US, how many publicly traded and non publicly traded. Companies. When bankrupt during COVID. Let's see. And we're using. We're using our buddy Gemini. Let's see what we get. And I'll tie this back. Don't worry. Total of 21 655 business bankruptcies. 110 publicly traded. So for context, if you think of publicly traded companies, there's 6,000 a little over that. 6,000 to 7,000. So the total that actually went bankrupt was very small as a total amount. The reason why I'm saying this is just because again, I have absolutely no love for Citadel at all. I just so heavily prioritized trying to be as objective in analysis. Again, the thing I will always remind you all is that if you are more objective in your analysis, you will be able to find more and more meaningful things that you can do stuff with. So this, there's not like a ton of profit that they were going to draw from small businesses going bankrupt because the vast majority of them are small businesses that are not publicly traded that they can't get a position on into short. So the thing to keep in mind is most of the time during really volatile markets, market making firms provided they can keep their shit together. They can make so",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 47,
      "start_timestamp": "00:37:44",
      "start_timestamp_seconds": 2264.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2264"
    }
  },
  {
    "text": "majority of them are small businesses that are not publicly traded that they can't get a position on into short. So the thing to keep in mind is most of the time during really volatile markets, market making firms provided they can keep their shit together. They can make so much money. And it's because of standard market behavior that we all, at least I think most of us know about. I'll show you. Remember market makers most often they're trying to collect the bid-ass spread. So if you have a bid and you have an ask or what we refer to as the offer. So let's say that this is a normal period of time. The markets are like we see right now. So let's say that something is two pennies wide. What that means is that the total spread represented between the difference here is two pennies. So in order for them to make money, they're essentially grinding away. And when I say market making firms, by the way, I'm referring to the algorithms that they run. This isn't like physical dudes clicking the button. So what ends up happening during highly, volatile periods is this spread becomes something like this. And it literally can go from two pennies to a dollar, a dollar plus. It can be all over the place. So what ends up happening is during these periods provided they can manage their risk, look at how much more money they make per trip provided",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 47,
      "start_timestamp": "00:39:49",
      "start_timestamp_seconds": 2389.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2389"
    }
  },
  {
    "text": "something like this. And it literally can go from two pennies to a dollar, a dollar plus. It can be all over the place. So what ends up happening is during these periods provided they can manage their risk, look at how much more money they make per trip provided that they can manage their risk appropriately. Blocking funds. So that's one of the big reasons why you will see institutions specifically those with market making arms do really, really well during super volatile periods. They'll make a lot more money. Lauren says shorting amplifies a problem in a company already in distress, but it doesn't necessarily cause bankruptcy in my opinion. Yeah, no, it definitely wouldn't, that's correct. And I agree with that. I think you have to think about the pressure it adds, which is significant. So it definitely, and I think the way you framed it is exactly correct, amplifies a problem. I think that that's super fair. And this is why I think it's important to go back to like the idea of just basic market dynamics, right? If you're trying to short something that is fundamentally really sound and people can see that, the shorts typically get their face ripped off. And it happens pretty regularly. It's why there's a name for it short squeezes because they might try to proxy into something that might be kind of weak. And then somebody else might say, I don't think so. I think it's pretty strong. And",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 47,
      "start_timestamp": "00:41:19",
      "start_timestamp_seconds": 2479.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2479"
    }
  },
  {
    "text": "typically get their face ripped off. And it happens pretty regularly. It's why there's a name for it short squeezes because they might try to proxy into something that might be kind of weak. And then somebody else might say, I don't think so. I think it's pretty strong. And enough people have that counter position. All of a sudden you get some buy pressure. Shorts have to close. They end up buying into the own rally. And then boom, you're off to the races with a pretty disadvantaged position that they have to try to manage is very difficult. Joseph says the dude on the other side of the trade loses on a non passive participant. Could you explain more? The dude on the other side of a trade. The person that's most often on the other side of your trade is a market maker. So they don't really care what happens. In terms of whether or not their passive or not passive, we don't know. Joseph says, meaning you buy the offer, you're down right away on the spread from the bid. Yeah. So that's typically the case. So depending on how the market moves, right? The market doesn't stay static. So as your trade gets filled, if things slide that can happen or if they stay static, then you might show no change at all because that just might be where the market is at that point. The other thing you'll find on your portfolio is that",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 47,
      "start_timestamp": "00:42:45",
      "start_timestamp_seconds": 2565.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2565"
    }
  },
  {
    "text": "doesn't stay static. So as your trade gets filled, if things slide that can happen or if they stay static, then you might show no change at all because that just might be where the market is at that point. The other thing you'll find on your portfolio is that you'll typically be quoted against the midpoint, not necessarily the bid or the offer, which might be more appropriate based on where you might get a fill or how wide something is. I find that a lot when I'm trading things like ratio-called diagonals that are further out in time and less liquid, it can show a much better profit than is actually there. Okay, cool. Let's check out another one. This one. Jesus. I don't know what this is, but I love it. Do you guys know where is this from? Something that I just don't know? This is fucking hilarious. Oh, I love this. I have absolutely no frame of reference for what this is from, but the hostage situation would be over in this circumstance. That's for sure. God, that's funny. Okay. Sid does. Hostages explaining why the moass is taking so long. How the January spike was stopped. Robin Hood's motives for trading haunt and the mysterious silence of the SEC. What does TA mean? I know TLDR. What's TA? The January moass is delayed because citadel took hostages. They figured out how to ensure others would be squeezed before they were. Oh, curious. They all",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 47,
      "start_timestamp": "00:43:57",
      "start_timestamp_seconds": 2637.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2637"
    }
  },
  {
    "text": "was stopped. Robin Hood's motives for trading haunt and the mysterious silence of the SEC. What does TA mean? I know TLDR. What's TA? The January moass is delayed because citadel took hostages. They figured out how to ensure others would be squeezed before they were. Oh, curious. They all took trading because of relationship. Oh, you guys are way more normal than I am. H says transfer agent, Lauren says technical analysis. I was thinking like too autistic didn't read or like too long didn't read TA. I went the wrong way, I guess. They figured out how to ensure others were squeezed before them. They halted trading because their relationship with citadel turned them into a hostage moass, waits until regulators soon the hostages. Okay. Hey DK, let's read more. Citadel wasn't going to be squeezed in January. Robin Hood was citadel took hostage to figure out how to ensure that others were squeezed before they were. Robin Hood halted trading after game stoppers on the threshold list 35 days, 35 failures to deliver broker becomes responsible for delivering the security to the customer. The moass is taking so long because citadel managed to figure out how to make their short position other people's problem. This is why citadel seems to have so many people protecting it, willing to lie for it. Okay. These ones are tough because it's like very entrenched in a position. So I'm not going to like bother going through it. I'm just going",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 47,
      "start_timestamp": "00:45:33",
      "start_timestamp_seconds": 2733.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2733"
    }
  },
  {
    "text": "make their short position other people's problem. This is why citadel seems to have so many people protecting it, willing to lie for it. Okay. These ones are tough because it's like very entrenched in a position. So I'm not going to like bother going through it. I'm just going to accept it as what it is and see what we can learn from here. So let us continue. Theory Robin Hood halted trading the day they became liable for delivery of GME shares, citadel sold to their customers. Okay. I think Robin Hood halted trading because they were required to purchase games up shares and deliver to customers past orders. Okay. We know this. Robin Hood customer buys shares that are cleared by citadel. Their delivery is not a problem unless it takes longer than 35 days. Okay. So if I wanted to sell a share on the market, then I do not want to sold share directly to the buyer of that share. You send my sell order into the market via my broker, send that off to the market center where it's executed by market maker, sell my share to the market maker executing the trade. They sell that share to the broker, then sells that share to the buyer. This is partially correct. Yeah. I suspect citadel had been failing to deliver GME shares to Robin Hood for an extended period. I don't know where this relationship or like the tie that they're making between citadel",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 47,
      "start_timestamp": "00:47:14",
      "start_timestamp_seconds": 2834.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2834"
    }
  },
  {
    "text": "sell that share to the broker, then sells that share to the buyer. This is partially correct. Yeah. I suspect citadel had been failing to deliver GME shares to Robin Hood for an extended period. I don't know where this relationship or like the tie that they're making between citadel and Robin Hood. But my expectation is that it would actually be potentially, I don't know who their IVs are with. So my expectation is that this would be even more complicated actually than this. Give me one set. Got to pop the door for the old boy. A bad. So anyway, let's continue. Robin has to buy the shares they expected citadel. Where is this? Do you guys have any context on where this where this relationship is like very like unilateral relationship? He's been thought out. I don't fully understand why they're thinking this. But it might be more founded. Age says back then apex apex was Robin Hood's clearing firm confirmed from last year in FGF that they do the same on things around lending shares to brokers before they have possession of them. Yeah, that definitely I agree with. Age says the large group of traders were trading reverse stocks split rounding at the time apex would give shares that weren't supposed to exist on paper to folks the next day after. Yep, I think that that's. Yeah. I think that that all makes sense to me. And I definitely would think that that that happens.",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 47,
      "start_timestamp": "00:48:58",
      "start_timestamp_seconds": 2938.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=2938"
    }
  },
  {
    "text": "were trading reverse stocks split rounding at the time apex would give shares that weren't supposed to exist on paper to folks the next day after. Yep, I think that that's. Yeah. I think that that all makes sense to me. And I definitely would think that that that happens. So is it the case where they're thinking? Yeah, that's right. So that's what we're seeing. Anyways, let me continue. The Del still owns Robin Hood shares at some point Robin Hood has to deliver to their customers now. Okay. You expected to be relationship between Robin Hood Halt. Number of users pointed out the purchase prices and dates incorrectly reported while transferring from Robin Hood to other brokers. This is because Robin Hood initially sold their user shares based on delivery promises made by Citadel and failed to fulfill this I struggle with. This might help why my analysis is 605 data found the proportion of GameStop order executions done through NASDAQ spikes in February. This can make sense. I agree with this. Despite being almost non-existent. Yeah, I think that that's absolutely. I think there's something to that because the market plumbing is really important. And actually Dave Lauer and I talked about this a little bit on a podcast we did a little while ago. That was a pretty good conversation about why orders would be routed between exchanges in different capacity. So I could absolutely get behind that. Robin Hood wasn't the only one that halted",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 47,
      "start_timestamp": "00:51:12",
      "start_timestamp_seconds": 3072.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3072"
    }
  },
  {
    "text": "Lauer and I talked about this a little bit on a podcast we did a little while ago. That was a pretty good conversation about why orders would be routed between exchanges in different capacity. So I could absolutely get behind that. Robin Hood wasn't the only one that halted trading. It's difficult but not impossible for Citadel to have orchestrated this behind the scenes. See, this I feel like starts just going too far. I think the probability that Citadel was like the mastermind behind all of this, it really doesn't even register for me. Mostly because the fact is I don't think the market actors broadly were going to allow the stock market to potentially explode due to this. So I think there's a point regardless of whether it's Citadel or another entity regulator that decides to step in and fully halt. Simply to stop it from going overly parabolic, which can happen. It absolutely can happen. And this goes back into the idea of like Moas, I don't think is as appealing of a thing as people think it is. Simply because you can't make money if the thing that you're making money in goes away. So you might be showing some sort of great profit until it literally just goes away. Then there's not like some massive settlement where people would just get whatever their account was at. There would be a broader settlement of distributing of what's left. So the other thing I will continually",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 47,
      "start_timestamp": "00:52:51",
      "start_timestamp_seconds": 3171.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3171"
    }
  },
  {
    "text": "you might be showing some sort of great profit until it literally just goes away. Then there's not like some massive settlement where people would just get whatever their account was at. There would be a broader settlement of distributing of what's left. So the other thing I will continually remind people of is the squeeze was stopped already. Right. So if we go back, the squeeze was stopped. So what ends up happening is regulators, again, regardless of who it is, they step in and they say, this isn't going to go any further. This needs to stop here. And when that happens, they've already made the choice to put the ceiling on. So there's not really a world that I see where we go into the future. And then the regulators at that point are instead now like, let's just let it go. They've already shown where the line is. The line was here. We saw it. We saw when there was that fraction of a game stop share that traded for what? A few thousand bucks. So like we could very clearly see where the line is. So the reason why this matters is more for like the actual investor. It's not because, you know, I have a hope or dis-hope. I don't know if that's a word of this happening. I'm indifferent to it because I would trade it either way. But the reason why I spend the time talking about these things on these streams,",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 47,
      "start_timestamp": "00:54:08",
      "start_timestamp_seconds": 3248.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3248"
    }
  },
  {
    "text": "the actual investor. It's not because, you know, I have a hope or dis-hope. I don't know if that's a word of this happening. I'm indifferent to it because I would trade it either way. But the reason why I spend the time talking about these things on these streams, especially with like the ape community and the game stop folks, it's not to try to discourage people. You should again, do whatever is right for you. But it would be really frustrating if people go into this with an expectation not understanding the broader reality and making an informed decision, right? An informed decision being, let's say you have 500 shares of game stop. And let's say game stop starts making this parabolic run up. And then you're in the mindset because you heard somebody on, you know, Reddit somewhere say, well, I'm not, I shouldn't sell until there's telephone numbers. Okay. Well, what's really shitty is if you wait for that. And then it's now down here because the buy button got turned off, regulators stepped in and literally forcibly stopped the squeeze. That sucks. Now, the way that I would think about taking profit in an event like this is the way it's literally what I did, which is the standard scaling. So it's starting with a certain size position. As the move starts to heat up, it's phasing out slowly, keeping smaller bits on as runners so that you can enjoy the maximize the amount of",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 47,
      "start_timestamp": "00:55:37",
      "start_timestamp_seconds": 3337.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3337"
    }
  },
  {
    "text": "like this is the way it's literally what I did, which is the standard scaling. So it's starting with a certain size position. As the move starts to heat up, it's phasing out slowly, keeping smaller bits on as runners so that you can enjoy the maximize the amount of the move that you can get. Now, as I'll always point out, this is from a trader lens, right? That's what I am. I'm a trader. So that means that I need to move in and out of things. This is very different than the total lens, which is also completely viable. The problem with the hotel lens is that you lose the ability to make money on the market, the interim market movements that then can allow you to build in even bigger position. That's the main thing I try to make people aware of again, at least a consideration. So let's say, let's say that you have 500 shares. The way that I would think about it is maybe one to 150 become total. This means that they don't move, right? And this is 100, by the way. These don't move. These will stay in the portfolio. There's no doing anything with them. These are the ones that you're saying I want to hold all these. But then what that does is it gives you something to work with, 350 to 400 shares, that allow you to play these interim moves, right? So let's literally just look at",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 47,
      "start_timestamp": "00:56:53",
      "start_timestamp_seconds": 3413.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3413"
    }
  },
  {
    "text": "no doing anything with them. These are the ones that you're saying I want to hold all these. But then what that does is it gives you something to work with, 350 to 400 shares, that allow you to play these interim moves, right? So let's literally just look at a hypothetical to hopefully display the impact here. This we can get rid of. That's fine. We'll just go down here. So let's say that you have your 500 shares and let's say 100 gets locked up. Meaning you're not going to do anything with what basis do we want to use for the 500 shares? You guys tell me we can use whatever you want. I want to start the scenario from back here, though. So this is going to be adjusted, split adjusted. So I'm thinking like 375 or 4 bucks, kind of the high point. I'm not like bottom taking it. So we'll call it 4 bucks. Unless you guys have a number you want to use instead, you'll tell me. So we got 500 shares at 4 bucks. It means we have 2 grand invested at the onset. So what we're doing is we're saying we're going to take 100 of those shares. Same basis. And we're just saying I want this to just essentially be on its own, be removed from the sample. So then that leaves us our 400 shares at the same basis. 1,600 cost. So now let's say during this up move",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 47,
      "start_timestamp": "00:58:21",
      "start_timestamp_seconds": 3501.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3501"
    }
  },
  {
    "text": "going to take 100 of those shares. Same basis. And we're just saying I want this to just essentially be on its own, be removed from the sample. So then that leaves us our 400 shares at the same basis. 1,600 cost. So now let's say during this up move and this is using a weekly candle. So there's a lot of sub-movement that goes on in here. We'll actually zoom in a little more nuance so that you can see it more specifically. We got to go back. Really? That's too far. It doesn't matter. Okay. So let's say that you started with your basis around 4, meaning you had gotten in some time in this time period. Then you get your first leg up and now it's trading around 10. So for people that are holding game stop like double in change, that's really not that's not that much. Doesn't matter quite that much. So maybe not offloading here, but maybe setting a stop below. And let's say that the stop would sit somewhere around 824. So placing the stop below this near term support. So then what that does is we have a new spot that we are entertaining being stopped. So in this case, our stop would be 840, I think I said. Close to that, whatever. So then what we do is we can say, well, all right, if I get stopped here, I'm going to unwind maybe a third, 20. You can pick whatever",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 47,
      "start_timestamp": "00:59:49",
      "start_timestamp_seconds": 3589.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3589"
    }
  },
  {
    "text": "are entertaining being stopped. So in this case, our stop would be 840, I think I said. Close to that, whatever. So then what we do is we can say, well, all right, if I get stopped here, I'm going to unwind maybe a third, 20. You can pick whatever amount makes sense. But what I'm showing you is, like, this is a way to steadily scale into and out of a move. And I'm just going to spitball it really fast. But there's an important lesson that I just want you to keep in the back of your minds as we go through this. So let's say we run 20 position sizing. So we would take 80 shares down at this basis. So then that takes us 352 bucks. So this is what we have now. First starting in our profit pile. And we can see our residual shares that tinker with are now down to 320. Okay. So now let's say you get your next big leg up. And let's say during this bit of a down move, you decide to scale a little bit more out as it's hitting, let's say just below the high here, whatever, I'm just kind of picking numbers. But let's say 1640. Okay. So now I'm going to lock this one so that we can just drag and drop. So now we decide that we want to do another 20 scale. That means we're going to take 64 shares out. So now",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 47,
      "start_timestamp": "01:01:42",
      "start_timestamp_seconds": 3702.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3702"
    }
  },
  {
    "text": "I'm just kind of picking numbers. But let's say 1640. Okay. So now I'm going to lock this one so that we can just drag and drop. So now we decide that we want to do another 20 scale. That means we're going to take 64 shares out. So now our total PNL. is 1145. This is realized of our initial money. We have a 57 gain. So by all accounts, incredible return. But again, I know the way that this works for people that are doing this where most people are thinking, well, this isn't enough. I really want more. I'm looking for again, to have like life changing wealth. The problem with this is if you do that, then there's a chance you start to miss opportunities, which I'll show you. So then it starts skyrocketing up. You get like this big massive gap up. And on this big massive gap up, it starts trailing back down. But so let's say on the way down here, you decide to eventually get out. And I'm going to pick 70. I'm literally just picking a really low number relative to where it opened to start. So then we have another scale out. And in this case, we might run again, another 20 scale out. In this case, maybe 25 because it's up so big. So we increase our scale out amount a little bit. So now we're going to take 64 shares down at 70. That nets us 42 hundred",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 47,
      "start_timestamp": "01:03:32",
      "start_timestamp_seconds": 3812.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3812"
    }
  },
  {
    "text": "scale out. And in this case, we might run again, another 20 scale out. In this case, maybe 25 because it's up so big. So we increase our scale out amount a little bit. So now we're going to take 64 shares down at 70. That nets us 42 hundred bucks. That gives us 53 69. We've made 268 return. Okay. So now next day market opens. And it opens here at 66 and it starts going down on the day. Obviously it had this massive shot up. So let's say that there's two more exits that we take, maybe one above a hundred. And let's say the second exit would be below the low of this day. So let's call that 62. So when it's all the way up at 100. Let's say we might scale out 50 of the position at that point because again, remember, this isn't the whole position. You still have the total shares that are being used. So you're not getting full out of the position. But in this case, you just made nine grand. And then when we have this residual down move again, where we get out at 62, maybe we scale this down again to like 25. So here we're going to peel off. We got to move this one down. This times this. We're going to peel off another 24 shares. So that gives us another 1392. So we're going to do residual position 72 shares. Okay. So next day,",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 47,
      "start_timestamp": "01:05:35",
      "start_timestamp_seconds": 3935.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=3935"
    }
  },
  {
    "text": "this down again to like 25. So here we're going to peel off. We got to move this one down. This times this. We're going to peel off another 24 shares. So that gives us another 1392. So we're going to do residual position 72 shares. Okay. So next day, rallies back up. It opens gaps up here to 95. And then let's say you start scaling out again here when it's at like 86. And let's say that you're now getting a little more aggressive with trying to tailor this position down. That means we're going to drop 18 shares on those 18 shares. We make 1476. One of the things I want you to pay attention to here is look at how much money the account has made. The assumptions that I've made so far have never been top-ticking it. It's always been taking towards the lower end of the days. So I'm not like purposely overfitting tremendously. I'm overfitting because I we know it happened. But I also didn't I'm just scaling out at a regular set cadence fluctuating between 20, 25 and 50 sizing. Now notice how your account has actually grown 872. You've made money. Now your residual stock position here is 54 shares. And let's just say that we get rid of 80 of it here at 56. This is more so just to wrap the example up so that it doesn't go forever. So here we would unwind 43 shares. Get 2246. One",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 47,
      "start_timestamp": "01:07:30",
      "start_timestamp_seconds": 4050.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4050"
    }
  },
  {
    "text": "Now your residual stock position here is 54 shares. And let's just say that we get rid of 80 of it here at 56. This is more so just to wrap the example up so that it doesn't go forever. So here we would unwind 43 shares. Get 2246. One of the things I want you to pay attention to is how you're not having to unwind huge pieces of the portfolio in order to make a lot of money. So then let's say as it gets back down here and let's say when it closes here at 1317, you finish your exit. So on that residual position there, you make 396. You still have your 150 shares. But or your 100 shares. Here's the important thing. Now as game stop, let's say comes down here, sub sub 10 sub 11. Let's say in here, you decide that you want to start grabbing shares when it's at like 11 and change. Take a look at how much money you have. You just made 20 grand. So if we take a look at what we can get into based on the money that we made, you can get 1800 shares. Take a look at what you were able to start with at your 4 basis with 2 grand. Right? You were able to pick up 500 shares total. But by taking profit as things are moving, you can now, even though it's a higher basis, you can get 1800 in 26",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 47,
      "start_timestamp": "01:09:36",
      "start_timestamp_seconds": 4176.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4176"
    }
  },
  {
    "text": "a look at what you were able to start with at your 4 basis with 2 grand. Right? You were able to pick up 500 shares total. But by taking profit as things are moving, you can now, even though it's a higher basis, you can get 1800 in 26 shares. You can build a much bigger position. And over the course of this, for the person that chose to hold again, you got to do it's right for you. But their PNL would have looked massive. But it's an unrized PNL that's going to continue to move as long as the position is open. So the tricky part here is you kind of have to find what's right for you. But the main thing that I would look to at least put in front of you is the concept of doing both. You can absolutely sequester and hold part of the portfolio. But with something as volatile as game stop, there's so much money to be made based on these interim movements that can make a huge difference in your life. And I know what most people are doing. They're holding this 500 shares, hoping that they can sell it for 1,000. Or more, maybe even more. Who knows. But even if we take a look at your 1,000 sale, less your cost to get in times how many you have, it gives you 500 grand. Like that's if you timed it perfectly. It's a lot of money. But",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 47,
      "start_timestamp": "01:11:35",
      "start_timestamp_seconds": 4295.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4295"
    }
  },
  {
    "text": "it for 1,000. Or more, maybe even more. Who knows. But even if we take a look at your 1,000 sale, less your cost to get in times how many you have, it gives you 500 grand. Like that's if you timed it perfectly. It's a lot of money. But the probability of you getting to this price point is small. And then your ability to perfectly time your exit at that is also small. We can see that in this scenario, the highest it got was like 120 in change. So that puts you at 58 grand. That's if you top ticked it, you got out at the very top. So the point here is you have to think through what actually helps you the most. And there's definitely something to be said about holding for sure. There's also nothing that says that you can't hold the shares and trade options around it. That's another choice. The problem though that I will remind you of is let's say this scenario happens. And it goes up to 120. Your 500 shares are showing a profit of 58 grand. That's huge. And then time passes. And then it's back down to where we were here at 1317. Well, now what just happened? You're still making money, which is great. But you've literally made a fraction and it's still unrealized. So the way I would be thinking about your ability to position here is not just the process of like buying and",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 47,
      "start_timestamp": "01:13:07",
      "start_timestamp_seconds": 4387.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4387"
    }
  },
  {
    "text": "where we were here at 1317. Well, now what just happened? You're still making money, which is great. But you've literally made a fraction and it's still unrealized. So the way I would be thinking about your ability to position here is not just the process of like buying and selling for the sake of buying and selling, but you can literally also internalize it as what this allows you to do in terms of your ultimate objective. Even if you're one of like the stone cold hardcore apes, which I actually imagine most of you here probably aren't exactly that because I also know that there's a pretty big aversion to things like options and whatnot, which is obviously a big part of what I do. So that's just an assumption. I'm sure a lot of you are apes in that you've been around for a long time. But I would imagine most people here at least generally open to different approaches and ideas. And the beautiful part here is that with something like GameStop, you can make an insane amount of money while still ultimately pursuing your objectives. Because if you are one of those stone cold hardcore apes, and your goal is just to accumulate as many shares, well, guess what happened in this scenario that includes us trading in and out. You've gone from 500 shares. You're able to add 1826 in addition to the 100 that you held. So which one of these is achieving",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 47,
      "start_timestamp": "01:14:25",
      "start_timestamp_seconds": 4465.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4465"
    }
  },
  {
    "text": "apes, and your goal is just to accumulate as many shares, well, guess what happened in this scenario that includes us trading in and out. You've gone from 500 shares. You're able to add 1826 in addition to the 100 that you held. So which one of these is achieving that goal more deeply? Well, this scenario you have three times the position that you had in the first scenario. So as always, my objective is never to tilt the way you do things one way or the other. I view my mission in this space to simply provide information so that people can make the best possible choices for themselves. That fits your scenario as unique as your scenario will be. So that's my TED Talk for today. Anything else we should take a look at before I wrap up. You could throw it in the chat. Happy to take a look at one or two things real quick before I got a bounce. And then in the meantime, I'm going to get my dinner order rocking and rolling. Hems. We could take a look at Hems. Or Gems. A fun one, I actually think from the last one. One was I think it was this we were looking at. And it was funny because oh no, this doesn't. Was this it? No, magic. I think it was empty. No. Mind madness. This is it. This was funny because we were literally just talking about this during a stream",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 47,
      "start_timestamp": "01:15:46",
      "start_timestamp_seconds": 4546.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4546"
    }
  },
  {
    "text": "One was I think it was this we were looking at. And it was funny because oh no, this doesn't. Was this it? No, magic. I think it was empty. No. Mind madness. This is it. This was funny because we were literally just talking about this during a stream pretty recently. And we were just looking at the price behavior. And we had talked about how it did seem like this was in general, favoring upside, upside movement, right? Like that's it looked like it was at an interim spot. So I thought that this was actually pretty interesting that it ended up breaking the way that we were talking about. And I mean, it's still just respecting this broader trend pretty well. Anyways, I said I would look at Hems. Let's do that. Very sideways still like very much in consolidation. I would say, I think it still gets I've been setting alerts. My last one got triggered. That's why it was gone. But near term, it really needs to beat. It needs to beat this upside. And the good part is the consolidation looks like it's holding the elevated levels here actually quite well. So the way that I typically treat stuff like this is monitoring how well it continues to do this. And then if we start to get some tightening of the range, which generally will proceed a more explosive style breakout. The options chain have pretty significant call side skew, which I'm not so",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 47,
      "start_timestamp": "01:17:31",
      "start_timestamp_seconds": 4651.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4651"
    }
  },
  {
    "text": "that I typically treat stuff like this is monitoring how well it continues to do this. And then if we start to get some tightening of the range, which generally will proceed a more explosive style breakout. The options chain have pretty significant call side skew, which I'm not so sure that I had that in my bingo cards. Yeah. But we'll take a quick look and see how that actually materializes because I'm unsure in terms of total premiums. Let's see. One mil, a bit. I mean, there's still definitely still call side in terms of overall positioning. We take a look at the ball surface. See, this is a good example as compared to what you saw in GameStop of how there's just way more put skew. The calls are not trading super, super rich comparatively. So if we look at like a 31 delta here, you're getting 96 vol. Here at a 29, you're getting 90 vol, 90.82. So you're still getting a little bit of skew out a little bit further, but just not that much. A few points. So right now to me, Hymns just needs to figure out the consolidation. We're out. We actually have to click. So three point three against four six. So much tighter in Hymns. 7 to 4, 5. So there definitely is still like, there's still coffin up. Still definitely coffin up for the calls, but yeah, it's not like at an exceeding pace compared to the puts. The",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 47,
      "start_timestamp": "01:19:04",
      "start_timestamp_seconds": 4744.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4744"
    }
  },
  {
    "text": "have to click. So three point three against four six. So much tighter in Hymns. 7 to 4, 5. So there definitely is still like, there's still coffin up. Still definitely coffin up for the calls, but yeah, it's not like at an exceeding pace compared to the puts. The 60 handle, so pretty close to add the money than the 69s, that's funny. And it looks like there's some puts being built out. Yeah, it looks kind of sideways here to me. That's like the broader, that's the broader trend that I see it will have overhead resistance that it has to get through. And a big part of that is because of again, like this group in here. That might be, they might be willing to hold longer, but my guess is there will be a certain cohort that top tick this that we'll want to be getting out. These kinds of things, they look different to me when they have all this overhead that they're going to eventually have to get through as compared to stuff that less so. So like, if this was, if this giant you didn't happen, but it had good earnings, and I think part of what you're seeing here is post earnings announcement drift. Yeah, overall, pretty interesting. All right, game. Time for me to hop. Absolutely great hanging out with everybody as per usual. Be an outlier. You guys are.",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 47,
      "start_timestamp": "01:21:37",
      "start_timestamp_seconds": 4897.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=4897"
    }
  },
  {
    "text": "think part of what you're seeing here is post earnings announcement drift. Yeah, overall, pretty interesting. All right, game. Time for me to hop. Absolutely great hanging out with everybody as per usual. Be an outlier. You guys are.",
    "metadata": {
      "video_id": "XLlTYEvy-XA",
      "title": "GameStop Stock Analysis | Meme Stock Watch Ep43",
      "url": "https://www.youtube.com/watch?v=XLlTYEvy-XA",
      "upload_date": "",
      "duration": 5056.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 47,
      "start_timestamp": "01:23:49",
      "start_timestamp_seconds": 5029.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XLlTYEvy-XA&t=5029"
    }
  }
]