[
  {
    "text": "What's up everybody? Eric here. Welcome back to the Outlier Pack podcast and I have my friends here from Duneberg and there's no shortage of doom going on in the world today. So there's a bunch of topics I have queued up for us today. But first off, welcome back. It's great to connect with you again. Eric, we'll pledge to be here. Thirdly enjoyed first appearance and looking forward to another fantastic one as we wrap up another interesting week in the world. Yeah, interesting week. I like the framing there. So before we kind of talk about economic events and whatnot, I was right before we started recording. I was talking to you a bit about the post I was reading from you guys from your substack. It's from the second of August. It's called notes on X and it kind of just talks about your guys' experience when Elon Musk took over Twitter and then all the subsequent changes and the impacts that that had to your business. And like I was explaining to you from my perspective, I was kind of just watching the show because really there's very little impact to me, but reading your perspective was very eye opening on how like jarring a lot of that was. So I actually had a few follow on questions, but kind of to level set with the broader audience, what's like the high level impact in case somebody didn't catch that article, which I will link",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "perspective was very eye opening on how like jarring a lot of that was. So I actually had a few follow on questions, but kind of to level set with the broader audience, what's like the high level impact in case somebody didn't catch that article, which I will link for them to check out. Yeah, sure. We're professional content creators now doing burgers the work of our lives. This is how we make our living, how we feed our families and support our sort of economic well being. And when the new owner of Twitter took over, he had at least in secret, but then eventually made public that he viewed substack as one of the key potential future competitors to Twitter and what he envisioned Twitter would be, which is fine. He's the owner of that platform. It's his private property. He certainly paid enough for it, paid enough for it to have the right to do what he wants with it. And so it began with some fraudeling of substack authors and links to substack. And then eventually it just felt like the algorithm was targeting substack in general and then large substack accounts like ours in particular and our impressions and engagement on the platform collapsed, even though we hadn't really materially changed our efforts to try and, you know, to create good content for our followers. You know, at the time that we left Twitter, we had over a quarter million followers. We worked really",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "particular and our impressions and engagement on the platform collapsed, even though we hadn't really materially changed our efforts to try and, you know, to create good content for our followers. You know, at the time that we left Twitter, we had over a quarter million followers. We worked really hard to build up that fellowship to create that account to add value to our followers. And occasionally potentially induced them to come on over to substack and read a piece of ours. And maybe that would eventually lead them to become a subscriber. And, you know, the customer journey and the content space is impression to engagement to email to paid. And we spent a lot of time generating as many impressions on Twitter as we could. But at some point we were into now for a few months. When your impressions claps 90 and you're putting the same amount of effort in, maybe it's time to redirect your effort. And we're a very small team. We have a finite amount of hours in the day. It didn't it became no fun. And so we just laughed. And we decided to go all in on substack, which is, you know, our partners. And, you know, we don't take it personally. Of course, the new owner of Twitter could do what he wants with his platform, as we said in that piece. And, and so, you know, in our mind, substack has been our partners from the beginning. And then",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "know, our partners. And, you know, we don't take it personally. Of course, the new owner of Twitter could do what he wants with his platform, as we said in that piece. And, and so, you know, in our mind, substack has been our partners from the beginning. And then like, you know, we would much rather lose with our partners than win with an antagonist in this case. Even if that antagonism isn't personal, it's just business. Yeah. And it's just kind of a disruptor for you guys. One of the things I was curious about is like in the content business, we talked a lot of actually last time about your guys' approach to content. Cause I just find it interesting. But one of the things I'm curious how you guys approach is the idea of like being able to actually, you know, quote unquote own your audience, right? Because as long as you guys exist through these other platforms, that risk always exists. So is that just kind of something that you accept as a potential risk? And then as you are now adjusting as needed? Or is that something that you're thinking further out into and figuring out ways to actually own the relationship with the audience, not through the service of another platform? That's a wonderful thing about Substack is in fact, we do own our audience. We own our email list. It's ours. We could leave Substack tomorrow. And our subscribers wouldn't notice very",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "figuring out ways to actually own the relationship with the audience, not through the service of another platform? That's a wonderful thing about Substack is in fact, we do own our audience. We own our email list. It's ours. We could leave Substack tomorrow. And our subscribers wouldn't notice very much. Maybe our email delivery system might change. But we own the relationship with our customers via the payment processor as well. We have a separate account on Stripe, which is the the exclusive payment processor for the Substack ecosystem. And Substack, you know, probably to the chagrin of its investors has been extraordinarily generous with its author partners in that regard. They've always viewed their job to more than delight us. And in exchange, we would stay with them because it's a great deal. And frankly, it is a great deal. You know, somebody posted on notes, which is Substacks version of Twitter that we now post exclusively on. Asking us whether we pay the full 10 to Substack and boy, that sure seems like an awful lot for, you know, basically in editing software and a mailchimp knockoff. And we said, yes, we do. And it's worth every penny because it's way more than that. There are business partners and their 10 is what we agreed to pay them in the event that we succeeded. And we're not, you know, we're people of our word. But beyond that, Substack has 30 million emails in its ecosystem. And it",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "penny because it's way more than that. There are business partners and their 10 is what we agreed to pay them in the event that we succeeded. And we're not, you know, we're people of our word. But beyond that, Substack has 30 million emails in its ecosystem. And it has really great discoverability tools. And it's starting to gain critical mass. You know, their mission is to change the way people read on the internet and to improve the tone of discourse online. And if you are paying subscriber to Bloomberg, you get access to our comments section. And with every piece of e-write, we get hundreds of really intelligent links and questions. And I'm on there all the time. I'm personally answering every comment. And they know like it's the Bloomberg head writer that is also engaging in the comment section. And then we have almost 200,000 emails that on our subscriber list. That's an audience that, well, we don't own, but we have, we own the right to delight them. And we certainly have direct access to them. We can email them directly. And I think Substack is changing the way social media properties interact with their main contributors. You know, there's three types of people on social media, the sort of the lurkers and the occasional contributors. And then sort of the power years, the creators. And you need a critical mass of creators for a social media platform to work. Like if Facebook or Instagram",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "main contributors. You know, there's three types of people on social media, the sort of the lurkers and the occasional contributors. And then sort of the power years, the creators. And you need a critical mass of creators for a social media platform to work. Like if Facebook or Instagram or nothing more than just your friends, it'd get pretty boring after a while. But you can go and you could follow celebrities and athletes and musicians and experts in various fields and interact with them directly, which is the magic of social media. It's also the thing that makes Twitter a little bit toxic. And so, yeah, that it really is an amazing thing that Substack is trying to do. We certainly hope they succeed where investors and Substack. And obviously we're all in. Yeah, yeah, it's awesome. And that's kind of one of the reasons why I wanted to dive into that question. Because Substack is one of those interesting platforms where exactly to your point, it seems like there's a portion email list that you guys don't out right. And then, you know, there's still pieces that go through the platform, like the note section and whatnot. So it's very interesting to me to understand how you view those different kinds of interactions with your audience and where you're waiting your efforts and how you view some Substacks capacity to deliver on that. So, let's take let's take you, for example, I mean, you could deliver your",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "So it's very interesting to me to understand how you view those different kinds of interactions with your audience and where you're waiting your efforts and how you view some Substacks capacity to deliver on that. So, let's take let's take you, for example, I mean, you could deliver your podcast through Substack. And in so doing, you would collect emails of people who are interested to hear your podcast. And that as a creator, an email is way more valuable than a follow or a subscribe on YouTube, for example. And so I don't know why anybody who's on YouTube isn't also on Substack because you get, you know, basically, you get this amazing direct contact with people who are self-identifying as wanting more of your content. You know, and so it's really, I think, a magical place and to be clear, Substack has a far more cultural alignment with freedom of speech than the traditional social media platforms. They're very hesitant to censor or to remove content. You know, we curate our own comment section, for example, because it's, you know, behind a paywall and so it's a lot easier to handle. We like to say you control us, but you have to pay for the privilege. But like we will occasionally delete a comment that's out of line. We don't want to be the owners of our subscribers comments, but at the same time, like we want our comment section to be a curated place of learning",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "us, but you have to pay for the privilege. But like we will occasionally delete a comment that's out of line. We don't want to be the owners of our subscribers comments, but at the same time, like we want our comment section to be a curated place of learning and engagement and by and large, that's what it is. And it's really a wonderful thing. And so like, if I were you, I would be distributing your podcasts as video through the Substack platform and dub and identifying the people who really want to, you know, circumvent the YouTube algorithm and contact them directly. Yeah, yeah, it's actually a really interesting idea from my perspective, because exactly you're talking about one of the cool parts I've found with the podcast in general is the ability to put it a bunch of different places. Like I just started putting it on Spotify and what not because it's no extra work. It's just uploading another spot. But it's a good point. So pivoting over now kind of to what the world looks like today. If you were to summarize the three largest global factors that are of interest to you guys, what are they and why? Number one, the situation in the Middle East and whether or not the war spreads beyond Gaza, I think that's the most urgent, important, difficult to take apart as an outsider, you know, the geopolitical risk on the board. You know, whether it has been",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "what are they and why? Number one, the situation in the Middle East and whether or not the war spreads beyond Gaza, I think that's the most urgent, important, difficult to take apart as an outsider, you know, the geopolitical risk on the board. You know, whether it has been off of the North and then, you know, the US and in Syria and then maybe, you know, Lindsey Graham gets us where we start carpet bombing Iranian oil facilities and all bets are off, I think, for, you know, for risk in the markets and in particular oil, of course, and then the commodity markets. Number two is the war in Ukraine. I think very few people have on their, on their scorecards here at the potential for a collapse of the Zalinsky regime. It's not something we've written about, but it's something we've been studying and potentially thinking about writing. I think things aren't going nearly as well in Ukraine as the West would have us believe. And I think that these types of things tend to resolve at a speed that surprises people no matter how many times it happens. And then third is obviously the tensions between China and the US. I were paying close attention to the prospect of the Xi Jinping flying to San Francisco here for a conference, which would be, I think, potentially a positive development, but the tensions over Taiwan, the chip wars, tit for tat, trade war that seems to",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "between China and the US. I were paying close attention to the prospect of the Xi Jinping flying to San Francisco here for a conference, which would be, I think, potentially a positive development, but the tensions over Taiwan, the chip wars, tit for tat, trade war that seems to be escalating, but still simmering a little bit below the kinetic surface, as we might say, those are the three things in order. I think we're one headline away from, you know, catastrophe in the Middle East. I think the Ukraine war is putting Europe in a very, very bad situation. And then obviously, if the US and China could resolve their tensions, that would obviously be bullish. So we shall see. But those are the three just off the top of my head first time here in the question that we would be paying very close attention to. Got it. Well, if I could give myself a score, I got two out of three. So the first one I wrote down that I wanted to talk to you about was Israel Hamas, the second one was Russia, Ukraine. I did not include China, US, I missed that one. But I'm pretty stoked. I got two out of three. What did you include? Just out of curiosity, might be our fourth. So after that, I have fed rate policies recession, energy war fair, because I really like that article that you guys wrote. Those were the next kind of handful",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "I'm pretty stoked. I got two out of three. What did you include? Just out of curiosity, might be our fourth. So after that, I have fed rate policies recession, energy war fair, because I really like that article that you guys wrote. Those were the next kind of handful that I had listed out. Yeah, yeah. Well, let's take him in order. Where do you want to go? Yeah, well, definitely Israel first. And the reason why definitely Israel first is because like, I'm still in the reserves. So I follow this stuff very closely, obviously. And the overall relationship there is so fascinating to me against the backdrop of the typical American perspective, which not to talk down about ourselves, but it tends to be pretty ignorant. I feel like Americans are used to being in our own little bubble. And we sometimes forget that other people have other perspectives. So looking at what's going on over there, I think is very important, but also misunderstood by a lot of people. So can you talk from your perspective what's going on there and then the potential larger scale impact? So I think it's very important to state a front, but I know I am not an expert on the Israeli Palestinian conflict. I'm superficially knowledgeable about it. And I think it's important when analysts are on podcasts like this to state a front, whether they have any particular expertise to add. So for example, I'm far more comfortable",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "front, but I know I am not an expert on the Israeli Palestinian conflict. I'm superficially knowledgeable about it. And I think it's important when analysts are on podcasts like this to state a front, whether they have any particular expertise to add. So for example, I'm far more comfortable pontificating about the nuances of, you know, LNG market and natural gas, then I am about the causes and consequences of the most recent events in Israel. Now, of course, any outside human can look at this situation and be appalled at the events of October 7th, and we certainly work. And also be afraid of the risks involved and that this is a very, very serious event. And I think that the commodity markets in particular might be underpricing the tail risk of a spreading of this war in the same way that it did in the weeks ahead of Putin's initial moves on Ukraine. And we are, of course, we're defensive pessimists and we pondermers case narrow risks. And so when situations like these explode, we are of course, our instinct is to pondermers case narrow risk. We are looking closely at escalation on the north, it has a lot. And with Iran via proxies in Syria initially, but whether that kinetic battle, you know, spreads to direct conflict with Iran, obviously, there's some very narrow straits over there through which an awful lot of energy is shipped. And if those were to be interfered with, it could",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "a lot. And with Iran via proxies in Syria initially, but whether that kinetic battle, you know, spreads to direct conflict with Iran, obviously, there's some very narrow straits over there through which an awful lot of energy is shipped. And if those were to be interfered with, it could cause huge dislocations in the market. I have no idea how to solve the Israeli-Palestinian conflict. I think it is a tragedy of epic proportions. It is, you know, it is really just, it's just no other way to say it. It is sad that in 2023, humans are still capable of doing that to each other, what we saw in the seventh, for example. And it's disturbing. Well, Israel's response and whether they've gone too far in the humanitarian crisis and whether we get a pause or a ceasefire, these are all well beyond our expertise to really go into any great detail. And I just think it's important to say that, like, I don't know. But I do know that if conflict spreads, the consequences would be devastating and swift. And the transfer mechanism through which the economic impacts would spread to the rest of the world are pretty well known. So one of the things we did write about, though, was to contribute a piece about the US political situation and how the divided House, you know, the Republican Party's divisions could actually choke off supply of funds and military equipment to Ukraine, which in fact has",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "pretty well known. So one of the things we did write about, though, was to contribute a piece about the US political situation and how the divided House, you know, the Republican Party's divisions could actually choke off supply of funds and military equipment to Ukraine, which in fact has played out since we wrote that piece. I believe it was called minority report. It is just undeniable that in the US domestic political situation, which we do know something about support for Israel is far far more uniform and united, let's say, and strong than it is for Ukraine. Ukraine has become a political battleground for the 2024 elections. The Republicans, many of whom, you know, for whatever motivation, wouldn't mind hanging a loss on Biden ahead of the 2024 elections. And I think the need to supply arms and funding to Israel is great cover for them to choke off supply to Ukraine. And that's what we're seeing. And in the piece minority report, we mentioned how Pelosi had kind of stabbed McCarthy in the back. And that was a decision that she might come to regret because whoever would replace him would be less malleable than McCarthy on these issues. And of course, we see that McCarthy's replacement is in fact very much further to the right than he was and looks less ready to cut a deal on Ukraine. So that's the extent that the Middle East impacts Ukraine and that's a domino that affects European",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "on these issues. And of course, we see that McCarthy's replacement is in fact very much further to the right than he was and looks less ready to cut a deal on Ukraine. So that's the extent that the Middle East impacts Ukraine and that's a domino that affects European energy. There we can begin to be more comfortable about speculating, but you know, how the decades-long conflict between Israel and Palestinians, you know, resolves is well above our favorite. Yeah, well, and I always try to remind people that although we have like this veneer of civility conflict has always been there, I don't see it going anywhere. I see a continuing to change and evolve, but you know, like you were saying, it's kind of like sad and appalling. And I totally get that perspective. I think from at least from a military standpoint, none of this is shocking. It's kind of slightly different than what we've seen before as it typically continues to be, but humans are humans. Now, you mentioned one thing that I do want to dive a little bit further into on that first topic, though, is kind of the potential for the conflict to spread. Do you have any hypothesis on primary catalysts for that or what that could look like if it were to play out? Well, it should be said, and I hope this isn't controversial. There is a faction in the US that really wants war with Iran and has",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "to spread. Do you have any hypothesis on primary catalysts for that or what that could look like if it were to play out? Well, it should be said, and I hope this isn't controversial. There is a faction in the US that really wants war with Iran and has wanted war with Iran for a very long time. The Neocon wing of both parties, frankly, I think it is bipartisan. The Hudson Institute crowd has been angling for conflict with Iran for some time. I don't know why. Seems like a full hearty endeavor. You know, I don't know how many wars we need to lose before we decide that maybe we should be more selective in engaging in wars. The Ukraine situation is not going well. This comes on the heels of the, I think, scandalous exit from Afghanistan and the situation in Libya and Iraq. I mean, it's for all of the heroics and the sacrifice of the US soldier, what do we have to show for the sacrifices? Is that a conversation we need to have? And so I would argue that while we are engaging in a proxy war with Ukraine and provoking a trade war with China, is it really smart to open up a kinetic war with Iran? I mean, I don't know. Maybe I'm just a pacifist. I'm old enough to remember when being in the pro-Pace camp was considered liberal, almost borderline treacherous, and now it's considered alt-right Putin puppet. I",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "war with China, is it really smart to open up a kinetic war with Iran? I mean, I don't know. Maybe I'm just a pacifist. I'm old enough to remember when being in the pro-Pace camp was considered liberal, almost borderline treacherous, and now it's considered alt-right Putin puppet. I don't know. As the father of draft elbows of old children, I would prefer that at least we had a debate in Congress before we declared war. And we thought about the consequences, the objectives and the limits that we would place on the military as we engage in these things. But there's a faction of people in the US that want war the Iran. And I think away this war spreads as we provoke them or we have sort of a gulf thunken incident where something happens and gets blown up by propaganda. Next thing, you know, the war cries are whipped up internally. And off we go, and sad. I'm on a bash of the pro-Pace, on a bash of the pro-U.S. I think it'd be really great if our national defense focused on defending us, as opposed to proactively finding wars to go and drop bombs on people. You know, I guess when you're in the bomb making business, peace is a working capital problem. It's sad. But you know, and I'm sure we'll catch some plaque for saying these things, but we would be very much inward focused in our resource deployment, investing in our domestic",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "people. You know, I guess when you're in the bomb making business, peace is a working capital problem. It's sad. But you know, and I'm sure we'll catch some plaque for saying these things, but we would be very much inward focused in our resource deployment, investing in our domestic economy on our domestic entitlements, our domestic border security, and letting the rest of the world figure out what they want to do with each other. Yeah, it's an interesting perspective. So do you guys think that there's a way to operate in isolationism like that? Because when I hear those kinds of things, I honestly don't have much of a perspective myself. I genuinely view myself as too ignorant to have an educated opinion on it. I always just look at the problem set and think how tricky it is. The balance, internal, internal investments in internal infrastructure and internal focus versus forward projections for the purpose of internal loke, I have control. So I'm curious how you guys think about like that isolationism concept and the ability to look more inward. And I don't want to say for sake, but metal less externally. I think look, you could forget about just isolating the country. You could say the Western hemisphere is off limits. We could easily enforce that. If you do a circle around NAFTA, I mean, there's plenty of food and fertilizer and water and resources and oil and gas and coal. I understand that we have",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "forget about just isolating the country. You could say the Western hemisphere is off limits. We could easily enforce that. If you do a circle around NAFTA, I mean, there's plenty of food and fertilizer and water and resources and oil and gas and coal. I understand that we have allies around the world and that we have principles and so on. But at some point, if we're not going to be the global superpower, which we're kind of pulling back, we're sort of sending mixed messages to the world, right? I mean, we're pulling out of these places, but at the same time, we are sort of commanding and demanding the same level of respect that we used to have when we were truly dominant super power. And I would argue that we have underestimated the military might of our opponents. And it's okay to treat other cultures as people to deal with sort of on a peer basis. I don't, I'd be hard pressed to believe that the rest of the world makes up every day looking to go to war with the US. And maybe I'm naive and look, it's totally possible naive. And I'm sure there are people listening who will say that. I think we've got plenty of problems at home before we go about the world searching for other people's problems that solve. I don't know, that's just me. Do you think that's what the US is doing, that they're trying to look to",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "are people listening who will say that. I think we've got plenty of problems at home before we go about the world searching for other people's problems that solve. I don't know, that's just me. Do you think that's what the US is doing, that they're trying to look to solve other people's problem for them? Or do you think that it's more the US is looking to interfere in other places and solve problems that might come back and impact us? Well, that would be the Neocon argument that you know, better to fight over there than fight over here. I find that argument unpersuasive. But again, nobody comes and do bird to read these things. This is not really in our zone of expertise. I'm more expressing my personal opinion. Yeah, of course. And then anything we would write about. But that's the argument that the Neocons make is best to fight Iran and Iran. And my thought would be how about we just don't fight Iran? Like how about we figure out a way to reach some kind of a workable relationship with Iran with China, with Russia having for a bit. But there's the view that all of these countries are out to get the US and that we need to practically go in. But what's the end point? Like we're going to nuke all these people? What is the end point of a war with Iran? You tell me like what does victory look like",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "all of these countries are out to get the US and that we need to practically go in. But what's the end point? Like we're going to nuke all these people? What is the end point of a war with Iran? You tell me like what does victory look like in that scenario? Iran is the largest producer of oil for China right now. China's important, the largest importer of oil into China comes from Iran today. That's new, a recent development. We go to war with Iran. What do you think China thinks when it looks at Taiwan and it looks at its internal strategic petroleum reserves? Like how many wars do we want? Like to what end? What's the point? Like it's called national security. Does this improve or decrease our national security? I don't know. I mean at some point we need to have a conversation. Like again, how many wars do we want to lose? It's not like we have a glorious track record since Vietnam in this regard. Find me a place in the world where our military action resulted in a better situation that exists today. Look at at least at the end of World War II, look at West Germany and Japan and the reconstruction of Europe. Those were wars worth winning and we meaningfully invested in the longevity of the outcome. What's Afghanistan today? What's Iraq today? How many trillions do we spend on these wars? I don't know. But again, our",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "World War II, look at West Germany and Japan and the reconstruction of Europe. Those were wars worth winning and we meaningfully invested in the longevity of the outcome. What's Afghanistan today? What's Iraq today? How many trillions do we spend on these wars? I don't know. But again, our views on this aren't going to change. That's where I would lie personally. Yeah. Yeah. No, I ask the questions because I find it interesting. That's the whole idea is to promulgate different perspectives and to learn more. I think a lot of what you say is there's a lot of great thought behind it in my opinion. I agree with you. I think the idea of like starting conflict for the sake of it doesn't necessarily help most people, which is always why I go back to like I'm curious always like what the the true undertones are. And if it's kind of what what you're talking about in very well could be the case where it's just the large war machine needs conflict for profit. Yeah. Like that that very well has a big seat at the table. You can go back to Dwight Eisenhower's outgoing speech and look what a great president he was. We have the national highway system because of the same man who was pivotal to us winning World War II. And in his outgoing speech, what did he warn about? He warned about the situation we're in today. Now we have a we",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "look what a great president he was. We have the national highway system because of the same man who was pivotal to us winning World War II. And in his outgoing speech, what did he warn about? He warned about the situation we're in today. Now we have a we have these wars are undeclared by the way like I forget I know it's like probably just a detail, but the the Constitution says that Congress declares war like when when when the Japanese attack Brawl Harbor, you know, FDR went to Congress and asked for declaration of war now he got it and people were lining up around the corners to to volunteer for the Navy and for the Army and and so on and and great that's all put you know aligned with the Constitution today. We the president basically has the power to to to act in a way that amounts to undeclared wars. And I just don't think that's the way the country was founded and was meant to be we should be debating these things. Our Congress men and women and our senators should be putting their names to a vote. Do we want to go to war with Iran? Okay, what are our objectives? What what is the outcome? What's the definition of victory? I think of Colin Powell with with the war in Iraq. I mean, whatever you think of Powell and you know, it's subsequent speech in front of the United Nations",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "go to war with Iran? Okay, what are our objectives? What what is the outcome? What's the definition of victory? I think of Colin Powell with with the war in Iraq. I mean, whatever you think of Powell and you know, it's subsequent speech in front of the United Nations and all that in the first Gulf War. I mean, it was very clear. These were our missions. Now look, we didn't handle the victory very well, but at least from a most rare perspective. It was very clear. What we had a vote, by the way, it was a controversial poke and how people voted mattered over time. Now we just we've done away with all of these formalities as though they were irrelevant and this is a disturbing trend they interview. If the president can just randomly decide to emperor the US and various conflicts around the world with basically minimal oversight from Congress, that's a very dangerous situation. Leads me to another question I have for you. And again, I know this is this might be a little farther outside of your typical preferred wheelhouse, but it is something I just personally am trying to understand better is this increase in like the use of impeachment. I was reading a couple articles yesterday about, you know, people attempting to start the impeachment process for Biden. Have you seen me did all that for Trump? Do you have an opinion or any thoughts on the increase of use",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "is this increase in like the use of impeachment. I was reading a couple articles yesterday about, you know, people attempting to start the impeachment process for Biden. Have you seen me did all that for Trump? Do you have an opinion or any thoughts on the increase of use of that as a political tool? Sure. It's bad. Yeah, they impeached Trump twice. Once over Ukraine, ironically, as you may recall, I'm like an afterthought now seems like a lifetime away. I do think this all of course goes back to Clinton and his refusal to resign. And he stuck it out and he quote unquote one, but did the country lose. There was a time when politicians who were caught up in such scandals resign and that was considered the honorable thing to do. And Clinton didn't and he fought impeachment, anyone. And unfortunately, I think the the weapon of impeachment has become desensitized in the eyes of the voting public and our hyper polarization of our politics means that whoever is doing the impeaching is just viewed by the other side as being, you know, seeking point scoring against the other team. So I would argue there is no crime a president commit today that would convince his his or her party that that is worthy of impeachment because it's just been desensitized. The Democrats will land up behind Biden no matter how much evidence of corruption in Ukraine is on earth. And the Republicans will line",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "is no crime a president commit today that would convince his his or her party that that is worthy of impeachment because it's just been desensitized. The Democrats will land up behind Biden no matter how much evidence of corruption in Ukraine is on earth. And the Republicans will line up behind whoever might be their next president in a similar circumstance. And then we have lost sadly, we have lost the ability to objectively use tools like impeachment for their intended purpose, which is to rid our politics of corruption. But our politics are so corrupt that it's laughable. And impeachment is no different than the knock them out, drag them out, wars over Supreme Court appointees. There's just another partisan battleground and people will be impeached for no good reason and people who should be impeached remove from office will survive because the tool has law. The knife is dull. It has been improperly used and has converted into yet another partisan, you know, just like in distinguishable from battles over redistricting, you know, redistricting of elections and so on. It's just another tiresome team sport food fight. No, it's kind of the answer I was expecting you to say, but I was hoping that there was something I wasn't considering. But yeah, pretty. Sorry to let you down. I sometimes I do realize that I look at some of this stuff with like rosy glasses hoping that there's just something purposeful that I'm just not seeing. But",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "to say, but I was hoping that there was something I wasn't considering. But yeah, pretty. Sorry to let you down. I sometimes I do realize that I look at some of this stuff with like rosy glasses hoping that there's just something purposeful that I'm just not seeing. But yeah, that sounds about right. You mentioned before I want to skip number two for a second, which is Russia Ukraine, and I want to go right to number three, which is kind of US China and Taiwan. That relationship continues to be fascinating to me. Obviously, the US is very interested in Taiwan for the semi conductor business, which they're actually talking about and creating incentive is an infrastructure to start localizing here in the US. How do you think that that impacts the relationship with the US and China specifically as it pertains to Taiwan? I think it is incredibly difficult to replicate what Taiwan does in the semi conductor space. I think the secret sauce involved in effectively running a semi conductor supply chain is vastly more difficult than anybody over here even can begin to understand. I've sold into that market. I understand it pretty well when I was in industry. The secret is in the humans and in the technicians and that's just it's not like you can write down a set of standard operating procedures that you can copy and paste and build a plant in Milwaukee and suddenly you're up to speed in",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "when I was in industry. The secret is in the humans and in the technicians and that's just it's not like you can write down a set of standard operating procedures that you can copy and paste and build a plant in Milwaukee and suddenly you're up to speed in competing with the Taiwanese with respect to semiconductors. It is truly a point source of vulnerability for the global economy that even China itself who's spending tens if not hundreds of billions of dollars trying to replicate it can't quite do it. In fact, of course, it's in Taiwan's interests have not really landed on what else replicated because if anyone else could do it, then there's no urgent need to defend Taiwan against an incursion from China. But I would say the one thing that I see missing from the discourse is just how incredibly difficult it would be to do this. In fact, I would argue the vast majority of money allocated in the US for this exercise will be totally wasted. Which I have an answer for you. Do you think it's potential for the semi conductor industry to even be moderately effective here in the US? Do you think that kind of where Taiwan is so far ahead that it's just a fool's errand in total? Well, you know, in design, we're very strong, of course, but China is trying to catch up, which is why we wrote this piece about the RMIPO and Massa Sun's",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "Do you think that kind of where Taiwan is so far ahead that it's just a fool's errand in total? Well, you know, in design, we're very strong, of course, but China is trying to catch up, which is why we wrote this piece about the RMIPO and Massa Sun's dropping of bags on Western investors because basically, RM China has been confiscated by the Chinese government even though it's undeclared. And so the closing the gap on design is a lot easier. You could steal that IP than it is on the fabrication side of things. And that's where it is still very much a magic and an art. It is difficult for people to just assume this is just another production process that can be copied. And it just isn't this is just not how senate conductors work. And we've been researching a piece on this for some time. Can't quite figure out how to add a unique angle to it that isn't already out there. We might just highlight this and a few other things that we know about the sector. But it's very, very difficult to replicate what Taiwan has. And if war does break out and those facilities are damaged, for example, you're going to see catastrophic consequences for the global economy. What makes it so difficult? Because I think about what the US can produce I think about a lot of the just insanely complex intricate items that we're able to make now. What",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "and those facilities are damaged, for example, you're going to see catastrophic consequences for the global economy. What makes it so difficult? Because I think about what the US can produce I think about a lot of the just insanely complex intricate items that we're able to make now. What makes what Taiwan is doing so difficult to replicate? It's the yield. You're talking about nanometer level features that you're you know, etching onto super pure silicon wafers. And that there's just an institutional knowledge that is built up. It's literally master mechanics. Renching on complicated cars is the best analogy that that you know, there's just certain people that know when you hear the tone of a knock exactly what's going on and where to wrench. And it's that way. And of course a lot of this is kept in house inside these companies as trade secrets. And they would never put it in a pattern because that's just something that makes it easier for people to steal. And so it is just if you've ever been to one of these, you know, the astronomical lengths that one has to go in order to produce semiconductor chips of some reasonable yield and purity with some economic, you know, efficiency. You're talking amongst the most sophisticated industrial processes that humankind runs. And so it might feel impressive to go to a factory that makes very high precision screws. Right. But this is a whole nother plane Eric. And it just",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "reasonable yield and purity with some economic, you know, efficiency. You're talking amongst the most sophisticated industrial processes that humankind runs. And so it might feel impressive to go to a factory that makes very high precision screws. Right. But this is a whole nother plane Eric. And it just it just is decades of institutional knowledge in the hands and minds of a very small number of people that has passed down and apprentices and so on. And and the cultural barriers to translating that knowledge from say a laboratory technician in Taiwan, which by the way has a whole different definition and and sort of societal pedigree than a laboratory technician might have even in Switzerland or or in the US. And so it's just very, very challenging. And so I only point that out not to say it's impossible, but to say the timelines that our planners are anticipating that they might be able to close that gap, I think are vastly optimistic. And and this is a known issue for anyone in and around the industry for for the better part of decades. Like it just is really hard to do. And that's why Taiwan does it so successfully because this is their part of the value chain that they have mastered. Right. Yeah. Makes tons sense. It's funny because I've done a bunch of bunch of homeworks. I used to invest a lot in things like Intel AMD so on and so forth. So I",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "it so successfully because this is their part of the value chain that they have mastered. Right. Yeah. Makes tons sense. It's funny because I've done a bunch of bunch of homeworks. I used to invest a lot in things like Intel AMD so on and so forth. So I spent a lot of time learning about just the world of chip making. So I think the way that you described it there, though, is really understandable for people. So thanks for going into that that detail. Because I think that that is really important for people to grasp, especially as I look at the relationships between US and China, a lot of people I hear will say something as, well, why don't we just make them here? Right. And I think you very, very eloquently summarize why that is so difficult. So I think it's just a good perspective to get out. So on that same thread, though, what does the relationship now with the US and China look like going forward? I think much depends on the upcoming potential, you know, meeting between G and Biden. If it happens in San Francisco, mixed signals in that regard, we would hope that there would be a path for de-escalation. But we have we have ceded control of choke points in our economy to China. This is not a secret to anybody. The de-industrialation of the US has come at the expense of our capacity to manufacture and has benefited",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "would hope that there would be a path for de-escalation. But we have we have ceded control of choke points in our economy to China. This is not a secret to anybody. The de-industrialation of the US has come at the expense of our capacity to manufacture and has benefited China. Geopolitically, we wrote a piece called geopolitical warfare where we talked about how China allowing its domestic manufacturers the right to pollute with a band-in has caused sort of a crowding out of good manufacturers from the market. Because if you're, I would like to say, if your competitors idea of a water treatment plant is a pipe to the river, you have no hope of competing on cost. And Western buyers of commodity goods don't really care about such things, even though they like to proclaim their environmental bonafides and they have really fancy nice booths at COP28. And they talk about how, you know, they have these great sustainability programs. For five cents a pound, they will they will take all of your volume and give it to the dirtiest producer in China. And they just don't care. I mean, it's all off the side. It's all BS. And so China has used this to their advantage and has rolled up. For example, China processes 100 of the world's rare earth metals. So even if we have a rare earth metal mine in the US, that material must be shipped to China for processing before we can",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "BS. And so China has used this to their advantage and has rolled up. For example, China processes 100 of the world's rare earth metals. So even if we have a rare earth metal mine in the US, that material must be shipped to China for processing before we can be used in a magnet or an electric motor or things like that. Everywhere you look, China has essentially monopoly control in key choke points, same thing with solar. They own 97 plus percent of the Ignat forming and wafering and sell mounting markets, which means the three remaining polysidic complaints in the US have to ship the material to China for further processing. So we have given China control over these key monopoly choke points. And it's almost predominantly because they allow their domestic producers to pollute. And we don't because we care about the environment. And our proposal wasn't that we should allow our domestic producers to pollute. Our proposal was that we should offset the cost of installing world-leading pollution controls so that they can compete on a level playing field with the Chinese manufacturers because the ability to pollute amounts to an illegal and undeclared subsidy for their domestic manufacturers. And so China is willing to degrade its environment in order to gain geopolitical power against us and they do so routinely and it's high time. We wake up to this fact and do something about it. I agree and I see your perspective on China",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "for their domestic manufacturers. And so China is willing to degrade its environment in order to gain geopolitical power against us and they do so routinely and it's high time. We wake up to this fact and do something about it. I agree and I see your perspective on China improving its position. What are your thoughts though on the areas that China is still reliant on the US for? The reason why I ask is because I think when I look at the relationship between the US and China and the potential conflict in Taiwan, in my perspective, I always viewed it as a low probability event because of still yet how intertwined the US and China are reciprocally. Does that impact or do you have any thoughts on that specifically? Sure. The number one thing that Chinese Communist Party cares about is feeding his people. So obviously a big vulnerability is food, which is why you see China making strategic moves in the US X sector. And I think their purchase of Syngenta many years ago should be viewed through that lens. It was one of our early pieces, almost embarrassed to send out a link to it because we've gotten so much better at writing these now. China cares very deeply about making sure that everyone's plate domestically is full. That is the one major point source of weakness. There are others high in chips, for example, which is why the Biden administration has been trying to",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "because we've gotten so much better at writing these now. China cares very deeply about making sure that everyone's plate domestically is full. That is the one major point source of weakness. There are others high in chips, for example, which is why the Biden administration has been trying to ban their export to China and China has reciprocated by painting things like graphite and there's some talk of rare earth export controls as well. They have cards to play. We have cards to play. I don't think anybody wins a race to the bottom. I think, you know, ever escalating economic warfare only leads to inevitable kinetic warfare, which would be a catastrophe for both countries. So one would hope that the concept of mutually assured destruction both economically and militarily would allow for sainter heads to prevail. But again, when you talk about bringing all of these three potential battles to the same consideration, if the US and Iran get into a hot war, that puts China in a very prepared situation from an energy perspective and might motivate them to escalate their conflict with Taiwan and get it done while they still have oil in their reserves. Or it might have boldened Putin to go even harder in your crane because the US has distracted now and its limited military supplies are being rerouted to the Middle East. And what does that mean for Poland and for NATO and for Germany? Because it's all manner of dominoes",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "Or it might have boldened Putin to go even harder in your crane because the US has distracted now and its limited military supplies are being rerouted to the Middle East. And what does that mean for Poland and for NATO and for Germany? Because it's all manner of dominoes that get pretty scary to contemplate, which is, you know, to circle all the way back. Like perhaps we should ponder these things before we, you know, are so bella coast with people that we should frankly be treating as peers and not adversaries. You brought up Russia, Ukraine earlier, you brought up the idea that you felt we might have underestimated or the US is kind of playing down the progression of the conflict. What makes you say that and what's your perspective on the conflict? So again, not our primary area of expertise. But if we just compare... I just got to say, it sounds like for the podcast, I've done a great job spending the whole time talking about self-hands, I can't get an expertise. I mean, I'm happy to talk about anything, but I just want to make sure the audience doesn't assume that we have some, you know, some something unique to add other than our personal opinions. And so I'm very careful to make sure that we, again, if you want to talk to me about the nuances of the polyethylene supply chain, I'd be more than comfortable saying, yeah, let me tell you",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "some, you know, some something unique to add other than our personal opinions. And so I'm very careful to make sure that we, again, if you want to talk to me about the nuances of the polyethylene supply chain, I'd be more than comfortable saying, yeah, let me tell you about it. Our view is if you just compare the propaganda of the springtime quote-unquote offensive to where we are today. And we see the disastrous trip that Zelensky had in particular the Fiasco and the Canadian parliament, which probably not many of your listeners are aware of, but I think was a real public affairs fiasco for the war effort. And then the fact that Putin's still there, our sanctions didn't work as much as we predicted, and we caught a lot of flak for pointing out that these were terribly designed sanctions that he could easily sort of vent and he has, we haven't destroyed the Russian economy. Putin is still wildly popular within Russia. And then just saying these things, of course, gets you in trouble over here, which is another sign. Like if we were so confident in our position, we wouldn't be trying to stamp down people who might have a different opinion than the consensus. And I think Zelensky, you know, he's been sacking generals recently, and there seems to be very little progress in this so-called offensive. And frankly, the war in Israel, and it is a war, it's a declared war really",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "down people who might have a different opinion than the consensus. And I think Zelensky, you know, he's been sacking generals recently, and there seems to be very little progress in this so-called offensive. And frankly, the war in Israel, and it is a war, it's a declared war really between Israel and Hamas, is causing the US to redirect its focus and its military supplies to Israel. And that has to come at the expense of Ukraine. It's not like we have an infinite supply of arrogance. And so I think time will tell, these aren't things we're hoping for. These are things that we're pointing out as serious risks given the situations that are unfolding. And by the way, like if we can't supply both Israel and Ukraine at the same time, what does that mean for our ability to fight a war with a ran-let alone child? You know, like I think one of the reasons why you don't get in the wars is is you might lose them. I don't know, it seems very common sense to me, like again. And so I just think, keep a close eye on Ukraine. That would be my sense. Based on the people that we follow, and we try to get both sides, and we read the pro-Ukraine Western reports, and we do read, you know, and listen to a few pro-Russian stuff as well. And I don't think there's anything wrong with doing that, like you try to",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "Based on the people that we follow, and we try to get both sides, and we read the pro-Ukraine Western reports, and we do read, you know, and listen to a few pro-Russian stuff as well. And I don't think there's anything wrong with doing that, like you try to get a holistic view and come to your own opinion. Our view is there's a bit of panic on the Zolensky's team. Correctly so if we were him, we would be rather concerned as well. You may remember he tried to invite himself to Israel and Israel spurned him. I think Israel would probably view Ukraine as a threat to Israel's security now because that basically, whoever gets the weapons wins the wars, and they would be viewing Ukraine as competing for limited U.S. resources. And there's a view in the U.S. that we could fund all of this and that we could supply all of this. And maybe we can. I don't know, we shall see, but I would view and put it away. The least happy person to see a connect conflict breakout in the Middle East, obviously, besides the direct compatriots and the victims and so on, but from a geopolitical perspective, that the least happy person to see those events on Zolensky, I just think that's on the diable. Sure. Yeah, I mean, he obviously sees his resources, potential pull up resources dwindling there. I think I go back and forth, not that it, my opinion",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "but from a geopolitical perspective, that the least happy person to see those events on Zolensky, I just think that's on the diable. Sure. Yeah, I mean, he obviously sees his resources, potential pull up resources dwindling there. I think I go back and forth, not that it, my opinion matters either, but I think the progression of the conflict in Ukraine has been fascinating to me from just a militaristic standpoint. Because it's funny when you said that we over or underestimated like the military might of some of these other peers. And I think from a military, militaristic standpoint, most of us look and we think we're the flock of the Russians. Like we actually are overwhelmingly underwhelmed with how how they're performing. And that's not to say that Russia doesn't have the capacity to really do a lot of damage. In my opinion, they've been pulling a lot of their punches because I at least in my ignorant assessment, I don't think Russia is trying to eviscerate Ukraine. Yeah. I think that conflict goes down to a cultural level so they're not coming in super heavy-handed, but still we can glean a lot from their tactics. And a lot of this stuff that we see from both sides exactly to your point, not just pro-US or pro-Western media, you can see some of the tactics, techniques and procedures that are deployed. And it's a amateurish at best, which I find very fascinating. No, good sort of. No,",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "a lot of this stuff that we see from both sides exactly to your point, not just pro-US or pro-Western media, you can see some of the tactics, techniques and procedures that are deployed. And it's a amateurish at best, which I find very fascinating. No, good sort of. No, I'm just going to say like these again, well, beyond you have far more expertise in this area than I would. I wouldn't know a sophisticated tactic from a Borsh one. I just don't have the knowledge. I would just say I don't think either side anticipated that we would be where we are some 20 months into the conflict. I think there were many who expected that Russia would just steamroll, perhaps some even within Putin's inner circle, and there were many in the West that expected that our sanctions would cause the Russian economy to collapse and for regime change to occur in Moscow, and that hasn't happened either. And I think, look, I mean, obviously punches are being pulled because nobody, no nukes have been exchanged. Like the U.S. has nuclear weapons. Russia has a very vulnerable suite of nuclear weapons as well. I do think that by definition, as dastardly as this war has been, and as catastrophic, it has been for the citizens of Ukraine in particular, it could be way worse. I mean, we could be dropping nuclear weapons on each other. And we're not thankfully. Let's hope that never happens. But yeah, I",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "by definition, as dastardly as this war has been, and as catastrophic, it has been for the citizens of Ukraine in particular, it could be way worse. I mean, we could be dropping nuclear weapons on each other. And we're not thankfully. Let's hope that never happens. But yeah, I mean, I think nobody had on their bingo card that 20 months on, we would be basically roughly where we were when the war started. I think it goes back to a point you said earlier that I do find tends to repeat itself when we were talking about semi-conductors in the timeline that the U.S. laid out for domesticating some of that. I feel like in general, people are far too optimistic with their timelines. And I think we see this across multiple facets. But to your point, I agree with you because I think if you ask most people, when does this come to a conclusion? I mean, the U.S. it's like fly by night, right? As soon as something has been around for a little bit, we're bored and tired of it. We need something new to focus on. I'm actually curious if you ask most U.S. citizens if the war in Ukraine is still going on, what they would say. I'm genuinely curious the answer to that. And I bet you none of them could find for me on a map. Again, that's not to insult the U.S. public. It just goes to show you how",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "citizens if the war in Ukraine is still going on, what they would say. I'm genuinely curious the answer to that. And I bet you none of them could find for me on a map. Again, that's not to insult the U.S. public. It just goes to show you how far away all this is. And look, if you're a citizen of Ukraine, it's outrageous what Putin has done to you. And the recent turn of events are catastrophic. And again, this is not what the outcome that anybody's cheering for. But as analysts and realists, you try to figure out what the answer is going to be and position yourself accordingly. But yeah, it's it. There are no winners in a war. I mean, who wins in a war? I don't know. Like, you think the Russian shoulders who have died on the front of Ukraine is fighting people that look and talk like them. Or winners in this war, of course not. And Ukraine is certainly not winning the war. I don't think Putin standing in the world has increased because of the war. I don't know. I personally, if I were a leader on the geopolitical state, which I'm not, I would have a far, far higher bar to connect a conflict, especially if I was the most powerful military in the world, which the U.S. is. So that would just be me. Yeah, interesting. We have about a little less than 10 minutes left. I want",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "which I'm not, I would have a far, far higher bar to connect a conflict, especially if I was the most powerful military in the world, which the U.S. is. So that would just be me. Yeah, interesting. We have about a little less than 10 minutes left. I want to pivot us a little bit more now to kind of future focus. Come into the end of 2023, we're kicking off 2024. Are those primary focus areas that you outline in the beginning, your primary focus areas going forward? Or are there other things that you guys are integrating into your sphere of interest as we enter 2024? Yeah, only to the extent that those three things influence the energy markets. Obviously, you know, energy is our bread and butter. It's where we were born and raised. And it's what we write most about. And so our view is predominantly focused on second and third order impacts of those events, which is the only real motivating reason for us to try and even get a superficial understanding of them and the potential scenarios. But our big focus right now is we think we've reached peak ESG. We think the world is embarking on a nuclear Renaissance. That road won't be without its bombs. And we saw one this week with new scale and SMRs and so on. But by and large, physics is beginning to reassert itself. And we recently wrote a piece about how this computing power race,",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "world is embarking on a nuclear Renaissance. That road won't be without its bombs. And we saw one this week with new scale and SMRs and so on. But by and large, physics is beginning to reassert itself. And we recently wrote a piece about how this computing power race, which is of course tied up with China and semiconductors and data centers and so on, might be the conduit through which nuclear energy is normalized again in the Western world, not that it ever should have needed re-normalization. But we talked about how a piece called Fission chips, which is one of our favorite titles, how artificial intelligence could in fact disrupt the energy markets. And so our objective is to process the news headlines of the day through the lens of energy for our subscribers. And we always remind ourselves like nobody goes to the weather channel or geopolitical pontifications about obscure wars. And people come to do more for energy and we want to delight our subscribers. And so we do try to focus our thoughts and research on how these second and third order consequences might find their way back into the energy market. Right. And I always think it's fascinating to how well markets, specifically commodities markets, can help us understand just these esoteric, ambiguous problems because to your point, you can glean a lot of information. And you said in the beginning that you felt the commodities markets might be underplaying the potential risk.",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "I always think it's fascinating to how well markets, specifically commodities markets, can help us understand just these esoteric, ambiguous problems because to your point, you can glean a lot of information. And you said in the beginning that you felt the commodities markets might be underplaying the potential risk. What makes you think that? I just think if you look at the price action, well, okay, there's two interpretations. The price action in oil is telling you that war is not going to spread in the Middle East. Or the price action in oil is underestimating the spreading of war in the Middle East. And so those who believe that the market is able to foresee such things would say the situation in Israel's contained. It's catastrophic as it is for the people involved. It's highly unlikely that it's going to spread to Iran. The Chinese will keep Iran at bay and the US will come to its senses and realize it has limited aromance and will put on a big show and we have a bunch of aircraft carriers, you know, over there now, which is one of the greatest assemblies of military force since the last Gulf War. I'm pretty sure you know when you're following. And so sometimes when they show up, they, you know, battles just happen to break out because of there, but we shall see. But the market is telling us that war is not going to spread. I don't know if you",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "War. I'm pretty sure you know when you're following. And so sometimes when they show up, they, you know, battles just happen to break out because of there, but we shall see. But the market is telling us that war is not going to spread. I don't know if you disagree, but oil is down materially from where it was the day before October 7. And so if there was truly a kinetic conflict between the US and Iran on the horizon, I don't think we'd see WTI in the high 70s. I just don't see it. Right. And have you, do you guys have any works that you've done studying the predictive capacity of something like oil against those kinds of conflicts? See how, yeah, how predictive it is? I mean, it failed in the in the rest of Ukraine war, but at the same time, you know, I haven't validated it as I've read it in multiple situations, but apparently the US stock market bottomed out on the day of the battle of midway. Now, again, I've read that from enough, respectable people, but I have not independently gone and validated that. But nobody knew what happened in midway for weeks after the battle, right? But the market sniffed it out. So that's held up as the example of the market being all-knowing. I would argue that the energy market's performance in the 10 days before Russia rolled into Ukraine was not predictive. And so I guess we'll",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "midway for weeks after the battle, right? But the market sniffed it out. So that's held up as the example of the market being all-knowing. I would argue that the energy market's performance in the 10 days before Russia rolled into Ukraine was not predictive. And so I guess we'll just have to see how it does here. I gotta say it's always in absolute pleasure to talk with you guys. And I know that for this one, I kind of kept you outside your typical sphere of specialty, but there's a couple reasons why I like to do that, to be honest, because you guys produce a lot of content in that space already. So a lot of what I like to do is explore some of these offshoot threads, because I do think very similarly to your perspective in that you can use markets, you can use commodities to then infer information. And it's really cool to hear what conclusions we arrive at looking at events through those lenses. So thank you for spending 40 minutes plus walking us through some of those dots that you connect in the way that you see the world. Awesome. Yeah, I really appreciate it and really enjoyed it and get in the look forward to a third appearance. Yeah, absolutely. And then I'll throw a link in the notes below with all of your guys' contact information for people to reach out to you as they would like. But thanks for",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  },
  {
    "text": "really appreciate it and really enjoyed it and get in the look forward to a third appearance. Yeah, absolutely. And then I'll throw a link in the notes below with all of your guys' contact information for people to reach out to you as they would like. But thanks for hanging out on the podcast. And we will talk to you again soon.",
    "metadata": {
      "video_id": "xOMa0r5zaMg",
      "title": "Economic Disarray with Doomberg | The Outlier Podcast Ep53",
      "url": "https://www.youtube.com/watch?v=xOMa0r5zaMg",
      "upload_date": "",
      "duration": 3372.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=xOMa0r5zaMg&t=0"
    }
  }
]