[
  {
    "text": "What's up outliers? Just wrapped up a live stream talking about the recent options activity in GameStop making a quick video to recap everything that we talked about because it was a lot. So today we saw the continuation of some really interesting short put behavior in GameStop that's worth talking about. Now first, I want to show you this. This was actually in a post I made earlier that is the perfect starting point. And you'll notice the overall size of option premium both call input. That's what the green and red squiggly lines are here. And if you just notice the last two days, what do you see? You see a very severe line, meaning they go much wider than the others, which is the overall premiums. And you see that they're stacked together in the last couple days. So what you can conclude from this is that there have been a pretty significant amount of put premium in the last two days. And you conclude that most of it is been sold. So in a vacuum, when we see that we often will think sold put bullish trade, you can't conclude that here yet. It's way too early. And the other thing is you have to remember the counter parties to stuff like this will have this position as part of a total portfolio. We don't know what else is in the portfolio, which is really important because we don't know how this fits in with things,",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=0"
    }
  },
  {
    "text": "early. And the other thing is you have to remember the counter parties to stuff like this will have this position as part of a total portfolio. We don't know what else is in the portfolio, which is really important because we don't know how this fits in with things, whether it's actually bullish bearish offsetting delta's that kind of stuff. Now, let's focus on the positions in a vacuum. And again, I got hit up a lot on the activity today, but I think it's worth noting for everybody that the activity started yesterday at a different strike here. It started at the 95s. And then it wound at the 105s. So let's take a look at what's going on. First things first, we need to take a click into what's going on as far as volume and open interest. So if we take a look at the highest volume contracts on the day, we can clearly see that the 125s out in 2025 are getting busy. But if you take a look at the price on these, they're actually really cheap, right? 17 cents. So the total volume of 6,000 contracts is still heavy, but it's not that not that much in terms of premium adjusted size. That's different when you go down here. The 105 puts that are 253 days out. They're trading around the 79 handle in terms of premium. And the volume here seems small, right? 2700 contracts, right? Not like a ton of volume.",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:32",
      "start_timestamp_seconds": 92.79999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=92"
    }
  },
  {
    "text": "not that much in terms of premium adjusted size. That's different when you go down here. The 105 puts that are 253 days out. They're trading around the 79 handle in terms of premium. And the volume here seems small, right? 2700 contracts, right? Not like a ton of volume. However, when you adjust this based on premium, they're actually pretty big trades. So if we take a look here and we just size up some of the premiums that have been rolling through, you can see that the trades that came through today were in blocks of like 23, 24, 25 in the 20 handles. Almost all of these are 95 delta plus effectively a one delta. And the premiums ranged, you know, around 170 to 190 anywhere in there. These are the 125s that came in at the offer, by the way, not the 105s. These are the ones that we're looking at primarily today. So one of the interesting artifacts that we see is that these got slammed all day. And again, it wasn't just the 105s. It also came in at the 100s all out in the January 2026 experee. So this started in the morning, right? 7 a.m. or so. And you can see for both the 100s and the 105s, they just got slammed all day, literally all day. And if we take a peek into this, you can see the distribution of where the average feels were and where the volume was. And",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:03:05",
      "start_timestamp_seconds": 185.59999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=185"
    }
  },
  {
    "text": "right? 7 a.m. or so. And you can see for both the 100s and the 105s, they just got slammed all day, literally all day. And if we take a peek into this, you can see the distribution of where the average feels were and where the volume was. And you can see what the total premium traded today was in these was about 21.2 mil. So what I did was take a look at this doesn't matter. I took a look at both the 95s and the 105s. And I just wanted to analyze a little bit what might be going on. So we can see what the total current delta's for both of these positions, their short puts. So it means they're long delta's. This overwhelmingly looks like a synthetic stock position. Now a question on the live stream was, well, why would they sell premium and volatility was so low? There's a lot of reasons why not, but it amounts to what's not for that reason. It's a synthetic stock position. So what this means is we're trying to control shares of game stop without buying the shares outright. And there can be a bunch of different reasons why that might be the case from regulatory requirements to simply capital efficiency. Because you can see that the total position here or the 105s, for example, won't went through today. The total current delta's on that is a little over 200,000 again. I didn't give it the total",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:04:38",
      "start_timestamp_seconds": 278.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=278"
    }
  },
  {
    "text": "reasons why that might be the case from regulatory requirements to simply capital efficiency. Because you can see that the total position here or the 105s, for example, won't went through today. The total current delta's on that is a little over 200,000 again. I didn't give it the total volume for today because there could be other people involved. I was involved in some of it just trading the order flow. So they probably are the lion's share, but I don't know how much of the total size. So I'm just estimating here. So you can see what the total current delta represents with how far in the money they are. It's 213,750 shares. That means that this position is going to behave like that number of shares. The total maximum position is 225,000. So about 10,000 shares short of what this could be if it was a true one delta. You can see what the credit was. This is the margin requirement for a regular, not a regulation but a portfolio margin account. And again, if this is an institution, they can get even way better margining rates than this. But what this is effectively saying is per contract, one lot, you have to put up 2,600. And it's essentially cash securing it because it's so far in the money. That's again still for a Regtie account. But it's 2602. Now, if you were to buy the equivalent number of shares at this size, meaning you decided to",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:06:11",
      "start_timestamp_seconds": 371.19999999999993,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=371"
    }
  },
  {
    "text": "contract, one lot, you have to put up 2,600. And it's essentially cash securing it because it's so far in the money. That's again still for a Regtie account. But it's 2602. Now, if you were to buy the equivalent number of shares at this size, meaning you decided to buy all of the same position size, you'll see that I added another column. This is the share equivalent at the strike price. This is the spot equivalent if the same size went on today. And the same size going on today, you can tell it's about the same price because they're effectively making you cash secure the position because it's so far in the money. Now, if you wanted to transact at the strike prices, though 105 and the 95, some people were postulating, well, maybe they're trying to sell shares at those levels. Well, the equivalent stock position at those points would be 23,000, 23,000 plus. So this overall just looks like a synthetic stock position. Now, why is it with one leg versus two legs? That's another great question that we don't really know the answer to. It doesn't lie in some sort of annual return yield on the premium because they're so little premium collected on these and they're so deep in the money, the overwhelming majority of the credit here is intrinsic value. So it's not that as the case, it likely falls something more wrapped around regulatory requirements and the desire to build a",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:07:44",
      "start_timestamp_seconds": 464.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=464"
    }
  },
  {
    "text": "on the premium because they're so little premium collected on these and they're so deep in the money, the overwhelming majority of the credit here is intrinsic value. So it's not that as the case, it likely falls something more wrapped around regulatory requirements and the desire to build a synthetic long because they did collect a lot of premium. Now, again, this is mostly intrinsic value. So if the underlying stays anywhere around where it is, this is effectively going to be given back. Another thing to pay attention to that I got as a question was, well, does this mean somebody thinks that the stock is going to go up to 105 and 95? And the answer is no, not inherently. The thing to remember is that this position here effectively is going to behave like long stock. So here's what that means in context and I'll draw it out for you. So what ends up happening when you have a delta effectively of one, let's say spot price right now is 26 and again, our strike price list is called 100. We'll just use the midpoint between these and some people who say it doesn't mean I have to go to that. It doesn't because because the delta is so high, the delta is essentially one. That means that if GameStop goes up 5, let's say it goes up to 31. What ends up happening is the current credit for these trades and again, let's just call",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:09:16",
      "start_timestamp_seconds": 556.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=556"
    }
  },
  {
    "text": "have to go to that. It doesn't because because the delta is so high, the delta is essentially one. That means that if GameStop goes up 5, let's say it goes up to 31. What ends up happening is the current credit for these trades and again, let's just call it 75 or 74. I'm just taking the midpoint between these. So your current credit of 74, that's where you're at down here at spot price. Your current premium is 74, but average premium. And let's say it goes up to 31. It goes up five points. Well, because this is essentially all intrinsic value, what this means is if this is actually going to decay to 69 and it's not because of the passage of time, it's not because of altilities contracting. It's because this has a delta again of one. So as this move, your again, delta shows you the rate of change of an options premium per one point move in the underlying. So in this case, if the underlying moves five points because you have essentially a delta of one, your premium is going to move by five points. So that means that you net this 5 difference that otherwise happened in the underlying, you get it from the option. Now, there is a little bit of a liquidity component to this that might be a little bit challenging, but it's not a huge position as far as the number of contracts. It's just large in",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:10:49",
      "start_timestamp_seconds": 649.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=649"
    }
  },
  {
    "text": "5 difference that otherwise happened in the underlying, you get it from the option. Now, there is a little bit of a liquidity component to this that might be a little bit challenging, but it's not a huge position as far as the number of contracts. It's just large in terms of the overall size. And again, you can see that this is a pretty meaningful size position that went on in total. So because of this, it does seem to me like a synthetic long. Another question that came up is like, is this some sort of way to pass the buck or pass the losses if this is some sort of legacy short onto the market maker? And the short answer is no. Because what ends up happening is you would reconcile the PL on the short position. You would then reconcile the PL on the options position. And because the options are so far in the money, what ends up happening is let's say you exercise and you're selling at these prices. Well, it means buying at these prices, I should say. But if your short shares, they would be canceling each other out. So what ends up happening is you, there's not really a slick way to weasel your way out of a loss. So otherwise, everybody would do that right? If there is a way to come out ahead in that kind of transaction, but in this case, there really isn't. So now the game",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:12:22",
      "start_timestamp_seconds": 742.3999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=742"
    }
  },
  {
    "text": "up happening is you, there's not really a slick way to weasel your way out of a loss. So otherwise, everybody would do that right? If there is a way to come out ahead in that kind of transaction, but in this case, there really isn't. So now the game is to see how this option flow sustains. Do we continue to see this kind of behavior tomorrow and the continue build out of the position? Because one of the things I noticed when I was looking at the option flow specifically for yesterday, the 95s was a little bit different than today for the 95s. If you look, the 95s, they started their activity around midday, but they ran all the way up directly to the close. Whereas if you take a look at the activity from today versus yesterday, today they started closer to the open and ran most of the day, but stopped before the close. So it looks like as of yesterday, the position wasn't fully put on that might have been desired compared to what might be on now. So this could be the terminal position size. We will absolutely know tomorrow if we continue to see the activity. So really, really interesting trading activity and game stop. If we take a quick look at the price behavior, it's rolling over, hanging out kind of sideways here. And if we poke into the options chain really quick, you can see that the call volume today",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:13:55",
      "start_timestamp_seconds": 835.1999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=835"
    }
  },
  {
    "text": "to see the activity. So really, really interesting trading activity and game stop. If we take a quick look at the price behavior, it's rolling over, hanging out kind of sideways here. And if we poke into the options chain really quick, you can see that the call volume today was actually pretty heavy, 81,000 against 15,000 puts. So it definitely got way more activated. And of interest, we're now seeing this volume again centered in the front expiration, which is again, quite interesting. Now you can see those puts that we talked about here. And you can also see those other puts that people aren't really talking about, but did happen at the 100s. So you had the 95s yesterday, you had some 90s. And then you also had the 100s today, which got overlooked massively because of what happened at the 105s. But the 100s are also part of this equation. So the vault curve here in terms of the volatility surface is relatively mellow. Once you get that far out on a relative basis, right? So you can see literally just the raw difference between the height and how much vault is in these on a relative basis. So it doesn't look like some sort of relative vault volatility play, anything like that. This looks like synthetic long shares to me. So as always, if you have any questions, let me know, be an outlier. See you all later.",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:15:28",
      "start_timestamp_seconds": 928.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=928"
    }
  },
  {
    "text": "basis. So it doesn't look like some sort of relative vault volatility play, anything like that. This looks like synthetic long shares to me. So as always, if you have any questions, let me know, be an outlier. See you all later.",
    "metadata": {
      "video_id": "XuBtNCZme8s",
      "title": "An Inside Look into the GameStop Unusual Options Activity",
      "url": "https://www.youtube.com/watch?v=XuBtNCZme8s",
      "upload_date": "",
      "duration": 811.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:17:00",
      "start_timestamp_seconds": 1020.7999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XuBtNCZme8s&t=1020"
    }
  }
]