[
  {
    "text": "Don't let the alert of zero DTE options make you think that there's less risk involved. There's a benefit. There is no overnight risk because zero DTE means the options expire in zero days, the same day. So you don't have overnight risk that's good. The problem is options are priced pretty efficiently. So what that means is if you think, oh well, most of these are going to expire worthless at the end of the day, let me sell some of them. It's just one big move you need before you wipe out a bunch of profits that took you weeks or months to accumulate. And the inverse happens when you're buying, you might lose a whole bunch of time trying to make a few dollars, and after commission fees slipage, it might not make sense. That's not to say never trade them, but I wouldn't use that as your only trading strategy. I would have some other stuff in the toolkit and apply zero DTE when it makes sense. Being all our sea guys later.",
    "metadata": {
      "video_id": "XW0ScMExu2I",
      "title": "0DTE Options RISK #stockmarket #trading #0dte",
      "url": "https://www.youtube.com/watch?v=XW0ScMExu2I",
      "upload_date": "2023-05-02T22:59:29Z",
      "duration": "PT53S",
      "channel_name": "",
      "description": "📩 Join the Outlier Insights Investing Newsletter:  https://www.esinvests.com/contact\n💡 Support the channel and gain access to exclusive content!: https://www.patreon.com/erik_esinvests\n► Have a question or suggestion? Drop it in this form! https://forms.gle/pFSQ8LHGrNkiZirbA\n\n▬ RESOURCES  ▬▬▬▬▬▬▬▬▬\n► 1 on 1 Coaching: https://www.esinvests.com/coaching\n► Options Omega Backtesting: https://optionomega.com/register/esinvests\n► Benzinga Pro - Get 35% Off using Promo Code esInvests35: https://benzinga.sjv.io/esin\n► Grab Some Outlier Merch: https://esinvests-shop.fourthwall.com\n\n▬ SOCIAL ▬▬▬▬▬▬▬▬▬▬▬▬\n► Follow on Twitter for Investing News & Stock Market Updates. https://www.twitter.com/esInvests \n► Join the FREE Outlier Community Discord.  https://discord.gg/hYGZUEJpve\n\n▬ VIDEO DETAILS ▬▬▬▬▬▬▬▬▬\n#investing #stockmarket #trading \n\n\n▬ ERIK'S READING LIST ▬▬▬▬▬▬▬\n► Options as a Strategic Investment: https://amzn.to/3Rzo8bv\n► Secrets For Profiting in Bull and Bear Markets: https://amzn.to/3B8PlKU\n► Positional Option Trading: https://amzn.to/3qzufQV\n► Option Trading: Pricing and Volatility Strategies: https://amzn.to/3B5dF0q\n► The Book of 5 Rings: https://amzn.to/3lbFpws\n► Man's Search for Meaning: https://amzn.to/3l8Ny4K\n► Can't Hurt Me: https://amzn.to/3mQiMhh\n► The Obstacle Is the Way: https://amzn.to/3l8JwJz\n► Killing Lincoln: https://amzn.to/3JyWyt6\n► FULL LIST HERE: https://docs.google.com/spreadsheets/d/1NHETMgmkxjGb4DUL--zoY9AUFanQ06kjl1KbHn4GAzw/edit?usp=sharing\n\n▬ ABOUT ERIK  ▬▬▬▬▬▬▬▬▬\nMy name is Erik, I'm a Marine veteran, options trader, and investor. I started trading in 2007 and have spent over 30,000 hours honing my skillset. Like many, I came from a single mom who struggled - yet I became a multi-millionaire in my early 30s.\n\nI’ve no secret tricks or \"easy money\" strategies. I carefully studied, planned, tracked results, and optimized my performance - and I openly share my journey. \n\nI built the Outlier Community to connect you with other driven people who are disinterested in average and focused on creating their optimal futures. It's a holistic community, centered on creating financial freedom and living a fulfilling life. From investing basics, options trading, stock market analysis, portfolio management to real estate investing, wealth development, psychology, discipline, fitness, etc. None of us find success solely on our own - here we create it together. Welcome to the Outliers!\n\nI am not a financial advisor. All content is shared for educational and entertainment purposes only.",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 1,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=XW0ScMExu2I&t=0"
    }
  }
]