[
  {
    "text": "you you you you you you E The first thing is I think a lot about GameStop as just an absolutely fascinating study of markets literally love that. And then the second part though is a way to make money. I was actually texting with Newton earlier today about some of the stuff that I've been working on and I was like just reflecting a little bit on how much time I've spent analyzing GameStop and we're on like for the live stream series. We're on a few months in. So the goal for today is we'll do a recap on GameStop first. I want to talk about what happened last week, what that looks like, what that could look like for GameStop going forward. And then I want to actually go through Superstank and then I also want to go through GME, those two reddits so that I can look, I'm literally going to sort it by top posts. And I'm going to see what I can find. I'm sure a lot of it will be like just memes and jokes and stuff, of course. But I want to find the due diligence. And I want to specifically go through in depth the due diligence and see what we can learn and try to piece things together because I've been studying from my own perspective, the movement in GameStop, not just from when I really started getting more involved in the community from this past May. But I started",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 67,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=0"
    }
  },
  {
    "text": "through in depth the due diligence and see what we can learn and try to piece things together because I've been studying from my own perspective, the movement in GameStop, not just from when I really started getting more involved in the community from this past May. But I started going back further and further. And what I started to identify were a massive string of different perceived signals. And I've been regressing them. And literally that's just statistics speak. It sounds fancier than it is. But it's just analyzing relationships. That's essentially what a regression analysis is. And it helps me understand from a quantitative perspective, the predictive capability of things. The reason why it's so important is because the human brain is so primed to remember things that validate what we want to see. And we forget things that invalidate what we don't want to see. And that is a really insufficient way to analyze really anything. That's why most people I find fascinating from a political standpoint where people think that like the other side of whatever side you're on are like dumb and stuff like that. And it's like people have different preferences, right? And the example of one political person saying, well, the other side is dumb is literally them being so wrapped up in their own bias that they can't even understand somebody else's perspective. Taking that into trading and I use the political sphere for that because it's so common to see that.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 67,
      "start_timestamp": "00:01:38",
      "start_timestamp_seconds": 98.8179104477612,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=98"
    }
  },
  {
    "text": "example of one political person saying, well, the other side is dumb is literally them being so wrapped up in their own bias that they can't even understand somebody else's perspective. Taking that into trading and I use the political sphere for that because it's so common to see that. And I think just about everybody has seen that. Meanwhile, I will do my best to understand what my bias and preferences are, compartmentalize those and then still conduct objective analysis. That's what I do is I look at things as objectively as humanly possible to analyze. And it's because I recognize my own fallibilities of human being. I understand deeply my own biases, even in cognitive processing. And I don't trust myself. That's what it comes down to. But that mistrust leads to like really, really, really effective analysis. All right. So first things first, I need to grab our map. And I need to see if we have any people from our hard to reach places. So we have our ape map. And where are we from? If there's anybody that hasn't told me previously where you are from, you got to throw it in now. So that then I can catch you on our map. We finally, we have somebody from Greenland, which is, I think that's pretty cool. I think that's a fair accomplishment in and of itself. But we still are missing Africa. Germany, we have a couple, but we'll add pot stamp. Oh, shit.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 67,
      "start_timestamp": "00:03:17",
      "start_timestamp_seconds": 197.6358208955224,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=197"
    }
  },
  {
    "text": "then I can catch you on our map. We finally, we have somebody from Greenland, which is, I think that's pretty cool. I think that's a fair accomplishment in and of itself. But we still are missing Africa. Germany, we have a couple, but we'll add pot stamp. Oh, shit. Croatia. So fun fact for Croatia. We're actually looking at maybe going there in the winter. Who is that? Chris is Croatia cool in the winter. I'm not being cool as in like cold. I don't care. We don't care about the cold. We're cool with that. But like, is it like a cool place to see? And then, all right. So let's get pot stamp. Add a little pot stamp. Where's that at in Germany? Oh, so it's just like southwest of Berlin. Interesting. Let's, uh, well, you already know, I'm interested, like, I'm just interested in everything. I find myself being a generally curious person. So with this being close to Berlin, I just want to see what it looks like around your hood. So let's just do a quick little peak here. Let's go for a quick stroll through pot stamp. This looks like a good spot. Hey, look at that. Perfect start. We got good taste. Okay. Okay. This looks a little different than expected. I have to be honest. Let's go over here. So very gray. I want to go across this bridge. A lot of bikes. Can I not go across this bridge? What's",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 67,
      "start_timestamp": "00:04:56",
      "start_timestamp_seconds": 296.45373134328355,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=296"
    }
  },
  {
    "text": "Hey, look at that. Perfect start. We got good taste. Okay. Okay. This looks a little different than expected. I have to be honest. Let's go over here. So very gray. I want to go across this bridge. A lot of bikes. Can I not go across this bridge? What's the, what's the issue here? Do the Germans not allow that? I know the Germans are real big on their fucking rules. This looks cool. So very green. This looks like a capital building of some sort. Starbarg, starbag. Oh, doing a little bit of, hey, look at that. That's pretty. Listen, all I'm saying is that the Germans might have a lot of rules, but their shit always looks on fleek. Their stuff looks cool. Chris says better to go in late summer, beautiful coast, bay, and it may be rainy and windy. The winter. So you have to be lucky to get good weather. I'd recommend late spring or fall. Okay. Got it. Because that's actually really helpful. Because yeah, I mean, rain is never good when you travel in general. Just because, you know, it's more difficult to like walk and see places, but I like, neither of us really like the, like the heat. Roaring City says rabbit hole Eric. Fuck no, this is part of the process. I love seeing where people are from. I love traveling. I love looking at stuff. So now, look at this, yo, you guys have some fucking super cool",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 67,
      "start_timestamp": "00:06:35",
      "start_timestamp_seconds": 395.2716417910448,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=395"
    }
  },
  {
    "text": "of us really like the, like the heat. Roaring City says rabbit hole Eric. Fuck no, this is part of the process. I love seeing where people are from. I love traveling. I love looking at stuff. So now, look at this, yo, you guys have some fucking super cool buildings. Love this. Moody Blues says, what are, what are nice areas to live in San Diego for a person looking to move from the Midwest? Well, it doesn't really matter where you're moving from. I think it depends more on like what, what you like. But best possible piece of advice I could give is the same advice that I'm going to heed myself when we move because we're moving out of here in the not so distant future is just come visit. Like if you like the city and stuff like that, then that's cool. Down south is perfect for that. There's a lot of beautiful places along there. We like stuff that's a little more out out of the way. So we live in a slightly different area that's we live next to a nature preserve. So we're like four miles from the beach, not far at all. It takes us less than 10 minutes to get there. But we're, we don't have like a bunch of houses around us. That's the tricky part in San Diego is in order to avoid being surrounded by houses. You either have to go too far inland where it's scorching",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 67,
      "start_timestamp": "00:08:14",
      "start_timestamp_seconds": 494.08955223880594,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=494"
    }
  },
  {
    "text": "all. It takes us less than 10 minutes to get there. But we're, we don't have like a bunch of houses around us. That's the tricky part in San Diego is in order to avoid being surrounded by houses. You either have to go too far inland where it's scorching hot or I mean really that's your only choice or get really lucky. Okay, so next we had Croatia. Croatia. Croatia is good. And then we have hold on. Am I missing any others that you guys threw in? Dan says I'm in Colorado Springs for 10 years now. City is growing almost too fast. It's going to be bigger than Denver. Yes, you like that part I don't, I'm not super stoked on because that's I don't know Dan if you're if you already know, but that's literally exactly where we're looking to move is to around Colorado Springs. We're looking at like the Black Forest area or I'll show you. So the areas that we are looking at. We're looking at the Broadmoor in here. And then we're looking at Black Forest out here, I think. Those are like the main spots that we're looking at. But we have to go stay for a while. That's the that's the main that's the main part is we I've been to Denver, but I haven't been here enough, but I mean obviously you could tell even the time that I spend looking at other places like the Broadmoor looks cool.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 67,
      "start_timestamp": "00:09:52",
      "start_timestamp_seconds": 592.9074626865671,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=592"
    }
  },
  {
    "text": "have to go stay for a while. That's the that's the main that's the main part is we I've been to Denver, but I haven't been here enough, but I mean obviously you could tell even the time that I spend looking at other places like the Broadmoor looks cool. The main thing I like is that it's on the foot hills, but the tricky part is is like I hate this. I hate when it's just like fucking house on top of fucking house. Like that is the bane of my existence. And it's one of the reasons why I start looking for stuff so early is because I would be looking for something that's kind of by itself that has a really nice view hopefully, but has a little bit more room around it. I do not like stacked houses on top of each other. I like a little bit of space because otherwise your living experience is just so much predicated on who you live around, which kind of sucks. Dan says that area is also subject to getting big hail storms, a few years back, all the cars parked at the zoo were total. Whoa, that's crazy. I did not know that. Dan, is that specific to the Broadmoor just because of like the elevation gain? I'm guessing it has a little bit. That's nuts. I did not realize that. That's really, really good to know. And then it looks like we have Montreal. Add that",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 67,
      "start_timestamp": "00:11:31",
      "start_timestamp_seconds": 691.7253731343284,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=691"
    }
  },
  {
    "text": "crazy. I did not know that. Dan, is that specific to the Broadmoor just because of like the elevation gain? I'm guessing it has a little bit. That's nuts. I did not realize that. That's really, really good to know. And then it looks like we have Montreal. Add that to our list. Dan says it's right next to the Cheyenne mountain, so the cold air comes off the mountains and it hits the plains. Got it. That's crazy. The channel says Alaska is roomy. I'd say we just went to Alaska. You know that. And we loved it, but I'm also wise enough. I know Alaska in the summer is a very different vibe than Alaska in the rest of the year. That's the that's the main problem with Alaska is that you have when or I'm not trying to deal with, PBH. All right, so let's move over to the main screen. This one. And then let's take a look at GameStop to start. So GameStop had one of its busier weeks for literally some time now. It's been a minute since we've seen really anything resembling life. And I was elated to see some of this activity. Now I know a lot of people right now are getting a little bit beat up on short calls because a lot of people think short calls are like free money that you get when you're holding long stock. And this is the find out part that starts with fuck",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 67,
      "start_timestamp": "00:13:10",
      "start_timestamp_seconds": 790.5432835820895,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=790"
    }
  },
  {
    "text": "Now I know a lot of people right now are getting a little bit beat up on short calls because a lot of people think short calls are like free money that you get when you're holding long stock. And this is the find out part that starts with fuck around. So Vladimir says most places in the US have shitty weather for six months of the I mean that literally I can't think of any place that doesn't have periods of shitty weather. It's the level of shitty that varies quite a lot like even San Diego during May and June. It's fucking foggy. It's like they literally call it May Gray June gloom. It's like two months. Again, it's not terrible. Right? Like it's fine. But it's like two months that you don't see the sun. And it's because the Marine layer comes in and it just sits there all day. So yeah, everywhere we'll have its quirks for sure. I've not found a perfect place and I don't think it exists. I think any place that you look to live is just a series of trade-offs and like what you value. One of the reasons why we stayed in San Diego for a while is because I was really big into surfing. I liked surfing a lot. And I've fallen out of favor with surfing. I don't really surf that much anymore just because it started getting way too crowded and it kind of kills the experience",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 67,
      "start_timestamp": "00:14:49",
      "start_timestamp_seconds": 889.3611940298508,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=889"
    }
  },
  {
    "text": "stayed in San Diego for a while is because I was really big into surfing. I liked surfing a lot. And I've fallen out of favor with surfing. I don't really surf that much anymore just because it started getting way too crowded and it kind of kills the experience for me. But yeah, if if you're not like super into the ocean, I or the beach maybe, I just don't know why somebody would live in San Diego. Reng Titty says the San Diego also have San and it does. We're actually having it right now. This is probably my favorite time of year because it's cooler out like in the evenings it gets to the low fifties. And then the Santa and a winds they're like these really warm winds. It's just a very cool feeling. It's really, really neat to me. I like it a lot. But we do absolutely get the Santa in us. All right. So let's take a look at the overall move that we got in GameStop. So on the eighth, we landed just shy of 25 where at like 24 87. I know a lot of people were sitting there pointing at Max Payne saying that it was being manipulated down and stuff like that, which is again, I can't weigh on that either way because this is close enough where it's realistic. It's very realistic. The other thing though is that I always try to remind people that Max Payne does",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 67,
      "start_timestamp": "00:16:28",
      "start_timestamp_seconds": 988.1791044776119,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=988"
    }
  },
  {
    "text": "Max Payne saying that it was being manipulated down and stuff like that, which is again, I can't weigh on that either way because this is close enough where it's realistic. It's very realistic. The other thing though is that I always try to remind people that Max Payne does move. Max Payne is not a static figure. It moves as options move. And you have to think about what's going on here when it comes to Max Payne. So what I mean by that is let's say for example, we figure out I think there's a website that does Max Payne, right? This one. I'm just looking for here we go. So here. So this website shows us for an expiration. This is using the primary expiration of, oh no, this is the next expiration. I'm sorry. And it shows the Max Payne here. And Max Payne is at 20. What will happen as the week goes, this will move. It won't stay at 20. You can look at this in two days and it will move. The reason why this moves is well, there's a few reasons. The first reason why you'll see it move is because as options come up on their expiration, people will naturally move out of their options that are further out of the money. And then Max Payne will drift towards at the money because people that are further out of the money tend to close their positions out and move on into",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 67,
      "start_timestamp": "00:18:06",
      "start_timestamp_seconds": 1086.9970149253732,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1086"
    }
  },
  {
    "text": "options come up on their expiration, people will naturally move out of their options that are further out of the money. And then Max Payne will drift towards at the money because people that are further out of the money tend to close their positions out and move on into something else. So just something to be aware of. And again, I'm not saying there's no, there's, I have a video talking about Max Payne. And there's absolutely evidence that manipulation does occur. The problem now with something like GameStop is it's becoming large enough that manipulating the stock price, any significant degree becomes more and more challenging with the more shares that exist, the higher the float that's out there, it just becomes more difficult. That's not to say it can't be done. And again, looking at Friday's close, it is, I mean, that's like less than 20 cents a way. If I'm a market maker, I'm absolutely doing that. So I'm sure those motherfuckers are doing that. But the main thing is like, actually, I'm curious, let's take a look at like a five minute. I'm just looking at the ebbs and flow of volume. So standard surge, this is really interesting. And like nine big surge surge. And then this is interesting, that there was a big surge that came in around 11, who's normally you would see this kind of volume over here. But this doesn't surprise me that it ended up getting getting bid down.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 67,
      "start_timestamp": "00:19:45",
      "start_timestamp_seconds": 1185.8149253731342,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1185"
    }
  },
  {
    "text": "this is really interesting. And like nine big surge surge. And then this is interesting, that there was a big surge that came in around 11, who's normally you would see this kind of volume over here. But this doesn't surprise me that it ended up getting getting bid down. And the main culprit there is literally just an artifact of it had really strong volume to propel it into this. But then that volume gave up. It didn't stay strong and seller stepped in pretty big time. Again, whoever those sellers are, what their motives may be. That's another story. But this absolutely would not surprise me at all. If it was manipulated below 25, I can 100 see that. So big volume spike too, big, big volume spike. We have to talk about that. Because if we take a look at the seventh, the seventh had a five day volume of 5.4, 20 day volume of 5.7. When the 20 day volume and the five day volume get that close to one another, it tells us that we're kind of at like a proverbial floor level of volume that there's just not that much going on. And then we have literally like three times that amount on the eighth, a massive spike. You can see 305 relative volume on the 20 day. So big, big, big volume stepped in here. And a lot of it was by volume, which is really, really interesting. So if we take a",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 67,
      "start_timestamp": "00:21:24",
      "start_timestamp_seconds": 1284.6328358208955,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1284"
    }
  },
  {
    "text": "we have literally like three times that amount on the eighth, a massive spike. You can see 305 relative volume on the 20 day. So big, big, big volume stepped in here. And a lot of it was by volume, which is really, really interesting. So if we take a look, we'll grab unusual whales. Is there perfect for this? And let's take a look at the order flowing game stop specifically on Friday, the eighth. And I have puts turned off. I'm looking at everything bid, mid, ask, offer, nothing, just so that I can see what's going on. And then I'm going to sort this by premium. And I mean, there's some big options trades coming in. This is definitely larger than what we've seen recently, but it's still like this isn't roaring kitty sized as far as I can tell. This just looks like a bit of a step up, but not crazy. This starts getting more interesting. But this is a little further out in time, 20 days, 2000 of the 25s. Then we saw the 15 noves, those got hammered. We talked about that already. So let's take a look at the last two weeks. Yeah. So what I'm doing is I'm eyeballing how much of this activity is like really centered in the recent days, which most of it is. Like most of these larger trades, which is interesting. Rintini says how are we looking for a gamma ramp? Let's take a peek. Not",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 67,
      "start_timestamp": "00:23:03",
      "start_timestamp_seconds": 1383.4507462686568,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1383"
    }
  },
  {
    "text": "Yeah. So what I'm doing is I'm eyeballing how much of this activity is like really centered in the recent days, which most of it is. Like most of these larger trades, which is interesting. Rintini says how are we looking for a gamma ramp? Let's take a peek. Not good. Yeah, not good. It's not terrible, but it's not good. The reason why it's not good is because the 25s here are heavy AF. These will help a lot because there was a ton added as well. And we have volume exceeding open interest. So there's going to be net ad here, no matter what. And there was already 10,000 added on the day prior. So there's massive build out going on here. The problem that we have is that like this here starts to slow down a little bit, but this is still 10,000 more added on the 26s, which that's pretty good. So if this hits well enough, that absolutely can start bidding people via hedging behavior on these 25s to go out by the underlying. Definitely, that would impact price because that's enough to start doing it. But then we have a pretty giant gap at the 25 and a half. But if there's enough hedging activity that happens simultaneously here on the 25s, it could skip essentially any real requirement on the 25 and a half and it can start pressuring the 26s. The problem is after that, it kind of falls off a cliff",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 67,
      "start_timestamp": "00:24:42",
      "start_timestamp_seconds": 1482.268656716418,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1482"
    }
  },
  {
    "text": "the 25 and a half. But if there's enough hedging activity that happens simultaneously here on the 25s, it could skip essentially any real requirement on the 25 and a half and it can start pressuring the 26s. The problem is after that, it kind of falls off a cliff because then here again, there's net ad no doubt, but it's light. There's a net ad here as well, which is also light. So that's the problem. The 30s are heavy for sure. They'll have another 10,000 added at least. But the problem like there's just not a lot in here to get there. The prospects for a gamma ramp are really, really specific and most importantly, stock availability. And there's tons of available stock right now. That's like the biggest issue that we're going to have with the prospect of a gamma ramp is that with the stock being so readily available, it is really difficult for a gamma ramp to take massive hold because there's enough liquidity. So in general, that's again, not suggesting that there couldn't be one at all, but I wouldn't expect like based on what I see here. I don't see like a massive run coming that's going to be based on gamma. That's not to say that a massive run couldn't come from something else that then is therefore amplified by the options chain. But it doesn't look dense enough for like a massive run again from like a gamma ramp perspective specifically.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 67,
      "start_timestamp": "00:26:21",
      "start_timestamp_seconds": 1581.086567164179,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1581"
    }
  },
  {
    "text": "run coming that's going to be based on gamma. That's not to say that a massive run couldn't come from something else that then is therefore amplified by the options chain. But it doesn't look dense enough for like a massive run again from like a gamma ramp perspective specifically. I would consider this more of like a contributing factor at this point. Let's take a look. I want to I'm going to use this for now just because I can zoom out a little bit more and keep better scale. This has been really interesting and I think worth a conversation because we have absolutely started to build in a floor here. And this line that's been on the chart, we've talked about this a little bit this line here. I've drawn this a while ago and then same thing with this alert down here at 1932. Actually, I wonder if I can see the details. Yeah, I can hold on one second. I'm going to move you guys over to this screen real fast. I just don't know if this is going to show any information like personal information. It doesn't. When does this show? Alerts. Here we go. So I'm just trying to find game stop specifically. And here it is. So that was set on the 4th of October at 1621. That's when that alert was set on the 4th of October. All right, bring you back over here. So 4th of October, this went on.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 67,
      "start_timestamp": "00:27:59",
      "start_timestamp_seconds": 1679.9044776119404,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1679"
    }
  },
  {
    "text": "go. So I'm just trying to find game stop specifically. And here it is. So that was set on the 4th of October at 1621. That's when that alert was set on the 4th of October. All right, bring you back over here. So 4th of October, this went on. And if we zoom out, essentially what I'm doing is using this recent price action to determine that level. And the reason why I think this level is important is because this is after we had the additional offering. And I think this like 19 and a half level would at least to me be generally the lower the lower floor. And then we have 20 and a half as the bottom of this channel that's as been defined pretty heavily. And then we still have a ways up to the upside. So you can see that there's a giant volume node here on a six month daily. To me, that's probably a much bigger reason why the stock didn't rally up and out through 25 is because my guess is that there are armies of people right now that have a really high cost basis that are happy to get out of it here. That's my guess. We go out to a year. Yeah, like look at this. It makes it makes a ton of sense. So if you go back here, you can see this other volume node on an even longer term time frame. This volume node",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 67,
      "start_timestamp": "00:29:38",
      "start_timestamp_seconds": 1778.7223880597016,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1778"
    }
  },
  {
    "text": "get out of it here. That's my guess. We go out to a year. Yeah, like look at this. It makes it makes a ton of sense. So if you go back here, you can see this other volume node on an even longer term time frame. This volume node literally ends at like 25 and change. It's there. So what that tells me is that there are going to be lots of people over the past year, specifically within this time frame that have probably scaled in really heavily way too much during these giant spikes up. They probably have a terrible basis that they've continued to add money into to cost average themselves down. And a lot of them will be very happy to get out here. And I think that's why we saw last week a pretty even distribution of sellers starting to step in throughout the day. It still was overwhelmingly a by day to be abundantly clear. But there was still 24 of the volume was sales. So there were absolutely people happily unwinding, especially as it started drifting up to that. Because again, if we take a look here, you can see most of that sale volume didn't come in until here. And guess when this time frame was, this is when it was at 25. And that time frame literally matches up with these longer term volume nodes of people that have gotten really just way too oversized at way too high of",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 67,
      "start_timestamp": "00:31:17",
      "start_timestamp_seconds": 1877.5402985074627,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1877"
    }
  },
  {
    "text": "that sale volume didn't come in until here. And guess when this time frame was, this is when it was at 25. And that time frame literally matches up with these longer term volume nodes of people that have gotten really just way too oversized at way too high of a basis. And this is exactly what they're dealing with right now. So that doesn't surprise me. This is going to serve as near-term resistance, in my opinion, that again, as always, doesn't mean that it can't overcome near-term resistance. It always can. And it's just a matter of time before it does. But it's typically not a just clear shot through unless there's just overwhelming strength behind it, which right now, it doesn't look like that that's here. So, Cedric says, so you don't think that was to keep those 25s out of the money. I can't say it that discreetly. It's probably a mix of things. But what I say that the primary price movement here was only to keep the 25s out of the money. I don't believe that. And the reason why I don't believe that again is because it matches up with these very common broader human tendencies. So, for example, let me give you an alternative. Let's say, for example, let's use this here, this volume node. So, at 1698, let's call it 17, down here at 17. There's a really small volume node, right? So that means that people transacted here. But in",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 67,
      "start_timestamp": "00:32:56",
      "start_timestamp_seconds": 1976.3582089552237,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=1976"
    }
  },
  {
    "text": "broader human tendencies. So, for example, let me give you an alternative. Let's say, for example, let's use this here, this volume node. So, at 1698, let's call it 17, down here at 17. There's a really small volume node, right? So that means that people transacted here. But in terms of overall volume of people that transacted at that level, it's not massive. It's not a ton. When you look at something like this, where it's almost as big as the point of control, this is the second largest volume node for the past year. So that means over the last 52 weeks, again, most of it centralized here in April, May, tons of people transacted at these really high prices. So the very, very common thing. And again, you can see it happen as it gets near this 25 handle here, as it got near the 25 handle here. That's human psychology because there are people that, again, got into this thing for 30, 40, 50. And then they start buying more and more and more as it's going down to try to reduce their basis so that then when they are offered a chance to get out with their money, they do. And this is why something like volume profile is so informative because it can help us forecast the overwhelming majority of what people are likely to do in different circumstances. Now, again, it's important. There's a lot of depth that goes into this, a lot",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 67,
      "start_timestamp": "00:34:35",
      "start_timestamp_seconds": 2075.176119402985,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2075"
    }
  },
  {
    "text": "with their money, they do. And this is why something like volume profile is so informative because it can help us forecast the overwhelming majority of what people are likely to do in different circumstances. Now, again, it's important. There's a lot of depth that goes into this, a lot of depth that goes into this because say, for example, when we see a game stop here, and let's say that this volume node right here, again, at the 25 handle, let's say that this was built over the last entire year. Well, guess what? It's less informative. It's less informative because it can represent all different kinds of people that got in at all different kinds of prices for all different kinds of reasons. It still can tell us some things, meaning that people have been at that level for some time, and they might be eager to get out. Or it could be larger positioning for larger durations. You don't really know. The beautiful part about the context of the volume profile here is I know for a fact because of the chart that the all of the all of the buying activity at 25 or above literally happened between here and here. So what that tells me is that looking out over this time frame, lots of people got in at lots of really high prices. So that's why I think every time you see this thing coming up near 25, people are getting the fuck out",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 67,
      "start_timestamp": "00:36:13",
      "start_timestamp_seconds": 2173.9940298507463,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2173"
    }
  },
  {
    "text": "happened between here and here. So what that tells me is that looking out over this time frame, lots of people got in at lots of really high prices. So that's why I think every time you see this thing coming up near 25, people are getting the fuck out because there are tons of people that have lots of money at really high prices that they probably averaged into reducing their basis, but consuming more and more money, that is probably what's going on here. So looking at something like this, it is really clear that 25 right now has to be broken. And the cool part though, about once 25 is broken in terms of support and resistance, it starts to look pretty fucking open, right? So if we get through this 25 handle, which is kind of like this whole block here, above that, guys, the limit, there's literally no overhead resistance at that point. You can see that there's a tiny amount of people that got fucked and there's stuck up here. That just sucks to suck. A lot of those people probably would have transacted at additional points to lower their basis. My guess is the majority of this bulk here is this. So once that's moved through, then it's much easier movement. Even on a six month time frame, that's the same level. Again, it's it competes with the point of control. It's such a transacted level on all of these different time frames.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 67,
      "start_timestamp": "00:37:52",
      "start_timestamp_seconds": 2272.8119402985076,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2272"
    }
  },
  {
    "text": "the majority of this bulk here is this. So once that's moved through, then it's much easier movement. Even on a six month time frame, that's the same level. Again, it's it competes with the point of control. It's such a transacted level on all of these different time frames. On a three month word, we haven't really been there for very long. So that's where people are starting to step in though to exit. So really, really interesting. Now, taking a look at the options chain for next week, just to run like a standard analysis here, very volatile. We're definitely sitting high relative IV. Let's take a look at the surface. I'm just going to use the primary explorations for now. And wow, that's fucking crazy. Jesus. This is crazy. Lots or lots weird here. Cliff notes really high call IV, really, really, really jagged put side IV. So unclear pricing on the put side. Very, very, very unclear. For 20 days, massive call IV relative, which is very interesting. Look at this. This is crazy. So these 23s and 15 know were so cheap compared to the 20 Ds. What did I say the 23s? Why is that so cheap? 86 that is cheap. Why are those so cheap? I don't understand why these are so cheap. They're incredibly cheap. That's fucking bizarre. So I don't know how to explain this in a way that's not super nerdy and geeky. What the fuck do I do this?",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 67,
      "start_timestamp": "00:39:31",
      "start_timestamp_seconds": 2371.6298507462684,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2371"
    }
  },
  {
    "text": "that so cheap? 86 that is cheap. Why are those so cheap? I don't understand why these are so cheap. They're incredibly cheap. That's fucking bizarre. So I don't know how to explain this in a way that's not super nerdy and geeky. What the fuck do I do this? Let me start with the summary. And then if you're interested, tell me, and I'll go more into detail, but I don't want to start getting into more technical shit that nobody cares about. Okay, few things. First thing, 20 Ds. Notice how the 20 Ds expiration implied volatility is 94.59 percent much lower than the front expiration at 135.71. This is fairly common. You'll see this. Now, what's really weird here is in the specific strikes, we have a series of puts, all of these puts. So the 23s down to the 21s, they're very cheap in terms of IV relative to what you see here. The 23s here are 103 104 percent IV compared to 80. Yet, the overall chain here is much lower than the overall chain here. So that's a really distinct variance between those individual strikes for a bunch of different reasons. The fact of the matter is, is if you tried to buy and sell them to play it, a lot of times you won't get a fill because I play relative value movement in GameStop all the time. And it's difficult sometimes to get a fill at the prices that show the the",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 67,
      "start_timestamp": "00:41:10",
      "start_timestamp_seconds": 2470.44776119403,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2470"
    }
  },
  {
    "text": "the matter is, is if you tried to buy and sell them to play it, a lot of times you won't get a fill because I play relative value movement in GameStop all the time. And it's difficult sometimes to get a fill at the prices that show the the skew, but that's a massive skew. Just really, really interesting. So the to click one level in, that's like the overview level. And to go one level in further than that, this entire period of front expiration, lower IV strikes compared to 20 D's means something. What exactly it means, I have no idea, but it means something. And it's because, normally, you won't see this level of a variance between these. This is a big discrepancy. This is, again, 87 compared to 104. That's a big, big variance. That's an easy trade to make because you can run on the put side, you can buy the 15s and fade the 20s. You're just playing IV something on something like that. And it's a really good looking trade to me. The liquidity is okay. So the way that this would look would be these are cheap. Those are the 23s. These are expensive. Something like this. And if the movement goes as expected, either direction, meaning we see implied volatility rise, if we don't get a price movement and IV rises, our current PL will still move up. It will still go up. Then if it doesn't, that's when we",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 67,
      "start_timestamp": "00:42:49",
      "start_timestamp_seconds": 2569.265671641791,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2569"
    }
  },
  {
    "text": "These are expensive. Something like this. And if the movement goes as expected, either direction, meaning we see implied volatility rise, if we don't get a price movement and IV rises, our current PL will still move up. It will still go up. Then if it doesn't, that's when we lose. But the idea here is that it would move. That's what I would guess. Is that just looks, that looks to be the case to me, which is really interesting. That's a massive skew there. Let's take a look at a couple other things really fast. Let's do OI. So light, light options chain, 567 against 218. So big calls skew. But relatively small sizes. We do see a little bit more of front expiration. And then the next biggest expiration, though, is still way out in 17 Jan. 17 Jan's interesting because I don't think this is people playing 17 Jan as if, oh, I think something's going to happen in 17 Jan. I think this is people just putting on longer term positions in GameStop to play the Delta movement leading into that. And what I mean by Delta movement, that simply put is if we take a look at these 17 Jan's. And if we go out this far, let's just say that you grab something that's like a good Delta, like these 46's, 59 Delta, something I prefer a little bit in the money. If there's good, you know, strong conviction in the overall direction",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 67,
      "start_timestamp": "00:44:28",
      "start_timestamp_seconds": 2668.0835820895522,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2668"
    }
  },
  {
    "text": "a look at these 17 Jan's. And if we go out this far, let's just say that you grab something that's like a good Delta, like these 46's, 59 Delta, something I prefer a little bit in the money. If there's good, you know, strong conviction in the overall direction for the ticker, you kind of, you know, get yourself out of really massive theta decay. And even if you're out this far in time, if you get a big move, you'll be able to profit from it. And we can look at an example of that. Let's go back to 25. And I'll literally show you a trade that I put on here. As soon as I saw this volume, we've talked about this before. On the 25th of October, we had a pop in volume that was followed by more volume on the 28th. This is every single time I've seen GameStop move. It is with this same kind of volume behavior. That is the most predictive thing that I've found after my, like literally, probably 200 hours of research specifically into GameStop. I actually would say that that's probably low-balling it. Probably about that. And volume is been the most predictive thing that I can eyeball. And so on the 25th, we had obviously a big day, big volume, but it ended up selling off, that then ended up being caught on the 28th. So the 28th, this turned into just a standard breakout play. So once",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 67,
      "start_timestamp": "00:46:06",
      "start_timestamp_seconds": 2766.9014925373135,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2766"
    }
  },
  {
    "text": "been the most predictive thing that I can eyeball. And so on the 25th, we had obviously a big day, big volume, but it ended up selling off, that then ended up being caught on the 28th. So the 28th, this turned into just a standard breakout play. So once we started getting into the mid-20s, mid-21s, just buy some options. That's all it was. And I still have my longer term standing positions. I actually think like a lot of you, if I'm not mistaken, I think I have a short call series that I'm going to have to manage. I don't know where they're at. But I could tell you, so I don't remember. Let's see. Where are these short calls at? They are definitely, they're definitely in the money. That is for sure. And they have six days of expiration. So we're going to have to manage those. I have the 23s that just straight up got ran over. But I have 17, April 25s. I have 30s out there. And then I also have some nearer stuff that I'll show you. So we can use this literally as an example here. So if you go to the 28th of October, over 28th, we need to be a little bit earlier in the day because towards the end of the day is when it was rallying up and out. And here it is. I think this is still a little too far, maybe like 10 hundred. And",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 67,
      "start_timestamp": "00:47:45",
      "start_timestamp_seconds": 2865.7194029850743,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2865"
    }
  },
  {
    "text": "the 28th of October, over 28th, we need to be a little bit earlier in the day because towards the end of the day is when it was rallying up and out. And here it is. I think this is still a little too far, maybe like 10 hundred. And it looks like it's updating. Citrix says, why do you do these color purple? Because I said it that way. It makes it easier to see, hey, it's our boy Newton news text on us. What's Newton got? Well, we're talking about hopping on a call. I need to pick his brain on some stuff. All right. So from here, if we take a look at an example, we go to the 17 jans. And we have this big run that we see going on. And we think it's likely to grab some legs. We can come either to the 23s. I ended up going to the 25s. And it was literally just for liquidity. There was more room here for me. These are all old trades from other examples. So I'll just do a one lot for the example. And it's down at the bottom there. So what I want to show you is how this will move compared to something like this. And I'm doing one lots. I'm purposely doing one lots. I'm not doing the same dollar amount just because I want you to see the example. And then let's go to the seventh of November. I",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 67,
      "start_timestamp": "00:49:24",
      "start_timestamp_seconds": 2964.537313432836,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=2964"
    }
  },
  {
    "text": "want to show you is how this will move compared to something like this. And I'm doing one lots. I'm purposely doing one lots. I'm not doing the same dollar amount just because I want you to see the example. And then let's go to the seventh of November. I think it already started rallying here. And then we can see where these land. Notice the difference. So price moved in our favor without without a doubt. Price moved in our favor. Yet on the 25 calls here, you literally lost money so far. You are directionally correct entirely. You are completely correct in terms of your directional disposition. In terms of your PNL, you are fucked. You are right but wrong. Why did this happen? What happened to the poor soldier at 15 know? Why would he be in such poor shape compared to the soldier that's at 17 Jan 25 same strike? Rointit he says IV less so IV in this instance. IV would have contracted a little bit so definitely wouldn't help but that's not the primary thing. You got it. That's exactly correct. So the problem is as we fast forward at time, this thing has been suffering theta decay. And because it's getting closer and closer to expiration, its theta decay is growing exponentially. Each day, this 15 know of 25 call is losing 6.70. Whereas the 17 Jan 25 calls is losing 2.84 significantly less. And this because it didn't have a big enough",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 67,
      "start_timestamp": "00:51:03",
      "start_timestamp_seconds": 3063.355223880597,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3063"
    }
  },
  {
    "text": "been suffering theta decay. And because it's getting closer and closer to expiration, its theta decay is growing exponentially. Each day, this 15 know of 25 call is losing 6.70. Whereas the 17 Jan 25 calls is losing 2.84 significantly less. And this because it didn't have a big enough move fast enough, even though it did have a good move, it still wasn't enough in order for it to break through and make money. This is the problem with short dated options is that you really need a move and you need to move quick. And this is why I like to use longer dated options. So this is exactly why I didn't go to 15 know of and it's exactly why I was out in 17 Jan and it's why I'm out in 17 April is I'm playing longer term ideas. And it gives the trade a much better risk reward profile by being a little further on time. So that's what happened in there. So anyways, going back to where this sits now, the move from this last week, again, it didn't even start last week. And that's one of the funny things I see where people were talking about the movement that was happening last week. And it's like, sure, there absolutely was movement last week. I saw a couple posts on Superstunk about it, but you're already late. Right. If you look at the depth of the move, most of it happened on the 28th.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 67,
      "start_timestamp": "00:52:42",
      "start_timestamp_seconds": 3162.173134328358,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3162"
    }
  },
  {
    "text": "were talking about the movement that was happening last week. And it's like, sure, there absolutely was movement last week. I saw a couple posts on Superstunk about it, but you're already late. Right. If you look at the depth of the move, most of it happened on the 28th. And if you're looking at the move from the course of last week, you are, I don't want to say a day late dollar short, but you're definitely late to the party. Because if you look at here, it went from 22 to 25, but if you look at here, it went from 20 to 25. Right. So you miss about half the move by catching it last week. Now again, that's not saying top-ticking, bottom-ticking, it's impossible. But these kinds of days on expanded volume can't be ignored. That's all. And it's also a really important thing to note that just because volume spikes doesn't mean it goes up. There's a very specific reason why I didn't get into it on the 25th. And it literally did start breaking out, but it didn't go far enough for it to make sense. So all that does is get added to a watch list for the next day. And then I say, what happens to the volume? And does it actually start breaking out of the recent price action? And if so, then obviously I'm very interested. If not, then I am less interested. That's the way that I tend to",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 67,
      "start_timestamp": "00:54:20",
      "start_timestamp_seconds": 3260.9910447761195,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3260"
    }
  },
  {
    "text": "a watch list for the next day. And then I say, what happens to the volume? And does it actually start breaking out of the recent price action? And if so, then obviously I'm very interested. If not, then I am less interested. That's the way that I tend to look at this kind of thing. Because supply and demand always behaves in specific ways. It's not super predictable, but it does have tendencies that we can generally rely on. A carless says market makers will not let the price move up. They want your money. Playing call options is a good way to lose your money. That's not true. It's not true at all. Market makers make money by transactions. And they make money through your transactions by capturing the bid-ask price. They can make a little bit more money if they're able to suppress price. But if you suppress price, then you have no movement. You have no movement. You have nobody that enters the stock. So it's really important, again, to try to remain objective. I'm not saying market makers are angels. I'm not saying market makers don't manipulate anything. I'm not saying any of that. But what I'm saying is that market makers do not have full control over the price of anything. It's a bit of a different context to remember. Again, we already talked about it at the beginning of the live stream. The probability of a market maker manipulating the price here to",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 67,
      "start_timestamp": "00:55:59",
      "start_timestamp_seconds": 3359.8089552238807,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3359"
    }
  },
  {
    "text": "what I'm saying is that market makers do not have full control over the price of anything. It's a bit of a different context to remember. Again, we already talked about it at the beginning of the live stream. The probability of a market maker manipulating the price here to try to drive this down with their buddies is super-fucking high. I would not put it past them at all. But there's also a reality that the market maker didn't stop this from going from 20 to 23. They didn't stop this from going from 22 to 23. They didn't stop this from going from 23 to 25. So the problem is is retail traders, especially retail traders that are not familiar with options, they get pissed off because they're losing money because they're making bad choices and they want to blame something or somebody. And it's just escapism. I just gave you an example. I can literally guarantee you that if this kind of thing happened here, on Reddit or somewhere like this, if that kind of thing happened, the redditor would far more likely than not call manipulation on this. They would look at this and be like, oh, this is all rigged. This was all fully manipulated and not understand that it's literally the way that their trade was built that it didn't, that's why it didn't work. So yeah, Dan says, our case seems to know how to rig it in his favor. I don't think",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 67,
      "start_timestamp": "00:57:38",
      "start_timestamp_seconds": 3458.6268656716416,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3458"
    }
  },
  {
    "text": "oh, this is all rigged. This was all fully manipulated and not understand that it's literally the way that their trade was built that it didn't, that's why it didn't work. So yeah, Dan says, our case seems to know how to rig it in his favor. I don't think so. I generally don't think so. After we went through all of his trades from this, the overwhelming majority of his money didn't happen during these periods that we're talking about FTDs and cycles and stuff like that. If we look at the change in the portfolio value, the first massive jump is here and here. So in 2020, we had a 400 gain and then a 600 gain. And then in, what is this, 2020 and April, we had a 570 gain. Then if we take a look at down here in 21 during the squeeze, there was a massive gain on 27 Jan and then on 13 Jan. And then when he came back in 24, he was up 511 from where he left. And at this point, he went from 34 mil to 210. Everything that we identified from his movement so far. And again, this isn't concrete. We don't know. But there is no clear evidence of like this, this timing thing that everybody seems to think is going on here. It looks like in general, most of the money that he's made so far has been him betting that GameStop is going up and holding",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 67,
      "start_timestamp": "00:59:17",
      "start_timestamp_seconds": 3557.4447761194033,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3557"
    }
  },
  {
    "text": "concrete. We don't know. But there is no clear evidence of like this, this timing thing that everybody seems to think is going on here. It looks like in general, most of the money that he's made so far has been him betting that GameStop is going up and holding through long durations and draw downs in service of that overall objective of GameStop going up. Because again, we've already talked about this. If we like, you don't even have to look that far to see that if there was like this really supreme timing strategy, you don't have your portfolio cut in half or cut down by 31 or cut down by 38 or cut down by 22 or by 25. Right? Like if you, if you have this way to rig the game in his favor as if we think that that's a common theory, you don't go through that because it decreases how much money you can make it decreases how much pain you can put on the market makers, whatever you're, you know, whatever we think the incentive here is. So I don't think that there's a rent. He says his timing is time and pressure. I literally think that's it. The overwhelming majority of what we see here reflects that exact thing that it's building massive positions, having absolute zen-like ability to hold through incredible draw downs. And again, I think the reason why he's able to do this is because this is money, a",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 67,
      "start_timestamp": "01:00:56",
      "start_timestamp_seconds": 3656.2626865671646,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3656"
    }
  },
  {
    "text": "I literally think that's it. The overwhelming majority of what we see here reflects that exact thing that it's building massive positions, having absolute zen-like ability to hold through incredible draw downs. And again, I think the reason why he's able to do this is because this is money, a small amount of money that was put into a yolo account into something that he could clearly see opportunity that he was significantly convicted and and ride the motherfucker out. And each time it started moving, he placed bigger and bigger bets and guess what he did? He didn't place bets with stock. The vast majority of his bets came through options and it's for the leverage. He used leveraged growth. That's exactly what you see here. Leveraged growth at work, which is, I don't know, I think that's really cool. Really, really need to see. But that is a very specific approach to making hundreds of millions of dollars that is wild. The portfolio volatility is fucking crazy. Literally is absolutely crazy. Very cool. But it's crazy. Like here, he went from 48 million here and he was down to 17 million here. Like to be able to just, eh, fuck it, hold through that, that's crazy. And that's exactly what he did. And then when he disappeared, he had 34. He came back with 210. Then he went from 210 to 590 down to 268. Literally doubled his money and then undoubled his money. That's essentially what happened",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 67,
      "start_timestamp": "01:02:35",
      "start_timestamp_seconds": 3755.0805970149254,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3755"
    }
  },
  {
    "text": "eh, fuck it, hold through that, that's crazy. And that's exactly what he did. And then when he disappeared, he had 34. He came back with 210. Then he went from 210 to 590 down to 268. Literally doubled his money and then undoubled his money. That's essentially what happened here. Fucking crazy. Very, very cool though. The whole thing is, I don't know, just fascinating. Look at, which is what I want to spend the last part of the session today on actually is I want to go through some of these subs. And I want to start trying to pick up like the primary, these, like I want to look at these DDs. Are these the right ones to look at? Yeah, I didn't know that this even exists. Whoa. What the fuck? What the fuck is this? What am I looking at? Are these? Are these sorted somehow? How do you sort them by like popularity? What the fuck? Dog. This is fucking sick. God damn it. This is so cool. The fact that people took the time to build a fucking magazine rack with all this stuff in it. Oh my God. There's so much work to be done. All right, I guess we got to start from the oldest to newest. I guess we start here. Oh, this is coolest. Fuck. All right. I got to have my notes ready. We need like another tab. This will just be like, uh, Jimmy notes. All right,",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 67,
      "start_timestamp": "01:04:13",
      "start_timestamp_seconds": 3853.8985074626867,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3853"
    }
  },
  {
    "text": "to be done. All right, I guess we got to start from the oldest to newest. I guess we start here. Oh, this is coolest. Fuck. All right. I got to have my notes ready. We need like another tab. This will just be like, uh, Jimmy notes. All right, let's see. Do a fucking. Oh my God. This is so cool. This is literally so cool. The fact that somebody turned this into like a magazine series. This is some of the coolest shit about the fucking ape community. The fact that somebody does this is so fucking cool. No, there's not another stock that does this. You don't go to Apple and you don't go through the Apple DD. They literally took the time to make it a fucking library thing. Just just the fact that they took the time to do this. And to have a fucking crossword puzzle in here. That's so cool. Look at this thing. Oh, that's so awesome. That's so fucking awesome. All right, I love this. Can you go in between the different issues from here? Do you have to click out? This one. All right. It brings apes in there. Like this is so cool. MSM bullshit. Ask clown Jim Kramer might have another note. Oh, that's so good. Ask clown Jim. Oh, I love these. This is so fun. Is that lower? That's our boy, Dave. I just did a podcast with him. I think he and I we did",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 67,
      "start_timestamp": "01:05:52",
      "start_timestamp_seconds": 3952.7164179104475,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=3952"
    }
  },
  {
    "text": "this is so cool. MSM bullshit. Ask clown Jim Kramer might have another note. Oh, that's so good. Ask clown Jim. Oh, I love these. This is so fun. Is that lower? That's our boy, Dave. I just did a podcast with him. I think he and I we did a podcast last week together. Oh, boy, Dave. How do you read this? What are the times? Is this I'm confused. What are the times mean here? Is it just like picking something for like flow? Or is there a meaning to them? I never know. It's impossible to fucking know. Dave lower. Cool finance guy. That's awesome. This is so cool. Okay. Cool. Yeah. So it looks like they're just kind of building stuff bad guys. Here we go. Citadel, Melvin, Susquana, .72, Virtue, Finra, DTCC. God, this is a long enemy list. Glacier capital, archaicos. Don't worry. Arcagos got theirs. CMBC Wall Street Journal market watch Bloomberg. Okay. So all traditional finance media, Benzenga gets fucked. What did Benzenga do? Is there any history on that? Why don't we like Benzenga? I know people over at Benzenga. I think they're cool. Did they do something bad? Woman sex. Okay. Saturdays and Sundays. Wait. Oh, because the market's closed. That makes sense. Okay. All right. Who's their fucking haters? Oh, really? They. Bad articles on GME. Okay. Y'all gotta be. Y'all gotta be chill because it's, well, it depends on who. If it's like some of their contributors that",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 67,
      "start_timestamp": "01:07:31",
      "start_timestamp_seconds": 4051.534328358209,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4051"
    }
  },
  {
    "text": "Okay. Saturdays and Sundays. Wait. Oh, because the market's closed. That makes sense. Okay. All right. Who's their fucking haters? Oh, really? They. Bad articles on GME. Okay. Y'all gotta be. Y'all gotta be chill because it's, well, it depends on who. If it's like some of their contributors that are not part of Benzenga, that's a little bit different. Dude, I don't even know how they fucking make these. Look at that. Look at that. Look at this fucking dude's face. Oh, my fucking God. Dude. London Correspondent reports the lights run and buildings in Canary Wharf to do. This is. Yeah, that's Kramer. That's exactly who that was. Hold on. Let's go back to the front. That's Jim Kramer. Oh, it's fucking classic. New CEO, Matt Furlong, is he ready for Mellaz? Okay. Okay. I see this is. Old school hyping a certain day. So hyping has been around since the fucking what 2021? Dude, this is incredible. This is literally, I am loving this. Lucy, Commissar. Who the fuck is this? Who is this? Lucy. Commissar. Who are you? He's a journalist. I'm a critic. What's this? You mean. Who was this? Who is this? Who is게요? You did an AMA? So what did you do? You're making a mistake. What did I do to make a mistake? Who did I do to make a mistake? I don't know. Loretta or I like to go Ellie. Okay, so we like her. I couldn't tell. I couldn't tell",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 67,
      "start_timestamp": "01:09:10",
      "start_timestamp_seconds": 4150.35223880597,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4150"
    }
  },
  {
    "text": "You did an AMA? So what did you do? You're making a mistake. What did I do to make a mistake? Who did I do to make a mistake? I don't know. Loretta or I like to go Ellie. Okay, so we like her. I couldn't tell. I couldn't tell if this is good or bad what I was going to get into. Okay, so we're excited to have Lucy around. That's great. Okay, talking about overthrowing dictators, which is fucking sick. Hey, man, islands. But what you're telling me is I don't understand is that offshore means secrecy haven. So you still have an offshore account in the US. Oh, I see what they mean. Yeah. That's absolutely a thing. That's really cool. Introductions exist all around. I mean, I don't I actually don't agree with this. I mean, I literally think one of the elements of an offshore account is that it's like literally offshore. I understand the power lines that she's using it in here. Because she's talking about the rights and privacy of different entities being formed in different places, which is completely true. It's why a big reason most people in the US, when we're forming LLCs and entities like that, we will form them in Delaware, Wyoming, those kinds of places. Delaware is really, really well known for their privacy. But that's still peniturable. It's not impenetrable. But by going offshore, it can become way more impenetrable, which is the nature of having offshore",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 67,
      "start_timestamp": "01:10:49",
      "start_timestamp_seconds": 4249.170149253731,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4249"
    }
  },
  {
    "text": "forming LLCs and entities like that, we will form them in Delaware, Wyoming, those kinds of places. Delaware is really, really well known for their privacy. But that's still peniturable. It's not impenetrable. But by going offshore, it can become way more impenetrable, which is the nature of having offshore entities. Okay. Offshore system connect naked short selling. Oh, this is interesting. And it's about the Sedona story 20 years ago. Sedona software company, basing King of Prussia. Okay. Deal was vassette. Okay. Let's do us all a big favor. We'll take this whole thing. I'm going to throw it into chat GBT. I'm going to tell it to summarize this. I don't want to miss March her work, but it's just a lot of fucking words. Okay. So let's see what she's talking about here. Sedona, Pennsylvania software company, soft funding, engaged, investment banker, Michael, whatever the fuck owned by. I'm a group of from a group owned by icon. That's interesting because what there's a recent photo of Ryan Cohen with icon, isn't there? Pretty sure there is a vassette arranged 2.5 mil financing deal. Lenders would be repaid in shares. Okay. Depending on the strike price that conversion, desk, desk spiral financing. Thomas in Andreas, bait in advisors intermediaries leveraging an offshore fund, Amro International registered in Panama Beach. In Panama, based on Zurich, he'll include it as social questionable entities. Yes, I mean, it lives short setting. Sedona's contract prohibited shorting as it would depress stock",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 67,
      "start_timestamp": "01:12:27",
      "start_timestamp_seconds": 4347.988059701493,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4347"
    }
  },
  {
    "text": "conversion, desk, desk spiral financing. Thomas in Andreas, bait in advisors intermediaries leveraging an offshore fund, Amro International registered in Panama Beach. In Panama, based on Zurich, he'll include it as social questionable entities. Yes, I mean, it lives short setting. Sedona's contract prohibited shorting as it would depress stock prices increase share issuance upon conversion. Despite this, bait and orchestrated aggressive short selling through brokers at refco fucking bastards causing Sedona stock to plummet from six to 10 cents within a month. But that's see, that's the problem with shorter float stuff because short float stuff can be manipulated much more easily, right? So, that's essentially a penny stock right five six bucks and taking it down into sub dollar is really not that crazy. So this makes sense manipulation accounted for 40 of the trades. Yep, harm Sedona lost business secure new financing turned SEC. Rohingya said seller boxing, this isn't seller boxing. The reason why this isn't seller boxing, at least from a functional standpoint is a big part of seller boxing is you actually implement management that's complicit. This based on what I'm seeing here, the management was not complicit. The management was trying to figure out what the fuck is going on and they're trying to fight back. A bit different than seller boxing. Huh, who knew who fucking knew if we were going to take a screenshot or a clip from this, that's it right there because this is obviously earth shattering for everybody.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 67,
      "start_timestamp": "01:14:06",
      "start_timestamp_seconds": 4446.805970149254,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4446"
    }
  },
  {
    "text": "out what the fuck is going on and they're trying to fight back. A bit different than seller boxing. Huh, who knew who fucking knew if we were going to take a screenshot or a clip from this, that's it right there because this is obviously earth shattering for everybody. That's in attendance right now. The fact that major financial firms can enable fraudulent practices. Who would have guessed fucking caught me off guard here? That's crazed news to me unbelievable as some might say. That's fucking hilarious. Another one another just bomb shell that believe it or not guys you might want to I just stood up but you guys might want to stand sit down unless you have you know pernied a dis and stand up but believe it or not. Believe it or not this is going to come as a surprise regulatory bodies such as the SEC and courts may not adequately protect victims. Could you believe that? I mean shit. Here I am sitting here thinking that clearly financial firms would in no way enable fraudulent practices or that the SEC. They would perfectly protect us. This is crazy. I can't believe this the SEC here I have. I've just held them in such high regard my entire life and then I see this unbelievable despite reg shell loopholes possessed enabling practices like naked short selling later such as GameStop. This is fascinating. Wow what a great fucking offshoot. This is so fun. Feels the",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 67,
      "start_timestamp": "01:15:45",
      "start_timestamp_seconds": 4545.623880597015,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4545"
    }
  },
  {
    "text": "here I have. I've just held them in such high regard my entire life and then I see this unbelievable despite reg shell loopholes possessed enabling practices like naked short selling later such as GameStop. This is fascinating. Wow what a great fucking offshoot. This is so fun. Feels the deliver put out a paper saying only for us to trade on exchanges. That doesn't include the dark pools. West Christian told me that 1200 hedge funds offshore accounts were working through more than 150 broker dealer market makers to strip the small medium companies are the value with these despiral deals. Yep super common. The okay that's dramatic but it's more common than people think this I've spent a lot of time reading about this just out of general curiosity. Okay. Well what's happened in that case knows a lot about this was discovered really cases federal court got to a certain level. Might be knocked out certain cases judge rule S.C. jurisdiction. Okay. You go to court state court demand document. Okay. Wow this is neat. Okay. Let's grab this. Oh wait whoa whoa let's click this. Chat you BTO here with the truth. Already giving us the loopholes. Rule implemented. Yees brokers are required to have reasonable grounds to believe that shares can be barred for delivery before allowing short sales. This is meant to prevent naked short selling where a short seller does not actually bar the shows before selling them lead into provincial FTD's FTD's",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 67,
      "start_timestamp": "01:17:24",
      "start_timestamp_seconds": 4644.441791044776,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4644"
    }
  },
  {
    "text": "loopholes. Rule implemented. Yees brokers are required to have reasonable grounds to believe that shares can be barred for delivery before allowing short sales. This is meant to prevent naked short selling where a short seller does not actually bar the shows before selling them lead into provincial FTD's FTD's mandates clearing agencies report them. Let's see the loopholes grandfather clause one of the most criticized elements was the initial grandfather clause which exempted existing fields deliver before implementation for mandatory closing requirements to sell large amounts of short positions to remain unresolved options market maker exemption market makers and options contracts were initially exempt. From locate delivery believe that they needed the flexibility to facilitate trading. This is one of the problems like this I don't like I under liquidity is important but when it is the only guiding force for what we're doing you lose transparency. It's kind of like the similar phrasing of anybody who I forgot the fucking who the fuck said this shit it's something like anybody who over values security over Liberty deserves neither some shit like that thing is Benjamin Franklin that homey I forgot the exact saying but it's something like that where if you prioritize security so much. And it essentially becomes an infringement on Liberty. So that's kind of what I see here. Exemption was exploiting allowing market makers to create synthetic short positions same oversight. Off exchange transactions ratio primarily focused on public exchanges did not cover bark dark",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 67,
      "start_timestamp": "01:19:03",
      "start_timestamp_seconds": 4743.259701492537,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4743"
    }
  },
  {
    "text": "where if you prioritize security so much. And it essentially becomes an infringement on Liberty. So that's kind of what I see here. Exemption was exploiting allowing market makers to create synthetic short positions same oversight. Off exchange transactions ratio primarily focused on public exchanges did not cover bark dark pools and then extended settlement periods short sellers could extend the settlement period or create complex trading structures to delay the closing out of fails to deliver which we know this allowed them to prolong positions without actually delivering the shares yet we know that they do this. So oh wait grandfather close was gone this is hilarious. So there's a lot of fucking loopholes and there's lot there's a lot of not plugging of the loop if this was a boat it's at the bottom of the fucking water which is hilarious because if this was a boat my guess is these loopholes would be fucking plugged a lot better than this just love that that is epic right let's go to part two. Okay. bottom less to questions do you believe major media outlets have been compromised compromised in what a lot of financial reporters do is rewrite press releases yep that's normal. I'm just grab all this. Well this is another great one. How did rex show impact game stop yo chat GPT is the suggestions that it has are on fleek. Extreme short interest negative short selling yep. Fails to deliver yep loopholes yep yep yep",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 67,
      "start_timestamp": "01:20:42",
      "start_timestamp_seconds": 4842.077611940299,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4842"
    }
  },
  {
    "text": "press releases yep that's normal. I'm just grab all this. Well this is another great one. How did rex show impact game stop yo chat GPT is the suggestions that it has are on fleek. Extreme short interest negative short selling yep. Fails to deliver yep loopholes yep yep yep yep yep yep okay here we go. Exposed challenges and fully enforcing rex show especially in the case of highly shorted stocks and under conditions of extreme market volatility demonstrated that certain participants could still find ways to engage in or benefit from manipulative short selling. And calls for increased transparency which we haven't got. Yo I can't even get my next question out because of all these suggestions are literally perfect list SEC reforms after rex show. Grandfather clauses gone options market maker exemption gone close out rule to for introduced to close out. FTD's mandated brokers must close out FTD's. By the beginning of regular trading hours on the settlement day after failure occurred to you plus four. It failure persisted the broker group be restricted for making further short sales without first borrowing or ranging to borrow the security that's actually kind of interesting. And if you think of this as a forcing function it's actually not really a forcing. Because all it says is that you can't short more it doesn't it's not saying you have to close out your existing shorts. Which that's a little bit interesting. Short sale circuit breaker. Short selling stock price",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 67,
      "start_timestamp": "01:22:20",
      "start_timestamp_seconds": 4940.89552238806,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=4940"
    }
  },
  {
    "text": "think of this as a forcing function it's actually not really a forcing. Because all it says is that you can't short more it doesn't it's not saying you have to close out your existing shorts. Which that's a little bit interesting. Short sale circuit breaker. Short selling stock price falls by 10 or more in a day transparency best execution. SEC proposed regulation best execution is sure that brokers meet their duty to seek best execution for the customers orders which we know they do not do. This is from something like payment for order flow we know for a fact this doesn't happen. This proposal reflects a broader commitment to improving the integrity transparency of trading environment, including including short selling practices. Okay. Requires certain market participants to disclose more detailed information about short short sales public reports on aggregate short positions and that's interesting. Enhanced focused on FTD's. And the first scrutiny on FTD in the use of dark pools text you short sales that's cool. The focus was ensuring that rules surrounding settlement transparency is we're being adhered to like that. Technology data and like sub better track trading practices. That's interesting. Okay, summarize this. What kind of theories and stuff that we were going to be focusing on, but I can already tell you the very first thing that we are going to be focusing on is going through all of these. Because I'm super interested in them. And my guess is a lot of",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 67,
      "start_timestamp": "01:23:59",
      "start_timestamp_seconds": 5039.713432835821,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5039"
    }
  },
  {
    "text": "kind of theories and stuff that we were going to be focusing on, but I can already tell you the very first thing that we are going to be focusing on is going through all of these. Because I'm super interested in them. And my guess is a lot of the DD that I want to learn about is going to be baked into this. Okay. What do you say? How customers can discern between trusted compromise media outlets. Okay. Lucy emphasizes verifying claims with documented evidence and maintaining a record of media accuracy over time mainstream media such as CNBC may not always be reliable. We use like superstar provide valuable data based analysis often more informative. Yep. Okay. Complex options. And then we have to start to create phantom shares by inflating the number of shares shorted without actual delivery. That's interesting. Explain number four more. And hedge funds use complex options strategies to synthetically create shares that do not exist. Such as buying shares while simultaneously selling calls or puts these trades allow participants to create synthetic long. That can be lent out as if it were the real stock that's facilitating short shares without the actual underlying shares. Buying right by right transactions and resetting obligations. Buying the security sells a call on the security allows the trader to use the bot shares to cover a short position while simultaneously creating a new delivery obligation through the call option. That's fucking super smart effectively bypassing the",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 67,
      "start_timestamp": "01:25:38",
      "start_timestamp_seconds": 5138.531343283582,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5138"
    }
  },
  {
    "text": "underlying shares. Buying right by right transactions and resetting obligations. Buying the security sells a call on the security allows the trader to use the bot shares to cover a short position while simultaneously creating a new delivery obligation through the call option. That's fucking super smart effectively bypassing the standard settlement requirements of T plus two. And. Good question. How well understood are these things by people like in the community writ large. Like I'm curious. T.C.M. King says this is why cycles happen sort of I actually don't fully agree with that. The reason why I don't fully agree with that is because by going through this synthetic process, it essentially means they're like this can be done into perpetuity. Right. So it would actually be the antithesis of cycles because by doing this, they get themselves out of T plus two. And by being out of T plus two, they no longer are constricted right they they have used this loophole to locate. So the problem is if you with these loopholes that literally give them ability to do essentially synthetic locating. It essentially gets rid of the cycle theory because there wouldn't be a cycle because they're not beholden to the time frames. Even a Greek says been aware of this for three years, but I'm curious like to the depth like what what is the overall depth that people understand this stuff off Putin says T plus two is no more that's correct. That was",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 67,
      "start_timestamp": "01:27:17",
      "start_timestamp_seconds": 5237.349253731343,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5237"
    }
  },
  {
    "text": "they're not beholden to the time frames. Even a Greek says been aware of this for three years, but I'm curious like to the depth like what what is the overall depth that people understand this stuff off Putin says T plus two is no more that's correct. That was revised recently we actually talked about this. Ftds sold by settlement date. Yep. So everybody says to see do you take in limited action. Yeah, we know they don't fucking care. Okay, now part three. Let's see. Cedric says not deep in depth besides couple D. D. Riders. Titty says back when D. D. was actively being done people posted videos on the D. D. people went in depth explaining the D. D. Basically died. Why did the D. D. die? I don't understand that with so many people looking at this. To me, it seems like it would just be really logical that it would move closer and closer to viable information that everybody could then probably make money off of. So why they got bored. Okay, yeah, I could see that that's actually one of my superpowers honestly is like when I start doing shit, I just keep doing it whether I'm bored or not. So, but I can totally understand how people could get bored. TCM says most of the community believes that short interest is much greater than reported crux of the whole MOS is that short interest is still very, very high. I got it.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 67,
      "start_timestamp": "01:28:56",
      "start_timestamp_seconds": 5336.1671641791045,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5336"
    }
  },
  {
    "text": "doing it whether I'm bored or not. So, but I can totally understand how people could get bored. TCM says most of the community believes that short interest is much greater than reported crux of the whole MOS is that short interest is still very, very high. I got it. Okay, so it's still the real emphasis on a squeeze versus just game stop going on. Okay, yes, we know this. Media's role. We know this. What occurs in regulated spaces, but like transparency and off exchange. Okay. Consider it adopting a system of unique numerical identifiers for each share known as hard locate to prevent repeated shorting of the same shares. That's cool. That's also interesting that it was rejected. I don't know why. Why would that have been rejected guys. Any ideas. Manipulation by overstock in 04 I don't hear this reference much. I hear people reference like what is it? Volkswagen. Is that it? I there's another reference I hear all the time. Some of the tactics used. Yeah, I don't hear many people talk about overstock. Regulators suck. Yep, there's a lot of research. And she's coming out with a book. That's cool. Is anybody ever read the book? I assume her books out. I assume that this is pretty old. Huh. Fascinating. That was very cool. All right, let's get back to this. We'll got a couple minutes left. All right. Who's this guy? Alex. Oh, he is on a live. What? Because own life.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 67,
      "start_timestamp": "01:30:34",
      "start_timestamp_seconds": 5434.985074626866,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5434"
    }
  },
  {
    "text": "read the book? I assume her books out. I assume that this is pretty old. Huh. Fascinating. That was very cool. All right, let's get back to this. We'll got a couple minutes left. All right. Who's this guy? Alex. Oh, he is on a live. What? Because own life. June mistakenly believe in he lost 750K and Robin Hood. I mean, it's fucked up. It's fucked up that their platform was off. But it's still my guess is just there is probably something not. Not okay with him. That's still that's a massive leap bro. You just declare bankruptcy. Right? Like if you're so far. If you're so far underwater, you can declare bankruptcy. Get your debt absolved. There's terms to it, but all I'm saying is I just this strikes me as somebody who wasn't in a clear frame of mind. Obviously seeing something as stressful as that can put you out of a frame of mind and it sucks. That fucking Robin Hood. Yeah. Yeah. Yeah. What what did you guys know what the trade was? I was incorrectly assigned more money than I should have my bot puts. I should have covered the puts I sold. I don't understand this. Is this if it's if this happened because you sold too many puts. I mean, that's also just. Again, I feel bad for him and his family. I'm not trying to talk trash. I just try to look at stuff objectively. And if you have a",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 67,
      "start_timestamp": "01:32:13",
      "start_timestamp_seconds": 5533.802985074627,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5533"
    }
  },
  {
    "text": "I don't understand this. Is this if it's if this happened because you sold too many puts. I mean, that's also just. Again, I feel bad for him and his family. I'm not trying to talk trash. I just try to look at stuff objectively. And if you have a bunch of short puts, that's like way oversized and you're not ready to see the account move. Even if you know this looks like bullshit. Man, it just it strikes me somebody like this shouldn't trade like that's that's what I see is like somebody with this kind of temperament shouldn't trade. Thanks for reaching out. Want to let you know that we're getting back to you as soon as possible. Okay. Later that day. Oh, so this was impulsive as fuck too. So this was it happened the night before. Got in touch the next day. They said they would follow up and then that same day he did this. Fuck man. Oh, that's fucking awful just across the fucking board. Damn, man. That sucks. Yep, this makes sense. Right. Like he should not have been trading. He definitely should not have been trading options. That's there's no doubt about any of that. But that's crazy. Fuck that's. In a note to his parents. How was a 20 year old with no income able to get a sign almost 1 million worth of leverage the puts I sold I bought sessions should have canceled out. But I also have",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 67,
      "start_timestamp": "01:33:52",
      "start_timestamp_seconds": 5632.620895522388,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5632"
    }
  },
  {
    "text": "about any of that. But that's crazy. Fuck that's. In a note to his parents. How was a 20 year old with no income able to get a sign almost 1 million worth of leverage the puts I sold I bought sessions should have canceled out. But I also have no clue what I was doing now on hindsight. Yeah, man, like this is tricky because I really believe that people should be responsible for what they do. But like if he's doing this and he doesn't know what he's doing like. Yeah. There was no intention to be assigned this much and take this much risk. And I only thought I was thinking about the money that I actually owned. And he said he says no, he didn't mess it up. Robinhood messed it up. No, I mean, he did to again, I'm not I'm not saying anything disrespectful towards him. This is just an objective analysis like the thing that he messed up was this. But I also have no clue what I was doing now in hindsight. Right. So if you're trading derivatives, which are leveraged products. And you say you have no clue what you're doing. Like you are absolutely partially responsible for the thing. Now this is obviously a permissions issue. But again, this permissions issue being wrong doesn't force him to use options. So this is their bad for having this wrong. And you can see that they have it wrong. Where was it",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 67,
      "start_timestamp": "01:35:31",
      "start_timestamp_seconds": 5731.438805970149,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5731"
    }
  },
  {
    "text": "Like you are absolutely partially responsible for the thing. Now this is obviously a permissions issue. But again, this permissions issue being wrong doesn't force him to use options. So this is their bad for having this wrong. And you can see that they have it wrong. Where was it up here for lots of people hundreds of people they fucked that up for you guys know I hate Robinhood. I'm not defending Robinhood. I fucking hate Robinhood. But I just there's there's layers to this and it's not just Robinhood's fault that this happened. This 600 examples of Robinhood customers who shouldn't have been approved for options trading. So yeah, like they completely fucked up. But God, that stocks that really, really sucks. But like this is really tricky, right, because this essentially. This is essentially saying, I don't know, again, like I'm really a massive advocate of personal autonomy. And this essentially means that somebody else needed to do something for him to make a different choice there, which again, it's not unfair to say that. But I would just love so much more if he felt more comfortable and confident with what he was doing. So it's one of the reasons it's why we do these videos. It's literally why I spend time doing shit. I don't think of this. Deep of a scenario most frequently to be completely honest. But I do think about the the strife and strain a lot of people go through learning",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 67,
      "start_timestamp": "01:37:10",
      "start_timestamp_seconds": 5830.256716417911,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5830"
    }
  },
  {
    "text": "one of the reasons it's why we do these videos. It's literally why I spend time doing shit. I don't think of this. Deep of a scenario most frequently to be completely honest. But I do think about the the strife and strain a lot of people go through learning about options and losing money that they don't have to lose because I've been there. I know what that's like. So that I really, really agree with. Yeah, crazy. Okay. These are very cool. I'm learning a lot of stuff. I'm going to get through the rest of this row. And then I'm going to pop off and go grab dinner. We're having our chef tonight made us chicken parm. I'm actually pretty stoked on that. Let's see. Do diamond hands work in zero gravity. That is fucking awesome. Oh, that's classic. I love that. Let's see when moon. Is this an actual picture of RC or these I can't tell if they're like doing stuff to make these pictures or not. Okay, so this is actually a picture from that's awesome. It's fucking hilarious. How much fuel is in this rocket to the moon? Why did they stop doing these? These are so awesome. Look at this. You get a personal. Personal rocket career. How great is that? Oh, did I just do this one? Good old Dave Lauer. The homey. Interesting. All right. I'm not ready to be done. I was hoping to find like another thing I",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 67,
      "start_timestamp": "01:38:49",
      "start_timestamp_seconds": 5929.074626865672,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=5929"
    }
  },
  {
    "text": "these? These are so awesome. Look at this. You get a personal. Personal rocket career. How great is that? Oh, did I just do this one? Good old Dave Lauer. The homey. Interesting. All right. I'm not ready to be done. I was hoping to find like another thing I need to look at. A lot of stuff about for long. March call. Oh, Newton hit us up. I found the DD library from super. This is awesome. That's another thing that I absolutely just love about GameStop is that it introduced me to Newton and Newton and I are very different people. I'm not sure if I can do this. But he is such. He's just such a great guy and it's so fun. To bullshit with him and to think like our entire relationship in general is based on fucking the stock. That's one of my favorite things about KI because when it comes to like belief systems, we are like polar opposites because he's not just religious in like a standard, you know, like kind of religion. Like the type of beliefs that he has with his religion are like very specific and they're a little. I don't want to call it extreme. That's dramatic. And that doesn't convey the correct point. But they're like more. I don't want to call it strict, not strict either. I don't know the word to use here. But it's like there's more to it than like standard. Yeah, thank you.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 67,
      "start_timestamp": "01:40:27",
      "start_timestamp_seconds": 6027.8925373134325,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6027"
    }
  },
  {
    "text": "don't want to call it extreme. That's dramatic. And that doesn't convey the correct point. But they're like more. I don't want to call it strict, not strict either. I don't know the word to use here. But it's like there's more to it than like standard. Yeah, thank you. Rowing to the perfect. Thank you. Rige it. That's the word. Thank you. They're more rigid and the like the belief system is very rigid. And I am very much a libertarian. Like I want everybody to believe and do what they want. And a big part of his belief system is that he thinks everybody should be and believe the setup that he has. But the way that he believes that is so different because it's not like a missionary style like go convince people. Right. And it's still let other people be their thing. It's just one of the one of the coolest things. Ever. Roryntin he says, what does libertarian have to do with religion? I use libertarian not in the context of a political party. But libertarian is a belief system and a big element of a belief system is that like if somebody came to me and they said like Eric, should I be Muslim or should I be Christian? I would not say you should be Muslim or Christian. I would say you should be what you want to be. Whereas somebody that's from a more strict faith. They would say something like you",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 67,
      "start_timestamp": "01:42:06",
      "start_timestamp_seconds": 6126.710447761194,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6126"
    }
  },
  {
    "text": "me and they said like Eric, should I be Muslim or should I be Christian? I would not say you should be Muslim or Christian. I would say you should be what you want to be. Whereas somebody that's from a more strict faith. They would say something like you should be blank, whatever blank is because they obviously genuinely believe that that person should be whatever blank is. But his his broader approach to it is really interesting, right. Because Sadrik says he doesn't give a shit what you think or do that's and that's the cool part, right. Is that he that's exactly right. He has his own belief system that's very rigid. But he's still so open, which is really cool because he and I spend a little while talking about beliefs. And it was just a really fun conversation. We both really enjoyed it. Take coming up. Celebrate the fulfillment. Reno Nevada classic Reno 911 memes. Cool. That was that one. Wait, did I skip a row? I didn't. Close up. I love all the fucking GM E Apollo program. The break in the. I love all the 69 Lego memes that Lauren says he puts out positive vibes. I appreciate that massively positive vibes. The other thing I love about him is that like whenever we talk, we it's like an exchange of ideas and it's not like all these like superficial things. It's like actually more cerebral thoughts, which is fucking awesome. You don't",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 67,
      "start_timestamp": "01:43:45",
      "start_timestamp_seconds": 6225.528358208956,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6225"
    }
  },
  {
    "text": "out positive vibes. I appreciate that massively positive vibes. The other thing I love about him is that like whenever we talk, we it's like an exchange of ideas and it's not like all these like superficial things. It's like actually more cerebral thoughts, which is fucking awesome. You don't find a lot of people that are like that, to be honest. That's not to say like people aren't cerebral people definitely are. There's a lot of people that are super smart. But to find people that are like truly self reflective is completely different. Real intentions unclear. I thought he was just kidding, but he was being serious. Oh, this is perfect. Be excellent to each other. We're literally just talking about that. No. Both of these should be okay. Both of these should be okay. Damn. I just got straight up out of here. This magazine got me nuts. Golden Jordan wholeburg. Look at this cat. Only you can prevent naked shirts. I like a butterfly hold like a B. He hasn't changed. You've been holding for this long. So what's a little longer at the latest drama with the moderators of. Oh, interesting. Of superstunks should not affect any ape strategy or shake. It's like a lot of dissimilarity and confidence in the incredible turnaround underway game stop. The threat of witchcraft isn't enough to make anyone paper hand the shares from the diamond hands sub is just one of the ways apes communicate and share ideas.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 67,
      "start_timestamp": "01:45:24",
      "start_timestamp_seconds": 6324.346268656716,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6324"
    }
  },
  {
    "text": "affect any ape strategy or shake. It's like a lot of dissimilarity and confidence in the incredible turnaround underway game stop. The threat of witchcraft isn't enough to make anyone paper hand the shares from the diamond hands sub is just one of the ways apes communicate and share ideas. Oh, that's interesting. So this is like really. So the drama from the mods like clearly went live. That surprises me. Content in this explosive DD is nearly as amazing story behind it. Okay. So it's just kind of like a preamble. I need to learn more about like the fucking mod drama. I've heard of different pieces of it, but I just haven't heard. What the what the beef was. And I'm also really sad that these stopped. Really like these. Alright, so we got to save this page for sure. And we'll add this to our to do list. Because I guess this is what we're going to be going through for the next hot minute. We have a bunch of DD to run through. And then we'll figure the rest out. Alright guys, I'm going to go stuff my fat face with some chicken parms, some salad and whatnot. Be an ape outlier or an outlier ape, whatever suits you best. Shout out to the 100 people that are here hanging out. Don't forget to like the video because it does help the channel grow. I much appreciate it. And I will see you guys around. Take",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 67,
      "start_timestamp": "01:47:03",
      "start_timestamp_seconds": 6423.164179104478,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6423"
    }
  },
  {
    "text": "and whatnot. Be an ape outlier or an outlier ape, whatever suits you best. Shout out to the 100 people that are here hanging out. Don't forget to like the video because it does help the channel grow. I much appreciate it. And I will see you guys around. Take care everybody.",
    "metadata": {
      "video_id": "yanizXL68us",
      "title": "GME Top Theories Analysis Pt1 | GameStop Analysis Live Ep18",
      "url": "https://www.youtube.com/watch?v=yanizXL68us",
      "upload_date": "",
      "duration": 6626.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 67,
      "start_timestamp": "01:48:41",
      "start_timestamp_seconds": 6521.982089552239,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yanizXL68us&t=6521"
    }
  }
]