[
  {
    "text": "What's up, we'll give everybody just a couple of seconds to make their way in and then we will kick this bad Larry off. I hope the week is wrapping up pretty well for everybody. I think we had a really interesting trading week. So excited to talk a little bit about that, but really the primary goal for today's session is going to be talking about some, whoa, turn that off. I'm right now. I'm trying to stream to, let me see if this is working. It doesn't look like it. That's okay. I was trying like this multi stream thing, but it looks like it is not doing what it's supposed to do. That's cool. That's how it goes. So let's see who we got. It looks like we got Reese Lauren. We got Liz chicken nugget chicken nuggets. Always a fun name. That Lauren says I already feel personally attacked with this title of the lie that's, honestly, it's not that far off. I actually think that would be that's a. I don't know if we're going to necessarily pick on you specifically today, but you could technically be a candidate. I think that that's, that's completely fair. I don't blame you. Cool. So let's, let's get this, let's get this thing going. Now a couple of things that I do want to start with is, it is the end of the month. So as I typically talk to people specifically in our community, now's like a",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 50,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=0"
    }
  },
  {
    "text": "fair. I don't blame you. Cool. So let's, let's get this, let's get this thing going. Now a couple of things that I do want to start with is, it is the end of the month. So as I typically talk to people specifically in our community, now's like a perfect time to start. Well, not start. And if you're just starting now, I have to be completely honest. You're a little bit late, but now's a perfect time to go through the overall performance for the last month. A lot of people don't do this, which is actually super interesting to me, the fact that the vast majority of people don't do that. But now's the time. If you haven't already done it to do it. And what I try to do is at the end of each month, go through my performance a little bit more in depth. Actually, what we're going to start reviewing on the Sunday live stream is my performance, how the month went where I sit for the year and specifically looking at plans into the end of the year. That's the entire idea. So highly recommend that process. Now before we get kicked off, I would love to hear you all specifically. If there's anything in particular that you want to hone in on throughout the session, I feel free to throw that into the chat. But otherwise, literally my game plan was to spend a little time poking around Reddit as one",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 50,
      "start_timestamp": "00:01:26",
      "start_timestamp_seconds": 86.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=86"
    }
  },
  {
    "text": "off, I would love to hear you all specifically. If there's anything in particular that you want to hone in on throughout the session, I feel free to throw that into the chat. But otherwise, literally my game plan was to spend a little time poking around Reddit as one does and just see what we see there. And I think every time I go through Reddit, it provides such a great conversation point. And I think it's such a great learning tool, which I have to be honest. It's a great learning tool more often than not about what not to do genuinely. And that's not to throw shade at people on Reddit or any other place. It's really not at all. Just a way to learn from each other's mistakes. And we do this kind of learning in the military all the time, especially as a marine officer, when you go through your early on schools and stuff like that, you spend a lot of time watching your peers get blasted. And as one of your peers is getting blasted, you don't typically sit there and think like, snickering at them, haha, haha, they fucked up because you know your time's coming too. And it's just a matter of time before you're the one getting blasted. So it's actually a really great communal learning environment where you realize everybody's going to get fucked up. And the best possible thing you could do is watch your friend get fucked",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 50,
      "start_timestamp": "00:02:37",
      "start_timestamp_seconds": 157.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=157"
    }
  },
  {
    "text": "know your time's coming too. And it's just a matter of time before you're the one getting blasted. So it's actually a really great communal learning environment where you realize everybody's going to get fucked up. And the best possible thing you could do is watch your friend get fucked up, see what they're getting fucked up for, and then try to learn how not to get fucked up for that thing. And then you are going to be an example for somebody else at some point. It's it's going to happen. And but that kind of learning environment where we can healthily learn from each other's mistakes is a rapid accelerator and taking it back to Reddit. Reddit offers a lot of places where you're going to find novice traders. The only reason why I post on Reddit is because I have a social media platform that's completely centered around trading. If I didn't have a social media presence a YouTube channel, the last possible place that I would be with any sort of frequency, I would still post on a place like Reddit because it's actually one of the first places that I started using when I was learning about social media, like understand what people are looking at, how they think about the markets. But I wouldn't go to Reddit for information. I can tell you that I would go to Reddit to try to help people intermittently at best. But you're not going to find a",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 50,
      "start_timestamp": "00:03:37",
      "start_timestamp_seconds": 217.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=217"
    }
  },
  {
    "text": "learning about social media, like understand what people are looking at, how they think about the markets. But I wouldn't go to Reddit for information. I can tell you that I would go to Reddit to try to help people intermittently at best. But you're not going to find a lot of people that are like purposefully going to Reddit to share quality information. That is just the facts. So if we look through what we expect to see, I would wager that we're going to see 98 completely beginner posts. And then the 2 of quality ad posts are going to be from people like me that have an incentive to post to Reddit. It's I mean, I work in plain sight, right? The incentive for me to post to Reddit is twofold. First is it allows me to do something that I derive marginal utility from, which is I genuinely enjoy helping people. So it allows me to do that. And then it also helps my overall social media footprint. So because of those kinds of things, I have a baked in incentive to interact there. Most people don't. Most people will lurk on Reddit. And again, the only reason I'm spending time talking about this is because I'm trying to prime the beginner options trader mind, right? That's what the session is for. Options trading for beginners. And Reddit is not a great place to actually learn what to do. It is an incredibly great place to",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 50,
      "start_timestamp": "00:04:43",
      "start_timestamp_seconds": 283.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=283"
    }
  },
  {
    "text": "only reason I'm spending time talking about this is because I'm trying to prime the beginner options trader mind, right? That's what the session is for. Options trading for beginners. And Reddit is not a great place to actually learn what to do. It is an incredibly great place to learn what not to do. And both of those have completely efficacious, inviable use cases for a trader. So I think it is time for us to pop over and let's see what's in here. This is hilarious literally for so this is from options. And this is the very first post, which is hilarious. Love that. Actually, like legitimately kind of kind of hilarious. I suppose we start here. I mean, we click into this once you what's going on. I lost 3K trading options for the first time. Basically this was my first week trading options. I was up 3K earlier this week and by the end of this week down to 3K. 3K is a lot of money to me and I feel like such an idiot. I've never made irrational stupid decisions like this. Now this is, I have to talk about this. I can. I don't want to be harsh to this person. I don't know them. I can literally guarantee them that this is not the only place they've made irrational and stupid decisions. This is why I spend so much time emphasizing and talking about the nuance of communication and evaluation. There is",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 50,
      "start_timestamp": "00:06:01",
      "start_timestamp_seconds": 361.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=361"
    }
  },
  {
    "text": "don't want to be harsh to this person. I don't know them. I can literally guarantee them that this is not the only place they've made irrational and stupid decisions. This is why I spend so much time emphasizing and talking about the nuance of communication and evaluation. There is actually a member in the discord earlier today that I made a post. I typically do an end of market on close, MOC post and ask people how things went. Except for this one, I focused a little bit more on how did the month go because this is a new month now. And one of the conclusions that the person had was one of their strategies. They were saying essentially don't trade this strategy because it doesn't work. And I had to qualify and work with them on actually analyzing that statement because it's not actually the strategy itself that didn't work because as they rightly pointed out, there actually wasn't really a strategy built. So this is a false attribution and it's a really, really big problem when you're trying to objectively analyze things. You cannot go down the path of false attributions because it leads you down the entire wrong path. This is the same thing that I get pissed off when people say like you'll never go broke taking profits. It's a false attribution. You can absolutely go broke taking profits. So it's so important to break things down into their core concepts so that then",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 50,
      "start_timestamp": "00:07:20",
      "start_timestamp_seconds": 440.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=440"
    }
  },
  {
    "text": "the entire wrong path. This is the same thing that I get pissed off when people say like you'll never go broke taking profits. It's a false attribution. You can absolutely go broke taking profits. So it's so important to break things down into their core concepts so that then you can objectively analyze them. Taking it back to this post, I can literally guarantee you this is a false attribution from this person because guess what? I know that I've made more than one irrational or stupid decision. I've made more than one. I've made fucking a lot more than one. So for them to chalk this event up as if this is the one that they've made, it doesn't make sense, right? It's a false attribution. This is going to send them down the wrong path thinking like oh, because again, what this means to this person is that this is the anomaly, right? Normally, I'm really rational. I don't make any stupid decisions. This is just an anomaly, right? And by building it in their mind is just an anomaly, it's going to get a completely different level of mental rigor in analysis. So let's continue with the post. I just have been seeing everybody else make money. You've all seen this a million times. So I'm not going to spend time on that. And plus my relationship ending just sent me into a spiral. And again, this is not to pick on this person at all.",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 50,
      "start_timestamp": "00:08:31",
      "start_timestamp_seconds": 511.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=511"
    }
  },
  {
    "text": "the post. I just have been seeing everybody else make money. You've all seen this a million times. So I'm not going to spend time on that. And plus my relationship ending just sent me into a spiral. And again, this is not to pick on this person at all. It's not like I've made all of these kinds of errors. I talk about these things not in the context of trolling somebody else for trying something new and fucking up because I literally do that all the time. I'm being very precise and I'm absolutely thoroughly evaluating what they're talking about. And I'm being honest. It's one of the big things people, at least I feel like in my generation that we're starting to lose is the ability to be honest with one another, right? Because we can't hurt feelings. Everybody's super soft. And then you say something mean and then they go fucking cry about it or some shit. That doesn't mean the inverse where you go be a dickhead to people just to be an asshole. But that's the opposite of this. This is me taking the time to use this person's scenario to teach other people. Maybe they end up watching this video, which would be great. I think that would be great for them, right? So that they can get genuine, honest feedback from somebody that is designed to try to help them get better, right? So this tells me a massive problem. How emotional",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 50,
      "start_timestamp": "00:09:53",
      "start_timestamp_seconds": 593.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=593"
    }
  },
  {
    "text": "Maybe they end up watching this video, which would be great. I think that would be great for them, right? So that they can get genuine, honest feedback from somebody that is designed to try to help them get better, right? So this tells me a massive problem. How emotional are you as a person when you go through a breakup? Some of the worst periods I've had in my life looking back have been during relationships. They have fucked up the way that I think the way that I analyze. They make me act out of character. So to start something like trading options at the time when a relationship is ending, that's not a great time to start picking up a skill set like this. That's not to say don't keep learning to trade options. That's completely okay. Maybe not the time to go live with your money for the first time, right? That's again, this is saying I've never made irrational stupid decisions like this. This is another one right here. So beyond whatever risk they were doing to have their account, that's irrational and not super logical. And then this here is a second irrational choice that I can see within two sentences. After I lost my initial 3K that I was up on, I panicked and tried to get my money back. This is super common and lost three more thousand rather than just being even. I feel like such an idiot and I could",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 50,
      "start_timestamp": "00:10:52",
      "start_timestamp_seconds": 652.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=652"
    }
  },
  {
    "text": "that I can see within two sentences. After I lost my initial 3K that I was up on, I panicked and tried to get my money back. This is super common and lost three more thousand rather than just being even. I feel like such an idiot and I could have really used the money to buy necessary things for medical school when I start next year. So there's like everything about this genuinely is wrong. And one of the problems that this person has again is I'm guessing they're not getting any real good dose of genuine direct feedback on what they're doing. Because I like honestly, I cannot see a good decision that's been made in this entire thing at all. And that's not to belittle and that's not to bear down on them. It's just to let them know that like this whole thing ain't it? All of this like this on fire, use it as an experience, like realistically speaking, 3K super cheap, super cheap learning experience. You get that done out of the way. But my guess is because of all the false attributions that are going on here, as they start to scrape together more money, they're going to fuck it up again. And I don't want them to again, I have to be so clear because when I say stuff like this, people will naturally take the inverse of what I'm saying, right? So when I say something like they're going to fuck",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 50,
      "start_timestamp": "00:12:05",
      "start_timestamp_seconds": 725.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=725"
    }
  },
  {
    "text": "more money, they're going to fuck it up again. And I don't want them to again, I have to be so clear because when I say stuff like this, people will naturally take the inverse of what I'm saying, right? So when I say something like they're going to fuck it up again, people will infer that I want them to the last possible thing I want to happen. But this is the overwhelming probabilistic outcome for this person based on what I see here. So when we look at something like this, Wiggly warm is exactly on it, right? Dude was tilted into press, lost, focused, due to break up. That's 100 correct. This is the last possible time to start trying to trade with real money, especially being, I don't know how old this person is. I can kind of tell that they're a little bit younger, not just from the medical school start, but also from again, like what's going on here? The way that they're presenting themselves is an immature person. Again, that's not a dig. This is just somebody that is still not going through the maturation process. That's actually one of the most beautiful things about going through the military route, and especially going through as an officer is you really do mature super fucking fast because there's a lot of gravity placed on you at a super young age. And it makes you think about things completely differently. You're still very immature to",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 50,
      "start_timestamp": "00:13:21",
      "start_timestamp_seconds": 801.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=801"
    }
  },
  {
    "text": "things about going through the military route, and especially going through as an officer is you really do mature super fucking fast because there's a lot of gravity placed on you at a super young age. And it makes you think about things completely differently. You're still very immature to be super clear, but you are quite more mature than most people like this at this point in time. Essentially, one of the reasons why when I was in college, when a lot of my friends were kind of chilling, going out partying, I still did my fair share of that, but I had no problem on Friday night spending literally eight hours after school ended, just digging into learning about options. I did that all the time. I spent the bulk of my learning time as a percentage of available time during college, learning about options. And it's because I took this shit really seriously, but going back to this person, I think they need to sit down and really spend the time to analyze what the fuck they're doing and to be honest with themselves. That's the biggest thing I see here is it is going to be so difficult to make a successful run at this if we're not being very thorough with our self analysis and stuff like this. This is like literally, it's a dismissive statement. This is chalking up something bad that happened to an anomaly and it's a bad choice. All right, I'm",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 50,
      "start_timestamp": "00:14:21",
      "start_timestamp_seconds": 861.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=861"
    }
  },
  {
    "text": "so difficult to make a successful run at this if we're not being very thorough with our self analysis and stuff like this. This is like literally, it's a dismissive statement. This is chalking up something bad that happened to an anomaly and it's a bad choice. All right, I'm open to window. Anything else you guys would add to this one? Yo, what up Tommy? Good to see you. Lance says they need to not Google their name. Interesting. It makes me want to Google that, but I also am willing to take Lance at face value here. I think it's fair. Lauren says learning options feels like learning five languages at once. It's a bit overwhelming, definitely. It is. Not only do you have to learn finance, not only like the most tricky part about learning to trade options is without a doubt there's no structure for you. There's a lot of shit you have to do. Right. There's a lot of shit you have to do right. And most people I wasn't ready either. In my late teens, early 20s, I was not at a point where I was ready to do the things that needed to happen. And if I look back through my performance, I can see it. I've been really fortunate and I've only had two negative years. My first two, both of them were less than 5 draw downs. That was due to pure luck. And the fact that because of my background,",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 50,
      "start_timestamp": "00:15:24",
      "start_timestamp_seconds": 924.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=924"
    }
  },
  {
    "text": "happen. And if I look back through my performance, I can see it. I've been really fortunate and I've only had two negative years. My first two, both of them were less than 5 draw downs. That was due to pure luck. And the fact that because of my background, I grew up at the scarcity mindset. So I was terrified of losing money. Somebody like this obviously has a completely different background because if you grow up, I'm not like destitute poor, but like if you look up that like objectively, I was poor. I was like, if you grow up poor, this is not your activity. Like this is not the way this tends to go that early on. Because you're too scared to learn what you spent so much time trying to build and collect. So people that have my kind of background have a whole litany of other mental hurdles to get over, which is being too risk off. As compared to somebody like this, where they are too risk on, they're too comfortable throwing money out in something that they know nothing about, money that they know that they can't lose. And again, my guess is that they probably have a family that tends to bail them out. That's my guess because if you don't have that kind of structure, this kind of move is catastrophic. It genuinely is. So my guess is that they've had a support system that's been able to help them",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 50,
      "start_timestamp": "00:16:49",
      "start_timestamp_seconds": 1009.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1009"
    }
  },
  {
    "text": "is that they probably have a family that tends to bail them out. That's my guess because if you don't have that kind of structure, this kind of move is catastrophic. It genuinely is. So my guess is that they've had a support system that's been able to help them periodically. What I don't know, I'm guessing it's a lot of guessing, but I just inferring based on what presents here. So I think for them, they probably need to like this person. I would recommend full stop, stop trading, go to paper trading. That's the advice for most people. And I think that's most applicable here. All right. Let's see what else we got. Will options ever trade an extended hours? That's a good question. Crypto option income strategies. I kind of like that. Deep in the money calls. Do deep in the money calls get assigned if you write them? I was trading some box spreads and only short in the money put options got assigned. Yeah. So this is a good question. So the first thing here for Lord Timothy, that's a fantastic name is I don't know why we're trading box spreads and this kind of thing, right? You guys already know the approach to trading box spreads that I take, which is very different than this. And I think it should be done in stuff that European style options. That's cash settled. But there's no early exercise. But that being said, deep in the money",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 50,
      "start_timestamp": "00:17:53",
      "start_timestamp_seconds": 1073.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1073"
    }
  },
  {
    "text": "thing, right? You guys already know the approach to trading box spreads that I take, which is very different than this. And I think it should be done in stuff that European style options. That's cash settled. But there's no early exercise. But that being said, deep in the money calls, they absolutely can get assigned. And there's a specific scenario that tends to lead to that. And that's if there's a dividend coming up and the dividend is greater than the remaining extrinsic value of those options. That's the primary timeframe where that is a risk. Now it can happen at any point, any American style option can be exercised at any point, whether it's logical or not, right? Because there's going to be some people who are just fumble fucking the buttons and they're like, oh, let me try doing this. And they might accident. It's more difficult than that. I'm kind of being a little facetious here because you kind of have to message your broker. There's not like a button that says like exercise my option, but you can like they can message their broker be like, yo, I want to exercise this. The broker be like, yo, that doesn't make sense. So you sure you want to, yeah, fuck it, yolo. And then they do that. So it absolutely and then you could just happen to be paired with them. So that is absolutely a thing. Wilyworm says, can you show us how we might",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 50,
      "start_timestamp": "00:19:12",
      "start_timestamp_seconds": 1152.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1152"
    }
  },
  {
    "text": "like, yo, that doesn't make sense. So you sure you want to, yeah, fuck it, yolo. And then they do that. So it absolutely and then you could just happen to be paired with them. So that is absolutely a thing. Wilyworm says, can you show us how we might fumble fuck our buttons? Yeah. So that typically comes down to not using a tray checklist early on. Now again, in this case, I'm being a little bit facetious simply because for exercise, you would have to like fumble fuck typing an email to the, to your broker, asking them to exercise the options. And after they tell you, it doesn't make sense. You would have to fumble fuck a second email, right? So it's not really a great example that's super realistic to occur. But in terms of something like just not clicking well is if like we have examples of this through somebody in the discord not too long ago that was talking about a tray that they put on. They thought that they sold and they bought or vice versa. I forgot which order. We've all done that. Absolutely done. I did that not too long ago, not sold instead of buy. But the position that I traded was different than I thought it was. And it's because I was trading futures in bed at like 12 a.m. trying to put on a position in corn. And I had the, I didn't put on the exact position",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 50,
      "start_timestamp": "00:20:18",
      "start_timestamp_seconds": 1218.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1218"
    }
  },
  {
    "text": "not sold instead of buy. But the position that I traded was different than I thought it was. And it's because I was trading futures in bed at like 12 a.m. trying to put on a position in corn. And I had the, I didn't put on the exact position that I wanted. It was slightly missized. And like I haven't made a dumb mistake like that in a long fucking time. But that shit happens, man. It happens. So we've all literally been there before. Now Wigglyworm says trade checklist is a new term for me. Wigglyworm, don't tell me that you hate my shit like that. That's unbelievable. Here is Wigglyworm. There you go. That is a video called simple options trade checklist. It's something that I think new traders should do. And it's not something that you have to do forever. It's something that you kind of tolerate for a while. It's like the thing if you, if you're a fighter, right? If you do any sort of striking martial art, you will, at least for me, you, I have a tendency to have my head too high. So we do the game of a lacrosse ball under the chin and the reason why it's a lacrosse ball is because it's kind of heavy. Even if you take up any bit of pressure, it will fall and then typically you're punished for being undisciplined, a disgusting, undisciplined human being. So that is a guard rail that's put",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 50,
      "start_timestamp": "00:21:17",
      "start_timestamp_seconds": 1277.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1277"
    }
  },
  {
    "text": "under the chin and the reason why it's a lacrosse ball is because it's kind of heavy. Even if you take up any bit of pressure, it will fall and then typically you're punished for being undisciplined, a disgusting, undisciplined human being. So that is a guard rail that's put into place across ball to make sure that you're not being laxed as a goal and then just have your channel a little too high and get knocked the fuck out. So it's, that's the purpose of a trade checklist. I don't, I don't have a lacrosse ball when I spar anymore, right? It doesn't need to be there because I've learned the lesson. So it's in gray now. It's muscle memory. I'm, I'm pretty good. So it's the same thing with the trade checklist. The ability, and this is why I like paper trading so much because the ability to make lots of dumb mistakes is very high for a new trader and it is instantaneous. It happens super quick. So a trade checklist is literally designed to slow you down. That's the biggest thing is to slow you down and to make sure that you're looking at all the requisite details that are important to what you're doing before you enter a trade. So that we really decrease the frequency that we're making dumb mistakes. Pain retains. It's a thing. The problem is is in trading, the pain is your money and the problem with that is your",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 50,
      "start_timestamp": "00:22:32",
      "start_timestamp_seconds": 1352.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1352"
    }
  },
  {
    "text": "the requisite details that are important to what you're doing before you enter a trade. So that we really decrease the frequency that we're making dumb mistakes. Pain retains. It's a thing. The problem is is in trading, the pain is your money and the problem with that is your money typically takes a non-linear amount of time to build to what you'll lose it in. Meaning you might work for two weeks to come up with your 500 of savings and you can blow that literally in 30 seconds. The non-linear relationship makes it really, really difficult to come up with the next 500 over the next two weeks and then to learn again that way. It is simply not viable. It's not viable at all. So for most people a trade checklist to me is especially for the first six months of trading, there's no reason not to do it. I'm honed. It says, how do you recover from big losses? I had a big loss two years ago and my trading confidence is still FME over. Okay. So for I'm honed, how has your performance been since you've had those big trading losses? So meaning if you look back over the last two years, what is your performance been? My guess is going to be your performance probably has not been super great. And I'm just guessing because if your performance has been good, normally you would have a different response than that. So yeah, help me",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 50,
      "start_timestamp": "00:23:40",
      "start_timestamp_seconds": 1420.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1420"
    }
  },
  {
    "text": "look back over the last two years, what is your performance been? My guess is going to be your performance probably has not been super great. And I'm just guessing because if your performance has been good, normally you would have a different response than that. So yeah, help me understand that and then we'll talk a little bit about it. Chris, I think it's Chris. Chris. Chris, Chris, Tom, Chris, Tom. Funny story actually. I was face timing with my buddy for a while. Earlier today he's literally my best friend. I met him in high school and he and I have a very small friend group and he's been literally a lifelong friend. Very different people, which is funny, but we have a lot of similarities. So his Christ's name reminded me of him because he's going to a Halloween. He's in New York. He's going to a Halloween party tonight and he's being Jesus Christ. So we literally spent like 40 minutes talking about all the different things he can do to up his Jesus Christ costume. He actually bought 20 of like Eucharist. You get a thousand of them. He bought 20 worth of Eucharist off of Amazon. So he is like the perfect ensemble. I'm very, very excited for the for the get up that he manufactured. But we're going to have to iterate on it. On it. You're over here. That's the game plan. But Chris says I've got my account to only be",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 50,
      "start_timestamp": "00:24:57",
      "start_timestamp_seconds": 1497.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1497"
    }
  },
  {
    "text": "of Amazon. So he is like the perfect ensemble. I'm very, very excited for the for the get up that he manufactured. But we're going to have to iterate on it. On it. You're over here. That's the game plan. But Chris says I've got my account to only be able to write covered calls and buy to close. I don't even want the temptation to buy options. Honestly, if that's a thing like again, like if you don't think you have the discipline that if they give you the ability to buy options that you wouldn't, if you didn't want to buy options that like you would be possessed and compelled to do so. Like, that's a fucking problem. That's a giant discipline problem. And again, my guess is that that will absolutely come out in a lot of different places. It's not going to be relegated to the way that you write options. So I'll be super careful about that, to be honest, that that doesn't sound right to me. I'm home says I've been too scared to be risky and feel like I can't be good. Performance has not been good, but I also feel like I'm climbing up a hill. Yeah, I mean, you're definitely going to be climbing up a hill as a trader. That's the name of the game. So yeah, get used to the slope. But you're, there's a lot there. Like there's a lot there that I would actually want to unpack",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 50,
      "start_timestamp": "00:26:19",
      "start_timestamp_seconds": 1579.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1579"
    }
  },
  {
    "text": "climbing up a hill. Yeah, I mean, you're definitely going to be climbing up a hill as a trader. That's the name of the game. So yeah, get used to the slope. But you're, there's a lot there. Like there's a lot there that I would actually want to unpack because so for example, I'm at home, like I can see self limiting beliefs, right? The I can't be good. And then using even speaking like that will bring it into existence to a degree. An example of that is I used to say all the time, I'm not good at math, not good at math. Even as I say it right now, it feels fucking cringey when I say it. Like I don't like it. And it's because I've taught myself not to say that. And it's because math didn't come easy to me. And I didn't have somebody to really help me with it. But it I'd like just decided one day to stop saying it. I literally just this was an I want to say seventh grade that I decided to just stop saying I'm bad at math. Sure as fucking shit. I stopped being real bad at math. Polarious. So anyways, I can see some of that going on in your language. And then I can also see a lot of the a lot of this self attribution, like just wrongful attribution going on there, right? Because the performance not being good doesn't have to do",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 50,
      "start_timestamp": "00:27:24",
      "start_timestamp_seconds": 1644.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1644"
    }
  },
  {
    "text": "at math. Polarious. So anyways, I can see some of that going on in your language. And then I can also see a lot of the a lot of this self attribution, like just wrongful attribution going on there, right? Because the performance not being good doesn't have to do with being risky, right? You can have good performance and not be risky. My guess is that you don't have clearly defined performance metrics. My guess is that you don't have a clearly defined trading plan and a trading log to support your goal, right? Your path towards those trading metrics. So I'm honed. I bring that up simply because I just I think that you don't have the foundation based on what you're saying here. So your sensation doesn't surprise me. I would feel the same in that scenario. So for something like that coming back from a loss, absolutely is it's entirely possible. I had like over 30 drawdown on my account on one single trade. And this is when the account wasn't that big. So I just and this was a several years into trading. I've been trading for like five years at the point, something like that. And the the trick there was it absolutely wasn't easy to get over that, but it's entirely possible. A big part of that was taking the time to start building confidence again. But the way that I'm able to build confidence is by having a written trading plan that",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 50,
      "start_timestamp": "00:28:28",
      "start_timestamp_seconds": 1708.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1708"
    }
  },
  {
    "text": "that. And the the trick there was it absolutely wasn't easy to get over that, but it's entirely possible. A big part of that was taking the time to start building confidence again. But the way that I'm able to build confidence is by having a written trading plan that I trust because it's built on research that I've done. And then a trade log to then validate what I'm doing. I size trades way down so that I'm losing tiny amount of money while I start getting a feel for things again and then slowly start scaling back up. That's kind of the general process. And because like if you have a big loss that also says that we're over sized right, we're trading too large. And if I were to take a gander or what's going on there, I guess that you were too focused on what you could stand to making the trade and you didn't spend enough time analyzing the potential downside to the trade, meaning the bad path of the trade doesn't do what you want. Another very common thing that we've all done before. So it's a lot of feedback based on a couple of sentences from you in the chat. But I hope some of that at least connects in helps think, help you think about the way to frame it going forward. But again, the solution in my mind for somebody like you genuinely is it's simple, right? People again, a lot",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 50,
      "start_timestamp": "00:29:42",
      "start_timestamp_seconds": 1782.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1782"
    }
  },
  {
    "text": "of sentences from you in the chat. But I hope some of that at least connects in helps think, help you think about the way to frame it going forward. But again, the solution in my mind for somebody like you genuinely is it's simple, right? People again, a lot of trading is very simple that doesn't make it easy. So in the instance for that person, I think the game for them is going to be to again, stop trading, live money to then put that capital into some sort of buy and hold index ETF, whatever they're comfortable with, like that's fine. And to switch over to paper trading, the work on the trading plan to work on the trading log to get the trading fundamentals done. Everybody wants to blow completely past. They want to blow completely past the process of building the skill set to be a trader. But people just want to jump to the end point of being a trader. They want to go directly to I want to be a successful trader. There's a lot of fucking work that has to happen in order to go into it. And like thankfully, the reason why I'm thankful for that is because that's what provides the opportunity. If there was a low barrier to entry, the opportunity would essentially be priced out, but it's not. So you should also be thankful that trading is difficult because if it weren't, the opportunity wouldn't be there to",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 50,
      "start_timestamp": "00:30:52",
      "start_timestamp_seconds": 1852.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1852"
    }
  },
  {
    "text": "why I'm thankful for that is because that's what provides the opportunity. If there was a low barrier to entry, the opportunity would essentially be priced out, but it's not. So you should also be thankful that trading is difficult because if it weren't, the opportunity wouldn't be there to the scale that it is. Chris says I don't have the technical skills to evaluate stocks at this point to feel comfortable taking on the risk and seeing so many worse stories of people losing everything. Reddit has plenty of these stories. Sure. And that's the, that's the other scenario that you have to be aware of is the comparison group, right? One of the reasons why we look through Reddit is because as I mentioned before, it genuinely is a good place to look at how not to do things. That's because that's what happens with Reddit doesn't mean that that's what happens to everybody. Reddit is naturally, like if you think of it in terms of a sample and a population, right? You guys know that I, I love me some statistics. So Reddit is a little misleading in that sense to a lot of people and I'll explain to you why because when we look at something like Reddit, we have this scenario, oh, I think, hold on, where is it? One of these is, there it goes. I can't see anything when I do that though. That's kind of a problem. So let's go here. Do",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 50,
      "start_timestamp": "00:32:05",
      "start_timestamp_seconds": 1925.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=1925"
    }
  },
  {
    "text": "explain to you why because when we look at something like Reddit, we have this scenario, oh, I think, hold on, where is it? One of these is, there it goes. I can't see anything when I do that though. That's kind of a problem. So let's go here. Do I have anything in this? I need to find like a blank, a blank spot. Maybe, oh, maybe if we do like spread hacker, perfect. We got a blank spot. It's exactly what we need in our life. Okay. And now we need to change this back to yellow. So let's talk about what Reddit shows us. We have a total population of retail traders. Of this population, there's a much bigger subset of retail investors. So retail traders are a small subset of retail investors. Of retail traders, you'll have people that are all over the place. Reddit will show you this. Reddit is showing you this tiny subset and the rest of the retail trader population is out here. So what I'm trying to help you visualize here is it is completely okay to go to Reddit, to produce the Reddit, to learn from Reddit. You have to be very thoughtful about what you're reading. Here's a great example, a perfect example. When I started having the herniated disk stuff and I had like agonizing sciatic pain, all this kind of bullshit. So I was doing a ton of searching to try to learn about what the fuck",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 50,
      "start_timestamp": "00:33:22",
      "start_timestamp_seconds": 2002.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2002"
    }
  },
  {
    "text": "be very thoughtful about what you're reading. Here's a great example, a perfect example. When I started having the herniated disk stuff and I had like agonizing sciatic pain, all this kind of bullshit. So I was doing a ton of searching to try to learn about what the fuck is going on with me and what does this look like? There is literally a subreddit for sciatica and I have to, I'll show you because I think it's worth the example. You'll see exactly what I mean. So what do you think I'm going to find today if we scope, if we think about the people that are going to be on the sciatica subreddit? Who's going to be here? And again, this ties back to trading. It'll make sense. I think this example will help you. The people that are going to be on this are the people that have persistent problems and you're going to find people that are disrupted enough to seek advice and counsel from an online community. This goes all the way back to understanding incentives and this goes back to understanding the sample that you are interacting with. This skill set is not relegated to just your success as a trader. This is literally a life skill set to be able to look at a sample that you're interacting with and understand that sample's archetype. Their background, what their leanings are going to be because all of that is going to skew the",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 50,
      "start_timestamp": "00:35:22",
      "start_timestamp_seconds": 2122.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2122"
    }
  },
  {
    "text": "relegated to just your success as a trader. This is literally a life skill set to be able to look at a sample that you're interacting with and understand that sample's archetype. Their background, what their leanings are going to be because all of that is going to skew the majority of what you see one way or another. So as I'm reading through this subreddit, I'm sitting there. The first thoughts I have is like, fuck, I'm fucked forever. There's people in here that have all sorts of problems like this, aching chronic pain. They have all these kinds of issues. They have a, hey, L5S1, that's actually not that bad. That's a pretty big bulge or herniation, but it's not terrible. It's just like, tons and tons of issues with people that again are struggling with sciatica, which I understand. However, that being said, as I'm reading through this and I'm thinking to myself, I'm fucked. This is terrible. All of these people have all of these problems, but guess what? There's 39,000 members, 35 online. This is a small, small, small subset of people. Then I also have to layer on the fact that there's going to be a physiological difference between me and most of these people. That's not to say that I'm some sort of physical specimen, I'm not, but I'm in decent shape. I'm decently active. And I take shit like this really fucking seriously. So I spend all the time reading all these",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 50,
      "start_timestamp": "00:37:03",
      "start_timestamp_seconds": 2223.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2223"
    }
  },
  {
    "text": "be a physiological difference between me and most of these people. That's not to say that I'm some sort of physical specimen, I'm not, but I'm in decent shape. I'm decently active. And I take shit like this really fucking seriously. So I spend all the time reading all these different research papers, understanding what recovery methods work while yada yada yada, all this bullshit. So what I'm emphasizing is that the sample that I'm looking at is going to have a specific archetype. I do not fit the archetype for this sample. That doesn't mean I can't derive value from this sample, but it means that I have to be very cognitive of the propensity as I'm scrolling through the very many posts that are in here to not allow my brain to think that this is the reality for everybody. It's not. And it's easy to happen. It happens all the time, meaning when you read through this stuff and it's like shit, this is like really bad, this is terrible. And you read through tons and tons of posts like that. And then you start to think that that's representative of the landscape, it is not. So let's what's going on with the sciatical bullshit. So that same exact thing applies when you're interacting with any, any community. You have to understand the archetype of the sample that you're interacting with so that you can use that information to temper and modulate the way that you receive",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 50,
      "start_timestamp": "00:38:26",
      "start_timestamp_seconds": 2306.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2306"
    }
  },
  {
    "text": "let's what's going on with the sciatical bullshit. So that same exact thing applies when you're interacting with any, any community. You have to understand the archetype of the sample that you're interacting with so that you can use that information to temper and modulate the way that you receive data and knowledge from that group. That's the case. So there's a lot of great information that you can find from places like Reddit and whatnot, but it is so important to take the time to understand what you're looking at. So that takes us back to our example here. When we're visualizing the option subreddit of retail traders of retail investors, it is a tiny, tiny sliver of the total population. And you have to remember the incentive structure in the background behind the people that are there because otherwise it's so easy to false represent what the broad picture looks like. Wiggle here. Wiggle. Worm says also those who found the miracle curious from switching to vegan mayonnaise. That's hilarious. Well, it's actually funny because I was seeing a physical therapist in the beginning and one of the things that they were telling me is like, oh, you know, you should avoid anti-inflammatory foods. Like they started listing out the different foods that they feel are anti-inflammatory. And I'm a milk drinker. I like milk. And they were like, you know, you should avoid dairy. I was like, well, I drink whole milk. I drink like two gallons,",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 50,
      "start_timestamp": "00:39:38",
      "start_timestamp_seconds": 2378.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2378"
    }
  },
  {
    "text": "know, you should avoid anti-inflammatory foods. Like they started listing out the different foods that they feel are anti-inflammatory. And I'm a milk drinker. I like milk. And they were like, you know, you should avoid dairy. I was like, well, I drink whole milk. I drink like two gallons, three gallons every single week. I have like my entire life. And they were like, oh, yeah, you probably shouldn't, you know, you should avoid that. And I'm sitting there thinking like their point isn't moot. I understand they're common about, you know, avoiding inflammatory foods. That makes sense. But I also am logical enough to realize that there's no amount of not inflammatory foods that are going to fix the fucking herniation in my back. It's there. It's physical. There's a physical interaction between the herniation and the nerves. Me not drinking milk is not going to fucking fix that. This goes back to another process that's very important. And this is something you learn in the military very early on, which is solve the problems that need to be solved. Meaning you can't spend your time trying to optimize every tiny little piece of thing that you're doing for this one specific thing. It's to her point she might view milk as inflammatory, but milk has a ton of great qualities about it. And that helps my overall nutritional picture pretty massively. So I'm not going to over solve and optimize for the herniated disk because there are",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 50,
      "start_timestamp": "00:41:20",
      "start_timestamp_seconds": 2480.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2480"
    }
  },
  {
    "text": "for this one specific thing. It's to her point she might view milk as inflammatory, but milk has a ton of great qualities about it. And that helps my overall nutritional picture pretty massively. So I'm not going to over solve and optimize for the herniated disk because there are bigger, much bigger inputs that will move the needle much more than me not drinking milk. Right? Understanding where different problem sets fit into the conversation is really, really important. And again, this goes directly back to trading. How does it go back to trading? You might ask. That's a great question. I will show you. So one of the most common things that I work on, that Lauren says, milk saying makes some people gassy. I think it makes people gassy that aren't used to drinking milk because I went through a period where I didn't drink milk. And when I started drinking it again, it literally gave me diarrhea for a couple days. So I was like, oh shit, maybe I shouldn't drink milk anymore. But all I did was slow down how much drink, how much milk I was drinking because I went right back to what I typically drink. And it's your body getting accustomed to something that's slightly different again. People will view that as like a negative attribution of milk or something like that. But your body gets very used to the rhythm of what you give it. And when you give it, this",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 50,
      "start_timestamp": "00:42:45",
      "start_timestamp_seconds": 2565.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2565"
    }
  },
  {
    "text": "I typically drink. And it's your body getting accustomed to something that's slightly different again. People will view that as like a negative attribution of milk or something like that. But your body gets very used to the rhythm of what you give it. And when you give it, this is why there's like travelers diarrhea or travelers constipation depending on your body and how it behaves, it you'll get one or the other. And it's because your body is getting a completely different series of things that it's not used to. So a lot of people will experience that to a degree. Even though there's nothing inherently wrong with the food, the water is okay. There's not a bunch of fucking parasites in there that are fucking you up. It's literally just different. So I think for a lot of people, that's for me at least, that was the case with milk. Is I literally, I was like, oh, fuck, is this lactose intolerant thing like actually a thing? Because I always thought, you know, joking aside, my mom, she says she is and stuff. But I like, I don't know, maybe it is, maybe it's not. But all I did was start, I just started drinking a little bit of milk and just scaled back up and then I was completely okay. But going back to this option trading thing and something that I talk a lot about with people specifically in the mentoring program because you have",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 50,
      "start_timestamp": "00:44:04",
      "start_timestamp_seconds": 2644.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2644"
    }
  },
  {
    "text": "I did was start, I just started drinking a little bit of milk and just scaled back up and then I was completely okay. But going back to this option trading thing and something that I talk a lot about with people specifically in the mentoring program because you have to understand the people that join that program are people that are like really, really interested in figuring this thing out. And they are very serious about it, right? I offer that context because the people that are in there, they're not like the casuals. They're not the people that are like, oh, I just want to see if I can make a hundred bucks. These are the people that are like, I want to be able to use this either for my primary income or to supplement my primary income. Like, I literally, like, this is important to me. So I bring that context because it's going to show a difference in, again, I'm giving you the sample in the archetype of the sample because it should influence the way that you receive the information about it. So in that space, I'll have people that trade all sorts of stuff, people that have, I literally have people that have traded for over 30 years. And I have people that have traded for two months, right? Big, big, barrage of people, lots of different approaches doing different things, trying different stuff. The very first thing that I spend working on",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 50,
      "start_timestamp": "00:45:01",
      "start_timestamp_seconds": 2701.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2701"
    }
  },
  {
    "text": "stuff, people that have, I literally have people that have traded for over 30 years. And I have people that have traded for two months, right? Big, big, barrage of people, lots of different approaches doing different things, trying different stuff. The very first thing that I spend working on with the overwhelming majority of them is if we think about the world of trading and you already know the outlier strategy process in the outlier trading process because we've talked about these before. But if we think about the majority of your performance, it's going to come from this bucket here. And then there's a slightly smaller bucket below it that's going to contribute some performance. And then there's another bucket below that that supports the broader performance and so on and so forth. But the very first thing that traders have objectively have to get right, profit mechanisms without an understanding of a profit mechanism. There's nothing else to be done as a trader. There's literally nothing else to be done. There's no amount of risk management that's going to help you. There's no amount of technical analysis that's going to help you. There's no amount of option structure analysis that's going to help you. There's no amount of Greeks that is going to help you. That is the first thing. Unequivocally, that is the first thing for every single trader on planet Earth no matter what. That is the first thing. But the overwhelming majority of traders",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 50,
      "start_timestamp": "00:46:02",
      "start_timestamp_seconds": 2762.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2762"
    }
  },
  {
    "text": "structure analysis that's going to help you. There's no amount of Greeks that is going to help you. That is the first thing. Unequivocally, that is the first thing for every single trader on planet Earth no matter what. That is the first thing. But the overwhelming majority of traders skip right past this process and they start thinking about do I want to do verticals or diagonals? Huh, we're solving the wrong fucking problem. This is not your problem. This is not even a concern yet. First things first, we have to solve the problems that matter in the order that they matter. This is the first problem for every single trader that has ever lived. That is the first fucking problem. Without an understanding of that, there is nothing else to be done. This goes back all the way circling back to the point that we were talking about, which was the fact that it's so easy as a trader to start trying to solve lots of different things and optimize for lots of different things. But you have to stay organized and you have to work through the order of operations that make that's applicable to the world of trading. It's not this haphazard thing. It is this first always no matter what full stop period. And again, that's to the chagrin of a lot of people that join the mentoring program. They hate that. They hate the fact that the first thing I tell the majority",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 50,
      "start_timestamp": "00:47:34",
      "start_timestamp_seconds": 2854.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2854"
    }
  },
  {
    "text": "world of trading. It's not this haphazard thing. It is this first always no matter what full stop period. And again, that's to the chagrin of a lot of people that join the mentoring program. They hate that. They hate the fact that the first thing I tell the majority of them is we're not even to fucking talk about options yet. Because there's no conversation for me to have with you until you can clearly articulate the profit mechanisms that you understand that you can qualify, quantify, you understand the types. Once those two steps are done, sure. I would love, literally love, I love options. I would love to talk about options. But before that point, there's no fucking conversation. It literally doesn't make sense. So it's something else to keep in mind. That's one of the things that you'll find the majority of people on a place like this that they do is they're so worried about all of these trivial details that don't really apply to them yet. It doesn't really matter just yet unless we can have an honest conversation that's logical about profit mechanisms, the type of profit mechanisms, which includes the qualities and then signals that are associated with it. So off point and says all that talk of Derry made me fix myself a 50 50 float half vanilla ice cream and half orange juice stand efforting in case any of you guys are familiar with them. He doesn't orange juice with",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 50,
      "start_timestamp": "00:49:00",
      "start_timestamp_seconds": 2940.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=2940"
    }
  },
  {
    "text": "then signals that are associated with it. So off point and says all that talk of Derry made me fix myself a 50 50 float half vanilla ice cream and half orange juice stand efforting in case any of you guys are familiar with them. He doesn't orange juice with I want to say like Greek yogurt, which is essentially the same thing as that. It's like orange cream sickle. I think his is a little bit more macro dense, but yeah, I've never done that, but I've heard of people doing that before. It wouldn't be my go to personally, but let's look at the next one. Does Delta neutral mean you need to day trade? Delta doesn't delta change with every tick. How do you make it neutral by shorting longing the underlying yet with another option? Huh? I assume it's easier with the spread since they're both moving. Oh, wow. Okay, so this is lots of problems. What do you guys think here? How would you answer this? Because the first thing I see here is this person completely misunderstands Delta hedging. So this is from how much and the first thing is does it mean you need to day trade, meaning trade every single day, sort of. You have to be prepared to trade every day. It doesn't mean that you have to sit in front of a screen and monitor everything, right? Because the way that Delta hedging works is, well, depending on what you're",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 50,
      "start_timestamp": "00:50:14",
      "start_timestamp_seconds": 3014.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3014"
    }
  },
  {
    "text": "need to day trade, meaning trade every single day, sort of. You have to be prepared to trade every day. It doesn't mean that you have to sit in front of a screen and monitor everything, right? Because the way that Delta hedging works is, well, depending on what you're trying to do, I'm actually thinking that they might be thinking gamma hedging, but what they might be doing is flattening out their gammas and then Delta hedging off the residual as it moves around and then maintaining through Delta hedging. And the first thing that you have to understand with that kind of process is that the more you do it, the more expensive it gets. So most of us that will Delta hedge around something, we set up bands, bands to make our dance. I'm just kidding. They set up bands so that we're not unnecessarily Delta hedging every fucking tick. It's just unrealistic and it's also very expensive. So doesn't mean you need to day trade not inherently, but it does mean you need to be prepared to because if your Delta bands get out of whack, you do have to intervene. Otherwise your underlying approach is going to completely decouple. And it's unforgiving because as your Delta is interact with gamma gain more Delta, it goes faster and faster. So that's why you have to absolutely, you have to maintain a band. Now there are other component about Delta hedging with other options. Most won't do",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 50,
      "start_timestamp": "00:51:33",
      "start_timestamp_seconds": 3093.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3093"
    }
  },
  {
    "text": "going to completely decouple. And it's unforgiving because as your Delta is interact with gamma gain more Delta, it goes faster and faster. So that's why you have to absolutely, you have to maintain a band. Now there are other component about Delta hedging with other options. Most won't do that. You can. There's no rules against it. But by Delta hedging with another derivative, which is going to move because it's going to have gamma, most was use the underlying to Delta hedge because it's a Delta one security, it's a Delta one product. So if I'm trying to scrub off Delta's, I'm not going to use more often than not unless I need it for another reason, an additional option. I'm just going to use the underlying buy or short it so that I scrub off the Delta's with the Delta one product. And then I just modulate the Delta bands based on the thesis. So I like this question, but they need to learn a lot more about Delta hedging in my opinion in order for this to even be viable. For the vast majority of retail traders sitting there trying to Delta hedges not the way to go. This is one of the most common misconceptions that I ever come across in trading where retail traders believe that the best way for them to create success for themselves is to emulate institutional trading. It is completely wrong. It is completely wrong. What is the same thing",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 50,
      "start_timestamp": "00:52:48",
      "start_timestamp_seconds": 3168.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3168"
    }
  },
  {
    "text": "to go. This is one of the most common misconceptions that I ever come across in trading where retail traders believe that the best way for them to create success for themselves is to emulate institutional trading. It is completely wrong. It is completely wrong. What is the same thing as saying I am going to emulate the Kenbe Mutumbos basketball style to be a successful basketball player. That's my game plan. Do you understand the parallel I'm drawing here? It's completely, completely wrong. The reason why it's completely wrong is the Kenbe Mutumbos is a certain height. His certain attributes that I do not have. Now your boy does have hops. I can jump, but I'm still not that tall. Not as tall as him. So there's no way that I could emulate his style without some sort of adaptation for myself and be successful. So, the real trading and institutional trading are completely different fucking things. And it is a gross misconception for retail traders to think the way that they're going to make money at this is to emulate what institutions are doing. They're playing an entirely different game than you. So most people that come across this idea of being Delta neutral is coming from stuff that is trickled out from institutions that doesn't actually fully apply to us here, unfortunately. And you have to be aware of that. Because again, if you're going to be a successful trader and you spend a bunch of your",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 50,
      "start_timestamp": "00:53:56",
      "start_timestamp_seconds": 3236.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3236"
    }
  },
  {
    "text": "this idea of being Delta neutral is coming from stuff that is trickled out from institutions that doesn't actually fully apply to us here, unfortunately. And you have to be aware of that. Because again, if you're going to be a successful trader and you spend a bunch of your time trying to emulate something that actually doesn't make any sense to emulate, it's very difficult to make money like that. Joey says same thing as copying Pelosi. That I disagree with. If all of us should stop everything we're doing and just do what Pelosi does because she apparently has got it down right and she has hundreds of millions of dollars from being just a great trader. And I regret my life choices because that's what I should have been doing this whole time. I've been sitting here worrying about building different kinds of models and spending thousands of hours looking at different charts and coming up with different strategies. And meanwhile, all I had to do is copy Nancy Pelosi, a giant mistake. It's, you know, we learn from our mistakes though. So I hope I'll be a better man for this maybe. Hard to say. Lance says, Lance says it helps being able to inside trade. Oh, yeah. I mean, that's the trick of the trade here, right? It's just just deal in a place that gets more access to information and influence policy than regular people and then make trades based off those things, right?",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 50,
      "start_timestamp": "00:55:36",
      "start_timestamp_seconds": 3336.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3336"
    }
  },
  {
    "text": "says, Lance says it helps being able to inside trade. Oh, yeah. I mean, that's the trick of the trade here, right? It's just just deal in a place that gets more access to information and influence policy than regular people and then make trades based off those things, right? It's simple, super simple. And sometimes I ask myself like, well, why am I not doing that? Right? Because it's simple, super easy. Just no shit that other people can't know and influence policies that other people can't do and make trade decisions off of that. And I'm sitting here thinking like, why the fuck did I think of that? That it just makes, it's clearly makes a lot of dollars. So it makes sense. And yeah, sometimes I just, I make things so much more difficult for me than I need to. It's a giant, giant problem, big gap in the way that I analyze stuff. Lily Warms says, be able to write financial policy and buy before the policy happens. Yeah, exactly it. Lily Warms says I'll vote for you. That's the last thing anybody needs is me in any sort of political office. I am the last person that would be even remotely qualified. So you guys should not vote for me. That would be, that would be my entire platform is don't fucking vote for me because it's a terrible choice. All right, let's see what else we come up with here in the last few",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 50,
      "start_timestamp": "00:56:47",
      "start_timestamp_seconds": 3407.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3407"
    }
  },
  {
    "text": "person that would be even remotely qualified. So you guys should not vote for me. That would be, that would be my entire platform is don't fucking vote for me because it's a terrible choice. All right, let's see what else we come up with here in the last few minutes. I'm going to wrap up in a couple minutes here. So if there's anything else that you guys want to hit on before I wrap up, let me know. Um, let's see. No, no, no, no. No. There's a long strangle on DJT foolproof that we know is not true. There's just so much in here that's just not it's terrible. I did a video on this guy. I think the. There's more red flags that go off with this dude. And I can like literally point at. Oh, here we go. Lost 100,000 to buying options no longer should lose money. I will now only sell options instead since literally all my plays result in losses. I will now sell options where I think the options will end up in the money. So that's obviously a person. I like that they're playing around. They're having fun. Let's see. Which strategy makes options interesting to you? There you go. Right. This is the exact thing I was just talking about. We think that a strategy is going to make us money. It's that the cart is so far in front of the horse here. You can't even see it.",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 50,
      "start_timestamp": "00:57:59",
      "start_timestamp_seconds": 3479.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3479"
    }
  },
  {
    "text": "Which strategy makes options interesting to you? There you go. Right. This is the exact thing I was just talking about. We think that a strategy is going to make us money. It's that the cart is so far in front of the horse here. You can't even see it. The first thing is finding stuff that makes money. So if they're talking about buying calls or trading the wheel, both of those are fine. You can do either of those. If you pick stuff that goes down. When you get in, it doesn't matter which of those you do, you're going to lose money. So this is one of the most common mistakes I see just working with newer traders. We think that there's going to be some sort of edge inherently in an option structure. Which again, these aren't even strategies. They're just talking about option structures. So interesting stuff. The last thing, oh yeah, the last thing I want to talk about is I'm going to have an updated live stream schedule next week. I'm actually pairing down a little bit on the live stream. So my game plan is it'll probably be Monday, Wednesday, Friday. And then I'll still plan to do the Sunday stuff. The Tuesdays and Thursdays, those will be ad hoc. Like if there's something going on, I'll absolutely hop on. But if there's not, then I probably won't. But I so there will be stuff coming about that this weekend just so",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 50,
      "start_timestamp": "00:59:44",
      "start_timestamp_seconds": 3584.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3584"
    }
  },
  {
    "text": "then I'll still plan to do the Sunday stuff. The Tuesdays and Thursdays, those will be ad hoc. Like if there's something going on, I'll absolutely hop on. But if there's not, then I probably won't. But I so there will be stuff coming about that this weekend just so that everybody's ahead of the changes there. So that's the near term game plan. And then for Sunday for those in the outlier pro community through Patreon, I asked you guys already to please make sure that you have your end of month AIRs complete so that we can spend a little time talking about it. So I'll be going through my performance, what things went well, what didn't go well. This was a incredibly good month for me, very, very lucrative. So I'll talk about kind of some of this stuff that set that up. And then we'll spend time, you know, going through everybody else's stuff to make sure that we have a solid game plan into the end of the year, two months left. So the market right now, I think is up just over 20. So if you're not there, you have to take a really, I'm not saying start scrambling to try to get there. We have to take a hard look at what you're doing and to make sure that you're truly committed to making this happen because when you miss out on market years like this, because now the market can go flat",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 50,
      "start_timestamp": "01:01:11",
      "start_timestamp_seconds": 3671.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3671"
    }
  },
  {
    "text": "I'm not saying start scrambling to try to get there. We have to take a hard look at what you're doing and to make sure that you're truly committed to making this happen because when you miss out on market years like this, because now the market can go flat for two, three years and still have an okay average return because of this year. So have to be thoughtful about what we're doing. And this is why for a lot of people, I think if I were starting again, I would buy and hold dollar cost average into an index ETF while I learn so that I don't run that risk personally. That's what I would be doing. So all right, gang, if you need anything, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "YB72tCTnYbE",
      "title": "YB72tCTnYbE",
      "url": "https://www.youtube.com/watch?v=YB72tCTnYbE",
      "upload_date": "",
      "duration": "",
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 50,
      "start_timestamp": "01:02:19",
      "start_timestamp_seconds": 3739.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YB72tCTnYbE&t=3739"
    }
  }
]