[
  {
    "text": "hey everyone eric here uh up with the next segment of small stacks and what i wanted to walk through is how i'm building my watch list and then what positions i'm looking at for my initial outlay now what i want to say up front is if there's anything that you all would add to the watch list feel free let me know i'm happy to put anything in here it has been a while admittedly where i've been constrained by price so it is a good skill set to refresh there are definitely a lot of trade-offs that need to be made but i still am pretty comfortable with some of the products that i dug up so let's get right to it so first off for the watch list development these are a few things that i'm you know keeping an eye on i definitely would prefer items within the s p 500 prefer weeklies notice the word prefer is i stopped writing it but it's essentially for all of these whereas when i trade my normal account and price doesn't really matter that much you know these become hard and fast i won't trade something that if i'm trading let's say the coverage strangle i won't trade something that doesn't have a at least a two percent yield whereas there's a lot of sacrifice that needs to be made in smaller accounts and it's just how it goes so that's why you see the word prefer",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 0,
      "total_chunks": 6,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=0"
    }
  },
  {
    "text": "if i'm trading let's say the coverage strangle i won't trade something that doesn't have a at least a two percent yield whereas there's a lot of sacrifice that needs to be made in smaller accounts and it's just how it goes so that's why you see the word prefer so much same thing with weeklies if it doesn't have weeklies in my normal account i don't touch it whereas there's one of my trades i'm looking at doesn't have weeklies it's just a function of having to make trade-offs in smaller accounts so these are a couple things that i'm looking at and then i also have my general fundamental technical analysis i already have videos on those so i didn't go through listing them all out but just wanted to share a few of the first items that i'm looking at and then you know we'll go from there so the next thing i want to highlight is part of my approach for the smaller account is going to be a hybrid of the sector rotation strategy meaning i want to take a look at the three-month and 30-day performance of the sectors and kind of pick things better in the top four or five again in general this isn't to say that i won't pick something that's um further down provided that it's been performing well over the previous you know three months 30 days so i'm kind of cross referencing them and like i said performing",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 1,
      "total_chunks": 6,
      "start_timestamp": "00:01:09",
      "start_timestamp_seconds": 69.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=69"
    }
  },
  {
    "text": "better in the top four or five again in general this isn't to say that i won't pick something that's um further down provided that it's been performing well over the previous you know three months 30 days so i'm kind of cross referencing them and like i said performing a bit of a hybrid here so here's the watch list as it sits this is the first pass like i said i'm not kind of building this out super far just yet i'm generally focusing on things that are 60 and less while the account is starting just at five i kept it at 50 or less my goal is to be able to maintain at least two positions i do not want to have all of the account in one ticker so that leads me to the lower end of this spectrum and these ones are kind of some i don't know i my initial thought was calling these out because i probably will try to focus on them but as i was going through a little bit of my fundamental analysis it didn't turn out to be so much the case so you could essentially ignore the handful of bullets i have there okay and let's talk about the initial outlay these are the two trades i'm looking at i'm looking at mosaic selling 1 25 september 17 put collecting 53 cents and then in dxc i'm looking at selling 1 18 september 18 put collecting 55",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 2,
      "total_chunks": 6,
      "start_timestamp": "00:02:14",
      "start_timestamp_seconds": 134.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=134"
    }
  },
  {
    "text": "handful of bullets i have there okay and let's talk about the initial outlay these are the two trades i'm looking at i'm looking at mosaic selling 1 25 september 17 put collecting 53 cents and then in dxc i'm looking at selling 1 18 september 18 put collecting 55 cents so this is again preliminary i did not dig in too far just yet to make sure that everything checks out however on my initial pass both of these look to be okay now of note i really don't like trading mosaic up here so there's a good chance i will wait to establish this trade as compared to putting it on at the same time as dxc and the reason why i picked these two is i guess a couple pieces the first one is i definitely want some it exposure which is what dxc satisfies for me and then mosaic i like because if we pull up their fundamentals from a just one materials perspective i don't feel super passionate about that per se but when i look at something that's been fairly stable after the drop i definitely think mosaic is there so that's how this one ended up on the list so what i'm going to do is probably establish dxc tomorrow and then i'm going to wait on mosaic and i'm going to wait and see how they react to you know recent price levels and then go from there there's a solid chance",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 3,
      "total_chunks": 6,
      "start_timestamp": "00:03:28",
      "start_timestamp_seconds": 208.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=208"
    }
  },
  {
    "text": "one ended up on the list so what i'm going to do is probably establish dxc tomorrow and then i'm going to wait on mosaic and i'm going to wait and see how they react to you know recent price levels and then go from there there's a solid chance that i will deviate and go somewhere else but again we'll see what the market shows me right now if we look at both of these trades they come out to be a 31 return on invested capital which is a great return and on the entire portfolio it would be a 2.6 return on capital using realistically a pretty small subset if we add these up it comes out to 70 percent or so and the reason why i call it a quote unquote small subset is to have two positions on in a 5k account while cash securing is tough so that's what i meant by that but we're still like said 70 invested which it's a good return for for that level of investment so we'll take a look at what tomorrow shows us and then i will share an update once we get the trades on all right talk to y'all later",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 4,
      "total_chunks": 6,
      "start_timestamp": "00:04:57",
      "start_timestamp_seconds": 297.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=297"
    }
  },
  {
    "text": "all right talk to y'all later",
    "metadata": {
      "video_id": "YGjNrwlRQTA",
      "title": "Watchlist Development & Opening Positions - Small Stacks Pt2",
      "url": "https://www.youtube.com/watch?v=YGjNrwlRQTA",
      "upload_date": "20200826",
      "duration": "",
      "channel_name": "Outlier Trading",
      "description": "I walk through my watchlist development and opening trades. Finding products for a $5K account can be challenging. I may look at a LEAP Call Diagonal as well. \n\nStay in touch with Erik:\nTwitter: https://www.twitter.com/esInvests\nInstagram: https://www.instagram.com/esinvests/\nWebpage:  https://esInvests.com \nFB Group: https://www.facebook.com/groups/esinvests\nDiscussion/Question Submission: https://forms.gle/W6Q1mvPcy2Ega5xg7",
      "content_summary": "Content about Watchlist Development & Opening Positions - Small Stacks Pt2",
      "chunk_index": 5,
      "total_chunks": 6,
      "start_timestamp": "00:06:09",
      "start_timestamp_seconds": 369.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YGjNrwlRQTA&t=369"
    }
  }
]