[
  {
    "text": "you you you you you you you you you you you you you you you you you you Reese, we got Narwhal, Rapture's Lornt or Shlup, we got the game here. So it's great to see everybody. And yeah, thanks for dealing with, again, the mobile setup. I know it's not as effective. Probably doesn't sound great. Not that it ever sounds very good. I'm not an audio engineer at all. So, you know, it's probably just part for the course for you guys. SP Norwhal says, Eric, is there a way to check the options change from 2021? I'm curious what the strikes and potentially open interest was during the January explorations. Yeah, I've already looked through literally all of it. I have not on this computer, but I have all of that data downloaded. The options chain doesn't look too anomalous. There was a lot of heavy strikes for sure. And the volume came on pretty fast, but the, it was very focal strikes that were busy. What I was even more interested in Narwhal was what did the options chains look like like three months before January? And the reason why I was so interested in that is I wanted to know when did somebody, whether it's not, and it's not just Warren Kitty, by the way, somebody meaning whoever else played this move, because it wasn't just him. I was one of the people that played the move. And the reason is because you could see",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 51,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=0"
    }
  },
  {
    "text": "is I wanted to know when did somebody, whether it's not, and it's not just Warren Kitty, by the way, somebody meaning whoever else played this move, because it wasn't just him. I was one of the people that played the move. And the reason is because you could see it happening before it happened. Now, what I'm curious though is who positioned well enough ahead of time to be able to get on like size before the rest of the market caught on because I was not the kind of person that would have been writing the beginning. So if we take a look at like a timeframe and we look all the way across the most of the people like, let's say number three here was January, most of the people started seeing what was going on like a month out. You can start seeing elements of stuff that looks weird. But I'm curious for the broader timeframe before that how effectively did people start catching on and seeing things. So Ricardo says, Newd might have that information. He doesn't. He doesn't have options data. At least the last that he and I spoke, which is like he actually text me this morning. So yeah, it's he doesn't have the actual options changed. Like I said, I actually have downloaded all of them directly from CFO. So from an options trading world for those that don't know, that's literally what I do. So part of the way that",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 51,
      "start_timestamp": "00:06:25",
      "start_timestamp_seconds": 385.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=385"
    }
  },
  {
    "text": "actually text me this morning. So yeah, it's he doesn't have the actual options changed. Like I said, I actually have downloaded all of them directly from CFO. So from an options trading world for those that don't know, that's literally what I do. So part of the way that I build strategies is I maintain a pretty significant data set that goes pretty far back in time. And it's full options chains. And the reason why I use full options chains is because it helps me further analyze strategies and whatnot. But to get that data is really expensive and it's not easy. So well, it's easy. Just not easy to manage because it's really, really heavy. It's a lot of the file sizes are massive because there's so much data that goes into it. So yeah, I literally have the entire chains built out. And not just for 20. I have the chains from continue. Well, it's not just segmented timeframes to look through. But like the same thing you see in the stock, the options chains, they can be very, very telling when you start to see volume ramping up changes in open interest ramping up. There's a lot you can learn from the options chains. So that's one of the things that we'll go through towards the end of this because right now as I view this, I'm still consuming all of the existing research. And I typically try to consume as much existing research on",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 51,
      "start_timestamp": "00:07:40",
      "start_timestamp_seconds": 460.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=460"
    }
  },
  {
    "text": "a lot you can learn from the options chains. So that's one of the things that we'll go through towards the end of this because right now as I view this, I'm still consuming all of the existing research. And I typically try to consume as much existing research on stuff like this before presenting my own research so that I'm not reinventing the wheel. I believe in groupthink and collective intelligence heavily. So what I'm doing is I'm working on my data set and a bunch of different studies to see what I can find that I typically would for any sort of ticker that I might be trading or any sort of individual strategy. And in the meantime, I'm doing this with you all. To learn more about the existing theories and strategies that we have, which this is the one that we left off on. Last time, let me get this out of the way. Here. A Ricardo says Eric, can you check Givo? It's written a lot, I think, since you're so good at investigating, got in with DJT because you covered it. Maybe later, this stream is typically a little more focused on GameStop and like the background of GameStop. If you hit me with that on any of the other like standard live streams, always happy to. But we might have some time at the end to take a peek through that. So I'm happy to take a look at it with you. Bruce",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 51,
      "start_timestamp": "00:09:01",
      "start_timestamp_seconds": 541.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=541"
    }
  },
  {
    "text": "like the background of GameStop. If you hit me with that on any of the other like standard live streams, always happy to. But we might have some time at the end to take a peek through that. So I'm happy to take a look at it with you. Bruce says, one of our key beliefs in the Moas theory, hidden short interest. If I recall correctly, he was in the trade from valuation POV, not necessarily from short interest POV. I agree with you. So I haven't seen anything from the cat that would lead me to believe that he's attempting to play this for quote unquote Moas. That's not to say that he's not. I have no idea what his underlying intentions are. But from the way that I've seen him trade it so far, it definitely doesn't lead me to believe that that's the underlying theory that he's that he's trying to play. What I've seen from his trades, and if you'll recall, we went through all of them. So let me grab our workbook really quick. Where is it at? And then I'll show you. So here's the workbook. And then if we go through this, this is when we went through back from the origin through all of his trades. And one of the things that I definitely could pick up as I was looking at this is his approach is actually really simple. It's really, really simple. It starts from a valuation perspective. And",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 51,
      "start_timestamp": "00:10:19",
      "start_timestamp_seconds": 619.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=619"
    }
  },
  {
    "text": "this is when we went through back from the origin through all of his trades. And one of the things that I definitely could pick up as I was looking at this is his approach is actually really simple. It's really, really simple. It starts from a valuation perspective. And then he employs significant leverage. And he maintains exceedingly strong conviction. And let's the trades go because there's not a tremendous amount of timing that's tied to this. And I still don't see any significant evidence of some sort of perceptive timing theory that he's somehow figured out or broken down. I just don't see it yet. And I want to be clear when I say that, that doesn't mean that it's not there. I just don't know because I can't see it. And there's always going to be two distinct parts of the way that I analyze stuff like this. There's going to be the stuff that I can see and can prove. And then there's going to be the stuff that I might have a hunch about or an idea. And there are different things. I can't prove anything related to any sort of underlying timing theory that he's employing based on the entire series of trades we've seen him run. There's nothing in here that would lead me to believe that there's a massive timing element. A lot of it has to do with holding options actually what I would consider to be in a lot of",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 51,
      "start_timestamp": "00:11:29",
      "start_timestamp_seconds": 689.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=689"
    }
  },
  {
    "text": "he's employing based on the entire series of trades we've seen him run. There's nothing in here that would lead me to believe that there's a massive timing element. A lot of it has to do with holding options actually what I would consider to be in a lot of really suboptimal ways from a standard trading perspective. So that tells me the options are primarily being used from a unit building perspective and definitely for leverage. So a lot of this stuff isn't trying to optimize for Theta Decay as an optimizing for volatility. It's to gain leverage. And again, I can see that clearly from looking through his trades. It's one of the main things that I wanted to go through as far as I could is to get a sense of what was the overall approach because I'm not going to lie. When I first started looking at this stuff, one, I had no idea that he even traded options. I keep repeating that because it's so interesting to me. But like I genuinely had no clue that he traded options just from the overall sentiment that I picked up from the community regarding options. And then the second thing is it's also really clear that the theory that he applied came from a valuation standpoint. And then after watching some of his really streams, you can see that evolve a little bit in terms of like valuation, trying to be a value investor, and then what",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 51,
      "start_timestamp": "00:12:46",
      "start_timestamp_seconds": 766.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=766"
    }
  },
  {
    "text": "the second thing is it's also really clear that the theory that he applied came from a valuation standpoint. And then after watching some of his really streams, you can see that evolve a little bit in terms of like valuation, trying to be a value investor, and then what that actually meant to him and how he used derivatives to amplify it. So his approach as far as I can see is really simple. In general, in structure, it's very difficult to execute. It's very difficult for any normal rational human being to see a portfolio go from 586 million down to 235 four days later. Like that's crazy. Like that's crazy to go through that kind of cycle. But the other reality is is that even when you're in any of these numbers, once you're in this threshold of numbers, 11 million plus, you're sure you might not necessarily be buying a mega yacht with 11 million, but you are set for the rest of your life in a very cushy way. So part of the thing that I can probably surmise from this is that he made enough that he was able to just kind of keep playing the game because he also doesn't seem like a hyper materialistic guy. I don't know because it doesn't have a massive social media presence, but that in and of itself tells you quite a lot. So he probably has more money than he could ever need. His kid could",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 51,
      "start_timestamp": "00:14:03",
      "start_timestamp_seconds": 843.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=843"
    }
  },
  {
    "text": "playing the game because he also doesn't seem like a hyper materialistic guy. I don't know because it doesn't have a massive social media presence, but that in and of itself tells you quite a lot. So he probably has more money than he could ever need. His kid could ever need a kid or kids. I don't know his family situation. I purposely don't look that far into it because it's none of my business. I don't know. I'm not trying to dig into his personal life. I respect his personal life. But this stuff, like the trading stuff, obviously I'm fascinated by it. And that's one of the biggest things that I came across is at first I was expecting to see this really calculated precise approach. And after looking through the data, it's not that. This is somebody that is exceedingly comfortable with the risk he was taking on. And this is a proverbial lottery win. Like that's that is the reality of there's a tremendous amount of luck that happened to coalesce with the timing of his stuff. He almost went in solvent in here. Like he literally almost went away with his yellow account. And who knows if he would have came back with another one. So there's a and this is the way that opportunities emerge is he was exceedingly skilled in his analysis, which led him to come up with supreme conviction. Then from supreme conviction, he's able to put out a certain",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 51,
      "start_timestamp": "00:15:17",
      "start_timestamp_seconds": 917.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=917"
    }
  },
  {
    "text": "who knows if he would have came back with another one. So there's a and this is the way that opportunities emerge is he was exceedingly skilled in his analysis, which led him to come up with supreme conviction. Then from supreme conviction, he's able to put out a certain amount of really small starting amount of capital, 100,000. And he's able to say, let's see what this does. And you could tell by the entire premise of the original posts he did, yo low posts, that when it is a professional in the industry, when you decide that you're going to be super speculative with 100,000, you write that off and your mind has gone. Like you put the 100,000 in the account, you pretend it's gone. That's not the money he needed. This is just side money that he wanted to see what he can do to play out this thesis. He picked an he picked an amount of money that made sense to literally play a yellow. And we can see that it's evidenced by the fact that he absolutely had other accounts because we can see in the live streams when he was walking through his tracker with his different positions in his yellow account. It's just game stop. But then we can absolutely see that there's other positions that were in his tracker that weren't in the yellow account. So then it tells us there's another account, it's different positions in it. All this is",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 51,
      "start_timestamp": "00:16:27",
      "start_timestamp_seconds": 987.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=987"
    }
  },
  {
    "text": "tracker with his different positions in his yellow account. It's just game stop. But then we can absolutely see that there's other positions that were in his tracker that weren't in the yellow account. So then it tells us there's another account, it's different positions in it. All this is to go all the way back to the risk tolerance. This is so different than what a lot of people in my opinion are doing that are trying to mirror what he does is most of the people that I come across in the ape community, they're all in on game stop, all in on just game stop. And that's fine. You guys know that I am the first person to advocate for each person to do literally whatever they want. And I am full, I encourage her of that. But I can also tell you that it's not what he did. And it's definitely not what I do. I have a position just because I and I've told you guys this a million times, it's to play with you all to be a part of the the movement in so far as just supporting you guys. Because I think what the apes are doing here is really important for markets and for traders in general. I really think that the education that happens in this sphere is incredible. And the amount of bullshit that's being brought to light from game stop as a vector is huge. So I feel",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 51,
      "start_timestamp": "00:17:35",
      "start_timestamp_seconds": 1055.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1055"
    }
  },
  {
    "text": "what the apes are doing here is really important for markets and for traders in general. I really think that the education that happens in this sphere is incredible. And the amount of bullshit that's being brought to light from game stop as a vector is huge. So I feel like a lot of it's like support. Like I want to support that. But going back to this, this is clear that this dude, he had other accounts, he had other money, he had what he needed elsewhere so that he could play his idea out here. And that's what starts to let you go through these kinds of ebbs and flows. Because if you don't need this money, you didn't need it at a hundred thousand. And you don't need it at 1.5 million. Now he did take money out during these periods, which we can see, which is also super smart. That's him pulling some of the capital out as he's going along to plus up what he needs. Because then you get to a point where you can literally yolo millions of dollars because you just don't care anymore. Like he has what he needs. Mike, I'm guessing I would have my 10 foil hat on right now if I had it. Didn't pack it, doesn't pack well. And he has what he needs as far as I can tell. So then he's able to play this idea out because you can also tell you truly passionate",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 51,
      "start_timestamp": "00:18:45",
      "start_timestamp_seconds": 1125.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1125"
    }
  },
  {
    "text": "guessing I would have my 10 foil hat on right now if I had it. Didn't pack it, doesn't pack well. And he has what he needs as far as I can tell. So then he's able to play this idea out because you can also tell you truly passionate about all of this. There's no reason for him to have come back. There's no reason for him to continue to post. There's no reason for him to show up with 120,000 calls with 200 million dollars. Like there's no reason for any of that. And it's the same reason why I'm sitting here traveling and I'm doing a live stream with you guys. Like I can see passion and I have passion not just for game stop but for trading. I am passionate about markets and I'm passionate about our community. So you can tell and I can see that he is also supremely passionate about all this stuff. So it's really, really interesting to see the way that his account is moved. The other thing that we can definitely tell is that there is a slight change in approach as we as we go through the individual positions, the holding periods, and the way that he actually executed the individual trades, which absolutely evolved to a degree, which is really interesting. Let me get caught up on the chat really quick. Starbeef says agree. Arche said many, many times that Moas was not part of his thesis. He",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 51,
      "start_timestamp": "00:19:51",
      "start_timestamp_seconds": 1191.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1191"
    }
  },
  {
    "text": "the holding periods, and the way that he actually executed the individual trades, which absolutely evolved to a degree, which is really interesting. Let me get caught up on the chat really quick. Starbeef says agree. Arche said many, many times that Moas was not part of his thesis. He said it would be cool but he admitted he doesn't purport it to understand the short interest data. I believe it was in December 16th. I didn't I don't recall that personally so I would take you out your word there. Strategy says he seems to wear the various settlement rules. Newton mentioned recently regarding ETF kicks with tweets mentioning or matching certain dates. I still don't see evidence of that. I would not say that that's not possible. It's entirely possible. And here's the other fun fact. This is something that is beyond an underlying suspicion but I genuinely think is the case. I think you guys are teaching him. That's what I think because he's smart but he is not smarter than everybody combined. And I also am like pretty average but I've been doing this a long time and I've learned a lot from you guys. So there is a near 100 probability that he's watching different content that's being put out about him looking at Superstong and I guarantee you that you guys are teaching him as well. So when it comes to the settlement cycles and stuff I can tell you from this. He was",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 51,
      "start_timestamp": "00:20:50",
      "start_timestamp_seconds": 1250.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1250"
    }
  },
  {
    "text": "there is a near 100 probability that he's watching different content that's being put out about him looking at Superstong and I guarantee you that you guys are teaching him as well. So when it comes to the settlement cycles and stuff I can tell you from this. He was not trading settlement cycles. That's not what this is. But what I also can tell you is that if he wasn't aware of settlement cycles previously he is now because I am now because you are now because as a community you all looked into it. You all started pulling the thread and identifying all of these little pieces that ultimately fit together. So I believe without a doubt that he is absolutely aware of this point. Again he was not trading it here and I can see it right even this. If he's trading settlement cycles that's that's not what this is. You don't go from 210 to 289 to 586 down to 235 to 268 and then bounce. Like that's not the path. Because again if you're playing settlement cycles and if the theory is that he can essentially move the market on his own which to a degree he can but there wouldn't be this kind of portfolio volatility just wouldn't be there because there would be no reason for it to be there. He would have he would have compounded so much faster than this. Which is an insane thing to say because he went from",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 51,
      "start_timestamp": "00:22:08",
      "start_timestamp_seconds": 1328.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1328"
    }
  },
  {
    "text": "degree he can but there wouldn't be this kind of portfolio volatility just wouldn't be there because there would be no reason for it to be there. He would have he would have compounded so much faster than this. Which is an insane thing to say because he went from 100,000 to like 600 million but it is absolutely the case. He would have compounded so much faster if he was playing cycles that he could reliably detect and trade. And again it's it's clear as day because if he's playing cycles you don't go from 47 million here down to 17 here. If you're playing a cycle why would you do that? It doesn't make any sense. The other thing if he's playing these short term cycles of 30 days and stuff like that he's trading options that are much longer in terms of expiration. So that also tells me that the propensity to be trading settlement cycles which we're talking or about 35 days so that's a different period than the things that he's trading and the way that the portfolio moves. So I want to couch all of that with the fact that I don't know. I really don't know but I can look at the path of what he's done and come up with the the best objective analysis as I possibly can. And if I were the one that we're playing cycles there's no reason to set things up this way. And it's the same",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 51,
      "start_timestamp": "00:23:28",
      "start_timestamp_seconds": 1408.52,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1408"
    }
  },
  {
    "text": "really don't know but I can look at the path of what he's done and come up with the the best objective analysis as I possibly can. And if I were the one that we're playing cycles there's no reason to set things up this way. And it's the same thing with accumulating long shares. I believe that he's accumulating long shares because he loves the company and because he wants to be a part of it he wants to support you guys. He wants to lead you guys. And again from a military perspective you can tell a leader even though he leads in a strange way for what I would consider to be a leader but he's it's almost like the backman. He's kind of like the leader that you guys need. And he's that like that's why he's doing all that stuff. And because if you're playing cycles doing it with shares is also suboptimal because he's not as far as we can tell looking back through Newton sheet he's not unwinding shares. I have he reorganized this thing. I already gave Newton a piece of my mind for that obviously joking but I told him that this sheet was hard enough to organize or to navigate in the beginning. Now I just I can't find anything because I don't know where anything is. Is it here? No this is all GME specific stuff. He used to have maybe it's off to the side. He does that",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 51,
      "start_timestamp": "00:24:43",
      "start_timestamp_seconds": 1483.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1483"
    }
  },
  {
    "text": "this sheet was hard enough to organize or to navigate in the beginning. Now I just I can't find anything because I don't know where anything is. Is it here? No this is all GME specific stuff. He used to have maybe it's off to the side. He does that too. He took stuff off to the side. So it's real squirrely and hidden. What I'm trying to find is he has a thing in here somewhere that shows the share positions that he has and he just keeps accumulating. So most of the share positions that we've seen he's not unwound and he's continued to this looks like for the company. This looks like more GD settlement stuff. This is all settlement cycle. I don't know what this is. This is some max pain tracking. I really thought I was in here but clearly I'm wrong. How crazy is this sheet? The fact that Newton put this together for you guys is incredible. This is a ton of work to do and maintain. He's just he's so awesome. He's such a great dude. This is so cool. Anyways it's in here somewhere. I just don't know where. I know it's in here somewhere because you wouldn't have gotten rid of that. But yeah it's in there somewhere. Anyways there's a thing in here somewhere that walks through all of Vorinkitties positions in a stock position and he's accumulating. If you're playing settlement cycles accumulating shares doesn't allow you to",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 51,
      "start_timestamp": "00:25:50",
      "start_timestamp_seconds": 1550.36,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1550"
    }
  },
  {
    "text": "it's in here somewhere because you wouldn't have gotten rid of that. But yeah it's in there somewhere. Anyways there's a thing in here somewhere that walks through all of Vorinkitties positions in a stock position and he's accumulating. If you're playing settlement cycles accumulating shares doesn't allow you to participate because you have to unwind the shares to realize the game. So he's accumulating shares building more and more shares. That to me leads more strongly back to his premises is a value guy and liking the stock and liking the company and liking the company. So I think that the idea that he's cracked this underlying code that literally the entire community hasn't been able to sift out yet. I just find that to be exceedingly unlikely. Again it's possible. It's entirely possible. But when I'm analyzing stuff there's two ways that I analyze things. There's what's possible and then there's what's probable. And what's more probable is the simpler explanation that we went through earlier with respect to his approach. And my guess is you guys are teaching him now which I think is really cool. Stragis says literally the doing thump or matches the theory about various cycles overlapping. See the problem with that is the memes and we talked about this before the memes that he post match whatever your pattern seeking mind wants it to match. That's the trick with stuff like this. He could be talking about antagonizing market makers and drawing them",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 51,
      "start_timestamp": "00:27:29",
      "start_timestamp_seconds": 1649.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1649"
    }
  },
  {
    "text": "various cycles overlapping. See the problem with that is the memes and we talked about this before the memes that he post match whatever your pattern seeking mind wants it to match. That's the trick with stuff like this. He could be talking about antagonizing market makers and drawing them on and riding them. He could be talking about a bunch of different things. And that's the purpose of ambiguous communication is it allows you to figure out what you think it may or may not mean. But one of the things I've mentioned about him before that I genuinely believe to be the case again as far as I can tell for my analysis of him is I think when he wants you to know what he's talking about he makes it clear and then I think when he just wants to play games and just have some fun and put something more obscure out there I think he does that too. Because as I've mentioned before communication is really fascinating it's one of the things we learn a lot in the military. And if you communicate so obscurely that nobody can understand it it's not really communication. It's because nobody actually knows what it means. Like this to me was about as clear as day. So when we see this and then this like this to me is him telling you what he wants you to know and it's slightly hidden message but pretty clear of a message",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 51,
      "start_timestamp": "00:28:55",
      "start_timestamp_seconds": 1735.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1735"
    }
  },
  {
    "text": "because nobody actually knows what it means. Like this to me was about as clear as day. So when we see this and then this like this to me is him telling you what he wants you to know and it's slightly hidden message but pretty clear of a message in my opinion. And then he has other stuff that's just more obscure. Like this looks like a partnership between him and him and him right and that's kind of the point is that this this stuff can be whatever you want it to be. This is hello I love this so much. Strategist says analyzing the tweets is so much fun though. I personally don't actually have that much fun doing it because it's just not part of how my brain works. Like I deal more so in facts with stuff that I like really think has tangible impacts of stuff but what I find to be really fun is watching you guys analyze the tweets and stuff. I find that fascinating because the theories that I've seen people come up with some of them are so far fetched you can't help but love it. And I really I genuinely love that. So for me it's personally less of me trying to analyze his individual tweets I really don't care to do that but I love watching the community analyze his stuff because I think it's incredible. I think I told you this a while ago there was somebody",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 51,
      "start_timestamp": "00:30:21",
      "start_timestamp_seconds": 1821.48,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1821"
    }
  },
  {
    "text": "genuinely love that. So for me it's personally less of me trying to analyze his individual tweets I really don't care to do that but I love watching the community analyze his stuff because I think it's incredible. I think I told you this a while ago there was somebody from the community that sent me a thing when I was doing reviewing I forgot what I was reviewing about the caps and somebody reached out with like a series of color hex codes that were tied to like a Sumerian and if you guys don't know Sumerian is a really old civilization with like Sumerian language that then like piece together some sort of coherent message it was one of the craziest things I've ever seen but it was so cool that somebody actually came up with that I was trained up on a like this is nuts that somebody can go through this and it literally made sense like the the message itself made sense. So yeah the that's the interesting thing about all this because I also saw people do this with the what was it the emoji timeline and that is that's still people are still trying to figure that out there's absolutely no clear anything about what the emoji timeline actually means there's is many versions and opinions of what that means as I can think of which is again that's the interesting thing you can tell much like Cohen funny enough that he also",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 51,
      "start_timestamp": "00:31:44",
      "start_timestamp_seconds": 1904.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1904"
    }
  },
  {
    "text": "trying to figure that out there's absolutely no clear anything about what the emoji timeline actually means there's is many versions and opinions of what that means as I can think of which is again that's the interesting thing you can tell much like Cohen funny enough that he also enjoys just kind of playing around with people and he enjoys posting random things like this tits right and it's just to have some fun it's just to troll a little bit and play some games and I think the cat also likes to do that but I go back to my prior statement I think the cat when he wants you to understand what he's saying he makes it clear for what he wants to he wants you to see and understand which I do think is cool Bruce says any thoughts on his latest tweet personally for Rowan kitty I think his latest tweet was telling you to celebrate Christmas and have a Merry Christmas that's what I thought that's my guess Bruce Wayne says wonder why Cohen didn't take the salary only CEO to do that really it's a passion project Owen and he also has that like another person that doesn't have a salary is Elon but obviously he's rewarded in stock now Cohen buys his stock so it's a different it's definitely different but CEOs typically have different compensation packages depending on the company and depending on like what they're doing but there's not many",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 51,
      "start_timestamp": "00:33:04",
      "start_timestamp_seconds": 1984.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=1984"
    }
  },
  {
    "text": "like another person that doesn't have a salary is Elon but obviously he's rewarded in stock now Cohen buys his stock so it's a different it's definitely different but CEOs typically have different compensation packages depending on the company and depending on like what they're doing but there's not many CEOs out there that don't take a comp and it's 100 because he really cares about the company the community and he's trying to turn this thing around what a story that would be for him to to essentially save this thing so I think that in and of itself would be just an incredible thing for him because he hears the other thing that's worth reminding ourselves Cohen is fucking rich so he like again like he doesn't need the money he doesn't need the money he's rich so yeah he's working on a general passion project it definitely sets a really good message because you have to think of it also from a branding perspective and people like Cohen they're they're playing chess they're playing chess in 4d so he knows that one of the reasons why game stop is still a freaking company is because of the community it's because of you all it's because of the apes and the apes have made sure that the company stayed alive when quite a few periods the company would have been exceedingly challenged stay alive so from him you can almost look at it as really cheap marketing because",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 51,
      "start_timestamp": "00:34:29",
      "start_timestamp_seconds": 2069.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2069"
    }
  },
  {
    "text": "community it's because of you all it's because of the apes and the apes have made sure that the company stayed alive when quite a few periods the company would have been exceedingly challenged stay alive so from him you can almost look at it as really cheap marketing because everybody talks about how he doesn't take a salary so whatever his salary would have been you can essentially mentally bucket that as what he's spending in marketing because everybody talks about it and it's cheap even if you made half million dollars a year the amount of conversation of him not taking a salary provides is so tremendous that that's cheap it's cheap marketing now I'm not saying that that's the sole reason why he's doing it but I also know he knows that right it's again you have to you have to respect the fact that people like him they're not superficial thinkers they're thinking in layers and levels and that is one of the things that Cohen will absolutely be thinking about it's super cheap marketing and it provides a really great connection with the community that literally kept the stock alive he's full well aware of all of that and how important again that the apes are to the stock the ape involvement if you think about it is one of the primary ways that the stock is now sitting on four billion plus in cash because he's able to do at the markets when the",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 51,
      "start_timestamp": "00:35:55",
      "start_timestamp_seconds": 2155.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2155"
    }
  },
  {
    "text": "all of that and how important again that the apes are to the stock the ape involvement if you think about it is one of the primary ways that the stock is now sitting on four billion plus in cash because he's able to do at the markets when the stock was being propped up by both retail activity and institutional activity which is again a massive better in the cap of the company and its ability to persist and survive so yeah I think that there's a lot of layers to what somebody like he is doing but I think that's the primary reason why you won't see him take a salary it's just because it's really smart cheap marketing he doesn't and again like the the top line level items he doesn't he doesn't need the money like he doesn't need the money what's his net worth Ryan Cohen he's worth 4.9 billion dollars so he doesn't need the fucking money so for him that is a really cheap thing to forego and it doesn't impact his day-to-day life all not even a little bit not even a scotch not even a trivial amount not at all when you're worth nearly 5 billion dollars and here's the other fun fact when you look up people's net worth online it low balls it's so hard so he's worth probably quite a bit more than that so I think he's in a position most importantly where he just doesn't need",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 51,
      "start_timestamp": "00:37:18",
      "start_timestamp_seconds": 2238.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2238"
    }
  },
  {
    "text": "you're worth nearly 5 billion dollars and here's the other fun fact when you look up people's net worth online it low balls it's so hard so he's worth probably quite a bit more than that so I think he's in a position most importantly where he just doesn't need the money then it allows him to position the message to be what he wants it to be now I would have to imagine if he if his net worth was 200,000 my guess is he probably would take a salary because he probably would need it in order to continue to make ends meet like most people do so he's fortunate enough to be in a position where he he literally and for those that don't know how much for point nine or just called five billion dollars I mean it's hundreds hundreds of millions of dollars it's more than he could ever spend it's more than the next three generations of him could ever spend and that's even being disgustingly exuberant with spending so the main point I'm making is he doesn't need the money he has more money than he could ever possibly need for generations he could go down 20 generations at least easy and pay for everybody for everything and they would all be fine so yeah it's it's just a co-alesting of two things the main reason that he doesn't take a salary because he doesn't fucking need it that's that is what it",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 51,
      "start_timestamp": "00:38:42",
      "start_timestamp_seconds": 2322.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2322"
    }
  },
  {
    "text": "could go down 20 generations at least easy and pay for everybody for everything and they would all be fine so yeah it's it's just a co-alesting of two things the main reason that he doesn't take a salary because he doesn't fucking need it that's that is what it is and then he can position it to be different things which is smart it's really really smart on his part sweet so let's get into this one which is what we left off last time I'll trash this comment and let me know if this is too small on your guys' screen I can't tell because of the the mobile setup here I'll zoom it in a little bit let me know if that's better and this is GME is briceless oh yeah I forgot I actually have to zoom it out and throw it into GBT first also I downloaded the new version of GBT which has been really really interesting um what is it I don't know what they call it like one I think it's like a sigma sign but the new GBT is really sick I'm sorry I realized I need to just zoom this out for those that don't know the reason why I do this is this is the cheat code to drop this into AI to get a general overview first and then for us to click through it together the reason why I drop it into AI first is just so",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 51,
      "start_timestamp": "00:39:51",
      "start_timestamp_seconds": 2391.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2391"
    }
  },
  {
    "text": "out for those that don't know the reason why I do this is this is the cheat code to drop this into AI to get a general overview first and then for us to click through it together the reason why I drop it into AI first is just so that I don't miss anything and that if anything really draws my attention we can hone in on it so summarize this article and let's see what GBT says and I need to reconfigure a few things all right let's add GBT here where's my other window this is the worst part about only having two screens I know it's cry cry you guys are over right but on my home setup I have more screens than I could possibly need in this case I am stuck with a peasant two screens really really tricky all right let's see I'm just getting caught up on the chats coffee donuts this so happy AMC is inside the GME it was annoying having popcorn supporters and everything see what's wrong with I don't actually understand the the disdain that those two parties have for one another to be honest it seems like there would be a natural overlapping symbiosis personally but again I don't know well enough I'm still very much a guest in the game stop house so you guys will have all of the background on stuff like that then that I won't know but to me it seems like",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 51,
      "start_timestamp": "00:41:07",
      "start_timestamp_seconds": 2467.16,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2467"
    }
  },
  {
    "text": "there would be a natural overlapping symbiosis personally but again I don't know well enough I'm still very much a guest in the game stop house so you guys will have all of the background on stuff like that then that I won't know but to me it seems like they would be naturally symbiotic in terms of the behavior of looking at titty says it would be a great collab if only the CEO and board of AMC were predatory shooters of their own company oh I see okay I can't wait to see predatory AMC board working with RC people think AMC killed the GMEs squeeze and they were wrong to see I I just would encourage people to remember the way that the last squeeze went and to just consider what a future squeeze might look like and the reason why I say that is I'm hopeful that that might lead to people being less at each other's throats and more direct that energy towards the structure of things which probably deserves more of the attention versus one another that's the nature of control is you try to divide and then you try to promote infighting because it absolutely focuses attention away from other things as stuff is going on in the background so from a squeeze perspective I don't see how either one of those would be each other's enemy but again I don't know all the details I might want pretend to know all right",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 51,
      "start_timestamp": "00:42:47",
      "start_timestamp_seconds": 2567.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2567"
    }
  },
  {
    "text": "it absolutely focuses attention away from other things as stuff is going on in the background so from a squeeze perspective I don't see how either one of those would be each other's enemy but again I don't know all the details I might want pretend to know all right let's see what this says the author the author argues that 2020 Federals are intervention which injected trillions of dollars in the market created an artificially high stock market while leaving everyday Americans struggling I don't understand what the injection here do you see this is a class issue rather than a political one large financial choosing to receive massive bailouts and look this wall ordinary citizens got minimal relief I don't know if I want to go into this on this one's a little bit I think this one might be a little too political for me but I'm going to make this up to water yeah I'm not so sure about this one there was your three trillion into the markets to large banks and portuguese cycles exos liquidity an inflated stock price are officially this you see you're going to require hold capital for every share they land yeah I don't know about let me I'll flip through it a little bit I don't want to judge it too hard right from the beginning but this might be a slightly different flavor all right yeah well this is the problem I don't think you could put these",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 51,
      "start_timestamp": "00:44:03",
      "start_timestamp_seconds": 2643.08,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2643"
    }
  },
  {
    "text": "land yeah I don't know about let me I'll flip through it a little bit I don't want to judge it too hard right from the beginning but this might be a slightly different flavor all right yeah well this is the problem I don't think you could put these two together like if you're talking about class war that inherently becomes political because of the the landscape but let me look through this all right people are stuck okay if I don't really care for a lot of this I just want to see like the actual research that's what I care about actually first of all should demand back the seventeen trillion dollar bailout given a bank say I'm gonna I'm gonna pass through this one I don't that one felt a little different than what it was going for I'm always down to listen to different opinions and stuff but I want it to be really focused on like research that's what I care most about is like solid research so now let's see what this one is who goes down to here you can't scroll and move what you're highlighting which is a little frustrating but we get through it by zooming out super far it's really not that bad oh yeah also at the end if you guys want before we wrap up remind me I took a couple really cool pictures today there was like this super snowy section that we were driving around",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 51,
      "start_timestamp": "00:45:41",
      "start_timestamp_seconds": 2741.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2741"
    }
  },
  {
    "text": "we get through it by zooming out super far it's really not that bad oh yeah also at the end if you guys want before we wrap up remind me I took a couple really cool pictures today there was like this super snowy section that we were driving around and then there was that that should be okay and then there was a really neat series of trainings that were like driving through the snow is really pretty let's see all right what is this kega we know this we know these so so leverage I do not disagree with that at all the and this is actually a really important metric to pay attention to um little so there's typically a chart of leverage um normally you would plot margin debt and stuff like that yeah like this so you can see from here margin debt is definitely expanding again it's still not massive but I can't go back far enough in time I don't think because I think I don't have the right because I don't have the I have a peasant account and free account with these guys so but the leverage is big and the leverage is continuing to expand so I think that the leverage does become a bit of a problem okay so re re-appartication yes reverse repose okay because repose cloud so what is this to us to the cycle theories which we know there's different versions of this that I've seen",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 51,
      "start_timestamp": "00:47:39",
      "start_timestamp_seconds": 2859.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2859"
    }
  },
  {
    "text": "leverage is continuing to expand so I think that the leverage does become a bit of a problem okay so re re-appartication yes reverse repose okay because repose cloud so what is this to us to the cycle theories which we know there's different versions of this that I've seen newton is looked pretty hard at 21 and 35 I think newton is settled on 35 and then also with the the holiday component though which is important because that that skewed things it has to be tracked um major spike for game stop could push a big player into default again this goes back to my question that I still don't have an answer to and I've asked it a few times and I'm gonna continue asking it because I'm hoping to see and so it looks like I'm back let me know if this is okay just the it looks like the wifi dropped real quick that I think we're back online there's not like a big snowstorm going on right now but there's definitely a good bit of snow coming down so my guess is that is a contributing factor recently well thanks we're in today oh well we're in today good to see you but back to what I was saying the the component I'm really interested in is who are the shorts because if it's a bank if it's a market maker or a hedge fund they're very very different in the way they look",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 51,
      "start_timestamp": "00:49:52",
      "start_timestamp_seconds": 2992.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=2992"
    }
  },
  {
    "text": "well we're in today good to see you but back to what I was saying the the component I'm really interested in is who are the shorts because if it's a bank if it's a market maker or a hedge fund they're very very different in the way they look behave act and the implications of game stop going up how centralized it is all of those things matter a lot when we're trying to analyze the potential total impact which from this we won't know over leveraging treasury bonds short squeeze pandemic or liquidity well the liquidity is being siphoned out because they they are starting to take treasury bonds up we'll see see if prepared to wind down an auction rules anticipating a large scale defaults I don't think that it's necessarily an anticipation of defaults but I think it's in in trying to just increase overall market liquidity which is a really big like this is a continual focus for the market is providing as much liquidity as possible give me frequent t35 t21 cycles may produce another surge soon yeah I mean I don't agree with this I don't think that this is likely to be the case but yeah I think overall like what we see in this is about what we've seen before from an overall analysis perspective let's flip through it now and see if anything else sticks out to us dtc we already know all this stuff so talking about the defaults",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 51,
      "start_timestamp": "00:51:25",
      "start_timestamp_seconds": 3085.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3085"
    }
  },
  {
    "text": "the case but yeah I think overall like what we see in this is about what we've seen before from an overall analysis perspective let's flip through it now and see if anything else sticks out to us dtc we already know all this stuff so talking about the defaults okay uh coffee says it's amazing the shorts can attack treasury bonds that's the bedrock of a system like is nothing sacred well I don't think you need about that like the shorts the shorts going up to treasuries what do you mean by that as of today I was to see approved auction plan you know transfers assets to other entities while pushing the damage to the amputee amputee can you take the ways all three of them dtsc usc or ready to pull the plug the the other thing just to be really clear when we look at this is the margin called doesn't trigger a default inherently a margin call is done to actually prevent default and it's to prevent widespread catastrophe so now if there are a series of margin calls done in secession that absolutely can become a problem and that can siphon out liquidity and it can absolutely to pretty massive problems like we saw an o8 but just this by itself doesn't they just i wouldn't make this conclusion personally that by running a march of call in a member that ipso facto we run it to a default because the other thing",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 51,
      "start_timestamp": "00:52:48",
      "start_timestamp_seconds": 3168.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3168"
    }
  },
  {
    "text": "and it can absolutely to pretty massive problems like we saw an o8 but just this by itself doesn't they just i wouldn't make this conclusion personally that by running a march of call in a member that ipso facto we run it to a default because the other thing is when they get margin called the other thing that can do is raise up an auction for them and a takeover buyout a really good price for another company which is a way that we typically navigate through it should as close to hitting fan this be careful just i'm not saying there's anything wrong with it just be really careful when you read this because people you this is going to be beat over your head people are always always looking at the downside the market's going to crash the world is going to end like that that is a really popular angle that you're going to continue to see and talked about because it gains traction because fear is powerful so there's nothing wrong with reading this but just make sure that the subconscious part of your brain doesn't start stowing away stuff like this and then you start to subconsciously permeate into your conscious brain and you're like oh yeah shit's pretty bad or it's all going to go sideways soon it's just a bad way here's a great example of that in 2019 i started trading for my brother and he had a small amount",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 51,
      "start_timestamp": "00:54:25",
      "start_timestamp_seconds": 3265.96,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3265"
    }
  },
  {
    "text": "you start to subconsciously permeate into your conscious brain and you're like oh yeah shit's pretty bad or it's all going to go sideways soon it's just a bad way here's a great example of that in 2019 i started trading for my brother and he had a small amount of money and he's the only person i've ever traded for and i was actually doing really well for him because he needs the money so i was trying to scale up his account and then 2020 happens and key for whatever reason started thinking that you know the world is going to end this is never going to get better and have to take the money out in order to you know save it and as you probably would imagine he took the money out the account obviously stopped growing so i wasn't trading it anymore and i mean i i did done well for his account and unfortunately took it out market was fantastic 2020 was a great year and then he you know slowly started doing other stuff with the money so the lesson here that i want everybody to be aware of is when you read research from people negative stuff will do better than positive stuff fear cells so anytime that i'm doing a video and stuff and i've had different people try to consult me to help me make better videos better titles better thumbnails so that the channel will grow and continue to",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 51,
      "start_timestamp": "00:55:36",
      "start_timestamp_seconds": 3336.68,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3336"
    }
  },
  {
    "text": "research from people negative stuff will do better than positive stuff fear cells so anytime that i'm doing a video and stuff and i've had different people try to consult me to help me make better videos better titles better thumbnails so that the channel will grow and continue to hopefully do better but one of the things that i won't do among many that i know would help me a lot is leaning into fear and it's something that i've done a lot of research on i know it works well but i won't do it just because if there's something that's actually bad sure i'll call it bad but i don't like the idea of fear mongering because i think that starts to prime people's minds to be in a fearful state things are going bad and i i'm very bullish on the globe on human innovation i think we continue to figure shit out so and i think we will continue to figure shit out but i'm not saying that this person is fear mongering i think it's like this is fear mongering shit is close to hitting the fan but i don't think that they're purposely trying to fear monger people tend to focus on this angle so this whole rant is just to make sure that you all are aware of all of those things i was just telling you about so that you can consciously filter when you see stuff like this so that",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 51,
      "start_timestamp": "00:56:52",
      "start_timestamp_seconds": 3412.84,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3412"
    }
  },
  {
    "text": "trying to fear monger people tend to focus on this angle so this whole rant is just to make sure that you all are aware of all of those things i was just telling you about so that you can consciously filter when you see stuff like this so that it doesn't slowly build up in your mind and become a thing because that's what happens to people and that's how you end up like my brother taking your money out instead of compounding it massively spending it on bullshit that doesn't matter and then wishing instead that we had compounded okay k-gos those guys abuse what five times leverage and you just all would affect the head on the market imagine how bad leverage must have been abused by the law chooses still running today so let's actually take a look at that real quick this is what i was looking for there's a couple studies that actually talk about this that we can take over care yeee booy thick peak and let's zoom this in so that our friends in the back and peep it okay so this is from European securities and markets authority as sma they do a lot of different studies not just related to European markets as you expect and they used or k-gos as a lot of people did as a case study because there's absolutely a lot the learn from so let's take a peek says in march 21 the default of",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 51,
      "start_timestamp": "00:57:55",
      "start_timestamp_seconds": 3475.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3475"
    }
  },
  {
    "text": "do a lot of different studies not just related to European markets as you expect and they used or k-gos as a lot of people did as a case study because there's absolutely a lot the learn from so let's take a peek says in march 21 the default of archaegos a us family office led to large losses for some global banks archaegos was able to accumulate large exposures to two and leverage on equities by entering into derivative transactions with bank counterparts when the price of the underlying stocks started to decline the firm was unable to meet variation margins resulting in the liquidation of this stocks by the counter party banks which is important so here are the losses that the companies various companies ate so credit suisse nomura nor is daily ubs and i mean this is no love lost right just to be clear the the losses are big this is a drop in the fucking bucket for companies like this so they do not want to consume losses like this obviously but this is also not what you see from what this kind of makes you believe those guys abuse what five times leverage and you saw an effect that had on the market it absolutely had an effect on the market no doubt but it's not like this big prolific thing that changed the status quo a couple big banks lost a few bucks and they were sad about it whatever i think",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 51,
      "start_timestamp": "00:59:28",
      "start_timestamp_seconds": 3568.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3568"
    }
  },
  {
    "text": "and you saw an effect that had on the market it absolutely had an effect on the market no doubt but it's not like this big prolific thing that changed the status quo a couple big banks lost a few bucks and they were sad about it whatever i think they're all okay as indicated by the fact that cs is still making tons of money actually let's that would be fun to take a look at what cs did in 2021 for its annual earnings reddit suisse 2021 earnings so it had a fourth quarter loss of 2.17 billion in a full year net loss of 1.57 billion and it had a 2.7 billion profit in 2020 so then let's take a look at credit suisse earnings year over year and here we go as expected so credit suisse had 19.9 billion in 22 revenues you know real sad it's actually really bad for them 28 bill in 2020 28 bill 19 so the company is still making tremendous revenue absolutely tremendous revenue so the again just the point is mr bog shams says hasn't changed the status quo yet exactly and that's just because organizations like this are always going to be addicted to leverage leverage is the tool of choice for informed speculators it's why i use leverage because even though you have the ability to lose more money you have the ability to make more money and if you're glued at this you're less worried about",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 51,
      "start_timestamp": "01:00:55",
      "start_timestamp_seconds": 3655.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3655"
    }
  },
  {
    "text": "always going to be addicted to leverage leverage is the tool of choice for informed speculators it's why i use leverage because even though you have the ability to lose more money you have the ability to make more money and if you're glued at this you're less worried about the risk side and you're more content with the profit side so as long as you have good risk management approach which as you could tell cs was oversized here but people like Morgan Stanley UBS losing all right looks like we're back yeah and let's take a look okay so this is ms from 21 fiscal year 21 net revenue 59 billion they were fine 6.2 billion net revenues right so they they took the loss they had a losing position as anything does but as any good risk manager does they managed the rest they had a better spread in their portfolio and they were able to eat the loss it didn't even do rail them for the year which is kind of crazy if you think about it i had to pop in instructions we're meeting some folks that we met earlier today for dinner and i just got to see where we're going all right so it's like 17 minutes away that's easy day and it's cool yeah so we have plenty of time we'll probably run for like another 20 minutes dig it wait so let's get back to this I think we can pop",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 51,
      "start_timestamp": "01:02:48",
      "start_timestamp_seconds": 3768.12,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3768"
    }
  },
  {
    "text": "just got to see where we're going all right so it's like 17 minutes away that's easy day and it's cool yeah so we have plenty of time we'll probably run for like another 20 minutes dig it wait so let's get back to this I think we can pop through this yeah with quiddity through 2020 we don't know all that this talks about the settlement cycles again the one of the things to highlight for the settlement cycles is it's difficult to pick where we want to start so and then that can slide us off by an individual day or two days it just makes it tricky to manage and track all right so oh this is actually interesting i'm excited to read this one well we'll switch off after this one and just kind of bullshit a little bit about anything else that you guys want to cover but oh that's okay too far but i'm actually really interested because this is one of the the long-standing questions i have for apes is the exit approach which i think is actually really important in something that i don't truly see people talk about so this makes me pretty excited to see this is a part of a dd this is also a very long vertical fun fact though we are coming up on two-thirds through the dd from the diamond hand handbook which i think is a pretty significant majority of the different research that's been",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 51,
      "start_timestamp": "01:04:26",
      "start_timestamp_seconds": 3866.28,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3866"
    }
  },
  {
    "text": "me pretty excited to see this is a part of a dd this is also a very long vertical fun fact though we are coming up on two-thirds through the dd from the diamond hand handbook which i think is a pretty significant majority of the different research that's been put out which i'm stoked on all right so let's see what this let's see what this one's about so you're shared during the short squeeze hey that's actually great this is great i love this i love that this is something that was put out do you guys know if this one was well received or not i'm so curious how the community reacted to this because this is a i'm just this is something i've talked about trying to think through a way to skate for me i think scaling out is the smartest the smartest way this is easier said than done this is good this is not good the reason why stop limits are not good is because you might not get filled so when we're trying to take an exit on stuff like this we using a stop is fine but i personally would use a stop market now the problem with that is you can get terrible terrible fills but you kind of need them because otherwise you might not get an exit so that's just something to be generally big peak lambago this talks about different studies for different approaches yeah this is",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 51,
      "start_timestamp": "01:06:13",
      "start_timestamp_seconds": 3973.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=3973"
    }
  },
  {
    "text": "a stop market now the problem with that is you can get terrible terrible fills but you kind of need them because otherwise you might not get an exit so that's just something to be generally big peak lambago this talks about different studies for different approaches yeah this is rad i love this the one thing i would add on for an exit strategy is just to look at prior moves and to base what you think may or may not happen off of purpose so yeah i'm actually really really stoked that this person is talking about this this is rad because one of the ways that you can procure for shares of game stop if that's your intention is to have more money and the way you have more money is if you're able to play the moves we'll get this this will be leave off points or 28 December before Lee i love it cool so i'm going to kill this is there anything else that you want to take a look at i think there was somebody that wanted to look at a stock if you wanted to do that i'm happy to do that now as well but the quick recap of what we learned we learned somebody that was talking about an exit strategy we learned a little bit of due diligence around the settlement cycles leverage and the expectation of a potential kickoff effect from marginal calls and then we also learned",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 51,
      "start_timestamp": "01:08:05",
      "start_timestamp_seconds": 4085.56,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4085"
    }
  },
  {
    "text": "now as well but the quick recap of what we learned we learned somebody that was talking about an exit strategy we learned a little bit of due diligence around the settlement cycles leverage and the expectation of a potential kickoff effect from marginal calls and then we also learned after looking at the actual impacts to companies like credit suiz Morgan Stanley UBS is that although some of them did take some losses it really wasn't exceedingly consequential for them so that was a cool one and this one was about the fed involvement and liquidity so those are pretty interesting three ones i really like that last one michigan says the dd is done we never saw until phone numbers oh that's funny michigan says that's why i can't watch y'all too dumb yeah i definitely i'm ignorant i'm trying to try to learn that's for sure but you're not wrong my friend you're not wrong the other thing i can't tell you though is the difference between you and i is again you probably haven't seen the phone numbers yet because they've not come up unfortunately maybe sometime they will but i've been really fortunate in able to scale and account over the last 17 years that's done pretty well for me so i'm pretty confident and comfortable with my approach but yeah obviously you got to do whatever's right for you and i hope that you you have a solid approach that you're comfortable with that's",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 51,
      "start_timestamp": "01:09:44",
      "start_timestamp_seconds": 4184.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4184"
    }
  },
  {
    "text": "to scale and account over the last 17 years that's done pretty well for me so i'm pretty confident and comfortable with my approach but yeah obviously you got to do whatever's right for you and i hope that you you have a solid approach that you're comfortable with that's the cool part about this whole thing is everybody has to do what they're comfortable with and what makes sense for them you just want to see you have finance bother i didn't see this yeah matter roryne city says michigan is a life where yeah that's cool whatever whatever works for whatever works for him the thing that i just remind people like him and other people is that what's right for you and what works for you is cool but that might not be what's right for somebody else so for somebody to think that their way is the only way is the epitome of ignorance and each person has to do is right for them that's what it boils down to that's the the concept of a marketplace it's how this whole thing works is people have to decide what makes sense for them and only you can decide that yeah that's my point 0.02 cool and then for those that didn't see i did do a game stop recap video yesterday just because i didn't do anything about it really during the week and we had an options expiration that's actually probably when i'm going to",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 51,
      "start_timestamp": "01:11:20",
      "start_timestamp_seconds": 4280.44,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4280"
    }
  },
  {
    "text": "can decide that yeah that's my point 0.02 cool and then for those that didn't see i did do a game stop recap video yesterday just because i didn't do anything about it really during the week and we had an options expiration that's actually probably when i'm going to start doing game stop videos as i might just start doing them on friday unless there's other stuff that that's going on and you can see here the last options expiration was pretty interesting because we were pretty deep past max pain and we saw the market hold what i would consider to be some pretty pretty key levels so that was pretty cool to see michigan says he's probably paid a game followers and then when it's time when it's sell time he'll take the money and tell people to sell a k a gym creamer that's funny the fun part about youtube is i don't know how many ads you saw during this but it should be zero because i have the ads for the live streams even turned off so i actually make nothing doing this so if you want to pay me to do it though that would be sick that would be really really cool because i do spend a lot of time doing this and right now as i said i don't even have the ads turned on so i don't really make a whole lot on no income source so and if i",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 51,
      "start_timestamp": "01:12:41",
      "start_timestamp_seconds": 4361.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4361"
    }
  },
  {
    "text": "that would be sick that would be really really cool because i do spend a lot of time doing this and right now as i said i don't even have the ads turned on so i don't really make a whole lot on no income source so and if i apply your methodology then i just have to hold stuff so then i can't make money off that either maybe that's a typical that's a really difficult model actually as i think about it all right let's see if there's anything else that newton has updated year so proved he's interesting So he also is, he's flagging periods where he's expecting because of large stock movements. That's interesting to me. Yeah. Super interesting. Cool. All right, Kay. Well, that wraps me up from a head out. We're going to go link up some friends that helped pull us out after I got the car stock in the snow. So I'm going to go kick it for a little bit, take the amount for a drink. And I hope everybody has a killer rest of your weekend. There will be a live stream tomorrow. We'll figure out the time and all that stuff. And as always, if you guys need anything, let me know. Be in outlier, be in ape, be whatever you want to be. Catch you later.",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 51,
      "start_timestamp": "01:14:02",
      "start_timestamp_seconds": 4442.92,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4442"
    }
  },
  {
    "text": "that stuff. And as always, if you guys need anything, let me know. Be in outlier, be in ape, be whatever you want to be. Catch you later.",
    "metadata": {
      "video_id": "yH3QUCxPaz0",
      "title": "GME Top Theories Analysis Pt8 | GameStop Analysis Live Ep26",
      "url": "https://www.youtube.com/watch?v=yH3QUCxPaz0",
      "upload_date": null,
      "duration": 4556.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 51,
      "start_timestamp": "01:15:41",
      "start_timestamp_seconds": 4541.04,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yH3QUCxPaz0&t=4541"
    }
  }
]