[
  {
    "text": "What is up apes outliers outlier apes, whoever we have coming to hang out. I wish I could show you this setup I just got in place for the session tonight because we have, we got a lot to talk about. So I got I got seltzer waters. I have drugs. I got a set of medicine ready to rock and roll. I got my other prescription anti inflammatory. I even brought a snack for those that don't know. I only eat once a day, which is normally around now, but I hold off. So you know, whoever, who knows where this goes? So I have my little protein pouch thing. I don't really care about eating. I'm one of those weird people. I like, I couldn't care less if there is a pill that I could take that would give me everything I need. I would be all about that. I would waste zero time with it, but that's not how life is. So we, we're about to get stuck in like a tick. That's the goal. Let me grab this chat and we are going to be off to the races. All right. So what's the game plan for today? I have a couple things that I really want to do. And then everything else that pops up along the ways you all know I'm here for it. We can go left, right upside down, sideways, down for whatever we want to cover. So feel free to throw",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "for today? I have a couple things that I really want to do. And then everything else that pops up along the ways you all know I'm here for it. We can go left, right upside down, sideways, down for whatever we want to cover. So feel free to throw in the chat. If there's anything you want to take a look at any ideas, it's all, it's all fair game. So now what I would like to cover today though is my original game plan is to go back through more of roaring kiddie's old trades. And I want to use the on demand feature fingers crossed that it's working. And I want to use the on demand feature and think or swim so that we can like actually look at the market based on the differences in his portfolio. So the first one that we're going to do it will be his portfolio as it was that first post I think it was what in 20. I don't remember 22. No, it wasn't 22 is 2020 maybe whatever it was. Well, I have the the Reddit thread up with all this stuff. So I want to go through those and I want to take a look and funny enough. It's actually even more important now to do this in my opinion with the trades that we saw last week. So my thought is we start with what happened last week. And then we can dive into his historic",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "those and I want to take a look and funny enough. It's actually even more important now to do this in my opinion with the trades that we saw last week. So my thought is we start with what happened last week. And then we can dive into his historic trades and stuff like that. But you know, we got to say hello to everybody. So we got co co yo why why that's a hell of a name. They say going to be a good one. Love me some speculation. Yeah, there's going to be some heavy heavy speculation in this one. So that's straight up. No capitals says tinfoil hats on. I have mine ready to go. The Viking tin hat is ready to it's ready to rock and roll whenever we need it. Probably not much need up front, but we'll I mean, we'll see where we go. Who knows it's going to get weird in here. I think we all kind of know that it's it's it's about to get real. We got roaring clitty probably one of the best names on planet earth. One fact I have dryer sheets in my pocket because I was in the process of throwing them out earlier. But then my wife was like organizing stuff and there was a perfect opportunity for me to grab her phone and then take a bunch of pictures of the dog. I love doing that. So I mean, like normally I can get",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "in the process of throwing them out earlier. But then my wife was like organizing stuff and there was a perfect opportunity for me to grab her phone and then take a bunch of pictures of the dog. I love doing that. So I mean, like normally I can get like 50 to like 150 photos done before she realizes which is kind of fun for me. So that's why there's dryer sheets in my pocket in case anybody was wondering. We got dark mark. I wonder where light mark is. Aviator geek. I mean, that's kind of a good. I would I would like my aviators to be geeks. So that's good threshold solutions is here Reese raptures. That's kind of a heavy name. Dirt slup. What up? Dirt slup Ricky Selgato says Eric, how would you recommend trading the downside of GME after big run ups? Yeah, we can talk about that in a little bit. I know some people get really weird about that conversation. I was actually talking with a few folks in the discord about stuff like that. I mean, I'll talk about it, right? Like it's it's still a tradable product. It's still going to exhibit movements. I personally won't short stock in GameStop and I really don't like taking downside like long term downside positions really in anything because for me carrying a bearish position is kind of like betting against the success of a company, which I never really like that vibe.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to exhibit movements. I personally won't short stock in GameStop and I really don't like taking downside like long term downside positions really in anything because for me carrying a bearish position is kind of like betting against the success of a company, which I never really like that vibe. Unless it's Robin Hood, I'll fade the shit out of Robin Hood into the fucking dirt. That one I'm okay with. I will, yep, no problem. I will, I'll take a mortgage out on the house to take the capital out and then use that to fade Robin Hood. Like that's straight up. Don't care about that one. But most other companies, I prefer not to fade them. However, I'll trade anything in any direction if it's moving. That because again, like for me, I'm a trader. That's literally how I make a living is by trading. I need things to move. Otherwise, your boy can't get his cool little protein pouch thing and then I'll die. Right? That's kind of what it boils down to. And by the way, in case you were wondering, I did get an MRI last Friday, whoever built those tubes, I don't know what size human being they were planning on putting in those, but it's not like in a normal size and adult. But anyways, those are expensive. So with that, need to trade. Otherwise, there's no way to fit in the fucking MRIs. It's all a giant problem. So that is the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "size human being they were planning on putting in those, but it's not like in a normal size and adult. But anyways, those are expensive. So with that, need to trade. Otherwise, there's no way to fit in the fucking MRIs. It's all a giant problem. So that is the way I think about markets we can absolutely talk about trading the movements in GameStop because that's one of the coolest things about the stock is that it moves all over the fucking place. And I traded it last week and I'll talk about some of those trades if we want because I mean, I still have my carry position in GameStop, but I started using options again, really short term because I've seen this movie before. I know and we'll take a look at it in a second. Let me finish saying hello to everybody. So Ricky bring that back up in a few minutes after I say hello to everybody and we'll get right into it. Chewie says everybody gives him, give him a thumbs up. I mean, it wouldn't hurt, right? It's kind of like it's a nice thing to do. I wouldn't blame you if you did it. I think it would be appropriate. Joe Tatos in the house, Marcus Trader says question, if I know the link of option, but overwhelming where to start over 60 strategies, any video where to start from, come on, big dog. You know I have a million videos. So",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "did it. I think it would be appropriate. Joe Tatos in the house, Marcus Trader says question, if I know the link of option, but overwhelming where to start over 60 strategies, any video where to start from, come on, big dog. You know I have a million videos. So I'm going to drop you two videos to playlists with a bunch of videos. So who's this for? Marcus. So Marcus, this first link is my options 101 playlist. So you can kind of poke through that. See what's applicable to you. And then the second one is my options 201 playlist, which kind of builds on some of the things adds a little bit of complexity to it. And then this playlist, this is a video I launched today about how I trade options, which I actually think is a really good synopsis specifically for your scenario. And then this last video is a options trading for beginners live stream. So this literally goes back. We've been doing this options trading for beginners thing every Friday. I think we just finished episode 13, right? So it's like three plus months that we've been doing a beginner session every single Friday. So that last playlist is essentially that. And the first couple of videos in that playlist is straight up for beginners. It is starting from the fucking basics and working all the way through how to place traits. And then the last few videos have been more so like",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Friday. So that last playlist is essentially that. And the first couple of videos in that playlist is straight up for beginners. It is starting from the fucking basics and working all the way through how to place traits. And then the last few videos have been more so like practical application and stuff. So a bunch of resources in there for you. Absolutely, absolutely happy to help with that. Now the cliff notes version though for you, Marcus Trader is here's what I would tell anybody and let me grab this really quick, quick side note. This is more so just for options trading in general. But I think this is such an important message to get out to anybody interested in trading options. This is my giant ugly PowerPoint that I've been building forever. And I just kind of well, not forever. That's super dramatic. I've recently started building it. But this is what I think for any new options trader, this is the way to learn in my opinion. Start with defining a profit mechanism. Stock goes up, stock goes down. Volatility goes up, volatility goes down. Stock pays dividend. Stock gets added to SP 500 and there's a litany of studies that display that there's typically drift over the next three months. There's a million things, profit mechanism first. Then we need to be able to define and measure said profit mechanism. Stock goes up, when does it go up? How can I tell if it's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "there's a litany of studies that display that there's typically drift over the next three months. There's a million things, profit mechanism first. Then we need to be able to define and measure said profit mechanism. Stock goes up, when does it go up? How can I tell if it's going to go up? How do I know how far it might go up? If it goes down, how far does it typically go down when I think it's going to go up? How long does it take? All of those details have to be ironed out. That's the idea of measuring. Then we fit options into the picture. So notice when I talk about this idea of learning options, the first two steps have nothing to do with options. Nothing to do with options. You don't inject options until step three and step four in my opinion. And it's because so many people start trading options kind of like this, right? You said that you know 60 strategies or you're familiar with 60 strategies. Technically there's unlimited strategies. Options are literally just a way to trade things. What you have to identify what you're trading first and be good at identifying what you're trading first. People blame options all the time for losing money. It's not the fucking options. Options are agnostic. They're not there to help you or hurt you. Options don't care. Options just do what options do. What probably is missing from the picture is these",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "at identifying what you're trading first. People blame options all the time for losing money. It's not the fucking options. Options are agnostic. They're not there to help you or hurt you. Options don't care. Options just do what options do. What probably is missing from the picture is these two steps because here's what I can tell you. If you're good at trading things directionally, let's say you're good technical analyst, you're good fundamental analyst, whatever it is. Nancy Pelosi, they're out here crushing it and they're doing mostly longer term trades with options for leverage. So they have the profit mechanism down which inside are trading. Who knows? I mean, it's all above board, right? I'm sure that they're good. Or maybe you know, fundamental analysis comes into the picture who really knows? Really jokes aside, the point being is even in their scenario, they're just using options to amplify the position. So if you don't have a solid method to trade something profitably, whatever that mechanism is, options don't magically fix it. They exacerbated. So they enhance what you're doing both if you're good at picking something to the right side or whatever your methodology is. These will amplify it. Hence roaring kitty. When I was going back through his all his previous options positions, when I was looking at his original trackers, he used to track stocks, equity positions and stocks, then he started layering in options. Why is that? Because they amplify this underlying tool",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "will amplify it. Hence roaring kitty. When I was going back through his all his previous options positions, when I was looking at his original trackers, he used to track stocks, equity positions and stocks, then he started layering in options. Why is that? Because they amplify this underlying tool that he's developed, which is profit mechanisms. So that is what I would recommend for anybody that's interested in learning about options, how to start learning about them is literally don't even fucking worry about options until there's something you can reliably with some degree of accuracy, identify and predict. If you do not have that, then these won't fix anything. They will just make it worse. So that is my point 02. Tanner says Saturday nights are UFC nights. So you usually have to watch these live streams after the fact, but I had to catch this one live after the recent Deavision Inn against yeah, for sure. And I mean, let's be honest, for the UFC live streams, you could probably skip the pre-lims and be okay. By the way, cheers. We got to get my first drug out of the way. We have them kind of phased out. I think that one I just took is to help with like broad inflammation or some shit. I don't know. Kind of like what I survive off of right now. I just got my MRI though. So we'll see what's up. So yeah, Tanner, skip the pre-lims dog. There's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "out. I think that one I just took is to help with like broad inflammation or some shit. I don't know. Kind of like what I survive off of right now. I just got my MRI though. So we'll see what's up. So yeah, Tanner, skip the pre-lims dog. There's nothing in there. Damn says I have some jam. Jam. Jam 2 of 2025 45 covered calls. I think see expected more volume and volatility. How would you manage those? Sam, I'm not going to lie, dog. You just completely fucked me up. I'm aware that you have some I'm assuming Jan 2025 45 covered calls that I'm same page here. I can I think C can expect more volume and volatility. C can is GME. I think GME can expect C. But I don't understand how somebody would type in C like this and mean GME unless it's spell check. Maybe you're on your phone for the people that are watching the live streams. What device do you typically watch from? Is it like a phone, a laptop, a TV? I'm just trying to understand Sam and whether or not we need to call an ambulance for Sam. All right. All right. So Tanner's down the phone Vladimir iPad PC PC PlayStation 3 curveball didn't expect that. So a lot of people on the phone. Archduke PC. How do you have a name like Archduke PC? And that's confusing. Okay. So it's a lot of PC phones. Aviator Geek",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "right. All right. So Tanner's down the phone Vladimir iPad PC PC PlayStation 3 curveball didn't expect that. So a lot of people on the phone. Archduke PC. How do you have a name like Archduke PC? And that's confusing. Okay. So it's a lot of PC phones. Aviator Geek has me an iMacs theater. That's terrifying. Honestly, if I'm in an iMacs theater, you're going to have to I'm literally going to go to a faceless channel. I think the last thing anybody needs to see in anything like that is my fat freaking head. That yeah, that's terrifying. All right. So did Sam chime in? All right. So most people on the phone. Okay. So maybe. Maybe Sam is on the phone and we don't have to call an ambulance or not necessarily having a stroke. Um. Well, Sam, if you let me know if you reiterate what that is, just so I can understand better. Okay. Here we go. Sam is on the phone. Everybody, Sam's here. Don't worry. Sam is here. Sam says, sorry on the phone. I have GM 2025 covered calls. I don't know if to wait for the pop and roll up or buy now sell higher volume. Okay. So Sam, your boy needs a couple more details here. The first detail is I need to know what the basis is in the underlying. Again, assuming we're talking about GME. If it's not, that's fine. I just need to know what the basis",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "buy now sell higher volume. Okay. So Sam, your boy needs a couple more details here. The first detail is I need to know what the basis is in the underlying. Again, assuming we're talking about GME. If it's not, that's fine. I just need to know what the basis is. The second thing I need to know is what you sold those calls for. I mean, both of those, I'll be able to at least try and help. That's the idea. Warring clitty says I'm in VR. Oh, God, that's even worse. I don't, man. I do not like looking at myself. So I cannot imagine like VR like right there. That's terrifying. Sam says I'm down 100 on the call. So that's okay. So Sam, appreciate the answer. I'm going to reiterate the question though, because they still need to know that. It's very helpful. Those details are important. Because we can look at some different ways to manage the position. So I need to know basis of the underlying and I need to know what we sold the short calls at. Okay. While Sam is hooking us up with that, Nick says I really should because I'm pretty good at picking them, watch every fight usually. Sports betting is the thing. Sports what I would, I don't really sports bet personally, but I do know quite a few options traders that are also sports bettors. You and Sinclair is not so much of a big sports bettor,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "pretty good at picking them, watch every fight usually. Sports betting is the thing. Sports what I would, I don't really sports bet personally, but I do know quite a few options traders that are also sports bettors. You and Sinclair is not so much of a big sports bettor, but he likes it a lot. He just wrote a new book with some sort of well-known sports bettor from Twitter, X, whatever the platform's called now. So it's absolutely applicable because if you, sports betting is probabilities, right? There's a bookie assigning probabilities to different events. That's all it is. That's really funny because when I would bet sports with my friends, they would come up with these crazy ass parlays and I literally would just play the probabilities and crush most of them for a sporting event that I don't fucking know anything about. So if somebody's playing football and they're doing goal touch score units, I don't care at all. I'm just trying to play the probabilities. So yeah. All right. So let's take a look now. I think we can get, I think we can get started. Okay. So Sam hooked us up. All right. Sam said he sold him at 147. Sam, you are, I think now you're starting to break my balls because I thought I've been pretty clear with the details on the need. I'll try again. The details I need are what is the underlying value that you got in at the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "said he sold him at 147. Sam, you are, I think now you're starting to break my balls because I thought I've been pretty clear with the details on the need. I'll try again. The details I need are what is the underlying value that you got in at the underlying. So the covered call part got the call part, which is great. And now need what we got into the underlying at. That's the next part. Those are two pieces of details I need underlying basis, short call basis. We got the short call basis out of the way, which is fantastic news. Now we need the underlying parts still. I'm literally going to model your trade in here and then we can talk about it together because I think it's a good exercise. Sam says shit, sorry, I'm completely fucking with you. There's nothing to be sorry about literally at all. We're just, we're just poking some fun in just. Perfect Sam. And then the last question I'm throwing a curve ball here is for the basis that we got in at how many shares are we talking about? Do we have 100 shares against one call 200 shares against two calls or one call? What does that look like? Again, that's also going to influence what I would do. Everybody we all know roaring titty just popped in. So we have to give a giant shout out to roaring titty. Roing titty and roaring clitty make my",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "shares against two calls or one call? What does that look like? Again, that's also going to influence what I would do. Everybody we all know roaring titty just popped in. So we have to give a giant shout out to roaring titty. Roing titty and roaring clitty make my day and then Vladimir off Putin that I don't know why, but that is just fucking hilarious to me. Big fan of off Putin as well. Having a great time 2000 shares nine call sold. Okay, perfect. So there's a really important lesson here. So let's start with this. We'll start with 2000 shares at 19 dollar. And obviously that'll be an average basis I presume just going off of guessing. And so here's what that would look like now. And then we have nine of these 20. Oh, don't, oh, there it is 17, Jan 25. I think he said the 45s. 45s 45s. Yeah, so 25 45s. These were sold originally for dollar 47, 147. And let's analyze those. We need nine of those. So here's the trade as it was placed. So here is roaring titty says, LOL, there's a roaring clitty. And clitty says, yo, I don't know if we've ever been in the chat at the same time. So I don't, this is a, this is a magical moment. I think we all need to just revel in the chat for a second because roaring titty just meant roaring clitty. And I mean, to me",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "don't know if we've ever been in the chat at the same time. So I don't, this is a, this is a magical moment. I think we all need to just revel in the chat for a second because roaring titty just meant roaring clitty. And I mean, to me that, that feels like fireworks of some sort like this. That feels like a magical moment to me. So I just want to celebrate that with you all that we now have roaring titty, roaring clitty. And they just met one another for the first time. Fantastic. Okay. Now that that beautiful moment is a side. Nick says, what if roaring kitty joined the chat with roaring clitty, roaring titty? To be honest, to be honest, big fan of the cat and his work, love it, love D.F.E. But I have to be honest, I still like the name roaring clitty and roaring titty more. I'm just keeping it a buck. So I'm just keeping it a buck. We all need to be honest with you all that we now have roaring clitty. Nothing but respect for them. But I would like that name. Even. I just saw a simple Rick's, uh, chat, which completely derailed me. Complete thought process. Go on. Shout out to simple. Oh, simple Rick. I feel you brother. Okay. Okay. Back to this. So let's talk about a couple of really important concepts here. First, what do you guys think about this ratio? If we",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Rick's, uh, chat, which completely derailed me. Complete thought process. Go on. Shout out to simple. Oh, simple Rick. I feel you brother. Okay. Okay. Back to this. So let's talk about a couple of really important concepts here. First, what do you guys think about this ratio? If we have 2000 long calls against nine short calls, what, what do you think? What are your thoughts? What did bad like that? Don't like that. Would do something different. Talk to me. Sam says, two, did I not say 2000 shares? My bad. I have 2000 shares in there. That might have just been a little bit dyslexia. Give your boy a break. I just got, my entire, my entire brain just got derailed by a comment. Come on, man. Fuckin. Cut me some slack here. But yeah, Sam, I got the 2000 shares at 19 and then I have the nine short calls 45 at 1.47. All right. So let's talk about these quick. The first thing, I love that it's essentially less than a two to one ratio. This is good. So the reason why this is good is because these short calls, there's nine of them, which can take up to 900 total shares. So you notice how there's still upside potential in this trade. So we're collecting a little bit of money upfront, but we have a lot of upward runway. So that part, I like a lot. Now, here's the problem I see. Even if",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "can take up to 900 total shares. So you notice how there's still upside potential in this trade. So we're collecting a little bit of money upfront, but we have a lot of upward runway. So that part, I like a lot. Now, here's the problem I see. Even if GameStop goes above 45, then back down or above whatever GameStop does, doesn't really matter. What matters in my opinion is that this is going to take forever. We are now going to have to make sure that we hold at least 900 shares as long as this short call is on, which is very likely to stay underwater for a large duration of the trade before it starts showing a profit that is everything to do with the way that options behave. If you look at the theta on these options, it's three cents a day. So 3 per day will come out of this and it will slow down as more of this data comes out and there's less theta to come out of it if they stay far out of the money. So one of the things that I would think about if this were my trade first of all is not selling those short calls that far out in time, I personally would keep them within 60 DTE. And the reason why I would keep them within 60 DTE if we go to the handy dandy notebook, the handy dandy outlier PowerPoint doesn't sound as good",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "first of all is not selling those short calls that far out in time, I personally would keep them within 60 DTE. And the reason why I would keep them within 60 DTE if we go to the handy dandy notebook, the handy dandy outlier PowerPoint doesn't sound as good as the handy dandy notebook. You'll see theta decay starts to really accelerate within 60 days. So with those being out 132 days kind of out in this zone, they're just kind of losing a little tiny bit each day in tying things up. So that's just one note. The other thing is because again in this same scenario, if you do a shorter term trade, you can cycle them faster and you will make way more money doing that than selling something that that's that is that far out. So just a general admin note. Now in terms of the risk of these falling in the money, obviously, there's a risk if GameStop goes above 45. What I can tell you is at least in the near term, the probability of GameStop going above 45 and then staying there for an extended duration, it seems lower to me. That doesn't mean GameStop can't get there. I think especially as we start to understand more about what Cohen RC is thinking about doing with this poor Billy that they're sitting on, that will be really informative to how they choose to transform the business. So when I look at something",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "doesn't mean GameStop can't get there. I think especially as we start to understand more about what Cohen RC is thinking about doing with this poor Billy that they're sitting on, that will be really informative to how they choose to transform the business. So when I look at something like this, I think it's fine, but I think that this is just going to tie up a lot of the trade unnecessarily. That's my opinion. So going back to the original question though, hold on. There was a very specific question before we got into all these. I don't know if I should wait for a pop and roll up or just buy now to sell later at a higher premium or just buy some calls. So Sam, in that context, what I can tell you is literally dude, you're talking about completely different strategies, right? The idea of buying a call versus selling a call in that context, they're completely different. So my biggest recommendation there would be start by defining what you're trying to do. That's what I would say. Because selling short calls versus buying calls in this scenario, they're literally completely different. So I would try to understand what the goal is and then make adjustments off of that personally. That's what I'm thinking of. So yeah, in this case, I wouldn't bother doing, well, again, it's like for one, I wouldn't put that trade on to if I put that trade on the entire",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "try to understand what the goal is and then make adjustments off of that personally. That's what I'm thinking of. So yeah, in this case, I wouldn't bother doing, well, again, it's like for one, I wouldn't put that trade on to if I put that trade on the entire premise would be to just wait to just leave those sit until I can make money on them. So the last thing I would do is sell them and then as soon as they're not making money, buy them back for a loss. Because then I've accomplished nothing other than losing money. So obviously, this isn't to point fun or anything. It's to try to talk about the way that I would conceive of a position like this so that it makes sense. Because you have to know at the onset of the position that this is going to show a loss for the overwhelming majority of the life cycle of this trade, just how she goes. So yeah. All right. Let's talk about what happened this weekend. By this weekend, obviously, I mean yesterday. Don't know why I said this weekend. I was kind of stupid. Sorry. Why happened yesterday? Well, Roryn Kitty comes alive and he drops this. Drops. I didn't even mean to do that, but it fits so well. He drops this. So here's the funny thing that happened with this. When I first, before I saw this come up, this was posted right at 0900",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "yesterday? Well, Roryn Kitty comes alive and he drops this. Drops. I didn't even mean to do that, but it fits so well. He drops this. So here's the funny thing that happened with this. When I first, before I saw this come up, this was posted right at 0900 Pacific time, right when this came up. Before this, I got hit on a few alerts in GameStop. I actually placed the trade based on those alerts because I expected something to happen. It didn't play out precisely as I anticipated, but it wasn't that far different from what I anticipated. This is one of those rare kind of scenarios where I did something and I wasn't completely wrong within the first three seconds of doing what I did. It's you got to really relish in those moments because the vast majority of the time, the at least for me, the stock market finds a way to just perpetually make me wrong, which I really appreciate what the stock market's trying to do. It's trying to build me some character, I suppose, but I feel like I have enough of that at this point. Also, a giant shout out to the apes. There's 140 people hanging out right now, getting ready to dive into the background of roaring kitty. So shout out to you guys. Absolutely stoked to go down this path with everybody. Generation, a couple says, what alerts do you use? I use a bunch of different scans.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "the apes. There's 140 people hanging out right now, getting ready to dive into the background of roaring kitty. So shout out to you guys. Absolutely stoked to go down this path with everybody. Generation, a couple says, what alerts do you use? I use a bunch of different scans. So I use a few different platforms to help me identify abnormal movement. So one of them is this. And I'll use this is kind of like the homepage that I use for this. And it essentially lets me identify things that are moving a lot. And then it identifies unusual options activity essentially real time. So that's one of the primary things that I will keep an eyeball on. And what I do is I add filters to look at specific stocks. Because otherwise, if you don't do that, you'll get a bunch of stuff like this like Apple. And they're using unusual options essentially to look at big trades and whatnot. But it's like Apple in video like this. You'll see these on the board all the time because they're massive. They're going to move all the time. So to me, that's actually kind of just noise. So I create filters so that I can see the stuff that I want to see. And then the other thing that I do is I scan through think or swim the platform itself so that I can have a clearer sense of what's popping up, what's moving. And that's essentially",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "I create filters so that I can see the stuff that I want to see. And then the other thing that I do is I scan through think or swim the platform itself so that I can have a clearer sense of what's popping up, what's moving. And that's essentially how I see it. I'm looking for expansion in individual contracts. I'm looking for large trades. I'm looking for persistent trades that add up to a big big value. Those kinds of things. So yeah, that's like the general concept behind what I try to do. And again, I can show you in here what that might look like. It obviously won't look like much in here because the market's closed. But if we drop in here, I can look for stuff that's looking for the options itself that they've increased at least x percent. This is the volume for the specific strike price. And 50 is still way too low. Normally, I'll do like 100, 150, 200 as a minimum. And again, I don't know. Yeah, so there'll be a bunch like and you'll notice that like there's millions of returns. So for something to grow by 100 isn't actually a ton. So what I'll do in this context is I'll look for stuff that has at least a certain amount of downside volume. And then I'll look at volume counts on the day. And I'll say, okay, well, clearly something strange is going on in AG. What's going",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "actually a ton. So what I'll do in this context is I'll look for stuff that has at least a certain amount of downside volume. And then I'll look at volume counts on the day. And I'll say, okay, well, clearly something strange is going on in AG. What's going on? I have no idea. But what I can tell you is that the one day relative volume in it is absurd. Something's going on. So then I go look, that's kind of the idea. I just go through and I look for ideas following that kind of path. So then that's how I catch the initial trade. And if we come in here, we can take a look at that initial trade together. Let's take a look at I'll look at the last week in total just because I think it paints a clear picture. And then let me get rid of this. So for GameStop, as you all know, I literally do a daily video and I look at GameStop every day. And in my daily video, I don't always cover GameStop, but at least for the last like three months, I almost always cover GameStop. At least a little bit. Part of it is just because I feel a level of commitment to you all like I've said this a million times. Once I start doing something, I continue doing it. And I don't want anybody to feel like I'm bailing. Now if there's a video without",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "a little bit. Part of it is just because I feel a level of commitment to you all like I've said this a million times. Once I start doing something, I continue doing it. And I don't want anybody to feel like I'm bailing. Now if there's a video without GameStop, it's not obviously that I'm bailing covering it. It's just that sometimes it's just not doing a whole lot. And I'm kind of focusing the time elsewhere. Also, cheers. Next round of drugs. This is this is the drug time of day. I have like three periods where I got to take a bunch of drugs. Next down the hatch. Hey, there she goes. So I got alerted for these yesterday. And essentially at 842, 0842, this is Pacific time. 842, 37 and 38. I see these two trades come through. And I see these two trades coming up to be a pretty significant sum of money. They were bought right around where GameStop was trading. So if we take a look, I'll slide this over here, I guess. Yeah, this is fine. This is a daily five minute chart. So this is looking at the specific day. So if we go to 0840 and 45 in here, you can see where GameStop is trading. I realize that you can't because that's in the way. So it's trading right around at the money. So those 22 and a half were like literally right at the money, which makes sense.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "if we go to 0840 and 45 in here, you can see where GameStop is trading. I realize that you can't because that's in the way. So it's trading right around at the money. So those 22 and a half were like literally right at the money, which makes sense. That's not outside of what I've seen the cat do previously. It seems completely, completely in line. He typically seems to go a little further out of the money. Now all of this is predicated on this trade coming through, which is really interesting. There is absolutely nothing that directly ties him to this because in terms of strike selection, I think it's weird that it was 22 and a half. I haven't seen him use those kind of strikes before the have strikes. The other thing is this was a really short dated option. This was expiring in 13 step. That's also really weird to me. And that's part of the goal for today's session is to go back through all of his old trades to see if what I think is weird is actually weird because again, my goal in looking at this stuff is to share some of the analysis skill set that I've built over the last 16 plus years of trading. So what that means is I have ideas. I have hunches on what may or may not have happened. It's kind of swirling around the back of my head, but I don't just take",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "of the analysis skill set that I've built over the last 16 plus years of trading. So what that means is I have ideas. I have hunches on what may or may not have happened. It's kind of swirling around the back of my head, but I don't just take those at face value. I force myself to validate things. So that's actually part of the session today is to go back and validate some of these things because to me, that's strange. The amount of money that has the cat written all over it. No doubt. The size of these trades in terms of lots also has the cat written all over it. This expiration does not have the cat written all over it. This strike selection does not have the cat written all over it. These just don't make a lot of sense to me. So this happens at 08423738 again, Pacific time. Then if we take a look, this comes out at 0900. So this is what I infer from these. And again, I don't think I need the tin foil hat just yet because when I look at this, I see this obviously is talking about the dog stock. And I think if I'm not mistaken, that 13G, let me find that one second. Keith, Gil, 13G filing, Chewie. Yep, here. So there's one important note to keep in mind here is as we look at when these tweets come out, there's some sort of correlation",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "the dog stock. And I think if I'm not mistaken, that 13G, let me find that one second. Keith, Gil, 13G filing, Chewie. Yep, here. So there's one important note to keep in mind here is as we look at when these tweets come out, there's some sort of correlation in terms of time. So this came out 10am flat. This also came out on June 27th. Now from the SEC filing, this tells me that he crossed the 5 ownership threshold on June 24th, crossed the threshold. The reason why I emphasize that part crossed is because you don't have to file this until you cross that 5 threshold. So he technically could have been building a position leading into this. And the way that we would deduce from that is like, okay, June 13th, he had this sometime between 13 June and 24 June, this happened. It's not a giant window. You can kind of see when that happens. You can even see it when we look at Chewie and we analyze the stock. And again, I don't know with certainty, but what I do know that if I go to 24 June, I see a massive, recent, outsized buy bar, 78 by volume with total volume coming in at 23.7 mill, where the 20 day average was 14 mill and the five day average was 16.6. So pretty big deviation would not surprise me in the least if he bought all of that here. Wouldn't surprise me",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "outsized buy bar, 78 by volume with total volume coming in at 23.7 mill, where the 20 day average was 14 mill and the five day average was 16.6. So pretty big deviation would not surprise me in the least if he bought all of that here. Wouldn't surprise me in the least, not guaranteed, but it wouldn't surprise me. Now my thought is when he posts this, this is obviously after he already bought the dog stock, he was in Chewie in some capacity, what he did with his GME shares, nobody knows. Based on basic math, I know, unless he took in money from another account, which again, pure conjecture, no idea, almost going to have to get the tinfoil hat soon because we're getting close. But I still think this is a very reasonable thought pattern to follow is he would have had to sell some of this position because he had 268 million total with just 6.3 million in cash. When I look at this trade, that again is likely to have occurred in my opinion on 24 June looking at the chart. If we give him even a favorable entry on 24 June, something around like mid price lower mid, which again is probably not the case. 26 was the price. So we have 9 million 1000 shares. 9 million 1000 shares times 26. He needs 234 million dollars. 234 million dollars got to come from somewhere. In this account, I see 268, he has",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "like mid price lower mid, which again is probably not the case. 26 was the price. So we have 9 million 1000 shares. 9 million 1000 shares times 26. He needs 234 million dollars. 234 million dollars got to come from somewhere. In this account, I see 268, he has enough, he does not have enough in cash. So the theory in my opinion, and I think it's time for the tinfoil hat. We'll see how long I can keep this on for because it's pretty damn hot in California right now. I do have the air going, but not only do I think that it's a sick costume, but I also just think it's important for people to know when I'm like straight up speculating, which this is now getting into speculation. So in my opinion, the probability that he has another 200 million dollars, just sitting in another account that he wouldn't have started with in this when he came back, I find that to be unlikely. I just find it to be highly unlikely. So could it have happened? Absolutely. I just would think it would be an unlikely scenario personally. So then that leads me to believe that the higher probability scenario is unwinding all, if not the majority of this position to free up the cash, to then move into dog stock. The main thing I see here, I think there's everybody's eyeing in on like which way the eyeballs are facing. And to me,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "believe that the higher probability scenario is unwinding all, if not the majority of this position to free up the cash, to then move into dog stock. The main thing I see here, I think there's everybody's eyeing in on like which way the eyeballs are facing. And to me, I don't know, I think it's a shout out to the Kansas City shuffle thing, but my main takeaway is I just see green here, which is very typical for buying. And then I see red here, which is very typical for selling. So whether or not there's something weird on his holster, like with that little logo, I have no idea. I don't even know what that is. I think other people probably will know what this is, but that's the main thing I see is eyeballs green eyeballs red by cell. So this leads me to believe it's likely that he unwound all, if not some of his chewy position. That's my guess. He's putting the dog down. In this case, putting the toy down, putting the dog down, red cell, green by now. The interesting part here is this was a like not right after, which I find fascinating, right? Because we can see based on the filing, it was 24 June that he crossed the threshold. He waited two days to post this. Whereas in this, he posted it again, if this is him, which we don't know, if this is him, which we don't know,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "find fascinating, right? Because we can see based on the filing, it was 24 June that he crossed the threshold. He waited two days to post this. Whereas in this, he posted it again, if this is him, which we don't know, if this is him, which we don't know, he would have posted it like 15 minutes after he got in. So now the other thing that, again, this is like straight tin foil. I need to bring this on my head a little bit more. So by seeding this on the head more, the one thing I remember from this movie is that when he put this, this toy away, he was moving on to Buzz Lightyear, like the new or fun toy, but he went back to Woody. I personally don't think that's what he means by this, but that would be a thing, right? Putting the dog toy away with some sort of expectation to go back to it. Because Andy, I think that's this little bastard's name goes back to Woody later in the movie. So I have no idea. But anyways, all right, let me get to the chat. I see you guys are going off here. Let me see. Sneyhill says this name should be taken only at face value. I agree. I completely agree. I think that in my opinion, this is just saying bought sold. That's what I see. So yeah, completely agree. All right. What were we at? CDJ says",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "going off here. Let me see. Sneyhill says this name should be taken only at face value. I agree. I completely agree. I think that in my opinion, this is just saying bought sold. That's what I see. So yeah, completely agree. All right. What were we at? CDJ says is me and about you were a billionaire. He had money and more. No, I think you saw him in his primary account. His primary account literally almost had that. Yeah, I forgot where there was a point that he shared on the stream. Like he was right at billionaire. So yeah, I think I think he was just referring to his account. But now when it comes to him having other accounts, I'm sure he has other accounts. How much money he has in those I have no idea, but I don't think like to me, I don't think there's a good explanation as to why he would come back here with only, again, we're talking insane world now, but only 210 million. If he has another 200 million that he's wanting to trade with, he would, I would just, I would bet dollars to donuts. He would come back with all of it. I see no reason why he would only come back with this if he was expecting to trade with more. I just don't see it. So could it be absolutely, but I just don't, I just don't see it personally. It's not a bad thesis,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "back with all of it. I see no reason why he would only come back with this if he was expecting to trade with more. I just don't see it. So could it be absolutely, but I just don't, I just don't see it personally. It's not a bad thesis, though. It could be. Ricky says for us non-apes, how do you think the best way to trade the downside of GME is after big run up, think about buying puts if it goes up a crazy, yeah. So with something like that, you're kind of damned if you do, damned if you don't. If you buy puts, it will work. That's the way I would do it, but they're going to be way expensive and you have to be really thoughtful about the way that you buy the puts. So for those kinds of things, I would go a little further out in time. That's the way I do it typically, like at least greater than 60 days on the long options. And then I go like at if not in the money for something like GameStop at the money is typically planning because it'll cascade. So yeah, that's like the high level overview. Roryntitty says we don't know if Chui was in its own account. All we know is the filing happened. He didn't show his port with Chui. I again, I would think he uses account because it's, the reason why I think he uses account is",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "like the high level overview. Roryntitty says we don't know if Chui was in its own account. All we know is the filing happened. He didn't show his port with Chui. I again, I would think he uses account because it's, the reason why I think he uses account is because he says this. Like we've we've listened to this before together quite a few times, but in this section, and I'm just highlighting it to you because we don't have to listen to it now. Let me share like the specific star point here. Here you go. So from this star point, he says this is his only account. Like that he explicitly says that. I believe him. I don't think he would lie about that. So I believe him that this is his only account. So could he have another portfolio that he's trading in? He could. But I believe this. Zachary says his wife's IRA. Yeah, the problem is is that there's no way to get that amount of money in the IRA. Yeah, I don't see that. Hot nitrogen says he said it's his only position list. We count cash as a position to. Yeah, the reason why he said count cash as a position to is he he hovered over the cash and as he said that, he says it depends on your position. But he was like explicitly calling out this cash because some people would say, well, cash is a position and he's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "reason why he said count cash as a position to is he he hovered over the cash and as he said that, he says it depends on your position. But he was like explicitly calling out this cash because some people would say, well, cash is a position and he's trying to the point in my opinion that he's trying to make is that this is the only thing he's holding. So that's why he makes the point to call that out. Zachary says I mean, he started at 53. He did. But the other thing that again, as I was going through some of his background in terms of like his start, which we have to I don't know if there's a way to like save this down part instead of having to do this each time. I haven't figured that out. Any smart people know how to do this instead of having to like drag this bar down each time, which is super annoying. I haven't figured that out. But anyways, he started with this, but I the way that he grew his money is literally through YOLO's and it looks like he started down here. Again, I don't know what he had from the get go just from like the first position that he posted here with like 113,000 is what I see. Roaring Titty says up and down arrows. Roaring Titty, well, I already told you you could do no wrong. So normally I would have",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "don't know what he had from the get go just from like the first position that he posted here with like 113,000 is what I see. Roaring Titty says up and down arrows. Roaring Titty, well, I already told you you could do no wrong. So normally I would have jousted back there. But yeah, like the page down doesn't work. It just takes me to the bottom of it. Brad says for the sake of the discussion at this point, how about we assume this was his only account being come back to it? Yeah, well, and I mean, really there's nothing else to cover there, right? It's just everybody will have their opinion rightfully so on like what they think may or may not have been there. And we we won't know what it is. Like we just unless he chooses to share or tell us what you get in my opinion, he did that when he talked about it on that live stream. But I mean, who knows? That's that is the that is a straight-up part. Nobody will know. All right. Oh, God, I take this off for a few minutes. In case you guys are wondering, aluminum foil is not like a really breathable material and your boy runs hot, real hot. So okay. That Lawrence is sorry, did you say how much he would have made on Chewie calls? I didn't because I've seen nothing. I've seen nothing that indicates that he bought Chewie",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "wondering, aluminum foil is not like a really breathable material and your boy runs hot, real hot. So okay. That Lawrence is sorry, did you say how much he would have made on Chewie calls? I didn't because I've seen nothing. I've seen nothing that indicates that he bought Chewie calls. Like I haven't seen that anywhere. The only thing that I see is this which can be options, but I looked through and we did this actually when I did one of the live streams with Newton. We looked through we combed through all of the Chewie options trades leading into this. And I just I don't see it. So I don't I don't I haven't seen anything. I know a lot of people were immediately assuming that he had options positions so that he was trading options, which is fair. He does that a lot. But I didn't see anything in here that led me to believe that there's an options position. Sneheel says I'm pretty sure there was some 5K blocks around the 24th. Let's take a quick look. I mean, we'll get to the bottom of it right now. So HWI. And then you're telling me around June 24th. I mean, we can look at the whole period between his updates, right? What is it? June? Is that right? Let me find this thing. Fuck, I don't want to scroll up. Hold on. Let me grab another version of this. Stand by. Okay. Yeah, this will",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "around June 24th. I mean, we can look at the whole period between his updates, right? What is it? June? Is that right? Let me find this thing. Fuck, I don't want to scroll up. Hold on. Let me grab another version of this. Stand by. Okay. Yeah, this will be like our up top version. So June 13th was the last. So then we can start after June 13th. We've done this exact exercise before. So go June 13th until the 24th, which was the date that it happened. We'll look at just the calls. And then we'll look at just call buys. And I see the 30s come through in two blocks for 19 July. So it's not that. Because he just posted the picture of dog stock. And this doesn't equate to that size of a position. Let's do the math. So he has 10,000 at 30 is the basis. 300,000. So this represents 10,000, obviously, times 100. Yeah. It's only a million shares. This shows me nine, nine million. It's like, it's not even close. So we did this exercise again with new knots too long ago. We're like, I looked at each day. Because there was another theory that Newton had that maybe he just traded enough options in order to essentially double his account in that time frame. And again, like you could tell by the way I'm framing that I just think that that's like insanely improbable. But who knows? So we looked",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "was another theory that Newton had that maybe he just traded enough options in order to essentially double his account in that time frame. And again, like you could tell by the way I'm framing that I just think that that's like insanely improbable. But who knows? So we looked at it. And I took it seriously when we were looking at it. And yeah, I don't see that happening either. So again, just using like simplest explanations here, I think that that's kind of one of the important things to do with these is use the simpler explanations and the simpler explanations is when this happened, he probably unwound his game stop position. All if not some, if some, some, if not all. And then here it looks like he's unwinding the chewy position. Again, my guess is it probably didn't happen on the sixth because there was a delay between these. Right. Teddy says if he owns 6.6 of chewy nine million shares, one of me shares isn't a small amount. No, no, no, it's not small at all. It's just not the nine million shares, which is not even close. Salty says, did you research further dates back just in case you built a position before and it, no, I didn't because again, we don't have to because he told me this is his only account. So the last date that he provided an update is 13 June in this account. So yeah, I think the the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "back just in case you built a position before and it, no, I didn't because again, we don't have to because he told me this is his only account. So the last date that he provided an update is 13 June in this account. So yeah, I think the the theory of him trading this in his wife's account coming up with nine million, it's 200 million. I genuinely, so there's a way that you can do, it's called a mega back door Roth IRA conversion or an IRA conversion. But you run, you run out of the ability to pile money into the product or into the account. If it's a standard IRA, I guess he could funnel more into it. But I just, yeah, I would struggle to see that as the case here. Rointit, he says at the beginning of the stream, he said accounts plural about 12 minutes in, yeah, Rointit, if you can grab me the exact time spot in there, I'm happy to play it. Again, I'm just going off with what he told me like in this, he says this is his only account with his only positions. So in the beginning, my guess is if he said the word accounts, he probably was using it just in a conversational phrase. Whereas this, he's explicitly talking about the accounts that he's trading. Again, in my opinion, so yeah, he could have other accounts. There's no doubt. But if there's another account, it would",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "guess is if he said the word accounts, he probably was using it just in a conversational phrase. Whereas this, he's explicitly talking about the accounts that he's trading. Again, in my opinion, so yeah, he could have other accounts. There's no doubt. But if there's another account, it would require essentially another 200 million, which again, as good as Roaring Kitty, that is, that's double the amount of money that's in this account, two times that amount of money. This amount of money took him obviously some time to build. He could obviously compound pretty quickly here, but it's just a ton, a ton of money. So yeah, I always will acknowledge that we don't know and it could be. But again, I think the way that I try to analyze it is follow the highest probability paths as I can. That's the way I think about analyzing it. So yeah, that's the way I'm thinking about it. Brad says what his GME ownership show up in a Bloomberg terminal because other individual positions do and he hasn't been on it. No, it's, it depends on so on a Bloomberg terminal, it limits like the kind of entities that show up. Like everybody doesn't get to see your position on Bloomberg. Otherwise, nobody would use a Bloomberg terminal. That's like give that's like given away your hands. So whatever you're seeing in terms of other people's positions, you're seeing like reported positions in terms of required filings, but it's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "show up. Like everybody doesn't get to see your position on Bloomberg. Otherwise, nobody would use a Bloomberg terminal. That's like give that's like given away your hands. So whatever you're seeing in terms of other people's positions, you're seeing like reported positions in terms of required filings, but it's not like showing a real time tap into his portfolio. Literally nobody would use a Bloomberg terminal, which is crazy. Yeah. So anyways, back to this because I do think it's important to talk about. And I talked a little bit about this in the video from yesterday. I get confused with the videos because I do a lot of videos. Let's say the seventh. So we'll just do this week again. So here, I'm going to grab both sides. I, this confounds me. This absolutely confounds me. I do not know what happened here. Now, I'm going to walk you through the basic analysis based on, again, following the simplest explanation first. Somebody don't know who bought these at 0842. Somebody looks to have sold about a half hour later the same position. So this looks like somebody bought here, held for 20, 30 minutes and then sold here. CDJ says those trades were done on the floor. What does that mean? Like walk me through what you think that means. I've seen that circulate a little bit. And I'm trying to understand what people think that means because the floor is probably being misused. I would guess because",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "CDJ says those trades were done on the floor. What does that mean? Like walk me through what you think that means. I've seen that circulate a little bit. And I'm trying to understand what people think that means because the floor is probably being misused. I would guess because it actually doesn't make sense. So yeah, talk me through what you think because what I've kind of heard people saying is that they're thinking that this is like the market makers, which for those that don't know, they wouldn't be on the floor. In this case, for this kind of position likely, this would be a quantitative position. But a bunch of well, first, let me ask. And before I start going down that, that example, there's a flag reference to the designation while hanging on the floor with your laptop. On the stock exchange floor is what I read. Yeah, but what does that mean? I need to know what that mean. Again, and it's really dangerous, right? So CDJ, do you notice what you said in the beginning? You said it like definitively. Those trades were done on the floor. And then here, you're just saying that you read it somewhere. And again, I'm not picking on you. But I'm just saying like when we're trying to follow a logical process, it's so important to try. And like if there's data that says that somewhere, I'm obviously open to it. But like, yeah, Jonathan says, look farther",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "you read it somewhere. And again, I'm not picking on you. But I'm just saying like when we're trying to follow a logical process, it's so important to try. And like if there's data that says that somewhere, I'm obviously open to it. But like, yeah, Jonathan says, look farther right. Okay. And what, okay, so this makes a ton of sense then. So this trade here, which is this purchase was done on the floor. So do we know what that means? That's what this one that's flagged that, the 63 99. Brad says that's the theory. How do you get a laptop from that? The theory you're referencing DFC walked in the Boston exchange itself. That's funny. Ben Price says, I'm a guest, somebody read him and traded the event. I mean, I opened a long Jimmy position when I saw it. Should we sail volume speculation was that it was placed from the floor of a stock exchange from the pits, not sure if that would make a logical for it to be the cat or more likely than not. The flag was on you. Yeah. Okay. Yeah, I think that that's unlikely for a lot of reasons. The primary reason why I think that's unlikely is because my guess is this trade went to the floor because of the size. I think that's where they processed it. I don't think I have to double check. I don't want to speak out of term. Let's actually see",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "reasons. The primary reason why I think that's unlikely is because my guess is this trade went to the floor because of the size. I think that's where they processed it. I don't think I have to double check. I don't want to speak out of term. Let's actually see what that means. I'll look it up just so that we can learn together. Okay. So on the unusual Wales platform, when a transaction is labeled as floor, what does that mean? Reversed trades that are executed on the trading floor of an exchange as opposed to being done through an automated system electronically. These trades are often negotiated manually by traders on the floor involving large institutional order blocks of trades. So this, the fact, and that's exactly what I expected it to be, but I just didn't want to go off-half-cocked. So in this case, my guess is this was a big trade that was being routed, and that's how they chose to execute the block trade. So all I'm saying is could this be another entity? Absolutely. This could be anybody. We don't know who it is. Could this be Roryn Kitty? Absolutely. The fact that it was executed on the floor doesn't mean that it's not a retail trader. This one was 200, 200 lots that came through on the floor. Like you'll find floor on a lot of these. So bigger orders typically so that you don't, because the process of trying to fill this",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "was executed on the floor doesn't mean that it's not a retail trader. This one was 200, 200 lots that came through on the floor. Like you'll find floor on a lot of these. So bigger orders typically so that you don't, because the process of trying to fill this kind of order at once would push the price pretty meaningfully. So my guess is they probably were going to fulfill a large order through a broker. They call the broker and say, hey, I have a big, again, a retail trader can do this. I have a big order that's going to come through. I want to buy X, Y, or Z. And then at that point, the broker can say, okay, let me connect you with the floor or the broker can say, I'll talk to the floor and see what they can do, what size they can accommodate. Because when we look at resting orders, we can see the depth. So if I get rid of these examples and we take a look. So if we take a look, you see this column that's called size, this tells me what is offered at this point. So here, if I, I would love for it to pop up. Man, I don't want to unscrunch it. There goes. So here on this one, you'll see that it's essentially bid for 509 at this price, 201. And then it's offered 229 for 230 lots. So when you have a really",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "if I, I would love for it to pop up. Man, I don't want to unscrunch it. There goes. So here on this one, you'll see that it's essentially bid for 509 at this price, 201. And then it's offered 229 for 230 lots. So when you have a really big order that you have to fill like 6000 contracts and you don't want to get chewed up on the like on moving the market yourself. Because a big difference between this and the previous stuff we've seen, again, if this is Roryn Kitty, this is under that big assumption bubble of if, if it's Roryn Kitty, when we've seen this behavior before, it's establishing a position similar to the size over a period of time. Right? This was done in a couple minutes, it's single day, literally within seconds of one another. So in order to fulfill that kind of position, that's my guess. My guess is they chose to split up the order. And I think that's why it's flagged that way. So here's what we can conclude objectively from this. We don't know who it was. We know that one of them was executed on the floor and it wouldn't surprise me at all if these were again discussed in tandem. And it wouldn't surprise me at all if the broker says, okay, you can launch this order for 3660 from whatever. And then you you'll send the rest 6399, whatever the size, desired size is through",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "and it wouldn't surprise me at all if these were again discussed in tandem. And it wouldn't surprise me at all if the broker says, okay, you can launch this order for 3660 from whatever. And then you you'll send the rest 6399, whatever the size, desired size is through the floor and they'll take the trade. That's one other thing we can conclude from this. The other thing we can conclude is we don't know that this is the same as this. We don't know. It seems overwhelmingly likely to be the case, but we don't know. Now the slightly ugly part here is if hat back on if this was the cat and if he bought in here, then if he posted this at 0.9, we know that roaring kitty absolutely would know posting this is going to move game stop. There's no way he doesn't know that. He knows that. So it looks like places trade post that on x sell the trade into the volume. That's what it looks like. I don't think that's what happened. Not for a second. Not for a lot of reasons. First reason. This is a lot of money. This is peanuts compared to what I've seen him hold during this live stream. Down 225 million dollars. Doesn't give a fuck. This is peanuts for this dude. Pee nuts. I cannot see him in any way, shape or form. One, thinking this is a good idea in terms of regulation. He",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "peanuts compared to what I've seen him hold during this live stream. Down 225 million dollars. Doesn't give a fuck. This is peanuts for this dude. Pee nuts. I cannot see him in any way, shape or form. One, thinking this is a good idea in terms of regulation. He would overwhelmingly have to expect that he would get caught for this. Two, what a trivial amount of money for this dude. We're talking tens of thousands of dollars here. Maybe a few hundred thousand dollars here. I just do. I just don't see it. I just don't see it. So could it be? It could. But my guess is if that happened, it would have happened for a reason completely different than to try to make a few hundred thousand dollars here. That's my opinion. If he did it. If this is him, if the sale is him, which those are all ifs, we have no idea. If any of that is the case, my best guess is that it would have been done for some other reason, which I really don't know what it is. But what I can tell you is that from a monetary motivation, I do not think he could have cared less about this kind of movement. I just don't think he could possibly care less. So that's why if this was him, I assume it's for another reason. And that's why I highly, highly question what this all is because it's really hard",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "do not think he could have cared less about this kind of movement. I just don't think he could possibly care less. So that's why if this was him, I assume it's for another reason. And that's why I highly, highly question what this all is because it's really hard to tell because if you think about this, all of this is from the origin of just this, which this doesn't even mean that he moved into GameStop. And again, the other thing I want to remind people is that when he posted this on 27 June, he made the trade into Chewy several days before. So this would be a departure from that. Where he apparently would have exited dog stock whenever maybe this was lagging a certain amount of time and then transition into GameStop right after he posts this. I think that would be weird. I think that would be real, real weird. So when I look at this, I am the one thing I feel fairly confident in is that he bought Chewy. And this was him telling us. And I think this is him saying he sold Chewy. That's what I think here. Now with respect to this, I literally have no idea. I have no idea. And I also have to take a pause because Mel hit me up. Ooh, dinner order time. We can take the the tin foil off for this. So last night we did Indian. I'm thinking Mexican. She's voting",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "respect to this, I literally have no idea. I have no idea. And I also have to take a pause because Mel hit me up. Ooh, dinner order time. We can take the the tin foil off for this. So last night we did Indian. I'm thinking Mexican. She's voting for barbecue. So we'll see if I can we'll see if we can get Mexican. That learns as barbecue. That's a good idea. Sneals as Chinese. I like Chinese once in a while. The problem I have with Chinese is that it's just so damn salty. So damn salty. High food is good. It's just a lot of noodles and stuff though. Vladimir off-put and I don't know if there's like decent Japanese here. Generational capital says Korean barbecue. We're going to order it. So I don't really like Korean barbecue ordered here. So the other thing that I do want to highlight though is I've seen a couple other theories. One of the theories I saw people say is like, is this him again assuming that this was him just in this hypothetical? Is this him like selling or exercising the calls? That's not this. And it's one, it wouldn't be reported as this. Two, this would be it would be literally lighting money on fire, which I've seen him hold through some movement and not care. So he has that part to him. But I don't exactly think that would make any sense. Again, that's not what this",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "wouldn't be reported as this. Two, this would be it would be literally lighting money on fire, which I've seen him hold through some movement and not care. So he has that part to him. But I don't exactly think that would make any sense. Again, that's not what this is. I can tell you that. But the the idea of buying these calls and exercising them is literally just lighting money on fire. So I do not believe that that's what this is. Lance says chili Mac. Chili Mac's always good. I did like chili Mac. It's not bad. Jay card says, do you have you will not be the buyer in a quick seller to open the door and pump and dump exactly that's and that's my that's my gut feeling too. I really agree with that. Again, and I don't know. I'm guessing. It's just it's pure speculation. I'm guessing. But I just don't see unless he's testing something. I don't see anything in this for him. Like I don't see why that would make sense. Oh, sick. We're doing Mexican. Oh, yes. It's been it's been a minute. It's been a minute since I've had Mexican. I ordered the same thing. I'm like I said, when it comes to like food, I'm so boring because I just don't care that much. Like obviously I can taste good food, but I just really want the nutrients. That's about all I care. All right. So that's this. Now",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "I ordered the same thing. I'm like I said, when it comes to like food, I'm so boring because I just don't care that much. Like obviously I can taste good food, but I just really want the nutrients. That's about all I care. All right. So that's this. Now the other thing I wanted to do is to go back through some of his old traits and let's take a look. G 30 series says maybe he's just saying Chewie is dropping. I don't see that. That wouldn't really make sense, right? Because Chewie moved a bit before that and people can see the chart. So uh, age says, could he have pieced into the calls and smaller sizes over previous weeks to fly under the radar? Don't think he would have sold on the pump to be honest, but curious to see I could be, but I don't think so. And it's because I look at the GME options every day and for him to build anything even resembling what would make sense for him would literally take an eternity buying in like smaller 500 lot entries. And even even 500 lot entries, I would see those those still essentially pop up for me. It's the stuff that's like, you know, if you trading sub 10 lots, I would miss, but I literally go down to 10 lots. Also, cheers, more drugs. Now we have a set of medicine. And I think we're good with drugs now. Days",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "still essentially pop up for me. It's the stuff that's like, you know, if you trading sub 10 lots, I would miss, but I literally go down to 10 lots. Also, cheers, more drugs. Now we have a set of medicine. And I think we're good with drugs now. Days says, now this is my theory. I think he hasn't bought back GME as he want to hype, he want to hype to die out. The meaning posted had no correlation with GME, even one of his tweets. He said when I move, yeah, I and for I think I read that as days, but I don't know how to say that name, DASID, days, but I agree with you. Like that absolutely could be that absolutely could be the case. I wouldn't doubt it at all. You have to give me one second. I have to go let the dog in. Be back in like, like 32 second, no less than 32 seconds. You guys can time me. We'll be back in 27 seconds. I bet 27 seconds. Time 27 seconds time starts now. How do we do? I felt like that. I felt like that was pretty good. 34. Damn. That was much slower than I thought. Yeah, that was seriously 34 seconds. I move and slow. I move and slow my old age. Listen, I have a fucking pernated disc. Give me a break here. Apparently I need a break because I really thought that that would",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "34. Damn. That was much slower than I thought. Yeah, that was seriously 34 seconds. I move and slow. I move and slow my old age. Listen, I have a fucking pernated disc. Give me a break here. Apparently I need a break because I really thought that that would have been like a 27 second movement. That's unbelievable. Shame on me. All right, I'll do better next time. Hopefully not next time, but generation of capitals says it was the hat. The hat does add a lot of drag and these move a little bit. So you have to be kind of careful. Maybe you have to tighten these down, batten down the hatches. Don't like that. You guys can't see the amount of detail that went into this because there's even little pebbles like rocks that go around the top like this, which I think is pretty sick. I like my hat. It literally breathes terribly though. Masha says, don't do better next time you might tweak your back dog. I mean, I look at it as the back's already fucking tweaked. I just got I would show you guys the MRI. I've never seen one before. But the MRI thing was actually really, really cool. They gave me a disc and I like I could see my fucking organs and shit. I can see my whole spine. I mean, I don't know what I'm looking at. So I can't tell what's good. What's not. But it was",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "the MRI thing was actually really, really cool. They gave me a disc and I like I could see my fucking organs and shit. I can see my whole spine. I mean, I don't know what I'm looking at. So I can't tell what's good. What's not. But it was super cool. Like I literally have it here. It's really cool to look at. Ricky says Eric Ronnie Coleman can barely walk. You don't see him using his back as an excuse shaking my DM head. No. And I tell you what, Ronnie Coleman is like 10 million times the dude that I will ever be. I aspire to be like somebody like him. I've I've never seen somebody maintain such an amazingly positive disposition through like a pretty rough go. So yeah, that dude is that he literally is an inspiration to me. That guy's incredible. I think I actually do like think about him in a couple other people like that a lot every time I'm feeling sorry for myself. Like I was at the gym earlier today trying to do. I mean, I still work out every single day. Like there is no missing. I just have to modify. But the like I'm sitting there doing this bullshit stuff for my legs. Like I have to go so light. I can't I'm not using a barbell at all. And I'm doing like these little step down things. And I'm just sitting there, you know, again, feeling sorry",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to modify. But the like I'm sitting there doing this bullshit stuff for my legs. Like I have to go so light. I can't I'm not using a barbell at all. And I'm doing like these little step down things. And I'm just sitting there, you know, again, feeling sorry for myself. Like fuck, like I wish I could squat. I wish I could do this. And then I literally think about people like that. And I just think like what do I have to complain about? Yes, I have a leg. Yes, it doesn't work super great now. And it's in pain. But I have a leg. So yeah, people like Ronnie Coleman are straight up like literally inspirational. The dude isn't he's literally incredible. I I have nothing but respect for that guy. Incredible, dude. Ryan, whoa, I'll literally buy that book right this second. I've never heard of that book. Ryan just recommended a book. I'm always always looking for good books. The gift of injury, gift of injury. Who is this? Brian Carroll? Yeah. Yeah. 30 dollars. An expensive book. I still grab it. Damn, it's a big ass book too. What am I getting into? I just worded it. I will. Who gave me that recommendation? Who was that? Right. Right. CAC. Thank you for the recommendation. I will read it. And then I will report back. I'm always always looking for new books. I have to be honest though. I essentially only read the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "I just worded it. I will. Who gave me that recommendation? Who was that? Right. Right. CAC. Thank you for the recommendation. I will read it. And then I will report back. I'm always always looking for new books. I have to be honest though. I essentially only read the vast majority of stuff that I read is trading books. So there's that. But yeah, okay, back to GameStop. Enough about me. Nobody cares. Ricky says, Eric, are you like a millionaire? Just buy it. The I think that think, well, okay, couple of things. The first thing is just because I have money now, doesn't mean that all of my habits from not having it are gone. The second thing is you don't lose your value propositions in life. There's a way that you become wealthy and it's by having value propositions. So and I did buy the book. It apparently was slightly enough value to to win me over. But yeah, I'm still a discerning consumer. The stuff that I don't care about or don't really track are things that I need. Right. So like the door dash, I'm about to order. I like, I have no idea what it costs. And I don't care. I'll obviously leave a decent tip and send it up the door. That's it. Like don't even look at a gas. Don't know what it costs. Even here in California, really don't know what it costs. Grocer shopping. I don't do it. So",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "what it costs. And I don't care. I'll obviously leave a decent tip and send it up the door. That's it. Like don't even look at a gas. Don't know what it costs. Even here in California, really don't know what it costs. Grocer shopping. I don't do it. So it's stuff like that. I don't really care. But the yeah, stuff like that when I'm when I'm buying things like that, I still am of course I'm a discerning consumer. If you're not, you're not going to have money for very long. It will it will go away. Days said lend me a fiber. I don't think so. That's that's not the way to get money. It's like, I don't think that would help anybody. Masha says he has that car in the wall behind him. Yeah, that's one of the cars right there. Right there. So my mother-in-law painted that actually here. Take a look. It's she's like super, super talented. Take a look at that thing. She literally she literally painted that, which is incredible. But yeah, I love cars. I have that. I have the I have a McLaren that is like my first mid-engine car. I've never had one of those before that's been really fun to tinker with. And then like for a truck, I have a fort. I'm a gear head. So like I like cars. I like automotive is a lot. So Masha says I wish I wish I was half as",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "I've never had one of those before that's been really fun to tinker with. And then like for a truck, I have a fort. I'm a gear head. So like I like cars. I like automotive is a lot. So Masha says I wish I wish I was half as talented. It's nuts. The things that artists can do just straight up blow my mind. Absolutely blow my mind. Champion of roses says I have a sick. What kind of Corvette do you have? It's so the story behind the Corvette's kind of funny. I've told it before, but I'll say it again because I think it's interesting at least for me. The I did grow up poor, but the first time that I was ever around like a cool car, I was working my uncle let me work with him on some of his cars that he was restoring. And one of the cars I got to work on was a 64 white Corvette stingray. And as soon as I saw it, I was sitting there thinking like how cool it was. And I literally told myself I was like I'm going to get one of those one day. Like that was the new target. And I ended up getting it like four years ago, five years ago, something like that. Colonel says I'll swap you for my Bentley. No, I don't like Bentley's. To me, they're, yeah, to me the Bentley's are silly cars. Some of them look",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Like that was the new target. And I ended up getting it like four years ago, five years ago, something like that. Colonel says I'll swap you for my Bentley. No, I don't like Bentley's. To me, they're, yeah, to me the Bentley's are silly cars. Some of them look kind of cool, but they're not for me. James says I have a 1989. Oh, that's sick. What is that? Like a C4? 19 or C3? C4 I think? Yeah. These are with the flip-up headlights. These are super cool. Yeah, that's the C4. That's awesome. I love that. What a fun grab. Sweet. All right. So now let's take a look at some of roaring kiddie's old trades. So what I wanted to do is go through some of these and I actually wanted to look at the market like what it looked like at the time that he had these positions on. And I want to get a sense of kind of like what he was seeing. I literally want to rebuild these positions. So first things first, let's go into on demand and hopefully it works. I'm gonna pause. Okay. So it looks like a good start. It's buffering. So this might take a minute. We can kind of bullshit in the middle. Braimus says hello. I actually say hello back to Braimus and we've been hovering around like 200 people, which is incredible. Absolutely love that for those that are in the chat. I would love",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "It's buffering. So this might take a minute. We can kind of bullshit in the middle. Braimus says hello. I actually say hello back to Braimus and we've been hovering around like 200 people, which is incredible. Absolutely love that for those that are in the chat. I would love to know where you're chatting from. Last time you did this was super, super fun. What I want to do is find a way if there's like an app or something that can like as people say where they're at, I can poke like tap it in and then I could drop pins. Is there something like that? Hold on. Is there a website that I can type in locations that drops pins on all of them? Google My Maps? I've never heard of Google My Maps. Let's try that. Google My Maps. I've never seen this. Create new map. Create. GME live stream. Dave. I guess I just dropped stuff in. Is that right? All right. So first one I see is Las Vegas. At a marker. Next one I see is Ohio. Does he? It doesn't keep the other one though. Oh, you have to add it as another layer? That right. Uh oh. Uh oh. As you can tell, I have no idea what I'm doing. So there's one in Ohio. Let me get rid of this. Delete. And then so the first one was Las Vegas. At a map. There we go. Is that right? Yeah.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "another layer? That right. Uh oh. Uh oh. As you can tell, I have no idea what I'm doing. So there's one in Ohio. Let me get rid of this. Delete. And then so the first one was Las Vegas. At a map. There we go. Is that right? Yeah. Yo, technology is sick. All right. Now I'm excited. Massachusetts. At a map. We have Portugal. At a map. Portugal. Got it. Portland. Oregon. Portland's dope. This is sick area. Hollywood. Johnny, you're right by me. I'm in San Diego. What am I doing? I'm like talking and typing, which didn't work. Hollywood, California. Add. I guess I'll do mine. Believe in Hane. Add. This is cool. So I can save this and then I can add to it over time. This will be super, super fun. Bonner's fairy. Idaho. Yeah, that's cool. I never heard of that place. Idaho is pretty high on my visit list. I really want to go to Idaho. New Jersey. Where in New Jersey? New Jersey. Add to map. We got Kansas City. Add to the map. Arkansas. Add that. Bish Ottawa. Add that. Yo, this is nuts. Literally everywhere. TCM King is from Earth and then we're reminded that Earth is flat, which is good. Then we have Edmonton, Alberta. Where is that? What's the weather like there? Oh, it's North of Calgary. Interesting. I see Ventura. Okay, so we had a couple California peeps in here. Mission Viejo. Yo, that's like super",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Earth and then we're reminded that Earth is flat, which is good. Then we have Edmonton, Alberta. Where is that? What's the weather like there? Oh, it's North of Calgary. Interesting. I see Ventura. Okay, so we had a couple California peeps in here. Mission Viejo. Yo, that's like super close to me. We literally drive through there. Like going up to the mountains and stuff. Mr. off Putin, you're literally right by me. And there's two of you in Ventura in case you guys didn't know. There's Alicia, who's in Ventura and Chris is also in Ventura. Brahma says, do you think there are two more parties using swaps to keep the price of GME down? I don't know if they would be using swaps to keep the price down necessarily, but I definitely do think that they're using swaps likely for an assortment of reasons. It's hard for me to fully tell the purpose of the swaps because we can't fully see what's in them or how they're structured. I definitely think swaps are being used and I do think that they affect the price of GME. I just don't know how. Aviator Geek from Denver. I think Aviator Geek, I think my wife and I might be going out to Denver sometime in the next few weeks. See, Adel, we were out there not too long ago. Lost Luna's New Mexico. Dick. Alabama. Yo, this is crazy. There's literally, we have people from everywhere. Raptors is from",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Aviator Geek, I think my wife and I might be going out to Denver sometime in the next few weeks. See, Adel, we were out there not too long ago. Lost Luna's New Mexico. Dick. Alabama. Yo, this is crazy. There's literally, we have people from everywhere. Raptors is from Clifton. We already hit that one and we got Maryland. And nobody from New York. Interesting. Vladimir Off-Tuin says, if you don't go to Northern Idaho, Idaho, don't mention being from California. I'm not from California. I'm from New York, which might be even worse, but that's where I'm at. What the fuck, Braimus? What is this? Esther Hasey? This catcher one? What the fuck? Where is that? Oh, you're like way up there. I never heard of that place. Edmonton. I think we have that already up. Hungry says, I'm curious why RK would drop dog without moving to GME, though, considering the timing, the emoji chain and his awareness of the community. One guest he's going to cash getting ready for after ER. Yeah, I think that that's a really fair guess, to be honest. And it's because I agree with you. I think that it would be strange for him to rotate out of Chewy into something. And this something I would likely imagine would be GameStop. But I'm not exactly, I'm not exactly sure why he would make that movement. There's a lot of Heather Lee's way more than I thought. I thought that was going",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "strange for him to rotate out of Chewy into something. And this something I would likely imagine would be GameStop. But I'm not exactly, I'm not exactly sure why he would make that movement. There's a lot of Heather Lee's way more than I thought. I thought that was going to be way easier to find. Yo, there's two of you from Saskatchewan. In case you guys are friends, if you guys aren't friends and you probably don't want to meet one another, I guess, I guess that's kind of a dumb statement because the sketch one is also massive. So not great. Niaq, yo, Dershlup says, I seem the only person not being from North America. Yeah, I didn't expect that either. It's kind of nuts. All right, cool. So it looks like we got most of the participants in here. Let's take a look at our map. Check us out. So here's what we need to do. In order to complete this map, I think we need to get some people from South America. If you know any friends, we need to get some people from Africa. I would love to get somebody from the Swedish or Icelandic areas. That would be sick. That'll be on my hit list. This is perfect. And it literally saves our map. This is super cool. You see, I have a save that is GME livestream. So we Gucci. Paul says I'm in the Brazil. Hell yeah. Paul, I'm wearing Brazil. You",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "areas. That would be sick. That'll be on my hit list. This is perfect. And it literally saves our map. This is super cool. You see, I have a save that is GME livestream. So we Gucci. Paul says I'm in the Brazil. Hell yeah. Paul, I'm wearing Brazil. You Braimus says last question for me or swaps used as quote, unquote, as a ladder attacks. That's tough. So they're not necessarily used for that exact purpose. Rio de Janeiro. Add that. Perfect. So we got our first South America representative, which is perfect. We need that. Check out our map. This is where we're all from. This is sick. Love this. Whoa. Nick is here. Nick. That's perfect. And Shandy Netherlands. Sick. That's what I needed. That's exactly what I needed. In Netherlands, that honestly doesn't pop up on my radar too much. Maybe that's another spot I need to go because we really, really, really, really liked Norway and we really, really liked Iceland. On a Lulu, we got why? Yeah. So back to the ladder attack thing though, is could they be used as part of it potentially? But I don't, yeah, I don't really think that there's a massive likelihood that that's the primary driver or the primary input to what moves. Game stop. Holy shit. Y'all, there's no way I can pronounce that. Hold on. Let me see if I can throw that into like chat GPT. Who are? Hua Hin don't, no, don't, don't",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "there's a massive likelihood that that's the primary driver or the primary input to what moves. Game stop. Holy shit. Y'all, there's no way I can pronounce that. Hold on. Let me see if I can throw that into like chat GPT. Who are? Hua Hin don't, no, don't, don't do that. Don't do that. Don't Americanize your name. I'm gonna find, I'm gonna see how to say that. Hold on. You gotta tell me what's the annunciation of that. Oh shit. Okay. Hmm. I'm over my head. Try to search it. Oh, cool. I got it right. Hua Hin, sweet. So we got Thailand. Thailand. Thailand is a incredible spot. Amsterdam is sick. So there's two of you from Amsterdam, by the way, in case you didn't know me, to neighbor. We got Dallas. I was actually looking at moving to Dallas for a little while when we were exploring places. It got axed from the list for the weather. But yeah, sweet. Well, cool. I love where our map is at. We have really solid coverage, really, really solid coverage. We just need some African folks, which I still have some friends from Tanzania. We just have to get them into GameStop, I suppose. Warren Titty says, do you have Missouri? I don't think so. I have Kansas City. We have Missouri in here. So I'll add Missouri. Wait, I missed Oklahoma. Let me get me Oklahoma people. Perfect. Perfect. Wait, this will be fun. Oh, if we",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "get them into GameStop, I suppose. Warren Titty says, do you have Missouri? I don't think so. I have Kansas City. We have Missouri in here. So I'll add Missouri. Wait, I missed Oklahoma. Let me get me Oklahoma people. Perfect. Perfect. Wait, this will be fun. Oh, if we can get somebody in fucking Antarctica, how sick would that be? All right. Now, on demand has loaded. So now let's go back in time. So the first position that I see from him way back in time, this is from 8 sep 2019. 8 sep 2019. Let's see if we can go back that far. Damn it. We can't. That's annoying. So we can only go to 2021. Well, let's see. Is there do you, do you guys know if there is another charting tool that lets you go back to like a historic point in time and just look at the chart? Historic is there a website that lets you go back to a specific time on a chart? Vintage jeeps says Michigan. We got to add our Michigan people. I have a buddy that's in Minneapolis. Trading view, I don't know if I have. I don't know if I have a trading view account. I do have a Yahoo Finance account though. So this is telling me Yahoo Finance. Let's me do that. So we need a game stop and it says you can define a date range for the chart. Is that right? I don't use",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "if I have a trading view account. I do have a Yahoo Finance account though. So this is telling me Yahoo Finance. Let's me do that. So we need a game stop and it says you can define a date range for the chart. Is that right? I don't use this. I don't know if I can go back to the chart. Not all of it. Just want to. Here we go. Date range. Perfect. This is perfect. All right. So I said 8 sep 19. Is that right? 8 sep 19. Is that correct? That's August. I'm so used to doing military. So for me, this would be correct. But I forgot. This is the correct way. Okay. And then we'll go from there to. It doesn't let me go past it for some reason, which is interesting. Let's see what it look like there. And then I don't want to do mountain. I would like to do candles. And then let's do like a one year daily. Oh, this is cool. We don't need that. We don't need that. Sick. Vladimir off Putin says, toss does it with fundamental. Yeah, definitely. Just the toss doesn't let me go back far enough. Toss one only lets me go back to 2021. I want to see even though I won't be able to look at the options specifically that he had. I do want to see like just what things looked like when he was posting and like establishing these",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "back far enough. Toss one only lets me go back to 2021. I want to see even though I won't be able to look at the options specifically that he had. I do want to see like just what things looked like when he was posting and like establishing these these different positions. So the first question I do have for you guys though is this is the earliest position I can find for him. Is there anywhere else that he's posted that you know of that shows previous positions? Because if not, I'll start from here. But if we know somewhere that has earlier positions, I would love love love love to go to those if they're available. And then in the meantime, it looks like we need to add New York. Good old where I'm from. I will just do New York state. That we got Lancaster. EA. We'll add that. And Omaha. There's a Omaha's a vibe. Omaha is a vibe. So we're very US heavy. We have representation out in the North Pacific. We have representation in the Southern hemisphere through our friends in Brazil. All right. So it looks like this is the earliest that we have at least to go off of. We know at this point, this is where I mean, he already started scaling in here. So I see that he had a thousand shares at this point and then a bunch. Oh no, then not a thousand shares. That's my bad.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "we have at least to go off of. We know at this point, this is where I mean, he already started scaling in here. So I see that he had a thousand shares at this point and then a bunch. Oh no, then not a thousand shares. That's my bad. This was a thousand lots total across all these different things. So his recent his latest add to this position was on three. Step. Wait, that doesn't make sense. Yeah, no, it does. Three. Step. Let's go to three. Is there a way to draw there is? Oh, perfect. So we'll be able to this is perfect. So this can go here. This I can scoot over here. And I can look at each day that he entered. So the earliest was seven June. So that's as far back as we need to go. Yeah, this is perfect. So then here we'll just go back like six months. Three months. Six months. Okay. So seven June is here. I don't know how the drawing works. You have to forgive me for a second. There it goes. So there's seven June. There we go. Whatever it's fine. Vladimir off Putin says wouldn't a spreadsheet of historical data be easier? No, no, no, no. What I'm ex... Okay. So takes what I'm explicitly trying to do right now is see what he saw when he was putting the positions on. So what I'm doing is I'm flagging these different days so that",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "wouldn't a spreadsheet of historical data be easier? No, no, no, no. What I'm ex... Okay. So takes what I'm explicitly trying to do right now is see what he saw when he was putting the positions on. So what I'm doing is I'm flagging these different days so that I can like literally look at what things looked like. Wait, I'm in 2024? No, I'm not. Nick, why are you doing me dirty like this? Or did I not apply it? Ah, wait. Now I'm super confused. I see. I understand now. Holy shit, I'm stupid. I get it. I get it. So we want 2019. And then this is from the eighth of September. So we want this. And then we want it. Let's just go back to like June, which is like the beginning of that year. Or the beginning of his purchases. So we'll just go back to like May. There we go. Thank you. Zachary says, do you not have Newton's docs I do? Yeah, I haven't, I mean, I don't know where to find everything in there. If this is in there, this would be even easier. I'll grab his... Are you saying that this is in there? Yeah. Yeah, I'm happy to... Is this still wrong? This looks right. So I see one May 2019 to 8-SEP. Yeah, this looks correct. Down at the bottom, on the little pop-up on the Y-axis, it shows me 6-5-2019. So I think this is correct. So",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "this is in there? Yeah. Yeah, I'm happy to... Is this still wrong? This looks right. So I see one May 2019 to 8-SEP. Yeah, this looks correct. Down at the bottom, on the little pop-up on the Y-axis, it shows me 6-5-2019. So I think this is correct. So it looks like his first buy was on the seventh. Here. I need the drawing. 7th. And then the 20th. Here. Oh, that's annoying. You have to like click the box each time. Okay. And then the 17th. So this dude was averaging down hard. And the other thing that this tells me is that... I mean, some of this is actually kind of fascinating to be honest, because if you take a look at this buying behavior... Oh, man, this is fascinating. This is like standard trader behavior, man. So we bought it on both of these days. The 17th to 18th. And then he waited until the 14th. All the way down here. Wow, this is... I don't know how cool this is for you guys, but I have to be honest. This is very cool for me. The 20th. The 22nd. Here. The 22nd twice. Interesting. The 27th. And then the 3rd of 7th. Here. Interesting. Robo's... Hold on, I'm confused. BH Murdoch says his initial buys were based on the notion that GameStop was planning a share buyback. It was in one of his YouTube vids. Yeah, that makes a ton of sense. So here's what",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "27th. And then the 3rd of 7th. Here. Interesting. Robo's... Hold on, I'm confused. BH Murdoch says his initial buys were based on the notion that GameStop was planning a share buyback. It was in one of his YouTube vids. Yeah, that makes a ton of sense. So here's what I'm seeing. And this is kind of just like a starting point. But when I look at this, he bought it after a drop. And it looks like he waited for the drop a couple days. And then it looked like he maybe have bought it when it looked like it was starting to consolidate. Right? So kind of running sideways here. Then it kind of runs this gap up as it's coming down. He's buying again. Then as it's coming down more, he's averaging down. And here is when he starts putting on some of his, you know, closely time to trade day over day. And then here's when he starts putting on some of his bigger positions in terms of lots. Right? So here on the 14th, I can see that he put on 200 down here. So he was averaging down hard. Now the other thing I see is he started really light with his sizing 50, 50, 50, 50, 200. So that's a really, really, really massive, massive average down from where he started. Then he added another 100 here. And then he added 100 than 200. So 300 total two separate trades. The 200 was",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "see is he started really light with his sizing 50, 50, 50, 50, 200. So that's a really, really, really massive, massive average down from where he started. Then he added another 100 here. And then he added 100 than 200. So 300 total two separate trades. The 200 was added as it was going back up. So what I'm seeing here is a trader that's both averaging down and then averaging up. Which is really interesting because I have to be honest. That's something that I also do very carefully though. It's not something that I think works well for a lot of people. But what this tells me is that with whatever money he had in the account, 100,000 of the account, it tells me that obviously he was very convicted in what he was doing. And he thought he was getting even better value on his original thesis as it was down. So what I can tell you from that, that is still an investor mindset. That's less of a trader mindset. Way more of an investor mindset. And the other thing that tells me is that this is more of an investor mindset. Is these options were out in 2021. So he's buying these really far out in time. And then if you take a look at what his strike is, these are the eight calls. So eight for reference is here. Can I draw like a price line? Nope. I draw a price line. Oh,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "were out in 2021. So he's buying these really far out in time. And then if you take a look at what his strike is, these are the eight calls. So eight for reference is here. Can I draw like a price line? Nope. I draw a price line. Oh, it's there. There's our price line. So here's where he's buying. And then let's go back further in time. Well, this let me. This takes me back to today. Hold on. Let me go back here. I'm going to take this 2019 back to the first apply. And then I want to go back like six months. I think I broke it. Let me do this. Maybe I'll just do like six months. And then let's go to 19 again. And then this will go. There. And then here, let's go to 19. And this is fine. We're going to like September 30th. Weird. Not letting me. I don't know what the problem is with that. I feel like I'm asking it a fair request. Maybe I'll go back to May. It worked when I did it in May. Oh, was it before the stock? When did the stock launch? That's probably. I'm an idiot. When did. Wait, when did game stop go public? Maybe that's what it was. It's like I was probably just going back before it was even a thing. No, game stuff's been around for a while. In 2002. Weird. Yeah, that's super weird. Anyways, it",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "That's probably. I'm an idiot. When did. Wait, when did game stop go public? Maybe that's what it was. It's like I was probably just going back before it was even a thing. No, game stuff's been around for a while. In 2002. Weird. Yeah, that's super weird. Anyways, it works when I do this. So I'm just going to go from the first place. I'm going to go back to the first place. So I'm just going to go from the first of May to the 30th of September. It seems to like that. Just fine. Also shout out to the apes. There's 200 of you right now learning about roaring kitty. We got a new ham sure. All right, let me add that to my list really quick. New ham sure. I have a buddy that lives in Vermont. Okay. So this tells me with certainty, right? Conviction in the trade and doesn't care really what the price is as long as it's below whatever he thinks the price is going to be, which is obviously much higher. Okay, great. So the big takeaways for me when it comes to this one, start scaling in small, then gets bigger when the underlying gets to his eyes a better perceived value. Right? This is still very much an investor mindset. So now let's scroll up and see if there's any changes in the position and there's not. So now the day is September 11th. So let's go there. Which",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "bigger when the underlying gets to his eyes a better perceived value. Right? This is still very much an investor mindset. So now let's scroll up and see if there's any changes in the position and there's not. So now the day is September 11th. So let's go there. Which is we already have that September 11th is here. He posted on this day with his update. So now let's go up again and see if there's any changes. Nope. Same same. This is end of September. This release came out the 30th, which is here. So this is another, another really interesting thing is that he established this entire position all through here. And one, he was directionally correct to a pretty significant degree. And the market doesn't actually fully reward him for it. And some of that I think is because his options are actually decaying a bit. He has a lot of smaller options in here. So the ones that he really started getting in at cheap are obviously showing really massive profits. Right? So these ones he got for six grand and they're showing 23 grand. But one of the problems he's facing is that even though these options essentially doubled still, right? They he got in at 60 and they're trading for a dollar 20 or so. So still about doubling. But they're much much much smaller positions. So here, even he was very correct. I'm surprised that he didn't use more of his money",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "though these options essentially doubled still, right? They he got in at 60 and they're trading for a dollar 20 or so. So still about doubling. But they're much much much smaller positions. So here, even he was very correct. I'm surprised that he didn't use more of his money in here though. Let me double check that because something weird. Okay. That's weird. So I don't see any change in these positions. I have to make sure I'm looking really closely. But I notice his cash goes down. This is the same. This is not the same. You see? So did any of these change that I'm not missing 50 50 50 200 100 100 200 100 100? Yeah. 50 50 50 200 100. Yes. Okay. So there's no changes to any of these. So it looks like cash came out of the account for some reason. Yeah. Sadrick, I think he's on the I think he's on the I think you're on the right path. Yeah. Like he just that's a withdrawal. That's cash coming out of the account. Okay. So now let's go here. Still no changes. This is October 31st. So now let's go to October 31st. It still likes it. Great. So here, next update, no change. More money. 117. What? So part of my confusion here is there's 1124 1117K. A month later, he's still at 1117 solid with 11 added. So he has he added cash. But it's still up a ton. That",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "31st. It still likes it. Great. So here, next update, no change. More money. 117. What? So part of my confusion here is there's 1124 1117K. A month later, he's still at 1117 solid with 11 added. So he has he added cash. But it's still up a ton. That confuses me. Oh, nevermind. Okay. That makes more sense. So it's yeah. Okay. Sorry. That makes the ton of sense. My bad. I was really confused because this look like obviously a big run up from here. But that's why the position looks so similar to his September update is because if we look at the end of September here, it's essentially flat with worries at the end of oct. Okay. Makes sense. So now we go up. No trade still. End of November. Cash is out. And I see no new traits. So there's a withdrawal. So now let's update this. November. Okay. So here we had cash come out. And then here we had cash go in. Over the course of the month, not on that day specifically. Okay. Here we go. So now we have a new trade on 11 December. We now have a new trade. So again, on a big gap down. He likes to buy when it's dropping. What I don't understand though is why wouldn't he, ah, man, I just don't fully understand this. Let me go one more day so that I can at least highlight this damn candle. Oh, that's so",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "So again, on a big gap down. He likes to buy when it's dropping. What I don't understand though is why wouldn't he, ah, man, I just don't fully understand this. Let me go one more day so that I can at least highlight this damn candle. Oh, that's so interesting. I don't. Is that zooming in? That is. I'm just whoa, whoa, whoa, whoa, whoa, what have I done? All right. This is. Yo, hold on. I've just messed everything up. There we go. Okay. So now it drops and he buys another hundred. And here's another thing I see. The account value is up to 230k. And if fucking drops to 63,000, it gets murdered. So a big reason. And it's funny because again, this is the world of options. Is because even though on 11 December, it's still much higher than where it's been for him. Right. So if we look at 11 December, it's essentially higher than all of the bulk of his buys. Vladimir off Putin says April 2020. I'm trying to save you time. Save my save me time with what? This is Mr. off Putin. This is what I'm trying to do with my time. I'm trying to the whole again, I'll reiterate the whole point of doing this is to look at the movements he's making and what it looked like when he made those movements. This is something I call fingerprinting. So the whole idea behind this is again, I have",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "my time. I'm trying to the whole again, I'll reiterate the whole point of doing this is to look at the movements he's making and what it looked like when he made those movements. This is something I call fingerprinting. So the whole idea behind this is again, I have zero intention personally of trying to model any specific trade after roaring kitty. I would never trade off of somebody else personally. I'll use some of their movements or research to fuel my ideas. But I wouldn't necessarily just try to follow him. What I'm interested about though is the way and the buying behavior that he has, because roaring kitty as a character is absolutely unequivocally fascinating to me. The things that he does and the reasons why he does it is crazy. It's just so interesting. That's the whole point here. There's honestly no, this is what I'm trying to do. There's not saving me time. This is precisely how I want to spend my time in this instance is to take a look at these exact things. Let's actually read some of these in between these. I haven't been doing that. What do you think it should be? Let's see. Let's add that. I'm going to get rid of... Let me close some of these. Just let it have some room to move. Okay, so that's gone. Zachary says, when did the CARES Act allow you to pull from retirement? I don't know much about that. Mike",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "be? Let's see. Let's add that. I'm going to get rid of... Let me close some of these. Just let it have some room to move. Okay, so that's gone. Zachary says, when did the CARES Act allow you to pull from retirement? I don't know much about that. Mike Wells says, roaring kitty started July 13th, 2020 on YouTube. In Nove on X, he breaks it all down for you if you have 100 plus to watch. You mean like in terms of his methodology? Yeah, I've watched some of his videos. I haven't watched all of them yet. Thanks. So he's talking about, again, he's still talking value investor standpoint, trigger a version to fair value. Still recast positive. Again, that is very, very standard value investor. Console refresh can't save GME, but it helps to stabilize decline. Right? So this is... Wednesday, December 11th. So he's obviously talking about this drop here. Right here. What's a better name to be long? So obviously supremely convicted. What kind of chart... Looking all the time, I'm a fundamental value investor through and through. Aha. So this starts to make sense to me because it says I'm a fundamental investor through and through, but I've come to appreciate how charts can telegraph information to investors. I use mostly for screening and timing, which is really interesting, because this also lines up a little bit with some of the behaviors I saw with respect to some of his videos that talk",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "through and through, but I've come to appreciate how charts can telegraph information to investors. I use mostly for screening and timing, which is really interesting, because this also lines up a little bit with some of the behaviors I saw with respect to some of his videos that talk about specifically his move from being a value investor, a quote-unquote, which happened in the more recent YouTube videos. So this is fascinating to see even this starting to creep in, right? Like, so fundamental value investor, but now we're talking about an appreciation for charts, which makes a ton of sense, but this is on 11 December. So, very, very cool. I look at charts of many companies, not just GME. So this is the 12th. So still around this time frame. So far, but that's irrelevant. Yellowed me for being dumb or being town voted. Who cares what it's done since 2018? What matters to me is what it does in 2020. Since August, GME is up more than all of those companies. Here, he's still defending and talking about his thesis, which also tells me a lot, to be honest. It tells me that he's still, let me see if I can see the top comment here. He's still diving into a little bit of like why he's doing. I've always respect for iron hands, no matter how retarded they may be. This guy does there's some kind of flair. Buries top or bottom. So are you",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "me see if I can see the top comment here. He's still diving into a little bit of like why he's doing. I've always respect for iron hands, no matter how retarded they may be. This guy does there's some kind of flair. Buries top or bottom. So are you belonging here? You're real determined to make that, wow. This is fascinating. I didn't realize that people were like, like this towards him. This is interesting. Perfect. Oh no, child, what does you do? And that's a great comment. That's hilarious. Do just what the fuck so many names to be long and you do this. They cut EPS guidance by 90 what the hell is your both thesis here? That's this is actually a great question though to be completely honest. Like this part is, you know, whatever. But this I this I think is interesting. What's a better name to be long? SPX, Google, Apple, Tesla, all these names. Who cares what it's done since 2018? What matters what it does going forward? GME will be lucky to make it through 2020 without receivership. You believe bankruptcy is on the table for GME? Interesting. Yeah, this is fascinating. The the thing I'm really enjoying right now is seeing the way he still discusses like his thoughts. Vladimir says arcade didn't move the stock then he was dist. Yeah, yeah, it's crazy. Because the thing is I get Wall Street bets is what it is. And again, like the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "The the thing I'm really enjoying right now is seeing the way he still discusses like his thoughts. Vladimir says arcade didn't move the stock then he was dist. Yeah, yeah, it's crazy. Because the thing is I get Wall Street bets is what it is. And again, like the other thing that I absolutely would poke fun. Again, like not knowing the future, but I would poke fun or you know, identify for somebody like Rory and Kitty is like, it is nuts to put your entire portfolio into calls in something like GameStop at this time. Like that is such a wild thesis. Again, it can work out but to be that concentrated, I think it does make sense for Wall Street bets, right? Like that is truly a yellow bet. But I think the difference is is when I see the cat talking about his ideas, he's like really getting into detail on like the the background. It's not like he's just throwing money into some shit, right? Like he saw something that he truly felt was an opportunity. Now again, for everybody else that looks at this and they start thinking like, oh, you know, like I'm going to be the next roaring kitty. I think it's cool to think that way and it's cool to desire that kind of stuff. The problem though is that it's a really, really, really low problem. It's kind of like trying to follow somebody into winning the lottery. It's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "I'm going to be the next roaring kitty. I think it's cool to think that way and it's cool to desire that kind of stuff. The problem though is that it's a really, really, really low problem. It's kind of like trying to follow somebody into winning the lottery. It's very difficult to do because again, like I look at this and I see roaring kitty was really convicted and the thesis played out. It worked beautifully. Super high risk though, like super high risk. There's no there's no other way about it. It's just interesting. All right, so let's see. What degrees is priced in? Yeah, okay, let's get to the next one. Okay, so we added more here. This is perfect. So this was 31D's 19. And on shit, it doesn't tell me. Damn it, kitty. Yeah, did a bunch of shit. Damn it. So he has 21 fab. So he got busy here. He got real busy here. So I can't tell exactly what the timeframes are just yet. Jonathan says, remember it's 401 stocks split when looking at the price. The main thing I'm just talking about is I can see the total number of contracts changed drastically. Right? So I see 600 here, 600 here, 400, 400, 200. Whereas down here, I see 1100 total. So when I say that he got busy, he just started putting on a bunch more options trades in different explorations. Now the the slight downside is he doesn't have",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "changed drastically. Right? So I see 600 here, 600 here, 400, 400, 200. Whereas down here, I see 1100 total. So when I say that he got busy, he just started putting on a bunch more options trades in different explorations. Now the the slight downside is he doesn't have those open. So I can't see exactly what happened. So what I will do is fast forward us a little bit more. We'll go to like the end of January. And then essentially for from this point in December. This region, I know that he bought a bunch of options. I don't know when what went on. But again, looking at this from his perspective, as this is moving, we're buying in as it goes down, it goes down, then it's rallying up. As soon as it drops again, he starts buying again. And then if I had to guess when he was adding more to this, I would guess it's on these days. That's my guess based. And again, this is just part of fingerprinting. This is starting to get a feel for when he's putting on these bigger positions. That's my guess. And then my guess is we'll see him transact more in mid-Jan 2020. That's just a guess I don't know yet. So let's actually see. But let's see some of these updates in the meantime. How do you question? There it is. Finally, I was wondering how to just see the top comment for these things.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "see him transact more in mid-Jan 2020. That's just a guess I don't know yet. So let's actually see. But let's see some of these updates in the meantime. How do you question? There it is. Finally, I was wondering how to just see the top comment for these things. What's your read on last earnings release? I know you added more after they cut EPS for, wow, look at this. He's down to 112. He absolutely got crushed here. Damn, I didn't look at the cash. I'm just looking at the cash real quick. So like, less than a grand, 20 grand. And then we're here now, six grand. So he used a bunch of it. All right, so let's take a look at um, Day Swags is just stopping in and I'm out celebrating my friend's wedding. But I love you all. Have a good night. Great to see you. Day Swag have a killer time. My dude, enjoy it. Freemak-free or since says I like your muscle man. It's just a tank top. Like a standard, a standard tank top. It's hot here in California right now, man. It's like 90 degrees plus. Okay, so back to this though. What you read on last year are cut EPS guidance from like 115 to 0.2. So this is where we're talking about like a really, really, a really big drop. And then it says, Okay, so let's see. Sandbagging yes, it's possible 30 to 40 chance. Okay. So",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "this though. What you read on last year are cut EPS guidance from like 115 to 0.2. So this is where we're talking about like a really, really, a really big drop. And then it says, Okay, so let's see. Sandbagging yes, it's possible 30 to 40 chance. Okay. So what they're talking about here in terms of sandbagging it is trying to guide down and to try to slow things down. Based on the incredibly aggressive share repurchasing Q2, sentiment expressed on the latest CC, the decision to sell their, their corporate jet. Management is now showing their cards. They're on the side of the shareholders. Yeah, I agree. This is, this is man, very, very prescient of him. So this tells me with like again, we are like full, deep fucking value. Like that's this is this type of conversation is completely, completely wrapped in value investing. Reclassification latest 10 Q. Yeah, yeah, yeah. Of course, it's possible simply underestimate the degree of cyclical, secular design such an extreme fashion. Yeah, yeah. Next gen consoles won't be released until 2020 Q4. Okay, so just talking about general general picture there, fascinating. Okay, so we know this period he got, he got busy. He built a lot. Take a look. So mostly this is so funny. So like to see the mutation of his character is just epic, right? Like a lot of discussion points, a lot of like arguing, so to speak back and forth, right? So fair",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "got, he got busy. He built a lot. Take a look. So mostly this is so funny. So like to see the mutation of his character is just epic, right? Like a lot of discussion points, a lot of like arguing, so to speak back and forth, right? So fair point, but I'm sure you'd agree it's not uncommon for analysts to forecast poorly, right? So he's like talking about his things and then like take a look. It just starts going more and more into just memes and gifts. Okay, so what happened? Oh, damn, got murdered. Jan 2020, end of month. 31, Jan. Okay, so that's where we are now. Did he do anything? I would really think he would do something in here. 4, 4, 6, 6, 5, he did. He did. No, he did not. Wait, he did. Or did these come off? The 17, Jan's rolled off. I see, okay. So 17, Jan's, my guess is those just probably came down for, yeah, these were worth nothing at the point. They were worth like a hundred bucks. So it looks like these we just kind of took into expiration. And then I realized I have to send our dinner order off. Perfect. All right, so we got a little bit before that shows up. I am thoroughly enjoying going through this. This is absolutely incredible to me. Yes, so it looks like he just let those go. And he didn't do anything here that shocking.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to send our dinner order off. Perfect. All right, so we got a little bit before that shows up. I am thoroughly enjoying going through this. This is absolutely incredible to me. Yes, so it looks like he just let those go. And he didn't do anything here that shocking. So 64 hundred bucks there, 64 hundred bucks there, just sat on the cash. Very surprising. And a Fed. Here we go. So now we can finally see where some of these others came on. So now he's down to 183 bucks. So let's go to the end of Fed. And I see 4, 6, 6, 1000. Or so then obviously these feds came down for a loss. And then we were left with these like the April's, the July's, the Jan's. And then the April's of the next year should be right. So April's July's Jan's April the next year. Yep. And it looks like he built into this. So when did he buy, buy into this, the 31st? Oh, okay. Yeah. So he did start buying him when I thought he would. I was really, really surprised that it didn't look like he did. So these 16 April's started going on the 31st of December, which is here. And then on this tiny little candle, you literally can't even see it. And then he started scaling in more on the third, which is here on a down day. And then in 2020, we have February 18th with three",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "started going on the 31st of December, which is here. And then on this tiny little candle, you literally can't even see it. And then he started scaling in more on the third, which is here on a down day. And then in 2020, we have February 18th with three separate transactions all at 20. February 18th. I gotta grab the box again. February 18th. Okay. So the account is not doing well. So these longer term options that he got back here are decaying. Okay. So let's see. A bunch of gifts started at a Hyundai. He was up over 200, 200. Now he's down to 40. Okay. So he's kind of defending himself a little bit there. Okay. So April of 2020. We'll go to the end of April. Michael says, can you add RSI and MAs? Yeah. What, well, I don't know what it will let me add. Indicators. Oh, wrong one. My bad. Click out. Nope. My bad. RSI. How do I remove this one? There we go. Mac D kill that. Yeah. Generational timing says, how many options do you think expired worthless during this time? It's a great question. So a lot. So if we do like a quick stroll through, we had 17 Jan 21 fab and then April of 20. And that was 244. And we got in for eight plus 16 grand there. So the Jans came off for probably nothing. The 21 fabs about to come off for nothing. And",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "we do like a quick stroll through, we had 17 Jan 21 fab and then April of 20. And that was 244. And we got in for eight plus 16 grand there. So the Jans came off for probably nothing. The 21 fabs about to come off for nothing. And then the 17 Aprils. We'll be coming up soon probably for nothing. Yep. So those are gone for nothing. So at least at least 16 to 20 grand. Something like that. I think like that. Yeah, because the interesting part is some of these were showing a really healthy profit. Okay, so let's see what happened in here on the 30th of April. We have 17 July, 17 July, and then April 16 April. And then let's go here. July, Jan April. Oh, did I just miss read that? Is that Jan? No, interesting. So, oh, interesting. So these came off. So he has 15 Jan 21 eight calls. Those aren't here. So he sold them. And these are for 2021. That's interesting. So was it just to unlock this money? Yeah, because he had the bulk of his capital in this 26 grand. Of lot of me says there's another position post you need to click on start of short squeeze. Okay. Where's that at up here? This one. Okay. Yep, thank you. So April July July. Okay, so we still got rid of that jam position though. So this is 14 April. This is 30 April. So now",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "another position post you need to click on start of short squeeze. Okay. Where's that at up here? This one. Okay. Yep, thank you. So April July July. Okay, so we still got rid of that jam position though. So this is 14 April. This is 30 April. So now I know. Oops. Now I know that between here. Which is Feb. Here. Somewhere in here. The end of Feb, he had these 15 Jan 21's. So the end of Feb, which is here. Let me zoom in. End of Feb is right here. So at the end of Feb, he still had these 15 Jan 21's. And then I know within. What the 14th was there not a March update? Did I miss a March update? Feb. So there's no no March update. It's just April. So then by the 14th of April. So here. He sold some. And this is still a little bit before I can look in on demand and think or swim. I can figure out. I can figure out if we want you tell me if we want to know what the options we're trading for here. I can. I can find what those Jan. I can find what these were at. So we got them for 47 cents or 44 cents. Yeah, so we got in at 44 cents. When did these Jan's get added though? 15 Jan, they're there. 15 Jan, they're there. So this is one of those first tranches, I",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "Jan. I can find what these were at. So we got them for 47 cents or 44 cents. Yeah, so we got in at 44 cents. When did these Jan's get added though? 15 Jan, they're there. 15 Jan, they're there. So this is one of those first tranches, I think. Yeah, 15 Jan, they're there. 15 Jan, they're there. So this goes all the way back. These are like some of the first positions he got into 11 December 19. 15 Jan, yep. So this might be like one of those literally the first positions he put on. Yep, these are the first positions I see. So these are from all the way back September 8th. So the reason why that matters is because we've go back to September 8th wherever these were added. He would have made some money, but he actually wouldn't have made a ton of money on those January calls. So I'm actually really interested in understanding a little bit more about the the sale decision there. Because he still had time left on those options. So that's that's just an interesting point. That's a really interesting point. Okay. You server still, we still got to catch up here. Okay. And 2025, 2020 were a prior. Man, we made it through a lot of these. April, May, the Zal. Okay, so this is where we're at now. Interesting. We can kill that. So a couple of things surprised me here. One of the things, let's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to catch up here. Okay. And 2025, 2020 were a prior. Man, we made it through a lot of these. April, May, the Zal. Okay, so this is where we're at now. Interesting. We can kill that. So a couple of things surprised me here. One of the things, let's see. So this is, we've added shares at 406. End of May. Okay, so we'll have to get to the end of May. Let's move this. May 31. We'll go. Oh, fuck, my bad. That's fine. We have to go to May here. Okay. This looks like, yeah, this is 2024. Yo, let me go back. Oh, it's doing this weird shit again. June. Let's try June to June. Damn it. It was going so well. I had all the rules quirks figured out. So from 2019, we'll start from there. That's fine. We'll start from right there. And then this will be 2020 now. And we need to go to May. Not let me do it. Damn it. Maybe I'll try just doing 2020. Yeah, so maybe we'll try like 0101 2020. I have to put the slashes in there. Keep bastards. Let's try that. And then we'll try to go to 2020 here. And let's try to go to like the end of June. Won't let me. What the hell? Damn it. Why won't you let me do this? Maybe I'll go to like May. Damn it. Damn it. Damn it. All right. So then I guess what",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to go to 2020 here. And let's try to go to like the end of June. Won't let me. What the hell? Damn it. Why won't you let me do this? Maybe I'll go to like May. Damn it. Damn it. Damn it. All right. So then I guess what I'll just do is see if it'll let me look at like 2020 in total or something. Nope. I'll just refresh and go back in time. Yeah. And then I can just scroll on zoom in. This is fine. Can I not do a one daily interval? Okay. All right. So let's go back. I think we're on a now 22 21 20. Okay. Cool. We're back at it. Little technical difficulties with this platform, but we got it. Okay. So now it's the end of May. And we have shares now at 406. And as we pointed out, this is obviously before we had the splits. So this would be split adjusted. And we have July 20 calls at six and 12. So he's still going really far out of the money. He's buying cheap options. 150 grand 88K and cash. So he's over half cash. So here you go. Yes, I took some profits the same day. Burry as it turned out, been buying the recent dip, new strikes, expectations. Robo says that he exercise. I don't think so. The thing is for people that buy calls, it is generally inefficient to exercise. You normally don't want to.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "go. Yes, I took some profits the same day. Burry as it turned out, been buying the recent dip, new strikes, expectations. Robo says that he exercise. I don't think so. The thing is for people that buy calls, it is generally inefficient to exercise. You normally don't want to. There's only like specific circumstances where it would be logical or makes sense to exercise. So now end of June. Interesting. All right, I'm going to take a note so that I can pause us here and then we'll pick up on this. The last thing because I have to hop off in a few minutes. But what I want to do is just take a quick look at GameStop as it sits today so that we don't run out of time for that. So then I'll take a note on June 2020, Yolo update left off. Okay, positions. Part two. So then I'll set a note for myself that essentially come back here. And then next weekend we'll finish going through this. But I do want to make time at a link. There you go. Cool. Chris says, how many viewers did you have at your peak on this live stream? Yeah, let's see. It looks like we're a little bit lighter now because we've gone through for a hot minute. It looks like like 230 I think is what we hit at the max. Mr. Demel. Great to see you by the way. It's been a minute. Yeah,",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "live stream? Yeah, let's see. It looks like we're a little bit lighter now because we've gone through for a hot minute. It looks like like 230 I think is what we hit at the max. Mr. Demel. Great to see you by the way. It's been a minute. Yeah, we had 230. All right, so oh boy, that was a mistake. Sorry. So now let's take a look at what this looks like. Let's take a look at what this looks like today. Because the options change now. We're coming into earnings. Yeah. BH Murdoch says you miss like seven Chicago peeps. Yeah, let me add them really quick. I have don't don't you worry. I have our handy dandy map ready to go. Chicago. Oops, didn't mean the airport. We don't want that one. We want Chicago. Got it. And then Toledo got it. Holy Toledo. I don't really know where that saying comes from. Perfect. So we got those two added. Thanks for the heads up. All right, let's take a look at some GameStop as it sits today. So it has earnings coming up. It's still currently holding for 10th after the close. And right now for me, it's in a very heavy consolidation. Now, I did tell you that I would talk a little bit about how I traded it for this move. So essentially what happened when we started seeing those trades come through it like 840 to 850. I started building a position",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "for me, it's in a very heavy consolidation. Now, I did tell you that I would talk a little bit about how I traded it for this move. So essentially what happened when we started seeing those trades come through it like 840 to 850. I started building a position not for the front week because I actually was expecting to run this position for a little bit longer than I ended up running it. But what I wanted to do is gain exposure to the near term momentum that I was expecting in GameStop after seeing those two trades come through. So it was like the very, very beginning part of building a position. So what I ended up doing, this is my pass through account. So there's nothing in here. But what I ended up doing was going out past, past earnings, but not out too far because I really wanted to try to just let these options compound a little bit because I already have a little bit of a longer term position. So what I did was I went out into the 20-sep and I went slightly in the money. So I bought two different tranches of those like right around like 850, 855. And then I sold one of those tranches essentially 915 when I saw this start coming down and I still have another one of those tranches that I'm expecting to hopefully hold on to for a little bit. But it's mostly going",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "of those like right around like 850, 855. And then I sold one of those tranches essentially 915 when I saw this start coming down and I still have another one of those tranches that I'm expecting to hopefully hold on to for a little bit. But it's mostly going to be a like tightly managed trade because they're still showing a profit right now. And if we have a gap down, I probably would exit those because they're a little short term for me. I prefer slightly longer term options. But that's essentially how I played this like just near term pop that was relatively small. Dom says Eric, YouTube ringdinger, I have said I could too and it's supposed to help tremendously. Yeah, I'll definitely take a look. Thank you. Yeah, like I said, I had that MRI Friday. So I think I'm probably going to try to get that quarterstone shot or something. That's the idea right now. So we have Minnesota that we have to add. And then we also have Arizona. My brother is in Flagstaff. We have to add that. Then we have Ireland. That's actually on our travel list. I had a road trip planned out for us essentially going from Belfaster, Dublin and going along all the way along the coast down here. So that might be that might be on our on our radar. And there says Vancouver. Yeah, let's grab Vancouver. I was just there not too long ago. I",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "trip planned out for us essentially going from Belfaster, Dublin and going along all the way along the coast down here. So that might be that might be on our on our radar. And there says Vancouver. Yeah, let's grab Vancouver. I was just there not too long ago. I like Vancouver quite a lot. A lot of drug people. Maria, you could tan. We got our Mexican peeps here. Sweet. Building our chart out. All right. So earnings coming up. Let's take a look at these options. 240. So massive, massive, massive, massive call skew right now, massive call skew. And it looks like a lot of them now are just from a volume perspective, just tons of calls traded. This is obviously on Friday. And then open interest. We had left off at 537 to 266. So we had a lot come out. But my guesses will see a lot coming in. Because when I look at this, my guess is most of these, you know, 13-septraids were probably opening positions to gain exposure for the next trading week. That's what I'm expecting most of these to be opening up. So then looking at the vault, we have pretty high vault 18837 for the front expiration. It's not astronomical. And then it drops off 155133. So definitely seeing some earnings of all being priced in. And if we take a look at this chain before everything from last week cycles over, we have a bit of depth at",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "pretty high vault 18837 for the front expiration. It's not astronomical. And then it drops off 155133. So definitely seeing some earnings of all being priced in. And if we take a look at this chain before everything from last week cycles over, we have a bit of depth at the 24's. The 22 and a half's got hit with a lot of volume. So previously, not a lot of change in OI. So this will be a lot of building volume, I think. And then I see same thing for the 23's. There's more volume than OI. So people are building into those. I see the same thing here for the 24's. Definitely the same thing for the 25's. So there are a lot of people building out in this 13-sept expiration. And if I take a look from the put side, it's not quite the same style of build out, but they're definitely as put build out as well. So let's take a look at just the vault surface really quick at a curiosity. And then I want to use just these front ones. So I'm still not seeing that same style of really, really massive volatility skew to the upside. So that will happen sometimes in game stop specifically. But I'm not necessarily seeing that here. I do see this kind of peak. This is just again like a tradable relative value thing at 1550. So that would be on the put side. And yeah. So the",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 108,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "to the upside. So that will happen sometimes in game stop specifically. But I'm not necessarily seeing that here. I do see this kind of peak. This is just again like a tradable relative value thing at 1550. So that would be on the put side. And yeah. So the otherwise looks fairly normal with a little bit more tail side. But if you take a look at 20 sep, it's the inverse. This is actually the interesting thing. So normally this is what you'll see for a volatility smile. This is kind of a surface because there's multiple lines, but this is more of a smile. And this is just looking at the put side because we're looking at the out of the monies. And you'll see that the put side is pretty high. And the highest put side is higher than the highest call side. Right. So then when I look down this though, I can see for the what is this? The 20 sep expiration. It's actually a slightly different story. And we see that the call side actually exceeds the put side, which is just generally interesting. That's typically the market pricing in a bit more of an upside move. And we can see that the strikes out here right now are going out to the 50 on the 20 seps. So it doesn't look like they have the, let me do all of these really quick. Yeah. So that right now the strikes out there",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 109,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "of an upside move. And we can see that the strikes out here right now are going out to the 50 on the 20 seps. So it doesn't look like they have the, let me do all of these really quick. Yeah. So that right now the strikes out there are only going out to 50. They're not doing like the 125 to the 150s again. So Tanner says regarding potential D.F. V pump and dump is a reasonable to think that the participant with short exposure that doesn't want it to pop would short those calls are not no, they wouldn't short the calls because by shorting the calls themselves, they kind of put themselves if they don't want something to pump quote unquote, they really would put themselves in a disadvantageous spot. And it's also not enough to really offset that because when somebody buys those calls that are at the money, the market makers are going to see the order come through before it's on, right? So the ones fulfilling the order. So they would either decide do they want to run with them or do they want to hedge the trade and they probably would hedge the trade. And because it was a short term thing, they probably would have used stock. But right now there's still an abundance of stock in GameStop. So yeah, I don't really think that that's what we saw on the opposite side there. I my best guess is from that",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 110,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "the trade. And because it was a short term thing, they probably would have used stock. But right now there's still an abundance of stock in GameStop. So yeah, I don't really think that that's what we saw on the opposite side there. I my best guess is from that trade, it looks like whoever bought them unwound them. That's what it looks like. And again, that's why it's slightly confusing to me. Because the person I would assume to buy them would be Roy and Kitty, but that I wouldn't assume that to be his move just looked insignificant at best for somebody like him. So not sure. Now coming into earnings though, if we take a look at some of GameStop's previous earnings moves, and we can see that it tends to maintain some level of risk premiums. And I see, so from this is me talking as Eric, the options trader, this is a normal event that I try to trade earnings releases. And this earnings got all messed up. This earnings has pretty elevated vol 120. But it's not as high as some of these other vols. 140. So my guess is the vols here might come up a bit. But it typically maintains risk premiums through. So yeah, this is interesting from a volatility trading perspective. Let me look at one other tool really quick. They have like a slightly tricky login process. So I have to get like a verification. I we in. Let's",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 111,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "come up a bit. But it typically maintains risk premiums through. So yeah, this is interesting from a volatility trading perspective. Let me look at one other tool really quick. They have like a slightly tricky login process. So I have to get like a verification. I we in. Let's take a look at GameStop. Then let's take a look at earnings. Okay, so it's average implied move is 12.9 and it's average actual move is 13.5. This is for the past 12. Earnings releases. And it tends to fall within range for the expected move, except for the last one. Because the last one got so contorted with the timing in June. So right now it's implying what do we see like almost an 11 or 12 move, something like that. So I mean, this looks like a really interesting earnings trade. For me, the approach here is kind of standard fair. It'll be maintained exposure via the long shares, play the options if they start coming alive. It's a little early, but I see a few things going on that make me happy. I see a big big bump in buy volume, right? If you take a look at this candle, take a look at the volume on that day. Again, when we go back to all of these prior really big moves, there are things like this. So if I look at the volume that we saw on Friday, it was 24 million, right? And the 20",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 112,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "at this candle, take a look at the volume on that day. Again, when we go back to all of these prior really big moves, there are things like this. So if I look at the volume that we saw on Friday, it was 24 million, right? And the 20 day average was 6.5 million. The five day average was 12 million. So it's essentially double the average volume for five days and a droople almost not quite triple plus. On the average for 20 for 20 days. So if we take a look at some of these preceding kind of jumps that we've seen just in terms of volume that's starting to get interesting. So I'm really, really curious how this volume plays out. Some of it will be for earning. Some of it will be from that news, but it wouldn't surprise me to see some level of follow through because again, these kinds of jumps in volume mostly by side volume starts to, again, peak my interest. I also see from a general oscillator perspective, all the oscillators are starting to ascend. So it looks like it is starting to grab a little bit of traction just in terms of developing a level of momentum. So yeah, I mean, it looks interesting. I need to see what the options look like once the volume from last week is factored in, but it looks like most of the people are positioning for this coming week. So we have",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 113,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  },
  {
    "text": "in terms of developing a level of momentum. So yeah, I mean, it looks interesting. I need to see what the options look like once the volume from last week is factored in, but it looks like most of the people are positioning for this coming week. So we have to see how earnings go, but I am absolutely excited to see it. All right, gang, I think this is my longest stream I've ever done almost three hours, but it goes by in a blast for me. I love talking about this stuff. I love exploring the market and specifically GameStop with the apes out there. So thank you for taking the time to teach me a little bit more about this and help me explore it. It's super, super fun. I love doing it. So thanks everybody for hanging out. We had over 200 people, which is so sick. Love that. Hope everybody has an absolutely awesome weekend. And as you know, I do live streams every single day at 5 p.m. Pacific time. So I will see you at another live stream. Catch you all later. Be an outlier. See you guys.",
    "metadata": {
      "video_id": "yjH-ap6hG0Q",
      "title": "Analyzing Roaring Kitty's Trades | GameStop Analysis Live Ep9",
      "url": "https://www.youtube.com/watch?v=yjH-ap6hG0Q",
      "upload_date": "",
      "duration": 9947.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 114,
      "total_chunks": 115,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yjH-ap6hG0Q&t=0"
    }
  }
]