[
  {
    "text": "Hey everyone, Eric here with a few updates to the small stacks portfolio. So I wanted to give you a couple of updates on some trades that I made, and then just some new adjustments kind of to the overall approach. So let's take a look at the screen here. First off, I talk about most folks first year trading, and I always say that the main goal should be consistency and being profitable. Okay, so that part aside, what I wanted to do is set some goals now that this account's been trading for a couple of weeks, we kind of have an idea of what this looks like for us. So the first goal that I think is reasonable if I were to give myself a goal starting out again with the 5,000. I would probably target something like 8, I think is fair, and then my stretch goal would be 15 for the year. And the reason why I like those, really that that 8 is smaller accounts have a hard time returning kind of meaningful amount of money. So that's why I want to focus on the percent, not so much the dollar amount. And the reason why I say that is because, you know, if you look at returning 8 on a 5,000 account, it's four-ner bucks, you know, who really cares, same thing at 15. And then what I even did is broke that down to a monthly target. So if I wanted that",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "reason why I say that is because, you know, if you look at returning 8 on a 5,000 account, it's four-ner bucks, you know, who really cares, same thing at 15. And then what I even did is broke that down to a monthly target. So if I wanted that 8, it means I would need to make 34 a month and for 15 at 63 a month. All of those in and of themselves really don't mean that much. The reason why I continue to pound on this, you know, drum reiterating over and over and over again that this small account isn't the account we're trying to grow. You need more money if you want to really make money investing. You need more money than 5,000. You're not going to turn this into your nest egg. So what I'm truly focusing on is developing a consistent approach that I know I can apply. And the reason why that becomes powerful is as this slowly starts to more from a 5,000 to a 50,000 to a 250,000. To a 500,000 account, to a 1,000,000 account, to a 2,000,000 account. All of a sudden, these figures start to mean something. So for example, if you're using something like a 1.25 million account whenever you get to that space, if you can still return that same 8 that you're building the skill set for now, instead of that being 400 for the year, that's going to be 100,000 for the year.",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "So for example, if you're using something like a 1.25 million account whenever you get to that space, if you can still return that same 8 that you're building the skill set for now, instead of that being 400 for the year, that's going to be 100,000 for the year. So you're going to make, again, if you can maintain consistency, you're going to make 8,300 a month. So my point is focus on the skill set. Let this account continue to grow. This will help you modestly move towards that goal. But if you're first starting out with pretty much anything less than 100,000, you really need to focus on saving money. Because once you start getting over 100,000, that's when the amount of money that you can make starts to really help compound your growth. But when you first start out, it's still going to compound, but it's relatively small. And it's important to understand the context of all this. And then if you sit there and you say, well, what the hell's the point? Just remember, right now, a CD account, I just looked them up, right today. The one year CD, the highest I could find is 0.9. So if you take that 5,000, you put it in a CD account, you get 45 for the year. So for the younger folks that look at this and they scoff at the figures because it's a low amount, I totally understand and identify with you. You really",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "is 0.9. So if you take that 5,000, you put it in a CD account, you get 45 for the year. So for the younger folks that look at this and they scoff at the figures because it's a low amount, I totally understand and identify with you. You really got to focus on the bigger picture here. This isn't, you're not going to turn 5,000 into your next big sum of money. You're right now we're building a skill set that as your money slowly grows via investing, and most importantly, as you're saving, this is the skill set that's going to help you. It's not going to be too many folks want to make, too, I think, too much money on whatever they have. And it just leads to a completely untenable approach that doesn't really help us when it comes time to start delivering on a larger sum of money. So just keep that in mind. So here's what I wanted to talk about in the portfolio. This is what we're looking like these days. I closed out Pfizer yesterday, that was a 402 profit in total, which is a good trade for that. So if we take a look right now, total PNL in the account is 557, actually no, it should be a little bit more than that. Total PNL in the account should be 581. I forgot to add the covered strangle to the PNL. So that needs to get updated. So we made",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "take a look right now, total PNL in the account is 557, actually no, it should be a little bit more than that. Total PNL in the account should be 581. I forgot to add the covered strangle to the PNL. So that needs to get updated. So we made 402 in the Pfizer trade as a whole, we made 155 in Kruger right now, realized PNL. And then in XLF, we made 24 bucks. So all in all, we're at 581 profit, which is about 10 return, a little over, which is really good, starting on a 5K account, essentially two weeks in. That's something that I think is great performance. And I would love to maintain it, but I totally expect there to be a little bit of pain along with this. So right now, we're pending what is it's 109, that's out, which represents about a 2 return on the current account value of 5581. So overall, I am pleased with where the account looks. Utilization is just over 3,000, which is just shy of 54 utilized. And that is one of the beauties of trading the way that I trade is I'm continuing to make a really good return on the account. And as I'm starting to make money and fine opportunity, I don't have to utilize as much to get there. So what I did end up doing today is establishing a new call diagonal in Bank of America. So I am now long the",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "really good return on the account. And as I'm starting to make money and fine opportunity, I don't have to utilize as much to get there. So what I did end up doing today is establishing a new call diagonal in Bank of America. So I am now long the 18 June 21 18 calls paid 8. That's an 81 delta. And then I sold this 16 October 26 calls at 82 cents. So that's going to be a little over 10 return on invested capital for that trade would be pleased to make that money. That's something that you know, completely reasonable for this account. Now of note, Kruger still has no short calls on it. I have not put any short calls on the trade because although I can still make a little money on the short calls, it's not enough for what I would want to make. I want to make sure I stay at the 35 strike to be above my critical strike on the shorts. So I'm essentially waiting until I can make more money. And I'm okay with that. There's no real pressure on me in that position right now. It's showing the leaps are showing obviously a loss. But just takes a little time for the trade to start working out. We already made 155 in the short call. So we have some time to go in here. And remember this Kruger trade, I allocated 1,500 for it. And we're about allocating because",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "are showing obviously a loss. But just takes a little time for the trade to start working out. We already made 155 in the short call. So we have some time to go in here. And remember this Kruger trade, I allocated 1,500 for it. And we're about allocating because I scaled in a little bit. Whereas on the Bank of America trade, I'm also allocating 1500 but we only have a one lot I'm expecting to scale into this trade as well once we have some time. So again, of note, for Bank of America, it's at a one-to-one ratio. I typically don't like to do that. But again, small account work constrained by capital. I'm starting with a one lot expecting to scale into at max a two lot on the calls, the long calls. So it is what it is. Once I am able to have two long calls, I likely will only sell one call against to unlock that upside. Now, Bank of America does have earnings coming up on the 16th of next month. And my expiration is for the 16th. So what I'll end up doing is taking those short calls down before earnings and probably laying out additional short calls on earnings or very close to earnings so that I can capitalize on the increase in pli volatility for that expiration cycle. And see if we can make a few extra dollars again on the smaller account because that's what the name of",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "and probably laying out additional short calls on earnings or very close to earnings so that I can capitalize on the increase in pli volatility for that expiration cycle. And see if we can make a few extra dollars again on the smaller account because that's what the name of the game is. So right now, this is what our call diagonal looks like in Bank of America. Notice no upside risk to this diagonal test meant to the way that I structure them so that there is no upside risk focusing on delta management. And then once we're able to add another leap or these aren't leaps, once I'm able to add another long call, at some point, this is more what it will look like. But as of right now, we're going to stick with one long and then scale into the position in the future. So that about wraps up where I'm at in the small stack portfolio of few things that I want to make sure are taken into account as we get closer to the election, I am going to continue scaling out out of all of my accounts, including this one. And it's just because I view that as a very large binary event, the market has been extremely emotional. So I will continue to maintain exposure as I always do, but I will be mindful what I have out leading into it because I just don't want to expose myself to that risk.",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  },
  {
    "text": "because I view that as a very large binary event, the market has been extremely emotional. So I will continue to maintain exposure as I always do, but I will be mindful what I have out leading into it because I just don't want to expose myself to that risk. I don't see a good return on that risk. So I will be following through with that as we continue along. So if there are any questions or any trade ideas, anything like that, feel free, reach out, let me know. I still have 2,000 to use in this account a little over close to 2,500. So plenty of opportunity to be had once I see it, but I am not forcing any trades because I don't need to. Right now we're maintaining good progress. We're at a good return on the account. So I'm happy where things are right now. All right, until next time, I'll catch everybody later.",
    "metadata": {
      "video_id": "YOgMXbP9yCE",
      "title": "Trade Management and Portfolio Plan - Small Stacks Pt8",
      "url": "https://www.youtube.com/watch?v=YOgMXbP9yCE",
      "upload_date": "",
      "duration": 661.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YOgMXbP9yCE&t=0"
    }
  }
]