[
  {
    "text": "Hey everyone, Eric here. Wanted to follow up on a really good conversation I was having with one of the members of my Facebook group on why think or swim is lying to you. And what I want to talk about is IV rank versus IV percentile. Although they're used interchangeably, these are completely different calculations and it's important to understand that in the way that they're calculated to know how we can use them. One is far better than the other and I'll explain why. According to normal market conditions, these two are very similar, which is why they're used interchangeably. People just send in them as essentially and they don't really pay respect to the difference between it to them. But when we see really large outlier moves like we saw when the market crashed earlier this year, that's when the difference in their computation becomes super apparent and it's important for us as traders to understand that difference because it will completely change the way you approach a trade. So what I have here is a snapshot from think or swim. Took it right before this video on today's option statistics, which is under the Trade tab below all of the options chains and this is for Tesla. So what this is showing you is it says current IV percentile is 30. It's completely false. It's not 30. That is a lie, literally bold phase completely incorrect. That is IV rank and I'm going to explain over",
    "metadata": {
      "video_id": "yRUDAtVL74w",
      "title": "IV Rank (IVR) vs IV Percentile (IVP) | Thinkorswim (tos) is WRONG",
      "url": "https://www.youtube.com/watch?v=yRUDAtVL74w",
      "upload_date": "",
      "duration": 220.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 4,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yRUDAtVL74w&t=0"
    }
  },
  {
    "text": "below all of the options chains and this is for Tesla. So what this is showing you is it says current IV percentile is 30. It's completely false. It's not 30. That is a lie, literally bold phase completely incorrect. That is IV rank and I'm going to explain over the next couple slides here why this is so important to you and what the difference is here. So when we look at IV rank, that is calculated by you take the current IV, you subtract the 52 week low IV and then you divide that number by 52 week high IV minus 52 week low IV. And if you use the numbers again from that same screenshot from the prior screen, you get 30. This is the calculation for IV rank, not IV percentile. The reason why it's so important to understand the difference here is because this is susceptible to outlier skew. It's taking the extremes, the high and the low. So this can completely give you a false perception of where things are right now. And that is why IV percentile is so much more useful than that. So when we look at IV percentile, it simply takes the number of trading days below the current IV and divides it by the number of trading days in the year, which is 52. As you can tell by this simple calculation, it is way less susceptible to skew because it's not using the extremes. It's just calculating the",
    "metadata": {
      "video_id": "yRUDAtVL74w",
      "title": "IV Rank (IVR) vs IV Percentile (IVP) | Thinkorswim (tos) is WRONG",
      "url": "https://www.youtube.com/watch?v=yRUDAtVL74w",
      "upload_date": "",
      "duration": 220.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 4,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yRUDAtVL74w&t=0"
    }
  },
  {
    "text": "takes the number of trading days below the current IV and divides it by the number of trading days in the year, which is 52. As you can tell by this simple calculation, it is way less susceptible to skew because it's not using the extremes. It's just calculating the number of days above or below levels. And if you'll notice the screenshot, I actually don't use today's option statistics much because I have think scripts that populate that data for me on the chart. So I normally see it here. What I'll do is I'll include this in the description below so that you can have the IV percentile. And this is why. Right now, again, IV rank is 30.26 is what they're saying. In IV percentile is 66. That's a huge difference. That's a giant discrepancy between those two figures that typically are close to one another and people associate certain trades with. In this instance, completely different. And I would approach these trades completely differently if it was at a 30 or at 60. So again, wanted to share this with everybody. We follow up on that conversation. It's a really good one. It's an educational one. And if anybody has any questions, let me know. Happy to dive in further. Catch you later.",
    "metadata": {
      "video_id": "yRUDAtVL74w",
      "title": "IV Rank (IVR) vs IV Percentile (IVP) | Thinkorswim (tos) is WRONG",
      "url": "https://www.youtube.com/watch?v=yRUDAtVL74w",
      "upload_date": "",
      "duration": 220.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 4,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yRUDAtVL74w&t=0"
    }
  },
  {
    "text": "And if anybody has any questions, let me know. Happy to dive in further. Catch you later.",
    "metadata": {
      "video_id": "yRUDAtVL74w",
      "title": "IV Rank (IVR) vs IV Percentile (IVP) | Thinkorswim (tos) is WRONG",
      "url": "https://www.youtube.com/watch?v=yRUDAtVL74w",
      "upload_date": "",
      "duration": 220.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 4,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=yRUDAtVL74w&t=0"
    }
  }
]