[
  {
    "text": "Sweet. What is up everybody? Eric here. Welcome back to all the outliers and I got my friend Michael Guy Ed from lead lag slash the attack sphere of ETFs. You and I have, you know, known each other for a while now. I always love getting a chance to pick your brain, talk about markets and whatnot. So first off, welcome on Stoke to Have You Here, man. Dude, you are the outlier. So I'm stoked to be on it. Come on now. You know, I feel like somebody was telling me about this thing of like manifestation, which it's always been so weird to me, right? To like just think of something and then all of a sudden it happens and I've tried it and it's not fucking working. So maybe I need a manifest harder and then I can become like an actual outlier and be like one of these dudes with a 200 million yacht. But you know, we're working on it. At least we'll talk about it. I'm trying to manifest a credit event if you haven't noticed it. This is not been working apparently either on my end. I guess that's actually like really true. I'm laughing pretty hard at that because if I look back across your Twitter feed, it is filled with said what a great spot to start. So for the people at least from my audience that might not be familiar with your, I don't want to call it an",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "true. I'm laughing pretty hard at that because if I look back across your Twitter feed, it is filled with said what a great spot to start. So for the people at least from my audience that might not be familiar with your, I don't want to call it an obsession, but we'll call it in an obsession with a credit event. What is the thesis behind this? Because for those that don't know, I've actually read pretty much all of your white papers and the stuff that you think about, it's not like a lot of people speak in hyperbole for attention, right? And you get it, you know, there's always some showmanship. But when I read through your stuff, it's like very clear that you were connecting dots. Talk to me about the credit event. No, no, and well, and the showmanship and loudness on X is obviously not like the real professional stuff that I put out there. I mean, look, first of all, it's funny because people forget that I was bullish at the start of the year. I was saying melt up. There was a whole thread I pointed out, January 13. I said melt up or crash and yes, was the answer in putting the post. I said that Fin Twitt can't understand path. I believe we see both this year, right? So I was saying, you're going to have a melt up because it's pre-election years, but towards the end of the year,",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "up or crash and yes, was the answer in putting the post. I said that Fin Twitt can't understand path. I believe we see both this year, right? So I was saying, you're going to have a melt up because it's pre-election years, but towards the end of the year, there would be a heightened risk of a credit event, which, you know, would be in response to the lag the facts of the fastest, greatest rate hike cycle in history. Okay, now, I think I've been right and wrong as is the case with most things in the way that it's played out. You did have a melt up, but only in large cap tech. So you can say, okay, that was right. You did not have a melt up and everything else. The SP 493, small caps, retailers, Europe, emerging markets. There's been no melt up outside of those large cap names. So I'd say that I was actually very wrong in that melt up argument. And the whole melt up argument at the start of the year was it's pre-election year. Pre-election years are factually historically the strongest of the cycle. Now, let's talk about the credit event. Credit event is not some scary term. Credit event just means a VIX spike. That's all it is. So when you look at the VIX volatility index and you overlay credit spreads, you tend to see those are one for one relationship, meaning as the VIX spikes, credit spreads",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "event. Credit event is not some scary term. Credit event just means a VIX spike. That's all it is. So when you look at the VIX volatility index and you overlay credit spreads, you tend to see those are one for one relationship, meaning as the VIX spikes, credit spreads tend to widen, not my opinion. VALTODY is seen by the bond market as increasing de-falt risk. So yeah, part of the thesis was at some point the lag defects would kick in the Fed likely over Titans, which by the way, now, long-gravation yields are telling you that they did, which we can maybe touch on in the last several weeks here. Instead, you ended up having a credit event in Treasuries, which I then changed my tune and saying that's phase one, but a corporate credit event phase two is not yet happened. I thought it would start entering November. Now, the reason I said at the end of October that the first week in November, you could see circuit breakers, which I was able to say was way wrong on, right, was credit spreads were starting to widen. Okay, the VIX was at a point in the exact 21. It was at the point where it's like, it was going to break out and spike. It's around this level. So let me make a communication, bet and say, okay, well, what if I'm right? And it's so happened in my own funds. The signal said, the intresuries.",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "exact 21. It was at the point where it's like, it was going to break out and spike. It's around this level. So let me make a communication, bet and say, okay, well, what if I'm right? And it's so happened in my own funds. The signal said, the intresuries. Treasuries worked that week. No circuit breaker, best week of the year for the SP. And then you had this drift and everyone's super bold up, right? But I don't think the credit event risk has gone away. Maybe my timing, not maybe obviously my timing has been off in putting a spotlight on it for entry November. But we don't know where these legs actually start to impact the economy in the stock market. I mean, you're already seeing now in housing. You're starting to see the housing side break down finally on home sales and pricing. But to say that just because it hasn't happened in a single month, which I thought was higher risk, that the risk is still not there to me as silly. Because the thesis has not changed. There are lags. We went through the faster rate cycle in history. At some point that will manifest the manifestation, probably manifest in an ugly way. But path matters more than prediction. I've been wrong. Having that silly made money or lost money, or I should say, on that, because if you were in treasuries the last month, you'd be great. Treasuries would have been the",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "will manifest the manifestation, probably manifest in an ugly way. But path matters more than prediction. I've been wrong. Having that silly made money or lost money, or I should say, on that, because if you were in treasuries the last month, you'd be great. Treasuries would have been the credit event way to trade it anyway. So it's fine. But it just goes to show you how this is a business where it's a fine line between being wrong and being early. Yeah. Well, and I also think it's interesting that you look a lot at path dependency because I find in markets, I have a stats background. And I spend a lot of time looking at these things as well, because I find them interesting. And sometimes I feel like the path can be misleading when it's overlaid with some of these unnatural add-ons, specifically like you're talking about a lot of the feds actions, which I've always been so curious how to even think about that. Because we've never seen anything like this before. So it's like how can you think about applying typical path dependency into this kind of environment? How do you think about that when there's like truly anomalous conditions like this? No, no, no, and actually you're hitting on why I just, the reality is nobody knows. Not me, not you, not anybody else's thing, right? Because we've never seen anything like this, the fastest rate hike cycle in this way, right? So",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "when there's like truly anomalous conditions like this? No, no, no, and actually you're hitting on why I just, the reality is nobody knows. Not me, not you, not anybody else's thing, right? Because we've never seen anything like this, the fastest rate hike cycle in this way, right? So even the fed can't model out the legs. They themselves have admitted that. And that's my point. It's like if we agree that we've never seen anything like what we've gone through. Then maybe it's bullish, maybe it's bearish. But one thing is that I can say for certain is that it's not certain, right? And that's sort of the mindset. It is funny to me, the I get all this anger and hatred for pointing out people say you're a perma bearer, it's like no, again, if you have an IQ greater than 80, you can see that a funny time has been bullish in the past. But unless the thesis has changed and the thesis has always been around the legs, I guess the magnitude of the rate hike, I still think the risk is there. The fact that so many people seem to think it's not just because it didn't happen in November, which was a monster month, which by the way, plenty of bear markets have monster months. To me is like, I don't know, that seems like that's the set of probably have a credit for it when nobody's thinking can happen again, right? When",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "because it didn't happen in November, which was a monster month, which by the way, plenty of bear markets have monster months. To me is like, I don't know, that seems like that's the set of probably have a credit for it when nobody's thinking can happen again, right? When the risk seems to have gone away. This is having two roles with which drives me kind of crazy. So a lot of noise was made about the Dow Jones Duster average on a total return basis medium highs. So it's a bull market there, right? Okay. I keep them back to yes, technically that reset the drawdown in the down. You're still in the drawdown for the Nasdaq, you're still in the drawdown for small cash, still in the drawdown for the SP. Okay, but what about inflation? Right? I mean, that prior peak for the Dow for the SP for the Nasdaq from 2021, it's not in nominal terms. What's the real level, the after inflation level? You still need, like another 12 from here for the Nasdaq to technically be at the real after inflation at just the high from 2021. I'm not saying it can happen. I'm just saying for all intents and purposes, we're still in the drawdown because still being a bear market. And you only know if you're in a new bull market after you've taken out the prior peak, which means you only know if it's with hindsight. Right? But again, credit",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "I'm just saying for all intents and purposes, we're still in the drawdown because still being a bear market. And you only know if you're in a new bull market after you've taken out the prior peak, which means you only know if it's with hindsight. Right? But again, credit events tend to end bear markets. If it spikes tend to end bear markets, you have not had that inequities. And if I'm right, that the credit event is still out there that we're still in a bear market, it's going to frustrate the hell of a lot of people and that's what stocks do. That I couldn't agree more with. So thinking about the credit event possibility still, the way that things have been folded thus far, what are the primary catalysts that you see on the horizon that could kind of capitulate us down that route? So there really are a legit number of catalysts. I mean, ones that have been talked bad and ones that are not getting as much attention. So obviously, there's the commercial real estate side of things. I don't think it's going to be as big of a catalyst because that's not all at once. China could still be a catalyst with the real estate crash that's going on there. Our own housing market could be a catalyst. Right? If that kind of creates a sort of self-fulfilling cell cycle, everyone seems to assume that you have to go back to 3 mortgage",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "at once. China could still be a catalyst with the real estate crash that's going on there. Our own housing market could be a catalyst. Right? If that kind of creates a sort of self-fulfilling cell cycle, everyone seems to assume that you have to go back to 3 mortgage rates to unlock this kind of lock-in effect. It's not true. Well, you go, mortgage rate of 5, you're going to have people selling, you're going to have 5 and a half percent. They're going to sell. They're going to unleash because the reality is, yeah, they're locked into their home, which means they're also locked into home insurance rates. That's going up. You can see that with the storage on Florida. All these home prices, who went through the roof or these property prices went through the roof, they have this lock-in rate with low rates. But the insurance costs are going through the roof. So it's like, what do you do? You're going to keep on paying the insurance. You're going to try and sell just because you have a 3 is that enough. So that could be a catalyst. I still think Japan is the real big catalyst. Right? If they're going to try to, it's normalize their own policy because of inflation. You're talking about a country that has been a source of leverage for the entire world for 30 years. Now tinkering with monetary policy and a more aggressive tightening type of way, that could",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "catalyst. Right? If they're going to try to, it's normalize their own policy because of inflation. You're talking about a country that has been a source of leverage for the entire world for 30 years. Now tinkering with monetary policy and a more aggressive tightening type of way, that could still be a catalyst. But the point is, it could be something nobody sees coming. But the condition for whatever it does come still relates to the fastest rate, high cycle in history. And the lag. Right? That's all I'm trying to stress by providing a different way of thinking about. Now, you and I both know having a thesis is one thing, trading is a whole different thing. Right? And I make this point continuously. I do not believe in shorting. I do not believe in going into cash. I do not believe in buying puts. For me, and I've said this as outlined in the papers, the risk off expression is still to be exposed to something on the long, long side. Right? And outside of the options market, the way you do that is by either being long gold, which is working, being long treasuries, which is starting to work, being long the dollar, which has worked the longest as a risk off trade, or being long utilities on a relative basis. Right? That's your risk off up to any set. Right? So you can be bearish and be long those, be wrong being bearish but still",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "starting to work, being long the dollar, which has worked the longest as a risk off trade, or being long utilities on a relative basis. Right? That's your risk off up to any set. Right? So you can be bearish and be long those, be wrong being bearish but still with money. You can be bearish, be long or those and make money. But the point is that it's not a guarantee either way. And that's why it tends to be a better way of expressing defense than making an outright directional bet saying stocks are going to go down credit event, shorted if you have conviction. I don't have conviction in the mile marker. I have conviction in the conditions. Right? The catalyst could be the pebble on the road that nobody sees as they're driving. You're not going to swerve because you can't see that catalyst, but you know that you need to already be slowing down before that pebble hits you. I think the way you described it there makes a lot of sense too in that it's not necessarily, you know, what is the last thing that tips us over, but we're at a point where any one of those things potentially could. Right? So when we look at something like the housing market and I was looking at something where like, you know, back in the 80s, the median home price was like 3.7 times that of the median income. And as of November, it's",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "any one of those things potentially could. Right? So when we look at something like the housing market and I was looking at something where like, you know, back in the 80s, the median home price was like 3.7 times that of the median income. And as of November, it's like five and a half to six times the median income. What role do you think the housing market plays in the way that this unwind occurs if any? So even the Fed has said that the wealth effect is most powerful when it comes to housing. Right? I mean, we talk about the stock market and the wealth effect for stocks, but like the reality is it's most people's assets is their home. We're privileged to be able to trade and own stocks and to play that game, but the reality is most people don't. Their wealth is their home. Okay, so to the extent that housing appreciates, it makes them feel more confident. They spend more. If housing depreciates and makes them less confident, there's a reverse wealth effect. They start pairing back. Right? You haven't seen that yet because housing is only now starting to roll over. I've been early on that, by the way, I said, could there's a housing is not going to use the word, but isn't trouble. Obviously, I've been wrong on that. But again, fine line between being wrong and early, plenty of people were wrong in 2006, warning of a great",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "I've been early on that, by the way, I said, could there's a housing is not going to use the word, but isn't trouble. Obviously, I've been wrong on that. But again, fine line between being wrong and early, plenty of people were wrong in 2006, warning of a great financial crisis. At the housing peak back then, they were wrong until they were right. Right? Which is just two-year lag from 2008. So if housing is going to keep on weakening, if there is going to be this depreciation, yeah, that's going to challenge the consumer. That's going to challenge small caps. It's going to challenge the likelihood of zombie companies, which have high leverage and low margin to keep up with higher costs of capital because the revenue cycle gets challenged as people spend less. That's not a perma bear argument that's causing effects. Right? Now, maybe that doesn't have. Maybe housing holds or goes sideways. Maybe it's a correction in time. Okay, it's possible. But typically, extremes don't resolve them self-sides. Right? And the appreciation post-COVID in housing isn't extreme or an annualized basis. Right? Nationwide. So, let's see. I think that is a headwind for a while. Again, maybe it's a catalyst, maybe not. It's not a catalyst in the same way as what you saw in the 2008 financial crisis. But as a catalyst that breaks consumer spirits, yeah, I don't see why not. Do you factor things like auto sales coming down or things",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "while. Again, maybe it's a catalyst, maybe not. It's not a catalyst in the same way as what you saw in the 2008 financial crisis. But as a catalyst that breaks consumer spirits, yeah, I don't see why not. Do you factor things like auto sales coming down or things like credit card defaults going up? Actually, the beginning of this earnings cycle, I trade earnings, right? So, I'm an options trader. So, unlike you, I have no loyalty long short, whatever it is, dog, I'm there. But I did notice when the banks were reporting, I always like to read through their reports, because you get a lot of information. And they have a really significant spike in credit write-offs from people defaulting. Do things like that factor into your thesis as well? Are those just kind of additional supporting metrics that move us further along this path? Yeah, I think it's supporting. It goes back to that point, but the legs, right? It's like, look, it takes time to change a habit. I mean, you know this yourself, right? I mean, given the CSS you've had in your life and your career. So, if it takes time to change habits, consumers don't change their spending habits overnight. It takes many months of seeing the minimum payment on the credit card rising, it takes many months of them seeing the minimum, just in general, just how much the rates are rising for that to actually impact how they're spending.",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "change habits, consumers don't change their spending habits overnight. It takes many months of seeing the minimum payment on the credit card rising, it takes many months of them seeing the minimum, just in general, just how much the rates are rising for that to actually impact how they're spending. So, and then suddenly they're surprised by it and then the link would see you start to kick in, right? It's like, I use that line slowly, then all of a sudden, continuously. Because that's how this works. It's like slow burden, then suddenly the fire is there. So, I think all that is supportive of the idea that, yeah, that credit side is straining consumers, right? And again, it maybe doesn't resolve itself in an event. Maybe it's just a long drawn out, you know, pressure problem for the economy, but to deny the cause and effect of rates on consumer spending. And by the way, on retailer stocks, which have been telling you for the entire year, consumers are strained. For all the narratives around how strong the consumer is, tell me why retailer stocks have gone sideways in a pre-election year. Tell me why small cash, which are more sensitive to domestic economy, have gone sideways. I get the regional bank, you know, effective. But like even the stock side is telling you that these delinquencies are are only starting. So, how else do you explain the performance being so poor on a relative basis to the",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "are more sensitive to domestic economy, have gone sideways. I get the regional bank, you know, effective. But like even the stock side is telling you that these delinquencies are are only starting. So, how else do you explain the performance being so poor on a relative basis to the SP to the NASDAQ? So, yeah, I think, I think it's foolish to argue that we're in an expansion phase just because the Fed is now maybe done hiking rates because history shows that when the Fed is pivoting, it's a contraption phase. It's not an expansion phase. It doesn't have to be. It's not every time. But this is game of probabilities. So, volatility should be increasing. Dilling quantities are the first step to that. Did you see Powell statements today when he was talking about he doesn't necessarily. He thinks it's, I don't want to misquote him too bad, but the paraphrase was that it's too early to say that hikes are gone. What did you make of that? Is he just playing hardball as per usual? Or because to me, I looked immediately at bonds to see what they thought and they think he's full of shit. But, you know, no, no, no, it's actually interesting, right? The moral swation is a tool for the Fed. Words are a tool because they obviously impact rates. I suspect that Powell probably is concerned about the stock market running away. Does some extent? Why? Because if the stock market",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "But, you know, no, no, no, it's actually interesting, right? The moral swation is a tool for the Fed. Words are a tool because they obviously impact rates. I suspect that Powell probably is concerned about the stock market running away. Does some extent? Why? Because if the stock market keeps pushing higher, it will delay the disinflation that comes from housing. So, one of the arguments for why I think housing has been stubborn on the upside is because a lot of people saying, okay, yes, the mortgage ratio has been present. That's fine, but I got in video. Like, the view there stock portfolio as something that can help pay off those higher mortgage payments. So, I suspect that Powell does not want to see the stock market in a enormous melt of phase because that's going to cause all kinds of liquidity and flea-shares pressure and then cause them to have to hike rates again. So, I do think it's a game of trying to manage expectation on his end. Now, to your point about the bond market saying he's full of shit, of course, he's full of shit. He's full of shit because he can't tell the future better than nobody else. I mean, if you look at headlines of Fed projections for hikes in 2018-2019, they are expecting four hikes and then they end up cutting instead. It's like the Fed doesn't know what's going to happen next to either. But, and the Fed is",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "the future better than nobody else. I mean, if you look at headlines of Fed projections for hikes in 2018-2019, they are expecting four hikes and then they end up cutting instead. It's like the Fed doesn't know what's going to happen next to either. But, and the Fed is a follow. I always go back to that point. The Fed doesn't own the bond market. The bond market owns the Fed. The fact that the long duration side is acting like this. Okay, yes, it's over. It was oversold. Yes, it was due to bounce. Right? And I stress that long duration trade finally kicking in. The Phoenix rising idea, the fight to safety has not happened yet because credit spreads haven't widened yet. But, it does seem like the long duration side is saying the Fed definitely over tightened, which means that he can say that they're not done hiking rates. But, at the end of the day, the Fed is the bond market's bitch. I'd say that way, but that's just the truth. The long duration side is bitch. Right. Before we move on from the credit event, there is somebody in the chat from the Twitter space that was saying, can you share two to three concrete examples of what a literal credit event would look like? So, any VIX spike, I'd say above 30, you can see that. So, if you go to Google, Fred, right? And then VIX and then OAS. Fred VIX OS,",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "space that was saying, can you share two to three concrete examples of what a literal credit event would look like? So, any VIX spike, I'd say above 30, you can see that. So, if you go to Google, Fred, right? And then VIX and then OAS. Fred VIX OS, those three terms. I think it's the first link that shows up. You'll see that chart that overlays the VIX against credit spreads and then the shaded areas of recession. And you'll see, again, there's a one-for-one relationship. Right? So, you know, it's like, if you're going to be mathematical about it, it's literally just just that. Right? You had a credit event with COVID. You had a credit event in 2008. You had a credit event in 2011 with a summer crash. You had a brief look like a little bit like a credit event in November, December 2018. Right? But basically, at any time, you have a significant VIX spike, that's basically where credit event is because you see spreads widened. Right? Again, it's, if you believe, I put that poll on yesterday, right? I said, if you, as it do you believe that you're going to see a VIX spike in the next three months. And something like 70 of people said, yes, the next post down, I said in that, is if you believe that you're going to see a VIX spike, you have to believe in the credit event thesis because it's the same argument.",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "a VIX spike in the next three months. And something like 70 of people said, yes, the next post down, I said in that, is if you believe that you're going to see a VIX spike, you have to believe in the credit event thesis because it's the same argument. You're not going to get a VIX spike in spread state type. That's not how it works. Right? That's my point with this. Again, I've been wrong on the timing. I don't think I'm wrong in the reasoning. Well, and I think some people, at least based on the way that this person was asking that question, it looks like their name is bull for now. I kind of get, I kind of get the sense, by the way, that they ask the question that sometimes people, when you, when you say something like credit event, sometimes it feels like people are thinking like they're going to see fire in the sky in that it's going to be end of days. Right. No, I've said this may test before. It's like, if I'm right, there was still a bear market, which I know sounds crazy, especially now, a credit event ends at a VIX spike ends it because historically, bear markets do end with a bang, the end with a capitulate or remove, speaking about like tech analysis. Well, yeah, I always poke fun at the squiggles. I say I use that term, the basement traders using squiggles, right? Okay,",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "ends at a VIX spike ends it because historically, bear markets do end with a bang, the end with a capitulate or remove, speaking about like tech analysis. Well, yeah, I always poke fun at the squiggles. I say I use that term, the basement traders using squiggles, right? Okay, fine. Something against tech analysis. I'm just against things you can't backtest. Right. And most of these in quotes squiggles, you can't backtest. But one thing which is very well known that you can't backtest is extremes. Right. The capitulation that happens at the end of a downtrend. Capitulation is VIX spike. Capitulation is a credit event. It's where junk debt falls apart relative to AAA. We have not had that in equities. It's just fact. Maybe we don't in which case, I'll be wrong. But probably, realistically, I think it's a higher possibility than not. Now, if I'm right about that, that brings back what I've used that line before, you know, to save treasuries, you have to crash stocks. Right. And people seeing the treasury move the last month, they're saying, oh, obviously, it shows you wrong. No, it doesn't because the top 1 of the clients using daily data for the SP treasuries are positive in the biggest decline for stocks. I mean, it's just fact. So if I'm right about that VIX spike that credits bread wide name, which is still to come, okay, then you know what? Yeah, you're going to see some really interesting",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "daily data for the SP treasuries are positive in the biggest decline for stocks. I mean, it's just fact. So if I'm right about that VIX spike that credits bread wide name, which is still to come, okay, then you know what? Yeah, you're going to see some really interesting movement in defensive areas in advance because those tend to move prior to that occurring. And you're going to see junk debt breakdown, which would be a great opportunity to buy into junk debt. Like, I want to see a credit event selfishly, not just because, you know, can't believe for my own funds, they're designed to play the flight to safety trade in treasuries, which the credit event is kind of needed for that to kind of get shot back into place. But I want to buy cheaper levels on the risk on side who wouldn't. I don't know. I am blowing away. It's like, if you're a real investor, you want a credit event because time's on your side. You want to buy cheaper. It's not going to stay down. I never said it would stay down. A promo bear would say it would stay down. It's not. So there's a couple of things that I wanted to ask you about. The first one is a personal curiosity. Have you, because I know that you study a lot of relationships, I've never studied this one. I've studied tons, but I've never studied this one. Have you found any",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "So there's a couple of things that I wanted to ask you about. The first one is a personal curiosity. Have you, because I know that you study a lot of relationships, I've never studied this one. I've studied tons, but I've never studied this one. Have you found any correlation between when Christmas displays come out and the performance of that company? No, although it's not easy. I interviewed Jeff Mackey, who used to be on CNBCL Adi's now covering a lot of stuff on retail or consumer stocks. And he actually bring, I'm trying to remember the exact thing, but he mentioned something along those lines where it's like, there's a strong correlation between sales related to garden Christmas items. I think it was like display items for like the front yard and future retail sales into the holidays. And it's basically the idea is that if you end up seeing people not buying a lot of things like lights and all these things for their front yard, that's actually a harbinger of negativity. So I don't know if that's, I haven't studied it from the perspective you're asking, but it kind of reminds me a little bit of that. But is it, you saw on that up here? It's now. No, I haven't. That's why I'm literally asking people because I haven't done that one yet. I'm working on a handful of other ones from this past year on different anomalies. So like, I'm trying to outsource",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "of that. But is it, you saw on that up here? It's now. No, I haven't. That's why I'm literally asking people because I haven't done that one yet. I'm working on a handful of other ones from this past year on different anomalies. So like, I'm trying to outsource some of these questions I have. So it wouldn't surprise me if there's some effect. It was like, the reality is, you know, look, Phomo is always about sentiment, sentiment's always more than just a chart. That's why seasonality is a thing. That's why even moon cycles are a thing. It's ultimately about mood. So I am sure there's probably something there whether it's trailer or not, I have no idea. But I don't know, man, I'll give you one which I think is just more anecdotal interesting. Somebody turn me on to this app, Teemo. It's like this number one app on the iPhone. There's tagline, I think it's something like shop like a billionaire. And basically it's like all goods from China and just basically unbelievably cheap, stupid pricing. It's like the number one thing everyone's just buying things left and right. I mean, a lot of this self look kind of junky to me, but whatever. That's fine. It's just a way to get very cheap items. And it's like, all right, I mean, I find it interesting they were at a point now where consumers are just so desperate for anything that's cheap because they probably",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "self look kind of junky to me, but whatever. That's fine. It's just a way to get very cheap items. And it's like, all right, I mean, I find it interesting they were at a point now where consumers are just so desperate for anything that's cheap because they probably can't afford very much with inflation and with credit card rates and credit card balances. Like that to me is actually an interesting contrarian signal that you have so much demand for this, you know, Teemo app and these types of products because they're just people are desperate to have something because they can't afford anymore. It's just going to the prior alternatives like Walmart Amazon to get their stuff. Isn't it pretty crazy? I was just talking with my wife about this not too long ago though. How insanely good consumers tend to have it now where if you want to buy something you literally can just go on Amazon and grab it and have it sent you in a couple days or if you want somebody to go get your food. There's door dashes. It's like I feel like the average person literally lives like a fucking king or queen at this point compared to what it used to be. Just what you're talking about with Teemo is making me think of that because there's people that can just buy cheaper goods directly from China across the fucking globe now and have it shipped over which is pretty",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "or queen at this point compared to what it used to be. Just what you're talking about with Teemo is making me think of that because there's people that can just buy cheaper goods directly from China across the fucking globe now and have it shipped over which is pretty sick. Yeah, yeah. And I'm about to say on that it's like people also underestimate how that convenience has a price in terms of their discretionary budget. It's like oh yeah, should I just press this on Instagram? I mean, it's like what what's the markup on the percentage? As opposed to just taking a walk down the block and buying it, you're just having it delivered to my point. It's like we're still used to these luxuries but these luxuries still have a cost to them, right? Which only furthers the strain on consumer budgets at some point but they're so used to now ordering and taking advantage of those luxuries that it's hard for them to walk away. They'd rather just be in more debt. I could not agree with that more. I was actually just thinking about that before when I was thinking about going to the grocery store and like I literally use Instacart and I was just like I remember thinking like oh, I'll just order on Instacart and I was thinking like since when is your time now fucking valuable? Like you can go to the damn store, dude. Like but you know I",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "grocery store and like I literally use Instacart and I was just like I remember thinking like oh, I'll just order on Instacart and I was thinking like since when is your time now fucking valuable? Like you can go to the damn store, dude. Like but you know I it's and gets and gets and gets to exercise that. Let's take a walk. Does that happen? I have been eating very much because I'm doing the FASA thing as you can it is as it may be does but it's like you know and now that I have that mindset, right? I talk about like being an outlier. I mean you're you're super healthy and fitness and you know for me it's like all right if I have an opportunity to walk somewhere I'm gonna walk. Mark? Yeah, it's super smart and I don't know I find any time that like I travel one of my favorite things to do is I say jokingly but it's like to exist. Like when I was in Africa you spend a lot of time just finding somewhere to go to get food. Like that is now an actual activity that takes time and effort and you just kind of enjoy that and it involves a lot of movement around and what not. Yeah tell me how's your FASA? I've been doing I eat one meal of day. I've done that for a whole time now. Yeah it's and I do not tell",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "and effort and you just kind of enjoy that and it involves a lot of movement around and what not. Yeah tell me how's your FASA? I've been doing I eat one meal of day. I've done that for a whole time now. Yeah it's and I do not tell anybody that I do it because like I'm fasting or I'm trying to do anything I think based on my genetics it is my disposition because my uncle eats like this my dad before he died ate like this. It's just how a lot of the dudes in my family are. I vastly prefer I think I went through college. I was force feeding myself trying to put on size because I was working out a lot like I literally was at the point where I was blending chicken breast and drinking it. So I got really sick with food and how the taste how the taste of blending chicken. Powerful. Packing. Terrible. As soon as I realized how dumb I was and that I should have just been eating like tuna out of the packets I was the biggest village idiot that I didn't have to drink blended chicken but anyways I learned quickly how dumb that is and so anyways I prefer this structure personally. I'm curious how you're finding it. Yeah no I didn't know you did Oman one meal a day but yeah I mean that's I started right did Oman intermittent this is an extreme",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "but anyways I learned quickly how dumb that is and so anyways I prefer this structure personally. I'm curious how you're finding it. Yeah no I didn't know you did Oman one meal a day but yeah I mean that's I started right did Oman intermittent this is an extreme form intermittent fasting and I did these done a couple extended fast like gone as long as four days. Well I should take that back. Technically five days but there was a little you know that's what it has you know you know you know you know just have like creamer with coffee because the moment you have cream kind of breaks the fast but that's why I pause there but you know it's I mean I've lost quite a bit of weight I feel healthy you know it's it's I'm not done yet I think it's a great lifestyle and it saves a lot of time like I'd say that's the thing that actually was the most surprising part it's like people underestimate how much time they spend cooking ordering eating like it's about being an outlier now if you're going to be an outlier you're going to be really time efficient not just healthy if you can do both you're going to be ahead no matter what right so I'm a big fan of it I think it's I think it's not health advice but I think people should learn more about it I didn't learn know that",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "really time efficient not just healthy if you can do both you're going to be ahead no matter what right so I'm a big fan of it I think it's I think it's not health advice but I think people should learn more about it I didn't learn know that much about it myself until I started doing it and that's one of those things where the targeted ads on X actually worked because for whatever reason I started seeing ads on intermittent fasting I was like all right let me look into it start watching some YouTube videos as in podcasts and going back to the point simplest answer the right one just don't eat right and you know that's yourself right I mean I'm sure you know as as the day goes on once you have you that one meal you get really focused right you get this kind of like superhuman abilities it just really be centered in terms of whatever you want to do and it's true that the more you eat the more you get distracted right and there's a by there's a lot of reason for that you go back to our ancestors it's like all right if you didn't eat for a while you were caveman your body said you better go out and hunt if you're gonna let an hunt for me you better be focused right so there's a lot of it's like even DNA genetic aspects to it from my",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "like all right if you didn't eat for a while you were caveman your body said you better go out and hunt if you're gonna let an hunt for me you better be focused right so there's a lot of it's like even DNA genetic aspects to it from my kind of evolutionary perspective that I think are fasting look I started doing it even as it released to me as a portfolio manager of funds right nobody can control the value of their portfolio I don't care what anybody says nobody knows day to day what their portfolio is known right I always go back to there's no boo-roos only cycles certainly in my world the cycle I need is that risk on risk off like safety sequence credit spreads widening churches working against equities they're going down okay I can't control that I have to only wait for it and hope that my funds with their rules based approach the signaling get get it right so when you're in the business of product development bringing strategies to market like I am you recognize you can't control the outcome of the portfolios you get assets because you're performing in your funds but you can't control that so you actually feel pretty helpless in these periods right it's like shit I'm working so hard I'm putting all this effort I'm out there I believe when I built but you know it's day after day after day you're waiting for the",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "your funds but you can't control that so you actually feel pretty helpless in these periods right it's like shit I'm working so hard I'm putting all this effort I'm out there I believe when I built but you know it's day after day after day you're waiting for the light to change so I said myself all right if I can't control the value of my portfolio if I can't control my career which is dependent upon the cycle that I'm in that I operate in let me control my health let me control what I'm putting into my body and then I started making a point I go out every morning I wake up at 5.30 in every morning and I go out and I walk the gym and I'm just every single day at no days I'll go to the gym I'm doing a long walk on the gym lifting I'm doing an older age right but not terribly old but you know certainly not like you right back in college I was not that kind of guy so I think that mindset is helpful because at least for me it kind of keeps me seen as I'm waiting I think well and it's also very stoic of you right because I I'm a huge studia of stoicism I came across it mostly during covid marine officers we always like to think we're still exposed but most of us don't know what the fuck it is um",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "I'm waiting I think well and it's also very stoic of you right because I I'm a huge studia of stoicism I came across it mostly during covid marine officers we always like to think we're still exposed but most of us don't know what the fuck it is um but I started studying a lot and it talks a lot about sphere of control right which is exactly what you're talking about there but one of the things I find really fulfilling with any sort of like physical endeavor is that once you can literally force your comfort seeking sign of your mind into submission to literally submit to your will it's actually very powerful because you start to realize how frequently on a day to day basis you are just acting off of subconscious impulses because your body is trying to offload as much thought as possible atomic habits goes into a lot of this which is a great book by James clear but yeah I'm actually really stoked for you because I think there's a lot of great things that come out of that and then I mean working out just for resilience like literally just you don't have to be like super strong or anything if you don't want to be just for general resilience is good and yeah I I think that that's a massive change that somebody can make in their life now before we pivot too far away from the funds stuff I",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "don't have to be like super strong or anything if you don't want to be just for general resilience is good and yeah I I think that that's a massive change that somebody can make in their life now before we pivot too far away from the funds stuff I did want to talk to you about that because that is one of my favorite things to pick your brain on because that's not something I've done right I've been a retail trader of my whole life so I am completely ignorant to that world when you are deciding your funds did you have a thought that yes I'm gonna make this fund this fund and this fund or is it more of a oh this one seems like a good idea and then it sprouts the next idea and like so yeah okay so good question so so ideally this is now from the business side of things right I'm an entrepreneur right and I did launch my funds at these acro time because the cycle didn't favor the risk off after your set of treasuries last two years the idea is you want to build a fund family right so diversification is not just about what you're trading if if you're an entrepreneur you ideally want to have a diversified number of funds because the reality is going back to you can't control the cycle all right you want to ideally have I hate to say it this",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "right so diversification is not just about what you're trading if if you're an entrepreneur you ideally want to have a diversified number of funds because the reality is going back to you can't control the cycle all right you want to ideally have I hate to say it this way but it's truth you always want to have something that can sell like that's just the reality meaning something that is likely to perform well while other things are maybe not performing as well you're trying to build you're trying to get assets you're trying to get people to pay attention that's what all these fun complexes do they have multiple funds and a cycle doesn't favor one asset class but the other asset class works okay so I want to I always want to build out a fund family the the commonality although funds is that they all rely on treasuries right which you can argue with my critical flaw in the development but it's all for good reason based on the hindsight data of how treasuries tend to act right against activities but the signaling actually tends to be different so I design the other funds to have a correlation that's fairly low against each other so I've got my mutual fund attacks by 2TS for Roro and Jojo on the indices for Roro and Jojo against the attacks to look at the fuller history the correlation when I ran it was about 0.33 so I was",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "have a correlation that's fairly low against each other so I've got my mutual fund attacks by 2TS for Roro and Jojo on the indices for Roro and Jojo against the attacks to look at the fuller history the correlation when I ran it was about 0.33 so I was trying to create a fun family that was inherently risk-on-risk off in content but actually not that correlated to each other except when you're in the real risk off periods where they would likely all be in treasuries and play defense right it's challenging to bring three funds to market which have a correlation of 2.33 to each other at least you know based on that history and then be in the one period where they're correlated to each other because again they rely on treasuries right I'm hopeful that's over but you know this it was a purposeful decision on mine now I designed all my strategies to avoid large drawdowns and equities in the risk-on asset by being in treasuries during those drawdowns I did not avoid I did not design the funds to avoid drawdowns and treasuries by the way that's nearly impossible to try to avoid drawdowns in both systematically because almost never happens that's just fact right pre-voker post-voker it doesn't matter I can show you the data on that right so and if I could do that then I have a perfect strategy because it means like you know we never have a drawdown",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "drawdowns in both systematically because almost never happens that's just fact right pre-voker post-voker it doesn't matter I can show you the data on that right so and if I could do that then I have a perfect strategy because it means like you know we never have a drawdown basically if you can constantly kind of wiggle between the two so brutal period by the way every asset class at some point goes to a lost decade I don't care if it's commodities I don't care if it's gold that's part of commodities I don't care if it's bonds like we've seen already I don't care if it's equities how many lost decades has the SP had as the NASDAQ have like everything and by the way active strategy has lost decades so I went through a nasty drawdown out of the gate with what happened with Roto and Jojo in particular because I launched them just before this treasury you know nasty bear market started the signals were right to say risk off but risk off didn't work treasure didn't work and it's rules based now I am stupidly optimistic because I think the cycle's gonna come my way could be wrong just like I've been wrong about the credit event so far but I know that every day that goes by I'm closer to being right that's what keeps me optimistic and now combined with the fasting and health it's like all right I'm even more energized",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "way could be wrong just like I've been wrong about the credit event so far but I know that every day that goes by I'm closer to being right that's what keeps me optimistic and now combined with the fasting and health it's like all right I'm even more energized like physically right it's like yeah let's go I'm ready to go I'm ready for this thing to start picking up again Roto has done very well this year it's up I think here today like 25 26 percent right even though I haven't had the risk off period if I get a risk off period which may still happen in to December all right we'll see you know it'll surprise a lot of people not me because I know how this can work but but fear going back to your resurrection you know you think about it from a business perspective you know you want to have multiple products that are not correlated to each other on the hope that at least one of them will work it so happens in the cycle none of them worked now how did you align that you wanted to stick to long only versus either shorting or using derivatives because to me it does seem like the more pure style hedge at least if you know we want to hedge downside from a long delta portfolio or something like that so how did you think about that yeah so it's actually interesting",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "only versus either shorting or using derivatives because to me it does seem like the more pure style hedge at least if you know we want to hedge downside from a long delta portfolio or something like that so how did you think about that yeah so it's actually interesting interesting to talk to I would argue that you don't want to have a perfect hedge you don't want a perfect hedge would be what perfect hedge would be you know inverse my shorting okay what's the problem with having a perfect hedge make your time that's be perfect right it's like you know the exact mile mark or something's gonna happen so you take a directional bet okay if you do any kind of a long series back test I don't care what signals you're using right what happens is you will inevitably get a full signal a type 2 error right meaning your signals have play defense and the market goes higher okay so if you're in a type 2 error in a full signal and you're short you lose money one for one the perfect hedge hits you because your timing was wrong right same problem with cash by the way right but it's like why do the studies show that market timing doesn't work using cash this cash has no momentum so if you're wrong the market goes higher you're missing out you're not compounding right that's why studies show market timing does the work versus",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "cash by the way right but it's like why do the studies show that market timing doesn't work using cash this cash has no momentum so if you're wrong the market goes higher you're missing out you're not compounding right that's why studies show market timing does the work versus my goals right whereas if instead you use an imperfect hedge which will go back to things which benefit historically from stock market volatility not direction volatility the flight to safety trades of gold the dollar utilities treasuries themselves you can be wrong in the timing meaning you could play defense in either one of those four and the market goes higher but you can still make money because you're not inverse equities right so it's really the function of and it's just come from my years of just back testing strategy development in general the opportunity set with which you express being wrong will matter more than being right right and yeah you can be really right when you're short and I'm sure a lot of people I'm sure you included make some good money when you're making a directional bet but if you're going to try and do that systematically over time I would argue you're going to eventually have those streaks where that perfect hedge kills you perfectly and you're better off then playing something else all right now I get it right if you had done shorting or cash the last two years you did way",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "that systematically over time I would argue you're going to eventually have those streaks where that perfect hedge kills you perfectly and you're better off then playing something else all right now I get it right if you had done shorting or cash the last two years you did way better than playing defense and treasuries obviously because treasuries got killed but that's an anomaly it's an outlier to be about outliers right that that doesn't happen that what we saw with treasuries is a once in a multi-generation move I'd rather bet that that's going to come back to being a better hedge going forward than we've ever seen you know in the last 20 years have you considered something like volatility products though that you could still trade long the problem with that as you know is that it's it's no different than shorting in that you're betting at time right in that case now I'm keeping it complexity right I do think if if you were going to try to do something like that you want to do it you want to be a lot you want to allow yourself to be wrong cheaply which means and that's where you know in your world comes into play if you can get out of the money puts and they're really mispriced and cheap and you get a risk off defensive signal okay that I can be I can be on board with because it's not really a directional",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "that's where you know in your world comes into play if you can get out of the money puts and they're really mispriced and cheap and you get a risk off defensive signal okay that I can be I can be on board with because it's not really a directional bet that's an insurance bet right that's it's a different I argue that's a different kind of hedge where you're not going to lose big right for the small amount with convex convex payout but you know I mean it is true that this way you never see really a very rich short seller rather than Jim Chanos you know I mean who else has really kind of is out there known as this kind of killer short seller that's his mandate or her mandate and they just make a ton of money it's very hard to do because the timing has to be perfect go back to path matters more than prediction and then let's go back to the let's go back to the November first week in November point I said circa breaker was likely okay by there is a short said my strategy for infresories TLT I think was up like 4 that week or something I got so you wrong in the idea in the direction still a money I'll take it I was actually looking at the humor of it all to be honest just to take an opportunity to put a little bit of",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "think was up like 4 that week or something I got so you wrong in the idea in the direction still a money I'll take it I was actually looking at the humor of it all to be honest just to take an opportunity to put a little bit of salt comedically in your wound and I started entering TLT on the second of November and then on the 13 yeah it's been working it's it's been very nice but it's the reason I think that's so funny obviously it's just because you are following and that's that's actually why I find your approach so fascinating to me with like a rules based approach because one of my arguments against retail traders there's this thing where retail traders say like oh I want to be mechanical I want to deploy mechanically and it's sounds so great right it sounds super cool but unfortunately I genuinely don't believe that that's how that works super well as far as I can tell so I look at the way that your funds are designed to perform and it is really curious how you handle uncommon events like this now I don't know if you follow much of Naseem's work or just that style of thought where we think uncommon events are actually far more common than we tend to price in is that something that you think about with these funds in any capacity going forward or do you think that will still",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "you follow much of Naseem's work or just that style of thought where we think uncommon events are actually far more common than we tend to price in is that something that you think about with these funds in any capacity going forward or do you think that will still normalize so I'm a big fan of actually Taliban Black Swan and Fulbeira and Visalissa the what I would say is like the last years had been the outlier like that's just fact I go back to I don't care how many people on Fin Twit Finnex on social media in the media say anybody could have seen stocks and bonds with lose money how could you launch funds knowing that that was going to happen I had somebody actually say that to me it's like are you kidding me it's like cost 250 grand to bring a fund to market you think I want to just spend that money yeah just for fun oh yeah let's just see oh maybe I'm you're wrong let me take the risk and put a 250k chip right with somebody who's going to game okay so okay fine let's say anybody could have seen stocks and bonds will lose money could you have said that stocks and bonds will lose money while credit spreads would stay tight while default risk would not increase in the fast history of high cycle industry in that dual seller you may break and nobody would say that",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "seen stocks and bonds will lose money could you have said that stocks and bonds will lose money while credit spreads would stay tight while default risk would not increase in the fast history of high cycle industry in that dual seller you may break and nobody would say that that's crazy to talk about outlier the outlier was not that stocks and bonds fell the LL was how it happened the path the interaction did not come effects to credit spreads that's what made this an outlier because that's why treasuries didn't counter high volatility sequences the flight to safety which is what I built my funds on and no one is more tuned into that than I am because I have skin in the game and I built funds that I know the research around it so I know how how anomalous that is now look you do any kind of back tests on any indicator you go back to the 1920s you will always have always always have periods where it's not working well wait just like you have periods where buying whole lesson P is not working where's an outlier on beta you're always going to have that you're oh wait I challenge and if you don't have that you were made off you've done something wrong in your modeling there's no such thing as somebody having 20 20 years of no negative returns and if you do have okay then you were a probably more",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "have that you're oh wait I challenge and if you don't have that you were made off you've done something wrong in your modeling there's no such thing as somebody having 20 20 years of no negative returns and if you do have okay then you were a probably more lucky than skillful because in any statistical data is that you will always have an outlier and the outlier can be luck in our business especially because you don't again you can't control your portfolio so it's skill and luck so maybe it's more luck okay so when you're going through these cycles the reality is you have to just take it you have to wait for it to change right and in my case I don't have a choice like the funds have just respect this I designed them this way right so it's like and this is also what I think the retail community when they look I mean I put myself out there a lot and I communicate a lot and I'm loud and aggressive and I'm not just on social media because it gets attention as I'm waiting for a cycle to change it's just the reality I have to play that game I keep saying it's a persona because anybody look at the funds would say why should I listen to this guy who's this professional C.F.H. Charterholder but man he can make me laugh like that's the it was a communication bet when I",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "reality I have to play that game I keep saying it's a persona because anybody look at the funds would say why should I listen to this guy who's this professional C.F.H. Charterholder but man he can make me laugh like that's the it was a communication bet when I did that that put it but when you're going through that hell you've got to keep going through it right now if you're a retail trader and you're going through a streak where it's not working you have the luxury to step away you have the luxury to not have a mandate when you're in the business of investing and your fiduciary and you have a strategy that you hope will be different than every other strategy that's out there and competes against a very crowded mutual fund and ETF space you can't do that right you're designing something for a particular environment that you may not be in but at some point will come right so you don't actually have the question what do you do not much you just have to wait and hope now it's like people say hope is not a strategy it's like no I disagree I hope it's not an equifix strategy if you don't have hope as part of your as part of the mindset of a strategy how can you wait for the turn to come your way well it also dismisses the concept of luck if somebody thinks that there's no",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "disagree I hope it's not an equifix strategy if you don't have hope as part of your as part of the mindset of a strategy how can you wait for the turn to come your way well it also dismisses the concept of luck if somebody thinks that there's no hope which I would definitely argue against we're coming up on time here but I do want to catch you with one more question before we go looking back over 2023 a lot of interesting things happen and I feel like you put out a lot of content that talks about a lot of those events but I want to pivot us to 2024 is there anything in particular as we look into the next year that you're interested in or that you think could be an interesting catalyst or an event to watch so I historically it is true that small caps tend to underperform in pre-election years not to the extent that we've seen this year the magnitude but it's true that pre-election years large caps do tend to outperform small caps in election years though which is what next year is small caps do tend to outperform large so I think from an asset allocation perspective there is an argument to be made that next year will not be the year the magnitude seven that there will be the it'll be the year smid small mid cap so it's like if you're going to play equities the",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "large so I think from an asset allocation perspective there is an argument to be made that next year will not be the year the magnitude seven that there will be the it'll be the year smid small mid cap so it's like if you're going to play equities the catch-up trade which everyone talks about probably does manifest right next year the question becomes the sequence in other words does it happen at the start of the year or after some kind of you know capitulation credit event which I still think is the more likely near-term scenario right but I think that's probably the real area to kind of pay attention to right it's just that play the laggards that's probably going to be the biggest leader I also think that there will be a lot of demand and money rotating anyway from a sector perspective into anything that's dividend oriented right so dividend as you know dividend stocks have not been well all relative basis utility have gotten smashed relative to the smp why because you know utilities and high dividend paying sector has been competing against the Fed as far as income goes same thing with consumer stable same thing with with healthcare blue shifts if Fed is done which it seems like they are and if you get any kind of heightened volatility you would expect that defensive sectors which are high dividend paying sectors utility stable now care probably get some relative strength as",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "consumer stable same thing with with healthcare blue shifts if Fed is done which it seems like they are and if you get any kind of heightened volatility you would expect that defensive sectors which are high dividend paying sectors utility stable now care probably get some relative strength as well so there's two trade it's right there's the defensive sector allocation from large cap side utility stable health care and then there's the cap rotation from a small cap side right which I think both can work the thing I most confident in which I could totally wrong on is that we're probably not going to see this large cap dominance like we've seen you know the last you that that that part of this cycle is probably towards the ends doesn't mean that we're going to all collapse it just means it's going to be finally rotational and hopefully allows those that are actually benchmarking us the smp to beat the smp because guess what you can't beat the smp as an asset okay or if it's the only game in town you want to you need to have other asset classes leading and outperforming that's been what's been so maddening about this cycle because it's been old market cap at seven-starred striped mold them that's not just me saying that by the way I talk to financial advisors all day long that's them saying it's like any kind of diversification is sucked this year it has not",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "been so maddening about this cycle because it's been old market cap at seven-starred striped mold them that's not just me saying that by the way I talk to financial advisors all day long that's them saying it's like any kind of diversification is sucked this year it has not been a free lunch all right it's been a vomit yeah and I feel like that's the nature of diversification right there's always an opportunity to cost associated with it I am curious to see how tech continues to perform I'm glad that you highlight that and then also small caps for anybody that follows like my youtube channel I trade Iwm a lot so I definitely am kind of looking for a very similar movement as you're talking about which I actually find interesting for that thesis but Mike you're always super gracious with your time and I'm stoked to have chat with you I'll throw links to kind of everything that you have in the notes below but for the people on the youtube channel side of things if you have a specific spot that they can reach out to you where's that yeah I mean on all the major socials at Lee Lagerport on x youtube and scrim leadlagerport.com also on substacking and the funds which are separate I always stress two legal entities atackfunz.com with the caveat that the funds have not done well but you know there's a I was back to meaner version is",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "the major socials at Lee Lagerport on x youtube and scrim leadlagerport.com also on substacking and the funds which are separate I always stress two legal entities atackfunz.com with the caveat that the funds have not done well but you know there's a I was back to meaner version is the only thing you can say is close to guaranteed nothing's ever guaranteed a market the closest thing to a guarantee you can argue is meaner version now you can pay where the mean is right where the average is but it's like meaner version is a concept that's as old as the bible I always go back to this analogy he was first shall be last and last first is meaner version that which lag leads that which leads lags right that goes to sectors market cap also goes to funds so I'm hopeful that my meaner version for those strategies is about to kick in but I'm sure either way whether it does or doesn't I'm still going to have people I'm going to block on x relentless that sounds about right and I will be there enjoying the show as I typically do otherwise but like thanks so much for hanging out man thanks for being on the podcast and for everybody else check out the notes below and you'll be able to find them on all those different spots but till next time we'll catch you later man.",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  },
  {
    "text": "so much for hanging out man thanks for being on the podcast and for everybody else check out the notes below and you'll be able to find them on all those different spots but till next time we'll catch you later man.",
    "metadata": {
      "video_id": "YuRM8JxNQzQ",
      "title": "Credit Events w/ Michael Gayed | The Outlier Podcast Ep 55",
      "url": "https://www.youtube.com/watch?v=YuRM8JxNQzQ",
      "upload_date": "",
      "duration": 3383.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 54,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=YuRM8JxNQzQ&t=0"
    }
  }
]