[
  {
    "text": "Boom, we're back at it. Today I want to talk to you about zero DTE option structures and which one is the best. There are a lot of different ways you can trade these things. And you might not even know why we trade these things. So the goal of the video is to briefly overview why we trade them. And then I'm going to walk you through five years of back-tested results of trading different zero DTE structures with different rules applied to them so that you can start to understand what performs best and what market conditions and then going forward. If you guys are interested, I can make a couple follow on videos that dive really deep into detail on the top performers. So if you watch to the end and drop in the comments what your preferred strategy is for me to take a look at, might be able to throw it in the next video for you. So what's up everybody? Eric here. Welcome back to all the outliers and a shout out to the Patreon family. You guys make content like this possible and pay my editor. So he thinks you as well. Thank you. Let's get into details. So what's the premise of these zero DTE strategies? Now for most people it's probably because they think they're going to get rich quick, which is arguably probably the worst possible reason to start trading these for a lot of different reasons. If you haven't",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "you. Let's get into details. So what's the premise of these zero DTE strategies? Now for most people it's probably because they think they're going to get rich quick, which is arguably probably the worst possible reason to start trading these for a lot of different reasons. If you haven't seen this previous video that I did called master zero DTE options, what you should, it dives into these really far into detail. And this is the punchline. Most people lose money doing these. Like that's what it comes down to. So a lot of people start trading these with the wrong idea in mind is that it's fast, easy money. And it's genuinely not that like at all. So let's take a look at why we do this. It's really to capture variance risk premiums. If you're unfamiliar with what that concept is, I'll throw a video in the notes below for you so that you can take a look. But in short, it's the propensity for implied volatility to be overstated compared to historic volatility. That's it. So with that knowing that we want to capture it and we think that there's an opportunity to do that on zero DTE expressions because there is let's take a look at what structures we're going to analyze. We're going to look at the short straddle, the short strangle, the short iron condor, and then the short iron fly. Notice how these are all short. The reason why this is short",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "zero DTE expressions because there is let's take a look at what structures we're going to analyze. We're going to look at the short straddle, the short strangle, the short iron condor, and then the short iron fly. Notice how these are all short. The reason why this is short is because to capture this effect, these are the specific strategies that lend the best. You could consider half of the iron condor being short call or put vertical spread something like that if you were so inclined or even butterflies could absolutely have an honorable mention on this video. But I want to focus on these for a few reasons and you'll see why in a couple moments. So now let's take a look real quick at the structures for each of these so that you are on the same pages. Me, the short straddle is going to be short of call, short of put at the same strike. This is the PNL graph notice how there's kind of this really sharp point here that is whatever that same strike is and then it has unlimited lost potential both to the upside and downside. Then we have the strangle, which is very similar, short of call, short of put, but these are typically at the same delta. They can be skewed, but a lot of times you'll see something like short, a 30 delta call short, a 30 delta put. And then it gives you this kind of picture",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "which is very similar, short of call, short of put, but these are typically at the same delta. They can be skewed, but a lot of times you'll see something like short, a 30 delta call short, a 30 delta put. And then it gives you this kind of picture for the PNL graph and this just gives you a wider range. What's the difference between these? Well, these typically will have a lower win rate, but a higher average win that may or may not be your style. And it's kind of the inverse for these. Now, another note is that when we look at something like a short straddle, this is typically considered to be much more of a pure volatility risk premium play. And there's a bunch of reasons for that that I'm not going to go into detail on this video. You can check out those other videos for that. However, sometimes the delta offset provided by strangles and being further out of the money can still help you more than this. So there's kind of a debate on whether it's best or not to trade the most pure expression of this as possible. And what I try to remind people is the goal, at least for me, is to make money. So I will flow between things as I need to make the most money. That's really what it boils down to. Then we have the short iron condor, which in this case, it's essentially",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "I try to remind people is the goal, at least for me, is to make money. So I will flow between things as I need to make the most money. That's really what it boils down to. Then we have the short iron condor, which in this case, it's essentially a short strangle, but you're buying further out of the money wings, both on the call and the put side. And that gives you defined loss as compared to the undefined loss here. And then we have the short iron fly, which is kind of doing the same thing for the short straddle. So now we have defined losses. Both of these will have lower average profitability. And again, that's the tradeoff you make for something like this. So these are the structures, the specific legs that I want to cover. Now, let's get into the meat and potatoes, which are the results. This first looks at 2018 to 2023. And we're looking at zero DTE positions that we enter at 10 a.m. And we are not applying any profit management or loss management. This means that we're just taking it into expiration. This is all in SPX. So these are cash, settled European style options. And we look at a few things. So here we have a 15 delta strangle, 20 delta, 30 delta, 40 delta strangles. Then the 50 delta, which would be a straddle. Notice a bunch of different of the metrics here. I have them color",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "are cash, settled European style options. And we look at a few things. So here we have a 15 delta strangle, 20 delta, 30 delta, 40 delta strangles. Then the 50 delta, which would be a straddle. Notice a bunch of different of the metrics here. I have them color coded because I am a simple man and I like colors. That's great. But what does that have to do with anything? But it kind of highlights some of the easier things for you to see. The very first one is interestingly, the further out of the money series actually performed the best when you compare it to things that are closer to the money like 30 or 40 delta. Now, the 15 and 20 delta are very similar. It's essentially the 20 delta made 1,000 more. If you take a look at the max loss, the 15 delta had a much better max loss compared to everything else. So what's going on here? Well, interestingly, because the market has experienced a pretty significant uptick in volatility. And what I mean by that is typically people will say, oh, if volatility is high, you should sell, right? Because you make more money. Well, sort of. The way you make more money is if implied volatility is tracking over historic volatility. And look at this handy, dandy IVHV graph that I have here. And you'll notice quite a few periods where historic is actually much higher than implied. This happens in",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "more money. Well, sort of. The way you make more money is if implied volatility is tracking over historic volatility. And look at this handy, dandy IVHV graph that I have here. And you'll notice quite a few periods where historic is actually much higher than implied. This happens in higher volatility regimes. So this whole idea of when things are high, you just default to selling may not work out the best in every single strategy. Because what I want you to look at is the size of the candles. This is pre-COVID. This is 2019 in early of 2020. Notice the size of these candles. If you look at the average, and this is for a whole week, if you look at the average weekly move here, compared to pretty much everything post-COVID. Notice how massive these moves are. And you can see that again, represented in the sizes of the candles. The reason why that matters is that in a higher volatility environment, these perform very differently than you might expect. Because in a lower volatility environment, typically the short straddle would actually perform better. So now let's take a look at some of those other structures that we talked about. If you'll notice here, we're now adding the long leg of the option to all of these. So instead of just being the 15 delta short options, we're now adding a 5 delta wing and then a 10 delta wing so that we can compare the",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "that we talked about. If you'll notice here, we're now adding the long leg of the option to all of these. So instead of just being the 15 delta short options, we're now adding a 5 delta wing and then a 10 delta wing so that we can compare the width of these different wings and the overall profitability. And then what we also have is the same style movement for the iron fly, except for I did a bunch for the iron fly, where we had the same 50 delta column put. But then we went everything from a 10 to a 45 delta. So what do we learn here? Well, first, there are a couple big highlights. The 20 delta short strangle worked the best with no wings. Then when we're looking at what worked the best with wings, you have two choices. You have a really narrow, five point wide spread at short 15 delta long 10 delta's, which gave you 36,000, or you could do the 20 delta's 10 delta's, which got you to 37,000, but notice the difference in the max losses here. A negative 11,000 versus negative 9400. And then the average loss here is 2200 compared to 2700. So you have to figure out which of those might be right for you. And let me take a quick pause here, because if you look at this data in all of a sudden, you just start trading one of these blindly going forward. You're",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "is 2200 compared to 2700. So you have to figure out which of those might be right for you. And let me take a quick pause here, because if you look at this data in all of a sudden, you just start trading one of these blindly going forward. You're doing what's called overfitting. And it's important to be cognizant of this. And that's essentially when you're cherry picking the best combinations of things and then expecting that to hold going forward. So that's actually why maintaining a live data set is so important. It's one of the things I did this year. I have another video in the description for you to check out on a pivot that I made. Because in the beginning of the year, I was telling you guys, and in the beginning of this video, I was telling you how the 50 delta straddles outperformed in lower volatility environments, but it necessitated a move. And it's because we're in a different environment. So if I had just cherry picked using the 50 delta straddle and ignored all other data going forward, expecting that to continue to be the case, I would have been in a bad position. So you have to be careful when you look at back tests for overfitting, which is when you just cherry pick the best possible things. And then that is the expected outcome going forward. You have to stay very sensitive to new information. And then down to the",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "bad position. So you have to be careful when you look at back tests for overfitting, which is when you just cherry pick the best possible things. And then that is the expected outcome going forward. You have to stay very sensitive to new information. And then down to the iron flies, the best choice here, the only profitable choice here was actually five point wide iron fly. What does this tell you? Well, it means in this case that implied volatility was still tracking below historic volatility too frequently. And the only reason why this did okay is because it reduced so much of the outsized moves. So it took our average loss in pretty meaningfully. So this is the first step for us to analyze these different structures. So in the comments below, let me know what structure you think is the best. And then based on those, I'm going to make a follow up video so that we can actually dive into even more detail on some of the specifics here so that we can see not just in an aggregate five year period, but year over year, how the best performers behaved. Then I want us to look at the optimal entry time. What time of day works the best? Then I really want to get us to this, where we test slightly different time frames. This will be a really important test because there are some much better configurations than zero DTE in terms of",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  },
  {
    "text": "to look at the optimal entry time. What time of day works the best? Then I really want to get us to this, where we test slightly different time frames. This will be a really important test because there are some much better configurations than zero DTE in terms of overall profitability. I still trade most of them in a lot of different permutations, but this I think will be very interesting to us. However, we need to figure out what we're going to use for this. And that's going to be based on what you guys throw in the comments below. So let me know and we'll take a look. Like, subscribe, share, be an outlier. See you guys later.",
    "metadata": {
      "video_id": "z9YbIRtXbrg",
      "title": "0DTE Option Strategy Comparison",
      "url": "https://www.youtube.com/watch?v=z9YbIRtXbrg",
      "upload_date": "",
      "duration": 649.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 11,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=z9YbIRtXbrg&t=0"
    }
  }
]