[
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "What's up, outliers? Welcome to a new podcast episode. This is actually Shrey J's Brain Child. We were talking in the community about different ways to convey information and Shrey had the idea for this podcast, which we're calling outlier trading unfiltered. The goal for this is to try and explore topics of interest to the community, whether it's stuff that we recently covered, something that the community is struggling with trying to work through, that we think is beneficial for just broader folks to be aware of, to think through themselves. The reason why Shrey J is such a good fit to do this is actually because he's been in the community essentially since the beginning. So he knows the way that I think in the way that I do business very well. And he's also familiar enough and more temporally proximal to the new trader journey, which is a lot of you know, I literally started in 2007. I've been doing this for nearly two decades. I definitely remember some of the aspects of when I started, but I'm under no false pretence that I somehow completely understand the paradigm of like the beginner trader today. So I think he will be super useful in helping bridge that gap because sometimes when I'm explaining something or talking about something, I will think all the dots are connected, we're at a good point and this topic is like you know, well discussed. And in my own ignorance, I'll kind",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 100.64,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "think he will be super useful in helping bridge that gap because sometimes when I'm explaining something or talking about something, I will think all the dots are connected, we're at a good point and this topic is like you know, well discussed. And in my own ignorance, I'll kind of forget the point that in that conversation or in that thought line, there might be several things that I'm taking for granted on the other side of the equation and the other trader might be like, yo, what is implied volatility, right? Like something that simple, like I take that as granted, but it might not be. So first of all, Shrey J, welcome on again. It's been a while since we did any sort of video together, but I'm super, super stoked to do this with you to chat. And I think it'll be genuinely like really, really useful for people. So thank you for doing this and then also thank you for recommending the idea because this wasn't on my radar, but we can make things happen. So welcome on man. Thank you. Thank you. Thank you. Thank you a lot. I'm really happy to be here. Thanks for having me. It's always a blast chatting with you. I really enjoy it. But before we get to the main topic, I actually want to do take a few minutes diving to some of the market updates from this week. Did anything from banks earnings that I've reported",
    "start_timestamp_seconds": 80.64,
    "end_timestamp_seconds": 156.32,
    "start_timestamp": "01:20",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=80",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "Thanks for having me. It's always a blast chatting with you. I really enjoy it. But before we get to the main topic, I actually want to do take a few minutes diving to some of the market updates from this week. Did anything from banks earnings that I've reported so far? Catch your eye? Hmm, a couple things I think in general, the health of the consumer is still like profound. I also think that you're getting a glimpse as to how effectively the banks are going to be able to navigate the lower rate environment because you can see that across the board a lot of the banks are beating, right? So if we look at Bank of America, they did okay, even Goldman Sachs, they had a gap up. They did okay. So you're also seeing it across like different size banks, different general leanings for the banks walls far go. Apparently they were able to open up a big a bunch of like fake accounts for people. So they absolutely crushed it. You never know what those guys if it's actually good earnings enough, but so far it looks really good. I think the financial sector has just been displaying unmitigated strength. Like that's what continues to stick out to me at the sector level and then you can see it across the sub sectors. I think the most interesting thing is death definitely charge offs and seeing the difference between commercial level charge offs and",
    "start_timestamp_seconds": 146.08,
    "end_timestamp_seconds": 227.6,
    "start_timestamp": "02:26",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=146",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "has just been displaying unmitigated strength. Like that's what continues to stick out to me at the sector level and then you can see it across the sub sectors. I think the most interesting thing is death definitely charge offs and seeing the difference between commercial level charge offs and consumer level and the consumer is still strong. And I think a lot of people haven't really expected that at least up into this point because it's been kind of a challenging environment for a lot of people. Especially if you consider stuff like the average mortgage payment as a percentage of disposable income. If you've taken a mortgage out since the rate environments have been up, it's way higher. That's not easy on people. Yet there's still finding ways to engage, essentially across everybody offer different terms, offer ways to lower down, mortgage rates and whatnot. So overall synopsis of all of that robust. Like that's what strikes me. The financial sector looks really robust and the deregulate story environment with Trump. I mean, you can see that just bleeding through. That's why we saw one of the initial moves in financials when Trump had won and I think that that's just continuing to play out. Yeah, I think I'd agree particularly in the big banks that they've once that do the investing business investing banking business. They're a lack of fees. They've been more constantly checking mortgage.js. There's M&E activity going on. IPU activity that they're exposed to.",
    "start_timestamp_seconds": 209.84,
    "end_timestamp_seconds": 297.76,
    "start_timestamp": "03:29",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=209",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "that that's just continuing to play out. Yeah, I think I'd agree particularly in the big banks that they've once that do the investing business investing banking business. They're a lack of fees. They've been more constantly checking mortgage.js. There's M&E activity going on. IPU activity that they're exposed to. So generally good revenue, they're continuing to generate more assets and management from both the asset and wealth department. So even like you mentioned, the consumer facing banks are actually doing well as well. The consumer doesn't seem that stressed, at least from the reporting that they will follow somehow had to have an opportunity to drop off the net loan charge off that they're doing. So they're able to get away with that. So I guess they have more money to invest them back up low bike records. So we'll see what happens. But from last week, I was particularly interested in delta airlines earnings. I didn't know if you called that. They were talking about expanding the premium offering premium seats. And that was that is a certain shift in how things are done in the airline industry. Usually to be cramming as many number of people that building up units. Like how we talk about, right? Just getting to getting to revenue from that. But now it seems like they're expanding their offerings, doing upgrades within existing airplanes, retrofitting them and ordering new planes with larger number of private or premium seats. So yeah, really interesting economy",
    "start_timestamp_seconds": 283.28,
    "end_timestamp_seconds": 373.52,
    "start_timestamp": "04:43",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=283",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "building up units. Like how we talk about, right? Just getting to getting to revenue from that. But now it seems like they're expanding their offerings, doing upgrades within existing airplanes, retrofitting them and ordering new planes with larger number of private or premium seats. So yeah, really interesting economy where they are able to see that. There's a section of consumer so can pay more and hire much and generate hire much and from that. The interesting thing about that is in environments like this, especially the higher rate environment, the unfortunate reality is those of us with money just get more. That like that is how it goes. It's it's shitty to say, but that is the reality. And I've talked about this. Like not only just my own trading returns, but the last few years have been my hands down most profitable since I've started this whole thing. And these kind of environments help a lot. So it's one of those really nasty dichotomy of just human existence. Where those with this kind of environment, it actually doesn't really hurt that bad in in some ways. It's quite beneficial. And then those without they're just punch twice because now they're just trying to make ends meet and shit's more expensive and like definitely feel fuel for that group. So the reason why I make that point is I actually had in one of my notes from like three years ago a couple. I do like outlines on",
    "start_timestamp_seconds": 356.88,
    "end_timestamp_seconds": 453.04,
    "start_timestamp": "05:56",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=356",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "because now they're just trying to make ends meet and shit's more expensive and like definitely feel fuel for that group. So the reason why I make that point is I actually had in one of my notes from like three years ago a couple. I do like outlines on some themes that I think are going to happen with different industries broadly, just that curiosity and one of the things I literally talked about was premium airlines. I actually think that this might be the beginning. I think that you might find that there could be flights that are not on 747s, but slightly smaller planes. But are a kind of gap between private and commercial. Because there's an appetite for that. I think the airline industry has been so interesting because there are a product of what consumers wanted. Right? Consumers themselves were the ones saying like, we want cheaper tickets. We want cheaper tickets. Well, what do you think comes with cheaper tickets? Smaller seats. You're going to get one thing of peanuts if you're lucky. Right? Like that's what makes cheaper tickets. Now again, I'll always make the point. The CEOs always seem to be doing okay. So I don't think they're margins are quite that bad. The CEO compensation for these things is tens of millions of year, which is insane. So yeah, I'm not sitting here saying like, whoa, is the airlines. They're doing all right. But that is a byproduct of that pressure",
    "start_timestamp_seconds": 431.28,
    "end_timestamp_seconds": 532.48,
    "start_timestamp": "07:11",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=431",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "okay. So I don't think they're margins are quite that bad. The CEO compensation for these things is tens of millions of year, which is insane. So yeah, I'm not sitting here saying like, whoa, is the airlines. They're doing all right. But that is a byproduct of that pressure and that preference for the consumer of things being cheaper. But I think exactly like we were kind of talking about a little bit earlier. We absolutely are starting to see that there is definitely appetite for the higher end consumer for a different experience. And I'll definitely tell you from my own. Like the first time you fly even first class, it changes. Like it changes a lot because you no longer dread getting on the plane at all. Like you know that you're going to have a spot for your bag above your head. So you never have to play the game of like, oh, I don't want to check a bag. So I got to make sure I get on my seat quick. So I have a space for my bag. That goes away. And you're in like genuinely comfortable seating. So when you're on a 10 hour flight, 15 hour flight, even the life-latt seats. Like that's a game changer. So yeah, I think for people that have the ability to travel in any version of those levels, it's typically really, really nice compared to the alternative. So yeah, I imagine the demand for real actually",
    "start_timestamp_seconds": 513.12,
    "end_timestamp_seconds": 601.12,
    "start_timestamp": "08:33",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=513",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "hour flight, 15 hour flight, even the life-latt seats. Like that's a game changer. So yeah, I think for people that have the ability to travel in any version of those levels, it's typically really, really nice compared to the alternative. So yeah, I imagine the demand for real actually continue. And it wouldn't surprise me to see these hybrid spin-off like offerings at some point. I don't think it could be for a while. But at some point, because margins for airlines aren't that great. All things can fit in. Yeah, yeah, it makes sense. It might have been, I do see that the potential of pod for them. Cool. I thought I'll give a little bit of introduction to myself since it's been quite a while. I've been on the channel. So I, well, I see described I've came across a channel about five years ago. I'm an engineer by training, but I'm a trader at heart. I accidentally came across your channel on through a Reddit post. In fact, the post was talking about the nuances of covered-striangle versus the real, the common section of that post was on fire. It was sending you to the Netherrealm company. It was like what we call bad out there. I'm like this guy's about that value. He's trying to teach us something important here. This value here. So that's how I came to visit the YouTube and I stayed there since it has been really five years. It's difficult",
    "start_timestamp_seconds": 580.08,
    "end_timestamp_seconds": 663.6,
    "start_timestamp": "09:40",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=580",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "company. It was like what we call bad out there. I'm like this guy's about that value. He's trying to teach us something important here. This value here. So that's how I came to visit the YouTube and I stayed there since it has been really five years. It's difficult for me to comprehend all that have learned during that time. But the first two of those years, we just mean, I think this would be helpful for people starting out in our community now. The first two years, if it was just deep diving. I was immersing myself in the content. You kept putting out so many videos after video. There's so much to learn and I kept just watching it, rewatching it and then slowly after maybe six or seven months. The good thing about me was I did not have to unlearn bad trading habits. So I was a clean slate that helped me to pick up information at the right point. So that I'm really fortunate that way. I was mostly implying whole investor before, you know, getting interested in trading. So I used the two years to mostly learn about what you're talking about. Why does this do keep saying process all the time? Just tell me how to make the body. Why does he keep saying the process process process? What does he mean by that? So I had to understand what that is. So start building logs. That's where I started after watching",
    "start_timestamp_seconds": 652.8,
    "end_timestamp_seconds": 726.48,
    "start_timestamp": "10:52",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=652",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "does this do keep saying process all the time? Just tell me how to make the body. Why does he keep saying the process process process? What does he mean by that? So I had to understand what that is. So start building logs. That's where I started after watching the videos. Then I made a trading plan, a trading log. And then in half way through the third years when I had enough confidence to deploy cash in real markets after going through paper trading for when you were before that. And since then I've just been doing it. So I wanted to talk about that a little bit because people always want to rush into deploy cash in the markets and real time. Little work is done trying to understand and prepare and just practice. There's no patience. It's difficult. Obviously we need to get to where we need to go past. And that's hard for for in an environment like markets where there are no rules, no boundaries. We can get slapped quickly. So yeah, so more than anything I just wanted to take this opportunity to thank you particularly for showing the path. And then hammering it into our heads that it even we can do it. And then giving us the tools to walk that part and creating the space like the outlier discord back when you created. I think it was called the outlier dojo. That's still stuck in my head. I still think",
    "start_timestamp_seconds": 712.96,
    "end_timestamp_seconds": 796.56,
    "start_timestamp": "11:52",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=712",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "it into our heads that it even we can do it. And then giving us the tools to walk that part and creating the space like the outlier discord back when you created. I think it was called the outlier dojo. That's still stuck in my head. I still think of it. I'm very protective of the community and also feel very passionate about it. So I mentioned this to you several times back and forth in the email. So I think of it as a dojo. It's it's it's good people trying to work out there, you know, the skill there. So yeah, I just wanted to thank you for that appreciate that. Yeah, no I really appreciate it. And I think the context that you share is absolutely hyper relevant. I can't imagine many people out there that started trading immediately had everything line up against their expectations and things go the way that they want them to. And there's one thing you said that actually really stuck out to me is that, you know, you can kind of get slapped down pretty hard in the market. And the first thing I popped in my mind is the irony because I think the worst scenario is actually when you get slapped down slow because the markets get they're extremely deceptive. It's not like doing something like surfing or even shooting, which is a hobby of mine or jujitsu or any sort of martial art. It's or basketball or",
    "start_timestamp_seconds": 783.28,
    "end_timestamp_seconds": 874.72,
    "start_timestamp": "13:03",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=783",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "irony because I think the worst scenario is actually when you get slapped down slow because the markets get they're extremely deceptive. It's not like doing something like surfing or even shooting, which is a hobby of mine or jujitsu or any sort of martial art. It's or basketball or anything, right? Like when you do these other things, you get immediate feedback. If I shoot the ball and I miss, there's a problem. I know I need to recalculate because the end goal of that ball going in didn't happen. If I'm in jujitsu and my goal is to strangle somebody and I wake up from a nap on the map, I made a graveyard. If it was another scenario, I would be dead. So I now need to understand in that exact moment what went wrong and you were so close flash to bang. Like you're still there with the person in the situation, you can rework what happened, work a defense so that you're not prioritizing getting hooks out with both your hands and leaving your neck exposed so that you get strangled. It's complete opposite in trading. Intrating, you can do everything wrong and you can make money and you can make money for some time and that's the concept of path, just how things happen to happen. The real scariest part of that is it can really trick people into thinking like, Oh, what I'm doing is working. I should size up my trades, it's",
    "start_timestamp_seconds": 848.0,
    "end_timestamp_seconds": 953.28,
    "start_timestamp": "14:08",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=848",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "make money and you can make money for some time and that's the concept of path, just how things happen to happen. The real scariest part of that is it can really trick people into thinking like, Oh, what I'm doing is working. I should size up my trades, it's working. Sooner or later, the performance will approximate to the skill. At that point, unfortunately the skill isn't there yet and that's normally when things go absolutely catastrophic for people, rather than just losing a few bucks. They make some money on some trades over a couple months and they think like, oh damn, like, I really got this down. Let me start sizing up. Something happens. And all of a sudden, they realize that, yeah, oil can go negative. Not something most people think about. But if you, in that example, were maybe a long, oil, you're like, oh yeah, I'm going to get super, super long, oil here at a dollar because it's not going to go negative. And then all of a sudden it goes negative and you sized way up because you didn't think it could go below a dollar. Then all of a sudden you're like, oh shit, now I have a margin called now I'm in trouble. So I think that you sharing your journey and your experiences really, really pertinent to people because one of the difficult things and this is the same thing in the military. Is the saying slowest moves smooth",
    "start_timestamp_seconds": 926.4,
    "end_timestamp_seconds": 1027.08,
    "start_timestamp": "15:26",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=926",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "like, oh shit, now I have a margin called now I'm in trouble. So I think that you sharing your journey and your experiences really, really pertinent to people because one of the difficult things and this is the same thing in the military. Is the saying slowest moves smooth as fast? When you're doing a lot of like very fine fine detailed movements, high motor movements. And you try to do them really fast. It inevitably is slower every single time. And the reason is because when you're under stress, you lose a lot of those minor control movements and you kind of default to these big gross overarching movements that make it difficult. What I'm specifically thinking of is something like a tack reload. So you're firing your rifle, you need to change your mag. If you try to do that is fast as you humanly can and that's your mindset, you're probably going to miss the mag release. You're probably not going to smoothly fit the new magazine in. You're not going to see it all the way. There's all these little things that start to follow parks. We're trying to move too fast. And the funny part about that is somebody can look like they're moving at the speed of lights, but they will perform slower than the person who looks like they're moving in slow motion. But everything is super smooth. So it comes together beautifully. It's the same thing with trading and a lot",
    "start_timestamp_seconds": 1008.6,
    "end_timestamp_seconds": 1099.2,
    "start_timestamp": "16:48",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1008",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "part about that is somebody can look like they're moving at the speed of lights, but they will perform slower than the person who looks like they're moving in slow motion. But everything is super smooth. So it comes together beautifully. It's the same thing with trading and a lot of people unlike you are willing to paper trade for any duration before. I'm actually curious how that went for you. When you first started paper trading, what was that experience like in terms of where you wanting to paper trade was it something you were focusing yourself to? And then what did you learn over your time paper trading? Yeah, yeah, definitely. I did want to paper trade mostly because I didn't have a lot to lose in the market and I had shorter amount of time. So I was working with limited capital and limited time. So my idea was before I get to doing what I really want to do. Let me familiarize myself with what I'm doing. Get this minor errors of entering the wrong order, wrong number of large clicking by instead of sell like all these different. It's so complex. We go through so many motions in just placing a single trade that if we don't inherently build the practice of doing it, it gets we can introduce these mistakes while trading at scale. That's really what I wanted to take out. But more importantly than that, building the trade logs, I wanted to",
    "start_timestamp_seconds": 1083.2,
    "end_timestamp_seconds": 1167.84,
    "start_timestamp": "18:03",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1083",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "many motions in just placing a single trade that if we don't inherently build the practice of doing it, it gets we can introduce these mistakes while trading at scale. That's really what I wanted to take out. But more importantly than that, building the trade logs, I wanted to test the trade logs. I didn't know if these logs would work. So paper trading was the way for me to check the formulas. I literally paused the screen on your video. Python match exactly the color. Okay, the heading is black with white font. All the input cells are good. Light green. All the output cells are gray and white. Just a lot of things that I think. I mean putting aside the shameless piracy, the amount of time it saved me in my own learning curve. It's massive. I think it's being, got me much comfortable, much faster in engaging with the markets. Because I had, I was like having a car that I could take out to a test drive on the real roads really quickly instead of worrying about building the car and still figuring out in a garage. So that was most of my work. My primary driver was for paper trading. As far as experience goes, it was all over the place. I really just trying to understand what I was doing. If I was even doing it correctly and just getting in the habit of collecting logs. Coming to the desk and entering",
    "start_timestamp_seconds": 1153.52,
    "end_timestamp_seconds": 1238.24,
    "start_timestamp": "19:13",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1153",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "My primary driver was for paper trading. As far as experience goes, it was all over the place. I really just trying to understand what I was doing. If I was even doing it correctly and just getting in the habit of collecting logs. Coming to the desk and entering the trades, just building that habit, morning, evening, whenever that. I think those things helped me without even thinking through those things. They were helping me in the background. But yeah, it was mostly just trying to get the logs functioning so I could use it in real month. Which is huge. Right? I, and it's one of the reasons in, you know this, right? Everybody who's always asked me like, hey, do you have a trade log? I can download. And the answer is always the same. It's always been the same. It's no. And I have like the absolute barebone skeletons of one with literally just words of the things that you're going to have to put in, and then in there somewhere and figure it out. But that that process of of building is really important. There's no scenario where at the end of building a trade log that works that you are now Warsaw then where you started. That's just the reality of it. You're going to understand just how these things interact better. And one of the things I think a lot about actually is efficiency in the workflow. I specifically set things up so",
    "start_timestamp_seconds": 1222.72,
    "end_timestamp_seconds": 1305.12,
    "start_timestamp": "20:22",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1222",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "log that works that you are now Warsaw then where you started. That's just the reality of it. You're going to understand just how these things interact better. And one of the things I think a lot about actually is efficiency in the workflow. I specifically set things up so that it literally mirrors my trade process and the trade process is different depending on what it is. So sometimes it'll be date ticker. Sometimes it'll be ticker date. And it is just completely built so that based on this specific thing that I'm doing, it is just as efficient as humanly possible to fill everything in. And that's actually the color coding that you picked up on. Like I specifically make input cells always light green. It's always like green always. And it's so that regardless of where I'm looking at in the trade log, if I see a light green cell, I immediately know that's an input. I need to do something here. Whereas in the beginning I didn't do anything like that. And then you find yourself having to look over your own trade log for a little bit to find stuff and like super inefficient. One of the ways that I was able to like really pack my learning and make it super dense was thinking in ways like this so that when I'm for example testing a strategy, if I'm spending an hour testing a strategy, 50 minutes of it is me actually testing versus",
    "start_timestamp_seconds": 1285.28,
    "end_timestamp_seconds": 1372.72,
    "start_timestamp": "21:25",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1285",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "of the ways that I was able to like really pack my learning and make it super dense was thinking in ways like this so that when I'm for example testing a strategy, if I'm spending an hour testing a strategy, 50 minutes of it is me actually testing versus having some subset of that duration where I'm just trying to find shit in my log because I don't know where it is, right? It's stuff like that that really does add up over time. And I definitely am glad that you went through that exercise because I everybody knows I am literally an evangelist for a paper trading. I literally think everybody should do it. I still do it today and still I paper trade. And it's just data. But again that goes back to people being more comfortable in embracing a process versus hoping the outcome of this one individual trade is going to pay for their car payment this month and that's all they're hoping for. Fortunately that doesn't work super well. Yeah, another thing I wanted to add about the trade log itself. I'm glad that you didn't get the formulas. Although I was really frustrated. Some boys said, which I didn't need to give it to me. But I realized now that when I moved stuff around in the log and a formula breaks in a section, I'm actually able to fix it. I don't have to like pin you and I, how do I",
    "start_timestamp_seconds": 1355.2,
    "end_timestamp_seconds": 1441.6,
    "start_timestamp": "22:35",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1355",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "Some boys said, which I didn't need to give it to me. But I realized now that when I moved stuff around in the log and a formula breaks in a section, I'm actually able to fix it. I don't have to like pin you and I, how do I fix that kind of thing, right? I don't think I'm able to do that if I had just downloaded that. That's something really good. I now know how to navigate that. Yeah, and it's it's actually funny because in the very, very beginning, I actually had like an actual trade log that I gave to a few people and I became tech support and I was just like, oh, hell no, like if I'm sitting here like giving something that I took a long time to like build and refine, giving to you completely for free and then I'm also supposed to help you troubleshoot that exact thing. I was like, that's not happening. So it's funny. You missed the boat on that because you, you might have had a completely done trade log, but there is no tech support. That's funny. Cool, I think we're, I would pass with through. So I'll introduce the topic. Yeah, I think I'll give a bit of a primer of why I came to the conclusion of bringing this as a first topic. And it actually ties back into what we were talking earlier is when all of us as new entrants into",
    "start_timestamp_seconds": 1430.16,
    "end_timestamp_seconds": 1516.0,
    "start_timestamp": "23:50",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1430",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "through. So I'll introduce the topic. Yeah, I think I'll give a bit of a primer of why I came to the conclusion of bringing this as a first topic. And it actually ties back into what we were talking earlier is when all of us as new entrants into the world of market trading investing, what have you. It's immediately obvious that this is something that we've never done before. It's it's a, it's a pursuit unlike any other in school. We have teachers giving us lessons homework. When we go home home, do the homework, we get great at all that. We get extra lessons if we need to catch up or extra courses or whatever. Same thing happens at the job. We have our manager or whoever gives us a set of instructions. We take that instructions apply the training that we have received for that job, output it that either goes to the next person downstream or an x-process downstream. These both conditions have defined boundaries, a set of roads. There's a structure, societal structure to all of these things. Trading is nothing like that. It's overcome. It's overwhelming when we come, when we come up on it is no rules unbound, unboundness of it. So I personally felt really lost when I came up on it. So as usual, what most of us do when they get overwhelmed, we try to imitate the person who's doing the best in that, at least what we perceive",
    "start_timestamp_seconds": 1498.08,
    "end_timestamp_seconds": 1581.68,
    "start_timestamp": "24:58",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1498",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "on it is no rules unbound, unboundness of it. So I personally felt really lost when I came up on it. So as usual, what most of us do when they get overwhelmed, we try to imitate the person who's doing the best in that, at least what we perceive as the best. So the day one will be okay, this trade and made x-amounted when using y-strategy. I'm going to learn that. One week from later, another trader does y-z amount of money with a strategy. Now I'm going to learn that. So just jumping between strategies and watching different people do different things and just trying to emulate them. I never considered this is where my time should go, because I didn't know. I don't, I don't, I don't, I don't, I don't, I don't, I don't, I don't, I don't, I don't know what we don't know. That's that's why we have no idea of regime change. We don't, we have no idea of part if the person that's posting it as any idea of what they're talking about, we don't know any of those things. So I wanted to bring this topic, they bring it back to the concept of optimizing market beta and then the idea of main effort. So if you could walk us through what those mean individually and perhaps why they're important and how we can marry them together, particularly for beginner traders as they're starting their journey, why, why it is",
    "start_timestamp_seconds": 1567.84,
    "end_timestamp_seconds": 1650.48,
    "start_timestamp": "26:07",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1567",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "to the concept of optimizing market beta and then the idea of main effort. So if you could walk us through what those mean individually and perhaps why they're important and how we can marry them together, particularly for beginner traders as they're starting their journey, why, why it is important for them to focus most of the time on doing this, why it could be important, right? So take it away from there. Yeah, for sure. But funny thing before that that you mentioned that really sticks out was the idea of like emulation and something traders will come across is that trading, it really requires a different way of thinking and a lot of people apply their standard day-to-day thinking to trading, which doesn't work well. This is things, this includes things like bargain buying. I use that example all the time, right? You try to buy stuff cheaper if you need socks. There's no reason to pay for socks. But if you do that, well, I was literally just talking with somebody from the discord this week that was like, how do you not be greedy on fills because they're putting an order at the mid and then they're not wanting to move it much and then they just miss the trade entirely, right? And it's like there's a balance. If you overemphasize the wrong thing, you're optimizing for the wrong thing. But again, your brain isn't taught how to think more effectively in a trading environment",
    "start_timestamp_seconds": 1628.0,
    "end_timestamp_seconds": 1727.84,
    "start_timestamp": "27:08",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1628",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "then they're not wanting to move it much and then they just miss the trade entirely, right? And it's like there's a balance. If you overemphasize the wrong thing, you're optimizing for the wrong thing. But again, your brain isn't taught how to think more effectively in a trading environment versus your day-to-day. So specifically with the idea of emulation, emulation, again, in trading is also very, very difficult. I think it's easy to find things to emulate from people that are like good aspects. I definitely think you could do that. But trading is also really dangerous because people will try to emulate what they think a institutional trader does. And the funny thing is, what an institutional trader is literally an entirely different game. You are emulating something that quite literally is not relevant. There are elements of what an institutional trader does that are relevant, things like having a risk management plan and actually testing things before you move them to production and so on and so forth. So there's elements. But it's not the same. It's kind of like you were me trying to emulate LeBron James. Like, sure, we can emulate some of the moves he does. But I'm not as tall as he is, I don't think you are either, right? Like, there's just specific attributes that are just completely different. And that is what it is. So just on that point of emulation is a general thought. I don't think there's anything wrong",
    "start_timestamp_seconds": 1712.24,
    "end_timestamp_seconds": 1810.32,
    "start_timestamp": "28:32",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1712",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "he does. But I'm not as tall as he is, I don't think you are either, right? Like, there's just specific attributes that are just completely different. And that is what it is. So just on that point of emulation is a general thought. I don't think there's anything wrong with it. But I think you have to be super careful, super super careful because there's a really good chance that you're going to emulate things that actually can hurt you more than help you. Now, taking that to this idea of optimizing market beta and main effort strategies. The concept of optimizing market beta is if a trader was to start investing in that sit. What's the starting point? Typically, it's buying and holding in XETF like Spy VIO. Hopefully saving aggressively adding more to it each month. So dollar cost averaging and come back 30 years later. That's what most people do by default. I think a big mistake that new traders make is going back to basketball if I never touch the ball before. And my near term goal was to compete with LeBron James. It's not going to work. Like there's no competition if I've never touched a ball before. And my goal for my first time playing basketball is to compete with LeBron James. That sounds fucking crazy. But the funny thing is is traders do it all the time. Traders think that they're going to start trading and compete in outperform. Everybody, which some",
    "start_timestamp_seconds": 1794.96,
    "end_timestamp_seconds": 1906.48,
    "start_timestamp": "29:54",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1794",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "touched a ball before. And my goal for my first time playing basketball is to compete with LeBron James. That sounds fucking crazy. But the funny thing is is traders do it all the time. Traders think that they're going to start trading and compete in outperform. Everybody, which some level of delusion, I actually don't think it's bad. You got to aim high. I don't hate that. But I do think that you have to have some parameters around it and have a healthy expectation of what's about to happen. So my my position on that is a really, really, really, really good starting point for traders is to do what you would do otherwise and see if you can make it a little bit better. Just a little bit better. One of the examples of this is actually on my website. I'll share my screen so that I can show you because you can massively outperform the market without really doing anything special. And I think that that part escapes a lot of people because they immediately want to go into and start seeing you know, how much money they can make super fast. So this I think is a good example. What this is is a just example of three different portfolios. I have them labeled one two three. And if we take a look at portfolio three, it has a 8.6% average return quite high. And if we compare that against portfolio one, which only has",
    "start_timestamp_seconds": 1886.4,
    "end_timestamp_seconds": 1985.28,
    "start_timestamp": "31:26",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1886",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "is a good example. What this is is a just example of three different portfolios. I have them labeled one two three. And if we take a look at portfolio three, it has a 8.6% average return quite high. And if we compare that against portfolio one, which only has a 7.4% average return, we would objectively say portfolio three has a better average return than portfolio one yet at the end of a five year period, it made less money than something that has a lower average return. This confuses a lot of people and it's something that they don't appreciate. To further the point, if we take a look at portfolio one, the best return that it had in any of the years was 10%. That's the best. The worst positive performance in portfolio three is positive 12%. So the worst positive performance is better than the best performance in portfolio one. Only difference between portfolio one and portfolio three is portfolio three had a drawdown of 25% one year. It came out of the gate 30% return three times that of the other portfolio. What's going on here? This, this drawdown completely screwed portfolio three. They're now underperforming fairly to something that really didn't do anything that's special. Three, three, 10% years of five and a two. The way that this applies to something like optimizing market beta is this. If we take a look at S&P and we look at S&P over a long time frame",
    "start_timestamp_seconds": 1966.64,
    "end_timestamp_seconds": 2083.12,
    "start_timestamp": "32:46",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=1966",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "underperforming fairly to something that really didn't do anything that's special. Three, three, 10% years of five and a two. The way that this applies to something like optimizing market beta is this. If we take a look at S&P and we look at S&P over a long time frame five years. If we think about the way that S&P performs long term, it does well, it goes up. If you do something as simple as a basic momentum following approach where if a weekly candle drops below some sort of set moving average, so it's a really slow thing. What you do is you cut off these big dips that you don't have to get some sort of positive return through or you can flag in this period where you want to dollar cost average and more aggressively. However, you want to set it up. The point, though, is that by taking something as simple as what you would do anyways. Dollar cost average into an index ETF and you find really, really small ways to just make that a little bit better. That is a perfect starting point. And for those that don't know, my position is that, like, your first two years of trading, your goals should just be more than zero dollars. Just try to be positive. That is more than enough of a goal for your first two years of trading. It's not pacing the market. It's not beating the market. It's just try to",
    "start_timestamp_seconds": 2065.12,
    "end_timestamp_seconds": 2171.36,
    "start_timestamp": "34:25",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2065",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "like, your first two years of trading, your goals should just be more than zero dollars. Just try to be positive. That is more than enough of a goal for your first two years of trading. It's not pacing the market. It's not beating the market. It's just try to not lose your money and get some experience. Then you can start looking at stuff like this, which is very realistic. This is way more realistic for people than the ability to intra-day trade, supply and demand imbalances in a super large index that has so much going on that they don't know and they're just hoping that they can interface with it. That's not to say it can be done. It can and I know people that do it, but it is super, super difficult. Very hard. This is way easier. So to summarize all of that, the idea of optimizing market beta is to aim low enough so that you actually have a chance of being successful. And then you can kind of poorly those wins in that success to then get better and better hopefully. Now, the idea behind a main effort strategy in the military we use main effort and supporting effort. Main effort is what we refer to as your bid for success. It's kind of like the thing that you think you're going to do to get the job done and then you have supporting efforts that help the main effort do its job.",
    "start_timestamp_seconds": 2160.72,
    "end_timestamp_seconds": 2245.68,
    "start_timestamp": "36:00",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2160",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "use main effort and supporting effort. Main effort is what we refer to as your bid for success. It's kind of like the thing that you think you're going to do to get the job done and then you have supporting efforts that help the main effort do its job. In trading now, I think as you pointed out earlier, traders struggle way more with too much information overload. So the point of a main effort strategy that might be based on something like optimizing market beta is to give focus. It's to give a good objective that ultimately shouldn't hurt you even if you fuck it up because you're essentially doing what you would do anyways. Dollar cost average into an index ETF and try to find ways to make it better. You can underperform, right? Like you could only sell cash to your puts and never participate in the upside. You absolutely can underperform. But the probability of you blowing up your accounts trading a cover triangle in an index ETF would effectively require whatever index you're trading to blow up. So if you're trading something like S&P, it would require the S&P 500 to blow up. Not super high probability. But this calls back to what you were talking about before and the concept I shared in terms of slowest moves smooth as fast. Most people, they hear a good target for your first two years is to be greater than zero and they think, oh no,",
    "start_timestamp_seconds": 2234.4,
    "end_timestamp_seconds": 2334.96,
    "start_timestamp": "37:14",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2234",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "super high probability. But this calls back to what you were talking about before and the concept I shared in terms of slowest moves smooth as fast. Most people, they hear a good target for your first two years is to be greater than zero and they think, oh no, I don't have time for that. And then they think like, oh, well, if I'm only going to try to like slightly outperform the market, why even bother not realizing that if you ever so slightly outperform the market for a sufficient duration, you absolutely smash it. But again, people are aiming higher than they can even see. So the the purpose for that is to try and help people find structure so that that urge to move around to bounce around goes away. The main reason why traders bounce around is when they're not confident in what they're doing and if what they're doing works. One of the cool things is when you know what you're doing works, that itch to bounce around effectively goes away because you know what you're doing is working. So sure, you might test that new idea you came across with a small amount of money and see if there's something there sure. It's really cool. But you're not like completely pivoting your portfolio every time you come across something. So to summarize everything, optimizing market beta, I think is a great starting point for people because it takes the base case for what",
    "start_timestamp_seconds": 2320.48,
    "end_timestamp_seconds": 2411.52,
    "start_timestamp": "38:40",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2320",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "of money and see if there's something there sure. It's really cool. But you're not like completely pivoting your portfolio every time you come across something. So to summarize everything, optimizing market beta, I think is a great starting point for people because it takes the base case for what most people would do anyways and it tries to make it a little bit better. Main effort strategy is designed to give somebody focus so that we're not bouncing around incessantly in making essentially no progress. You have to you have to give things a fair shake in order to see if there's something behind it and you have to go through path. So yeah, that's kind of like my Cliff notes version for both of those but happy to dive into any specifics. No, that was great. I think I think you answered all the fit and you made a really interesting point about the itch going away once you have that baseline level of understanding of what it's for you. That is so true. It's similar to another thing you talk about, like having a good defense allows you to take opportunistic shot at offense. That's how I think about the main effort covered triangle as a whole in the strategy. It's like all weather tires for me. It can, it can bits time many different market regimes and conditions if you have a good plan around it. But it releases your time to focus on other speculative",
    "start_timestamp_seconds": 2389.2,
    "end_timestamp_seconds": 2475.68,
    "start_timestamp": "39:49",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2389",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "think about the main effort covered triangle as a whole in the strategy. It's like all weather tires for me. It can, it can bits time many different market regimes and conditions if you have a good plan around it. But it releases your time to focus on other speculative section because now you know you have the system that works in the background. So that that each about jumping around is really, really good. The funny thing about specifically something like the covered triangle too is like, you know, I have this sample portfolio that I've been sharing with everybody and like you can apply leverage to it, right? So I'm training a coverage string right now in teachable cues. With that, I not only absolutely smash the same noxional value performance in QQQ, but I do it with lower risk. That is really unintuitive to people because you think three times levered more risk. But again, notice how I emphasize the same noxional value because if I set it up where I'm trading half a million dollars. And in QQQ, if I wanted to trade half a million dollars of QQQ, I got to use half a million dollars. But in something that's three times leveraged, I no longer have to use half a million dollars. I can literally use a third of it. And I can have the same noxional exposure, lower dollar exposure out at a given point in time, which then allows better dollar cost",
    "start_timestamp_seconds": 2457.28,
    "end_timestamp_seconds": 2553.2,
    "start_timestamp": "40:57",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2457",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "dollars. But in something that's three times leveraged, I no longer have to use half a million dollars. I can literally use a third of it. And I can have the same noxional exposure, lower dollar exposure out at a given point in time, which then allows better dollar cost average and scaling in. Now, not all that glitters is gold. There's a lot of nuance when you're trading a leveraged ETF, especially something like T-TripleQs. There's volatility decay, which isn't like the demon that people think it is, but it is a thing and you have to be aware of it. But it's just an example of how something as simple and something as really low touch as a coverage string goal is can significantly drive performance, which it's funny because sometimes when I'm talking with people, they'll kind of be a little bit down about like what their return is and stuff like that. And then if they're trading a coverage string goal will look at that and it's almost always outperforming the benchmark. So the real sadness is then that there's not more money in that. Because, we're trying all these other things that aren't working as well. They're like, damn, you know, my overall portfolio is in outperforming the market. But then when you look at the allocation for the cover triangle, it's typically beating the market, which is super ironic, because then it almost gets taken for granted something that even if that is highly",
    "start_timestamp_seconds": 2537.28,
    "end_timestamp_seconds": 2623.52,
    "start_timestamp": "42:17",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2537",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "well. They're like, damn, you know, my overall portfolio is in outperforming the market. But then when you look at the allocation for the cover triangle, it's typically beating the market, which is super ironic, because then it almost gets taken for granted something that even if that is highly specialized in like everything that a trader does, that itself is worthwhile. And absolutely can make a significant performance improvement long term. Now you do have to be cautious of drag. Right? Like if you're doing it in a regular taxable account, you do have to be thoughtful about how much you're trading and at what size and frequency. Because now you have the additional overhead of taxes. So not only do you have to outperform a benchmark, but then you have to logically be able to say, I outperform the benchmark after this drag is added. If it's not the case, then again, it doesn't necessarily make as much sense. If your goal is to outperform the benchmark, which isn't always the case. For some people, it's to have a higher performance than the benchmark over like a five-year period as compared to any one individual year, which I actually think is a much better goal. Great. I think that covers it. To that point, I came across an interesting paper with a microguide. I think it was called leverage for the long run. Yeah. Yeah. That talks about exactly what you said like managing around moving garbage. So",
    "start_timestamp_seconds": 2610.8,
    "end_timestamp_seconds": 2698.4,
    "start_timestamp": "43:30",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2610",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "actually think is a much better goal. Great. I think that covers it. To that point, I came across an interesting paper with a microguide. I think it was called leverage for the long run. Yeah. Yeah. That talks about exactly what you said like managing around moving garbage. So yeah, if anyone's interested, I did have a question from both of all street. Or by the way, shout out to the MN productive, like that and Ricky for forming a group, a trading group. And I was telling them the other day that when we started our group, it continues to pay dividends. I think of my group mates as friends really. My intellectual partners, I found ideas of them. I look forward to meeting them every Saturday. It's so much fun. So I think I really congratulations for those guys and those labs. But they had a question here. They're working on understanding how to scope in different information and in alignment to profit mechanism. I think you addressed this slightly yesterday in the post pro stream. If you had any extra thoughts or additional thoughts for this one, you can go into that. But there's a second part to that question was, would you consider me stop trading a profit mechanism? If so, what are some signals that you would be watching for that? That area. Yeah, I'll do the second one first because it's pretty easy. I do think you could consider like meme stocks, a",
    "start_timestamp_seconds": 2681.44,
    "end_timestamp_seconds": 2772.32,
    "start_timestamp": "44:41",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2681",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "part to that question was, would you consider me stop trading a profit mechanism? If so, what are some signals that you would be watching for that? That area. Yeah, I'll do the second one first because it's pretty easy. I do think you could consider like meme stocks, a profit mechanism. But I do think you'd have to get a little more specific because again, the way that I think about meme stocks is probably different than what a lot of those people in for them as. Like you can have meme stocks that are literally just popular, have a bunch of memes about them and don't do anything. But I think the real thing that I would look to trade in stuff like meme stocks is like short squeezes of different kinds. So stuff that's relevant to that is like short interest, short interest ratios, short interest is a percentage of float days to cover all of those matter. Then things like volume and volatility. All of those become highly relevant along with like option trading activity for sure. Giving game stop a shout out and my deep dive into game stop over the last what year or so, I don't even know how long it's been now. But the way that I came across game stop like I've always been familiar with the stock. But I ended up catching part of roaring kiddies' trades as he was placing them. And it came out on a scanner that",
    "start_timestamp_seconds": 2752.72,
    "end_timestamp_seconds": 2848.56,
    "start_timestamp": "45:52",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2752",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "so, I don't even know how long it's been now. But the way that I came across game stop like I've always been familiar with the stock. But I ended up catching part of roaring kiddies' trades as he was placing them. And it came out on a scanner that I had had no idea it was him, obviously. But I just saw this highly anomalous volume coming in. So then I ended up trading it again just in expecting some sort of sympathetic move of an informed trader and turns out was him and then opened up a whole other door. But that's a really good example of a meme stock that absolutely has a lot of volatility and movement. So I even trade a covered triangle now in game stop. Part of that is just to support the community. But it's also because of the way that that profit mechanism behaves and I have uncapped profit potential, meaning my upside is not covered. And I design. It's because those things can blow off really, really fast. So I actually have controls for that specific strategy where if certain criteria or I actually just flatten any sort of short calls that exist at the time, I lighten the cash secured puts and I just accumulate more shares out right. Sometimes I'll add like kicker calls and stuff but I always fear for liquidity when trying to trade those during a squeeze. So I think you're better off with the",
    "start_timestamp_seconds": 2826.16,
    "end_timestamp_seconds": 2924.24,
    "start_timestamp": "47:06",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2826",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "calls that exist at the time, I lighten the cash secured puts and I just accumulate more shares out right. Sometimes I'll add like kicker calls and stuff but I always fear for liquidity when trying to trade those during a squeeze. So I think you're better off with the underlying and something like that specifically. So yeah, I definitely think that there's a profit mechanism there. I think you just have to be a little more specific though with like what is the actual piece that you're trying to target. Then zooming out a little bit more and thinking about like trying to figure out the metrics that are relevant for a profit mechanism. The way that I think about this is if I have anything that I trade. So do you have an example of a strategy or anything that we can use for an example? I just wanted to be random. I want to pick something that I'm not familiar with. Just a triangle, be out of peace triangle 30 days, 60 days. Yeah, got it. So somebody saw tasty trade and they see that selling strangles or straddles out, you know, 45 days, whatever, tends to make money and that's where they want to start. Completely cool. You're starting with something that is supported at least by some level of data and it gives you a starting point. So then the follow-in way that I would think about that is I would absolutely start a section",
    "start_timestamp_seconds": 2907.92,
    "end_timestamp_seconds": 3001.04,
    "start_timestamp": "48:27",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2907",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "make money and that's where they want to start. Completely cool. You're starting with something that is supported at least by some level of data and it gives you a starting point. So then the follow-in way that I would think about that is I would absolutely start a section in my trade plan about that and I always start with an executive summary which is just a word picture, a couple sentences of like what I think this thing is supposed to do. Then I have a section for like set up management AR and in there I'm going to just qualitatively describe what the profit mechanism is. So in the case of the example that we're using here, it's variance risk premiums in indices, which is the propensity for implied volatility to trend over realized and also that gets juiced up double time in indices because they tend to have put skill. Right. So the next part is if I think about those details in those traits, the next question I have is what information would let me make more money with this? What do I think would let me make more money with this? That becomes your list of metrics that you think are relevant. A great example of this is I was working with somebody that was trading zero DTE's. I trades zero DTE's community knows and they were tracking VIX when they were trading their zero DTE's. It's a logical starting point because they're trading",
    "start_timestamp_seconds": 2982.96,
    "end_timestamp_seconds": 3082.8,
    "start_timestamp": "49:42",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=2982",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "list of metrics that you think are relevant. A great example of this is I was working with somebody that was trading zero DTE's. I trades zero DTE's community knows and they were tracking VIX when they were trading their zero DTE's. It's a logical starting point because they're trading zero DTE's and SPX so they wanted to track volatility. However, if we think about that metric does that metric VIX match what they're trading with respect to a profit mechanism zero DTE's? Of course not. Because VIX is 30 day forward of all zero DTE is zero DTE. It's a completely different fall window. So then in that conversation they were like, oh, what about one day VIX? Even still much better, but still different. That's still a different thing than what you're trying to trade. So the way that that works though is that person started what they thought was logical. Then what you do is if you don't have somebody or some sort of resource that says like what I just walked through right like, well, this doesn't work for that reason, you could figure it out on your own. How do you figure out on your own? You track what you think is best in this case VIX. And then at the end of the month, you just run an analysis. And you say how informative is the VIX measurement on the P&L or some other metric relative to my strategy? And the funny thing is",
    "start_timestamp_seconds": 3059.84,
    "end_timestamp_seconds": 3159.12,
    "start_timestamp": "50:59",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=3059",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "own? You track what you think is best in this case VIX. And then at the end of the month, you just run an analysis. And you say how informative is the VIX measurement on the P&L or some other metric relative to my strategy? And the funny thing is is you will find that it's effectively not correlated slightly positive correlation, but effectively no. That's exactly how you narrow down the features and the metrics that ultimately matter to a profit mechanism. The gain there is you're going to track a lot of shit that doesn't matter. And everybody will view that as like wasted effort, but it's not because even if you track something that gives you a null, now you know, this isn't relevant to this. That is still a data point. So that that process though of brainstorming what we think is relevant, outlining briefly why we think it's relevant, finding a way to track it in a trade and then setting a cadence to evaluate it and see how much does it actually add? That's exactly how you dial in what's relevant to stuff. And you can always begin with accelerators. So if I wanted to trade variance resprimiums in indices, I'm going to go to SSRN. And I'm going to ask the RP. I'm going to ask index resprimiums. And I'm going to see what existing research is there. And I'm going to see what features have they already identified matter because a lot",
    "start_timestamp_seconds": 3140.8,
    "end_timestamp_seconds": 3236.8,
    "start_timestamp": "52:20",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=3140",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "to trade variance resprimiums in indices, I'm going to go to SSRN. And I'm going to ask the RP. I'm going to ask index resprimiums. And I'm going to see what existing research is there. And I'm going to see what features have they already identified matter because a lot of that work has been done to give you a starting point. So you don't have to like just make it all up on your own, especially if you don't know, you should use references like SSRN. There's new ones with it. I wouldn't take it all at complete face value. But again, if you have no starting point, it's a good one. So that's the exact process that I would use to kind of narrow down the scope in terms of what metrics are relevant to the specific profit mechanism that I'm trading and then to validate those metrics to make sure that they're actually doing something for me. I can't tell you how many times I've tracked something that ends up coming out of the log because after a decent sample size, I note that it's not really helping me make more money. It's not helping me predict things. It's not helping me reduce volatility. So I don't just delete it. I have a section in my trade log that literally just has expired signals or metrics that I'm tracking different data points. So then if for whatever reason five years down the line that idea comes back",
    "start_timestamp_seconds": 3223.2,
    "end_timestamp_seconds": 3304.64,
    "start_timestamp": "53:43",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=3223",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "things. It's not helping me reduce volatility. So I don't just delete it. I have a section in my trade log that literally just has expired signals or metrics that I'm tracking different data points. So then if for whatever reason five years down the line that idea comes back in my head, I can maybe revalidate. I can see what I did before. Maybe there's a way for me to make it better. Or I can see what it did before and be like, oh yeah, that's a bad idea. I remember now. That kind of thing. So yeah, that's it. It's like anything else. It's just process oriented. The more that you can build things that you can repeat them multiple times, the better off you're going to be in trading because you have to do a lot of that a lot of times. Great. Great. Thank you. I think that wraps me up. Thank you for having me on. It was great. Yeah. Great. I did it too. Absolutely beautiful. Super, super fun to catch up. And for those that are interested, essentially we're going to plan to do these like once a month. And if you're in the discord, it's free for everybody to join. If you have like a topic or something that you want to see as discuss and go into more detail, let's trade you know you can tag him in there and then he can keep a pulse on it for you",
    "start_timestamp_seconds": 3283.84,
    "end_timestamp_seconds": 3360.96,
    "start_timestamp": "54:43",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=3283",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 3379.0
  },
  {
    "video_id": "zCJRsOzmn8A",
    "title": "Main Effort Trading Strategy   The Outlier Trading Podcast Unfiltered",
    "text": "in the discord, it's free for everybody to join. If you have like a topic or something that you want to see as discuss and go into more detail, let's trade you know you can tag him in there and then he can keep a pulse on it for you guys. And then we can hit it during one of these. So thanks for hanging out. Shraaj, I hope this is useful to everybody. Let us know if it was. Be an outlier. We'll see you guys later.",
    "start_timestamp_seconds": 3347.68,
    "end_timestamp_seconds": 3372.32,
    "start_timestamp": "55:47",
    "video_url": "https://www.youtube.com/watch?v=zCJRsOzmn8A",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zCJRsOzmn8A&t=3347",
    "chunk_index": 45,
    "word_count": 88,
    "upload_date": null,
    "duration": 3379.0
  }
]