[
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "you you you you you you you you you you you you you you you you you you you you you you you you you and you you and I would include it here with a summary. Imagine, Grack, Grack will be able to scour the internet pretty quickly and see if it can locate it. I unfortunately do not have access to it. So we'll see. I think this is the text copy paste. Where's it from? It doesn't let you post links in YouTube, which is super annoying, so you have to post it in the Discord or tag me on like X or something and then I can grab it from any of those. You could DM it to me on X wherever. Shoot it to my email, I don't care. I can look at all of it. Yeah, okay, so even Grack says that it's hitting a paywall. I'll see if Grack can summarize it. In the meantime, hopefully we'll be able to locate that. I imagine somebody somewhere probably has a copy of it. Just have to imagine somewhere, somebody somewhere. Okay, so I'm gonna read this summary though. Wait, it looks like it's here. Anybody that read it? Yeah, it literally looks like it's here. We might be in luck. Let's look at it together. Yeah, it's kind of interesting to host something for free and then put it behind a paywall because you know it's out there. It's not gone. But right now,",
    "start_timestamp_seconds": 0.0,
    "end_timestamp_seconds": 477.2,
    "start_timestamp": "00:00",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=0",
    "chunk_index": 0,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "Anybody that read it? Yeah, it literally looks like it's here. We might be in luck. Let's look at it together. Yeah, it's kind of interesting to host something for free and then put it behind a paywall because you know it's out there. It's not gone. But right now, Brock is, it looks like to give me the whole thing, so I'm just waiting. It looks like a lot of fucking words. Jesus Christ. Oh my God. I don't know if we're gonna get through this whole thing, guys. I'm fucking cool. I see wigglyworm, you have it too as well. Let me see if I can find it. Very foundations on Reddit. Yeah, I'm happy to spend time. Let's, I'm gonna change the title of the stream and take a look at that. Michael, very, I think that's a good idea. Okay, big short squeezes, what is called on super. Thong. And then I'm looking for the big short please. Fuck, if I could spell squeeze right, I would get me pretty far. Did you say this? Fuck, you get this exact thing. Oh, it's from a common Jesus. Can I copy and paste that in wigglyworm? Is that how this thing works? Well, this work, if I, if I do that, okay, okay, okay, okay, I think we got it. Think we got it. I believe this is correct, right? Hey, yo, everybody in the chat give a huge shout out to wigglyworm for digging that up",
    "start_timestamp_seconds": 456.84,
    "end_timestamp_seconds": 597.76,
    "start_timestamp": "07:36",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=456",
    "chunk_index": 1,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "that how this thing works? Well, this work, if I, if I do that, okay, okay, okay, okay, I think we got it. Think we got it. I believe this is correct, right? Hey, yo, everybody in the chat give a huge shout out to wigglyworm for digging that up on note. That was, that was fast as fuck. Thank you wigglyworm, huge. And funny enough, I think this is exactly what Grock found. It did. Well, good to know that we're on the same source. All right, let's see. So this is from five days ago. And I'll zoom this in for you guys. I know that's a, that's a common request. Tor a blade from my lawn. Oh, fuck, it's one of these. Fuck. Okay, I'm just gonna skip through. Back in science conference room, S&P, stock guides every month back to 68. guaranteed you have not heard of the vast majority of companies in those guides. Okay, okay. Okay. I'm trying to find the, like where this begins. Okay. Okay, this actually looks important. This looks important. If one is rather young has 50 to 70 years left, then one absolutely should be almost entirely invested in common stock indices, preferably S&P or NASDAQ or both. Live life, touch, gas, chief real things, automatically reinvest dividends, like compounding in X-Gods do the work. I actually fully agree with this. Because this is something I've thought about. A lot of people will at least ask me, especially when",
    "start_timestamp_seconds": 575.64,
    "end_timestamp_seconds": 701.36,
    "start_timestamp": "09:35",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=575",
    "chunk_index": 2,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "common stock indices, preferably S&P or NASDAQ or both. Live life, touch, gas, chief real things, automatically reinvest dividends, like compounding in X-Gods do the work. I actually fully agree with this. Because this is something I've thought about. A lot of people will at least ask me, especially when it comes to like, why do I have a YouTube channel, if I'm successful as a trader, why do I have a community, why do I do that kind of stuff? A lot of it has to do with that. The literally this thing right here. Because the very thing that makes trading so incredible is a simultaneous drawback. We'll make trading so incredible is that it's literally just you. And you are everything. You do risk management, you do sales, you do research, you do trading, execution, you do everything. And it's a really cool skill to have, but it is solo, it is just you. And there's this really, really weird thing that happens where you get to a point where you have more than enough money you have access. And the capital is good, but incremental gains of that money over what you have does not provide some sort of like parabolic increase in happiness satisfaction impact, and many of that. It's funny because a lot of people are wondering why Michael Burrie is now writing substax. It literally is the same thing. He's leaning towards this kind of thing, impacting people. Because it does feel good.",
    "start_timestamp_seconds": 683.96,
    "end_timestamp_seconds": 769.8,
    "start_timestamp": "11:23",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=683",
    "chunk_index": 3,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "some sort of like parabolic increase in happiness satisfaction impact, and many of that. It's funny because a lot of people are wondering why Michael Burrie is now writing substax. It literally is the same thing. He's leaning towards this kind of thing, impacting people. Because it does feel good. It feels good to help and share stuff with people. And even for him, his substax is making him a ton of money. But I guarantee you he's not doing it for the money. He has it priced ludicrously cheap for his brand and what he does. But he's getting something for his expertise as he should. Nonetheless, he's trying to impact. So this I understand, this is a real thing. Of course, some of us just do not want easy. Welcome to the trading world. What I tell people sometimes people ask me like, what does it take to be successful at trading or how do you know if somebody might be successful at trading? The easiest litmus test that I can typically give is like if you tell somebody that the overwhelming probability is that if you attempt trading, you're probably not going to figure it out super fast, maybe not at all. And if that doesn't dissuade them at all, and they're like, yeah, okay, I think I can figure it out still. Those are the people that typically find their way. Okay, for them, well, they're God gave them GameStop. Avanti, 2001 GameStop 2020 turned out",
    "start_timestamp_seconds": 752.08,
    "end_timestamp_seconds": 834.32,
    "start_timestamp": "12:32",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=752",
    "chunk_index": 4,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "fast, maybe not at all. And if that doesn't dissuade them at all, and they're like, yeah, okay, I think I can figure it out still. Those are the people that typically find their way. Okay, for them, well, they're God gave them GameStop. Avanti, 2001 GameStop 2020 turned out well, Pilla text, O2, Taylor, Brens, and 2020, not so well. From the beginning to the end of my professional money management career, I repeatedly did not do easy. These are not all I do, but on balance, I've been batting about 0.7, so I keep coming back. And there would be no gamestop if there was no Avanti, trust me, I always do this. Okay, Avanti, third quarter, 2001, looked up the stock of a company, the industry leading electronic design automation, software for the design of semiconductors and was looking its way because the company had been found guilty of stealing source code from cadence. Five of their executives went to jail, Jesus. Shareholders dumped the stock viciously dropping 80% I salivated that overstates it. I thought this could be interesting. I called friends at Zillinix and Altara to the biggest fabulous chip design companies, very local, learned of Avanti, learned of Avanti at Best and Class products, Apollo, Astro, Milky Way, database, but it was not run by nice guys. They did all my research free form in a notepad back then, lower my first Avanti 10K skin review and my first Avanti call notes. I think",
    "start_timestamp_seconds": 818.76,
    "end_timestamp_seconds": 912.0,
    "start_timestamp": "13:38",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=818",
    "chunk_index": 5,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "of Avanti, learned of Avanti at Best and Class products, Apollo, Astro, Milky Way, database, but it was not run by nice guys. They did all my research free form in a notepad back then, lower my first Avanti 10K skin review and my first Avanti call notes. I think that's what these are. I think that might be what these are. Let me see, let me take a little peek. I need to log in in order to download those, but I don't have access. Okay, cool. ZX says Zillinix is now bought by AMD. Hi, how are you? Hi, how are you? Says, I don't get why you're so anti-GME. Is this the Twilight Zone? Are you one of those stupid people? I'm curious what would lead you to believe that. Okay, the stock had fallen more or less two times free cash flow and I started buying. I also called their CFO arranged to call with hard money financing from NotePad. The FO not savvy, AVNT not desperate, blank blank most interested in death spiral convertible. CFO doesn't know what death spiral convertible is. That's funny. I like the stock. Fallen where it was trading less than one years free cash flow. That's actually like a diamond in the rough. That is a pretty powerful actually metric. Heavenly shorted, well-known Jim Cheneos on the news, pitching it is a short. Looks like Cheneos was winning, but I kept buying. Thesis had nothing to do with short interest.",
    "start_timestamp_seconds": 892.92,
    "end_timestamp_seconds": 989.36,
    "start_timestamp": "14:52",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=892",
    "chunk_index": 6,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "one years free cash flow. That's actually like a diamond in the rough. That is a pretty powerful actually metric. Heavenly shorted, well-known Jim Cheneos on the news, pitching it is a short. Looks like Cheneos was winning, but I kept buying. Thesis had nothing to do with short interest. Pure value buying industry leading products at a discount to free cash flow. I wrote Jim Clark at Brady Wine asset. And he says, a VAMT still makes me feel like I'm sleeping with the village slot. There we go. No matter well, no matter how well my needs are met, I'll ever brag about it. You can still brag about it. The creep factor is off the charts. I think that if I pushed a VANTY too hard, I'd end up being terrorized by the Chinese mafia, failure. Okay. Warren Buffett, Graham, had cigar butts. I do not speak like that. Therefore, his memorable Jimogue, that a door to Michael Lewis, found herself on the pages best seller, did not make it to Hollywood. Okay. First three to four years at Sion was wild west. Letters to investors never identified the investments as a result investors left me alone. And appreciated the returns they earned by leaving me alone. No one knew about the village slots. And nobody was hurt by not knowing science capital black box was simple fundamental equity research worked great. That is not the way of hedge funds today. So it is VANTY worked out",
    "start_timestamp_seconds": 967.64,
    "end_timestamp_seconds": 1061.68,
    "start_timestamp": "16:07",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=967",
    "chunk_index": 7,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "And appreciated the returns they earned by leaving me alone. No one knew about the village slots. And nobody was hurt by not knowing science capital black box was simple fundamental equity research worked great. That is not the way of hedge funds today. So it is VANTY worked out as I wrote in Sion capitals, investors in early January 2020. So where did he begin entering? Third quarter of 21. Did he say in here when he started actually buying? Does anybody know? I don't see where he actually started purchasing shares. I don't know wiggly worm, if you caught that in your reading of it. Anyways, I'm just curious how long he was in the position for. So I see third quarter of 21. And then I see January of 02. So it's really not that long of a duration. Within the third quarter, I explained the fun is averaging down in a stop, which this is another funny thing. You will always find Lawrence's, I'm not sure I skipped this part. What? Unbelievable. You skipped the mean potatoes, Lauren, I can't believe you would do that. But this kind of thing, averaging down in a stop, that's one of those things that different kinds of traders will say, never do this, never do this. The irony is, in trading, there's kind of a time to do most things. You never want to blow up. There's never a good time to do that. But other than that, it",
    "start_timestamp_seconds": 1048.64,
    "end_timestamp_seconds": 1152.28,
    "start_timestamp": "17:28",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1048",
    "chunk_index": 8,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "one of those things that different kinds of traders will say, never do this, never do this. The irony is, in trading, there's kind of a time to do most things. You never want to blow up. There's never a good time to do that. But other than that, it really is way more open ended than people think. So the fact that he was averaging down in a stop is typically something you generally want to avoid. But there's a switch that happens when you're doing it at a more professional level. And you're not averaging down to try to decrease your basis so that you could get out out of scratch. For somebody like Burry, it's very clear that he had a very, very specific idea in his brain. And as it got cheaper, his bet got better, effectively, the way that he's expecting to see the stock move. OK. So the future performance of the position will have absolutely no correlation with either the performance of the general market or further terrorist attacks. At the quarter and however, the position sat at a point low, trading valuation just three quarters, recast flow and trailing 12 months. Many businesses faded rapidly during a one, businesses achieved more or achieved record for cash flow. Yet again, during the first half of 2001, I will not put prospects for a recovery in this position during the fourth quarter or wholly in question. However, over the next year or two, especially",
    "start_timestamp_seconds": 1134.84,
    "end_timestamp_seconds": 1219.72,
    "start_timestamp": "18:54",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1134",
    "chunk_index": 9,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "businesses faded rapidly during a one, businesses achieved more or achieved record for cash flow. Yet again, during the first half of 2001, I will not put prospects for a recovery in this position during the fourth quarter or wholly in question. However, over the next year or two, especially over the next five years, there is high profitability of substantial gains as a result of this investment. This is super, super cool. This highlights the way that you can think about different time frames. It highlights a few things that highlights somebody that does the kind of research is burry. He also recognizes the fact that he does not, he's not like perfectly timing things. He's saying that this could take several years. But over that duration, there's a really good opportunity based on what the underlying ends up doing compared to where you get in. So this is a longer term thesis. So the fun continued to purchase security during the first days of October. We did not have to wait five years or even a year to stock tripled off its quarter and lows by late October. During early December, competitor agreed to buy a all stock of the common company at a price that amounts to nearly seven times its price as of 30-sep 01. That's lucky. So this is a great example of a really good thesis, a good idea, but it was done via luck. The fact that the stock tripled, that's less luck.",
    "start_timestamp_seconds": 1205.92,
    "end_timestamp_seconds": 1289.96,
    "start_timestamp": "20:05",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1205",
    "chunk_index": 10,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "of the common company at a price that amounts to nearly seven times its price as of 30-sep 01. That's lucky. So this is a great example of a really good thesis, a good idea, but it was done via luck. The fact that the stock tripled, that's less luck. That's more what he was looking for. But the fact that there was a buyout, that's luck. He didn't mention a buyout as part of his research and that's kind of the cool thing. If you can position yourself into cool stuff, sometimes cool stuff happens. All right, let's get to Jamie. 2018 running through my list, spot Jamie, do some prelim work, exclaimed out loud for my wife to hear Eureka, I found another village slut. Fuck yeah. Started dabbling in the stock during 18 noted Jamie call options were very active, which even relatively now they are. Reggie says averaging down is always burned me. It can, yeah, especially if it's not done thoughtfully. It absolutely can hurt. It was a pretty normal. Let's take a look at, wait, what is going on right now? That's not right, there it goes. So 646,000, so 650K calls against 170 puts. This is the status quo for something like GameStop. It's super, super volatile and super, super busy in terms of speculators. When you have a stock that effectively, if the cat comes back and he makes a tweet or a post, you know that that sends the stock up",
    "start_timestamp_seconds": 1274.6,
    "end_timestamp_seconds": 1366.92,
    "start_timestamp": "21:14",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1274",
    "chunk_index": 11,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "puts. This is the status quo for something like GameStop. It's super, super volatile and super, super busy in terms of speculators. When you have a stock that effectively, if the cat comes back and he makes a tweet or a post, you know that that sends the stock up and you never know when he's gonna come back because it's kind of random. I know I was talking with Newton and Newton was saying that, you know, actually let me take a look. I need to just say hi to him while I'm thinking about it. It made me think, I remember he was talking about cat day and maybe expect him to see if the cat came back. But I didn't see any evidence of it myself. Okay. Started dabbling in 18, TME call options active, type of thing would play a large role later, actually no, I did not say that to my wife. That's kind of boring. And most of October calls spiked in volume recently before the recent move. So front running the move, they look like this, this is one of them. The cool thing is this unusual whales gives you a pretty similar version of this, which is actually really, really nice because it gives you the call price volume and then also the underlying price movement as well which is a great comparison factor. All options seem top for a reason. As an investor thing and game stop should have gone away",
    "start_timestamp_seconds": 1344.12,
    "end_timestamp_seconds": 1457.96,
    "start_timestamp": "22:24",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1344",
    "chunk_index": 12,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "version of this, which is actually really, really nice because it gives you the call price volume and then also the underlying price movement as well which is a great comparison factor. All options seem top for a reason. As an investor thing and game stop should have gone away a long time ago, which I agree with. But it had not. I wanted to know why. PC gaming had a major threat for many years but the console cycles still strong. Prior console cycle had peaked in 14. Next console cycle delayed until 20. My only analyst Joe noted, GME was in trouble back in 14, but we had not shorted it. Note about Joe. Pired as a cannibalical engineer at a Leigh high and turned with me. I don't really care. Okay, I'm skipping all that. Pired them in 13 graduation law school. He attended to become a better trader. Okay. He was skeptical in 18. And he was burr is getting more interested. In 18, I was looking for that console refresh to boost the stock. I was early, I knew, but I usually am. And I saw, I thought I saw a number of catalysts. That is an interesting, artifact of burry style. That's actually very different than my own. And that he does tend to get in earlier than I typically would. I'm not really comparing the performances. Just saying in terms of the way that we think about it. He definitely gets in early.",
    "start_timestamp_seconds": 1435.76,
    "end_timestamp_seconds": 1535.52,
    "start_timestamp": "23:55",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1435",
    "chunk_index": 13,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "is an interesting, artifact of burry style. That's actually very different than my own. And that he does tend to get in earlier than I typically would. I'm not really comparing the performances. Just saying in terms of the way that we think about it. He definitely gets in early. And I think it's because he gets in when he sees the signals that he's interested in, irrespective of what the stock price is. Whereas I don't really operate like that. I very, very frequently instead will wait until there's at least some sort of confirmation. Lawrence says that he buy options he does. Actually, his most recent thing that got completely misunderstood and misrepresented by the news cycle was the puts that he bought in Palantir. So he does use options to directionally speculate. It doesn't look like he's trading in actual like advanced options book. In any capacity, it looks like most of what I've seen is him trading them mostly for leverage is what I come across. Stock seem undervalued. Had a slug of cash. Does that sound familiar to you guys? Decent cash flows for being solely in cycle. Does that sound familiar to you guys? Some of 18, a lot of talk from brokerage houses about GME going private in a leverage buyout, which could be a good catalyst. Also looking to sell off its spring mobile a chain of 1284, 18T wireless stores. I actually didn't even know that that was a thing. For",
    "start_timestamp_seconds": 1520.88,
    "end_timestamp_seconds": 1614.04,
    "start_timestamp": "25:20",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1520",
    "chunk_index": 14,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "Some of 18, a lot of talk from brokerage houses about GME going private in a leverage buyout, which could be a good catalyst. Also looking to sell off its spring mobile a chain of 1284, 18T wireless stores. I actually didn't even know that that was a thing. For a decent amount of cash. Okay, so you just identifying the different catalysts that caught his eye. So had 354 million in owners earnings each of the four prior years, 800 million cash, poultry compared to what we got now, and 1.3 billiard market cap. It actually screened well and was cheap. That is always a warning sign. Okay, income came down in 17, brought weakness to price. Hypothesis was typical late consul cycle pessimism. That would be remedied within a few years. So again, notice these timeframes, right? Remedy within a few years. Quite a few of these ideas that he has about GME stop as well are things that are over different timeframes. The other thing that I would actually be really curious in what his analysis is. So for those that don't know, the efficient market hypothesis has three forms. Actually, instead of drawing them out sloppy, I will get it off of, I'm going to invest a PDF for you guys. You've efficient market hypothesis in Vesto, yeah. It says critique, I don't know what to critique. This is what I'm looking for. I can get rid of this one. So for those that don't know,",
    "start_timestamp_seconds": 1599.2,
    "end_timestamp_seconds": 1701.36,
    "start_timestamp": "26:39",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1599",
    "chunk_index": 15,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "I will get it off of, I'm going to invest a PDF for you guys. You've efficient market hypothesis in Vesto, yeah. It says critique, I don't know what to critique. This is what I'm looking for. I can get rid of this one. So for those that don't know, the efficient market hypothesis has three forms. And a lot of people don't know that. Most of the time when people are citing a efficient market hypothesis, they're inherently citing strong, which is all information is known, that kind of stuff, which we know isn't true, which is why people cite it. People will cite that and say, well, this is why the efficient market hypothesis is incorrect. But in terms of the semi-strong, that's an interesting middle ground in my opinion. If you believe in this, you can believe that not everything is instantly priced in, and that you can't use technical or fundamental analysis, which that I find curious, like pretty significantly. I find it curious because when we look at somebody like what Burry is doing, he's effectively saying that he believes that this is from typical late console cycle pessimism. This clearly indicates that he doesn't believe, even in the semi-strong form, because he's effectively saying these people are too pessimistic for what this is. And he's taking the overbet that it's gonna rebound. We literally worms to superglad a tuned in today, so I could watch someone with brains talk about this thing. Well, we'll",
    "start_timestamp_seconds": 1678.08,
    "end_timestamp_seconds": 1785.32,
    "start_timestamp": "27:58",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1678",
    "chunk_index": 16,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "believe, even in the semi-strong form, because he's effectively saying these people are too pessimistic for what this is. And he's taking the overbet that it's gonna rebound. We literally worms to superglad a tuned in today, so I could watch someone with brains talk about this thing. Well, we'll see. We'll see how that pans out for the group. Significant cash flow and cash from the sales spring could play into a very big and consequential buyback. Yes, yes, yes, yes. Still not very convinced. Kept a position small through 18 inventories were building in a bad way. They did a sell-off of spring for 700 billion cash in a giant accounting loss later that year. With that sale and surprising large fourth quarter inventory liquidation cash jumped to 1.6 billion. Okay? Activists arrive but not the Calvary. Permit capital enterprise and Hesty a capital partner sent the letter to GameStop's board. Following up on a prior letter, we are long term stockholders in the company permit since 2011, Hesty is since 12. GameStop represents the largest holding for both funds due to our belief that the company's dramatically undervalued. And significant upside potential. We are not typically activist investors. However, the board's lack of meaningful response following Hesty is 12. Bavutary open letter to the board, a link which can be found here in Hesty is considerable efforts to engage with the board has driven us to group together and speak publicly now. It's our goal to work",
    "start_timestamp_seconds": 1765.08,
    "end_timestamp_seconds": 1863.16,
    "start_timestamp": "29:25",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1765",
    "chunk_index": 17,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "investors. However, the board's lack of meaningful response following Hesty is 12. Bavutary open letter to the board, a link which can be found here in Hesty is considerable efforts to engage with the board has driven us to group together and speak publicly now. It's our goal to work constructively with the board to address the editor-in-chief. Okay, so this thing about the board as well has gone on for a while with GameStop's board. Multiple times, mind you. I find I didn't know this history. I'm actually learning a lot here. I appreciate, again, a massive shout out to Wigglyworn for finding this in a shout out to Lauren, for bringing it up. Thank you both very much. Because I'm learning a ton of history here that I was generally unaware of and I find furious. But the history of the board facing issues is something to pay attention to to some degree. So let's see. I'd also been asking the company to do buybacks, but with almost all the catalysts that I expected to play out, sold my GME position to zero during the second quarter of 19. I was puzzled that the relentless selling pressure in the face of seemingly good news and decided maybe there was something I did not understand had a relatively small losses and took them. Stock kept falling, crashed to 782 to 504 bad earnings and initially confusing Steve Drop and the cash balance. I don't remember that. Immediately, seven June,",
    "start_timestamp_seconds": 1845.8,
    "end_timestamp_seconds": 1931.32,
    "start_timestamp": "30:45",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1845",
    "chunk_index": 18,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "the face of seemingly good news and decided maybe there was something I did not understand had a relatively small losses and took them. Stock kept falling, crashed to 782 to 504 bad earnings and initially confusing Steve Drop and the cash balance. I don't remember that. Immediately, seven June, they responded by announcing a modified Dutch auction tender for 12 million shares, 12% of the shares outstanding at a cash purchase price of not more than six to share, not less than 520. Now I'll close that 502, interested again. Modified Dutch auction tender involved shareholders naming their price within a range, the company chooses the lowest price within that range at which you can buy all 12 million shares. I thought the stock would fall after I was not happy with the amount of shares being bought. I wrote only to myself as Joe is not doing well. Wonder why? Why did he write to himself? Why not just he said that he takes notes and like the other note taker? I don't know why I did that. Okay, anyways, this should keep game stop in its range until 10 July, might buy back in at some point but not soon, this buy back is one fifth the size of originally contemplated so clearly. They heard from Cheryl holders that they need to do a buy back and respond it with this. And that is what happened. The stock stayed in a range and then weakened after the",
    "start_timestamp_seconds": 1915.64,
    "end_timestamp_seconds": 1999.08,
    "start_timestamp": "31:55",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1915",
    "chunk_index": 19,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "but not soon, this buy back is one fifth the size of originally contemplated so clearly. They heard from Cheryl holders that they need to do a buy back and respond it with this. And that is what happened. The stock stayed in a range and then weakened after the tender was over. All expected, here I put in, I put 2019 into an anacronistic chart post split that you can see prices and volumes in today's terms. Wiggly says, I send myself emails all the time, finally something burying I have in common. That's really, really interesting. I'm actually really interested in that because I normally, I just use like note pads. I will send, well, I used to send myself text but now I just use my wife as my note pad if I need to send a text. Okay, and then Sion got in pretty damn cheap. 15 July, bought back in a game stop both hands. Made it one of my larger positions, had a brand new thesis. Brought along most of the points of the prior been buying their hard assets such as real estate, thinking of sale lease buybacks as a source of cash, which is absolutely correct. It's one of the things that I actually still see that even as they're selling off their unprofitable stores, they do still have some level of property, which is always good. They don't look like a lot Mark Kapp formed a million, half a billion in",
    "start_timestamp_seconds": 1985.08,
    "end_timestamp_seconds": 2071.6,
    "start_timestamp": "33:05",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=1985",
    "chunk_index": 20,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "which is absolutely correct. It's one of the things that I actually still see that even as they're selling off their unprofitable stores, they do still have some level of property, which is always good. They don't look like a lot Mark Kapp formed a million, half a billion in cash, Sherlock Holmes, every note can cranny. They do disclose the plane on their death 14A, still it needs to go. New thesis, apparent undervaluation, under evaluation, regarded a pinch of catalyst, high short interest, 74% of the stock exchange shares were shorted, rising fast, built to buy back the size, could work some magic. Man, this is really interesting because the way that I trade stuff like this, because I traded both squeezes, and well, I guess there's more than two, but kind of like the two, the two big ones. And I kind of just saw options volume popping off very intriguingly to me. But the way that he does this fundamental analysis is really interesting because you can tell, I actually see a bit of a mismatch between the way he trades and what his thesis is. There's a really strong component of timing to get good valuation for these buying. But then some of the stuff that he's tracking are like really short term catalysts, but I guess it's a long window expectation because the catalyst can happen sometime across that window, which is a very interesting way to do it. Let's see. Built to buy",
    "start_timestamp_seconds": 2055.8,
    "end_timestamp_seconds": 2159.52,
    "start_timestamp": "34:15",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2055",
    "chunk_index": 21,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "valuation for these buying. But then some of the stuff that he's tracking are like really short term catalysts, but I guess it's a long window expectation because the catalyst can happen sometime across that window, which is a very interesting way to do it. Let's see. Built to buy back of this size could work magic, retired 12% of their shares, thought they had to do more, and might be amenable to doing more. GameStop had an usually high volume net summer that could be a buyback of size to get it done quickly. All right. Another way to think of it, one third shares, 30 million tender, Dutch auction over a month, 236 shares traded, 2.4 the outstanding count. Who is tendering? Rainew shareholders typically would be institutions that can't sell in the open market, but the open market gives lots of liquidity to sellers, 236 million shares were bought. Extraordinary of the numbers here in many ways. Okay. Mass amount of sharebase turning over increasing speed, triggered big buy on 15 July, invested in overstock for over a decade, oh, over a decade prior, when naked short selling became very big and controversial concern, five volume of ledge comes with think it's worth selling more on this later. Also, took to, I'm gonna assure my whole team that it was in crazy. This is perfect, right? Like that is as good of a pet talk as you could possibly provide in my expert opinion. I'm not a",
    "start_timestamp_seconds": 2137.84,
    "end_timestamp_seconds": 2239.84,
    "start_timestamp": "35:37",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2137",
    "chunk_index": 22,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "ledge comes with think it's worth selling more on this later. Also, took to, I'm gonna assure my whole team that it was in crazy. This is perfect, right? Like that is as good of a pet talk as you could possibly provide in my expert opinion. I'm not a moth to a flame. I do not think. There. Visit a game stop store. It did not work, even the stuff that was not on sale look like it should be on sale. 28 July road game stops ported directors focusing on the opportunity to buy back a mass of portion of the company very quickly due to the high volume. We suggest you will never find an easier safer opportunity to double their triple game stops at earnings per share, while increasing change of a book value by more than 100%. This may be accomplished simply by completing the 300 million share buyback, the board authorized earlier, given the market cap at 362 completing authorization would require about two thirds of outstanding shares tripling EPS. The denominator would be one third as large. The numbers are striking and demand action. Bloomberg reports show short interest of game stop is at 66.9 million, about 74% of the 90 million outstanding, again, per Bloomberg. As the highest short interest percentage of outstanding shares, yeah. And I think we've even identified instances where the shares outstanding literally exceed the short selling exceeds shares. So this is nothing new. We do not recommend",
    "start_timestamp_seconds": 2218.8,
    "end_timestamp_seconds": 2315.72,
    "start_timestamp": "36:58",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2218",
    "chunk_index": 23,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "at 66.9 million, about 74% of the 90 million outstanding, again, per Bloomberg. As the highest short interest percentage of outstanding shares, yeah. And I think we've even identified instances where the shares outstanding literally exceed the short selling exceeds shares. So this is nothing new. We do not recommend public comments or disparaging disparagement of short sellers in our review shorts or part of a healthy market, however stocks with high short interest tend to have high volume relative to shares outstanding game stop is no different. We can extend this enhances the current opportunity. Good. Oh, that's funny. To be honest, because of the book in movie, felt my name and that of Sion would create a stir and maybe even management. And then Joe passed away in four August. 10 days after Joe passed return from the funeral, sat down on my desk, paused for no small reflection, started by a more game stop. Letters stimulated many emails from GameStop Shareholders, most of which I ignored, fistedously as I did not want to form a group under SEC rules. If I and even one other shareholder combined for over 5% of the shares, and we did not file schedule 13D, we could be subject to SEC. Ah, and then he addresses Rhin Kidney, which makes sense. So when Keith Gail emailed me, he was just another GameStop shareholder to avoid. I ignored it like all the others. I cannot regret it because I was in that mode.",
    "start_timestamp_seconds": 2287.36,
    "end_timestamp_seconds": 2392.16,
    "start_timestamp": "38:07",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2287",
    "chunk_index": 24,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "file schedule 13D, we could be subject to SEC. Ah, and then he addresses Rhin Kidney, which makes sense. So when Keith Gail emailed me, he was just another GameStop shareholder to avoid. I ignored it like all the others. I cannot regret it because I was in that mode. I did not who he was or that Keith Gail had emailed me until the SEC investigation later on 21. A month later, unbeknownst to me, Keith launched as Rhin Kidney began posting GME thesis taking it up on 19, engaged with the company, superficial, agreed to do a short interview with Take Him at Barons. Another letter to GameStop, several of the board started buying shares in September, perhaps in response, monitoring game stop trading closely, stock for signs of a buyback I watched. Patterns companies cannot buy back, cannot buy back stock from 30 minutes before the close for instance, did not know that. I deduced, that's actually interesting. 30 minutes from 30 minutes, but I deduced GameStop was buying back stock. They were doing it through Merrill Lynch Smart. I used Excel to record in real time, both buyback efforts and signs, ownership percentage, yep. OK. So then GameStop sent somebody out to meet him and then contacted by Cohen. So he and Rhin spoke for two hours. Mostly not about GameStop at all, since neither of us wanted to form a group under SCC rules. I enjoy the talk, which were in many directions. Like Rhin",
    "start_timestamp_seconds": 2373.56,
    "end_timestamp_seconds": 2484.96,
    "start_timestamp": "39:33",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2373",
    "chunk_index": 25,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "then GameStop sent somebody out to meet him and then contacted by Cohen. So he and Rhin spoke for two hours. Mostly not about GameStop at all, since neither of us wanted to form a group under SCC rules. I enjoy the talk, which were in many directions. Like Rhin a lot, deep value investor, plenty takes very big positions and weights. So this is also giving you really important insight into what he's doing right now. Cohen is doing right now with the cash that GameStop has, waiting. This is a clearly a part of the way that he views things and how we approach his markets. Well, as far as going investment at the time, seem like long way due to asset cap did not care. This is partly the freedom of not running money for others. This is another big thing people ask, like why I don't open up a fund if I'm successful as a trader. And it's literally because when you run money that includes other people, there are a lot of things that go with it. One of the reasons why Bernie closed down in Cyan Capital. And you can make a lot of money doing it, but there are drawbacks. And if you go back to once you have a decent amount of money, then it doesn't just become a question of, how do I make as much money as humanly possible? It's also like what the fuck do I want to deal",
    "start_timestamp_seconds": 2465.72,
    "end_timestamp_seconds": 2549.48,
    "start_timestamp": "41:05",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2465",
    "chunk_index": 26,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "money doing it, but there are drawbacks. And if you go back to once you have a decent amount of money, then it doesn't just become a question of, how do I make as much money as humanly possible? It's also like what the fuck do I want to deal with and tolerate? Fun fact. Personally, a whole stocks a lot longer than I do when running a hedge fund, nature of the beast, many other managers are the same way. Ryan struck me as more patient. Did not talk again. I was surprised when he took this stake in positions he did. I met with GameStop Management on 21, on 19, discovered both George, Sherman, and Jim Bell were veterans. Otherwise, the meaning did not achieve much. I like them as people. As a result, Hesty Unperman, that my pressure, they bought back 38 million. When is their last buyback that they've done? I'm actually curious about that. I'm gonna ask when was GameStop's last buyback? What does it look like? Tabuary? Is that right? I'm just gonna answer the question, I'm gonna go. Nice. Repurchase shares 300 million the board on four March. Yeah, okay. That was in 19. Okay. Here. There was no short squeeze. High volume continued. 2020 average volume 15 million a day. Less than 25 outstanding. Okay. Sort interest up and then some board changes. Holy shit, how much is in this? Okay, we're almost done. All right, okay. We're doing well. I saw",
    "start_timestamp_seconds": 2536.72,
    "end_timestamp_seconds": 2670.12,
    "start_timestamp": "42:16",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2536",
    "chunk_index": 27,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "19. Okay. Here. There was no short squeeze. High volume continued. 2020 average volume 15 million a day. Less than 25 outstanding. Okay. Sort interest up and then some board changes. Holy shit, how much is in this? Okay, we're almost done. All right, okay. We're doing well. I saw the scroll bar and I was just like, fucking hell. Well, we're good. Okay, non-event is to any shorter long thesis dynamic. Short interest remain at all time high. The stock did not react in April 2020 stock felt new low. It was interesting as JKC of Pet Smart joined the board as a well-former Nintendo President as well as a former Nintendo President and Walmart USCEO. JK was interesting because of the potential connection between JK and Ryan Cohen. Pet Smart had bought Chewie and May 2017 for 3.3 billion. Ryan ran Chewie until March 18. Okay. Continue to hold my positions, Game stops, the tension shifted to also strengthening the balance sheet, which they've done a good job in reducing debt with cash flow, which makes sense. Yeah, I agree with that as well. Little dust up with the board sign in another activist during 2020, but nothing relevant. 28 August, Cohen's firm filed a 13D. There was 65 million outstanding and Ryan had 5.8 million and Sion was at three. Sion was just below the threshold on purpose. Already made my splash earlier to no real impact. Did not wanna go over five. Also traded a portion",
    "start_timestamp_seconds": 2638.0,
    "end_timestamp_seconds": 2750.72,
    "start_timestamp": "43:58",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2638",
    "chunk_index": 28,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "relevant. 28 August, Cohen's firm filed a 13D. There was 65 million outstanding and Ryan had 5.8 million and Sion was at three. Sion was just below the threshold on purpose. Already made my splash earlier to no real impact. Did not wanna go over five. Also traded a portion of my position around something I do when stocks are indulgence for a while and did not want to have to file after every trade. That's another big thing. Ryan was well above the threshold with the purpose. The D in 13D meant Ryan was free to influence management. As well, this was his money and a lot more of it. My firm was never that big because I did not market it. Chewie had IPO'd a little year, a little over a year earlier. GME jumped over 20% the next trading day. Ryan was 35 average age of the millennia retail trader was you guessed at 35. Okay, this talks a little bit about Chewie and COVID and stuff. Increasingly, Fresno speculation over Ryan's motives hit another level in 16 November, led her badgering game stop to new technology for a direction. Ryan's letters stopped short of recommending a comprehensive strategy, but made it clear the company needed to become more technologically with the times. Gintana to push the company in that direction. So again, the interesting thing about this is that it actually gives us a little bit of insight to how Cohen might be thinking about what",
    "start_timestamp_seconds": 2726.36,
    "end_timestamp_seconds": 2824.2,
    "start_timestamp": "45:26",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2726",
    "chunk_index": 29,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "comprehensive strategy, but made it clear the company needed to become more technologically with the times. Gintana to push the company in that direction. So again, the interesting thing about this is that it actually gives us a little bit of insight to how Cohen might be thinking about what to do with this cash, especially if he's driving them into a deeper technological focus. Also, give me one second, beer beat. We back. All right, where we up. First three days of trading stopped, did not move. Everything Cohen suggests is either already being done or highly speculative. I did not say it, but I agreed, then the stock took off. By the months and sign was out coming to the end of 2020, carried full game stop position three million shares. There's 16 months, most of that time, I lent my shares out at very good rates, high double digits. This is one of the smarter ways realistically, for somebody that's a holder of this thing to make good money, especially on things that are hard to borrow. It doesn't really apply as much anymore simply because game stop itself is now, I think they're still easy to borrow. If I'm not mistaken, if nothing, hold on. Yeah, they're still easy to borrow, just because of the offerings, they have pretty good capital and pretty good availability right now. Lucrative, big part of the trade, do not believe I ever earn so much money by simply being short",
    "start_timestamp_seconds": 2809.92,
    "end_timestamp_seconds": 2922.88,
    "start_timestamp": "46:49",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2809",
    "chunk_index": 30,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "borrow. If I'm not mistaken, if nothing, hold on. Yeah, they're still easy to borrow, just because of the offerings, they have pretty good capital and pretty good availability right now. Lucrative, big part of the trade, do not believe I ever earn so much money by simply being short a stock. Of course, far less than if the chart below represents science holding time as a top-long position of them. I have each costs 332 when it really started to run in 2020 soldaposition at 1350. Short interest is a percent of the flow, I accident here we go. 128%. Let's see this part. I could have analyzed the situation better, a new game stop inside and out thought I understood the volume short interest to other dynamics, blinded by what I saw as execution risk. As well, I am a human seen byback shrink shares by third in the setting of 100% short interest. Do you organizing as a board of directors selling a spring that had the narrative against up was just bad? Figured what had already been, raw was more concrete than the vague technology forward makeover, so I used Ryan's unveiling as an opportunity to close out. I had no idea what was coming. I had no idea that Ryan Kitty existed. I love that. Ryan Kitty specifically has mentioned. That's fucking awesome. I had no idea that a widely distributed gamma squeeze with thread the needle to become the one and only legal market",
    "start_timestamp_seconds": 2905.4,
    "end_timestamp_seconds": 3003.2,
    "start_timestamp": "48:25",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2905",
    "chunk_index": 31,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "close out. I had no idea what was coming. I had no idea that Ryan Kitty existed. I love that. Ryan Kitty specifically has mentioned. That's fucking awesome. I had no idea that a widely distributed gamma squeeze with thread the needle to become the one and only legal market corner. So funny enough, this is where I ended up getting more involved. It's because from the options market, it was actually quite clear that something squirrely was going on. So if I zoom this out and we go back and years. During this period, in this end, this is like six months we'll go back like a year. This is like a year long. So in this period, there was some really, really interesting activity going on in game stop. If you go back further, you can see, especially during a lot of the period that brewery was involved. It's kind of like oscillating sideways, trending down slightly. And then all of a sudden, you can see this spike in volume. This line, oh, no, you guys can't see it. Sorry. So below this plot is a volume plot or a relative price plot. And you can see that everything started going absolutely ballistic back here. This is where it caught my eye, literally in this zone, which funny enough, as brewery is doing a lot of this really, really deep detailed analysis and shout out to him for it, then there's a fucking knee in or tall like",
    "start_timestamp_seconds": 2987.2,
    "end_timestamp_seconds": 3096.88,
    "start_timestamp": "49:47",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=2987",
    "chunk_index": 32,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "everything started going absolutely ballistic back here. This is where it caught my eye, literally in this zone, which funny enough, as brewery is doing a lot of this really, really deep detailed analysis and shout out to him for it, then there's a fucking knee in or tall like me that sees something that looks weird in terms of price and the options market and then I get involved. But the cool part about the way that I don't think I've ever done like a dedicated video on how I traded game stop through here because it was actually really fun. I did a bunch of different stuff. But this was for me, like the calling card. It was like the bat signal. So it's interesting that almost Rue, his article, is where I end up picking up and entering this equation. So let's continue. Or did I go? Okay. No idea distributed gamusquees. I did not think more about it during fourth quarter of 20 other worries. We dropped a very large separate account due to a management change. Countless over 25% of their assets and required sales across the portfolio as they approach here. That sucks. During 2020, basically doubled their money, but no new money was coming in as I just did not market. He mentioned that. Withdrawal Lawrence says you should make that video. Yeah, I actually will have to go back through my archives as well because I haven't all logged, but I don't",
    "start_timestamp_seconds": 3075.28,
    "end_timestamp_seconds": 3182.16,
    "start_timestamp": "51:15",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3075",
    "chunk_index": 33,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "2020, basically doubled their money, but no new money was coming in as I just did not market. He mentioned that. Withdrawal Lawrence says you should make that video. Yeah, I actually will have to go back through my archives as well because I haven't all logged, but I don't remember like the specific things I did in when. I think that could also be a fun post Mortum really just for me to see like what I did and how I did it because my expectation is I would have done things differently. That would be my guess looking back now what four years. I probably would have done things slightly differently. There's a reality behind the longer you do something the better you get it at even if you're already good at it. As I've told you guys, I'm creeping up on 20 years of trading and even though when I'm in like the mid of that, right, 15 years at that point, I'm completely competent and good at what I do. But I'm still learning. I would call it at an exponential level, which is interesting. It's nowhere near as exponential as it used to be. A lot of the stuff that I learn now is way smaller in terms of like what it is and how broad the impact is in terms of like other factors, but it can make a profound impact on profitability. Okay. No, the withdrawals came in from others as well. Needed",
    "start_timestamp_seconds": 3163.6,
    "end_timestamp_seconds": 3248.08,
    "start_timestamp": "52:43",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3163",
    "chunk_index": 34,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "lot of the stuff that I learn now is way smaller in terms of like what it is and how broad the impact is in terms of like other factors, but it can make a profound impact on profitability. Okay. No, the withdrawals came in from others as well. Needed cash to pay taxes on gains selling note across the portfolio. So sat on the sidelines. Okay, 50 days or so after Sion got out, the business became the bill of the ball. They could not take their eyes off it and either could I. January 13, 21 broke out of the teens and almost touched 39. A stock with 67 million shares outstanding. I did not believe I seen that before. Then the stock went sideways and falling volume for about a week. If I had not sold and I would have sold that at the peak. My years long investment might have turned 12 million into a billion, but that was never a possibility. I also noticed GameStop call options were crazy volume again. Again, that was my calling card. So this is another fascinating example of how two different traders and investors can wind up in the same place, but for very different reasons. He did this really rigorous fundamental analysis a lot of fundamental projections interacting with the board, which is cool for a long time before this point several years. And the thing that drew me and was effectively unusual options activity. Like that's the",
    "start_timestamp_seconds": 3234.16,
    "end_timestamp_seconds": 3330.8,
    "start_timestamp": "53:54",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3234",
    "chunk_index": 35,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "same place, but for very different reasons. He did this really rigorous fundamental analysis a lot of fundamental projections interacting with the board, which is cool for a long time before this point several years. And the thing that drew me and was effectively unusual options activity. Like that's the nutshell of what drew my attention here. As of July 19, noticed call options trading abnormally high volume in the stock, both in and out of line came before. In January of 21, volume is 10 times bigger on shares and call activity. Okay. What was happening has been well described, but for those who had not heard yet go over briefly, retail traders in the thousands eggdond by Roy and Kitty bought massive volumes of calls, orders of magnitude more than typical. The other side of that trade remark, it makers hedge funds prop desks. The two biggest word by far, the market makers Citadel in virtue. Those two have the capital required to sell that volume of calls. This is where the Greeks come in. It is not my game. I hate the Greeks, the symbols, not the people, but they play it a big role. That's funny. I could see why he would hate the Greeks because especially for him that's trying to play a specific thing. They can kind of sabotage that, but I happen to find them pretty interesting. Anyways, when Citadel market maker sells a call, it buys the stock on the open market",
    "start_timestamp_seconds": 3310.8,
    "end_timestamp_seconds": 3394.88,
    "start_timestamp": "55:10",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3310",
    "chunk_index": 36,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "I could see why he would hate the Greeks because especially for him that's trying to play a specific thing. They can kind of sabotage that, but I happen to find them pretty interesting. Anyways, when Citadel market maker sells a call, it buys the stock on the open market in amounts such as the entire position is Delta Neutral. Funny enough, this actually is not correct at all. That surprises me that he would say this. That's completely incorrect. Completely incorrect. That's actually shocking. I see, maybe I'm, let me read a little bit more for it. But in a nut like this, I would never say this is completely wrong. Delta reflects sensitivity to price movement. Yep. Gamma is the slope or rate of change of Delta. Yep. As Gamma increases, making intuitive sense harder to maintain a balanced Delta Neutral position over time. Yes, Gamma fights attempts at Delta Neutrality. Yes. When a market maker dealer sells a call option, it becomes short Gamma. Normally, not a problem. Buy stock and manage towards Delta Neutrality. Again, this is not correct. Not correct. The coordinated buying of calls by the thousands, all the ones created a systemic Gamma exposure across all dealers at the same time leading to a systematic rise in short Gamma. That still is correct. Made it very hard to maintain Delta Neutrality. Fine. To restore neutrality, all the dealers had to buy stock at the same time. Again, I don't agree with that. And",
    "start_timestamp_seconds": 3379.44,
    "end_timestamp_seconds": 3475.92,
    "start_timestamp": "56:19",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3379",
    "chunk_index": 37,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "exposure across all dealers at the same time leading to a systematic rise in short Gamma. That still is correct. Made it very hard to maintain Delta Neutrality. Fine. To restore neutrality, all the dealers had to buy stock at the same time. Again, I don't agree with that. And that's a big part of what happened in GameStop is called a Gamma I have a completely different take of this. Okay. That's dramatic. Not a completely different take. But there's actually a decent amount of nuance missing from this. I think I have a video on Gamma squeezes, but I'll summarize my yeah, here we go. I'll summarize like the parts in here that I just would call out as slightly inaccurate. The first thing is a market maker does not inherently immediately buy stock on the open market. In an amount that the entire position is Delta Neutral. They actually very frequently do not do that. And it actually four goes understanding what the rest of the market makers book looks like. For example, let's say that you have market maker C for Citadel. And we look inside their basket. Let's say in their basket, when we look at the specific partition, this is blown up for clarity. In the specific partition of GameStop, they're long and short calls and puts all over the place, all different kinds. So this idea that they need to immediately go into the market and buy shares to offset the Delta, it",
    "start_timestamp_seconds": 3456.24,
    "end_timestamp_seconds": 3568.96,
    "start_timestamp": "57:36",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3456",
    "chunk_index": 38,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "at the specific partition, this is blown up for clarity. In the specific partition of GameStop, they're long and short calls and puts all over the place, all different kinds. So this idea that they need to immediately go into the market and buy shares to offset the Delta, it completely four goes with the rest of their book looks like. That's the first thing. The second thing is more often than not, you don't want a completely hedgeer position because it costs money to do so. So if you think you can get away with leaning your Delta's slightly, you often will do that. So if somebody wants to buy a call, so they're going to buy to open a 10, or let's do like a 50 Delta call. And on the other side of this, a market maker sells this call. 50 Delta call. The net position here in a vacuum, by itself, means that they're short 50 Delta's, 50 shares. However, their first way to manage this is not to go into the open market and buy to open 50 shares. One of the first things that they're going to do is analyze their gamma. And let's say that this makes them short some gamma. Let's say that they're short 0.3 gamma. So one of the first things they're going to do is find an option that gets rid of this gamma. If they don't already have it in their book. So in this case, they can",
    "start_timestamp_seconds": 3539.84,
    "end_timestamp_seconds": 3647.76,
    "start_timestamp": "58:59",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3539",
    "chunk_index": 39,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "say that this makes them short some gamma. Let's say that they're short 0.3 gamma. So one of the first things they're going to do is find an option that gets rid of this gamma. If they don't already have it in their book. So in this case, they can get that long gamma in a bunch of different ways depending on how they choose to get it. They're going to buy something to get it. But you get rid of this gamma. Whatever you buy to get rid of this gamma is immediately going to impact your Delta requirement in some capacity. It could increase it decrease it, whatever. Then you might go buy an hedge, either all or some. The way it typically works is if you're further out from expiration, you're not going to hedge the entire position. As you get closer and closer to expiration, if you have options that are in the money, you'll hedge the full position because you know that they're going to get called away. Or if it's something that you think somebody has insider information of the sunk capacity. Massive caveat. I'm not a market maker. I've never been one. I've talked to several and one of my really good friends and mentors is one and still is one. So all of my knowledge on this is second hand, but from a first hand source. So you should always take what I say with a grain of salt. But you should",
    "start_timestamp_seconds": 3631.6,
    "end_timestamp_seconds": 3713.6,
    "start_timestamp": "01:00:31",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3631",
    "chunk_index": 40,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "talked to several and one of my really good friends and mentors is one and still is one. So all of my knowledge on this is second hand, but from a first hand source. So you should always take what I say with a grain of salt. But you should be aware of this structure. It is not as linear as this. And this also isn't what causes the gamma squeeze necessarily. The fact that everybody's going out at the same time just to become delta neutral on something that they just sold. A lot of it has to do with managing their existing book. But my other guess is he probably knows all of that. I would have to assume my guess is he's just simplifying it here, without going down the rabbit hole of the world of options because you naturally lose a ton of people when you do that. So that's my guess. I think he knows this. But I just don't want the over simplification here to confuse anybody that's on the string. All right. Let's continue fairly quickly watching a legal market corner traditionally a corner is a group of investors buys up enough supply of a commodity investment to artificially drive prices higher and cause squeezes. Very common in the days of railroads stock bubbles. Game stop specific forums online with pseudonym leaders actively promoted the gamus squeeze is a way to get the shorts and it was given the cape of righteousness retail",
    "start_timestamp_seconds": 3699.68,
    "end_timestamp_seconds": 3784.32,
    "start_timestamp": "01:01:39",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3699",
    "chunk_index": 41,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "of a commodity investment to artificially drive prices higher and cause squeezes. Very common in the days of railroads stock bubbles. Game stop specific forums online with pseudonym leaders actively promoted the gamus squeeze is a way to get the shorts and it was given the cape of righteousness retail sticking it to Wall Street. Wall Street of course spends all its days sticking it to each other. But that's populism for it. If a hedge funder group of hedge funds did the same thing executing a continuous days or week long gamus squeeze, it would have been illegal. If a couple of non Wall Street people had the capital to do the same thing, not legal. Just to be the corner coordination broadly enough and it just becomes a free market which in turn makes the corner pointless with no advantage. Say if you thousand do it, maybe it's a collective they find a sweet spot of distributed coordination where it works like a corner and is by default legal simply because enforcement isn't possible. Market a symmetry continues no enforcement in the corner works as he said no thank you carry on carry on. Kudos to retail for threading that needle. I do not believe this has been seen before. Once done it spreads like lightning. COVID gave retail traders personal time. Exactly at the point where in kidding and Ryan Cohen took the mic. Then COVID strikes naked short sellers going back 20 years naked short sellers",
    "start_timestamp_seconds": 3763.6,
    "end_timestamp_seconds": 3848.16,
    "start_timestamp": "01:02:43",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3763",
    "chunk_index": 42,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "threading that needle. I do not believe this has been seen before. Once done it spreads like lightning. COVID gave retail traders personal time. Exactly at the point where in kidding and Ryan Cohen took the mic. Then COVID strikes naked short sellers going back 20 years naked short sellers entered field. Okay. So I know how dirty this game can get but contrary to popular belief. I believe most of that 140% short position in game stop is not naked short selling but rather simple legal layering of trades. What? When a stock is borrowed from an owner owner ensured to a buyer who then in turn lends the shares for shorting a cyclist created and repeated and if demand for shorting is high the cycle will become fairly elegant and long sequence. I don't know maybe I'm too far in the tin at this point but I actually don't believe this. I believe what he's saying can happen but I do not believe that the majority of that 140% was legal layer of trades. I think they were trying to sell their box that thing. But just my take doesn't mean anything it's just my opinion. Most of the exposures in the chain are actually synthetic sounds terrible. Perfectly legal and correct. Every one of those transactions in sequences recorded and properly settled the wiring of the market deals with this just fine during normal times. It would take a very big volatility event to upset it. Humans",
    "start_timestamp_seconds": 3832.0,
    "end_timestamp_seconds": 3932.48,
    "start_timestamp": "01:03:52",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3832",
    "chunk_index": 43,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "the exposures in the chain are actually synthetic sounds terrible. Perfectly legal and correct. Every one of those transactions in sequences recorded and properly settled the wiring of the market deals with this just fine during normal times. It would take a very big volatility event to upset it. Humans are not idiots. Game stop was unprecedented. All that layering, all the synthetic had to be unwell and urgency at the same time. Beautiful sequencing, broken down dealers have temporary exemptions to be nakedly short which is also not usually a problem for one correlation events like game stop happens. This is a big part we have to talk about. Hey yo everybody, big massive shout out to Lauren in the chat for looking up five people and given five people channel sub. Thank you so much for doing that. This part is the important, the important thing. This naked short issue and this has a lot to do with the absolute obsession with liquidity and a focus on liquidity. That's why dealers get this temporary exemption. The problem with that is I actually believe it gets abused and I think that we can see it happening and see it being abused. I don't love that. This is what happened with GameStop. All that call buying retail created the aforementioned Game of Scwees and layering became a mess. See but this is I don't agree. I just don't agree with this. The reason why I don't agree with this is",
    "start_timestamp_seconds": 3915.92,
    "end_timestamp_seconds": 4006.32,
    "start_timestamp": "01:05:15",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3915",
    "chunk_index": 44,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "being abused. I don't love that. This is what happened with GameStop. All that call buying retail created the aforementioned Game of Scwees and layering became a mess. See but this is I don't agree. I just don't agree with this. The reason why I don't agree with this is maybe it's the way that they frame it. Maybe again maybe he's inferring it differently and then I'm reading it differently. But I believe that the call buying by retail created the ramp for a Gamma squeeze. I actually do not believe retail in any capacity actually caused the squeeze. I don't see that. What ends up happening here again. Think of it in terms of what he's talking about and the way that we know that market makers hedge. They absolutely find a niche that they can operate in for the retail traders but it doesn't inherently cause this squeeze. You need people going to the open market really aggressively. So one of two things had to happen. All of the retail trading volume all had to came in all at once driving that behavior which didn't happen or you have more of a Gamma ramp. The concept of a ramp is very different. And I'll show you. If we look at the current options chain and we look across the near term options. Here's effectively what goes on. As the underlying near term in time, this is still kind of far out by the way 27 days. It",
    "start_timestamp_seconds": 3988.0,
    "end_timestamp_seconds": 4099.12,
    "start_timestamp": "01:06:28",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=3988",
    "chunk_index": 45,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "a ramp is very different. And I'll show you. If we look at the current options chain and we look across the near term options. Here's effectively what goes on. As the underlying near term in time, this is still kind of far out by the way 27 days. It would be even near term that really starts to get interesting. But what ends up happening is these out of the money options are not necessarily being hedged fully. They might be a partial hedge. But it's because the overwhelming probability is for them to be out of the money and they don't want to carry the cost to hedge. As things fall in the money, especially as you close to expiration, the probability of them staying in the money are pretty high. So you have to hedge that. As more and more fall in the money, that's what causes the delta to shift broadly. It's not just their existing book and the Gamma on that shifting. But it's also the delta changing based on Gamma. But then the composite effect of more and more options falling in the money. So I think there's another layer to this that isn't being mentioned. And I would reframe this personally. And I would say that the retail didn't cause the Gamma squeeze. I think retail created a Gamma ramp and then the subsequent behavior of dealers and naked shorts caused the Gamma squeeze. It was resolved by panic buying, which we saw.",
    "start_timestamp_seconds": 4072.16,
    "end_timestamp_seconds": 4170.96,
    "start_timestamp": "01:07:52",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4072",
    "chunk_index": 46,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "being mentioned. And I would reframe this personally. And I would say that the retail didn't cause the Gamma squeeze. I think retail created a Gamma ramp and then the subsequent behavior of dealers and naked shorts caused the Gamma squeeze. It was resolved by panic buying, which we saw. Right. I think you guys told me a couple times that there were a few instances where like partial shares were trading for an insane amount of money. Professional fund managers, short sellers were caught out in this way. Identifiable real shares became scarce. This was an absolutely critical, critical, critical piece to this. If these shares were not so scarce, this wouldn't have happened. But because of the shares were so scarce. And because a Gamma ramp was laid, that's what led to a squeeze. Which is again, really important to know. Again, here, no shorts had to be naked for this to happen. Sure, there were some, but naked short selling was not a prime factor. That part I can't debate either way. I'm really not sure how big of a factor naked short selling was or wasn't during that. That I can't weigh in on because I don't know, but I definitely don't think it really matters that much either direction. It really depends on what the positions were. Okay. A lot going on middle of 21 thought it was less fun. Meemstocks had become an almost sober investment strategy, egg done by celebrity CEOs, 21 NFTs",
    "start_timestamp_seconds": 4151.28,
    "end_timestamp_seconds": 4251.44,
    "start_timestamp": "01:09:11",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4151",
    "chunk_index": 47,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "don't know, but I definitely don't think it really matters that much either direction. It really depends on what the positions were. Okay. A lot going on middle of 21 thought it was less fun. Meemstocks had become an almost sober investment strategy, egg done by celebrity CEOs, 21 NFTs sword, several say shell, I say village sluts. We're partying like 99. Game stops sold over 1 billion in stock at 225 a share. Absolutely a smart move, which I completely agree. But man, I just thought retail was going to be shredded on this means thing. I had been on the sidelines, but I felt I should speak up. I gave an interview to parents and late June trying to warn people. People wonder why do this? But if there's one thing I wish it could have done, effectively warned or spoken about what was happening in a O5-07, did myself know favors not smiling during that walk in front of the cameras, Barry Burrie forever. Early but much less than usually AMC collapsed. Okay. Hope some listen to any event, GameStop 2025 market capitalization near 10 billion on the surface given his rate, GameStop that number is stunning. Not only relative to what I was paying for the stock and what the company was worth. There's a few years ago. If I held my game stop this entire time investment, we were 250 million. Roughly the same amount might evontion investment would have become over 25 years and",
    "start_timestamp_seconds": 4235.12,
    "end_timestamp_seconds": 4320.56,
    "start_timestamp": "01:10:35",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4235",
    "chunk_index": 48,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "Not only relative to what I was paying for the stock and what the company was worth. There's a few years ago. If I held my game stop this entire time investment, we were 250 million. Roughly the same amount might evontion investment would have become over 25 years and they had a very good dual-police. GameStop has been a run for some time now by Cohen. His tenure not been perfect. The company is recently produced significant free cash flow again, very large-large part due to cash and then also cutting expenses. Has a ton of cash on the balance sheet, some very asymmetric convertible debt, and a business model that has been revamped to be more online, more digital, more crypto, more collectibles and fewer stores, which is good. As a melting ice cube and a capital structure with some optionality game stop is roughly as I approached it in 18, except it's only 16% shorted, which is a completely different scenario. All the numbers are 10 times bigger and Ryan is running it for better for worse. Those who know me as well of those read my post, know that I believe history often lends a valuable perspective to analysis. This post is along those lines. It's a foundation's post. These post-cover subjects that would feel at home in a book if I were to write one, they're meant to provide both foundation and a reference for future ideas. What you're analysis of current opportunities, whole saga",
    "start_timestamp_seconds": 4308.24,
    "end_timestamp_seconds": 4393.6,
    "start_timestamp": "01:11:48",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4308",
    "chunk_index": 49,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "perspective to analysis. This post is along those lines. It's a foundation's post. These post-cover subjects that would feel at home in a book if I were to write one, they're meant to provide both foundation and a reference for future ideas. What you're analysis of current opportunities, whole saga valuable lesson, hope for some of you. This second and final-plus game stop many series will be an idea post, break down game stop as an investment today until next time. That's a really cool article. I appreciate him very much for writing that. Massive shout out to Wiggly for finding it, Lauren, for bringing it up. Then also, I will thank Lauren on behalf of kicking wing, cram of the crop, mark, T, Houghton, and TYD for Huck and Emma. Appreciate everybody. I want to spend a minute talking about where game stop is now and how things look current state. Because after this recent earnings, this drop wasn't highly surprising. With where game stop is now, I find it like a lot of other names running up to a decision point. Because it is in this very, very narrow window. I believe it has two two directions. I still believe that this down here looks more of a floor to me than anything. But we need to take out this volume profile to the upside. If we look in a little closer, volume has not been super impressive, especially on some of these updates. The volume itself is",
    "start_timestamp_seconds": 4376.56,
    "end_timestamp_seconds": 4494.64,
    "start_timestamp": "01:12:56",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4376",
    "chunk_index": 50,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "still believe that this down here looks more of a floor to me than anything. But we need to take out this volume profile to the upside. If we look in a little closer, volume has not been super impressive, especially on some of these updates. The volume itself is a little bit light. The distribution of options is still extremely extremely bullish in terms of overall positioning. But I am starting to see more of this, which is a ton of short call premium. The reason why you're going to see short call print on part of the short call premium, I have a covered triangle right now in game stop where I sell calls against the shares at a ratio. The reason why I do that is because the volatility in game stop is so high, you can't really deny it. So much is Michael Burie, how he lent his shares. That's kind of what I'm doing with the short calls and allowing people to buy them. If we look at what this is, once it's loads, if it loads, I want to show you the rest of the, I don't know why those are broken. Anyways, if you look at what the ball is, for stuff that's marginally out of the money, the 32 delta calls are like 43% of all. The 32 delta puts which are somewhere in here are about 40%. So you still have really strong, really strong call skew. And it actually gets",
    "start_timestamp_seconds": 4470.48,
    "end_timestamp_seconds": 4574.48,
    "start_timestamp": "01:14:30",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4470",
    "chunk_index": 51,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "you look at what the ball is, for stuff that's marginally out of the money, the 32 delta calls are like 43% of all. The 32 delta puts which are somewhere in here are about 40%. So you still have really strong, really strong call skew. And it actually gets aggressive AF as you get further out, but then it slows a lot. And then you're actually seeing put skew, which is a little less normal. So what's happening right now is the market has calls skew for pretty close out of the money and then it explodes relative, but then Taylor's often in terms of its slope. Whereas the put sites inverse, the closer stuff is a little bit depressed in terms of vault, but then it gets parabolic out of the tails. Sometimes in game stop out of the tails is actually where you'll see insanely high vault numbers relative. But this puts skew that you see is actually more quote unquote normal for standard names that there's hedging done with long puts to the downside. All of that at least right now leads me to believe that the market itself is split on this, but it does look like most of the volume that we see, at least I would imagine is not like bearish short calls as this is necessarily outlining. You have to read between the lines a little bit. My expectation is that most of those are short calls against some sort of shares",
    "start_timestamp_seconds": 4550.88,
    "end_timestamp_seconds": 4642.8,
    "start_timestamp": "01:15:50",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4550",
    "chunk_index": 52,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "look like most of the volume that we see, at least I would imagine is not like bearish short calls as this is necessarily outlining. You have to read between the lines a little bit. My expectation is that most of those are short calls against some sort of shares and taking advantage of that vault. For a reminder, my coverage strangle on the year right now is up 22.7% Whereas on the year, game stop is where is game stop? 31, 84, it started so it's down 29%. That's generally speaking the power of trading the vault in this thing. Having that vault allows me to trade stuff like this even as it's having a bit of a bumpy year. And it's because there's so, so, so much vault. So there's a couple ways people can trade this. I prefer to trade it. I'm looking at GM by the way. Why am I doing that? There we go. I was noticing that that dip seemed too deep because a lot of those dips that I see in game stop were a little bit shallower, but I was thinking of these. So we're in game stop proper now. And if we look at net premium, it shouldn't look all that different. The front is typically long out of the money calls, but you could see those same bearish bars out here, same same. The big difference though with game stop as well is it's typically played more so in the",
    "start_timestamp_seconds": 4631.04,
    "end_timestamp_seconds": 4737.92,
    "start_timestamp": "01:17:11",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4631",
    "chunk_index": 53,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "we look at net premium, it shouldn't look all that different. The front is typically long out of the money calls, but you could see those same bearish bars out here, same same. The big difference though with game stop as well is it's typically played more so in the front that people are rolling out. That's for gamma. And they're trying to gain increasing exposure to gamma. Anyways, the few ways that something like this can be played is I prefer to trade the coverage triangle in there because I think holding the underlying one. I do it literally again just as nod to the community. But more so than that it allows me to trade if there is a squeeze a bit more liquidly. But I do not foresee a squeeze on the horizon because there's no underlying catalyst for it. Even if the options market remains active, it's still missing the compression of underlying shares and availability of underlying shares. If we take a peak really quick, let's find what the shorts look like. So short shares, I mean, there's still a lot of them. FDDs look like they're coming down. The borrowing rates are way back down to earth although still by the way very high, but relative, not insane. And the overall short volume is not, it's not overly profound as far as I'm concerned. And the total short volume ratio still. So I think if you're trading game stop at least at the moment,",
    "start_timestamp_seconds": 4722.72,
    "end_timestamp_seconds": 4838.16,
    "start_timestamp": "01:18:42",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4722",
    "chunk_index": 54,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "down to earth although still by the way very high, but relative, not insane. And the overall short volume is not, it's not overly profound as far as I'm concerned. And the total short volume ratio still. So I think if you're trading game stop at least at the moment, you're kind of trading it from a fundamental lens more than anything. Something as in you like the company, you think Ryan Cohen has a turnaround story in mind that kind of stuff. And that's a big part of what I'm doing again along with the the element of vault because again, I will mention again, the the vault in there is super strong. And that's a beautiful, literally, a beautiful part of what the underlying provides. So I think to summarize all of that, the main thing that I would pay attention to with game stop at least here in the front is if you believe in Cohen and what Cohen is broadly doing, then I think you're in a pretty good spot. If you don't quite think that way, then that puts you in a slightly different bucket. And going and trying to play some sort of squeeze factor right now, I actually think is a like a pretty damn hard sell just because it does not look like it does not look like that's so much on the dock it. But those are just my opinions. Any questions or anything that you guys think we should take",
    "start_timestamp_seconds": 4807.68,
    "end_timestamp_seconds": 4929.44,
    "start_timestamp": "01:20:07",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4807",
    "chunk_index": 55,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "factor right now, I actually think is a like a pretty damn hard sell just because it does not look like it does not look like that's so much on the dock it. But those are just my opinions. Any questions or anything that you guys think we should take a look at before we bounce? I am happy to poke around if you guys want otherwise. Mills hit me up for Dinden what you want. I believe the vault will do well. What vault? What vault? The NFT thing? Is it something else? What vault lord? What fucking vault? Beta testing with cards. Is it the NFT thing though or is it something else? What is this? Something else? I saw them talking about a NFT thing but okay let me look it up. GameStop Vault reverse the secure storage system integrated in the power pack platform launched in partnership with PSA so I know about the partnership. So it's primarily for PSA graded cards that allows the vault allows users to store physical items securely. Okay so I was just paying attention to the digital ownership component. Yeah I understand. Wiggly says they basically sell physical loot boxes now with PSA graded member Belia. Yeah I think the cool part about the vault though is that you get still like the tangible idea of having the thing because you get a digital ownership element because I think one of the big things that wouldn't work well with the",
    "start_timestamp_seconds": 4903.52,
    "end_timestamp_seconds": 5058.48,
    "start_timestamp": "01:21:43",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=4903",
    "chunk_index": 56,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "now with PSA graded member Belia. Yeah I think the cool part about the vault though is that you get still like the tangible idea of having the thing because you get a digital ownership element because I think one of the big things that wouldn't work well with the vault idea is if somebody just goes and puts a card in there because the people that collect those cards like to be able to look at them or show them to somebody having the card in a vault and then having an NFT version of it that you could show. I'm like oh yeah this is the thing I can look at it that is pretty cool. So yeah that I get so it's becoming a little bit more of a hybrid retailer in an asset custodian. The thing is is I'm just just don't know how big the market is for that. So power packs is a game of five online experience. They purchase digital packs starting at 20 to 50 random PSA graded cards. You ripped the pack digitally to reveal the card mimicking the excitement of opening physical boosters. The revealed cards are stored in PSA's modern climate controlled vault facility in Delaware with 24-7 security asset management 100% insurance. Keep items in the vault indefinitely. Request shipping. Seller trade digitally. You and manage the collection online. Yeah so it looks like it's only five bucks. Oh hold on it says game stop pro members get",
    "start_timestamp_seconds": 5033.36,
    "end_timestamp_seconds": 5131.28,
    "start_timestamp": "01:23:53",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5033",
    "chunk_index": 57,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "modern climate controlled vault facility in Delaware with 24-7 security asset management 100% insurance. Keep items in the vault indefinitely. Request shipping. Seller trade digitally. You and manage the collection online. Yeah so it looks like it's only five bucks. Oh hold on it says game stop pro members get discounts five dollars off shipping monthly. I see okay. So they're right now focusing on trading cards Pokemon magic the gathering but community speculations suggest future additions like comics, Funko pops. Yeah I think comics that's literally the first thing I was thinking comics can be that's a big market. So I think if they can get into comics that would be huge because then you can also have the physical or the digital comic book which is not that hard to get. Yeah that looks awesome. I completely agree with you. I think that that's a really really really neat idea. I wonder what the total market potential is that for that. What is the total market potential for this kind of idea? No one says a couple larger creators have been making noise about mispriceings of the cards via the card ladder index. I don't know the fuck that is. And how it derives price. Well I imagine well I don't know if that's just like an unrealized value for it but I imagine the standard supply and demand market value would rule. Wouldn't it? I would be mine guess. You see multiple people sit in bloc tens",
    "start_timestamp_seconds": 5107.44,
    "end_timestamp_seconds": 5218.4,
    "start_timestamp": "01:25:07",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5107",
    "chunk_index": 58,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "that is. And how it derives price. Well I imagine well I don't know if that's just like an unrealized value for it but I imagine the standard supply and demand market value would rule. Wouldn't it? I would be mine guess. You see multiple people sit in bloc tens of thousands in the span of a few minutes. Yeah yeah. Wiggly says you're getting in a nitty gritty about pricing. What do you mean about pricing? Oh you mean like the the card ladder pricing? I see. Wiggly says do you know what back it is for sports cards and collectibles? I've noted I never was into any of that stuff. I remember in like junior higher high school I played you heal. I remember doing that with my friends a little bit but that was it. I never got into like any sort of collectibles. Okay so to assess the potential total market impact or addressable market. They focus on the relevant sectors. Okay so approximately 15 to 16 billion which is the global trading market overview. Sports trading cards account for a significant portion about 33 to 34 billion. So massive of which trading cards alone are 15 billion. Grated trading cards represent a high value niche within this while direct Tam isn't isolated. Authentication grading services are valued at 2.2 billion globally. Yeah that's my guess reflecting the ecosystem scale volume wise over 10 million sports card are graded annually. That's the thing is like I'm",
    "start_timestamp_seconds": 5198.56,
    "end_timestamp_seconds": 5320.72,
    "start_timestamp": "01:26:38",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5198",
    "chunk_index": 59,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "15 billion. Grated trading cards represent a high value niche within this while direct Tam isn't isolated. Authentication grading services are valued at 2.2 billion globally. Yeah that's my guess reflecting the ecosystem scale volume wise over 10 million sports card are graded annually. That's the thing is like I'm just not convinced that there's some sort of massive market opportunity there. This to me looks like a standard case of game stop is doing what they should be doing, which is leaning into their strengths, consuming peripheral markets and growing those which I fully agree with. But I'm just not sure there's like some sort of massive opportunity unlock in that kind of markets. It's actually a pretty small market at 2.2 billion in globally because then you know you're not going to penetrate all of that. So yeah I'm super interested. So it's expected to reach 21 or 23 billion by 2030 or 24 at a compound annual growth rate of 6.8% that just sounds completely random to me. I think it's going to increasingly move digital personally. I know that there will always be physical trading cards and a cohort of people that like to do that. But I view it going the way of like manual transmission cars. I enjoy manual transmission because I just think it's more fun to drive. But there is very there's fewer and fewer of them even though there are a number of enthusiasts like me. That's one of the reasons",
    "start_timestamp_seconds": 5288.48,
    "end_timestamp_seconds": 5397.52,
    "start_timestamp": "01:28:08",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5288",
    "chunk_index": 60,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "But I view it going the way of like manual transmission cars. I enjoy manual transmission because I just think it's more fun to drive. But there is very there's fewer and fewer of them even though there are a number of enthusiasts like me. That's one of the reasons when I was buying them a clarinet. I was kind of bummed by it because I wanted to mid-engine because I've never had one before. But those are only paddles. Like they're still manual thankfully, but they're paddle, which is not really quite as fun. And that's why the C7, the Corvette that I have, I was so stoked on the accident, it's manual 7 speed and it's just a different experience driving a manual if you're enthusiastic. Wiggly says would you rather own an NFT of a McLaren? No. No, I've opened prefer not the NFT. I actually prefer I prefer the physical car. But I'm a car enthusiast. That's what I tell people. It's like I think people that buy cars for status symbols literally are fucking stupid and cars are terrible investments. So unless you really enjoy cars, it literally is such an awful place to put money. But I am the kind of person that genuinely drives a lot of marginally utility from it. It stems from when I was a kid. My brother and I, we literally had to learn how to fix cars so that my mom could drive to work because she couldn't",
    "start_timestamp_seconds": 5379.2,
    "end_timestamp_seconds": 5465.92,
    "start_timestamp": "01:29:39",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5379",
    "chunk_index": 61,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "money. But I am the kind of person that genuinely drives a lot of marginally utility from it. It stems from when I was a kid. My brother and I, we literally had to learn how to fix cars so that my mom could drive to work because she couldn't afford going to a mechanic. So we kind of, we both took that as something good to know, but we turned it into a hobby more than something that were forced to learn and then begrudgingly do. And I mean, I literally have a lift in my house for my cars. I have a couple of photos that I put up a while ago where I took the entire McLaren apart. I had it in pieces in the garage just so I could look at it and see how it works. So yeah, there for somebody like me, they're not status symbols in the least, even McLaren's niche. Nobody even knows what they are. They're born out of like a race car culture. That's why the McLaren is orange. It's from the days of black and white tape so that the orange would stick out as a different hue of black. It's like shit like that. I like a lot. But in its why I never bothered with like a Lamborghini, although I really like Lamborghini. So I think they're cool. I think the beginning of them from a fucking tractor company is awesome. But those honestly have a little",
    "start_timestamp_seconds": 5454.32,
    "end_timestamp_seconds": 5526.08,
    "start_timestamp": "01:30:54",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5454",
    "chunk_index": 62,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "black. It's like shit like that. I like a lot. But in its why I never bothered with like a Lamborghini, although I really like Lamborghini. So I think they're cool. I think the beginning of them from a fucking tractor company is awesome. But those honestly have a little too many people that are in that that are just doing it for status, which I just think is super lame. And I don't want to remotely be associated with that. Okay. So looking at this though, the total size does not seem huge. That's the, that's the rug. I see graded authentication subset is like two to three billion. Five to seven billion of non sports collectibles, eight to ten of sports collectibles. So yeah, it just doesn't seem huge. No one says paper tiger trading in goblin where the main two I heard making noise about it. I have no idea of the fuck that is. Joseph, do you think the recent decrease in volatility is made the CSS less interesting? At what point would you look to pivot elsewhere? Well, a couple of things on that. The first thing is as a, again, as a general reminder, I maintain the game stop position again, broadly as like a nod to the community. I still view myself as a guest in the game stop community. And I like being a part of it. I like learning about it, but I haven't been around quite that long. So it's",
    "start_timestamp_seconds": 5516.08,
    "end_timestamp_seconds": 5609.92,
    "start_timestamp": "01:31:56",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5516",
    "chunk_index": 63,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "I maintain the game stop position again, broadly as like a nod to the community. I still view myself as a guest in the game stop community. And I like being a part of it. I like learning about it, but I haven't been around quite that long. So it's just a way for me to be in a bit of solidarity, right? Show some love. That aside, I think people confuse volatility massively. And it's because of this, the volatility has come down in game stop. It's still at 50% vol. And that represents one percent implied volatility percent tile. That means literally one percent of occurrences are lower than where vol currently is. So then you can say to yourself, do I think that means vol might expand? I fall generally more so into that camp. And the other thing is at 50% gross ball, you can still absolutely, you can still absolutely make a ton of money. Let's take a look at a comparison. Let's just take a look at selling a put at, we'll do like a put per delta just so that we can get something that's a little more normalized. Here. If we take a look at this short put, I was just weird what this being half on two screens. The 38 delta put 0.38 is giving 0.7 in terms of premium. This should be like a dollar. Fuck me, 0.7. And then the 23 delta is giving us 0.36. These are for",
    "start_timestamp_seconds": 5596.0,
    "end_timestamp_seconds": 5708.08,
    "start_timestamp": "01:33:16",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5596",
    "chunk_index": 64,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "a look at this short put, I was just weird what this being half on two screens. The 38 delta put 0.38 is giving 0.7 in terms of premium. This should be like a dollar. Fuck me, 0.7. And then the 23 delta is giving us 0.36. These are for the puts. If we put this at a ratio per delta, I'm just going to take the premium divided by the delta. And I'm going to get what the ratio is of premium for delta. Let's take a look at some other names really quick. We'll take a look at Apple. We'll be in the same expiration. They have a 37. We'll track that one. So the 0.37. And that 0.37. I needed to get the strike price as well to normalize it. That's kind of a fuck that up. Sorry guys. That's okay. So the 0.37 you're going to get like 320. Okay. And the strike price for that is 270. Go back to games up really quick. I'll just do the top one. Strike price there is 22. Okay. So here's the little metric that I just built for you. Effectively, what I did was this one is game stop this one's Apple. If you're on the wrong part of the keyboard, you get whatever that these are the strikes. This is your delta. This is your premium. This first ratio is just taking your premium divided by your delta. So how much premium are you getting per",
    "start_timestamp_seconds": 5673.36,
    "end_timestamp_seconds": 5841.68,
    "start_timestamp": "01:34:33",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5673",
    "chunk_index": 65,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "game stop this one's Apple. If you're on the wrong part of the keyboard, you get whatever that these are the strikes. This is your delta. This is your premium. This first ratio is just taking your premium divided by your delta. So how much premium are you getting per delta? Then this one is taking that ratio and it's putting it as a percentage to the strike price just so that you can normalize across price. Otherwise the raw number of Apple is always going to be more. So you can see that what you're getting per delta per cost is insanely higher in something like game stop 8.4% versus 3.2. So the summary of that story is just because game stops ball is lower relative to itself doesn't mean it's low ball. It is super high ball still. And the other fun fact is very frequently there's a relationship between implied ball and realize ball specifically during periods like this that can make it super lucrative. So the short answer to that is I mean this I'm in the cover triangle and game stop again for the reasons that I listed earlier but I wouldn't let the recent trend confuse you into thinking that there's anything bad in terms of ball. There's still an absolute massive amount of ball relative to this thing in general. Plenty of ball opportunity. All right gang awesome session thanks for bringing this stuff up really enjoyed it. If you guys need anything",
    "start_timestamp_seconds": 5826.8,
    "end_timestamp_seconds": 5928.64,
    "start_timestamp": "01:37:06",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5826",
    "chunk_index": 66,
    "word_count": 250,
    "upload_date": null,
    "duration": 5935.0
  },
  {
    "video_id": "zGjOGsRcxzo",
    "title": "Michael Burry & GameStop Analysis | Meme Stock Watch Ep57",
    "text": "trend confuse you into thinking that there's anything bad in terms of ball. There's still an absolute massive amount of ball relative to this thing in general. Plenty of ball opportunity. All right gang awesome session thanks for bringing this stuff up really enjoyed it. If you guys need anything you can always hit me up be an outlier be an ape. Let's see you guys later.",
    "start_timestamp_seconds": 5902.64,
    "end_timestamp_seconds": 5928.64,
    "start_timestamp": "01:38:22",
    "video_url": "https://www.youtube.com/watch?v=zGjOGsRcxzo",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=zGjOGsRcxzo&t=5902",
    "chunk_index": 67,
    "word_count": 67,
    "upload_date": null,
    "duration": 5935.0
  }
]