[
  {
    "text": "What is up, ape nation and the outliers, ape outliers, kind of the combination thereof. Hopefully we have a little bit of a healthy mix in the house today. I'm gonna grab the chat, move it over here so I can say hello and keep up with you all. So the agenda for today is a few things. The first thing I wanna do is kind of work through some homework that I'm trying to piece together, specifically looking at the behavior of GameStop before previous significant moves. So essentially what I'm literally doing right now as I'm talking to you is I'm going into bar charts, I have an account with them to gain access to some daily stock data. Well, you don't even need it. You can get it from Yahoo Finance whoever you want. Just tell me where I'm getting the data from. And I'm gonna download daily GME data from 2000 to present. So today the 24th of August, and I'm downloading it right now. And I'm essentially gonna start a process in the background while I'm doing this. And I'm gonna run it through a bit of a process that's gonna help me identify all of the periods where GameStop had a price appreciation of at least 100. That's my initial thought. And literally I'm doing it now as we speak. So if there's other permutations that you're interested in, let me know. We can take a look at others at the same time. But",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "of the periods where GameStop had a price appreciation of at least 100. That's my initial thought. And literally I'm doing it now as we speak. So if there's other permutations that you're interested in, let me know. We can take a look at others at the same time. But what I'm doing now is you've probably heard me talk about this idea of like finger printing. And I don't know, it's just kind of the term that comes to my mind, it's not actually anything that's like widely accepted to mean anything. But for me, finger printing is just part of creating an identity for something that's unique to that thing. That's kind of the whole idea of a fingerprint is that it's unique to you. So what I'm working on right now is taking a look at some of GME's fingerprint around some of the larger moves. Because the last couple of sessions I've been spending time and hopefully we can spend time on this one as well. But learning about the background, learning about the players, learning about Rory and Kitty, learning about the way he posts, learning about the positions based on what he posts, right? To give me a bunch of just different contextual understanding of how this whole thing works. So now that I have at least a rudimentary, and I highlight that, it's rudimentary. I still do not consider myself somebody that really knows much about this story, which is why I'm still",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "To give me a bunch of just different contextual understanding of how this whole thing works. So now that I have at least a rudimentary, and I highlight that, it's rudimentary. I still do not consider myself somebody that really knows much about this story, which is why I'm still spending so much time learning about it. So while I have a bit of an understanding of the background, what I'm trying to do is get a better sense now of the actual movements we experience and what it looks like when those movements are happening. Because so far, there's been one universal component to everything I've seen so far with GameStop when it comes to a move. Every single time I've seen it make a move, is I see volume expand meaningfully before the move happens. So in this case, there's kind of like a pre-move, I guess I should say, because there's still a massive move. So if we look here on the second of May, the range that we had high to low was 1288 to 1096. So it's like a two-point range. That doesn't sound crazy, but if you look at that as a percentage of the value of the product, that's not insignificant. More importantly than that, if we take a look at the average daily ranges preceding that, it's much lower. What I find more important is if I look at the volume on the day before the big move, in this case kind",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "the value of the product, that's not insignificant. More importantly than that, if we take a look at the average daily ranges preceding that, it's much lower. What I find more important is if I look at the volume on the day before the big move, in this case kind of this first leg up, I'll refer to it as on the first of May, the volume was 2.6 million shares traded. And for broader context, the five-day average trading volume before this was 4.3 million shares. So that's about what it's looking like on average. The 20-day average at that point was 3.7 million shares. So you can see that in a nutshell, the average volume was somewhere about four million shares call it. Then on the second, the volume literally doubles. It doubles off of the five-day average, and it takes us from four million change up to 8.6 million. Then the day after that, it goes to 36 million shares traded. So again, quick recap over the past three days in this scenario, on the first of May, we go from 2.6 million to 8.6 million to 36 million. That behavior is interesting to me. And the reason why that behavior's interesting to me is because one of the biggest things I'm interested in with GameStop beyond the story, beyond the background is trading it. And the movements it has. And while I think the last time I was doing a live stream about this, somebody was",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "reason why that behavior's interesting to me is because one of the biggest things I'm interested in with GameStop beyond the story, beyond the background is trading it. And the movements it has. And while I think the last time I was doing a live stream about this, somebody was just like, yeah, okay, genius, like you're looking at a historic move. Of course, you can see the volume expanding. But the broader point that I'm trying to highlight for you in the conversation is that this behavior of expanding volume is the signal. It is what I look for to precipitate the move. So anyways, I'm gonna run this data through from 2000 to 2024. And I wanna see find the occurrences. And I'm just doing this through the data analyst and GPTX. They can run the data that I have really easy find the occurrences where either, let's do a day over day volume, where day over day volume expands by at least 100. Also, I'm gonna do find the dates. Because that's what really what we want. Find and list. Also do the same for where Intraday price movement exceeds 100. Oh, let's do 50 there, something a little bit lighter. So that'll start running for us. And while that's getting underway, I'd love to say hello to everybody. So we got Reese Tanner, our friend H Steelio. Oh shit, that's a hard one. You guys have to coach me on this one. RBLD. So I see",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "a little bit lighter. So that'll start running for us. And while that's getting underway, I'd love to say hello to everybody. So we got Reese Tanner, our friend H Steelio. Oh shit, that's a hard one. You guys have to coach me on this one. RBLD. So I see dark side, DRK side. I don't know how to read RBL. Not like Roblox. What the fuck do you get through RBL? I get the dark side. I get the dark side AI. Rebel. Oh, Jonathan, you might be on it. Jonathan, that's soup that that literally might be it. Is that it? Come on, Rebel, dark side AI. Don't leave us hanging. Right now the riddle I'm trying to solve is deciphering your name. See this time you could tell it's a GME live stream. I'm immediately just reading into everything and trying to solve whatever puzzle, random ass puzzle apparently is presented to me, which right now is this dude's name. It's the big puzzle of the moment for me. Rebel dark side. Nice job, Jonathan. Good job. So I was able to do the easy part and identify dark side. So I don't think I get really any credit for that. That's kind of easy. But Jonathan crushed it on the rebel part that's spun on. Good work out of you. All right, cool. So Rebel dark side says I'm not gonna lie. It's so manipulated GME, but why though is it that institutions never got out",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "any credit for that. That's kind of easy. But Jonathan crushed it on the rebel part that's spun on. Good work out of you. All right, cool. So Rebel dark side says I'm not gonna lie. It's so manipulated GME, but why though is it that institutions never got out of their shorts? That's a fantastic question. And the manipulation in GME is, it's another reason why I'm so fascinated in the product to be completely straightforward with you. I trade for, it's how I make a living is through trading. So the main part of what I'm doing with trading is trying to find ways to make money, right? Like just like anybody else. However, with something like GameStop, it really highlights a whole other undertone of what's going on in markets. And I don't want to say I view it as a canary in the coal mine because there's other canaries with it, but it is kind of like that, where this is a purely clean example that again, like you guys know me hopefully well enough by now where I'm not into being super hyperbolic and I'm not into making decisions or assumptions off of really broken partial data. I'll explore it always, but I'm not gonna look at something that essentially 90 looks like it might be the case and then conclude, it is the case unless I can actually prove it with some sort of evidence, qualitative, quantitative, I don't care, but something other than",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "partial data. I'll explore it always, but I'm not gonna look at something that essentially 90 looks like it might be the case and then conclude, it is the case unless I can actually prove it with some sort of evidence, qualitative, quantitative, I don't care, but something other than just conjecture and my opinion in GameStop is fascinating because it is one of those things that I can look at and I can discreetly identify this exact behavior that there is something wrong that happens with the product. Like I can see it and I can quantify it. So I am really blown away with kind of how blatant the bullshit is with GameStop. That's one of the craziest things to me. It's like hiding in plain sight, the fact that there's been movies about it, there's been shit on Netflix about it and it still seems to be, I don't know how severe it's happening now because it's hard for me to quantify. But some shit's going on that I can clearly identify and that part's super frustrating. So going back to the question on why the institutions never got out of their shorts, I don't know how many did or didn't. Let's take a quick look because actually, if I were to guess, I believe a good number probably did, especially with the at the money. That's my guess. And then it looks like we have holy shit. So right now I'm essentially looking at the data",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "many did or didn't. Let's take a quick look because actually, if I were to guess, I believe a good number probably did, especially with the at the money. That's my guess. And then it looks like we have holy shit. So right now I'm essentially looking at the data that I was telling you all about. And it's blowing my mind right now if I'm being honest with you. Okay, quiz question. For volume expanding by at least 100 over the past essentially 24 years looking at GameStop from 2000 to today. How many occurrences do you think volume day over day expanded by at least 100 because it's a little more than I expected. 42, it's a great guess. It's not even close though. I honestly would have been closer to your guess. I was a little higher. I was thinking, I was thinking maybe, yeah, I don't want to give you my answer. Jonathan says between 69 and 420, which are fantastic numbers, but unfortunately we have to play by prices right rules. Also, cheers. I'm starting out with some liquid IV, keeping the old hydration up while I'm working through this bullshit hernated disc. Also, in case you guys didn't know because I have that bullshit going on, I am spending even more time just hanging out at home looking at stuff. It's like, what else am I going to do? Go into the gym and then doing that, which is nuts. 113, 145, 741, 350.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "case you guys didn't know because I have that bullshit going on, I am spending even more time just hanging out at home looking at stuff. It's like, what else am I going to do? Go into the gym and then doing that, which is nuts. 113, 145, 741, 350. Okay. So based on prices right rules, Ben price, you win plus one fake internet point. Euphoria web tried to game the system. When you're playing prices right, you don't get to give a range. It's utter bullshit. It's not how that works. So euphoria web, unfortunately, your submission is immediately discounted because you try to give a range. You can't give a range. It's got to be single number. And Ben price is the winner of plus one fake internet point. That's what you get. So we'll let it all be known for everybody plus one fake internet point. There you go. Right there. Tree Fitty. So the actual number is 392, closest without going over, prices right rules. So the actual number is 392 times from 2000 to 2024 today. And the first time it happened was actually in 2002 on the 5th of March. Hey, day after my birthday, what a great celebration. That's fascinating. Okay, now this number makes way more sense to me. So the next question I'm solving for, because what I'm going to do is I want to go look at the chart on these days and see what we can see. Because",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "my birthday, what a great celebration. That's fascinating. Okay, now this number makes way more sense to me. So the next question I'm solving for, because what I'm going to do is I want to go look at the chart on these days and see what we can see. Because the other thing I asked it to do for me is find me the periods where the intraday movement, so high to low within a single day exceeded 50 from the same time frame. And it did that 21 times, which obviously compared to the volume question that might seem like really insignificant, but price moving by 50 intraday is much harder than volume simply expanding, like significantly so. A lot of other things have to happen in order for that kind of price pattern. So that's a really, really impressive movement. It looks like the highest I see is 330 price increase, which was on 28 Jan 21. That's the largest number I see here. And then there's a couple hundred, it's not many, like maybe three total. So we'll take a look at those individual days because I want to go on demand and I literally want to go back in time and see if we can take a look at the options markets before those again, this is the way that I start gaining more context on what I'm looking at and the way it behaves. Because again, I continue to read this point because I think",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "go back in time and see if we can take a look at the options markets before those again, this is the way that I start gaining more context on what I'm looking at and the way it behaves. Because again, I continue to read this point because I think it's important. There's two parts of my brain that are working right now. There's the part of my brain that is interested in the story market impact broader things. There's another part of my brain that is interested in what I can trade and how can I identify a usable signal that I can rely on. Again, right now it's volume. That's the best predictor I've found so far. And the reason why I bring it up is because when I'm going through all these different theories, I was messaging Newton not too long ago asking just some of the latest research and stuff. And it's like there are tons of really interesting ideas. The problem is I haven't found a good configuration of ideas that is led to an efficacious objectively efficacious signal that I can trade. FTDs have not done that. Volume changes seem to be the closest so far. Swap data has not done it. So it tells me like as per usual, we're dealing with such a busy multivariate system. Like that's really what I see when I look at this. And in the meantime, you have to give me a break. I have to get",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "so far. Swap data has not done it. So it tells me like as per usual, we're dealing with such a busy multivariate system. Like that's really what I see when I look at this. And in the meantime, you have to give me a break. I have to get a couple of these ad-vill twos down so that I can keep my composure. There they go. I don't know how long you can take ad-vill and ib profile and I normally don't take it, but right now your boy needs it. All right, so let's take a look really quick, though, at the short interest. So short interest in GME. And let's see what this says. So this is going to Fintel. Rebel Darkside says also I'm not in AMC, but how they run together. The AMC is bullish on 200 day average all the cross and nothing. I like this stuff. It's cool. Yeah. Well, the interesting part is I know that people have different feelings about meme stocks and what that means and then the insinuations. We actually had a little bit of a conversation about that in the discord, which again is free for anybody to join that's interested. But the pure definition that I've always associated and I looked it up at a curiosity is just like, what is a meme stock? And a lot of people, I think it has like this really terrible connotation, but realistically from what I've always understand is that",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "join that's interested. But the pure definition that I've always associated and I looked it up at a curiosity is just like, what is a meme stock? And a lot of people, I think it has like this really terrible connotation, but realistically from what I've always understand is that it's essentially like this right here. It's a stock that gains popularity through social media. Like that's the way I look at it. And I think that there's a reality behind what we see meme stocks do. Whether you want to classify a game stock as a meme stock or not, that's okay. Again, I don't want to bother anybody with the terminology or whatever. It's like there's words to me. But the main thing is there's a correlation between them because as there's fervor in one thing, typically people expect sympathy movement in other things. And this is not unique to meme stocks. This is common for any sort of correlated products. Now the correlation between something like game stop and AMC we can look at, but it's all over the map. I've looked it up before. It's not that crazy. So anyways, back to game stop, this is really low. Like really, really low. So it shows short interest flow is 9.7 and then off exchange short volume is 27, which is just really, it's just really low. Now one of the things that's really funny about this is that's actually a really long time to cover still.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "really low. Like really, really low. So it shows short interest flow is 9.7 and then off exchange short volume is 27, which is just really, it's just really low. Now one of the things that's really funny about this is that's actually a really long time to cover still. 11 days to cover a short is a long ass time. So this and this don't seem to align in my opinion. That seems quirky. Cause that's an eternity to cover. That yeah, that just, I'm gonna try to check another source really quick. GME short interest. Let's see what market beat says. Alfonso says nobody really mentioned meme stocks until the stimulus check started flood in the bank account of youngsters in 2020. I think it's a big part of it. Yeah, when there was like a giant, giant explosion in retail traders, like I totally agree. I completely agree with you. And that's kind of the ideas that meme stocks are kind of part and parcel to retail and social media. It's not something that's just like institutionally well known or whatever. Let's take a look at this. I haven't looked yet. Yeah, that looks way more logical. So 0.8 days to cover and this is showing 10.8. This is showing 9.77 so it's pretty close. Yeah, this makes way more sense to me. This to me looks like an error. Because 11 days to cover like that is, that is like just an unbelievable eternity if that",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 14,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "So 0.8 days to cover and this is showing 10.8. This is showing 9.77 so it's pretty close. Yeah, this makes way more sense to me. This to me looks like an error. Because 11 days to cover like that is, that is like just an unbelievable eternity if that were the case. And then let's take a look at this, the chart exchange and it shows short interest contracted very meaningfully. Which again, we would expect to see. So as the, as that at the money came through, it looks like there is a pretty meaningful bleed through on this because short interest just absolutely cratered. Now, the other part that I can't help but find interesting is how low this says short interest wasn't here. Because I'm not so sure, but this might be at a period of time where short interest might have been kind of wound into other products already. So it might be that's why, that might be why that's a little bit skewed in my opinion. Because I don't know that short interest was actually at like 0 that this would suggest. That seems, it seems weird. Before you says how does short interest go down and the price also goes down a bunch of different ways, but in this case, I'm assuming I don't remember the exact date when the at the money started. When did it start? GMATM offering start date. Begin May 17th. So it's literally right in here. Yeah, so",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 15,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "go down and the price also goes down a bunch of different ways, but in this case, I'm assuming I don't remember the exact date when the at the money started. When did it start? GMATM offering start date. Begin May 17th. So it's literally right in here. Yeah, so that's, that would be my guess. It is that it came from the share offering. Because it started May 17th and I think it only went for a few days. It didn't take that, or no, it went longer than that. Sorry, this says it concluded on the 11th. That was a little longer than I thought, but okay. I obviously, I'm sure that's right. I don't think I remember fully well. Before you says, was that enough for them to bring it down that much? I think so. I mean, they offered a ton of shares, man. They offered up to 45 million shares. So yeah, I mean, it's definitely, that's a massive offering at that point. Nick says, do you think GME's dilution was bad without giving any forward guidance? I don't think so. I don't think so at all. I think the problem is that it seems like GME shareholders have like a certain expectation of what kind of guidance they'll get. And what time frame and what information will be included. But I don't actually believe that the share offering was bad for the company. I mean, they raised what? Like over 2 billion, something like",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 16,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "like GME shareholders have like a certain expectation of what kind of guidance they'll get. And what time frame and what information will be included. But I don't actually believe that the share offering was bad for the company. I mean, they raised what? Like over 2 billion, something like that, right? Again, you guys probably know those metrics a little bit better than me off the top of your head. But yeah, I literally think they raised like over 2 billion. I'm sorry, 2 billion in gross proceeds from it. So I think like there are two different things in your question, their Nick kind of two different components, right? There's the was it bad and then was it bad in the context of guidance? Because there are two different things. I think the way that GME is offering guidance has been weird. But I also think that it's not surprising the way that it's offering guidance. Now, I think that at the money net net put the company in a much better position to operate as a company. Like, and that's just objectively the case. Because my other assumption is one of the primary reasons I think that offering went through the time it did is not just because the stock was super high. That is part of it. But I think the other reason why the offering went through at that point is because my guess is they knew interest rates weren't, so there weren't going to",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 17,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "offering went through the time it did is not just because the stock was super high. That is part of it. But I think the other reason why the offering went through at that point is because my guess is they knew interest rates weren't, so there weren't going to stay at astronomical levels into perpetuity. So if you complete that at the money offering, you raise a fat stack of cash before interest rates start to crater, which they're going to look, we have until September, right? They're going to start coming down, whether it's 25 basis points or 50, we don't know. But that's what it's looking like starting in September. So this at least gave them a few months to be able to take advantage of really short-term high interest rates and even lock in longer-term interest rates that still remain at least partially elevated. So I think there's a bit of a strategic choice there in two fashions. The first one, doing it when it's high makes sense. Make a lot of money. The other thing is with that money, you're capturing it at a time frame that you can do something pretty meaningful with it. So yeah, I think the offering itself, I can see from a business perspective why they made the choice. Now in terms of the guidance component, that's a little bit different. And the reason being is because I don't really know what kind of guidance people are wanting to hear.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 18,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "So yeah, I think the offering itself, I can see from a business perspective why they made the choice. Now in terms of the guidance component, that's a little bit different. And the reason being is because I don't really know what kind of guidance people are wanting to hear. I didn't listen all the way through the previous call, but in the previous call, I was capturing a lot of, I don't want to call it under or overtones, but broad themes is what I would qualify it as. I felt like during the last shareholders meeting, like GME leadership offered broad themes. So let me see. GME, Shareholder meeting, 2024. This was just the voting stuff. No, no, no. No, that's not what I want. Four razor says he was the CEO of Chui with the fuck. Oh, sorry, I'm getting caught up on the tax, my bad guys are on the chat. Let me see where you guys are. Okay, so Nick says, I thought it was good to raise cash on hand to your four billion, but I'd really like to see some sort of guidance through what the plan is moving forward. Four billion is great, but what is next? Yeah, I think that that's a completely, I think that's a completely, completely fair. Yeah, I think it's a fair ask. And the other thing is I also don't see them just raising money for the sake of raising money. So I would also imagine",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 19,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "great, but what is next? Yeah, I think that that's a completely, I think that's a completely, completely fair. Yeah, I think it's a fair ask. And the other thing is I also don't see them just raising money for the sake of raising money. So I would also imagine that there's some sort of game plan baked into the decision cycle. And I don't, and I don't think anybody else really knows what it is right now. But I do think that there's, to me, probably something going on now as obscure as that is, I know it's quite obscure, but you don't raise billions in cash with just the aspiration of having billions in cash. It doesn't necessarily do the company a ton of favors. It doesn't hurt them having the money, but you want the money working for the business and driving revenue. So I agree with you from that perspective. But yeah, here we go, this one I was looking for. Chris says, see rates go down, markets go down. It's not, I don't think it's as simple as that. If you're talking about when the Fed cuts rates that the market's going to trail down, I've been seeing that getting thrown around a lot. I actually don't know why. Market goes down, they start to get out. Yeah, I still, I don't, I don't know where we're drawing that conclusion from that rates go down, market goes down. To your point, Rapture says Fed cuts",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 20,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "I've been seeing that getting thrown around a lot. I actually don't know why. Market goes down, they start to get out. Yeah, I still, I don't, I don't know where we're drawing that conclusion from that rates go down, market goes down. To your point, Rapture says Fed cuts rates during a recession, but cutting rates doesn't mean we're in a recession. Potentially, you're not yet to your point. We're not always in a recession when the Fed cuts rates. But yeah, I think going back to the idea of rates go down, market goes down. It's a mixed bag. It's not actually as linear as that. I've done a study on it. I actually wrote all about it in the newsletter that's coming out tomorrow. And I analyzed all of the rate cuts from 2000 to present. And the number of rate cuts, the severity of the rate cuts. And I think there's like multiple instances where rates were cut and the market ran up in three months, six months, nine months, and 12 months following time frames from the period of the cut. So I don't actually fully think that that's a fleshed out thought. And then one second, I just got to open the door for the pup real fast. A match and said, how do you hurt your back? Well, fortunately enough, my back actually doesn't hurt literally at all. But my sciatica is fucked right now from a herniated disk, and I just got",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 21,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "one second, I just got to open the door for the pup real fast. A match and said, how do you hurt your back? Well, fortunately enough, my back actually doesn't hurt literally at all. But my sciatica is fucked right now from a herniated disk, and I just got it when I was training. And my guess is it's something that has been building over the years. Like I've been super physically active my whole life. So I've been really fortunate in terms of injuries so far. So I think I just got blessed with this one at this point in time. But my guess is it's something that's been coming up for a while. Nick says hope you didn't get put in a twister. There's a zero percent chance you would catch me in a twister. Same thing with like a buggy choke. There's a zero percent chance. There's like a couple sort of submissions that there's just no world that I would tap to. Like a buggy choke, you would have to put me to sleep. And then when I wake up, you would have to prevent me from unalliving myself potentially. Because just a buggy choke is like the ultimate disrespect. And it's actually becoming kind of a dangerous submission. So yeah, that makes rolling is a bigger dude a little bit tricky, especially I like side control. Nick says gear, no, I do not wear the kimono. I've worn a key. I think three times",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 22,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "is like the ultimate disrespect. And it's actually becoming kind of a dangerous submission. So yeah, that makes rolling is a bigger dude a little bit tricky, especially I like side control. Nick says gear, no, I do not wear the kimono. I've worn a key. I think three times of my entire life. I've been playing like jujitsu since college and I've been a mixed martial artist hobby. I say that in like very, very light terms. It's I'm a hobbyist. I'm not even any sort of, yeah, like pure dedicated dude. I just like training. So anything I've done in jujitsu is always in the context of like actual martial arts, not just jujitsu. So I think jujitsu can build a ton of bad habits, bro. Like pulling guard in jujitsu can be a dangerous weapon. Anywhere else is going to get you soccer kicked in the freaking head. Like it's a terrible move everywhere else. Have literally everywhere else. It's a terrible choice. Only in jujitsu and I don't like that about stuff like that in like pure jujitsu practitioners. I always have respect for it. Yeah, I think that that's stuff silly. I also think bottom position being too well respected. Again, there's some really deadly dudes from bottom. They'd rather play bottom and that's okay. I get it. But in any sort of combative scenario, that is how you get smashed. So bottom is terrible and not being willing to wrestle up and move around",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 23,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "position being too well respected. Again, there's some really deadly dudes from bottom. They'd rather play bottom and that's okay. I get it. But in any sort of combative scenario, that is how you get smashed. So bottom is terrible and not being willing to wrestle up and move around as terrible. So yeah, bit of a rant and rave about jujitsu because I guess it's because I like to sport so much and I want to see it grow. And I think that's one of the difficulties it's going to face. Let's see. Muner says historically every time the Fed cuts, the market enters a bearish state. It's not rocket science. Look at a chart and compare it. It's just not true though. And again, like in the newsletter that that's coming out tomorrow talks about it, but it objectively is not true. So in 2019, the Fed cut three times, it took rates from two and a half to 1.76. The duration of the cuts was over six months after the initial cut. Markets for the three months following that cut were up 7.6 then up 12 in the next six then up 15.8 over the nine and then up 21 over the 12. So again, I understand the sentiment because if we look at 2001, if we look at 2007, 2008, there are absolutely instances where cuts led to downside market performance in conjunction with other things. I just think it's so important again to do our",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 24,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "then up 21 over the 12. So again, I understand the sentiment because if we look at 2001, if we look at 2007, 2008, there are absolutely instances where cuts led to downside market performance in conjunction with other things. I just think it's so important again to do our best and remain objective. And like that's one objective scenario. There's another one in essentially right around the COVID market in 2020. Market collapses due to COVID. The market then the Fed starts cutting rates. There is two cuts over a month taking us from 1.75 down to 0.25, essentially zero. And that led to a massive rally in the market despite a pandemic. The unit says and when it went to zero, no, that's not, that's just not right, man. The time that cuts started during 2020 is after COVID started plummeting the market. It was in response to COVID. So it was not cut rates market crashed and then market went up, right? That's not, that's not what happened in 2020. So yeah, that the whole point of the rate cuts in 2020 were in response to COVID, which pushed the market down as it should have because everybody was ready for it to be absolutely terrible. And if it didn't go through, right? Like if the Fed didn't intervene and what the Fed policy didn't go through, that could have been catastrophic to the market. So yeah. Chris says you think the market where it's at, the",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 25,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "everybody was ready for it to be absolutely terrible. And if it didn't go through, right? Like if the Fed didn't intervene and what the Fed policy didn't go through, that could have been catastrophic to the market. So yeah. Chris says you think the market where it's at, the market will go up. It's a great question. And the punchline to it is, I have no idea. I really don't know. And my job as a trader is not necessarily to know. My job as a trader is to follow the market with what it's doing. And that's generally how I view it. Like I don't even care to know because whatever the market is going to do is what I care about. So if I look at the one, you know, September, when we start this rate cutting campaign, I don't think that's going to crash the market, especially September. Like there would, I would believe that we would need to see some sort of change in other contacts about the market, whether we get more economic data that shows that things are super weak, kind of like the unemployment revision. And we see like a stream of that stuff start coming in. Then I do think that that can absolutely have an impact. But Muner says I'm willing to make a bet when they start to cut the market will crash. Sure. Well, what are you thinking? Muner, what time frame? So they're going to start cutting",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 26,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that stuff start coming in. Then I do think that that can absolutely have an impact. But Muner says I'm willing to make a bet when they start to cut the market will crash. Sure. Well, what are you thinking? Muner, what time frame? So they're going to start cutting in September. So when's the, when's the crash after September in your opinion? Because depending on your answer to that, it'll give me some idea in terms of what you think about the immediacy of it. Because the other component that again, we have to remember is that if for example, Mashin says crash happening, I was so funny. Mashin, you read my mind. Muner says 2025 will be a bear market as a whole. I mean, whatever you say, dog, it's those kinds of statements I find so silly because like you don't know literally nobody can know, but we really, really want to predict because then we sound cool if it happens. And it's just so silly, right? Like to me, why would I try to predict what's going to happen through all of 2025? Why would I try to predict that? Like, is a traitor? It does nothing for me because if I position wrong and the market does something else, I don't make money. So like, I'm not even interested in attempting to predict, but I mean, we'll definitely snapshot that. Actually, let me grab it really quick so that we have it. And then we'll",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 27,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "nothing for me because if I position wrong and the market does something else, I don't make money. So like, I'm not even interested in attempting to predict, but I mean, we'll definitely snapshot that. Actually, let me grab it really quick so that we have it. And then we'll see. We'll have to, we'll have to set an alert to check out the end of 2025 and see if it's a bear market and at which point we will find out if you're a correct or not. So yeah, DVD, I suppose. Chris says market is great stock market will suck. Why do so many people have cash? Unfamiliar with what you're referring to. Yeah, unfamiliar. So anyways, back to Q1 2024. So we can see sales contracted, which we don't love. We can see, I mean, this typically is not a super favorable reporting period. I don't think for them, but I mean, they're moving in the right direction, right? So net loss went from 50, 32, a little bit better. So loss per share came down, which is good. Net loss contracted. So like these, these components are good to see. And then my guess is that if the company can continue like this broader pivot, and that's the part I haven't quite put my finger on yet, to try to identify like, where's the money going to go? Where do we put the billions of dollars in cash that we have at this time? So I",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 28,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "if the company can continue like this broader pivot, and that's the part I haven't quite put my finger on yet, to try to identify like, where's the money going to go? Where do we put the billions of dollars in cash that we have at this time? So I don't know. And to your to the chat's broader point about some sort of hypothesis around. You know, what we think they could spend the money on, we don't know. And again, like the chat kind of pointed that out that you guys as a community, haven't seen guidance from them, which I don't blame you for not being frustrated about that, especially because we don't necessarily like dilution, but there was dilution to a degree. So then we want to at least know that the dilution was done for a good reason and that it will lead to profitability. And right now that's kind of predicated on a trust fall. How much do we trust RC and what he's likely to do with the money? So Steve says, having that much money in hand is insane. I think they are just waiting for an opportunity. I can see your point, but I don't think that's accurate in my opinion. The only reason why I don't think that's accurate is because like I don't think the leadership would essentially say, hey, share price is really high right now. Let's do an at the money and then let's just build up",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 29,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "point, but I don't think that's accurate in my opinion. The only reason why I don't think that's accurate is because like I don't think the leadership would essentially say, hey, share price is really high right now. Let's do an at the money and then let's just build up a pile of cash and then see what happens. Right? Like that's actually pretty irresponsible if that's the decision process that they made. My guess is that they might have said, hey, stock price is high. Let's do an at the money. We have a couple ideas that are on the table. Let's see if we can push these through. That would be the higher probability scenario. I would guess and hope. I guess I should say it's pure speculation. I don't know, but that's what I would hope because that at least means that they're not diluting and then essentially diluting and then seeing what happens. That's just that's not good leadership. That's not good planning. So my guess is they have some ideas on what they would want to do with the money. I just haven't seen them really indicate to what. And I actually think that's very likely to be a significant part of the earnings we have coming up on force set. And I think that it'll be unfortunate because if I'm not mistaken, I don't think the GME typically does like an earnings call, right? I think they typically do just like a release. If",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 30,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "likely to be a significant part of the earnings we have coming up on force set. And I think that it'll be unfortunate because if I'm not mistaken, I don't think the GME typically does like an earnings call, right? I think they typically do just like a release. If I don't know if that's that's what I think. I'm not sure you guys will have to correct me. But my guess is like they're going to have to come up with something here. Like they're going to during I do think during the force set meeting after running. They have the money like they have a couple questions that they're going to have to talk about. So I'm hopeful that they'll address a little bit more. Robo says Larry Chang has posted a lot on next about Berkshire halfway model specifically around having patients and being ready for the best opportunity possible. Yeah, I agree with that. And again, the only the only comment I was making before about the at the money and raising cash is my guess is they have ideas about what they want to do. I don't think it they made a decision to raise a bunch of cash and then just kind of like sit there and hope an idea hits them in the face. My guess is they have ideas on where they want to pivot and take the company to. And they know that they're going to need cash to do it.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 31,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "a bunch of cash and then just kind of like sit there and hope an idea hits them in the face. My guess is they have ideas on where they want to pivot and take the company to. And they know that they're going to need cash to do it. And then I fully agree with who was a Robo. I fully agree with Robo that it's super likely at this point that they're just waiting until the correct thing shows up. The only thing I'm trying to differentiate with that statement is I would guess that they have an idea of what they want to do. Now why they haven't communicated much of it that part I genuinely don't know. I really don't. And it doesn't fully make sense to me unless that they're trying to maintain a certain level of anonymity with their movements. And I don't know who their primary competitors are that they might be trying to hide and obscure some of their decisions. But my guess is again, I think during this force set meeting that there's probably a really, really good chance that will at least get something because that's going to be a massive question for shareholders, right? Many people that have been holding this thing for years, sooner or later you have to ask the question, what's the fucking plan? And he's made some of the plan very clear, right? So one of the things he made very clear in his last",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 32,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "massive question for shareholders, right? Many people that have been holding this thing for years, sooner or later you have to ask the question, what's the fucking plan? And he's made some of the plan very clear, right? So one of the things he made very clear in his last conversation was the idea of getting rid of not profitable stores, leaning into profitable stores, stuff like that, right? Like basic stuff. But that's part of the plan. And I think a lot of people say like, okay, yeah, that part of the, that makes sense. I think that's a decent plan. But now the bigger question that they're going to have to discuss, I think is, hey, we didn't add the money. And there's a ton of cash that we're sitting on right now. What are we doing with this cash? Everybody has that question. So it would be utterly surprising to me if they choose not to answer that question to some degree. If they choose not to answer the question, my follow on assumption would be that they have something they're working on that they don't want to disrupt. That's the only reason I could see why they would do that. Because they do run the risk of starting to lose investor confidence. And as feverish and supportive as the apes are of the stock, sooner or later people have to pay their bills. And they need to know that the money's going into something again that's",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 33,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "they would do that. Because they do run the risk of starting to lose investor confidence. And as feverish and supportive as the apes are of the stock, sooner or later people have to pay their bills. And they need to know that the money's going into something again that's going to drive revenue. Raptor says, what do you think of GME buying out pen? Who knows? Yeah, who knows? I don't know how well pen's been doing though. Oh, they're doing okay. Okay, never mind. They're not doing okay. So fun fact, pen is indeed not doing okay. Contrary to what I previously thought. Wow, interesting. So pens gone 72 cents, EPS 13 305 45 negative 4 8 negative 2 3 7 negative 7 6 negative 18. So that's not necessarily the ideal trajectory you would want to see. But yeah, who knows? Dude, like, if I think that this is the path that they might, I really don't know. I think that's one of the, what's one of the tricky parts here is like literally nobody knows. Now what I do know is that when you're sitting on a few billion in cash, you do have some choices in front of you. So that is one benefit is that they're not, they're not backed into a corner right now. So that part I, I suppose at least is good. But beyond that part, it's so obscure right now. All right, let's hop into on demand really fast. I",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 34,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "in front of you. So that is one benefit is that they're not, they're not backed into a corner right now. So that part I, I suppose at least is good. But beyond that part, it's so obscure right now. All right, let's hop into on demand really fast. I want to see if I can go back to some of these like really early days. And then I want to go like how far can I go back here? Okay, so I can't get back to the earliest stuff that I can get into the 2010. All right, here we go. So 2010. So this was one of my fears. We might have to go one day past. So one of the issues with on demand is that it'll do this kind of really quirky little stuff. And also this is the wrong stock. We're going to look at GME. Okay. So all I'm trying to see here is what is the expansion of volume look like leading into the total expansion and volume that we see. So in this case on the seventh, there was obviously a huge blow up in volume. Generation capital says three months of interest on four bill great earnings. It's for it's not bad, but it's that's still too short term in my opinion. Again, the company can't get by with like trying to scrape what interests they can earn off of their money. But it's probably like the investor slash trader part",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 35,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "interest on four bill great earnings. It's for it's not bad, but it's that's still too short term in my opinion. Again, the company can't get by with like trying to scrape what interests they can earn off of their money. But it's probably like the investor slash trader part of your brain trying to make sense of it, which is a fair connection. But for a business when they raise cash, typically the idea is to grow the business. It's not necessarily to invest the money into bonds, whatever other yielding products that they have up front. Because that still won't make them as much as a good business decision. Like if they can get the capital into something that works really well, they'll make way more money with it. I got to take this look. I shouldn't think. So yeah, let me go one day past this. I just want to see if it normalizes a little bit. So what was this the seventh? Okay, so this data is not going to be great. That's a little unfortunate. We can go a little earlier. So let's go to 2021. And then we want January 13th. So this is where GME had a 92 move. So one of the things I notice. I'll zoom this in a little bit more. One of the things I notice about this move is again, look at the volume before the move. The volume exceeds both 20 day average, 5 day average, and",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 36,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "where GME had a 92 move. So one of the things I notice. I'll zoom this in a little bit more. One of the things I notice about this move is again, look at the volume before the move. The volume exceeds both 20 day average, 5 day average, and then the 5 day average starts taking an aggressive slope up. Even the day directly before, it still has a disproportionate by volume. Nick says, what could make GME 100 billion company? That's what I want to see happening. I mean, really if they just develop a really solid business model, man, because the community supports them extremely well, but as much as the community supports them, they still need to drive value and they need to grow their community. They need to grow their audience. So I think a big part of their ability to scale the company meaningfully is going to come down to their ability to execute against that. That's at least what I think in the general near term in terms of their positioning. It would not surprise me at all to see them acquire a company. Like that would not surprise me at all. And the reason why it would not surprise me is because it's a way to drastically accelerate what they're doing and to start expanding their business lines. The brick and mortar stores, they're good, right? Like some of them do well, but I don't think that's going to be a reliable",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 37,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "the reason why it would not surprise me is because it's a way to drastically accelerate what they're doing and to start expanding their business lines. The brick and mortar stores, they're good, right? Like some of them do well, but I don't think that's going to be a reliable way to like really grow the company. I think the company is going to need more than just the brick and mortar stores. And a lot of that in my opinion comes down. There's just a limited reach, especially when we've become such an online based economy. I have an inversion table to help with the bullshit on my back. I literally bought it yesterday and overnighted it via Amazon to my house today. And then I built it. I had it in less than 24 hours from when I bought it. So what I'm highlighting by that is Amazon is a great example of the power of expanding your scope because Amazon can sell to anybody anywhere and get them their shit pretty damn fast. So I think a big part of GameStop is going to be diversifying its business line because it still has its online business presence as well. And that's good. But I think that they have such a potential audience through the gaming community. I mean, let's take a look. I don't know the numbers, but let's do a quick look. How many gamers are there in the US? Because of June 2024, there are",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 38,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "as well. And that's good. But I think that they have such a potential audience through the gaming community. I mean, let's take a look. I don't know the numbers, but let's do a quick look. How many gamers are there in the US? Because of June 2024, there are around 212 million gamers, which is about 61 of the population. Like you want to talk about density? That's insane. So they have a massive, massive audience potential there. They have a massive audience potential there. And I think it would make a ton of sense for them to tap into them. Like without a doubt, I think it would make so much sense. Now, I don't fully understand the way that they're thinking about the future and the vision of the company because that part is still generally obscure to me. And that's really just what's going to boil down to what they're going to choose to buy into. Because they have the opportunity now with the amount of cash that they have to really spread into a lot of different things if they choose, which is really cool. Well, I just don't know what direction they want to take things. Again, the cool part there is they have the choice. They have the choice to take the company in a bunch of different directions if they choose. Alfonso says Cohen modeled Chouy on Amazon. Gaming doesn't need to be central, just like Amazon's starting with books. Yeah. I",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 39,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "take things. Again, the cool part there is they have the choice. They have the choice to take the company in a bunch of different directions if they choose. Alfonso says Cohen modeled Chouy on Amazon. Gaming doesn't need to be central, just like Amazon's starting with books. Yeah. I think the point I think with gaming, though, is that it already offers such a smooth on ramp because if there's such a critical population density that likes gaming and a lot of the company is already supported by gamers. If you give that audience a larger grouping of things that they might like, it really makes everything from marketing cheaper, from developing products or whatever services you want to offer more efficient. You gain so many efficiencies by doing that because the Berkshire model is very different. Berkshire is just a holding company and then it buys businesses that continue to operate as that business, whatever that business is. Now, if that's the direction that, you know, if that's the direction that GameStop wants to go, I don't see why they couldn't do it, but that would be kind of a little bit of a vice versa approach to that where they're starting as a very specific niche business and then turning into some sort of holding company and then acquiring other businesses. Because the other reality is four billion in cash ish is a lot, but that's not like there's literally individual people, it's crazy as that sounds",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 40,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that where they're starting as a very specific niche business and then turning into some sort of holding company and then acquiring other businesses. Because the other reality is four billion in cash ish is a lot, but that's not like there's literally individual people, it's crazy as that sounds with more money than that, right? That's not like Berkshire cash. It's not like Apple Cash. So all I'm highlighting is that they have a really good runway, but they also do not have this unlimited pile of money to go into and start throwing it wherever they want. Like, I think they still are going to have to be pretty thoughtful about the movements and the pivots that they choose to make. So and I think it'll be again, my guess it'll be generally discussed at least I hope. It will be generally discussed in the force set because I still think that they need to address what they've done with the at the money. Again, not that it's bad. I think it's okay. Provided that there's a game plan for the money. So and I just don't think any of us have really heard much of that game plan yet, unfortunately. Alfonso says I'm not a gamer, but aren't in game purchases a big part of the profit pie. Game stop won't capture any of that selling games and hardware. Yeah, I think that's one of the potential downsides to the way that the gaming industry is moving",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 41,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "plan yet, unfortunately. Alfonso says I'm not a gamer, but aren't in game purchases a big part of the profit pie. Game stop won't capture any of that selling games and hardware. Yeah, I think that's one of the potential downsides to the way that the gaming industry is moving because I mean, like I like to play video games periodically. And I can't tell you the last time that I bought a physical disc to put in the console. And it also is not going to surprise me at all when we eventually see the entire console not have an input for a disc. Like I actually don't even see why it will longer term. So yeah, I think there's probably a lot of changes coming down the pike for the way that they do business. And I think that's exactly why everybody's so interested in how they're going to do business. Because I think that there's a lot of different ways that they can pivot still, but they have to make some decisions in terms of the way that they want to run it. Which again, I don't have a great feel for. I want to input my credit card number so that I can order barbecue tonight. That's the move. Nope wrong zip code. Damn it. There we go. That should be good. Willie says no doubt there's reasons code act went out of business tech evolves and they didn't pivot in time. Yeah. The funny thing",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 42,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "credit card number so that I can order barbecue tonight. That's the move. Nope wrong zip code. Damn it. There we go. That should be good. Willie says no doubt there's reasons code act went out of business tech evolves and they didn't pivot in time. Yeah. The funny thing to that actually is I went to school in Rochester, New York where code act is essentially based out of and I didn't know this, but a fun fact is they have a nuclear reactor. They had a nuclear reactor in the base of the building, which is super cool. But yeah, you're right. They just didn't pivot when they should have. Willie says Mexican food part two. I think we're doing barbecue. So tonight will be a tritep and pulled pork for me. And then I think Mel will probably get some sort of chicken like a chicken something or other. Chris says I'm buying puts for earnings. They won't have a call so we won't have info on what their plans are with the cash. They can still issue a statement. A lot of times again, in place of an earnings call, you can release a statement or they can tell you that they're going to do a shareholders meeting that's going to talk a little bit more about whatever, you know, their broader plan is. So I wouldn't get too disenfranchised if it's not a call. The part I wouldn't like just is if there's no information",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 43,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "they can tell you that they're going to do a shareholders meeting that's going to talk a little bit more about whatever, you know, their broader plan is. So I wouldn't get too disenfranchised if it's not a call. The part I wouldn't like just is if there's no information that part would be. I wouldn't like that one. Okay, so this is the first time for the first move that I see that expanded by at least 50. Now I'm going to go to the 22nd. And I want to see how volume moved ahead of this one. I'd rather be skiing says barbecue is never a bad choice. Yeah, it's always like pretty solid. I mean, this is just another prime example of volume being a massive indicator because again, like the big move started here with this giant gap up, but the big volume started like several days before. Let me go to another period. I'm going to get out of January. Let's go to March 10th. That was another period. It looks like it started to run. And there it ran intraday like 100. Yeah, so similar story. Here the volume was a little bit weaker admittedly, but still right before the move. In this case, two days before the move, there's a big massive spike in volume. Let's go to another period. The next one really of the decade would be in May of this year. Let's go to May and then let's go to",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 44,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "admittedly, but still right before the move. In this case, two days before the move, there's a big massive spike in volume. Let's go to another period. The next one really of the decade would be in May of this year. Let's go to May and then let's go to the 13th, which is when it had a 54 move intraday. And this is the other example that we were talking about before. So I mean, this generally confirms more or less what I already knew that the one thing I can objectively point at with confidence and identify is before all of these larger moves, we see an expansion and volume. Now the tricky part is running a bit of a regression to see how many times the volume starts to move, but price doesn't. Because whenever we come up with a hypothesis and idea on how we think something might work, it's really important for us to consider the alternate component to that idea. So in this case, the idea is, and I can tell it's essentially efficacious to a degree, where before the big move starts to happen, we see a pretty massive expansion and volume and a higher percentage of by volume over the expanded volume days. Now like this period would have triggered, but then it would have just been noise because nothing happened. And here volume went from four to 10, so it doubled. It would have met that threshold, at least that pre-limbed",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 45,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "a higher percentage of by volume over the expanded volume days. Now like this period would have triggered, but then it would have just been noise because nothing happened. And here volume went from four to 10, so it doubled. It would have met that threshold, at least that pre-limbed threshold, and it would have sustained too. Like this would have looked actually really, really good. So I think the other part that I look at when I trade stuff like this is the way that we use stops to follow the move without getting too overextended. Because I mean, it's one thing to make your money on the move that's unrealized, but then sooner or later you have to realize the money. Otherwise the money just goes back down as the stock goes back down. And then you have nothing. You just still hold the stock, which is cool. If that's your goal, it's just a whole to stock. That's totally fine. But from a trading perspective, you would have made zero dollars in that sense. So I think part of it is coming up with a slightly more robust plan that allows me to follow the move up, capture as much of it as possible, and then as I'm getting stopped out on the way down, not being stopped. Not being stopped out prematurely because these things can really start to take shape and run. So like I have a whole host of things that I'm looking at",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 46,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "capture as much of it as possible, and then as I'm getting stopped out on the way down, not being stopped. Not being stopped out prematurely because these things can really start to take shape and run. So like I have a whole host of things that I'm looking at in GameStop specifically this weekend to help me understand a little bit more about the price behaviors that it specifically exhibits. But the one thing I can say that again, just doesn't surprise me at all is that essentially for all of these large, these large intraday moves, they're connected by large volume. But there are a lot of periods I can see of large volume that did not lead to a 50 move. So I guess the other thing I could do here is maybe update the intraday move table to track minimum 15 intraday moves. So what I want to see now is a little bit more detail behind the side because I'm limiting by 50 moves intraday, which is pretty massive. I have to drop the file back in. But even a 15 intraday move is pretty meaningful. One says look for large volume and FTDs on the days where large volume didn't equal large move. I think we did some of that. And you want FTDs on GameStop, which is here. And then Don, for you, what threshold do you want to look at for FTDs? Don says also large volume. Yeah, I see what you're",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 47,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "the days where large volume didn't equal large move. I think we did some of that. And you want FTDs on GameStop, which is here. And then Don, for you, what threshold do you want to look at for FTDs? Don says also large volume. Yeah, I see what you're doing. Yeah, so we've done a lot of this where we're not just looking at, and again, that what makes the problem start to become so confounding when we have like 32 different variables that we're trying to track simultaneously, right, which is really, really difficult. So anyways, to that end, we can find instances. Let's take a look. That led to a decent move. So like this expansion and FTDs from 16803 to 19213 didn't lead to any meaningful change in price from a high in here. This expansion and FTDs from 35,645 to 520,000 didn't lead to an expansion in price in FTDs. So this is another example. We went from 204 to 350 FTDs, no movement in price. So what I'm doing right now, and I want to be very clear about it, I'm not suggesting that there's no correlation between FTD and price movement. That's not what I'm suggesting at all. What I'm suggesting in doing this is that the relationship is a little more confounding and there's more variables that are part of this than just the FTDs. Chris says 34 days, we've done this a bunch of times. We've done this with newt in",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 48,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "what I'm suggesting at all. What I'm suggesting in doing this is that the relationship is a little more confounding and there's more variables that are part of this than just the FTDs. Chris says 34 days, we've done this a bunch of times. We've done this with newt in a bunch of times, but sure, let me change this to count. We'll go count from what day are we starting to count from? That's the first thing we always have to align on. Are we doing it the day before the FTD expanded or are we doing it on the day that the FTD expanded or the day after the FTD contracts? How many days after the initial bump until the big spike? Okay. So the initial bump. So you're talking this would be the first day we're counting then, right? So the initial bump would be in this case from like 204 to 350. I just want to make sure I'm looking at it exactly as you want me to. Well, in the meantime, I'll start. Oh, that's too many. It didn't realize that it slid me that far. God, oh, that's the worst. I was literally at 32. And then I just went a little too far, just a little too far. Right here we go. 34. This one, no, that's 34. So this is, so this right here, it's going to count at its 209, but just proof of concept right here is where I'm holding",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 49,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "32. And then I just went a little too far, just a little too far. Right here we go. 34. This one, no, that's 34. So this is, so this right here, it's going to count at its 209, but just proof of concept right here is where I'm holding the mouse on the bottom. It's telling me count is 34. So I'm highlighting the whole row. The high on this day was 1327. The start of this was 20. And this is where we're looking at the move from 204 GME FTDs to 350 3000 GME FTDs. So that's 34 here. And here's a big change. Maybe we'll look at this one. This one goes from 624. Let's do this one for 34. Here's 34 right here. So on this one, we go from 27 to 21. With 34 counted between these. So again, the part I'm trying to make clear is there's more to this because here's the problem that I think that sometimes we oversimplify in kind of an hour perspective on the trading side is when the FTDs happen, there's a lot of different ways that they can manage them without going to the open market, I think. And I also think that we're dealing with such a multivariate system that trying to again, like we'll count from this one. This is starting from 1. And then let's go to 34, 32, 33, 38, 34. A key. So this one we went from 2132 to 2165",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 50,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "I think. And I also think that we're dealing with such a multivariate system that trying to again, like we'll count from this one. This is starting from 1. And then let's go to 34, 32, 33, 38, 34. A key. So this one we went from 2132 to 2165 over the 34 day period. And that one. And that was going from 305 to 596. Ricky says hype dates have let me down every single time. Yeah, that's probably fair. Well, the other thing is like a lot of people have really big expectations for like the expected move because I know a lot of people they're like really disenfranchised with the way that game stop is moving right now. But like this still is moving from a low of 1873 even to now to 22. But again, I know that that's not ballering, that's not this, but that's still not a terrible move in something that the entire broader component index that this thing would be a part of is going down. Like, that's not terrible. So I think part of it is people also are like so fixated on the squeeze and getting this big giant price movement, which I understand. Like I also don't think it's worth like foregoing acknowledging that there's still price movement going on. It's just not as powerful as it might be. But exactly. So Ricky says screw that the apes demand the moon, which I totally understand. I feel you brother.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 51,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "movement, which I understand. Like I also don't think it's worth like foregoing acknowledging that there's still price movement going on. It's just not as powerful as it might be. But exactly. So Ricky says screw that the apes demand the moon, which I totally understand. I feel you brother. But yeah, anyways, I still see something that's one from 18 to 22, which is not a terrible move. It's four points on something that's 18. So anyways, yeah, what we found is for like these FTDs even from like some of these really big moves. Let's check this one because this one went from let's check the first expansion like this one. This might be something cool. So this one from 906. So let's go up 34 days. Here. 32. So this went from 35. Moving from 35,000 to 900,000 FTDs. This went from 3565 to 32. So there's a little bit more again than just the FTDs and then that that's the really, really difficult part. Anytime I talk to Newton about this, it took me a while to even wrap my brain around the different counting functions, whether we use 30, 32, 34, 35. One of the things I was doing is I download this myself so that I can kind of manipulate it in my way without messing up, you know, Newton's work. And I've run a bunch of different regressions, unessentially all of these different FTD metrics and then combinations of them. And there's just",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 52,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "things I was doing is I download this myself so that I can kind of manipulate it in my way without messing up, you know, Newton's work. And I've run a bunch of different regressions, unessentially all of these different FTD metrics and then combinations of them. And there's just it's mixed. It's very, very mixed. That's the really hard part here. The one thing I can tell you that has been highly efficacious is finding periods where volume in the underlying itself expands. But again, that's probably like a boring answer to a lot of people not necessarily what you might want to hear. So this is 34 and this took us from 27 to 31. So a lower move, essentially, than we've seen in the last couple of weeks without anything. So yeah, Chris, does that? I just wanted to give the idea that we're looking at here like a solid exploration. Because again, like I'm learning, I don't know either. I'm trying to figure it out the same as you guys. I do not pretend that I know or have some sort of strong, predictive quality again beyond volume. I can confidently point at volume and say this is going to be a part of it whenever things start moving. And that's not unique to GameStop. That's what I use as an indicator for a lot of what I look at because volume is almost always going to be a part of the puzzle. But with something",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 53,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "this is going to be a part of it whenever things start moving. And that's not unique to GameStop. That's what I use as an indicator for a lot of what I look at because volume is almost always going to be a part of the puzzle. But with something like this, it's just really tricky because there's so many, so many sub components that are very difficult to track. Matt says, would the fact that they fail to deliver mean that FDDs wouldn't make price move in the theory that they can keep failing to deliver using different ETFs will won't be predictable? Well, I think they're incentivized to not continue to fail to deliver for overly extended durations of time, which is part of the reasons why I think they go through the redemption creation cycles with component ETFs. So I view that more so as a way for them to juggle and not to get snagged with repeated FDDs, which then starts to potentially negatively impact some of the standing that they'll have with the exchanges. So I view the FDD cycles to be difficult to nail down for that exact reason because there's different ways that they can satisfy FDD's short term by kind of playing this juggling game, which makes it very difficult then to identify. Chris says, oh, Chris, you are here. Why don't you leave me hanging? I was trying to look at your idea and you just bounced. Don says, Matt, I",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 54,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "they can satisfy FDD's short term by kind of playing this juggling game, which makes it very difficult then to identify. Chris says, oh, Chris, you are here. Why don't you leave me hanging? I was trying to look at your idea and you just bounced. Don says, Matt, I think that the juggling is how they buy, how they get by what bit is all their animal social liquidity was exhausted. I agree with that. I think that was a big, big part of this. So to Don's point, he's saying that all their animal sources of liquidity were exhausted. And I completely agree with that. I think that's one of the reasons why we see the movement that we do in GameStop is when liquidity is so strapped, they run out of places to go. But for those that haven't seen, I think that this is like a must watch video for any ape. Is this one here? ETF. I'm looking forward, sorry. This guy. A key. Euphoria Web says, Chris, you're a clairvoyant. Tell me where I'll be in five years, please. Also, Chris, if you are clairvoyant, really, I have to be honest with you. One of the big questions I have is one is when this is fucking sciatica, go away. Today's my anniversary, actually, for the sciatica shit starting and this marks one full month of this. So while you're answering euphoria about the five year plan, I would be actually really cool with",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 55,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "of the big questions I have is one is when this is fucking sciatica, go away. Today's my anniversary, actually, for the sciatica shit starting and this marks one full month of this. So while you're answering euphoria about the five year plan, I would be actually really cool with just a few months, maybe like two months. Is this still going in two months? That would be great. Captain Chris says made 46K on June 6th. Wouldn't have known this if it wasn't from Newton's hype dates for June 6th. Yeah, that's awesome. That's great that you're able to cash in on June 6th. That's awesome. That's absolutely awesome. We take a look at June 6th. Key? Yeah. That's a great day. Big, big move. So again, the way I, because I traded this and I traded this, but the way that I traded this was like literally off of expansion and volume. So we can see volume when crazy as the stock was flying towards the moon at least. And then it started coming back down. We can see volume contracting, contracting, contracting, starting to get really quiet. So it's really normalizing essentially to these levels and then all of a sudden massive volume. And so the cool part is is like even on the day of the move, you can see this volume coming in because as this volume is building on the day, early in the day, it starts to exceed the previous day entire volume",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 56,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "all of a sudden massive volume. And so the cool part is is like even on the day of the move, you can see this volume coming in because as this volume is building on the day, early in the day, it starts to exceed the previous day entire volume while there's still plenty of time left in the day. And as that's happening, that's kind of like your, your red warning system that like some shit's going on. What it is, we don't always know, but some things happening. So this is one of the things that I pay attention to personally. And it's because I'm an idiot. I'm not as good as trying to connect a lot of different dots and stuff like that. And I actually think that's one of the reasons why Newton, he has a fascinating approach to, to GameStop because a lot of what he does is he just holds the stock. And by just holding the stock, you're, you're, you maintain exposure. Now and that's more is like from an investor, from a trader perspective, I, there's an opportunity cost to just holding. And I need to make money on movement. So most of my system is predicated around identifying movement so that I can hopefully extract value while something is in motion. And then as motion starts to calm down, I'll try to find my way into other things that are showing a bunch of movement. This says totally throwing this out",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 57,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "of my system is predicated around identifying movement so that I can hopefully extract value while something is in motion. And then as motion starts to calm down, I'll try to find my way into other things that are showing a bunch of movement. This says totally throwing this out there, but I suspect early November push as well as January. Yeah, maybe I have no idea. I don't, again, like I don't try, I really don't try to even determine when I think something is going to move because again, you've heard me say it, but like the one thing I know, I, I will tell you, like I know what will happen is as this thing starts to move, all these little tiny volume bars, there's going to be some monster volume bars that are going to move. While this thing starts to pick up momentum and before it has anything like this, it's going to have periods of elevated volume into that period. All of the previous squeezes that I've looked at specifically in GameStop, and this is one of the things I was actually curious about is, is it quiet until the day of the move and then does it start to run, but it doesn't. I've seen in all of the dates I've looked at so far in GameStop for previous moves is that before it has its biggest moves, you'll see these pre moves that start sprouting up where the candles themselves wide now,",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 58,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "and then does it start to run, but it doesn't. I've seen in all of the dates I've looked at so far in GameStop for previous moves is that before it has its biggest moves, you'll see these pre moves that start sprouting up where the candles themselves wide now, volume starts expanding. So to me, that's kind of a really simple thing to keep an eyeball out for. So in this case, I literally just wait for volume to start coming up and, you know, to who is it? To Captain Chris' point, whether that's November, December, January, February, March, regardless of the month or the mechanism that starts to drive it, that is going to happen. Volume is going to move. So whether it's an FTD that kicks it off in some way because as they're trying to go to their favorite ETF and go through a redemption cycle, they can't get it there for some reason. So there's another regulation that's stopping them at that point in time, at that specific instance for whatever reason that then forces them to do something else. Or if it's driven from an Opex tailwinds because the option markets are getting super crazy and there's a lot of people in their playing that are causing market makers to be longer, short gamma, depending on what they're doing. And they can exacerbate intraday moves. Like all of those reasons why price and volume start to move, they cause the same thing to",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 59,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "super crazy and there's a lot of people in their playing that are causing market makers to be longer, short gamma, depending on what they're doing. And they can exacerbate intraday moves. Like all of those reasons why price and volume start to move, they cause the same thing to occur volume. So I limit down again from the trading perspective. I limit down what I'm looking to be the cleanest signal I can find. Now I enjoy again like that video I shared with you all a little bit earlier about the ETF redemption cycle and the structural FTDs in shorting. I'm interested in that because it's fascinating to me. Literally it's fascinating. But beyond that, it's really difficult to trade off of because as I go through the data, there's a healthy mix of signal that leads to positive movement and negative movement makes it really, really tricky in order to trade. John Chris says Newton talked about June 6th for over a month before it happening. He suspected the pattern almost two months based on, yeah, yeah, yeah, that's what I'm saying is Newton is, well, I don't know if you're talking to me or I see you're talking to Alfonso. Yeah, but I mean, also to I remember Newton was like really, really stoked about the eighth of August, right? He was really, really interested in eight aug, which there wasn't a whole lot that happened there. It wasn't a bad day, but the point is",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 60,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "you're talking to Alfonso. Yeah, but I mean, also to I remember Newton was like really, really stoked about the eighth of August, right? He was really, really interested in eight aug, which there wasn't a whole lot that happened there. It wasn't a bad day, but the point is is I think it's important and Newton is fantastic about this as with most of the people that I work with just in terms of exploring the product. It's really, really important for us to look at not just because this is the human tendency. The human tendency is if I Eric, if I make 12 calls or predictions about what's going to happen over a 52 week period, over the period of an entire year, if I make that number of calls over a 52 week period and let's say I make 30 calls, let's say 22 of them are wrong and eight of them are right. What I'm going to do is focus on the eight that I'm right on. And that's not even because I'm trying to be dismissive. It's not because I'm trying to trick other people. It's because that's human tendency is to look at the positive outcomes. So when I look at stuff, one of these things, I'm really, really careful with doing and it's from my trading background. As you could tell when we were doing the FTD stuff or even when I was looking at price by volume earlier in the live",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 61,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "the positive outcomes. So when I look at stuff, one of these things, I'm really, really careful with doing and it's from my trading background. As you could tell when we were doing the FTD stuff or even when I was looking at price by volume earlier in the live stream is I'm interested in not just identifying the periods where something worked in my favor, but I want to look at the periods where the perceived signal occurred, all of those instances and then see what happens. So again, a really good example of that is this move here. According to the volume component that I'm telling you about, this is an example where it didn't work. This is an example where if I started buying in here on 25 March and I didn't perfectly time this exit on this gap down somehow, then I would just be sitting there holding a losing trade, which is part of trading. We've become so strange as traders with like a complete inability to be okay with losing positions and understanding that while we're in the process of trying to come up with what we think might happen, we're going to get it wrong a bunch and that's okay. As long as we're not betting the farm every single time, you can get it wrong a ton of times and then the times that you get it right, if you have good money management, you can make way more than what you",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 62,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "it wrong a bunch and that's okay. As long as we're not betting the farm every single time, you can get it wrong a ton of times and then the times that you get it right, if you have good money management, you can make way more than what you would have lost on those other periods. But again, that's a little bit more of just a general traders approach from investing is very different. And it looks like we have Chris that also joined us in outliers supporter. Thanks, bro. Welcome. Welcome to the game. ApoSpade says, Tom of hype dates do nothing, which is fine. Yeah, exactly. Because even as different people, some people want to pick the date so that they're the guy or gal that did it. And there's a lot of people that really just enjoy that the ego is sawing effect of being right. But way more importantly is as people come up with like these different predictions, these different hype dates is the exchange of information. We get to learn a lot from people and what they're looking at and the way that they're arriving at their conclusions. And I have to be honest with you, a lot of the due diligence that people send to me, I don't find very robust just from an analysis perspective, but I find it fascinating. And almost all of them have really interesting pieces that I can look at and say, Oh, interesting. I might not",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 63,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "honest with you, a lot of the due diligence that people send to me, I don't find very robust just from an analysis perspective, but I find it fascinating. And almost all of them have really interesting pieces that I can look at and say, Oh, interesting. I might not have considered that before. And that's exactly what Newton is a wizard at as the scribe of GME because he takes all these individual pieces and he starts collecting them and he builds this really incredible reference sheet for all of us to use and he maintains it on his own time so that we can have a collated source of information, which is absolutely massive, I think. You for you, let me go back. You for you says also the cash with theoretically bringing buyers, no, it could, but again, like from I assume you mean buyers from the stock, right? Like people interested in becoming long game stop because if you're referring to it in that context, just because a company has cash, doesn't mean I'm going to buy it again. I buy a company is a true investor, not as a fan of game stop, not as anybody that's interested in the story, just as an objective investor. Cash doesn't mean much to me. Cash can be used for good for bad. It can be used well. It could be used poorly. What I care about is the efficacy of a business. Does a business make money?",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 64,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "anybody that's interested in the story, just as an objective investor. Cash doesn't mean much to me. Cash can be used for good for bad. It can be used well. It could be used poorly. What I care about is the efficacy of a business. Does a business make money? Does a business have a promising road map to continue making money into the future? Does a business have a moat that makes it difficult for other businesses to come in and start scooping up my lunch? Is the business in a highly competitive landscape that makes it difficult for it to grow and consume market share from other businesses? So those are just a few things. So as an investor, it's not at all just about cash. If a company has a bunch of cash, it's good for them. But as an investor, I need to know what the cash is used for. The cash doesn't do me any favors. The cash is priced into the stock right now. So if I'm an investor, I make money when the company appreciates in value, which then means the stock price goes up as the company appreciates in value, meaning more revenue, more sales, better profit margins. That's the shit that matters. So to your point, it would be something as an investor, I would be like, Oh, interesting. This company has a lot of money. This company has, I would consider to be a fairly revolutionary leader in Cohen because",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 65,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "revenue, more sales, better profit margins. That's the shit that matters. So to your point, it would be something as an investor, I would be like, Oh, interesting. This company has a lot of money. This company has, I would consider to be a fairly revolutionary leader in Cohen because of what he did with GameStop in the landscape that he did, which is not easy. So with that, I would be interested. But does that mean I buy right now? Again, personally, no. If I didn't like the story, I have GameStop, but it's more because I'm a fan, it's less because I think that at this exact second, that's the best place for the money. So a lot of investors are going to wait until they see what's happening with the money. What's the plan here? And what can we do with the capital to then feed the business to be more successful? That's where it starts to get really interesting. But then just having a few billion in cash again, it sounds like a ton of money to a regular person like us, but is a company that it's not like this insane amount of money. Actually, what percentage of US publicly rated companies have over two billion in cash on hand? I'm not annoying. Round two. I tried somewhere else, right over here. I don't know the answer to this. I'm actually curious. 15 of publicly traded companies have over two billion in cash on hand.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 66,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "what percentage of US publicly rated companies have over two billion in cash on hand? I'm not annoying. Round two. I tried somewhere else, right over here. I don't know the answer to this. I'm actually curious. 15 of publicly traded companies have over two billion in cash on hand. This is from companies market cap and finance charts. So I don't know, I didn't like click into the source. I don't know how efficacious it is. But yeah, Andrew says grab Jamie with both hands just my opinion. I think that that's again, that's totally, totally fair. I think there's a lot of different ways to approach markets. So for the people that have a more investor mindset, where we want to get in when it's cheap, we want to get in before the rest of the market starts identifying the future value of the product. Yeah, like I can see why people specifically investors would want to get in a little bit early for those reasons. For me, again, I'm a trader. I need things to move and there's a significant opportunity cost to my capital. So I'm very cautious about where I choose to put money. And in order for things to literally earn my money, I have to see certain behaviors. And it's why in GameStop, I still have the shares as I've told you all. But I do not have the same speculative long option positions or short option positions as I had on previously",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 67,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "in order for things to literally earn my money, I have to see certain behaviors. And it's why in GameStop, I still have the shares as I've told you all. But I do not have the same speculative long option positions or short option positions as I had on previously because it's not doing this. This I can make money off of this. I can make money off of this. I can make money off of this is difficult to make money off of for me. So there's a couple different ways that I have to play the product in order again, for it to make sense for my book. But for an investor, if again, the hypothesis is we trust Cohen, we think he's going to do some magical stuff for the company. And now he's equipped with a few bill in cash to do it. Shit dude. Like that's a compelling argument. I'm so eager for the fourth. I'm so eager for the fourth. I am so curious if and what they're going to say. Because I haven't seen them say much about the offering and the impetus behind it, the vision for after it. Really Larry Chang has been like kind of my go-to information source. And he doesn't really talk much about the company directly. He talks a lot about like broader things. And the reason why I go to him is because I just don't see much come out from Cohen. Cohen likes to troll",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 68,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "has been like kind of my go-to information source. And he doesn't really talk much about the company directly. He talks a lot about like broader things. And the reason why I go to him is because I just don't see much come out from Cohen. Cohen likes to troll on X, which is cool. But like I don't get a bunch of market data that I can evaluate the product from that unfortunately. So when I'm looking at GameStop, I'm very, very, very eager to see what comes out on the fourth. Euphoria says Larry definitely says things that way by design. Absolutely. And he makes a lot of parallels. I noticed that with GameStop in general. I don't know if it's just like an aura about the kind of people that it draws into its sphere or what it is. But like if we look at anybody that I've seen really communicate around GameStop, roaring Kitty, Chang, Cohen, none of them are like direct communicators, none of them. Which again, I just find that interesting. It adds a fascinating, fascinating story behind it. Willie says he definitely talks in an abstract manner. I appreciate his post as they signal and involve management team. I agree. I completely agree. Willie says I can sleep at night knowing the management team. They're super fucking smart. Like they're super smart, bro. When I was reading through Cohen's deposition for the... What the fuck is the case? I forgot. Who's it? BVBY.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 69,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "signal and involve management team. I agree. I completely agree. Willie says I can sleep at night knowing the management team. They're super fucking smart. Like they're super smart, bro. When I was reading through Cohen's deposition for the... What the fuck is the case? I forgot. Who's it? BVBY. So in that case, you could tell a lot about the way that he handles stress in different data points. Smart, dude. He's really smart. And he came from a pretty effective business background. So yeah, I completely agree with like having a lot of confidence. Ape of Spades says they can't signal specifics, but they need to let Ape's investors see they let them know. Yeah, I agree. And again, one of the things is it's okay to talk about broad plans. And that's why I'm hopeful that they'll do it, especially following the at the money. Because like tons of huge companies give very specific plans about what they're doing over the next quarter. And they can still execute against it because they have like a really good plan in place. That's fairly robust. So I was literally just going to bring that up. That's a perfect point, Rebel Darkside, who says Ryan Cohen said we keep quiet and just work, which I agree. Like I think that there's something there. But I think the problem is when exactly to your all's point in the chat is if that's your approach, you can do that. And he does",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 70,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "Rebel Darkside, who says Ryan Cohen said we keep quiet and just work, which I agree. Like I think that there's something there. But I think the problem is when exactly to your all's point in the chat is if that's your approach, you can do that. And he does do that, I believe. But you're also in a leadership position. You lead not just a company, but you lead the investors in the company. And if we want like you all were talking about it earlier, other investors to be interested in buying game step, buying game stop because we see the cash that it has now. Well, if we want that to happen, we kind of have to have some ideas about what's going on here. Because if you know nothing about Ryan Cohen, his leadership team, what his history is and kind of how he's a bit of an activist investor and CEO, if you don't know any of that. And you think about game stop again, completely agnostic to all of what we know as background. If you ask a regular person about game stop, they're going to say, oh, it's a brick and mortar store that's dying like blockbuster. And that's not a terrible, that's not like a crazy assumption to come up with. It's a fair guess to take. But the way that they start to pivot that narrative for kind of the lay or more hands off investor is by communicating and giving",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 71,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that's dying like blockbuster. And that's not a terrible, that's not like a crazy assumption to come up with. It's a fair guess to take. But the way that they start to pivot that narrative for kind of the lay or more hands off investor is by communicating and giving them some ideas about what our ideas are, what we're thinking about. Because again, like during the September 4th earnings, they literally can say something like we had a good or bad quarter. I think the quarter typically is not great for them. But we had a bad quarter. This is what happened. These are some of the things we're doing to turn the company around. We did an at the money offering, which increased our cash to, you know, X billion dollars while we have a series of ideas on what we want to do with it. We're interested in investing in the business, in acquiring other businesses, in expanding our footprint, in expanding our audience. Like we can talk about all of those ideas, indicating some intent with giving zero specifics. And I still think that would be really well received. Because unfortunately, I feel like the GME shareholders for so long have just kind of been going on, like pure faith, which fuck man, like it's another reason why I love this whole thing so much is because the community is so sticky. And it's so interesting to find that because it's literally anomalous. Ape of space",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 72,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "shareholders for so long have just kind of been going on, like pure faith, which fuck man, like it's another reason why I love this whole thing so much is because the community is so sticky. And it's so interesting to find that because it's literally anomalous. Ape of space says, so why would they not? There must be a reason. Exactly. And I agree with you there. If they don't on like, why wouldn't they from the at the money offering? It's because they don't owe anybody that necessarily. And they might be waiting until whatever their thinking of is a little more fleshed out. Like that's fairly common. So I do think though that come the fourth of September, if they don't, that would lead a huge question mark in my mind because much like what you're saying, ape of spades, I really don't know why they wouldn't. And I agree with Chris here, Chris says closing stores is not bad. It's smart. Get rid of the cost we buy that's exactly correct. And I think I think closing stores in their case is not a bad move at all. And I think it's smart that they're still leaning into expanding their successful stores because there could be stores that are in a good location that when somebody needs some sort of peripherals or hardware, they can just go grab it and go back home. Like that's huge. And that can absolutely lead to a pretty good profitable",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 73,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "leaning into expanding their successful stores because there could be stores that are in a good location that when somebody needs some sort of peripherals or hardware, they can just go grab it and go back home. Like that's huge. And that can absolutely lead to a pretty good profitable picture. Now, I think what we need more than that though is again, to see GameStop pivot into the modern age. And to pivot into the potential audience that is broader online gamers. And it doesn't have to be relegated to gamers again. Like as the chat was pointing out, if we think that they should start expanding into other things, that's cool too. And I think that it makes a ton of sense just exactly as Alfonso is bringing up like trading cards, right? Like people are collectors. I think that makes a lot of sense. I sent Newton Pokemon cards from one of our live streams. So yeah, like there's stuff that you really have to go there to get which is good. But when you look at a lot of their primary profit driving factors, it's from console releases. And the reality of console releases is changing quite a lot. And like we already talked about the way you buy games is completely different. And I think it's going to become increasingly digital. I think it'll probably be a point where it gets to where you don't even have to store the game on your own machine.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 74,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "quite a lot. And like we already talked about the way you buy games is completely different. And I think it's going to become increasingly digital. I think it'll probably be a point where it gets to where you don't even have to store the game on your own machine. That it's just cloud-based completely. But there's a lot of ways for I think GameStop to innovate and still tap into a similar audience, which would be really, really efficient for them. I think at least. But we have to see, yeah, we have to see what they're thinking and what they want to do. Because again, that is one of the downsides that we have right now, is that we don't actually really know where they're trying to pivot or what the model is. Alfonso says, where do you insert the disk in an MS vision, bro? Yeah, you know, it's actually funny. My buddy, he was visiting his cousins who were like really young and he told them to, you know, like put the disk in. I think they were going to play Call of Duty or something as cousins are young. And they put the disk in upside down. So they like didn't even really know how it worked, which is hilarious. Makes total sense, but just hilarious. Big fan of that. G33 says, Kitty said you're not looking hard enough. He gave us the answer. If you didn't pay attention, you don't know. I don't know.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 75,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "upside down. So they like didn't even really know how it worked, which is hilarious. Makes total sense, but just hilarious. Big fan of that. G33 says, Kitty said you're not looking hard enough. He gave us the answer. If you didn't pay attention, you don't know. I don't know. Shit. If you guys know the answer, G33, if you know the answer, dog, tell me because I genuinely don't know. I tell you guys, I like, I am the village idiot. I do not pretend to be the guy that knows because I do not. Well, he says going into the tournament business would be a game changer. They are usually organized at a local level. These can be massive and attendance. And I mean, they have like really, really big offerings as well. So they have these broader competitions. Like I think getting into some sort of gaming competition makes it ton of sense. I mean, I also think they can get into media of some sort. Think of all the different games that it exists that people would love a Netflix series on. Like how sick would that be? Where I don't know like super popular games, but if there's like a, a, a wow. I know that's pretty popular. If there's a wow setup that game stop could get involved in in the production of different video game based TV series. Like I think that would be sick. I think there's a ton of ways to",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 76,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "but if there's like a, a, a wow. I know that's pretty popular. If there's a wow setup that game stop could get involved in in the production of different video game based TV series. Like I think that would be sick. I think there's a ton of ways to go about it. Ape of trade says Witcher. Yeah. And they, they, they did witcher so dirty because who's that, who's the older guy? Ves, Vesimir. They did Vesimir so dirty. This straight up disrespectful of Vesimir. I can't believe they did him like that. G 33 says ready player one is a big clue. Yep. I don't, I, I'm sure it is, but I also think you might overestimate how dumb I am in my ability to connect those dots. But yeah. Chris says AMC made a killing on the Taylor Swift crap. I don't know much about that, but that's interesting. Everybody's interested in G 33's ideas. I, I mean, guys, you kind of know what the deal is. Like G 33 doesn't know just like the rest of us. Nobody knows. Anybody that says that they definitively know is, it's, it's just a fallacy. It's untrue because we can't know none of us know. Now, I do think that there are probably hints on what we think might happen. That's fair. And I think it's okay to have ideas, but I don't actually think anybody actually knows because nobody up into this point has really nailed most",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 77,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "we can't know none of us know. Now, I do think that there are probably hints on what we think might happen. That's fair. And I think it's okay to have ideas, but I don't actually think anybody actually knows because nobody up into this point has really nailed most of this stuff. Chris says movie on the Taylor Swift tour movie. My daughter loved it. Oh, interesting. I did not know that. Yeah, I did not know that. I got to have my wife grab it really fast. What else we got? Andrew says did our cake get into serious? I don't know. I don't think there's really any way for us to tell because the other thing at this point is I don't really know where they're at with their capital. They are being roaring kitty versus slash Keith Gale depending on, you know, which personality is transacting. But I think it wouldn't be insane, but I'm still trying to fully track the pivot from GameStop to Chewy, whether it was a full pivot, partial pivot, temporary pivot, like all those things I don't know. But they're actually hold on. All right. Yo, my head has gotten better. I'm bigger. There we go. So when we're thinking about the potential pivot of roaring kitty from GME to something like Chewy, at least temporarily, the one thing I can clearly identify is he obviously got into Chewy. It seems partially from the fact that Cohen is affiliated with Chewy.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 78,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "I'm bigger. There we go. So when we're thinking about the potential pivot of roaring kitty from GME to something like Chewy, at least temporarily, the one thing I can clearly identify is he obviously got into Chewy. It seems partially from the fact that Cohen is affiliated with Chewy. And it's also the reason why I surmised he did 9,000,000 shares because also likely the shout out to Cohen. So the part that I don't understand though is beyond the shout out to Cohen, like really why Chewy? I don't like that this cuts my horns off because my Viking tinfoil hat needs to be respected. Hold on, I'll let you guys see. There you go. There's the whole thing. My head has gotten bigger. So it a fat head. But there's the full hat. But when I look at the movement of Chewy, it's been okay, but not crazy. And we think he got in what I forgot the data of the transaction was at least the 24th? Is that yet in here? So he's not like crushing it in Chewy either. Now maybe there's some sort of expectation for earnings, but I don't understand why he would have done this on the 24th with the idea of playing earnings out here. It seems like for most of his prior speculative trades that it would happen about a month out is what I've seen from like the rest of his footprint. Unshore. But you know, so I'm not",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 79,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "have done this on the 24th with the idea of playing earnings out here. It seems like for most of his prior speculative trades that it would happen about a month out is what I've seen from like the rest of his footprint. Unshore. But you know, so I'm not convinced that he did it necessarily for earnings. Ape of spades. Willie says that aim to be his buff is here. Yeah, man, it's just been a long time of working out, bro. Ape of spades says he does seem to be able to call it right before it moves. Well, he gets in like 30 days is what I noticed from most of his prior trades. It's like three weeks to four weeks that he starts to enter. And there's also a reality. Again, I'm not insinuating that he's a pump and dump. I don't believe that that's in his personality. I don't believe that that's his intention whatsoever. But again, objectively speaking, I know for fact, if roaring kitty posts something about his position, there's going to be other people going into the position. I know that for fact. Now again, I do not think that that makes him a pump and dump. I think that that means that people really value what he does and they want to follow him. But that that that is a price behavior that I can clearly identify as well. So I don't fully think that that's what the game plan was",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 80,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "him a pump and dump. I think that that means that people really value what he does and they want to follow him. But that that that is a price behavior that I can clearly identify as well. So I don't fully think that that's what the game plan was in this case though. Because I think roaring kitty knows better about the ape community that the probability of a bunch of apes that have been in game stop for three years are going to just pour over into chewy. I just I don't think that he would think that or expect that. So I'm unsure. Euphoria says doesn't D.F.V always end up updated as yellow on red at any time as GME position changes? I don't think so. I don't think that's true at all to be honest. Because he went he went dark for a long time and you don't go from his account value. What it was to what it was when he came back without doing some shit. So I would I would not believe. Yeah, I would personally not believe that he updates it every time he makes a change. I don't I don't see that personally. Euphoria says what if his shares never changed? It could be, but I believe it to be exceedingly unlikely that his shares never changed. It could be, but again, my opinion mega unlikely. The reason why I think it's super unlikely is because in this case, he only",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 81,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that personally. Euphoria says what if his shares never changed? It could be, but I believe it to be exceedingly unlikely that his shares never changed. It could be, but again, my opinion mega unlikely. The reason why I think it's super unlikely is because in this case, he only had 6.3 million left right here. And we saw his filing and his filing. I'm near positive, pegged him into Chewie on the 24th. So even if we give him kind of mid price on the 24th, let's call it like 2585. So 2585 times 9 million 1000 shares. He needs 232.675 million, which that's essentially the value of this account. So with that is the value of this account. I don't believe that to be the case. Now the other thing that hooked on options, that's a great name. That's such a great name. What a great name. That didn't they reduce the flow. They did, I think in Chewie. So Spostcar says he has other accounts. Yeah. So that's another argument I hear that I again, he spoke against directly himself. So I take him at his word. So if I look up GME live stream or roaring kitty, my bad. roaring kitty live stream. What a gang. I think we're back at it. I've never had that happen before. So I got like this Nvidia codec error. I don't even know what that is. I tried to open up another tab. Maybe because I literally just have",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 82,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "kitty, my bad. roaring kitty live stream. What a gang. I think we're back at it. I've never had that happen before. So I got like this Nvidia codec error. I don't even know what that is. I tried to open up another tab. Maybe because I literally just have too many tabs open or something. I have a built computer. I literally went and did my standard move when it comes to computers. And I always over build the computer. I got it from origin. And I essentially talk to the nerds and see what kind of computer they recommend for essentially being able to do all the crazy shit. And so anyways, it's an expensive computer that should be good. But for whatever reason, it's it's struggling. And as I opened up this tab, which I can help but find interesting. All right, back to this though. So the comment about their being another account. Let's listen to this together. I like to share this because again, like I prefer it not to be based on opinion as much as possible and to base it on as much general data as I can. So I'm going to turn on the desktop audio so that you can hear this should come through. And then let's just listen to this part where he brings up his account right here. It's a true yellow again. I suppose. I know there's some cash there. That's what I made. It depends on your",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 83,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "on the desktop audio so that you can hear this should come through. And then let's just listen to this part where he brings up his account right here. It's a true yellow again. I suppose. I know there's some cash there. That's what I made. It depends on your positions. But it's another yellow again. You know what I'm saying? It's how I roll. So that's that's out there. But I seen those headlines. E-Trade. So then he just throws a little bit because E-Trade was talking about whether or not they're going to close this position. Other than he just plays by removing their logo and the HTML just being fun. Good. Those positions are there. Those positions are there. But I'll do it. I'll remove it. Don't make me. Don't, don't make me. I win too. And I know how to do it back. I mean, he's like, oh, he's squinting. And there's a waking up. I'm like, what the hell? Well, that's where it was. Right word. That's where at the whole. See, I wait until the halt because if if and so, yeah, there you go. There you go. So why does it? It's going down. Especially ones I'm involved in because they get to share some of the time. And I'm doing my best. I'm going to do it. Fine. There you go. All right. Yeah, those are my only positions. You know, as you know, tears. I got a lot there. So those,",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 84,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "down. Especially ones I'm involved in because they get to share some of the time. And I'm doing my best. I'm going to do it. Fine. There you go. All right. Yeah, those are my only positions. You know, as you know, tears. I got a lot there. So those, yeah, those are my only positions. You know, as you know, so that's that's kind of the part I'm highlighting is that he talks about at this time, these being his only positions. He talks about that that's the cash that he has in here. And he also talks in the stream about the accusations that he has other accounts or backers, people that are essentially feeding him money. And he says like, this is his account. And there's nobody else helping him. So I understand the idea that maybe we think there's another account that he's pulling money from or doing something else in, but he kind of talks about it directly in this live stream. So I just take him at face value. The Robo says unless you consider cash a position. The reason why he says that you have to listen to it in context is because he's holding cash in the account. So when he says these are my only positions unless you consider cash a position because he has cash. So then he's just tying those two together. That's why he's saying that he's not suggesting that he, you know, unless you consider cash a",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 85,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "he's holding cash in the account. So when he says these are my only positions unless you consider cash a position because he has cash. So then he's just tying those two together. That's why he's saying that he's not suggesting that he, you know, unless you consider cash a position, I have a bunch of a cash in another account. Now I don't know, right? Tim Foyle hats on. He could. And I also think that it would be highly unlikely with how much money he's made that he would put literally all of his money into this. But my other assumption on top of that is that he wouldn't have another account with hundreds of millions of dollars that he expected to trade with and not have it in there from the jump. That I don't see happening because it just, it wouldn't, it wouldn't make sense. Now one of the difficult parts with this whole saga is a lot of it doesn't make sense. It's just kind of strange. So yeah, I think when I look at the, the implications of that when I think about, when I think about the positions like I just, I don't see him squirreling up another quarter billion dollars to simultaneously have a GME and a chewy position is my guess. Um, Alfonso says, what was that video from? This is two months ago. RK clearly counted his position as having 150 plus securities in an early video. Yeah, that's a",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 86,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "see him squirreling up another quarter billion dollars to simultaneously have a GME and a chewy position is my guess. Um, Alfonso says, what was that video from? This is two months ago. RK clearly counted his position as having 150 plus securities in an early video. Yeah, that's a long time ago. Yeah. So one of the things I went back and I listened to a lot of his OG videos to learn a little bit more about him. And in this case, what I learned is that he actually changed his style pretty massively. So in his early videos, you can see all these stocks that he looks at, he kind of considers himself this value investor. But he talks about his pivot from being a value investor. And I think it was in one of these spreadsheet videos because what I learned from that is he started as a value investor. But then he was, he literally talked about this himself on paraphrasing because I don't remember it exactly. But he talks about how he got tired of essentially coming up with all these different companies, coming up with all these individual names and then putting positions on and then they're just not moving. So I don't know what led him to kind of, sorry, this is hot. I gotta take it off. I don't know what led him to make the pivot in from having a bunch of different names. Like you can see here, tons",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 87,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "on and then they're just not moving. So I don't know what led him to kind of, sorry, this is hot. I gotta take it off. I don't know what led him to make the pivot in from having a bunch of different names. Like you can see here, tons of names to being in just one thing. I don't know what led to that pivot. That's a massive, massive pivot to make though. Rebel Darksides, honestly, I think you know Ryan Cohen and would dilute and that's why he laughed and I think he just wants to be, jamming to be something like for real. Yeah, I think so too. I don't think because the other component to this is even if there's a squeeze, he can't get out in a squeeze at the top. And I think he knows that. So even during these squeezes in these different price patterns, I don't, when you're trading a position that size, you literally run out of liquidity. So I think that there's kind of an element to the way that he has to trade things that I completely agree with you guys that he wants it to be a legitimate company. I think that without a doubt. No, it says that phrasing is so specific. It is, but again, like I think, well, listen to it again together because I think it's specific within context and the context when he says that he hovers his mouse over the cash position",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 88,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "company. I think that without a doubt. No, it says that phrasing is so specific. It is, but again, like I think, well, listen to it again together because I think it's specific within context and the context when he says that he hovers his mouse over the cash position in his account because when he says this is my only position, he's essentially front running the statement of, oh, cash is a position. So that's why he does it. But here we go. I'll bring the audio back up. Let's kill this. And then let's, let's listen together. Take a, it's a, it's a new positions, but although again, I suppose, I know there's some cash there. That's what I mean. It depends on your positions, but it's another yellow again. You know what I'm saying? It's how I roll. So that's, that's out there. But I say that's a true me. I'll take, so those, yeah, those are my only positions, you know, as you know, about me, I'll take a, so, cheers. I got a lot there. So those, yeah, those are my only positions, you know, as you know, about me, I'll take a, it's a, it's a true yellow again. I suppose, I know there's some cash there. That's what I mean. It depends on your positions. Right. So you see what I'm talking about. He says, it's, these are my only positions. I know there's some cash in there. Then he talked about his",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 89,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "it's a true yellow again. I suppose, I know there's some cash there. That's what I mean. It depends on your positions. Right. So you see what I'm talking about. He says, it's, these are my only positions. I know there's some cash in there. Then he talked about his choice. You know, he's like, I'm down to do a, a yellow, you know, unless you consider cash a position. So he's referring to the cash in this scenario, like very clearly. It looks like the, the preferences for the hat back on. So we'll suffer through it for a little longer. He's very clearly, in my opinion, referring to the cash in this account, because when he says, these are my only positions, he's obviously front running the statement that a lot of people make, oh, cash is a position. So that's what I think. Willie says, don't blame the guy for pivoting and being more aggressive while he leave money on the table. Yeah, I agree. Completely agree. Alfonso says, maybe that's when Burry identifying the height short and interest he began changing his investment style. Well, that's a great question. I think Burry got in quite a bit after he was already pretty focused on game stop. Again, just listening to the previous live streams or videos that he did that I've heard from him. But yeah, I think Burry, he, because like, this is what I try to talk to you guys about from a trader's",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 90,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "bit after he was already pretty focused on game stop. Again, just listening to the previous live streams or videos that he did that I've heard from him. But yeah, I think Burry, he, because like, this is what I try to talk to you guys about from a trader's perspective, we look at the same shit. So the way that I found this move here is the same way. It's literally the same exact way that if we go back into this move, let's grab GME, if we go back into this move, like most of us traders saw the same shit. I know I did. I started trading the volume here just like I started trading the volume on a bunch of other things because a lot of us traders just look for volume. So I think Burry in this case, so essentially something that was structurally overshorted, like again, a lot of us did because that's what causes these kinds of gamma squeezes. And that's why it's important to delineate in my opinion from a short squeeze from a gamma squeeze because I think in something like this, there was a bit of a mix. Alfonso says Burry was before RK, oh, interesting, that's really good to know. That's really, really good to know because I think I remember him talking about Burry in one of his videos, but I didn't, I took it as he was already in the video. I didn't realize that I'm trying",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 91,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "Burry was before RK, oh, interesting, that's really good to know. That's really, really good to know because I think I remember him talking about Burry in one of his videos, but I didn't, I took it as he was already in the video. I didn't realize that I'm trying to find where he talks about it. Was it a live stream maybe? Yeah, I think it's in here. Yeah, I can't remember which one. This is three years ago. Let me change the question to this. Maybe Alfonso, you can help me. When did Kitty first get into? GameStop, that would help me a lot because I really, for whatever reason, just I took it as he was in before because he was already covering GameStop super, super close. I think this one. Euphoria Web says, hoping a single dude will buy nine million shares as horrible. That's not how this should move. Well, and also to be completely clear, I don't know what comment you're referring to, but it's, it's not just him. Like his nine million volume isn't the only thing that moves this. You need more than him. Right. So for example, for this move to happen here, which was a low of 1231 to a high of 17. So a five point move, big move. But in order for this move to happen, it was 36 million shares traded. His nine million, let's just pretend if we put all of his nine million on a",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 92,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "happen here, which was a low of 1231 to a high of 17. So a five point move, big move. But in order for this move to happen, it was 36 million shares traded. His nine million, let's just pretend if we put all of his nine million on a single day here, what have contributed, but you need way more volume than what Rory and Kitty can provide. So even on this move here, it's 187 million, then 206 million. So the, just the point I'm highlighting there is, I don't, again, I'm not sure Euphoria, which comment you're referring to, but his, his volume is part of the puzzle, but it's not the puzzle. There's definitely more to it than not. For instance, says why file 13G on chewy, but not GME. They have a very close float size. He didn't hit the threshold. Like that's what it comes down to. There's no incentive for him to file a 13G other than when he's legally required to. Oh, there's Burry right here. So I'm trying to, there was another comment that I missed. Okay. Ape of spades says RK by 7 June 19. Yeah. And then so we can see when did Michael Burry, in case you're wondering, if you type in the word, when did Michael, the first thing that pops up is when did Michael Jackson die? When did Michael Burry buy game stop stock in Q4 of 2018? Yeah. So I think you guys are",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 93,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "can see when did Michael Burry, in case you're wondering, if you type in the word, when did Michael, the first thing that pops up is when did Michael Jackson die? When did Michael Burry buy game stop stock in Q4 of 2018? Yeah. So I think you guys are spot on. Yeah. I think that's exactly I think you're, you're right spot on. And then before liquidating his entire stake in the third quarter of 2020, so. So it does look like based on the timelines that you gave me again, I'm not sure what they are, but I can see where Burry bought in for sure. I'm not positive where the cat. Got in, but. If it's, as you guys say, then Burry definitely would have been in before. Thank you for that. That's actually really, really helpful. Rebel Darkside says, okay, what if he buys back the nine million shares that I think he sold from GME and comes back specifically with this volume more than the volume, what do you think? I think a few things. I think the first thing is. If we see him unwind, his chewy position, we'll see it. And he'll also have to file. So we'll know when he does it. And if he chose to go on the open market and start getting into GameStop with that position, it's doable, but he would bid himself up so much because of how small the volume is right now. So my guess",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 94,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "have to file. So we'll know when he does it. And if he chose to go on the open market and start getting into GameStop with that position, it's doable, but he would bid himself up so much because of how small the volume is right now. So my guess is he probably would start with options, to be honest, because if he wanted to gain nine million share exposure again and here, the total volume for again, the last five days on average is 3.7 million. So he is essentially three times that, not quite, like two and a half, but still he would consume all of the volume himself. He would bid himself up sky high. So in that case, what I imagine he would do is use options to start bringing volume into the stock. And then as volume comes into the stock, he could start accumulating. But I don't think he's going to come into something like this and then just decide on, you know, the 26th of August, the bid nine million shares or nine million 1000 shares, because he's going to murder himself, just trying to get a fill on that. It's going to be a completely one sided market at that point. And he's going to be front running himself to the negative side. It wouldn't be useful. So before you said, all is that assuming he doesn't own GME currently, well, I wouldn't say that. I think that it's reasonable for us",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 95,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "be a completely one sided market at that point. And he's going to be front running himself to the negative side. It wouldn't be useful. So before you said, all is that assuming he doesn't own GME currently, well, I wouldn't say that. I think that it's reasonable for us to assume he doesn't own as big of a GME position. Now again, based on the math, the quick math that we did earlier, he would need like 230 million ish in order for him to put on his chewy position to 30. So if he has 230 million, that's committed to chewy based on the 13G filing, which again, we can see that. Then in this case, it leaves him with 30 mil ish. So what he's doing with that 30 mil, I don't know. Does that mean that he has some style of a position in GME? I don't know. Does that mean that it's sitting in cash? Again, I have no idea. But what I do know is based on this last screenshot in the overwhelming likelihood, again, just based on the breadth of evidence in front of us, it does look like it's highly likely, highly likely that he unwound the majority of this GME position to move into chewy. And then whatever he's doing with the residual, I have no idea. But it only he does until he posts another yellow update or kind of gives some sort of hints. I don't think there's a",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 96,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "likely that he unwound the majority of this GME position to move into chewy. And then whatever he's doing with the residual, I have no idea. But it only he does until he posts another yellow update or kind of gives some sort of hints. I don't think there's a way for us to definitively know. Now, one of the interesting things here is Newton pointed out to me in one of the live streams that we did together that he's never decreased his position size before in GameStop, at least in the updates that he's shown, but we don't really know about that either because there's a lot of periods that are not captured that we haven't seen. But I think it's a fair assumption to make on Newton's behalf. Now, this was on the 13th of June. So Sposed car says, what about leveraging his GME shares? I don't think they offer you margin on GME. So Yeah, I don't I don't think there's leverage available to him. And I don't think he can buy chewy on margin either. That's the brokers protecting themselves. And I actually I kind of get that because if you're a broker, you take on a massive massive amount of this risk. Before he says, okay, so what if he sold some of his shares when they were much higher? Yeah, let's take a look at that example. So this was on the 13th of June. So if we look at GameStop from",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 97,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "take on a massive massive amount of this risk. Before he says, okay, so what if he sold some of his shares when they were much higher? Yeah, let's take a look at that example. So this was on the 13th of June. So if we look at GameStop from June 13th, which is here, that's the peak. Like it wasn't higher after that. So it's a good question, but again, yeah, it doesn't line up at least with the performance of GameStop. Buy five says you would never cash out GME for Chewie. Yeah, I mean, you're entitled to think that and I get it and I understand that a lot of people feel that way. So Yeah, I would never tell you either way because like I don't know. But what I do know again is that as of the 13th of June, his account value was 268 mil. And his Chewie position 9 million 1000 shares likely takes at the very least 230 mil. So yeah. And again, in that live stream that we saw together, this one that again, you, you should check out for sure this one here. And you can see the time hack. It's kind of like towards the the ladder 60 of the video. He says he talks about this and he says it's his only account, his only positions. So I think what he showed us here is what he had. And I think that again, in my opinion, just looking",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 98,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "It's kind of like towards the the ladder 60 of the video. He says he talks about this and he says it's his only account, his only positions. So I think what he showed us here is what he had. And I think that again, in my opinion, just looking at it objectively, not what I want the cat to do, not what I hope somebody else might have done, but just looking at the evidence as best as and objectively as I possibly can to me, it looks like it's far more likely that he closed the meaningful portion of GME here. And then likely bought into Chewie. Again, whether he flattened totally, I don't know. He definitely would have money left over to maintain a position in here. It just wouldn't be 9 million 1000 shares. The other thing that I consider with this specific scenario is what's the probability that he has options involved. And I've been trying to keep a really close eye on that. And because that's that is my wheelhouse that I feel supremely confident in my ability to connect to dots is compared to most of this other stuff where I'm just kind of reasoning through it as best I can. But I haven't seen anything resembling like 30 million dollar style positions. So he could, but he might be trading a little bit smaller. So yeah. Chris says if he can remove that e-trade logo, he can remove the rest of the",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 99,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "of reasoning through it as best I can. But I haven't seen anything resembling like 30 million dollar style positions. So he could, but he might be trading a little bit smaller. So yeah. Chris says if he can remove that e-trade logo, he can remove the rest of the info or change it. Yeah, he could. And again, it just depends on how you want to interpret his messaging. I believe him. I take him at his work when he says, this is my account. These are my positions. I take him at his word. If he has other stuff somewhere else, we have absolutely no idea. But I think that he also understood that talking about it in that context really was about trust, I think. So yeah, I mean, I take him at his word personally. But I wouldn't feel any type of way about somebody that says like, oh, I think he has other accounts or other positions like I could totally see that too. Again, in an objective landscape, the way the way that I arrive at my opinion is just at what I can make the best inferences off of not what I hope happens, not what I prefer to happen, but what I can try and objectively connect dots to. That's the way I look at it personally. I will he says there's bulls, there's bears, and then there's cats. Yeah, it's awesome. That's so awesome. Ricky says Martin Screly says, Kitty's positions",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 100,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "happens, not what I prefer to happen, but what I can try and objectively connect dots to. That's the way I look at it personally. I will he says there's bulls, there's bears, and then there's cats. Yeah, it's awesome. That's so awesome. Ricky says Martin Screly says, Kitty's positions are probably Photoshopped. I don't trust Martin Screly as far as I can throw him. And again, if nothing else with somebody like the cat, I do believe what he says. Like I trust him. The reason why I trust him is that he has absolutely no incentive to lie to people. He at the start of this, even before all of this madness started, right? Like let's go when he came back here in two June. Here he had 210 million. That is the ultimate fuck you money. That is never need anything ever again, level of money. So I think that there's no reason for him the cat to come on a live streamer to come back and start bullshitting or fabricating these positions. Like I just don't see any incentive here for him at all to do that. Even if we take it a step further and go back to his final update, he had 35 million. That's still fuck you money. That is still rest of my lifetime and likely the airs to him because I know that he has a family. I think he has a daughter. Like they're good forever. They're completely good. So",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 101,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "go back to his final update, he had 35 million. That's still fuck you money. That is still rest of my lifetime and likely the airs to him because I know that he has a family. I think he has a daughter. Like they're good forever. They're completely good. So I just don't see somebody with a massive incentive to come out here and start bullshitting. Alfonso says what puzzles me is about R.K. entering Chewie is that Chewie is controlled by Pet Smart who own the vote for the Class B shares. They can do whatever they want at any time. Yeah, I agree. And I think kind of to some of the chat's point, I think part of the reason at least the only connection I can find is Collins connection to it. I think if Chewie wasn't associated to Cohen, I don't think he would have put a position on it personally. I think a big reason why he did it is because he's just kind of trolling a little bit. He's having fun. He has fuck you money and he's playing fuck you games with his fuck you money as he should. So yeah, Robo says it's an all-time lows R.K. is a deep value investor. He says he used to be. I don't think that he would identify as that anymore to be honest. Because I wish I have to find that for you guys. I have to figure out which video it's from. Let",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 102,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "it's an all-time lows R.K. is a deep value investor. He says he used to be. I don't think that he would identify as that anymore to be honest. Because I wish I have to find that for you guys. I have to figure out which video it's from. Let me see. 3000. All right, come across a new stock. I had it to the list. It doesn't happen often, but I'm excited. I'm excited to come across a new one. What I've noticed too, I used to, I'm not this a long time ago, but so so many tourists fall off and get ahead on because I'm like murderers and acquisitions and stuff and get bought out. If you're doing it manually, you need to do like cleanup stuff. And so even the number of companies has always changed. Anyway, so this is the University of Stocks. The University of Stocks is based on this database of stocks at the DB. And you should see more than 3423. You see 3443. This is like, I made some modifications recently to streamline the process a little bit. So yeah, I have to find the spot because I don't want to waste your guys' time and kind of have to go through the entire video. But he talks about his pivot in terms of his investing style, which I do find to be really, really interesting personally. But yeah, I mean, the whole the whole backdrop here is beyond fascinating to",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 103,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "waste your guys' time and kind of have to go through the entire video. But he talks about his pivot in terms of his investing style, which I do find to be really, really interesting personally. But yeah, I mean, the whole the whole backdrop here is beyond fascinating to me. And the pivot into Chewy to me more than anything seems like a salute to Cohen. Because not only did he get into Chewy, but he also got in at 9 million 1000 shares. So with that, I think that that's like really, really specific gestures. Just like when he got into GameStop and he did 9 million 1000 shares, right? It's a very purposeful number. He's not just kind of picking a number. In all of those positions, his account can handle more. So he's stopping at those at very specific for very specific reasons. Willie says, don't forget, GME and Chewy or an XRT might not be relevant though. Yeah, I mean, it's a fair call out. I don't necessarily think that that matters a whole bunch. But yeah, I agree with you. I think it's important to know. Now, Fanzo says a Roth that has a 37 year old, he can grow for another 22 years before he can visit his spaceship. Or he can buy his spaceship. Yeah, that's hilarious. Yeah, the whole thing man is just, it's a giant riddle to me. It's so cool. Gravitara said, did we ever reverse engineer the interest",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 104,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "37 year old, he can grow for another 22 years before he can visit his spaceship. Or he can buy his spaceship. Yeah, that's hilarious. Yeah, the whole thing man is just, it's a giant riddle to me. It's so cool. Gravitara said, did we ever reverse engineer the interest payment, DFC, DFC received? Yeah, I think we did at some point. I don't remember. Um, yeah, I don't remember. Yeah. I'm trying to like, I was trying to recollect, but I can't remember what we arrived at. It's obviously not enough for him to maintain both positions that I know definitively. At least just from the, I got to take the hat off, man. It's so hot in there. It's like, in case you guys didn't know, tinfoil hats don't breathe. I'm pretty sure my Kevlar helmet breathes more than than that. But yeah, it wasn't enough because I know one of the other things that Newton was postulating is like, yo, maybe he traded enough options, essentially to double his portfolio in the time frame from here to when he filed for Chewie and I just, I just don't see, I just don't see that. I don't see that at all. Apospeite says then take your shirt off. That's funny because if you don't know for a lot of my OG live streams, they were shirtless, especially if it's like during the summer earlier in the day when it's kind of hot, we're lazy now. We just run",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 105,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that at all. Apospeite says then take your shirt off. That's funny because if you don't know for a lot of my OG live streams, they were shirtless, especially if it's like during the summer earlier in the day when it's kind of hot, we're lazy now. We just run the AC whenever we're even remotely uncomfortable, we're very, very, we're too comfortable now. But yeah, I used to do a lot of live streams without the shirt on because absolutely when it's too hot, we popped the tarps, man, much easier that way. Ricky says Eric just lost 50 of his power when he took off the 10. Yeah, I think that's about right. I think I lose that and then I mean, God forbid, I lost the beard at the same time. I could just imagine this, this herniated disc would probably have me curl up in a fetal position, whereas like right now I can still fight it a little bit, but I would completely be screwed without it for sure. Anything else that we want to take a quick look at before I hop off and go stuff my fat face with some barbecue. Really, really fun session. I mean, there was like a hundred people in here, which is incredible. I love an opportunity to connect with you guys and take a look at the stock, learn more about it myself, hopefully share a little bit about it. If I can, the problem is right",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 106,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "fun session. I mean, there was like a hundred people in here, which is incredible. I love an opportunity to connect with you guys and take a look at the stock, learn more about it myself, hopefully share a little bit about it. If I can, the problem is right now with something like GameStop, it's just so range bound. Maybe that's what we can take a look at for the last couple minutes here. It's just where we're at now. I think that makes sense. So when I look at GameStop where it sits, I mean, it's been very, very healthily consolidating, which I love. That's really good to see. And the other thing I really like to see here is when if we take a look at this time frame, essentially from the fifth of aug, and we take a look at what something like IWM did. In some of these days, specifically like the seventh, if we take a look at the seventh here, GameStop had a down day, but minimally so compared to the broader Russell, which is great. That shows me that it's a little bit more resistant to the broad index, which is great. Now, what I don't love is that the Russell, essentially from the fifteenth, all the way through the 23rd, has been rallying pretty consistently. And I don't love that essentially GameStop is going the opposite direction, not by much, but it's curling down in that same reference time frame. So",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 107,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "Now, what I don't love is that the Russell, essentially from the fifteenth, all the way through the 23rd, has been rallying pretty consistently. And I don't love that essentially GameStop is going the opposite direction, not by much, but it's curling down in that same reference time frame. So I don't love that just from the context of the broader index supporting the movement. I just really wanted to see GameStop participates just a little bit more. Because when the broader index is down, it doesn't surprise me not to see much activity in GameStop or other subcomponents. Like that's very normal. That's okay. But when the broader index starts to show signs of life, I would want to see some of that make its way into GameStop, which we just unfortunately didn't fully see materialize here. So I think leading into earnings, it looks pretty quiet. Don Nott says, what would happen to Siri options when the ticker is merged? Yeah. So to dovetail off that super fast, essentially, they'll be adjusted. They won't offer new ones. And then they will make any, depending on how they choose to consolidate them, they'll adjust the options as needed. So but yeah, anyways, back to this generally sideways, not a ton to look at. Volume has been relatively anemic. And when I look at the options, it's super, super quiet. Just on a relative basis, this is about as quiet as it gets in here. So that matters to me",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 108,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "but yeah, anyways, back to this generally sideways, not a ton to look at. Volume has been relatively anemic. And when I look at the options, it's super, super quiet. Just on a relative basis, this is about as quiet as it gets in here. So that matters to me just because when I'm looking for overall activity in a product, I typically scan both the options chain and then the stock itself. And when I'm looking at this, I'm just not seeing a ton for me to like really latch on to. So it just seems quiet. That's the way I'm perceiving it. And when I perceive something as quiet, it means that I look at it, but I don't have a bunch of positions on in here right now, which leaves me at risk. If there's a giant gap, I wouldn't participate. But as a trader, I always emphasize the point as a trader because the reason why I think it's important for you guys to hear that is because it gives you some context into the way that I'm thinking about this, and the way that I'm playing it and why I'm playing it like that. And that's the main things. Like as a trader, I need to position myself where things are moving. And right now, it looks really quiet. So I'm generally expecting it to remain quiet into earnings unless there's new news that breaks in some capacity. But there's just not a ton of",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 109,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that's the main things. Like as a trader, I need to position myself where things are moving. And right now, it looks really quiet. So I'm generally expecting it to remain quiet into earnings unless there's new news that breaks in some capacity. But there's just not a ton of it just yet. So I'm continuing to cover it as I do my daily update videos with you all because I kind of said I would. And that's the primary reason because again, a lot of the update videos I'm doing my best to identify little things here and there. Right now, the biggest thing that I find so interesting is that the earnings volume for the earnings volatility for that expiration cycle is so low. That's fascinating because I have no idea why it would be this low compared to the next expiration cycle because the next expiration cycle is also a weekly expiration. So this I still postulate will expand. I actually traded the original expansion and I got out of it pretty fast because it stopped expanding. And I thought it was going to expand more and then it chilled out. So I mean, I was really surprised by that. And then I was equally more surprised by the contraction in volatility here. But I'm keeping an eye on it because my broader expectation based on just how these things typically move, I would anticipate this expanding, the 75 volatility for earnings to expand. But not quite,",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 110,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "surprised by that. And then I was equally more surprised by the contraction in volatility here. But I'm keeping an eye on it because my broader expectation based on just how these things typically move, I would anticipate this expanding, the 75 volatility for earnings to expand. But not quite, not quite seeing it yet. And the other thing really quick is when I looked at the volume, it looked like for the call side, most of the volume appeared to be closing front positions. And then moving into just the following week, which is very standard fare for GameStop, maintaining that front expiration cycle exposure. So if we take a look at the 30-odg, there's 70,000 options there or call specific, I should say, there's only 30 for earnings, which is crazy. Then there's only 12 and 13 step and then 63. So you can see as per usual, we stay way, way, more centralized for GameStop specifically in the front expiration. But right now, it's just pretty, pretty light. Alfonso says at some point, please leave GMME in the past. If it remains stagnant, pretty please. So many more worthy tickers, definitely. And that's why the other thing that you'll notice on the daily updates I do, I don't, while it's quiet in GameStop, I don't just look at GameStop. I make sure I am looking at other stuff for you guys for that exact reason. So I completely, completely agree with you. But in the near term",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 111,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "that you'll notice on the daily updates I do, I don't, while it's quiet in GameStop, I don't just look at GameStop. I make sure I am looking at other stuff for you guys for that exact reason. So I completely, completely agree with you. But in the near term here, I'll continue to cover GameStop on the daily basis because there's no reason really not to because I'm still fascinated by it and the story and whatnot. I mean, I'll be honest, if we go like six months and the behavior is that is, is as it is, I probably would decrease the daily update for GameStop and still probably do it like weekly or something. I don't know, I kind of, I don't plan this shit out. I just kind of do it as it goes. But that's exactly why in this case, I try to do both, right? So when I'm doing my daily update videos, I'll find whatever else looks interesting. I'm trying to keep it to two items because what I was doing for a little bit is like a broad market update. And I don't think a lot of people really cared about that. And that's okay. So I'm trying to pick like two more specific things to focus on. And then when I'm doing the live streams, you know, whether it's the on the YouTube channel largely or if it's for the Patreon folks, I'm doing more of like a broad market analysis",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 112,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "And that's okay. So I'm trying to pick like two more specific things to focus on. And then when I'm doing the live streams, you know, whether it's the on the YouTube channel largely or if it's for the Patreon folks, I'm doing more of like a broad market analysis overview and stuff like that. Robo says, what time flames do you typically trade? Anything from like zero DTE, dates to expiration out to, I don't know, long term holding for me might be like a month. Maybe two months, like those are fairly long term. And then the majority of my trades are probably two weeks that I hold something like that. Roy said, this is exactly what market makers want investors to grow board of GME. That's why we see this dip down now rounding pattern exact. I wouldn't attribute that to the to the market makers just to be clear. The market makers want you to trade. That's how they make their money. I just think it's important to not turn the market makers into some sort of, you know, like boogie man that's trying to screw everybody because the way that market makers make their money is by making markets, which requires people. That's not to say that they can't be shady or do shady things or play games, but in the process of market making, they need to, yeah, they need people. Um, Baytos says, personally, I wouldn't trust a recap from someone who got",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 113,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "is by making markets, which requires people. That's not to say that they can't be shady or do shady things or play games, but in the process of market making, they need to, yeah, they need people. Um, Baytos says, personally, I wouldn't trust a recap from someone who got bored on GME and dipped. Fair weather analysis is typically untrustworthy. Yeah, I mean, that's totally fair. The for me, it's, um, again, I try to be completely straightforward with you guys on what my incentives are and like what I do. I'm, I'm a, I'm a trader. So because I'm a trader, I need things to move around. It's how I make money. It's literally my livelihood. So yeah, I don't think that there's any, any issue with your opinion, um, Baytos. But yeah, for me, I, I'm, I've been trading this is my 17th year of trading and it's not just been game stop. It will never just be game stop for me. Game stop is part of my book and what I like to do. And again, I've already told you I'm infatuated with the story, but I got a trade man. It's, it's what I do. So that means I have to look for things that are moving and I've spent my entire trading career looking at lots of stuff. So yeah, the show. Um, Baytos says always trust original sources and D.D. authors themselves. I think that's smart. Yeah. Especially with understanding the hypothesis. I",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 114,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "So that means I have to look for things that are moving and I've spent my entire trading career looking at lots of stuff. So yeah, the show. Um, Baytos says always trust original sources and D.D. authors themselves. I think that's smart. Yeah. Especially with understanding the hypothesis. I think with the due diligence itself, there's something to be said about somebody like Newton who spends a lot of time like collating different sources and understanding them. I think that's really important for somebody to, to co-late ideas. But yeah, I think that it's much more efficacious to like look at the, the actual source itself. I think that that's a completely fair, uh, fair idea. Robo said, could GME have sold all 125 million shares to the market makers? Now market makers are dispersing it over keeping price stagnant to mitigate flooding the market. I don't, that, see, that's one of the great questions that we didn't really get a chance to talk about today. Maybe I'll add that to the agenda for the next one, which is like, it's a great, like, where the fuck are the shares? Because I don't know. And I don't really know where, yeah, like I, I don't know. And it's definitely a pretty big question I have. Because like, I would have expected to see like more clear filings from people flowing in. But yeah, I'm taking a note now. And we can take a closer look at it because, yeah,",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 115,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "where, yeah, like I, I don't know. And it's definitely a pretty big question I have. Because like, I would have expected to see like more clear filings from people flowing in. But yeah, I'm taking a note now. And we can take a closer look at it because, yeah, I'm very curious where the shares are. Now, what I can tell you is that the short flow has gone down massively. So I'm sure a ton of shorts use that to cover. But yeah, I am unsure where they went. Hooked on options says, do you do live streams during the trading day? Not usually. I would be down to in the future. But right now I typically, well, I just keep a regular cadence. So I do live streams at 5 p.m. Pacific time every day. And I just do 5 p.m. because I think for a lot of people that work, you know, for a living, it's easier for them to catch up with the live streams when they're not working. But in the future, I might start doing like multiple live streams a day. I really love live streams. I like interacting with you live. It's way more engaging for me. As you could tell from my videos, like I don't like making videos. I like sharing information. And I like sharing as much of my skill set and experience as I possibly can. But I don't like making, you know, super beautiful, well-crafted videos. It's",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 116,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "way more engaging for me. As you could tell from my videos, like I don't like making videos. I like sharing information. And I like sharing as much of my skill set and experience as I possibly can. But I don't like making, you know, super beautiful, well-crafted videos. It's just not my skill set. It's not my passion. I'm way more function over form in that sense. And I care a lot about the skill set and the practical application of trading. Because I got introduced to this through a mentor. And then I found another mentor. And I just had I've had a lot of people help me directly or indirectly throughout the path. And I think that it's massively important to try to share your skill set, whatever it is with other people. So yeah, that's why it's structured the way it is now, but always open to another approach. Well, he says personally, towards short interest being covered from a mathematical perspective, the price did not spike to the degree of the massive short position. Trading was even halted. Yeah, because I do agree. I think we can objectively see that short interest contracted pretty massively following offering. So I think that that makes sense. Apospeed says, Willie, then why all the effort and money spent bashing GME? Because, well, not to answer for Willie, but my guess is that there are still shorts that are stuck in there. I still don't think everybody closed out",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 117,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "following offering. So I think that that makes sense. Apospeed says, Willie, then why all the effort and money spent bashing GME? Because, well, not to answer for Willie, but my guess is that there are still shorts that are stuck in there. I still don't think everybody closed out from the original squeeze. And I think that a lot of them were turned into convertibles or swaps that are very difficult to track because they can continue to be modified and perpetuated. And I think that there's also probably a significant cohort of people that are hoping that GME goes bankrupt so that they can take their shorts down and not pay any taxes on it. Like there are probably people hanging out like vultures hoping that this thing fails, which is the ugliest thing. I hate that. The prospect of banking and on other people's failure just sucks. I think that that is un-American at best. But I think that it's just a terrible mindset to have. It's what a shitty place to be in your life. If that's what you're hoping for as other people to fail, that just sucks. But I think ape of spades, that would be my guess why there's a lot of people spending money to try to continue to suppress it. So all right gang, time for me to go stuff my fat face. Absolutely awesome time catching up. We'll do another one of these probably next Saturday. Just kind of keep",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 118,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  },
  {
    "text": "would be my guess why there's a lot of people spending money to try to continue to suppress it. So all right gang, time for me to go stuff my fat face. Absolutely awesome time catching up. We'll do another one of these probably next Saturday. Just kind of keep the cadence going for the GME specific one. And yeah, as always, if you guys need anything, just hit me up. I will see you all around on the other live streams or in the discord, be an outlier. I'll see you guys later.",
    "metadata": {
      "video_id": "zjdNmNYxg8I",
      "title": "Previous Squeezes | GameStop Analysis Live Ep7",
      "url": "https://www.youtube.com/watch?v=zjdNmNYxg8I",
      "upload_date": "",
      "duration": 9801.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 119,
      "total_chunks": 120,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjdNmNYxg8I&t=0"
    }
  }
]