[
  {
    "text": "What up, apes, Eric here. I want to talk about options. I come in peace. I know for a long time options were kind of a weird thing in the GameStop community and also for other meme stocks like AMC and other stuff. And no, I don't mean meme stocks in a bad way. We've had a long conversation about that. It just means popular stuff. So there are times things like Tesla or a meme stock. So I want to talk in a very practical sense about a strategy that I think is applicable to a lot of people in here that might work really, really well for a lot of folks. And a few notes here, not here to convince you of anything. You are the only person that can do whatever is right for you. But I do like sharing information and I want to help you add another tool to the toolkit. So I've been trading options for 17 years now. They are a big part of my life. I genuinely believe there are a way to really accelerate creating wealth because it has absolutely changed my trajectory. But they're also really tricky. Now for the sake of this video though, I am not going to get bogged down in pretty much any details. I'm going to talk from a pure practical sense about the strategy as I would run it so that you have an understanding from a pure practical application. There are going to",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 14,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=0"
    }
  },
  {
    "text": "sake of this video though, I am not going to get bogged down in pretty much any details. I'm going to talk from a pure practical sense about the strategy as I would run it so that you have an understanding from a pure practical application. There are going to be things that I'm going to say that are very specific. There's a reason why it is what it is. But I'm not going to go through the explanation for all of them because otherwise the video becomes very long and overwhelming to people. All that being said, if you have questions asked and I'm happy to explain why things are the way they are, I just don't want to overwhelm people. So we're not going to go through options 101. We're not going to go through what calls are, what puts are. All that stuff is available in my options 101 playlist. You can learn the basics there. This video is picking up from the sense that you have a general idea what an option is. And now you are looking to employ something in GameStop because it really is very, very applicable. And why is something like the strategy I'm going to talk about so applicable here? Well, it's because of two reasons. One, volatility and two, realize the volatility. That means because GameStop moves so much, it has high implied volatility. There are certain things that that benefits. Specifically, in this case, we're going to be talking",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 14,
      "start_timestamp": "00:01:04",
      "start_timestamp_seconds": 64.72,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=64"
    }
  },
  {
    "text": "strategy I'm going to talk about so applicable here? Well, it's because of two reasons. One, volatility and two, realize the volatility. That means because GameStop moves so much, it has high implied volatility. There are certain things that that benefits. Specifically, in this case, we're going to be talking about selling calls. And the other thing is realize volatility moves a lot. This means that you can kind of have your cake and eat it too. How so? Well, let's start with an example. The strategy that I'm going to cover is called a ratio covered call. And I have videos on the channel that goes into it in depth. You can check those out if you're interested. But again, high level. Ratio covered call takes the elements of a covered call and fixes what I consider to be the weaknesses. And let's take a look first at a covered call. So let's say that over the past three years, you've been buying into GameStop. Sometimes you buy it when it's up here at 24. You got a bunch of it when it's down here at 13. You've been scooping up a little bit. I don't know what the average GameStop holding is in terms of number of shares. So I'm picking something that I would consider to be probably realistic for people. And what I'm modeling is we have 500 shares at a basis of 2139. And this is using a pass through IRA accounts where everything's cash",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 14,
      "start_timestamp": "00:02:06",
      "start_timestamp_seconds": 126.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=126"
    }
  },
  {
    "text": "average GameStop holding is in terms of number of shares. So I'm picking something that I would consider to be probably realistic for people. And what I'm modeling is we have 500 shares at a basis of 2139. And this is using a pass through IRA accounts where everything's cash secured here. And you can see it takes about 14,000. So that's the position that I'm using as the base. That's the long equity part of the trade. Long shares. Lots of GameStop folks. Very familiar with that. Cool. Now a covered call. Typically a lures people because you have the ability to collect a credit up front. We're selling an option when you sell an option, you collect a premium. And remember that options work in 100 lot contracts. So when you see five here, this actually represents up to 500 shares. And when you see 1.87, this really is 187. So you have the ability to sell this call, have 187 times five hit your account up front. So that means if GameStop doesn't move at all, you essentially make this money. So how do you make this money from the passage of time? Part options benefit from price moving in their favor, from time to king away and volatility contracting. Those are the main things that are going to help you. Does have a slight interest rate input, but that's not overly applicable. So I'm not going to run down that rabbit hole. So a standard covered",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 14,
      "start_timestamp": "00:03:19",
      "start_timestamp_seconds": 199.24,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=199"
    }
  },
  {
    "text": "price moving in their favor, from time to king away and volatility contracting. Those are the main things that are going to help you. Does have a slight interest rate input, but that's not overly applicable. So I'm not going to run down that rabbit hole. So a standard covered call is where you sell one lot against each 100 shares you have at a one to one ratio. And what that means is if we have 500 shares, we would sell five calls against those shares. And notice what this does to your PNL, what you're looking at here is called a risk profile. It plots the return profile for a series of positions, legs, you can combine different stuff in here. So if we look at just the long stock, notice how it's essentially just a standard positive slope. And it's a one to one ratio. Each dollar GameStop goes up. You make a buck. Very clear. And this line here is the zero line. This is your break even. So this is where you actually break even at whatever our basis is 21 39 and you'll notice that what we're trading right now, obviously is a premium to that because GameStop as of today is like 2744. So you're making some money in this hypothetical scenario. Now if we get rid of the shares and just look at a short call, this is what it looks like. Notice how as the stock goes up, short calls have",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 14,
      "start_timestamp": "00:04:34",
      "start_timestamp_seconds": 274.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=274"
    }
  },
  {
    "text": "to that because GameStop as of today is like 2744. So you're making some money in this hypothetical scenario. Now if we get rid of the shares and just look at a short call, this is what it looks like. Notice how as the stock goes up, short calls have unlimited risk to the upside. And notice how as the stock goes down, short calls make money and they have a maximum profit potential. This is because your profit is going to be relegated to whatever the credit you receive is upfront. In this case, you'd get 935 bucks on five of the 42 calls. So what is the 42 mean? That's simply your strike price. So if we zoom this in now, so you can see more clearly, you'll notice that 42, there's a kink in the line. Why does that happen? Well, it's because up until your strike price, your options do not have enough short deltas to slow down the profit for your long shares. Because remember, in the beginning, this does not represent negative 500 delta. If you look over here on this column, where it actually shows you delta's one long share equals one delta, they're called delta one products because they're always one delta. They don't change. Then for options, they have a specific delta. So if we go to an options chain, and you notice that we go 45 days out in this example, and you look at the 42, it's a 28",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 14,
      "start_timestamp": "00:05:44",
      "start_timestamp_seconds": 344.32,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=344"
    }
  },
  {
    "text": "they're called delta one products because they're always one delta. They don't change. Then for options, they have a specific delta. So if we go to an options chain, and you notice that we go 45 days out in this example, and you look at the 42, it's a 28 delta 0.28. Again, options, you have to multiply it by 100. So it's 28 delta. So this means at the time of selling, you're for each one lot, you're getting 28 short deltas, not 528. Then you'll notice that is the options go further and further and further in the money, meaning in this case, the underlying goes up, your delta's get jacked up and they go higher and higher and higher. So what ends up happening is in the beginning, if we move these down to 100 shares, just to make it very, very simple. We have 100 shares, a total of 100 long delta's. At the beginning, you're short 28 delta's, right? You can see that down here, 28 delta's. So then as GameStop goes up, as we all hope it does, as it gets past your short strike, what ends up happening past your short strike is your delta's from the longs are canceled out by the delta's from your shorts, that a one to one. So you will then have negative 100 delta's here, 100 delta's here. They cancel each other out. You are now at max profit. This is the big problem with covered calls.",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 14,
      "start_timestamp": "00:06:56",
      "start_timestamp_seconds": 416.8,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=416"
    }
  },
  {
    "text": "your delta's from the longs are canceled out by the delta's from your shorts, that a one to one. So you will then have negative 100 delta's here, 100 delta's here. They cancel each other out. You are now at max profit. This is the big problem with covered calls. You're carrying unlimited downside risk, meaning you take the risk all the way down to zero, but you now have capped upside profit potential. So how do we fix this? Enter a ratio covered call. Notice how we have 500 long shares against five short calls. If we take this down just one, notice how we have 500 shares still in our short four calls. Notice what happened to this kink. It changed from being flat to now upward sloping. Now you might be asking what's the difference between the blue line, the purple line. The blue line shows us at expiration. The purple line shows us today. Why is there a difference? Because options expire over time. That's what this value in here is. Funny enough, when you sell an option, this is the value you capture. That's why you're selling it. You earn a little bit of this each time time passes. There's also some other inputs. If volatility contracts that decreases premiums, that would help you. The passage of time itself, theta is linear that you'll get each day no matter what. Then the extrinsic value split into two parts. There's theta, the actual time, and then",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 14,
      "start_timestamp": "00:08:08",
      "start_timestamp_seconds": 488.4,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=488"
    }
  },
  {
    "text": "each time time passes. There's also some other inputs. If volatility contracts that decreases premiums, that would help you. The passage of time itself, theta is linear that you'll get each day no matter what. Then the extrinsic value split into two parts. There's theta, the actual time, and then there's volatility. Those two components essentially equal this space here. So now, notice how by changing this ratio so that we have more long deltas or more long shares, then the total maximum short shares we would have. We now have upside profit potential. What this really means is you can be short up to 400 shares, but you're long 500. So that means you have 100 shares that are uncapped. So then the next question typically is, well, how many do you sell? Whatever you want. As long as it's less than one to one, you will have upside. It's a reflection of your expectations of price movement. Let's take a look at an example. Let's say that we think GameStop is going to go to 40 and I'll throw 40 down here. We can see that's your 40 line. Today, if it goes to 40 and you have, let's do the five lots to start, if it goes to 40 and you have your five lots, today it would be worth about 6,500 bucks at expiration. It'd be worth 10,000 to 15. Cool. Now let's change this and say maybe you did three at the same price level",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 14,
      "start_timestamp": "00:09:25",
      "start_timestamp_seconds": 565.2,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=565"
    }
  },
  {
    "text": "let's do the five lots to start, if it goes to 40 and you have your five lots, today it would be worth about 6,500 bucks at expiration. It'd be worth 10,000 to 15. Cool. Now let's change this and say maybe you did three at the same price level today. You would have 7,600 bucks at expiration. You would have 9,926 bucks. What do you notice as I cite those numbers? Well, you notice that you actually make more money in this scenario by having more short calls out. And it's because you're collecting more of a premium upfront. But what ends up happening eventually is if we get a big enough move, let's say that instead of 40, it runs to 60. Let's take a look at the scenario now. Those five short calls along with your shares would lead to a profit today of 9,300 bucks at expiration. It would be 11,240. If again, we change this down so that it's three at that same level. Now you make 13,303 today, 14,460 at expiration. You see the difference. So essentially, depending on where this short strike is, if price lands within that short strike, you would typically do better with more short calls. As price moves beyond the short strike, then you do better with less short calls so it really comes down to your preference. The way I think about it is the more short calls I sell upfront, the more money I collect upfront if",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 14,
      "start_timestamp": "00:10:46",
      "start_timestamp_seconds": 646.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=646"
    }
  },
  {
    "text": "do better with more short calls. As price moves beyond the short strike, then you do better with less short calls so it really comes down to your preference. The way I think about it is the more short calls I sell upfront, the more money I collect upfront if there's little or no movement or even a little bit of down movement. If the other scenario occurs, and I think that there's going to be a really big price movement, then maybe I take you were short calls, still collect some money upfront in case it goes down or sideways or what I think doesn't happen, but I'm not sacrificing a ton of upside potential. So the other thing I want to highlight is an artifact of GameStop's movements that I've noticed after studying it for some time. One of the big things is notice how it's very peaky. When it has these really big price movements, they tend to shoot up for a few days and then come back down. Shoot up for a few days, come back down. Now this recent movement is very different. It's been quite sustained. But there are ways that you can manage your short call position so that if you choose to sell at a higher ratio, let's say for contracts against your 500 shares and it starts to shoot up that you don't necessarily have to get out. You don't have to necessarily lose your shares. You are an important note,",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 14,
      "start_timestamp": "00:12:11",
      "start_timestamp_seconds": 731.76,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=731"
    }
  },
  {
    "text": "your short call position so that if you choose to sell at a higher ratio, let's say for contracts against your 500 shares and it starts to shoot up that you don't necessarily have to get out. You don't have to necessarily lose your shares. You are an important note, always at risk of early assignment, although very low probability. The probability of early assignment is very low. And there are things we can do to manage it. So we can talk a little bit more about that in a future video if you want the actual management of the strategy, different techniques you can use. But the main thing I want to introduce you to is this idea of a covered call to collect some premium in something that has high volatility that has long periods like every other stock where it trends sideways. You can benefit from that long volatility against the long shares that you hold anyway. It doesn't take any more capital whatsoever. There is a risk of early assignment, albeit very low and there are things you can do about it. And if you experience these big price movements and your short calls start to show a loss because that's exactly what happens as the member as the underlying goes up, you lose money on the short calls. But the reason why in aggregate, you make profit is because your long shares overwhelm the short calls. So there are some definitely caveats around what strikes",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 14,
      "start_timestamp": "00:13:13",
      "start_timestamp_seconds": 793.88,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=793"
    }
  },
  {
    "text": "show a loss because that's exactly what happens as the member as the underlying goes up, you lose money on the short calls. But the reason why in aggregate, you make profit is because your long shares overwhelm the short calls. So there are some definitely caveats around what strikes you would want to sell general ideas, make sure it's above whatever your basis is, the further up it is, the happier you will be because the higher your max profit would be. But we can get into all of those details in a future video if you'd like. The main thing I want you to take away from this is that you can sell options again shares. If you do it at a ratio, you can preserve more of your upside. Those people default to this at a one to one. And then it sucks when you see game stops start to rally up to beyond 80. You're there making 11,040, which is great. But in the other scenario, if you had just three contracts against it at that same scenario, you're making almost double at 18k and it just gets more pronounced the further up you go. As always, if you have any questions, let me know being outlier. I'll see you all later.",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 12,
      "total_chunks": 14,
      "start_timestamp": "00:14:14",
      "start_timestamp_seconds": 854.6,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=854"
    }
  },
  {
    "text": "always, if you have any questions, let me know being outlier. I'll see you all later.",
    "metadata": {
      "video_id": "zjtX1A0oR2I",
      "title": "Trading Options in Gamestop Pt1 - Ratio Covered Call Explained",
      "url": "https://www.youtube.com/watch?v=zjtX1A0oR2I",
      "upload_date": "",
      "duration": 923.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 13,
      "total_chunks": 14,
      "start_timestamp": "00:15:18",
      "start_timestamp_seconds": 918.64,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zjtX1A0oR2I&t=918"
    }
  }
]