[
  {
    "text": "What's up, outliers, apes, ape outliers. Today's all about GameStop. And it's because I want to one talk about where we are today. I want to recap what we've learned so far from analyzing all of our K's old trades. And then I want to talk to you about some analysis that I want to integrate into the Saturday live stream going forward because there's a lot that we have to do from my perspective in terms of what I'm trying to learn. So we have a lot to get through. And let's dive right in. So we'll first do quick current state analysis of GameStop, which is a little bit of a downtrend. It's been down five days in a row consecutively. And it's hovering right around 21 right now closed at 2090. One of the things I want to know is that there is a volume node that lives right in here at about 20 and a half. So to me, this looks like the next near term target. And then depending on how it behaves around that near term target, again, we'll see. And as always, I want to remind you, when I draw these lines, it's not pinpoint precision. Right? These are always kind of ranges. The way to think about when I draw a line like that is that it really represents this kind of zone. The reason for that is I'm using the width of the volume profile to determine where I think price",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 12,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0.0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=0"
    }
  },
  {
    "text": "not pinpoint precision. Right? These are always kind of ranges. The way to think about when I draw a line like that is that it really represents this kind of zone. The reason for that is I'm using the width of the volume profile to determine where I think price is likely to get stuck around. And if so, to what degree? Now if we take a look at small caps, small caps have been also trending down. So this just adds a little bit of overall pressure as far as I'm concerned to something like GameStop. Now there's one thing that I'm actually very excited about, which is if we take a look at the current open interest, these dries. There's 650,000 calls against just 284,000 puts. We're still seeing this huge skew, but it starts to get a little more interesting now. Because if we take a look across where a lot of this OI is, it's here in 18 October. That starts to get way more interesting because if we look at the overall exposure in 18 October, it's 273,000 calls against 92,000 puts. So we're actually starting to see a pretty stark contrast call put OI variance. And it's starting to look closer and closer in time. Now it's centralizing in 18 October, which is quite meaningful. Now in terms of overall options activity, there was a ton of calls traded today, 99,000. Again, 17,000 puts. Most of those calls were sold because they came in",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 12,
      "start_timestamp": "00:01:36",
      "start_timestamp_seconds": 96.09999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=96"
    }
  },
  {
    "text": "variance. And it's starting to look closer and closer in time. Now it's centralizing in 18 October, which is quite meaningful. Now in terms of overall options activity, there was a ton of calls traded today, 99,000. Again, 17,000 puts. Most of those calls were sold because they came in at the bid or below. And on the put side, a lot of those were bought 34. So bit of a mixed bag as far as I'm concerned with respect to today's overall activity, other than the fact that this is a ton of calls still that are moving. That is a whole whole lot of calls. Now looking across the volatility in the chains, I see really muted volatility literally across the entire board. Nothing is above 100. That is very rare. And in my opinion, this is one of those times where it just feels like a matter of time until something happens. And again, it's just because I eat not even earnings is over 100, which is rare for something like this. Normally, you can see exactly where earnings is because vol is elevated around that period. So I find how quiet volatility here is to be quite interesting. If we take a look at average daily ranges on the five days, 4, 20 days, 5, 90 days, 9.3. So obviously average daily range tightening up quite a lot. And then if we look at the average true range, that's also tightened up quite a lot as",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 12,
      "start_timestamp": "00:03:12",
      "start_timestamp_seconds": 192.19999999999996,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=192"
    }
  },
  {
    "text": "quite interesting. If we take a look at average daily ranges on the five days, 4, 20 days, 5, 90 days, 9.3. So obviously average daily range tightening up quite a lot. And then if we look at the average true range, that's also tightened up quite a lot as far as I can see. So 90 days was about 11.2. 20 days, 5.6. And then five days, 4.2. So this is if you picture Bollinger bands, they're getting tight. That's essentially all this is showing me in number formats, a little quicker for me to see. So that's that volume did tick up a little bit today. So the last two days before today, we had 4.6, 5.3. Now we are at 5.9. So almost six. That's a nice slight uptick in volume. I don't love the look of this candle because this is pretty much one-sided selling pressure most of the day. And we can see that represented 88 sale volume, no surprise there. And then a quick peak at RSI. It does show us rotating over the right now. It's red because it's crossing below the moving average of the RSI. And right now I'm using a seven day moving average for RSI. Both of them are negative sloping, so kind of negative overall oscillator presence here, which is just kind of a momentum indicator for me. Now let's take a quick look at the volume that we've seen. I want to look at two spots, the",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 12,
      "start_timestamp": "00:04:48",
      "start_timestamp_seconds": 288.29999999999995,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=288"
    }
  },
  {
    "text": "seven day moving average for RSI. Both of them are negative sloping, so kind of negative overall oscillator presence here, which is just kind of a momentum indicator for me. Now let's take a quick look at the volume that we've seen. I want to look at two spots, the first one. Looking at unusual whales, just sorting today by premium super quiet. We had one series of transactions out in 25 January 2025 for 100K, everything else is tiny. So there is really nothing to talk about in here. And then if we take a look at the dark pool really quick for GameStop, see if anything interesting was going on in here. And I'm going to sort this by premium as well. Overall it looks quiet. Yeah, very, very quiet. We only have one trade over a million. There's a handful, you know, several hundred thousand dollars worth, which is kind of standard fair. And then the other thing, just out of curiosity, we have to look and see if there's those 5,000 blocks. Again, that's more just out of curiosity. It's not because I think anything too highly about it. Let's drop five hundred five thousand in here. And there's still there. So we have much less, but I see one, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve, thirteen. So this leads into the next part of the analysis that I want to continue going forward. Because we had a really interesting conversation",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 12,
      "start_timestamp": "00:06:24",
      "start_timestamp_seconds": 384.3999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=384"
    }
  },
  {
    "text": "here. And there's still there. So we have much less, but I see one, two, three, four, five, six, seven, eight, nine, ten, eleven, twelve, thirteen. So this leads into the next part of the analysis that I want to continue going forward. Because we had a really interesting conversation during the live stream on Saturday about roaring kiddies, old trades, and then again, like piecing together what could have happened. Now there's one thing I have to be abundantly clear about. When I'm analyzing things, there are two buckets in my mind. There's the bucket of I can decisively prove this. That is true verifiable information. Then there's the bucket of I think this might be, but I can't directly prove it. And I know I can't prove it. But when I'm analyzing the cat's movements right now, as I go through the current state analysis of his trades, I am far more interested in this first bucket of what I know I can prove by looking at his yellow updates, by looking at movement and GME price. The reason why I care about that is because one of the giant theories we're trying to explore is RK's methodology. And did he find some sort of secret code that helps him predict movement? Because there's a ton of different variations out there around it. And all of it is we're not able to decisively prove it, but I want to see how close we can get because there's a",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 12,
      "start_timestamp": "00:08:00",
      "start_timestamp_seconds": 480.49999999999994,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=480"
    }
  },
  {
    "text": "And did he find some sort of secret code that helps him predict movement? Because there's a ton of different variations out there around it. And all of it is we're not able to decisively prove it, but I want to see how close we can get because there's a lot of information that alludes towards something leading like yes. But then there's also a lot of information again that leads to no. So for example, as we look through a lot of his old trades, one of the things that I find really, really interesting is how much the portfolio volatility actually is. And it makes a ton of sense, right? He calls it his yellow updates yellow. You expect a lot of volatility in a yellow play. So when I'm looking at stuff like this, I clearly can see that there's not a hyper-specific timing mechanism in this period. I want to emphasize this period because this is looking back at 2020 and 2021. And again, the reason why I don't think that there's a specific timing mechanism is because I can see the portfolio up here reaches 2.3 million and then it contracts down to 1.3 less than about two weeks later, right? Like if you have specific dates that you're playing something, you don't let your portfolio do that. And it's not out of the context of trying to make as much money as possible because I don't think that's our case ultimate motive here. But",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 12,
      "start_timestamp": "00:09:36",
      "start_timestamp_seconds": 576.5999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=576"
    }
  },
  {
    "text": "than about two weeks later, right? Like if you have specific dates that you're playing something, you don't let your portfolio do that. And it's not out of the context of trying to make as much money as possible because I don't think that's our case ultimate motive here. But I think in terms of playing the game and beating the game and adding as much pressure and being able to accumulate as much game stock stock is possible. You do that through more capital, right? So when I look at the ultimate motivating factor as far as it looks like in terms of him accumulating his stock position and stuff like that, you would want more money to do that. So then if you have some sort of really great timing tool, you wouldn't go through this kind of portfolio volatility because when you go down to 1.3 million, when you get back up here to 3.2, essentially, if you don't lose that million dollar, this 3.2 now can become three, well, four and a half or almost five because there's the compounding effect of that capital not going through drawdowns. So this is the old stuff. We're just now getting to his updated trades. And one, we're going through and reconstructed and we've already done this, reconstructed this entire block of positions that you see here, the 5 million shares, and then the 120,000 calls we can track all of them. We can see when they were entered,",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 12,
      "start_timestamp": "00:11:12",
      "start_timestamp_seconds": 672.6999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=672"
    }
  },
  {
    "text": "now getting to his updated trades. And one, we're going through and reconstructed and we've already done this, reconstructed this entire block of positions that you see here, the 5 million shares, and then the 120,000 calls we can track all of them. We can see when they were entered, what the cumulative premium was at the point in time that he was entering, what was game stopped price, we have all of that. So again, this is the first bucket. This is the stuff I can decisively track, prove, add up, do math and see. Now we have a really interesting scenario where I want to analyze, and this is part of the analysis I want to do on the next series, or the next session on Saturday, is I actually want to go through not just his old trades, but I've been purposefully going all the way back into 2023, starting here, and I'm going to go back further. But what I'm doing is I'm analyzing the trade behavior and the premium amounts around different moves in game stops. So if I slide this over here and I zoom this out further, we go out to three years daily. I can find different periods where game stops started rattling for different reasons, whether it's for earnings, whether it's kind of this post earnings gap, and I'm analyzing the stock movement in these periods. And what I want to see specifically is what kind of corresponding options activity was",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 12,
      "start_timestamp": "00:12:48",
      "start_timestamp_seconds": 768.7999999999998,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=768"
    }
  },
  {
    "text": "daily. I can find different periods where game stops started rattling for different reasons, whether it's for earnings, whether it's kind of this post earnings gap, and I'm analyzing the stock movement in these periods. And what I want to see specifically is what kind of corresponding options activity was there? Because one of the things people have said is like, oh, the options chains were dead before the cat came back. And I've heard that said, I don't know if it's true. So I want to go through and look and explore it and see what dead means. Because as I cursory flip through this, they're really not dead around a lot of these periods. So in our periods that I found where they're completely dead for like an entire month, the biggest trade is 80K in April of 23. But as soon as I see different kind of movement patterns and what I'm going to do is de-conflict by time, I'm going to see, are we seeing these options trades getting built out and then the move? Or are we starting to see signs of a move? Then options trades get built out. And I'm going to do this all the way back to 2021. So that's the next step in the analysis. I'm super excited because I am a giant fucking nerd and this stuff's so damn interesting to me. So I'm excited to see what we can learn as we go through all of these and",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 9,
      "total_chunks": 12,
      "start_timestamp": "00:14:24",
      "start_timestamp_seconds": 864.8999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=864"
    }
  },
  {
    "text": "this all the way back to 2021. So that's the next step in the analysis. I'm super excited because I am a giant fucking nerd and this stuff's so damn interesting to me. So I'm excited to see what we can learn as we go through all of these and track them discreetly like this here. Look at this. There's this was in June of 2023, the seventh of June. So then when I go in there and I look at that, I was like, okay, well, let me find the seventh of June in 2023. I have to squish this in a little bit. So it's easier. Let's go 2023 June. Here's the seventh. So this was an earnings play it looks like, gap down, but then it shot right back up out. So what I'm going to do is actually track not just the entrances for these trades, but I'm going to find the exits and see when we exited we being aware of this is and try to analyze some of this stuff because again, like around earnings here, this is hyperactive, relative to the timeframe to be clear, this is not dead in my opinion. There's still several million in options being traded throughout the month. Now again, this pales in comparison to when the cat came back with his war chest of hundreds of millions of dollars, but this is exactly what I want to explore because I'm so curious what these options change looked",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 10,
      "total_chunks": 12,
      "start_timestamp": "00:16:00",
      "start_timestamp_seconds": 960.9999999999999,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=960"
    }
  },
  {
    "text": "still several million in options being traded throughout the month. Now again, this pales in comparison to when the cat came back with his war chest of hundreds of millions of dollars, but this is exactly what I want to explore because I'm so curious what these options change looked like in different periods. So I've actually started exporting all of this data into Python so that I can do my standard manipulation a little bit easier, but then on the live stream will go through literally period by period just like that so that we can see because literally just because the shit's interesting. So that's my game plan. As always, anything you need, let me know, be an outlier and I will see you all to live stream. Catch you later.",
    "metadata": {
      "video_id": "zpbOftvWUBI",
      "title": "GME Stock Update & Options Analysis",
      "url": "https://www.youtube.com/watch?v=zpbOftvWUBI",
      "upload_date": "",
      "duration": 823.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 11,
      "total_chunks": 12,
      "start_timestamp": "00:17:37",
      "start_timestamp_seconds": 1057.0999999999997,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=zpbOftvWUBI&t=1057"
    }
  }
]