[
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 1,
    "total_chunks": 12,
    "text": "What's up, Allies? We're on the mobile setup right now. We're hanging out in Brooklyn. You guys probably can't see up the window. Maybe you can. But that's what it's looking like right now. Wasn't originally planning on doing a video today because I'm actually doing a live stream tomorrow with a few friends about GameStop specifically. But with the Fed announcement and then the market reaction that you see on the screen, a few people reach out asking if I could talk about what really what I think's going on and how this might look in absolutely because today was a big day. The couple things to note though. First and foremost, some people were being I considered a little hyperbolic with the language, you know, essentially saying that it's like a mass occur and stuff like that. It's okay to be loose with your terminology and to be hyperbolic as long as you understand what you're doing. And what I mean by that is like if you're a seasoned trader, you're comfortable and like you just like, you know, hyperbole, that's fine. But for a lot of newer traders, if you use stuff like that, it kind of primes your brain into thinking that it's like a massacre that it's like really terrible out there that everything is falling apart. And it starts to frame the way that you perceive information, which is actually kind of dangerous because today was a big day. And this was one of",
    "start_timestamp_seconds": 0.0,
    "start_timestamp": "00:00:00",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=0"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 2,
    "total_chunks": 12,
    "text": "primes your brain into thinking that it's like a massacre that it's like really terrible out there that everything is falling apart. And it starts to frame the way that you perceive information, which is actually kind of dangerous because today was a big day. And this was one of the larger intra day downloads that we've seen in spy for the last few years. There's no no debate about that. But all in context, right, like this isn't a black Monday. This isn't a COVID crash yet. And the context matters because there's obviously a ton of big bearish volume stepping in as you would expect. And if you've been hanging out in any of the live streams that we've done for the past, literally, I was looking at it as like 10 days that we've been talking about this internal rotation that we're seeing. And some of the stuff that I've shown you for that stems from things like this, right, where we look at the overall advancing into climbing issues highs and lows. And we look at the moving averages for these for different time frames. And this didn't like sneak up on anybody. Now, one of the things that's worth noting though is that what happened today. I mean, I didn't know that that was going to happen today. I had a suspicion that there was going to be a little bit more volatility. But what I'm more so pointing at is that there's been a",
    "start_timestamp_seconds": 62.0,
    "start_timestamp": "00:01:02",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=62"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 3,
    "total_chunks": 12,
    "text": "the things that's worth noting though is that what happened today. I mean, I didn't know that that was going to happen today. I had a suspicion that there was going to be a little bit more volatility. But what I'm more so pointing at is that there's been a lot of underlying market rotation going on that leads to us having to think about how to position risk. And we actually talked about this literally yesterday on the live stream about pairing down risk, not because I expected today to be terrible. I didn't know. But because I have to evaluate the market from a Bayesian statistical standpoint, which is I'm updating my mental model as new information comes in. And then I'm making an assessment. How much what's the probability of a X percent up move compared to what's the probability of a Y percent down move. And when the market starts getting to levels like this, you kind of have to favor the downside a little bit just because once you get to these parabolic highs, and then you come into news like this, even if the Fed executed perfectly, we probably wouldn't have seen an inverse positive move to the degree that we saw on a downside move, which wasn't even on terrible news. Essentially what happened today is the Fed did exactly what everybody thought the Fed was going to do, which is cut 25 basis points. Easy day. We all saw that coming from",
    "start_timestamp_seconds": 130.0,
    "start_timestamp": "00:02:10",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=130"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 4,
    "total_chunks": 12,
    "text": "positive move to the degree that we saw on a downside move, which wasn't even on terrible news. Essentially what happened today is the Fed did exactly what everybody thought the Fed was going to do, which is cut 25 basis points. Easy day. We all saw that coming from a mile away. Now the thing that started freaking the market out was the Fed is saying that they might be slowing down a little bit. And that is really important. And again, the interesting part about this is I'm shocked that anybody would have experienced this. Anybody would have expected any other news. I think a lot of us were originally expecting a pause after the first 50 Bips cut. So we have 50 Bips cut, which is opening heavy. Then we're coming up on this next cut that was moderate. And but both of those back to back typically wouldn't occur without a pause at some point. So I think the market now is trying to figure out when they think the pause might come and what that might look like. So we can grab that really quick and take a look at it together and see what the next cycle might look like. And this is really important to track by the way. So this is showing an overwhelming probability of a pause on Jan cycle. Now one of the things that I like to do is track how these trend over time for the various meetings",
    "start_timestamp_seconds": 199.0,
    "start_timestamp": "00:03:19",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=199"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 5,
    "total_chunks": 12,
    "text": "the next cycle might look like. And this is really important to track by the way. So this is showing an overwhelming probability of a pause on Jan cycle. Now one of the things that I like to do is track how these trend over time for the various meetings because it's really, really interesting to me. And we have to keep an eyeball now on the GM meeting and see how the probability of no cut, which is this green line right here, trends against the probability of a cut. And obviously the cut that it's showing right now is very, very small. It's showing the probability of 25 basis point cut. There is even a slight probability of a potential raise, which is super interesting. So I think the market is it sits now understood that this is over likely, overwhelmingly likely to be the case. And you're seeing the market now over reacting in my opinion to what ended up being what the Fed has been messaging, especially from the context of being cautious and stuff like that. The Fed has been very direct about that. So now if we take a quick look throughout the broad market, obviously we can see that the spy had a not insignificant down day. The cues had a slightly better day and then small caps really ran off a cliff. Vicks had a near parabolic climb. We saw bonds roll over a little bit more Bitcoin about flat one of",
    "start_timestamp_seconds": 267.0,
    "start_timestamp": "00:04:27",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=267"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 6,
    "total_chunks": 12,
    "text": "market, obviously we can see that the spy had a not insignificant down day. The cues had a slightly better day and then small caps really ran off a cliff. Vicks had a near parabolic climb. We saw bonds roll over a little bit more Bitcoin about flat one of the things that Bitcoin is reacting to and trying to digest is the feds relationship with Bitcoin and cryptocurrency at least as it sits today. And then across the sectors, this is the same thing we've been talking about literally for weeks now energy posting new lows on a three month time frame financials rolling over pretty heavy industrials over. Even the last bastion of strength that we've seen between discretionary and that's now showing some weakness. So literally across the board, there was very few things today that were showing any bit of strength. Now we'll talk about GameStop in a second here, but if we take a look at Nvidia, Nvidia was a really interesting case today where it actually gacked up and it was holding on pretty well and then it ended up down on the day. But this is relatively strong compared to a lot of the other stuff that we saw today and that's saying something that this is considered to be relative strength can't help but find that a bit interesting. So if we take a look at SPX, I want to show you the options chain here and SPX, I mean 3 like",
    "start_timestamp_seconds": 349.0,
    "start_timestamp": "00:05:49",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=349"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 7,
    "total_chunks": 12,
    "text": "the other stuff that we saw today and that's saying something that this is considered to be relative strength can't help but find that a bit interesting. So if we take a look at SPX, I want to show you the options chain here and SPX, I mean 3 like a pretty big day. And if we jump into the options chain here, up down to the bottom. I want to show you the near term expiration. So we can get rid of this. Let's go to the 20Ds and then let's look at the what do we want to do here. Let's take a look at the 17 jans and we can see that there's definitely heavier put OI, which is very common for these indices and whatnot that's not surprising to me at all. And let's take a look at the volume for today though. And the reason why I want to see this is, yeah, and this is kind of what I was expecting, just not excessive volume, which tells me that the market isn't over reacting to what we're seeing so far at least. It actually seems like the market to a degree had some ideas about what might happen. And then let's take a look at the out of the money, and we can see for the 20Ds, it's definitely elevated. Let's clear 20Ds out, look at 17 Jan and 21 Feb. And those look a little bit more normal, a bit heavy put skew",
    "start_timestamp_seconds": 424.0,
    "start_timestamp": "00:07:04",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=424"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 8,
    "total_chunks": 12,
    "text": "about what might happen. And then let's take a look at the out of the money, and we can see for the 20Ds, it's definitely elevated. Let's clear 20Ds out, look at 17 Jan and 21 Feb. And those look a little bit more normal, a bit heavy put skew on the 17 Jans, but not excessive. That's also going to be the case just because it's going to be a really active chain right now. So from an options perspective, there's not a lot in here that's like, this is crazy can't believe this. It looks about part of the course. We're still seeing some front wall here, and I anticipate that continuing until this gets priced in and we see what's going on futures are up a little bit right now. So futures aren't the unhappy group of the bunch, which is kind of interesting post post big days like this. A lot of times you'll actually see small futures reversals. I actually had a couple trades on in futures. It literally expecting these reversals because they tend to slow down after the market closes when they accelerate. That's when you know things are like really, really bad, which again isn't super common. Now let's take a look at what was shown strength today. If we pop up pop up pop up the percent gainers for today, we can see that what I like to do is look at the sectors that really pop up here. And I'm",
    "start_timestamp_seconds": 494.0,
    "start_timestamp": "00:08:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=494"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 9,
    "total_chunks": 12,
    "text": "which again isn't super common. Now let's take a look at what was shown strength today. If we pop up pop up pop up the percent gainers for today, we can see that what I like to do is look at the sectors that really pop up here. And I'm seeing a lot of information technology across the board, interesting actually seen tobacco showing up a little bit here. And I see a little bit of healthcare what you can do to make this easier is to actually filter it by the sector, but you can see it's mostly IT and then some healthcare and then there's a couple staples in here, but not much. So it's a bit of a mixed bag, but it is a much smaller cohort because I'm not even filtering by options, which is what I typically would overlay this with. And there's only a hundred and 19 names in here that are popping up with decent volume. This is filtering some stuff out. So there are elements of strength, but it's mostly looking like it's within IT. All right, so now let's take a quick look at GameStop because I was actually impressed with GameStop's movement today. And again, I know that this will be a bit of a bummer for a lot of people with it running above 30 and now it looks like it's closing down a little bit. That's, it's not ideal, but again, we have to take things in context.",
    "start_timestamp_seconds": 554.0,
    "start_timestamp": "00:09:14",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=554"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 10,
    "total_chunks": 12,
    "text": "GameStop's movement today. And again, I know that this will be a bit of a bummer for a lot of people with it running above 30 and now it looks like it's closing down a little bit. That's, it's not ideal, but again, we have to take things in context. And the context that we have right now is that the market is showing overall weakness. And this is a small cap showing at least a little bit of resilience around this congestion area. I think is again beneficial to it. This is a consolidation phase and this is normal. Stocks need to do this. What I didn't want to see today was a massive move down below some of these really what I would consider to be now in more important price levels. Because this is where consensus of price starts to show and people still think that this is a high 20 stock, which is really solid for where things sit now. Quick peak at the options chain and we still have incredible, incredible calls queue 840,000 calls against 286,000 puts so just not even close. The calls are still super active here. And again, what's interesting is that most of this is out in 17 jam. So now if we take a quick peak at unusual wheels and just see if there's any trades today that stick out to us. So we'll go to today. We'll have it calls and puts for now to start and let's",
    "start_timestamp_seconds": 623.0,
    "start_timestamp": "00:10:23",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=623"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 11,
    "total_chunks": 12,
    "text": "that most of this is out in 17 jam. So now if we take a quick peak at unusual wheels and just see if there's any trades today that stick out to us. So we'll go to today. We'll have it calls and puts for now to start and let's zoom this out a little bit. So premiums on today were definitely heavy. Not a lot of really massive trades, but a pretty fair number of trades that were going out and it looks like a mix of positions. We still have those 125s getting hit mostly on the put side. And if you recall, we actually had a pretty big load up on the put side not too long ago. Something to the tune of a million and change almost 2 million. So it wouldn't surprise me to see some of that being unwound here on this, this pretty big, pretty big down day. But the price levels that are holding on here are positive in my opinion as far as I'm concerned at least. I think the last thing I want to show you is if we take a look at a flash round of some of the more meme stock common stuff for today. So rocket labs was down 13 palantir was down 4 so really, really solid day for palantir holding in holding in on this. So this is something I think to keep an eyeball on when stuff like this shows a little bit more",
    "start_timestamp_seconds": 691.0,
    "start_timestamp": "00:11:31",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=691"
  },
  {
    "video_id": "ztzkZ6rc_JA",
    "title": "ztzkZ6rc JA",
    "url": "https://www.youtube.com/watch?v=ztzkZ6rc_JA",
    "upload_date": null,
    "duration": null,
    "channel_name": "",
    "description": "",
    "chunk_index": 12,
    "total_chunks": 12,
    "text": "more meme stock common stuff for today. So rocket labs was down 13 palantir was down 4 so really, really solid day for palantir holding in holding in on this. So this is something I think to keep an eyeball on when stuff like this shows a little bit more resilience compared to other things. Another one that's been interesting to watch is Ion Q and a bit of a down day today, not catastrophic though. And it's now at a point where again, my guess is some of this stuff will have a continuation. But this isn't that deep for all these different growth style names, which again, I think just bears that this is not the end of the world just yet, but it is time to pay attention. It's time to take a look at the risk, make sure you have what you want. So as always, anything want me to take a look at? Let me know, be an outlier. See you guys later.",
    "start_timestamp_seconds": 753.0,
    "start_timestamp": "00:12:33",
    "video_url_with_timestamp": "https://www.youtube.com/watch?v=ztzkZ6rc_JA&t=753"
  }
]