[
  {
    "text": "What's up, Alhairz? Quick market updates. There's not a whole lot going on, but a few things worth discussing as it sits today. Futures right now after the close are a little bit down across the board. Oil is up just a little bit. SP 500 is closing in on highs. It's at 60746. And three month highs right now and all time highs 609 for spy specifically cues. Finally, cracked highs on a three month time frame up to 530. IWM is bucking the trend. So we're seeing large caps and cues. Those two sectors themselves definitely showing strength and small caps rolling over. Interesting because there's a lot of speculation about the upcoming FOMC meeting. What that could look like as far as a rate cut. We'll take a look at that. And I think the markets is starting to price in what they're thinking could be happening. As per usual, it's a discounting mechanism, but I didn't really expect to see this level of weakness trailing off of 244. Now we're down hovering right around like 235 mid to 30s. That's a little bit low here. Vix is sub 14 so very low. Bonds are rolling back over. Bitcoin is comfortably hovering above 100,000 for the time being. We'll see how that continues to go. Cross the sectors. Still super strong energy. Still super not strong. Financials have definitely rolled over pretty significantly, not massively, but on a relative basis, industrials, same story technology is doing pretty",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 0,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "over. Bitcoin is comfortably hovering above 100,000 for the time being. We'll see how that continues to go. Cross the sectors. Still super strong energy. Still super not strong. Financials have definitely rolled over pretty significantly, not massively, but on a relative basis, industrials, same story technology is doing pretty well. So we do know within QQQ that it's the comm sector that's really driving that performance. And we can see discretionary. Still crushing. I have been following along with this for a while. I have a couple trades that are designed to continue to follow this momentum. And I keep waiting for the music to stop because I don't know why the music is playing at this point in discretionary. It's been so decoupled from staples, which is interesting. Not that they're one to one or anything just because they both have consumer in the name. Doesn't mean they're the same thing. They're not. But normally, they're a little more correlated than they've been. They're almost unlocked at this point, which I can't help but find that to be a little bit interesting. Now, if we grab the Fed watch tool, we can see that the current probabilities for a cut on the 18 D's meeting are 98.6. This is moved up massively. There's been so much pricing dislocation with respect to the expectation around this specific rate cut. It is not quite confounding but very interesting. The market normally is very persistent in its ability to sniff out",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 1,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "a cut on the 18 D's meeting are 98.6. This is moved up massively. There's been so much pricing dislocation with respect to the expectation around this specific rate cut. It is not quite confounding but very interesting. The market normally is very persistent in its ability to sniff out what it think may or may not happen. It's a collective interface of knowledge. But when you see these big kinds of changes, it tells that there's a lot of new information coming out that's causing people to change their opinions. So when you go from 65 probability of a cut a month ago to 98 probability of a cut, one as the event gets closer, we tend to become a little more certain because there's less information coming out likely to impact it. But it does show that there's a change in landscape. There's a change in information that leads to this. And for a while, the Fed has been messaging a slower, more pragmatic approach, not necessarily trying to jump the gun too far. A lot of people felt that they waited too long to start. Then when they started, a lot of people felt that they started too heavy with a 50 basis point cut compared to a quarter. And now it looks like we're targeting about a quarter point, which is what would be expected in terms of a cut if it was anything bigger than that. That means things are going very, very poorly. And",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 2,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "too heavy with a 50 basis point cut compared to a quarter. And now it looks like we're targeting about a quarter point, which is what would be expected in terms of a cut if it was anything bigger than that. That means things are going very, very poorly. And that would be not well received by the market as a whole. But the entire run up in small caps previously was due to a lot of the expectation around this rate cut. Now the rate cut seems near certain and small caps are rolling over. So that tells us again that there's more going on underneath the surface as per usual. And it's difficult to sniff it out. But it has me questioning a few things as it sets. We need to see how we roll out here. Let's grab the economic calendar really quick and see what we think might be coming up that could impact this. Obviously, CPI came in right around in line with expectations a little bit light, which is a pretty good thing. Actually, consensus was 31534 came at 31549. So light little excessive compared to the consensus in the forecast, but not by much at all and definitely lower than the prior. So that means is CPI is moving generally in the correct direction. And then tomorrow we have PPI coming out, which will be another really big release across the board. So I think the market is seeing a little bit of",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 3,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "much at all and definitely lower than the prior. So that means is CPI is moving generally in the correct direction. And then tomorrow we have PPI coming out, which will be another really big release across the board. So I think the market is seeing a little bit of weakness, but it does look like inflation is still generally holding steady here, which tends to bode well. So let's take a look at a couple stocks quick because there's a few that stuck out to me first and foremost. Here was a trade in Google that was interesting. If we take a look at Google, it had a blazing day, 5.5 move, and that doesn't sound like a lot of your use to growth stocks. But for something like this, that's a big look at the size of the candle compared to everything else, right? It tells you everything you need to know for an intraday move that's massive. Or something like Google. And I noticed when it was trading around 195 43, so very close to where we are now, I saw out in 13D, the 190 puts, there was a total volume transacted there at 43,000. The volume over OI there was massively different. So let's take a look at this. Let's go to 13Ds two days from now. And let's take a look at these 190 puts, which are just shy out of the money. Take a look at this. The OI on those prior was",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 4,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "volume over OI there was massively different. So let's take a look at this. Let's go to 13Ds two days from now. And let's take a look at these 190 puts, which are just shy out of the money. Take a look at this. The OI on those prior was 137. And the OI now is going to be 43,400 in change, a tremendous expansion. That's people expecting downside. That's why those puts are being open there. We can take a look at some of the transactions that led to that. But it looks like people are prospectively fading this pretty significant draw up move, which doesn't entirely surprise me, especially in something like Google. It's not necessarily a bet against the company thinking that it's going to crater or anything like that. But it is absolutely speculation that maybe it's run up a little bit heavy here. So let's take a look weird that game stops always in there. That's typically the default. But let's take a look at Google. And let's take a look at today. And let's see right now it should be sorting by premium, which we don't actually care about so much in this case. I want to look specifically at the Friday expiration. And I want to look specifically at those puts. Because we can get an idea of how those came through today. So let's take a look. We look like. Yeah, they were getting banged all day. Literally all day. And when",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 5,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "I want to look specifically at the Friday expiration. And I want to look specifically at those puts. Because we can get an idea of how those came through today. So let's take a look. We look like. Yeah, they were getting banged all day. Literally all day. And when we have these style moves, it doesn't really surprise me. Because people are going to play the short term price perceived price reversion. Price as a mean reverting phenomenon is a little more difficult to discuss and quantify. Because it doesn't actually have mean reversion tendencies like something like volatility. But it does have extensions and retracements. We can see those quantify those. So yeah, when I look at this, it does seem like a pretty big move. So it doesn't surprise me to see people fading them. But man, this was bit up really, really heavy. Those 190s, they came in super heavy. I just thought it was interesting. It doesn't lead me to believe that downside is immediately coming. But I also saw in Google, Google, the 13d 187 and a half puts those came in at 22,407. So that can also be people that are getting into puts just to lock in profits, which to short term though, that's the argument against that. Always interesting. The market always has a way to leading to very interesting movements that can be difficult to explain. Now, let's say look at SoFi. So if I had a good move today",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 6,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "puts just to lock in profits, which to short term though, that's the argument against that. Always interesting. The market always has a way to leading to very interesting movements that can be difficult to explain. Now, let's say look at SoFi. So if I had a good move today and with SoFi, I got close to a reentry. So I had exited. I talked about that a while ago. Just because it was rotating sideways, starting to fall down, but it's a little too early. I want to see it above that 1603 handle. That's just because I want to see that the consolidation is held. I want to see that then it's building a base price continuation. And I genuinely do expect to see that because it was bit up really heavy today. The volume was overwhelmingly by side. So it looks like people are interested in it, but you never know. And that's why I trade the way that I do, especially with directional momentum slash breakout following strategies that I would apply to something like this. It's a very, very different approach and it's depending entirely on what price actually does. It's very little. My expectations, I do apply probabilistic assessments because it helps me size, figure out what risk reward makes sense. But I need to see it behaving as it should in air quotes because how should something behave, but this I want it to go up. So that's why we are holding tight",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 7,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  },
  {
    "text": "I do apply probabilistic assessments because it helps me size, figure out what risk reward makes sense. But I need to see it behaving as it should in air quotes because how should something behave, but this I want it to go up. So that's why we are holding tight right now. No SoFi position, but looking. And if it looks like it can hold us rally, then it will be time for reentry. As always, if there's anything you want me to take a look at, let me know. Be an outlier. I'll see you all later.",
    "metadata": {
      "video_id": "ZWGDFQTvBb8",
      "title": "Stock Market Update - GOOGL & SOFI Analysis",
      "url": "https://www.youtube.com/watch?v=ZWGDFQTvBb8",
      "upload_date": "",
      "duration": 604.0,
      "channel_name": "",
      "description": "",
      "content_summary": "",
      "chunk_index": 8,
      "total_chunks": 9,
      "start_timestamp": "00:00:00",
      "start_timestamp_seconds": 0,
      "video_url_with_timestamp": "https://www.youtube.com/watch?v=ZWGDFQTvBb8&t=0"
    }
  }
]