[
  {
    "text": "The Fed Has to Keep Tightening Until Things Get Worse High inflation and an extremely tight labor market leave the Fed with little choice but to tighten until the economy and markets weaken, setting up as bad an environment for financial assets as we have seen. SEPTEMBER 22, 2022 LARRY COFSKY ALBERT CHEN © 2022 Bridgewater Associates, LP",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 6,
    "chunk_index": 0,
    "word_count": 58,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "Get Worse High inflation and an extremely tight labor market leave the Fed with little choice but to tighten until the economy and markets weaken, setting up as bad an environment for financial assets as we have seen. SEPTEMBER 22, 2022 LARRY COFSKY ALBERT CHEN © 2022 Bridgewater Associates, LP W ednesday’s FOMC meeting—in which the Fed raised rates another 75bps, increased its forecast for peak interest rates to 4.6%, and signaled that it would tighten as much as it takes to bring down inflation—highlights that this cycle will be managed more aggressively than what investors are used to because inflation is already at extreme levels. From the mid-1980s until recently, the Fed tightened proactively and inflation stayed relatively low and stable. This allowed the Fed the luxury of time, so it could take a cautious approach to tightening and see how conditions played out. With core inflation still north of 6%, unemployment at 3.7%, and a record number of unfilled jobs, the Fed is now playing catch-up, and the policy risk facing it is asymmetric—it needs to tighten a lot and can’t afford to underdeliver or back down too early. This means that, at least in the near term, the Fed is unlikely to welcome any easing of financial conditions, either from lower interest rates or higher equity prices, that reduces downward pressure on the real economy and prices. Chair Powell made it clear that the Fed will not make the mistake of ending the tightening prematurely—and acknowledged that this will not be a painless process. While we think the tightening so far (and what the Fed is priced to deliver in the near future) is getting closer to what it will take to slow the economy and rein in inflation, the thing we feel most confident about is this: today is about as bad an environment for financial assets as we have seen. We don’t see stocks as pricing in the economic pain that we and Chair Powell think it will take to bring inflation down. Until this happens or the economy slows materially—which the Fed likely won’t be sure of for some time—we don’t see room for rates to fall. USA Core CPI Inflation (6m, Ann) USA Labor Market Supply vs Demand Start of Rate Hikes Unemployment Job Openings Est 7% 10% With inflation too high and the 6% 9% labor market too tight, the Fed is chasing conditions 5% 8% 7% 4% 6% 3% 5% 2% 4% 1% 3% 0% 2% 1990 2000 2010 2020 1980 1990 2000 2010 2020 © 2022 Bridgewater Associates, LP 1",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 6,
    "chunk_index": 1,
    "word_count": 430,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "Job Openings Est 7% 10% With inflation too high and the 6% 9% labor market too tight, the Fed is chasing conditions 5% 8% 7% 4% 6% 3% 5% 2% 4% 1% 3% 0% 2% 1990 2000 2010 2020 1980 1990 2000 2010 2020 © 2022 Bridgewater Associates, LP 1",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 6,
    "chunk_index": 2,
    "word_count": 50,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "USA 60/40 Portfolio Drawdown USA 60/40 Portfolio Drawdown July FOMC Jackson Hole 0% 0% -5% -3% -10% -5% -15% -8% -20% -10% -25% -13% -30% This year’s financial asset Markets didn’t take the Fed’s -15% -35% sell-off is large versus those of fight against inflation seriously the last decade, but still small -40% following the July FOMC -18% when compared to other fights meeting, and the Fed pushed with inflation -45% back at Jackson Hole -20% 1960 1980 2000 2020 Jul-21 Jan-22 Jul-22 Jan-23 60/40 = approximately 60% stocks, 40% bonds There Is a Lot of Tightening Priced In and the Liquidity Hole Is Getting Bigger, but the Fed Is Likely to Stay the Course Until It Gets What It Wants So far this year, the Fed has rapidly raised short rates from zero and transitioned aggressively from QE to QT. This big swing in policy will eventually slow down the real economy via tightening financial conditions, but with inflation so far away from target and with the lessons of the 1970s on the Fed’s mind, it will need to see convincing evidence that it is nearing its goals before it turns toward easing. We think this will only come via clear and repeated signs of relief on inflation or through a big sell-off in financial assets that would unambiguously signal the kind of weakening in the real economy that will bring down inflation. Neither seems forthcoming unless conditions, either real or financial, get worse. Fed Funds Rate Fed QE (%GDP) Fwd Pricing Fed Guidance 15% 8% 10% 6% 5% 4% 0% 2% 0% -5% 1990 2000 2010 2020 2010 2015 2020 © 2022 Bridgewater Associates, LP 2",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 6,
    "chunk_index": 3,
    "word_count": 278,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "economy that will bring down inflation. Neither seems forthcoming unless conditions, either real or financial, get worse. Fed Funds Rate Fed QE (%GDP) Fwd Pricing Fed Guidance 15% 8% 10% 6% 5% 4% 0% 2% 0% -5% 1990 2000 2010 2020 2010 2015 2020 © 2022 Bridgewater Associates, LP 2",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 6,
    "chunk_index": 4,
    "word_count": 50,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "Confidence That Imbalances in the Labor Market Are Easing and Inflation Is Falling Enough Will Take Time In previous research, we’ve written about how the labor market is still much too tight and inflationary pressures much too broad for the Fed to pivot anytime soon. On Wednesday, Chair Powell reiterated that the Fed will need to “achieve a period of growth below trend and also some softening of labor market conditions” to get to its goals, and we think this “period” of weak growth could be longer and the “softening” more painful than markets seem to. There is a material supply/demand imbalance in the labor market, which is driving wage growth and putting inflationary pressures on the economy. These pressures can only be resolved by weaker growth, but it’s impossible to say precisely how much worse growth needs to get. We think this uncertainty will make the Fed reluctant to pivot until inflation is clearly falling, an outcome that will only become evident with a lag. USA Wage Growth and Services Inflation (6m, Ann) Recessions Wage Growth Services Inflation 14% Stubbornly high wages anchored Historically, it’s 12% inflation in the taken a recession 1970s to durably slow 10% the pace of wage growth 8% 6% 4% 2% 0% -2% 1960 1970 1980 1990 2000 2010 2020 Atlanta Fed Wage Tracker (Y/Y) Atlanta Fed Wage Tracker: Job Switchers (Y/Y, 3mma) Non-Smoothed Smoothed (3mma) Job Stayers Job Switchers 9% 9% Historically large wage 8% 8% premium for switching jobs suggests wage 7% 7% pressures remain strong Sticky above 6% 6% 6% 5% 5% 4% 4% 3% 3% 2% 2% 1% 1% 0% 0% 1990 1995 2000 2005 2010 2015 2020 1990 1995 2000 2005 2010 2015 2020 © 2022 Bridgewater Associates, LP 3",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 6,
    "chunk_index": 5,
    "word_count": 291,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "8% 8% premium for switching jobs suggests wage 7% 7% pressures remain strong Sticky above 6% 6% 6% 5% 5% 4% 4% 3% 3% 2% 2% 1% 1% 0% 0% 1990 1995 2000 2005 2010 2015 2020 1990 1995 2000 2005 2010 2015 2020 © 2022 Bridgewater Associates, LP 3",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 6,
    "chunk_index": 6,
    "word_count": 50,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "Financial Markets Remain Too Optimistic About the Growth Outlook—Which Is Not Helping the Fed With conditions in the real economy unlikely to support a Fed pivot anytime soon, the only other shoe that could drop would be a big tightening in financial conditions—one clearly large enough to trigger the Fed’s desired growth slowdown. While markets, on Fed guidance, have priced in the Fed’s rate tightening ahead of actual hikes, they have yet to price in any real growth slowdown and continue to see a pivot to persistently tighter policy as unlikely. In other words, the change in rates has done most of the tightening so far, with no help from changing expectations for growth. USA Equities Excess Returns (Indexed to EoY 2021) Ex-Discount Rate Impact USA High-Yield CDX Spread Rates are responsible 10% Spreads are biased for most of the equity toward a continuation 1,750 sell-off this year 5% of easy policy 1,500 0% 1,250 -5% 1,000 -10% 750 -15% 500 -20% 250 -25% Sep-21 Jan-22 May-22 Sep-22 2005 2010 2015 2020 And while the sell-off in equities, bonds, and spreads will eventually flow through to the real economy, with conditions so far from target, we think the Fed will need to see more before it becomes convinced that financial conditions have tightened enough to return inflation to 2%. This year’s sell-off in financial assets is large relative to what markets have experienced over the past decade, but much larger ones have typically been required to cause the Fed to pivot when inflation is this far above target. © 2022 Bridgewater Associates, LP 4",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 6,
    "chunk_index": 7,
    "word_count": 264,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "to return inflation to 2%. This year’s sell-off in financial assets is large relative to what markets have experienced over the past decade, but much larger ones have typically been required to cause the Fed to pivot when inflation is this far above target. © 2022 Bridgewater Associates, LP 4",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 6,
    "chunk_index": 8,
    "word_count": 50,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "Important Disclosures and Other Information This research paper is prepared by and is the property of Bridgewater Associates, LP and is circulated for informational and educational purposes only. There is no consideration given to the specific investment needs, objectives or tolerances of any of the recipients. Additionally, Bridgewater’s actual investment positions may, and often will, vary from its conclusions discussed herein based on any number of factors, such as client investment restrictions, portfolio rebalancing and transactions costs, among others. Recipients should consult their own advisors, including tax advisors, before making any investment decision. This report is not an offer to sell or the solicitation of an offer to buy the securities or other instruments mentioned. Bridgewater research utilizes data and information from public, private and internal sources, including data from actual Bridgewater trades. Sources include, Arabesque ESG Book, Bloomberg Finance L.P., Bond Radar, Candeal, Capital Economics, CBRE, Inc., CEIC Data Company Ltd., Clarus Financial Technology, Conference Board of Canada, Consensus Economics Inc., Corelogic, Inc., Cornerstone Macro, Dealogic, DTCC Data Repository, Ecoanalitica, Empirical Research Partners, Entis (Axioma Qontigo), EPFR Global, Eurasia Group, Evercore ISI, Factset Research Systems, The Financial Times Limited, FINRA, GaveKal Research Ltd., Global Financial Data, Inc., Harvard Business Review, Haver Analytics, Inc., Institutional Shareholder Services (ISS), The Investment Funds Institute of Canada, ICE Data, ICE Derived Data (UK), Investment Company Institute, International Institute of Finance, JP Morgan, MarketAxess, Medley Global Advisors, Metals Focus Ltd, Moody’s ESG Solutions, MSCI, Inc., National Bureau of Economic Research, OAG Aviation, Organisation for Economic Cooperation and Development, Pensions & Investments Research Center, Refinitiv, Rhodium Group, RP Data, Rystad Energy, S&P Global Market Intelligence, Sentix Gmbh, Shanghai Wind Information, Sustainalytics, Swaps Monitor, Totem Macro, Tradeweb, United Nations, US Department of Commerce, Verisk Maplecroft, Visible Alpha, Wells Bay, Wind Financial Information LLC, Wood Mackenzie Limited, World Bureau of Metal Statistics, World Economic Forum, YieldBook. While we consider information from external sources to be reliable, we do not assume responsibility for its accuracy. The views expressed herein are solely those of Bridgewater as of the date of this report and are subject to change without notice. Bridgewater may have a significant financial interest in one or more of the positions and/or securities or derivatives discussed. Those responsible for preparing this report receive compensation based upon various factors, including, among other things, the quality of their work and firm revenues. © 2022 Bridgewater Associates, LP 5",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 6,
    "chunk_index": 9,
    "word_count": 399,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  },
  {
    "text": "notice. Bridgewater may have a significant financial interest in one or more of the positions and/or securities or derivatives discussed. Those responsible for preparing this report receive compensation based upon various factors, including, among other things, the quality of their work and firm revenues. © 2022 Bridgewater Associates, LP 5",
    "title": "The Fed Has to Keep Tightening Until Things Get Worse",
    "source_type": "pdf",
    "document_id": "f94a7cd8e333",
    "source_file": "20221009.IF.FedTightening.Bridgewater.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 6,
    "chunk_index": 10,
    "word_count": 50,
    "author": "Bridgewater Associates LP",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20221003112924-05'00'",
    "duration": null
  }
]