[
  {
    "text": "50 Years in PEAD Research Marek Sojka, PhD Bonum Quant Research Oxford, United Kingdom 25th November 2018 Abstract Analysing earning’s predictive power on stock returns was in the heart of academic research since late 60’s. First introduced to academic world in 1967 during seminar “Analysis of Security Prices” by Chicago University Professors Ray Ball and Philip Brown. In the next four decades was extensively analysed by many academics and is now a well-documented anomaly and is referred to as Post Earnings Announcement Drift (PEAD). This phenomenon is still at the centre of academic research because it stands at odds with efficient market hypothesis which assumes that all information is instantaneously reflected in stock prices. Professional investors are also closely looking at PEAD as it implies that it is easy to beat the market average by simply ranking stocks based on their earnings surprise and investing in the top decile, quintile or quartile and shorting the bottom part. Academic evidence shows that this strategy produces an abnormal return of somewhere between 2.6% and 9.37% per quarter, according to various authors. In this paper I will present existing evidence supporting and contradicting “PEAD”, the history of academic research in that field and various techniques used to verify the phenomenon. The paper is organised as follows: first the history of the PEAD academic research is presented, in the second more recent evidence and research techniques used by authors are presented and finally conclusions and various critics of PEAD are shown. Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 69,
    "chunk_index": 0,
    "word_count": 252,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "used to verify the phenomenon. The paper is organised as follows: first the history of the PEAD academic research is presented, in the second more recent evidence and research techniques used by authors are presented and finally conclusions and various critics of PEAD are shown. Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 69,
    "chunk_index": 1,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "The first who spotted the phenomenon were Ball and Brown (1968) who were examining the meaning of net income number for investors in general. They found that about half of all the information issued by a firm during a year is captured by the income number. They assume that capital markets are efficient and therefore should adjust to any new valuable information quickly without leaving any opportunity to earn abnormal returns in subsequent periods. Based on this assumption they prove that market prices adjust according to announced net income numbers in line with magnitude of increase/decrease in net income. In their research they looked for the amount of new information conveyed by the income number, so they divided the income number to two parts: the expected part and unexpected part. Investors should react to the unexpected income part and adjust the stock price accordingly but should not react to part of income that was expected. Their research was focused on annual income numbers, they concluded that over half of all the individual information regarding a company is included in income number and that 85%- 90% of the content of the annual income number is captured by other media, most notably quarterly earnings reports. The value of information conveyed by annual income numbers is only about 20% of the value of all information coming to the market in the month the report is released. They treat this as a proof of market efficiency, as investors turned their attention away from annual reports to other information that was more useful in analysing company’s future financial earning power. Table 1 shows how much information regarding period’s earnings is reflected in stock prices in the year of announcement which supports their hypothesis of usefulness of income numbers, but the more intriguing fact was that stock prices drifted in the direction of earnings for another 6 months after annual report announcement. This phenomenon was left unanswered and for further academic research. Since their discovery, there were many academic research efforts (described below) that proved beyond doubt exitance of stock price drift after earnings announcement. Fama (1998) himself a proponent of efficient market hypothesis acknowledged that the existence of the Post Earnings Announcement Drift is beyond suspicion and as he states: “has survived robustness checks and extension to more recent data.” Lev and Ohlson (1982) describe the evidence of PEAD as: “the most damaging to the naïve and unwavering belief in market efficiency”. 2 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 69,
    "chunk_index": 2,
    "word_count": 413,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the Post Earnings Announcement Drift is beyond suspicion and as he states: “has survived robustness checks and extension to more recent data.” Lev and Ohlson (1982) describe the evidence of PEAD as: “the most damaging to the naïve and unwavering belief in market efficiency”. 2 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 69,
    "chunk_index": 3,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Table 1 Summary statistics by month relative to annual report announcement date Month rel to Regression model Naïve model annual report Net Income EPS EPS Total announcement sample date (1) (2) (3) (1) (2) (3) (1) (2) (3) -11 1.006 .992 16.5 1.007 .992 20.4 1.006 .989 24.1 1.000 -10 1.014 .983 17.3 1.015 .982 20.2 1.015 .972 73.4 .999 -9 1.017 .977 7.9 1.017 .977 3.7 1.018 .965 20.4 .998 -8 1.021 .971 9.5 1.022 .971 12.0 1.022 .956 9.1 .998 -7 1.026 .960 21.8 1.027 .960 27.1 1.024 .946 9.0 .995 -6 1.033 .949 42.9 1.034 .948 37.6 1.027 .937 19.4 .993 -5 1.038 .941 17.9 1.039 .941 21.3 1.032 .925 21.0 .992 -4 1.050 .930 40.0 1.050 .930 39.5 1.041 .912 41.5 .993 -3 1.059 .924 35.3 1.060 .922 33.9 1.049 .903 37.2 .995 -2 1.057 .921 1.4 1.058 .919 1.8 1.045 .903 0.1 .992 -1 1.060 .914 8.2 1.062 .912 8.2 1.046 .896 5.7 .991 0 1.071 .907 28.0 1.073 .905 28.9 1.056 .887 35.8 .993 1 1.075 .901 6.4 1.076 .899 5.5 1.057 .882 9.4 .992 2 1.076 .899 2.7 1.078 .897 1.9 1.059 .878 8.1 .992 3 1.078 .896 0.6 1.079 .895 1.2 1.059 .876 0.1 .991 4 1.078 .893 0.1 1.079 .892 0.1 1.057 .876 1.2 .990 5 1.075 .893 0.7 1.077 .891 0.1 1.055 .876 0.6 .989 6 1.072 .892 0.0 1.074 .889 0.2 1.051 .877 0.1 .987 (1) – Abnormal Performance Index – firms and years positive error (2) – Abnormal Performance Index – firms and years negative error (3) – Chi-square statistic Source: Ball and Brown (1967) page 170 After Ball’s and Brown’s puzzling discovery many academics undertook research to broaden the knowledge of market reaction to unexpected earnings announcements. Jones and Litzenberger (1970) conducted an empirical test to find if investors indeed do not price the unexpected earnings immediately after announcement. They calculated the expected quarterly earnings level based on a linear regression model for 8 consecutive quarters prior to earnings announcement. They looked at the performance of those stocks in years 1962-1967. Their definition of unexpected earnings was defined as more than 1.5 standard deviations apart from the expected level. They observed only performance of the stocks that met that definition and used a six-month holding period return starting at the end of the tenth quarter, because it was the month when most companies reported their earnings. The authors found that 211 stocks that beat their expected earnings by more than 1.5 standard deviations in the observed period returned on average 17.5% over the subsequent 6 months period comparing to 5.3% for the S&P Index. They also pointed to the fact that the average beta in their portfolio was 1.4 and the risk adjusted return was 10.7%. On the other side, they found that the performance of the group of stocks that announced earnings more than 1.5 standard deviations below expectations did not differ from the index performance. They conclude that the upward price drift does exist, but the downward drift is non-existent probably due to the fact that the price adjustment is quicker after profit announcement. 3 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 69,
    "chunk_index": 4,
    "word_count": 525,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "earnings more than 1.5 standard deviations below expectations did not differ from the index performance. They conclude that the upward price drift does exist, but the downward drift is non-existent probably due to the fact that the price adjustment is quicker after profit announcement. 3 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 69,
    "chunk_index": 5,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Seven years later Jones revisited the PEAD test together with Latane (Latane and Jones (1977)). They looked at data in the period 1971-1974 and ranked stocks based on Standardized Unexpected Earnings (SUE) based on estimated earnings calculated as seasonally adjusted earnings extrapolated from 20 prior quarters. They ranked the stocks based on “SUE” and calculated three months holding period returns. The authors found that the spread between highest and lowest “SUE” portfolio was 9.74% in a quarter if purchased at the end of the month of “SUE” announcement, they also found that the spread is positive even if the portfolio is constructed 5 months after the profit announcement. Table 2 Spread between highest and lowest SUE ranked stock portfolios, by quarter SUE T-1 T T+1 T+2 T+3 T+4 T+5 Quarter 2 .186 0.156 .043 -.001 .028 .067 .061 1971 3 .109 .161 .222 .231 .150 .127 .056 4 .169 .127 .086 .089 .086 .101 .070 1 .067 .080 .060 .063 .043 .029 .017 2 .151 .144 .070 .059 .038 .002 .029 1972 3 .125 .086 .039 .092 .101 .076 .163 4 .078 .062 .151 .167 .150 .083 .023 1 .119 .136 .043 .051 .060 .087 .143 2 .120 .101 .100 .125 .179 .126 .062 1973 3 .272 .251 .099 .019 -.043 .038 .018 4 .149 .073 .138 .078 .064 .082 .159 1974 1 .042 .043 .103 .188 .118 .229 .179 2 .146 .083 .109 .126 .075 -.004 .010 Mean .1332 .1260 .0974 .0982 .0807 .0757 .0762 S.D. .0583 .0570 .0513 .0584 .0600 .0669 .0624 Mean 4th Q .133 .087 .0125 .111 .100 .088 .084 Source: Latane and Jones (1977) page 1459 In conclusions they state that the data analysed suggests excess returns are significantly related to unexpected earnings announcement and the market adjustment to unexpected earnings is slow because the unexpected earnings themselves are significantly serially correlated. In the same year, Foster (1977) examined 69 firms in the period 1946-1974 to look into earnings prediction models and time series properties of earnings. Although his research was focused on earnings prediction models, he also looked into market earnings expectations and market reaction to announced earnings. He found that quarterly earnings can be estimated using two component model using time series regression and earnings seasonality. He also acknowledged the fact that unexpected earnings are associated with risk-adjusted returns 60 trading days after profit announcement from and including the day of publication. He assessed 6 earnings prediction models and found that his “Model 5” has highest statistical significance in predicting quarterly earnings and also has the highest statistical significance (measured by Chi- 4 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 69,
    "chunk_index": 6,
    "word_count": 435,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "returns 60 trading days after profit announcement from and including the day of publication. He assessed 6 earnings prediction models and found that his “Model 5” has highest statistical significance in predicting quarterly earnings and also has the highest statistical significance (measured by Chi- 4 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 69,
    "chunk_index": 7,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "squared) in predicting risk adjusted returns. His “Model 5” consists of three elements, quarterly earnings 4 quarters ago, earnings trend based on last quarterly earnings and seasonal earnings trend based on historical data. The other four models were simpler in their nature: “Model 1” assumed that the best estimator for quarterly profit is quarterly profit announced four quarters ago, “Model 2” was a refined version of “Model 1”, it assumed that the best estimator of quarterly profit is the profit four quarters ago plus “drift term” defined as average change of profit in that quarter. “Model 3” and “Model 4” were based on assumption that earnings seasonality is not significant, and the best estimators of quarterly profits are based on quarterly profits announced last quarter (“Model 3”) and profits one quarter ago adjusted by the same “drift term” (“Model 4”), Table 3 shows his calculations. CAR is the cumulative average residual return. Surprisingly his calculations show that the strongest market reaction is not only on the publication date, but also one day prior to report announcement. Table 3 Cumulative Average Residual for trading days surrounding quarterly earnings announcement Trading Days All 4 Quarters First Quarter Second Quarter Third Quarter Fourth Quarter Surrounding Comp Chi2 Comp Chi2 Comp Chi2 Comp Chi2 Comp Chi2 Announceme CAR CAR CAR CAR CAR nt -20 .0004 7.07 .0005 5.05 0.009 3.27 .0006 1.82 -.0002 0.00 -15 .0017 0.85 .0030 0.24 .0025 0.00 .0034 0.44 -.0022 2.96 -10 .0041 1.65 .0075 0.50 .0025 1.27 .0059 1.82 .0003 4.66 -9 .0040 0.96 .0074 1.33 .0020 0.88 .0062 1.60 .0005 0.83 -8 .0045 1.12 .0081 0.01 .0029 0.38 .0065 1.20 .0007 0.27 -7 .0048 0.49 .0081 1.22 .0022 0.24 .0076 1.67 .0010 0.50 -6 .0059 8.60 .0087 0.70 .0036 1.85 .0091 7.09 .0020 0.95 -5 .0062 0.79 .0088 1.01 .0033 2.82 .0092 0.14 .0037 1.56 -4 .0072 4.26 .0102 2.30 .0048 5.92 .0101 0.00 .0038 0.01 -3 .0075 1.05 .0110 2.31 .0058 1.64 .0099 0.86 .0031 0.02 -2 .0082 8.90 .0115 3.12 .0074 2.71 .0110 3.42 .0031 0.41 -1 .0124 55.08 .0148 8.09 .0120 23.85 .0156 14.63 .0073 10.43 0 .0162 66.87 .0184 23.35 .0166 12.15 .0197 23.69 .0104 9.99 1 .0168 3.81 .0188 1.57 .0170 0.72 .0204 0.11 .0109 4.52 2 .0170 0.91 .0192 1.80 .0171 0.51 .0212 2.25 .0103 2.42 3 .0170 0.17 0.201 1.97 .0163 1.70 .0216 0.11 .0099 0.35 4 .0173 1.31 .0210 0.35 .0161 0.00 .0215 0.34 .0107 1.10 5 .0169 4.93 .0210 0.25 .0152 0.08 .0211 6.10 .0100 1.31 6 .0169 0.34 .0210 0.08 .0153 0.13 .0209 0.49 .0101 0.02 7 .0169 0.35 .0209 0.20 .0149 0.09 .0217 1.61 .0101 0.02 8 .0174 5.67 .0216 0.94 .0134 3.12 .0233 12.93 .0113 4.16 9 .0176 0.51 .0219 0.05 .0135 0.17 .0233 0.31 .0116 1.05 10 .0178 2.86 .0218 0.29 .0148 2.04 .0229 1.12 .0117 0.20 15 .0183 0.09 .0215 0.13 .0169 0.13 .0235 2.14 .0111 0.58 20 .0189 0.29 .0201 0.20 .0192 2.78 .0242 0.39 .0122 0.01 Source: Foster (1977) page 17 After discovering the stock price drift after quarterly earnings announcement in 1968, Ball (1978) devoted his research to explaining this puzzling discovery. He states that literature reveals 5 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 69,
    "chunk_index": 8,
    "word_count": 532,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "0.58 20 .0189 0.29 .0201 0.20 .0192 2.78 .0242 0.39 .0122 0.01 Source: Foster (1977) page 17 After discovering the stock price drift after quarterly earnings announcement in 1968, Ball (1978) devoted his research to explaining this puzzling discovery. He states that literature reveals 5 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 69,
    "chunk_index": 9,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "consistent excess return after earnings announcement, which is not explained by market equilibrium models, he asserts that the profit variable may be a proxy for an omitted risk measure. In his article, Brown contemplates various explanations for observed price drift. He looks into research details of the academic research and points to information processing cost, transaction costs and research design flaws as suspected explanations. He finds that previous research used flawed assumption about the announcement day, assuming that all the profits are available at the end of the second or third month of the next quarter, as detailed evidence suggests This assumption is not true and may seriously impede test results, because some of the positive earnings surprises may be included before their official announcement which off course falsely overstates the PEAD. That assumption was made by Jones and Litzenberger (1970), Litzenberger, Joy and Jones (1971), Latane, Jones and Rieke (1974), Basu (1977) and Watts (1978). However, Ball (1978) states that this bias is small compared to observed excess returns. Information processing cost and transaction costs are also rejected as possible explanations because they may explain the sign but cannot explain the magnitude of observed excess returns. His other considered biases include the possibility that an omitted risk metric is correlated with change in earnings, or that used methods to estimate risk are flawed, and the estimation error is correlated with earnings. Those suspicions are impossible to confirm or reject, but assuming they are right would undermine market equilibrium model. Ball (1978) concludes: “The most important results of this study are the findings relative to market efficiency. The excess returns from purchasing the qualifying securities at the time of publication of the EPS number substantially exceed transaction costs. The adjustment process, rather than being instantaneous, is lengthy (about 45 market days). Thus, with respect to this particular sample of securities, the market exhibited inefficiencies” A differing explanation of observed abnormal returns after quarterly earnings surprise was offered by Watts (1978), he proves that the observed significant abnormal returns are not enough to cover transaction costs, unless an investor can trade at substantially lower costs (market makers, banks, brokers, professional investors). He points at the transaction costs as the decisive factor for existing abnormal returns, he also states that it is not possible that they exist due to deficiency in the capital asset-pricing model, as suggested by Ball (1978). In 1982 Rendelman, Jones and Latane presented a research paper giving the most comprehensive and complete examination of market reaction to unexpected earnings to date. They 6 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 69,
    "chunk_index": 10,
    "word_count": 430,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "not possible that they exist due to deficiency in the capital asset-pricing model, as suggested by Ball (1978). In 1982 Rendelman, Jones and Latane presented a research paper giving the most comprehensive and complete examination of market reaction to unexpected earnings to date. They 6 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 69,
    "chunk_index": 11,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "contradict findings of Reinganum (1981) who re-evaluated previous academic findings to conclude that investors cannot earn abnormal returns using only unexpected earnings measure, as it was insignificant in his data sample 1975-77. Rendelman et al (1982) examined a sample of 1496 American companies in the period 1971 to 1980. They used the Standardized Unexpected Earnings (SUE) concept in their research as proposed by Latane and Jones (1974, 1977) and Reinganum’s (1981) methodology of constructing the portfolios 1 to 5 month after the quarter end based on a sample of companies that report their earnings within one month after the quarter end. They found that abnormal returns do exist and range from 6.0% (for portfolios constructed one month after the quarter close) to 3.4% (for portfolios constructed 5 months after the quarter close). They proved that their results are statistically significant using a t-statistic and show that even the Reinganum’s (1981) period has statistically significant abnormal returns for portfolios +1 month to +3 months, but they also notice that the portfolios +4 and +5 month in Reinganum’s period are in fact the only two in the sample that are not statistically significant. As they conclude Reinganum’s (1981) findings may have been caused by very short sample period and exceptional behaviour in this period. They also repeated their calculations without Reinganum’s constraints. They looked into price behaviour 20 days prior the announcement day up to 90 days after the earnings announcement using the same SUE definition. In the Table 4 Rendelman’s et al (1982) results are presented, they clearly illustrate the relationship between the SUE level and abnormal returns after the profit announcement. For the period 1 to 90 days after announcement day the return spread is 8.3% which is in line with other research findings. Almost half of the abnormal returns are cumulated in the period -20 to 0 day, which proves that many investors are effective in estimating companies’ earnings and being able to correctly forecast quarterly earnings gives 8.4% return spread in just 20 days. What is also interesting is that magnitude of positive earnings surprise relates with abnormal return, on the negative side, the magnitude of the SUE does not matter, it is the inclusion in the last three deciles that is decisive. Their t statistics show that all but one (number 6) SUE deciles are statistically significant. They also tried to assess the relationship between portfolio risk, calculated as beta with the decile returns, their beta calculations for all SUE deciles are presented in table 4. They conclude that when observing post earnings drift anomaly, it is not important to adjust for market risk, as the portfolio’s abnormal returns are not affected by risk adjustments, they calculated the excess return using two different beta estimation techniques and without risk adjustment. Their conclusion was that risk adjustment does not change with abnormal return estimations and PEAD explanation does not lay in the market risk. 7 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 69,
    "chunk_index": 12,
    "word_count": 492,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "are not affected by risk adjustments, they calculated the excess return using two different beta estimation techniques and without risk adjustment. Their conclusion was that risk adjustment does not change with abnormal return estimations and PEAD explanation does not lay in the market risk. 7 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 69,
    "chunk_index": 13,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Table 4 Analysis of cumulative excess returns and betas over 36 quarters 1971-1980 SUE Category 1 2 3 4 5 6 7 8 9 10 Cumulative excess returns Days -20 to 90 -8.7 -7.3 -5.6 -3.6 -1.1 1.2 2.8 3.9 6.9 8.0 Days 1 to 90 -4.0 -3.2 -3.3 -1.8 -0.8 0.5 1.2 1.6 3.4 4.3 Days -20 to -1 -3.3 -3.1 -1.7 -1.4 -0.4 0.4 0.9 1.5 2.2 2.4 Day 0 -1.4 -1.0 -0.7 -0.2 0.1 0.3 0.6 0.8 1.3 1.3 t-statistics Days -20 to 90 -3.06 -3.43 -4.30 -4.35 -3.02 1.51 1.96 2.10 2.55 2.86 Days 1 to 90 -3.69 -3.24 -5.56 -4.74 -2.63 1.37 2.74 2.44 3.57 4.58 Days -20 to -1 -1.78 -2.81 -2.12 -3.19 -1.76 0.64 0.83 1.10 1.16 1.17 Day 0 -5.84 -3.93 -2.72 -1.23 0.21 1.30 2.61 3.29 5.18 5.09 Beta analysis Average Beta 1.02 1.00 0.97 1.00 1.03 1.03 1.01 1.02 1.02 1.02 Max Beta 1.30 1.65 1.25 1.19 1.16 1.16 1.15 1.20 1.49 1.35 Min Beta 0.67 0.57 0.71 0.85 0.89 0.94 0.89 0.76 0.65 0.60 SD Beta 36 Q 0.15 0.19 0.12 0.08 0.07 0.05 0.07 0.09 0.16 0.19 Source: Rendleman, Jones and Latane (1982) page 283 Beaver and Ladsman (1981) looked at post earnings announcement drift from a different angle. They were examining more generally “winners” and “losers” portfolios and looked at earnings surprise as one of the discriminatory criteria. They suggest that by ranking stocks based simply on past residual returns is more effective as their observations will include all the factors affecting stock returns, not only single events like stock splits, change in accounting methods or earnings announcements. Their results show that there is no correlation between past residual returns and future residual returns in the observed periods, that is 12 months and 20 months after portfolio formation. However, they acknowledge that their results do not contradict the findings of various prior academic research, that found stock price drift after earnings surprise. Their research, although phrased as examining price drift after corporate events is designed in a way more similar to price momentum examination than price drift after event research. Another addition to evidence of PEAD existence was given by Foster, Olsen and Shevlin (1984). Authors looked into previous research and tried to explain various weaknesses in presented evidence. They examined the phenomenon in 56,000 observations in the period 1974-1981. They used four different earnings expectations models to calculate the earnings surprise. The first two models were based on time-series regression model formed on 20 prior quarterly earnings observations, the latter two models were based on stock performance in days preceding earnings announcement. They found evidence of abnormal stock return after earnings surprise based on the first two models but found no evidence of abnormal returns when they ranked stocks based in the latter two models. This conclusion is similar to that documented by Beaver and Ladsman (1981), 8 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 69,
    "chunk_index": 14,
    "word_count": 487,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "found evidence of abnormal stock return after earnings surprise based on the first two models but found no evidence of abnormal returns when they ranked stocks based in the latter two models. This conclusion is similar to that documented by Beaver and Ladsman (1981), 8 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 69,
    "chunk_index": 15,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "as their price surprise models 3 and 4 are constructed in a way very similar to that used by Baever and Ladsman (1981) that is using past price performance to create stock ranking. Table 5 Estimated average excess return of PEAD Forecast Days [-1,0] Days [-60,0] Days [+1,+60] Error Portfolio Model 1 Model 2 Model 1 Model 2 Model 1 Model 2 1 -1.36 -1.34 -5.57 -5.94 -3.02 -3.08 2 -0.94 -0.88 -4.01 -3.95 -2.59 -2.73 3 -0.50 -0.49 -2.29 -2.37 -1.58 -1.78 4 -0.25 -0.25 -1.19 -0.32 -1.34 -0.92 5 0.04 0.19 -0.18 0.93 -0.48 0.22 6 0.28 0.44 0.96 1.51 0.55 0.79 7 0.54 0.73 1.71 2.38 1.31 1.32 8 0.90 0.81 3.41 2.75 2.46 1.70 9 1.40 1.03 5.35 3.78 3.22 2.21 10 1.44 1.26 5.83 6.50 2.93 3.23 Source: Foster, Olsen and Shevlin (1984) page 587 They estimated the 60 days drift in price to be around 2.93% to 3.23% depending on the model used - Table 5. They also concluded that the price drift effect prevails over the entire sample, which suggests that it is very unlikely that it was found only due to sub-period existence. The authors also documented that 80 percent of the variation in cumulative abnormal returns of the 10 deciles in the period +1 to +60 days is explained by magnitude of the unexpected earnings change. Table 6 Cumulative Average Residual for Forecast Error Portfolios: Breakdown into NYSE Population Firm Size Quintiles (I-smallest firms, V-biggest firms) Forecast Days [+1,+60] Error Quintile Quintile Quintile Quintile Quintile Portfolio I II III IV V 1 -3.34 -4.12 -2.56 -2.91 -1.87 2 -4.10 -2.32 -1.44 -1.90 -1.40 3 -1.98 -1.58 -1.88 -1.50 -1.52 4 -0.97 -1.42 -0.93 -1.13 0.23 5 1.45 -1.21 -0.14 -0.91 -0.63 6 1.82 0.60 0.50 -0.51 -0.27 7 2.34 1.60 1.06 -0.35 0.79 8 3.60 1.35 1.41 1.11 0.02 9 3.51 2.88 1.89 1.16 1.25 10 5.00 4.86 2.83 2.52 1.73 Source: Foster, Olsen and Shevlin (1984) page 596 To address the critique of PEAD Foster et al (1984) also used firm size partitioning to extract firm size effect from the PEAD effect. Their results are shown in Table 6, as they concluded post- announcement drifts are statistically significant across all size quintiles, but the drift is more pronounced in the small firm partition. Their calculated drift spread in the smallest firms’ segment 9 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 69,
    "chunk_index": 16,
    "word_count": 398,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "from the PEAD effect. Their results are shown in Table 6, as they concluded post- announcement drifts are statistically significant across all size quintiles, but the drift is more pronounced in the small firm partition. Their calculated drift spread in the smallest firms’ segment 9 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 69,
    "chunk_index": 17,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "was 8.34% and in the biggest firm segment it was 3.60%. The firm size explained about 65% of portfolio variation in the ten deciles, the two effects combined, that is firm size and earnings surprise magnitude effect explain 85% of the variation across portfolios in their post- announcement return behaviour. Summary and comparison of previous research regarding post earnings announcement drift (PEAD) was presented by Bernard and Thomas (1989), their research paper was widely accepted by the industry and earned a seminal status among PEAD research documents. It still is one the most frequently cited papers in this field. In their article they looked at possible PEAD explanation offered previously by Ball (1978) and Foster et al (1984), who suggest that the PEAD abnormal returns exist due to some misspecification of the CAPM, on the other hand Ball, Kothari and Watts (1990), show that stocks’ beta shift upward after firm’s high unexpected earnings, and vice versa, which explains PEAD in the context of CAPM. It is a well-documented process, but still does not explain PEAD, as investors would be able to make abnormal returns, knowing that betas will move in a predetermined fashion after unexpected earnings announcement. Bernard and Thomas (1989) argue that evidence presented previously by Ball (1978), Foster et al (1984) and Ball et al (1990) does not guarantee the inference offered by the authors, results presented by them may support their thesis, but does not preclude other explanations. Bernard and Thomas (1989) rather lean to “delayed price response” as the reason for PEAD existence, but as they acknowledge “it is difficult to explain why the market would fail to respond immediately to earnings information.” They divide probable explanations into two groups, one is transaction costs, and the other is difficulty in understating the full implication of the earnings’ information. Bernard and Thomas (1989) assumed that if the post announcement drift is a proxy for some missing risk measure, then the risk would have to manifest itself through observed losses along the investment period. They looked into all their quarterly data to find how often the strategy generates losses and how big they are. They found that a zero-risk strategy (long 1st decile portfolio, short 10th decile portfolio) generates profit in all 13 years in their sample and in 46 out of 50 observed quarters, the cumulative profit in that time was nearly 200%, while the cumulative loss less than 7%. They conclude that these results eliminate the missing risk measure as possible explanation of PEAD. They also prove that the beta shifts, as presented by Ball et al (1990), although visible in the data do not justify the magnitude of the PEAD abnormal returns. They also notice, that PEAD decile portfolios perform abnormally well during down markets, which puts into question the beta shift explanation altogether. The transaction cost explanations were also found to be inconsistent with their results. They assumed that average individual investor would pay 2%-4% transaction cost each way, 10 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 69,
    "chunk_index": 18,
    "word_count": 501,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "PEAD decile portfolios perform abnormally well during down markets, which puts into question the beta shift explanation altogether. The transaction cost explanations were also found to be inconsistent with their results. They assumed that average individual investor would pay 2%-4% transaction cost each way, 10 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 69,
    "chunk_index": 19,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "depending on the firm size, where the bid-ask spreads are larger. Even with those extreme transaction costs levels they fail to justify the magnitude of the abnormal returns after announcement. They also point to the fact that if transaction costs would in fact be the reason for PEAD existence, then the long position decile should generate lower abnormal returns, than the short position decile, because shorting stocks is more expensive, they found no evidence of this phenomenon, which made them reject the transaction costs PEAD explanation. They concluded that delayed price response cannot be explained by any of the previously raised hypotheses. They left unanswered the question how to explain the post earnings announcement drift based on current state of market equilibrium theory. In their research, Bernard and Thomas (1989) used a sample of 84,792 firms listed on NYSE and NASDAQ in the period 1974-1986, portfolio inclusion and abnormal return calculation methods used followed that used by Foster et al (1984). Also, their unexpected earnings measure was used after Foster et al (1984) Model 2 SUE. Results obtained in their study are similar to those obtained by Foster et al (1984), even though their period is 5 years longer. Their calculations show that a strategy of buying the highest decile and shorting the lowest decile of ranking of unexpected earnings yields 4.2% return in 60 days, that is roughly 18% annualized return. Figure 1 shows their calculated average cumulative return for all decile portfolios during the period 60 days prior to announcement to 60 days after announcement. The post announcement drift is easily observed in their results. The abnormal returns during the pre-announcement period are twice as big as in the post-announcement period, which proves that some investors are effective in forecasting quarterly earnings. Similarly, to Foster et al (1984), Bernard and Thomas (1989) looked into relationship of the drift to firm size. Their results confirm previous academic evidence. Post announcement drift is most prominent among small size firms, and less prominent among large size firms. Their previously depicted strategy of investing in highest decile portfolio and shorting lowest decile portfolio gives 5.3% return in 60 days in the small size segment, while in the medium and large size firm segment the return is 4.5% and 2.8% accordingly. They also state that the statistical significance of the drift was confirmed at 0.01 level. The spread among decile portfolios is twice as big for small size firms than for large size firms. We can also see that the decile portfolios are ordered according to SUE rank among small firms, while among large firms only the 4 extreme deciles are ordered, the rest lacks meaningful order, which means that the magnitude of the unexpected earnings is correlated with abnormal returns among small stocks, while among large size stocks, only inclusion in extreme portfolios produces abnormal returns. 11 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 69,
    "chunk_index": 20,
    "word_count": 480,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "large firms only the 4 extreme deciles are ordered, the rest lacks meaningful order, which means that the magnitude of the unexpected earnings is correlated with abnormal returns among small stocks, while among large size stocks, only inclusion in extreme portfolios produces abnormal returns. 11 Electronic copy available at: https://ssrn.com/abstract=3281679 Figure 1 Cumulative Abnormal Returns for SUE portfolios: all announcements Source Bernard and Thomas (1989) page 10 Another component of the drift examined by Bernard and Thomas (1989) was the longevity. Most of the drift occurs within 60 trading days after profit announcement and the drift beyond 180 trading days lacks statistical significance. The results for small size firms are shown in Table 7. The period up to 60 trading days is the usual timespan between quarterly earnings announcements, which means, that when analysing data for periods beyond 60 trading days, we have to keep in 12 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 12,
    "page_range": "p.12-13",
    "total_pages": 69,
    "chunk_index": 21,
    "word_count": 152,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.12-13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "significance. The results for small size firms are shown in Table 7. The period up to 60 trading days is the usual timespan between quarterly earnings announcements, which means, that when analysing data for periods beyond 60 trading days, we have to keep in 12 Electronic copy available at: https://ssrn.com/abstract=3281679 mind, that the market already is reacting to next quarterly data, so the post announcement drift is biased by the drift after next announcement. Table 7 Longevity of Post Earnings Announcement Drift Cumulative Abnormal Returns (%) Holding Small Firms Medium Firms Large Firms Period High Low Diff High Low Diff High Low Diff SUE SUE (Hi-Lo) SUE SUE (Hi-Lo) SUE SUE (Hi-Lo) -59 to0 6.42 -8.27 14.70 4.15 -6.81 10.96 2.71 -4.13 6.84 1 to 60 2.19 -3.13 5.32 1.93 -2.58 4.51 1.45 -1.29 2.74 61 to 120 0.38 -2.24 2.62 0.33 -2.22 2.55 0.51 -0.76 1.27 121 to 180 0.03 -1.93 1.95 0.18 -1.61 1.79 -0.20 -0.66 0.45 181 to 240 0.20 -0.38 0.58 -0.40 -0.58 0.18 -0.45 -0.44 -0.01 241 to 300 -1.22 0.56 -1.77 -0.88 0.16 -1.04 -0.62 0.23 -0.85 301 to 360 -0.54 -0.96 0.42 -0.36 -0.71 0.35 -0.64 -0.16 -0.48 361 to 420 -0.27 -0.33 0.06 -0.18 -0.37 0.18 -0.55 -0.71 0.17 421 to 480 0.29 -0.51 0.80 -0.43 0.37 -0.80 -0.42 -0.73 0.31 Postannouncement Drift (Cumulative Abnormal Returns %) 1 to 60 5.32 4.51 2.74 1 to 120 7.95 7.06 4.02 1 to 180 9.90 8.85 4.47 1 to 480 9.99 7.72 3.61 Postannouncement Drift (as a fraction of 480-Day Drift) 1 to 60 0.53 0.58 0.76 1 to120 0.80 0.91 1.11 1 to180 0.99 1.15 1.24 1 to 480 1.00 1.00 1.00 Source: Bernard and Thomas (1989) page 14 Bernard and Thomas (1989) looked closer at the effect of profit announcement on next quarter drift. It is academically proven fact that seasonally differenced quarterly earnings are positively correlated from one quarter to another (serially autocorrelated), as shown by Foster (1977) and Freeman and Tse (1989). First, they spotted that in an efficient market, investors should adjust their next quarterly expectations after familiarizing themselves with the pace of seasonally adjusted earnings growth rate in the currently announced quarterly report, to reflect the new earnings growth path. If investors fail to recognize the serial correlation in seasonally differenced quarterly earnings, they will positively react to next earnings report, even though they should have expected the level of earnings based on their serial autocorrelation. Bernard and Thomas (1990) looked at price reaction to next quarterly earnings announcement in the period 4 days preceding the report up to the day of the report is released. They found that on average highest SUE decile portfolio earns a significant abnormal return in those 5 days, that is 1.32% for small size firms, 0.68% for medium size firms and 0.31% for large size firms, versus -0.82%, -0.65% and -0.37% accordingly for the lowest SUE decile portfolio, Table 8. If the PEAD was smooth after profit announcement those 5 days could account for less than 10% of the observed drift, the results show that in those 5 days the abnormal returns account 13 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 69,
    "chunk_index": 22,
    "word_count": 527,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "and -0.37% accordingly for the lowest SUE decile portfolio, Table 8. If the PEAD was smooth after profit announcement those 5 days could account for less than 10% of the observed drift, the results show that in those 5 days the abnormal returns account 13 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 69,
    "chunk_index": 23,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "for 40%-25% of the PEAD in various firm size segments, which means that investors are positively surprised by next quarterly earnings. They conclude that: “The results are consistent with a market that fails to recognize the full implications of current earnings for future earnings.” They concluded that the market follows a naïve seasonal random walk of earnings expectations and fails to draw conclusions from more recent profit announcements. Table 8 Mean Stock Price Reaction to Quarter t+1 Earnings, for Firms Grouped on Quarter t-time SUE Percentage Abnormal Return in [-4,0] SUE Decile for Quarter t Window Surrounding Earnings Announcement for Quarter t+1 (t-value in parentheses) 10 (good) 1.32 .68 .31 (7.81) (5.84) (3.93) 1 (bad) -.82 -.65 -.37 (-5.28) (-5.26) (-4.01) Difference (CAR for long [short] position 2.14 1.33 .68 in SUE 10 [SUE 1] firm) As fraction of 60-day Drift 40% 29% 25% Source: Bernard and Thomas (1989) page 30 Similar conclusions were presented by Bartov (1992) who proves that investors fail to properly characterize the properties of the process underlying earnings correctly and suggest that failure to use past earnings information correctly is the source of post earnings announcement drift. They used a LOGIT model to predict next quarter earnings surprise based on last four lagged quarterly earnings. They proved that earnings surprise can be predicted based on last three quarterly earnings announcements. It suggests that investors can predict next quarterly earnings surprise and post earning drift beyond one period using information contained in the last 3 quarterly earnings reports. Bartov (1992) also proved that post earnings announcement drift disappears altogether after controlling the earnings surprise for the LOGIT model earnings surprise forecast. 1.2. Analyst’s role in PEAD Another feature of PEAD was presented by Abarbanell and Bernard (1992), who studied whether analysts underreact or overreact to prior earnings information, and whether analysts’ earnings forecast bias may justify abnormal stock price behaviour after profit announcement. They proved that in fact analysts do underreact to most recent earnings information, which is consistent 14 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 69,
    "chunk_index": 24,
    "word_count": 339,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Bernard (1992), who studied whether analysts underreact or overreact to prior earnings information, and whether analysts’ earnings forecast bias may justify abnormal stock price behaviour after profit announcement. They proved that in fact analysts do underreact to most recent earnings information, which is consistent 14 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 69,
    "chunk_index": 25,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "with the naïve seasonal random walk forecast model presented by Bernard and Thomas (1989). However, their calculations also show that analysts’ underreaction is not enough to explain abnormal stock price drift after earnings announcement. This finding can explain part of the PEAD, but creates another important question, why do analysts underreact to most recent earnings report in the same fashion as the market?, why do analysts’ earnings forecasts are systematically biased?, why are they not using an academically proven seasonally differenced quarterly earnings predictions even though they are more accurate than their forecasting models? Looking for explanation of analysts underreaction leads to the same behavioural patterns as PEAD. Similar conclusions were presented by Ali et al (1992), who documented significant positive serial autocorrelation in eight months and one-month analyst’s forecasts errors, which is consistent with the hypothesis that analysts on average underestimate the permanence of earnings trend in their forecasts. They also shown that their calculated earnings prediction error can be used to produce earnings forecasts that have lower earnings forecast error than the forecasts produced by analysts. Further investigation of how investors use past earnings information to form their earnings expectations was provided by Ball and Bartov (1995). They contradict the findings of Bernard and Thomas (1990), who concluded that investors use a naïve seasonal random walk model in forming their earnings expectations. Ball and Bartov (1995) prove that investors in fact do not use a seasonal random walk model and they do incorporate past earnings changes in their expectations but they underestimate the magnitude of the serial correlations in seasonally differenced earnings by approximately fifty percent. Based on the same data set as Bernard and Thomas (1989), they tested hypotheses regarding use of information contained in the last four quarterly earnings announcements to form next quarterly earnings expectation. Their results show that investors are well aware of seasonality in earnings, serial correlation in seasonality differenced series and of annual earnings random walk. They form a hypothesis of “partially” naïve expectations, as their results prove that investors systematically underestimate the magnitude of serial correlation in seasonally differenced earnings. They calculate a regression of abnormal return and past four unexpected earnings and find that investors on average take into account around 45% of the last quarterly earnings information, 52% of the (t-2) earnings information, and 130% of the (t-3) earnings information. These results confirm that investors are aware of the value of the past earnings surprise information and that they underestimate the value of the most recent information. They conclude that previous academic studies cannot explain the abnormal post announcement returns. Their results shed new light on the phenomenon, however do not provide any conclusive answers. 15 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 69,
    "chunk_index": 26,
    "word_count": 452,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the past earnings surprise information and that they underestimate the value of the most recent information. They conclude that previous academic studies cannot explain the abnormal post announcement returns. Their results shed new light on the phenomenon, however do not provide any conclusive answers. 15 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 69,
    "chunk_index": 27,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "In 2006 Livnat and Mendenhall (2006) looked closely at the difference between earnings surprise defined based on time series earnings forecast and analysts’ forecast. They repeated PEAD anomaly test conducted by Bernard and Thomas (1989) with the earnings surprise defined as difference between reported earnings and IBES consensus analysts’ earnings estimates and compared them with earnings surprise based on time series models. They used stocks data for the period 1987-2003 with varying sample size dependent on IBES data availability. They ranked stocks based on standardized unexpected earnings and divided the ranking into deciles. The average abnormal return calculated this way for earnings surprise based on analysts’ forecast was 5.17% per quarter which is a very similar level to the magnitude of the drift given previously by many authors basing on time series earnings forecast. They also recomputed the same abnormal returns using reported earnings excluding special items, the drift in this scenario was 5.32% which is marginally larger. Another aspect in their research was looking at the Compustat earnings database distortion, caused by the fact, that Compustat enters into its database restated earnings, when they are restated by the company, which means that the earnings surprise computed on that data may be invisible to investors at the time of earnings announcement. Livnat and Mendenhall (2006) recomputed PEAD abnormal returns using the “actual reported earnings” to find that the real drift is lower only by 4 basis points and amounts to 5.21% per quarter, which means that earnings restatements are a negligible factor in PEAD calculations. Their recalculated drift using time series earnings forecast was 4.01% per quarter, and the difference between the two computed abnormal returns is statistically significant. Apart from the size of the abnormal return, the two versions of earnings surprise also differ in regard to series autocorrelation. Similar to Bernard and Thomas (1989) findings, SUE based on time series earnings forecast has declining positive three quarters correlation and large negative fourth quarter correlation, while the series of SUE based on analysts forecast has positive autocorrelation in all four quarters, and similar size in quarters two to four. They conclude that PEAD for earnings error based on analysts forecast is markedly higher than the price drift observed for time series earnings error. The subsequent pattern of the distribution of the drift also varies for both scenarios. Lerman et al (2007) revisited the same problem, they extended their sample period to include data up to Q2 2005 and added revenue surprise to their analysis. The authors prove that earnings surprise based on time series model (SUE) and earnings surprise based on analyst forecast (SUEAF) have additive power and can produce abnormal returns superior to any one of the two effects separately. They also examined investment strategy of combining SUE, SUEAF with surprise in revenue (SURGE). Table 9 presents results of their calculations. In their sample, SUE 16 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 69,
    "chunk_index": 28,
    "word_count": 483,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "forecast (SUEAF) have additive power and can produce abnormal returns superior to any one of the two effects separately. They also examined investment strategy of combining SUE, SUEAF with surprise in revenue (SURGE). Table 9 presents results of their calculations. In their sample, SUE 16 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 69,
    "chunk_index": 29,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "hedged portfolio earns a quarterly abnormal rate of return of 2.726%, while the SUEAF portfolio earns 4.268%, combining the two strategies produces a superior strategy that earns 5.802% return. All of the strategies’ abnormal returns are statistically significant with 0.001 significance levels. Addition of SURGE benefits portfolio’s characteristics even further, combing SUE with SURGE gives only minor effect, but combination with SUEAF or SUE/SUEAF combined add significantly to portfolio’s returns. Table 9 Hedge portfolio returns of SUE portfolio, SUEAF (SUE Analyst Forecast) and SURGE (Revenue Surprise) in period Q2 1987- Q2 2005 SUE and SUEAF SUE SUEAF SUE+ Difference Difference Variable (1) (2) SUEAF (3-1) (3-2) (3) ABHR (%) 2.726 4.268 5.802 3.076 1.534 Standard Dev of ABHR (%) 3.111 3.299 4.797 2.975 2.641 t-Statistic 7.490 11.050 10.330 8.830 4.960 Significance level 0.001 0.001 0.001 0.001 0.001 Average number of companies 711 711 238 SUE, SUEAF and SURGE SURGE SURGE + SURGE + SURGE+ Variable SUE SUEAF SUE+ SUEAF ABHR (%) 1.164 3.088 5.792 6.569 Standard Dev of ABHR (%) 2.486 5.077 4.980 7.002 t-Statistic 4.000 5.270 9.940 8.020 Significance level 0.001 0.001 0.001 0.001 Average number of companies 664 203 162 74 Significance level of diff Col 3 0.001 0.959 0.205 Source: Lerman, Livnat and Mendenhall (2007) page 68 Lerman et al (2007) recalculated their strategy with some interesting variants. Their portfolios were created using ranking quantiles, but they recalculated their strategies using portfolio’s deciles and got identical results. Due to smaller portfolio size statistical significance was lower. They also tried to exclude extreme observations, exclude stocks with fewer than two analysts and stocks with negative equity - all the elements proved to be meaningless and the results identical to base scenario. Independently from each other Doyle et al (2006) conducted a similar study to Livnat and Mendenhall (2006), their observations widely reaffirm each other, but their details and methods somewhat vary. They used similar period for their sample 1998-2000 and the same database (IBES), but they focus their attention on longer term effects of the drift, periods of one to three years and defined earnings expectations based on analysts’ forecasts. They observed that the drift 17 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 69,
    "chunk_index": 30,
    "word_count": 363,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "They used similar period for their sample 1998-2000 and the same database (IBES), but they focus their attention on longer term effects of the drift, periods of one to three years and defined earnings expectations based on analysts’ forecasts. They observed that the drift 17 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 69,
    "chunk_index": 31,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "for positive surprise portfolios is more permanent, than in previous studies, while the market reaction to negative earnings surprise is quicker and less sustainable. They looked in their sample to find patterns in their portfolio’s composition and came up with a list of characteristics (Table 10). Firms in first decile portfolios tend to be “neglected” by investors and analysts, they have relatively high book-to-market ratio and high analysts’ forecast dispersion ratio. In the three subsequent years after earnings surprise, firms tend to have persistent earnings surprises in the same direction, strong growth in cash flow and earnings and increased analysts’ attention comparing to firms in lowest decile portfolio. Average portfolio characteristics are presented in Table 10 panel A. The ranking shows, that extreme decile portfolios are the on average comprised by smallest size companies, with lowest analyst coverage and highest book to market values. The ranking is also perfectly correlated with the measure of standard deviation of earnings, which is not surprising that companies with least stable earnings are more likely to be included in one of the extreme portfolios. In panel B Table 10 presents characteristics of decile portfolios 3 years after portfolio formation. Firms in extreme decile portfolios, on average, exhibit higher sales growth then firms in the middle of the ranking, while growth in cash flow, growth in earnings and analysts’ attention in positively correlated with ranking location. Firms in 10th decile portfolio enjoy Cash Flow growth of 23.6% vs. only 16.2% for firms in 1st decile. Earnings change is even more pronounced, with 13.2% growth in 10th decile, 10.3% in 5th decile and -2.64% in 1st decile. Growth in analysts’ attention is three times higher for firms in 10th decile comparing to 1st decile. Panel C presents transaction costs and institutional ownership for all portfolio deciles. Consistent with their company size distribution, median trade, median number of trades and share price are highest for middle decile portfolios and lowest for extreme portfolios, in consequence companies in extreme decile portfolios have lower number of funds in their shareholder structure and lower percentage held by funds, the bid-ask spread is much lower for firms in the middle of the ranking, which is consistent with other company characteristics. Authors looked also into industry cross section of the decile portfolios, but did not find any meaningful dependencies, which is surprising taking into account that some industries are characterized by much lower earnings volatility then others. 18 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 69,
    "chunk_index": 32,
    "word_count": 411,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "ranking, which is consistent with other company characteristics. Authors looked also into industry cross section of the decile portfolios, but did not find any meaningful dependencies, which is surprising taking into account that some industries are characterized by much lower earnings volatility then others. 18 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 69,
    "chunk_index": 33,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Table 10 Current and Future Characteristics of firms in Earnings Surprise Portfolio Panel A: Firm financial characteristics at time of surprise portfolio formation Earnings Mean Mean Mean Median Median Median Mean Mean Mean Surprise Surprise Market Book-to- Sales CFO GAAP Number Forecast 3-Day Portfolio Value Market (Scaled (Scaled EPS of Std Dev Annc. ($M) by by (Scaled Analysts Return Equity) Equity) by Price) 1 -0.0397 388 0.84 0.3921 0.0033 -0.0023 2.75 0.0801 -0.0256 2 -0.0062 1089 0.66 0.2668 0.0142 0.0004 3.74 0.0512 -0.0164 3 -0.0023 1725 0.56 0.2191 0.0165 0.0005 4.58 0.0402 -0.0119 4 -0.0013 2506 0.54 0.2266 0.0181 0.0005 5.63 0.0377 -0.0093 5 -0.0001 3091 0.45 0.1797 0.0137 0.0004 6.19 0.0217 -0.0027 6 0.0002 2913 0.41 0.1692 0.0138 0.0004 6.45 0.0224 0.0035 7 0.0007 2005 0.45 0.1884 0.0153 0.0005 5.68 0.0250 0.0115 8 0.0016 1496 0.51 0.2225 0.0181 0.0006 4.80 0.0307 0.0171 9 0.0033 1152 0.59 0.2677 0.0208 0.0008 4.12 0.0405 0.0236 10 0.0126 640 0.74 0.3754 0.0229 0.0011 3.70 0.0633 0.0322 Panel B: Firm characteristics over three years subsequent to surprise portfolio formation Earnings Median Median Median Mean Mean Median Median Surprise 3-year 3-year 3-year 3-year 3-year 3-year 3-year Portfolio Change Change Change Change in Change in Change in Change in in Sales in CFO Earnings Number of Forecast Bid-Ask Depth in Analysts Dispers. Spread Dollars 1 3.611 0.1624 -0.0264 0.36 -0.0552 -0.0036 2,425 2 2.787 0.1970 0.0737 0.54 -0.0177 -0.0017 -5,016 3 2.381 0.1979 0.0992 0.47 -0.0065 -0.0010 -12,441 4 2.452 0.1949 0.1164 0.53 -0.0006 -0.0007 -3,156 5 1.991 0.1748 0.1031 0.91 0.0017 -0.0009 -23,550 6 1.947 0.1724 0.1155 0.97 0.0024 -0.0006 -24,173 7 2.163 0.1939 0.1265 1.30 0.0024 -0.0009 -16,966 8 2.511 0.2073 0.1330 1.22 0.0012 -0.0011 -12,888 9 2.917 0.2322 0.1440 1.14 -0.0033 -0.0014 -13,500 10 3.951 0.2364 0.1321 1.05 -0.0228 -0.0024 1,963 Panel C: Transaction cost and institutional neglect at time of surprise portfolio formation Earnings Median Median Share Median Median Median Median Surprise Trade No of Price Percent No of Funds Change in Bid-Ask Portfolio Size Trades Held Breadth Spread 1 12,705 7,447 7.13 25.68 20 0.0160 0.0204 2 20,997 8,841 13.36 32.87 30 0.0246 0.0120 3 28,362 9,986 18.88 36.85 41 0.0330 0.0089 4 35,848 13,894 22.00 41.75 56 0.0484 0.0071 5 35,793 14,938 24.50 45.71 58 0.0439 0.0072 6 40,289 17,783 27.00 47.86 68 0.0541 0.0059 7 35,789 14,064 24.25 45.44 54 0.0432 0.0071 8 30,464 11,309 21.13 40.70 43 0.0346 0.0084 9 25,294 9,960 17.38 36.56 35 0.0274 0.0097 10 17,868 8,202 11.13 30.19 25 0.0200 0.0140 Source: Doyle, Lundholm and Soliman (2006) page 871 Doyle et al (2006) presented portfolios’ returns in the three years following ranking creation, which differs from previous research, where authors concentrate on short term drift, most often 1 to 180 days. The abnormal return achieved by their hedged portfolio (Table 11) is 13.95% after first year and 23.7% in three years which materially exceeds previous PEAD abnormal returns 19 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 69,
    "chunk_index": 34,
    "word_count": 490,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "differs from previous research, where authors concentrate on short term drift, most often 1 to 180 days. The abnormal return achieved by their hedged portfolio (Table 11) is 13.95% after first year and 23.7% in three years which materially exceeds previous PEAD abnormal returns 19 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 69,
    "chunk_index": 35,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "achieved using time series forecast error. Surprisingly the best decile portfolio earns substantial abnormal return even in year 2, and the worst portfolio takes losses in the third year, this evidence contradicts previous evidence of Bernard and Thomas (1989) who prove that the drift for 1st decile portfolio lasts for 240 days, and then sees sizeable return reversal. Table 11 Future Returns to Earnings Surprise Portfolios Surprise N Average Lower Mean Mean Mean Mean Portfolio Bound of Surprise Surprise Ret1yr Ret2yr Ret3yr Portfolio 1 16,254 -0.0397 -0.0458 -0.0496 -0.0943 2 15,830 -0.0120 -0.0062 -0.0195 -0.0537 -0.0581 3 15,618 -0.0042 -0.0023 -0.0441 -0.0781 -0.1181 4 8,050 -0.0016 -0.0013 0.0151 -0.0188 -0.0184 5 26,344 -0.0005 -0.0001 -0.0394 -0.0668 -0.1198 6 13,007 -0.0000 0.0002 0.0065 -0.0009 -0.0199 7 16,913 0.0004 0.0007 0.0197 0.0164 -0.0019 8 15,940 0.0011 0.0016 0.0344 0.0385 -0.0093 9 15,843 0.0023 0.0033 0.0588 0.0903 0.0641 10 15,990 0.0052 0.0126 0.0937 0.1493 0.1426 Hedge Return 0.1395 0.1989 0.2369 (Portfolio 10-1) Source: Doyle, Lundholm and Soliman (2006) page 860 Table 11 also shows the average surprise of the decile portfolios, calculated as the difference between the announced earnings and the analysts’ forecast divided by market value of the company. To be included in the first decile portfolio a company must beat analysts’ earnings forecast by 0.5% of its market value, whereas to be included in the lowest decile portfolio the company must report earnings short of analysts’ forecast by 1.2% of its market value. The magnitude of earnings surprise is also twice as big for negative portfolio in case of the second-best portfolios (2nd and 9th respectively). Authors also studied decile portfolios’ risk and found that after controlling for risk measured by beta abnormal returns do not change significantly. Doyle et al (2006) conclude that: “…we document returns subsequent to earnings announcements, that are much larger, persist for much longer, and are more heavily concentrated in the long portion of the hedge portfolio than shown in previous studies.” They also prove that transaction costs do influence magnitude of the PEAD but are not enough to eliminate abnormal returns offered by the drift. Based on the evidence provided by Livnat and Mendenhall (2006), Lerman et al (2007) and Doyle et al (2006), we know that PEAD using analysts’ forecast is even larger than using time series earnings model. This observation implies that analysts’ forecasts are less accurate earnings 20 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 69,
    "chunk_index": 36,
    "word_count": 401,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "on the evidence provided by Livnat and Mendenhall (2006), Lerman et al (2007) and Doyle et al (2006), we know that PEAD using analysts’ forecast is even larger than using time series earnings model. This observation implies that analysts’ forecasts are less accurate earnings 20 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 69,
    "chunk_index": 37,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "predictor than time-series model forecast. Market analysts as professional information intermediaries should be the group that has the best understanding of the company’s business and its potential profitability in the future. After surprise earnings announcement analysts should be able to quickly accommodate new information in their models and produce new financial forecasts that fully incorporates announced financial surprise. Above mentioned evidence defies that thinking, not only analysts fail to instantly accommodate new information in their forecast, they are also slower than simple time-series earnings model. Zhang (2008) looked at analysts’ responsiveness to explain that phenomenon. He examined analysts’ reaction time in the period 1996-2002 to see how fast analysts produce new forecast. Table 12 shows their sample statistics. In the sample period we can see a significant improvement in analysts’ responsiveness, the average response time was cut from almost 17 days in 1996 to just 9 in 2002, the change in median analyst response is even larger, from 8 days in 1996 to just 2 days in 2002. But the last 25% of analysts still need 5 days to respond (from 28 days in 1996). Table 12 Descriptive statistics of earnings responsiveness to earnings announcements Year No No of trading days between earnings announcement and first % RESP=1 Analyst- subsequent forecast revision firm- Mean Median STD P25 P75 quarters Panel A: Analyst-level analysis 1996 18,651 16.80 8 18.24 2 28 26.37 1997 21,633 16.02 6 18.21 2 27 28.51 1998 27,608 14.36 4 17.73 2 23 30.55 1999 29,791 12.44 3 17.25 2 17 41.81 2000 24,641 11.85 3 16.64 2 15 45.77 2001 37,136 9.62 3 14.80 2 7 42.72 2002 41,243 9.00 2 14.91 2 5 52.87 Overall 200,703 12.19 3 16.79 2 16 40.32 Year No Firm- NRESP PRESP % DRESP=1 quarters Mean Median Mean Median PRESP= PRESP= 0 1 Panel B: Firm-level analysis 1996 4,487 1.08 1 24.57 22.22 41.54 2.45 58.46 1997 5,163 1.27 1 26.21 25.00 40.96 3.64 59.04 1998 5,950 1.40 1 29.11 27.27 35.45 4.39 64.55 1999 6,034 2.04 1 38.61 40.00 26.53 7.24 73.47 2000 4,845 2.39 2 41.95 44.44 23.57 9.60 76.43 2001 6,562 2.39 1 40.35 40.00 33.56 12.54 66.44 2002 7,229 2.98 2 48.78 50.00 23.63 15.08 76.37 Overall 40,270 1.98 1 36.56 33.33 31.64 8.38 68.36 RESP – time of analyst response PRESP – percentage of analysts with response RESP=1 NRESP – number of analysts with response RESP =1 DRESP – indicator variable if there is at least one analyst RESP=1 Source: Zhang (2008) page 204 21 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 69,
    "chunk_index": 38,
    "word_count": 425,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "33.33 31.64 8.38 68.36 RESP – time of analyst response PRESP – percentage of analysts with response RESP=1 NRESP – number of analysts with response RESP =1 DRESP – indicator variable if there is at least one analyst RESP=1 Source: Zhang (2008) page 204 21 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 69,
    "chunk_index": 39,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "It means that analysts in fact respond rather slowly, even though half of the group changes its forecasts within the “Event Window” (day -1 to +1 from announcement), the other half takes up to 60 days to respond. Table 12 presents a cumulative percentage of analysts to respond within time grouped by Analyst in Panel A and grouped by firm in panel B. Both Panel confirm that analysts’ responsiveness significantly improved from 1996 to 2002. On average in 1996 only 25% of companies had at least one earnings update one day after earnings announcement in 2002 this percentage almost doubled to 49%, but still in 2002 almost 24% of companies do not have a single earnings update within a day after earnings announcement. Analyst responsiveness should facilitate dissemination of earnings information and therefore lower PEAD. Zhang (2008) ran a regression of the percentage of analysts responding in the “Event Window” and the magnitude of PEAD and found that in fact the regression coefficient is significant, meaning that analysts’ responsiveness cuts the magnitude of PEAD, Figure 4. He also found that the PEAD is significantly lower for companies which have at least one responsive analyst. Figure 4 Cumulative percentage of analysts to respond to announced earnings. Source: Zhang (2008) page 205 These results confirm previous findings of Livnat and Mendenhall (2006) and Doyle et al (2006) who found that the magnitude of PEAD is higher for companies neglected by analysts. There are however two unanswered question in Zhang (2008) research. First is, how fast do investors incorporate new analysts’ forecasts in their decisions? and the second question, does the revised earnings forecast fully reflect new earnings path? will the new earnings forecast be further revised in the same direction? Quick analyst response may reduce magnitude of PEAD, but if the 22 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 69,
    "chunk_index": 40,
    "word_count": 305,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "incorporate new analysts’ forecasts in their decisions? and the second question, does the revised earnings forecast fully reflect new earnings path? will the new earnings forecast be further revised in the same direction? Quick analyst response may reduce magnitude of PEAD, but if the 22 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 69,
    "chunk_index": 41,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "analyst revises its forecast in the direction of earnings surprise many times in the consecutive 2 years, she can still be a cause of PEAD existence. Abarbanell and Lehavy (2003) put the analyst error analysis into question, suggesting that it is unclear, and very hard to analyse if the analysts’ forecast error is caused by biased analysts’ forecasts or by company’s earnings management. They found an empirical link between analysts’ forecast error and the use of unexpected accruals. 1.3. PEAD among varying investor groups A new angle in explaining the existence of PEAD was offered by Bartov et al (2000) who looked into investor mix as possible explanation. His logic was that the post announcement drift existed thanks to investors’ lack of knowledge and therefore the anomaly should not exist in the group of stocks held by the sophisticated investors. He defined the “sophisticated investor” group as institutional investors. He introduced a new variable, namely the percentage of stock held by institutional investors and used a regression of cumulative abnormal return against four quarter of standardized unexpected earnings and found that in fact the group of stock with higher sophisticated investors presence has lower expected CAR. The evidence presented in his study proves that there is a positive relationship between the proportion of stock held by institutional investors and the magnitude of the post announcement drift. He states that: “institutional investors improve on the earnings-processing problem that cause post-earnings- announcement-drift and increase the degree to which earnings information in efficiently priced.” This observation led to more academic research of shareholder structure and individual and institutional investors’ behaviour as the probable explanatory variable. Odean (1999), Barber and Odean (2000), Hirshleifer et al (2003), all studied further the behaviour of individual investors, their decision-making process and its consequences. Barber and Odean (2000) found that individual investors suffer from overconfidence which makes them trade excessively, and that the trading costs are the decisive factor in their portfolio underperformance. They also point to the fact that individual investors tend to concentrate their portfolios in high-beta small cap stocks. Barber et al (2009) estimate the losses incurred by individual investors, based on Taiwanese market, to be around 2.8% of total personal income in Taiwan. Their findings may be used as an explanation of the PEAD, as individual investors do concentrate their trades in the group (small size firms) where 23 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 69,
    "chunk_index": 42,
    "word_count": 400,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "losses incurred by individual investors, based on Taiwanese market, to be around 2.8% of total personal income in Taiwan. Their findings may be used as an explanation of the PEAD, as individual investors do concentrate their trades in the group (small size firms) where 23 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 69,
    "chunk_index": 43,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the magnitude of the drift is highest (Barber and Odean (2000)) and at the same time suffer negative returns, which means that they are the donors of the abnormal returns. It is in line with the conclusions presented by Bartov et al (2000) who finds that institutional investors, on average, are good at forecasting quarterly earnings. This hypothesis was taken by Hirshleifer et al (2003) to find out if individual investors are the source of post earnings announcement drift. They documented that individual investors trade more after earnings surprise, be it positive or negative. Their other observation is that individual investors are very good at picking future losers, that is stocks tend to underperform after a period of individual investors net buying. They also documented that in the first 17 days after surprise profit announcement, individual net buying is similar regardless of the direction of the surprise, starting from day 18 net buying is significantly higher in the negative surprise group, as shown in Figure 5. Figure 5 Cumulative Abnormal Net Purchases by individual investors - announcement date Source: Hirshleifer, Myers, Myers and Teoh (2008) They conclude that based on their observation, individual investors are not the source of PEAD. They do not find evidence of trades that may cause PEAD, even after taking to account individual investors’ “ability” to pick losers. The ranking based on SUE in the subgroup of individual investors net buying positions still produced abnormal positive returns. The same authors updated and improved their research in 2008 (Hirshleifer, Myers, Myers and Teoh (2008)) based on same data set. They enhanced their research by separating investor 24 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 69,
    "chunk_index": 44,
    "word_count": 275,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "on SUE in the subgroup of individual investors net buying positions still produced abnormal positive returns. The same authors updated and improved their research in 2008 (Hirshleifer, Myers, Myers and Teoh (2008)) based on same data set. They enhanced their research by separating investor 24 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 69,
    "chunk_index": 45,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "classes based on their amount of invested capital and frequency of trading. They came up with similar conclusion, namely that individual investors trades do not cause PEAD. Campbell et al (2009) analysed institutional trading properties based on daily data from New York Stock Exchange, unlike all the other previous researchers, who used quarterly data from 13F forms filled by institutional investors with SEC. Their finding discovered new facts regarding institutional investors trading patterns. They noticed that institutional investors’ trades are highly persistent, and that their daily trades generate negative abnormal returns, while their long-term trades bring positive abnormal return. They interpret this finding this way: institutional investors due to their liquidity needs can take losses to generate needed liquidity, but at the same time are good at discovering future winners so their longer-term trades generate positive long term abnormal returns. One of the sources of the long-term profits is their ability to correctly predict earnings surprise and post earnings announcement drift. They even documented that institutional flows have significant predictive power for firm level earnings surprise and magnitude of post earnings announcement drift. Dey and Radhakrishna (2007) came to very similar conclusion while studying trading volume around earnings announcement dates. Figure 6 Net volume in announcement and non-announcement periods by individual and institutions after profit announcements. Source: Dey and Radhakrishna (2007) page 288 Their results show that both individuals and institutions increase their trading volume before profit announcement. After profit announcement institutions are the first group to step in, their reaction is faster and stronger. Individual investors’ response is delayed but increases in size to exceed institutional volume 6 hours after the time of announcement. They conclude that: 25 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 69,
    "chunk_index": 46,
    "word_count": 284,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "volume before profit announcement. After profit announcement institutions are the first group to step in, their reaction is faster and stronger. Individual investors’ response is delayed but increases in size to exceed institutional volume 6 hours after the time of announcement. They conclude that: 25 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 69,
    "chunk_index": 47,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "“we find evidence of swift and aggressive trading by informed and sophisticated institutions in the immediate aftermath of the announcement, and delayed, aggressive trading volume “overreaction” by “slow” and “overconfident” individual investors”. Similar trading patterns were observed by Shantikumar (2004), who found evidence that large traders capitalize on earnings surprise in the first month after financial report announcement. After that period their activity becomes independent of the announced earnings figure, on the other hand small traders react later and their abnormal trading behaviour lasts for up to 9 months after information release. He also found that small traders react later than large traders if the earning surprise differs from the previous earnings surprise, and that small traders’ reaction is quicker when the earnings surprise is late in the series of same type surprise. He also noticed that small traders react weaker than large traders to analysts’ forecast based surprise. Shantikumar (2004) concludes that: “Our return results that initial underreaction, by both large and small traders, is a major factor driving drift. But we also find strong evidence of eventual overreaction in small-trader behaviour, suggesting that investor underreaction and correction is not the full story.” Additional knowledge of institutional investors’ trading behaviour was presented by Baker et al (2010) who studied one particular group – mutual funds. Their study looked at PEAD from the opposite side, they studied mutual funds’ performance at its probable sources, among them performance that can be attributed to PEAD. Authors looked at mutual funds trading preceding earnings announcements to find evidence of fund managers skill or lack of it. Their evidence proves that mutual fund managers indeed are skilled at predicting next earnings numbers. The stocks bought by mutual funds outperform the market at the next profit announcement, and vice versa sold stocks underperform. Mutual funds trades can predict not only stock performance at the nearest earnings announcement but also the standardized unexpected earnings. They also documented that meaningful fraction of the mutual funds outperformance is concentrated around earnings announcement dates, which suggest that mutual funds are profiting from PEAD and it is one of their most valuable trading patterns. They conclude that: “Overall, our results confirm the existence of skilled trading among mutual funds and also shed new light on its source, namely, an ability to forecast earnings fundamentals”. 26 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 69,
    "chunk_index": 48,
    "word_count": 390,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "are profiting from PEAD and it is one of their most valuable trading patterns. They conclude that: “Overall, our results confirm the existence of skilled trading among mutual funds and also shed new light on its source, namely, an ability to forecast earnings fundamentals”. 26 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 69,
    "chunk_index": 49,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Ali, Klasa and Li (2008) went a step further to find out which group of institutional investors is responsible for the profitable trading at the time of earnings announcement and prove that it is the group holding medium size stakes in the company. According to their argument, the funds holding the biggest stakes are committed to the company, and do not make short term trades, some of them may be prohibited to trade according to regulation. On the other side the funds holding the smallest stakes do not focus their analytical potential on those stocks as the marginal profits of such work would be too low. Ke and Ramalingegowda (2005) studied institutional investor behaviour to find out if they explore post earnings announcement drift in their investment strategy, and found that only one group of investors, named by them “transient”, do explore PEAD. They estimate that “transient” investors earn 22% annualized return trading based on PEAD, that their trades accelerate market reaction to earnings surprise announcement and that they trade less aggressively in firms with high transaction costs. In their research they divided institutional investors into three separate groups: transient – the group that trades most aggressively and therefore is more likely to look for profitable trading patterns, dedicated – the group holding active positions for longer term and quasi-indexing – the group that manages their portfolios passively. They conducted their research based on a sample of 58,214 companies in the period 1986-1999. Their calculations prove that “transient” institutional investors are the only group that exploits PEAD and earn an abnormal return 5.1% quarterly. However, despite the hefty profits generated by trading on PEAD, it is not their dominant trading pattern. Portfolio changes attributed to PEAD make only 23% of total portfolio changes in that group. Changes in their portfolio are also negatively related to positive earnings surprise in the previous quarter, which means that they exploit PEAD for only 3 months and then unwind their positions. Hedge funds are a typical “transient” investor – they trade more, they do use index as their benchmark and actively look for profitable trading patterns. A detailed study of hedge funds investment style was conducted by Griffin and Xu (2009). They decomposed hedge funds’ returns to find how they produce their abnormal returns and found that neither their stock picking nor stock timing abilities are better than mutual fund managers. They found evidence that hedge funds concentrate their portfolios among smaller size value firms. Conclusions from Griffin and Xu (2009) suggest that most of the abnormal profits come from investment style, not from profitable trading or stock picking, which would put into question their use of PEAD. Taylor (2010) on the other hand studied individual investors behaviour around earnings announcement. He found that individual investors significantly increase their share in daily trading volume around earnings announcement. His evidence proves that individual investors increase 27 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 69,
    "chunk_index": 50,
    "word_count": 486,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "would put into question their use of PEAD. Taylor (2010) on the other hand studied individual investors behaviour around earnings announcement. He found that individual investors significantly increase their share in daily trading volume around earnings announcement. His evidence proves that individual investors increase 27 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 69,
    "chunk_index": 51,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "trading around announcement regardless of the level of earnings surprise, he divided stocks into quartiles based on earnings surprise and found increased individual investors’ activity in all quartiles. This fact means that individual investors are interested in the information content of earnings announcement but find it difficult to interpret the financial data in an efficient way. His other most pronounced conclusion is that individual investors trading around earnings announcement brings significant losses, which are statistically significant and much higher than losses incurred on trades in non-announcement periods. Which was confirmed by Barber et al (2008) who prove that retail investors trade in stocks that catch their attention, for example by press coverage. Additionally, Taylor (2010) proves that the increased losses are concentrated in firms which earnings report brings large amount of new information, and the subgroup that is mostly losing money is the non-affluent group – less trading, lower wealth level, lower activity. These conclusions reaffirm the suspicion that individual investors have problem with interpreting financial data in an unbiased, efficient way. He also studied the effect of contrarian retail trades on the adjustment of prices to new information and as he concluded: “These findings suggest that retail investors play an important role in the adjustment of prices to new information. When retail investors actively trade in the direction opposite to earnings signal, their trades exert a sufficient pressure to slow the adjustment of prices to earnings information.” This conclusion reaffirms the hypothesis that post earnings announcement drift exists due to trading of “naïve” investors as previously suspected by Bernard and Thomas (1989). Taylor (2010) findings reaffirm Barber et al (2008) findings, who proved that individual investors “move” markets due to their biased trading patterns. They proved that individual investors herd around the same investment ideas, their trades predict, in a systematic way, positive one-week returns and, on a one-year horizon, stocks that are heavily bought by retail investors underperform, and stocks heavily sold outperform, with a negative spread of 4.4%. Those conclusions, combined, prove that retail investors base their decisions on some common factors, and on average are wrong, which contributes to formation of market anomalies such as PEAD. Ayers et al (2010) examined whether post earnings announcement drift is associated with trading behaviour of varying investors groups defined based on their trade size. They used two varying earnings surprise definitions, one based on seasonal random walk earnings, and the other based on analysts’ earnings forecasts. Their justification behind this contradiction comes from their belief that “smaller trade” investors, are less affluent and less professional, which means that they do not have access to professional analysts’ reports and therefore use seasonal random walk 28 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 69,
    "chunk_index": 52,
    "word_count": 450,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the other based on analysts’ earnings forecasts. Their justification behind this contradiction comes from their belief that “smaller trade” investors, are less affluent and less professional, which means that they do not have access to professional analysts’ reports and therefore use seasonal random walk 28 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 69,
    "chunk_index": 53,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "earnings forecast in their decision-making process. On the other hand, “large trade” investors are more affluent and professional and will have access to analysts’ reports, therefore base their earnings prediction on analysts’ forecasts. They found that “large trade” investors react faster to earnings surprise, while reaction of the “small trade” investors is delayed and spread over 60-day period after earnings announcement. They also found that in cases when “small trade” investors react more aggressively to positive earnings surprise based on seasonal random walk earnings, the respective post earnings announcement drift attenuates. Consistent with the notion of “small trade” investors being “naïve”, they prove that small trades are predictable based on lagged one- and four- quarters earnings surprise, which proves that “small trade” investors delay their decision, creating the drift. Among the “large trade” investor group they found that the magnitude of the PEAD increases when analysts’ forecasts are more heterogenous, that is the range of forecasts is wider, which means that the surprise is more difficult to interpret. They also found evidence that the magnitude of PEAD among “large trade” investors based on analysts forecast surprise is more correlated with the analysts’ earnings forecast revision then with the earnings surprise, which means that investors base their decision on analysts’ opinion more than on their own judgement. The evidence presented by Ayers et al (2010) that more affluent investors rely more on analysts’ forecasts than earnings time series properties contradicts the findings of Richardson, Teoh and Wysocki (2004) who proved that analysts forecasts are biased by management guidance. Managers are incentivised to positively surprise market participants and punished for reporting earnings short of market expectations, therefore they engage in guiding the analysts to forecast earnings that will be easier to beat. More affluent investors should be aware of this bias and use the more accurate method of earnings forecasting that is seasonally adjusted time series. 1.4. PEAD interaction with other market anomalies As the sole existence of post earnings announcement drift became unquestionable, academics looked into interaction of PEAD with other anomalies. Collins and Hribar (2000) looked closer at Post Earnings Announcement Drift and accrual anomaly (Sloan 1996) as the two anomalies are based on reported earnings, to find if they capture the same market inefficiency or are they totally independent of each other. Third hypothesis they brought forward was if it is possible to combine the two anomalies to form an even better investment strategy. The first difference in those two anomalies is that PEAD was calculated based on quarterly data, while 29 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 69,
    "chunk_index": 54,
    "word_count": 428,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "totally independent of each other. Third hypothesis they brought forward was if it is possible to combine the two anomalies to form an even better investment strategy. The first difference in those two anomalies is that PEAD was calculated based on quarterly data, while 29 Electronic copy available at: https://ssrn.com/abstract=3281679 Sloan (1996) documented existence of accrual anomaly is based on annual earnings. The second difference is the time frame when the anomalies manifest their strength, PEAD is strongest in the 60 days after profit announcement and disappears after 180 days, while Sloan’s (1996) abnormal returns were calculated annually. To test independence of the two anomalies the authors formed ranking along both effects and then formed contingency tables to calculate marginal frequencies and degree of overlap of the formed portfolios. Figure 7 Abnormal returns for extreme SUE and joint SUE/ACC for a fixed 120 days window Source: Collins and Hribar (1999) page 41 From the evidence presented in the Figure 7, it is apparent that SUE portfolios and ACC portfolios are separate anomalies, as their effects sum up. It is also visible that combining the two effects produces even better investment strategy, which yields according to authors’ calculations a 11.94% return, which is roughly double the size of each of the anomalies alone. Second 30 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 69,
    "chunk_index": 55,
    "word_count": 219,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "are separate anomalies, as their effects sum up. It is also visible that combining the two effects produces even better investment strategy, which yields according to authors’ calculations a 11.94% return, which is roughly double the size of each of the anomalies alone. Second 30 Electronic copy available at: https://ssrn.com/abstract=3281679 observation is that positive post earnings announcement drift does not exist in high accrual portfolios and vice versa negative drift does not exist in low accrual portfolios. Based on their results authors conclude that earnings forecasting models may be improved by including the accrual and cash flow earnings component. Affleck-Graves and Mendenhall (1991) looked into post earnings announcement drift and Value Line “timeliness” rank. The Value Line rank known as “enigma” was a well-documented ranking method that sorted stocks based on their future performance, the source of their success was unknown, therefore the name “enigma”. Affleck-Graves and Mendenhall (1992) compared Value Line ranking with PEAD ranking and found that over half of Value Line “enigma” timeliness rank changes occur within eight trading days after earnings announcement. They also proved that the abnormal returns are concentrated among firms that recently announced earnings with large surprise and that the abnormal returns are negligible among other companies in the same “timeliness” rank group. When they controlled the “timeliness” rank for post earnings announcement drift effect, the outperformance disappeared. They concluded that Value Line success is nothing more than pure manifestation of post earnings announcement drift. Which means that investors have explored PEAD anomaly long before it was academically proven, and many investors probably did not even know that they are exploiting PEAD. Another property of SUE was examined by Narayanamoorthy (2006). He looked specifically at SUE autocorrelation to find that SUE series properties vary significantly for firms reporting profits and firms reporting losses. He proves that using accounting knowledge, investors can increase strength of PEAD strategy by differentiating the SUE series autocorrelation patterns. According to author’s conclusions, losses can be less sustainable due to accounting rule of conservatism, which obligates managers to recognize losses as soon as they are highly probable even if they are not incurred. Similar evidence was previously presented by Basu (1997) who proved that losses and earnings decreases have higher mean reverting properties than profit increases. This factor especially affects negative accruals, which may suggest that Narayanamoorthy (2006) findings are a restatement of earnings accrual effect evidenced by Collins and Hribar (1999), or at least the two effects are correlated. Narayanamoorthy (2006) looked closer at interaction of the two effects and found that even after controlling for accruals loss making firms have lower autocorrelation in their SUE, which proves that the groups do not totally overlap, but does not prove that they are disjunctive. Another combination of anomalies was evidenced by Sadka (2006) who looked into momentum and PEAD anomalies. He did not look for any interactions of the two anomalies, but 31 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 69,
    "chunk_index": 56,
    "word_count": 489,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "proves that the groups do not totally overlap, but does not prove that they are disjunctive. Another combination of anomalies was evidenced by Sadka (2006) who looked into momentum and PEAD anomalies. He did not look for any interactions of the two anomalies, but 31 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 69,
    "chunk_index": 57,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "rather tried to find a common explanation for their existence. His hypothesis was that limits to arbitrage in the form of costs and liquidity constraints are the variables useful in explaining the abnormal returns in light of the efficient market hypothesis. He points to the liquidity as a risk factor, which is a determining variable. He also points to the fact the both anomalies are rather short lived, which requires a lot of trading that blows up the cost component. His conclusions, although relevant, fail to explain the whole magnitude of both anomalies. Chordia and Shivakumar (2005) aimed to examine if the earnings momentum and price momentum anomalies are related. They used data for the period 1972-1999. In their research design they used zero risk portfolio (denoted PMN) with exposure to highest and lowest decile portfolios based on recent earnings surprise. They form the PMN portfolios based on earnings surprise ranking and putting an equal weight to all firms in one decile, they form a new portfolio each month, then they compute a portfolio return for the next six month following portfolio formation. That means that every month the computed return was a sum of six existing portfolios, of which five were carried forward and one was replaced by a new one. Their calculations show (Table 13) that PMN gives on average 0.90% return per month and 75% of positive observations. The return is statistically significant and gives positive return in 75% of all months. In assessing the price momentum, they used a similar methodology, that is they formed a ranking of stocks based on last six-months return and formed decile portfolios by equally weighting stocks in each portfolio. Returns of the portfolios are similarly assessed over a six-months period. They calculated that a zero-risk portfolio, formed as long in first decile portfolio and short in last decile portfolio, gives a statistically significant return of 0.76% per month with 65% of positive months. They also found that earnings momentum is not subsumed by price momentum, but the opposite is true, that is price momentum is subsumed by earnings momentum. The correlation between price momentum and earnings momentum portfolio is 0.66 and the price momentum portfolios have higher total variance of stock prices. They also cross-checked the PMN portfolios against business cycle metrics such as industrial production, GDP growth, consumption, labour income and inflation. They conclude that PMN is in fact related to business cycle proxies and is negatively correlated with the business cycle. Their results prove that the price momentum is a manifestation of the earnings momentum. Which means that the two most prevalent stock market anomalies may in fact be just one anomaly and that price momentum factor in multi factor risk models may be just a noisy proxy for earnings momentum anomaly. 32 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 69,
    "chunk_index": 58,
    "word_count": 470,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "is a manifestation of the earnings momentum. Which means that the two most prevalent stock market anomalies may in fact be just one anomaly and that price momentum factor in multi factor risk models may be just a noisy proxy for earnings momentum anomaly. 32 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 69,
    "chunk_index": 59,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Table 13 Monthly returns on SUE and Momentum portfolios Panel A: SUE Portfolios High- Low 2 3 4 5 6 7 8 9 High Low Jan 1972 – Dec 1999 Mean (%) 0.79 0.97 1.06 1.21 1.34 1.45 1.51 1.60 1.60 1.68 0.90 t-stat 2.36 3.10 3.32 3.75 4.23 4.66 4.90 5.25 5.32 5.69 7.47 %>0 56.55 58.04 59.52 60.12 61.31 61.31 63.69 63.10 61.90 63.10 75.60 Jan 1972 – Dec 1979 Mean (%) 0.66 0.97 1.11 1.25 1.38 1.39 1.51 1.52 1.63 1.63 0.96 t-stat 0.83 1.26 1.42 1.57 1.79 1.85 2.05 2.14 2.36 2.45 2.95 %>0 46.88 50.00 52.08 50.00 53.13 53.13 54.17 55.21 56.25 56.25 77.08 Jan 1980- Dec 1989 Mean (%) 0.90 1.06 1.12 1.37 1.52 1.67 1.69 1.84 1.85 1.95 1.05 t-stat 1.79 2.16 2.25 2.74 3.07 3.36 3.39 3.67 3.69 3.94 7.11 %>0 59.17 60.00 59.17 63.33 63.33 61.67 65.83 64.17 62.50 65.00 79.17 Jan 1990- Dec 1999 Mean (%) 0.77 0.89 0.95 1.02 1.14 1.29 1.32 1.43 1.32 1.46 0.69 t-stat 1.75 2.24 2.33 2.51 2.74 3.23 3.44 3.57 3.36 3.62 4.54 %>0 61.67 62.50 65.83 65.00 65.83 67.50 69.17 68.33 65.83 66.67 70.83 F-Test 0.78 0.79 0.79 0.81 0.76 0.61 0.63 0.52 0.68 0.52 0.66 Panel B: Momentum Portfolios High- Low 2 3 4 5 6 7 8 9 High Low Jan 1972 – Dec 1999 Mean (%) 0.84 1.08 1.24 1.25 1.32 1.35 1.33 1.36 1.40 1.60 0.76 t-stat 1.75 3.05 3.87 4.15 4.58 4.72 4.71 4.73 4.72 4.77 2.48 %>0 50.89 55.36 59.52 61.90 62.50 63.69 63.69 63.39 62.80 63.99 65.48 Jan 1972 – Dec 1979 Mean (%) 1.25 1.24 1.23 1.20 1.13 1.14 1.22 1.24 1.28 1.41 0.16 t-stat 1.17 1.42 1.53 1.61 1.60 1.66 1.82 1.85 1.90 1.95 0.25 %>0 46.88 46.88 52.08 56.25 52.08 53.13 54.17 54.17 55.21 59.38 65.63 Jan 1980- Dec 1989 Mean (%) 0.30 1.09 1.42 1.46 1.63 1.71 1.61 1.71 1.74 1.74 1.44 t-stat 0.47 2.14 2.98 3.15 3.50 3.66 3.40 3.51 3.37 2.96 4.28 %>0 50.83 57.50 60.83 63.33 65.83 65.83 65.00 65.00 65.00 64.17 67.50 Jan 1990- Dec 1999 Mean (%) 1.05 0.94 1.08 1.07 1.17 1.15 1.14 1.10 1.17 1.62 0.57 t-stat 1.28 1.92 2.59 2.87 3.35 3.34 3.31 3.13 3.15 3.55 0.97 %>0 54.17 60.00 64.17 65.00 67.50 70.00 70.00 69.17 66.67 67.50 63.33 F-Test 0.70 0.95 0.91 0.86 0.73 0.64 0.76 0.64 0.70 0.93 0.23 Source: Chordia and Shivakumar (2005) page 28-29 Chordia and Shivakumar (2005) documented seasonality of PEAD strategy. The zero risk PEAD strategy gives positive results in 11 months, only January’s returns are negative -1.42%, the best months for PEAD strategy are December, October, July and April, while May, February, 33 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 69,
    "chunk_index": 60,
    "word_count": 451,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "(2005) page 28-29 Chordia and Shivakumar (2005) documented seasonality of PEAD strategy. The zero risk PEAD strategy gives positive results in 11 months, only January’s returns are negative -1.42%, the best months for PEAD strategy are December, October, July and April, while May, February, 33 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 69,
    "chunk_index": 61,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "March and August returns are statistically insignificantly different from 0%. Most of the variation in zero risk return comes from variation in P1 portfolio (most negative SUE), which performs very poorly in the second half of the year with negative average monthly return of -0.32%, compared with 1.03% for P10 portfolio. The unusual January returns are consistent with other observations of the January effect, when also momentum strategy gives negative results, as shown by Jegadeesh and Titman (1993). Calculations of monthly seasonality in PEAD returns are shown in Table 14. Table 14 Payoffs to SUE portfolios in each calendar month P1 P10 PMN=P10-P1 Mean t-stat Mean t-stat Mean t-stat (%) (%) (%) January 6.17 5.62 4.75 4.68 -1.42 -3.63 February 1.56 1.42 2.14 2.11 0.58 1.49 March 1.22 1.11 1.82 1.79 0.60 1.54 April 0.55 0.51 1.92 1.89 1.37 3.51 May 1.30 1.19 1.58 1.55 0.28 0.70 June 0.55 0.51 1.61 1.58 1.05 2.70 July 0.02 0.01 1.45 1.43 1.44 3.67 August -0.23 -0.21 0.50 0.49 0.73 1.87 September -0.92 -0.84 0.23 0.23 1.15 2.94 October -2.04 -1.86 -0.30 -0.30 1.74 4.46 November 0.95 0.86 2.22 2.19 1.28 3.27 December 0.30 0.27 2.28 2.24 1.98 5.06 Average 0.30 0.90 1.40 4.60 1.11 9.30 Non-January F-test 0.00 0.11 0.00 (p-value) Source: Chordia and Shivakumar (2005) page 39 Post earnings announcement drift is defined as the delayed price response to unexpected earnings information, which is the difference between the announced earnings number and the expected number. Part of the problem is how to find the expected earnings value which is unobservable. Early PEAD research used the simple four-quarters lagged earnings as the expected value, then Foster (1977) presented convincing evidence that seasonally adjusted time series trend earnings are the most accurate predictor of future earnings, however, further evidence (Bernard and Thomas (1989)) proved that investors fail to understand the correct earnings prediction model. Brandt et al (2008) tried to overcome the problem of correct earnings forecast model in evaluating PEAD. They assumed that the initial market reaction as measured by “Earnings Announcement Return” (EAR) is the best measure of earnings surprise. EAR is unbiased by the earnings prediction model, and it encompasses all the information presented in the financial report, not only the earnings level, but also revenue, margin, cash flow numbers etc., it also is a measure of all nonnumerical information presented in the report, like management commentary, predictions presented in the report and any other information deemed important by investors. 34 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 69,
    "chunk_index": 62,
    "word_count": 416,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "financial report, not only the earnings level, but also revenue, margin, cash flow numbers etc., it also is a measure of all nonnumerical information presented in the report, like management commentary, predictions presented in the report and any other information deemed important by investors. 34 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 69,
    "chunk_index": 63,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "They ranked stocks based on EAR to form quantiles, the first quantile, that is with the highest return after earnings announcement, was named “good news” firms, while the extreme negative quantile was named “bad news” firms. They prove that the abnormal stock returns tend to drift in the direction of the EAR for the four consecutive quarters. Investment strategy based on buying long the “good news” portfolio and selling short the “bad news” portfolio earns a 6.3% abnormal annual rate of return. Table 15 presents cumulative abnormal returns for EAR quantile portfolios for periods 60-360 days after profit announcement, the spread between the “bad news” portfolio (EAR1) and the “good news” portfolio drifts significantly for the first 240 days after profit announcement to 6.28%. However, the outperformance of the “good news” portfolio drifts for another 120 days up to 360 days after profit announcement. On the other hand, the “bad news” portfolio underperforms for the first 180 days, and then outperforms beyond 3 quarters after announcement, these results are very similar to observations of SUE portfolios presented by Bernard and Thomas (1989). Table 15 Cumulative abnormal returns for EAR and SUE quantile portfolios over 60-360 days period after earnings announcement 35 syad gnidarT sgninrae gniwollof tnemecnuonna EAR1 EAR2 EAR3 EAR4 EAR5 EAR spread 60 -1.17 -0.33 0.18 0.88 1.66 2.84 120 -1.48 -0.11 0.26 0.88 2.21 3.69 180 -2.33 -0.43 0.25 1.05 3.06 5.39 240 -2.38 -0.40 0.12 1.43 3.90 6.28 300 -2.18 0.10 0.73 1.32 4.02 6.21 360 -1.83 -0.05 0.62 1.38 4.40 6.23 syad gnidarT sgninrae gniwollof tnemecnuonna SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread 60 -1.18 -0.54 0.23 0.91 1.76 2.95 120 -1.97 -0.73 0.37 1.41 2.61 4.57 180 -2.73 -0.83 0.68 1.53 2.93 5.65 240 -2.92 -0.09 1.41 1.56 2.71 5.63 300 -2.35 0.26 1.50 2.04 2.53 4.88 360 -2.37 0.20 1.76 2.07 2.83 5.20 Source: Brandt, Kishore, Santa-Clara and Venkatachalam (2007) page 30 Table 16 SUE and EAR quantile portfolios overlap – fraction of firms in each quantile RAE selitniuQ SUE Quantiles SUE1 SUE2 SUE3 SUE4 SUE5 EAR1 0.28 0.22 0.19 0.16 0.15 EAR2 0.22 0.22 0.21 0.19 0.17 EAR3 0.19 0.21 0.21 0.20 0.19 EAR4 0.17 0.19 0.21 0.21 0.22 EAR5 0.14 0.16 0.19 0.23 0.27 Source: Brandt, Kishore, Santa-Clara and Venkatachalam (2008) page 29 To evaluate interaction between EAR and SUE strategies Brandt, Kishore, Santa-Clara and Venkatachalam (2007) considered two-dimensional trading strategies, where they ranked stocks Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 69,
    "chunk_index": 64,
    "word_count": 408,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "0.20 0.19 EAR4 0.17 0.19 0.21 0.21 0.22 EAR5 0.14 0.16 0.19 0.23 0.27 Source: Brandt, Kishore, Santa-Clara and Venkatachalam (2008) page 29 To evaluate interaction between EAR and SUE strategies Brandt, Kishore, Santa-Clara and Venkatachalam (2007) considered two-dimensional trading strategies, where they ranked stocks Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 69,
    "chunk_index": 65,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "independently on EAR and SUE and evaluated the cross-section of the two rankings, that is rank an EAR quantile portfolio based on SUE and vice versa. Table 16 presents the distribution of stocks among various EAR/SUE quantiles. As the table shows only less than 30% of stocks overlap both rankings in extreme quantile portfolios. That fact suggests that EAR and SUE abnormal returns and independent variables and do not subsume each other. Table 17 Post Announcement cumulative abnormal returns based on independent sorts of SUE and EAR portfolios 60 Days SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread EAR1 -2.07 -1.36 -0.57 -1.22 0.10 2.17 EAR2 -1.35 -0.87 -0.41 0.51 0.83 2.18 EAR3 -0.92 -0.30 0.30 0.64 1.32 2.23 EAR4 -0.53 -0.04 0.41 1.76 1.84 2.37 EAR5 -0.60 -0.38 1.42 2.03 3.61 4.20 EAR spread 1.47 1.73 1.99 3.25 3.51 120 Days SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread EAR1 -3.36 -2.34 -1.03 -0.38 0.61 3.97 EAR2 -1.69 -0.78 0.19 1.11 1.50 3.19 EAR3 -1.90 -0.54 0.44 1.30 2.08 3.98 EAR4 -1.13 0.02 0.94 1.55 2.35 3.48 EAR5 -1.11 0.17 1.30 3.10 4.95 6.06 EAR spread 2.25 2.51 2.33 3.48 4.34 180 Days SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread EAR1 -4.92 -2.88 -1.07 -0.29 -0.67 4.25 EAR2 -2.00 -1.63 0.25 0.20 1.70 3.69 EAR3 -2.24 -0.17 -0.01 1.61 2.16 4.40 EAR4 -1.36 -0.04 1.33 1.56 2.99 4.34 EAR5 -1.65 1.09 2.91 3.75 6.24 7.89 EAR spread 3.27 3.97 3.97 4.04 6.91 240 Days SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread EAR1 -5.09 -1.53 -1.73 -0.46 -0.90 4.19 EAR2 -2.24 -1.27 0.86 -0.32 1.42 3.66 EAR3 -2.78 -0.07 0.76 0.87 1.87 4.65 EAR4 -1.54 0.98 1.80 2.76 2.62 4.16 EAR5 -1.85 2.49 5.24 4.14 6.28 8.13 EAR spread 3.24 4.02 6.98 4.60 7.18 360 Days SUE1 SUE2 SUE3 SUE4 SUE5 SUE spread EAR1 -3.90 -1.50 -0.71 -0.60 -1.14 2.77 EAR2 -1.40 -1.20 1.03 -0.56 2.38 3.78 EAR3 -2.34 0.52 1.48 2.05 1.29 3.64 EAR4 -2.20 0.74 1.86 2.86 2.79 4.99 EAR5 -0.92 3.16 5.33 5.41 6.45 7.38 EAR spread 2.98 4.66 6.04 6.01 7.59 Source: Brandt, Kishore, Santa-Clara and Venkatachalam (2008) page 31 Table 17 presents abnormal returns for combined EAR/SUE strategies in 240 days horizon. As the evidence presented in the table shows, the two strategies produce abnormal returns independently, the EAR spread is positive for all SUE quantile portfolios, and the SUE spread is 36 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 69,
    "chunk_index": 66,
    "word_count": 401,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "31 Table 17 presents abnormal returns for combined EAR/SUE strategies in 240 days horizon. As the evidence presented in the table shows, the two strategies produce abnormal returns independently, the EAR spread is positive for all SUE quantile portfolios, and the SUE spread is 36 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 69,
    "chunk_index": 67,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "positive for all EAR quantile portfolios. What’s also interesting SUE and EAR ranking seem to convene incremental information, the SUE spread is highest for highest EAR, and the EAR spread is highest (lowest) for highest (lowest) SUE portfolios. Figure 8 Cumulative abnormal returns for extreme EAR and SUE portfolios and a combined SUE/EAR portfolio up to 240 days after profit announcement. Source: Brandt, Kishore, Santa-Clara and Venkatachalam (2008) page 38 Figure 8 presents results obtained for joined EAR/SUE portfolios compared with separate EAR and SUE portfolios for periods up to 240 days. The joined EAR/SUE portfolio is much higher than separate SUE and EAR portfolios, and only a bit lower than the sum of separate EAR and SUE portfolios. This suggests that even though, the two measures were designed to capture the same anomaly, they convey differing information and their covariance is low, making it beneficial to combine the two rankings to produce even better investment strategy. The data also shows that the path of cumulative abnormal returns varies significantly between the two measures, EAR earns its returns in the first 60 days, and then around 180th day, with the rest of the return line being almost flat, while SUE strategy produces its abnormal return in a more constant pace. Brandt et al (2008) also recalculated the results for simple SUE quantile portfolios with their dataset (1987-2004), Figure 8. Their results support existence of PEAD, but its magnitude has almost halved since Bernard and Thomas (1989), the only difference being Brandt et al (2008) used quantile portfolios, while Bernard and Thomas used decile portfolios, their best minus worst 37 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 69,
    "chunk_index": 68,
    "word_count": 274,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "their dataset (1987-2004), Figure 8. Their results support existence of PEAD, but its magnitude has almost halved since Bernard and Thomas (1989), the only difference being Brandt et al (2008) used quantile portfolios, while Bernard and Thomas used decile portfolios, their best minus worst 37 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 69,
    "chunk_index": 69,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "portfolio produced 5.32% spread in 60 days versus 2.95% in Brandt et al (2008) and 10.47% spread after 240 days versus 5.63% in Brandt et al (2008). 1.5. Variations of PEAD Since the effect of stock price drift after earnings announcement was well proven, academics looked at other possible signals that may improve the effects of PEAD. Livnat (2003) – turned his attention to revenue surprise as a different factor in constructing PEAD portfolio. His hypothesis that revenue surprise may be a better predictor of future earnings surprise came from the fact that revenue surprise is more persistent in time than earnings surprise (Ertimur et al (2003)). As the earnings are a difference of revenue and expenses, and expenses are easier then revenue to manage internally, the external factor causing the earnings surprise should be valued higher than the earnings themselves. He conducted his research based on a varying size sample (from 1739 stocks in 1987 to 3557 stocks in 2002) for period 1987-2002 to prove that PEAD is stronger among firms whose earnings surprise is confirmed by positive revenue surprise and is substantially subsumed among firms, whose earnings surprise came from managing costs. Livnat’s (2003) study shows that revenue surprise and earnings surprise are highly correlated (number of companies in the diagonal of the Table 18 is much larger than on the edges) and their combination produces better results than earnings alone, which proves that revenue surprise, probably due to its higher persistence is a good accompanying variable in constructing PEAD portfolio. Jegadeesh and Livnat (2006) extended the academic examination of revenue surprise as independent drift variable. They proved that revenue surprise is a good predictor of future earnings surprise and future earnings announcement day returns. They also prove that analysts do incorporate revenue surprise in their one to four quarter ahead forecasts, but additionally the revenue surprise is positively correlated with future analysts’ earnings revisions, which means that analysts’ do not incorporate the full information contained in revenue surprise right after announcement but spread the revisions in a longer timeframe. Revenue analysis seemed a natural addition to earnings information, the other financial data that has the most direct impact on earnings information is the cost line. Doyle et al (2003) studied one particular type of cost, that is the costs excluded from earnings number when companies 38 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 69,
    "chunk_index": 70,
    "word_count": 394,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "seemed a natural addition to earnings information, the other financial data that has the most direct impact on earnings information is the cost line. Doyle et al (2003) studied one particular type of cost, that is the costs excluded from earnings number when companies 38 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 69,
    "chunk_index": 71,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "present “pro forma” earnings. Their aim was to check if really the excluded costs are “unimportant” from investor perspective and do investors understand correctly the meaning of excluded costs. They found that pro forma earnings predict lower future cash flows and are negatively related to future stock returns. They prove that firms with highest cost exclusions face 29.9% lower total return over a three-year period. Their results show that investors should pay attention not only to revenue as the more stable predictor of future earnings, but also on the part of costs that are excluded from reported pro forma earnings, as they are a predictor of lower future earnings. Table 18 Distribution of abnormal returns – SUE (SUS) Groups Panel A: Historical SUE and SUS DSUS Bottom Middle Top Total 30% 40% 30% Bottom CAR (%) -2.38 -2.32 -2.01 -2.30 30% N 25254 16796 7892 49942 Significance 0.001 0.001 0.001 0.001 Middle CAR (%) -1.13 -0.41 -0.05 -0.49 40% N 16232 30361 17886 64479 Significance 0.001 0.001 0.766 0.001 DSUE Top 30% CAR (%) 0.57 1.52 2.07 1.64 N 7903 17824 24253 49980 Significance 0.029 0.001 0.001 0.001 Total CAR (%) -1.50 -0.37 0.67 -0.39 N 49389 64981 50031 164401 Significance 0.001 0.001 0.001 0.001 Panel B: Analyst Forecast DSUS Earnings and Sales Surprises Bottom Middle Top Total 30% 40% 30% Bottom CAR (%) -1.67 0.15 2.95 -0.25 DSUE 30% N 1050 897 355 2302 Significance 0.062 0.867 0.063 0.669 Middle CAR (%) -0.03 -0.57 0.20 -0.25 40% N 1114 1972 880 3966 Significance 0.967 0.312 0.805 0.531 Top 30% CAR (%) 2.10 2.41 4.48 3.11 N 496 1326 1042 2864 Significance 0.067 0.001 0.001 0.001 Total CAR (%) -0.28 0.53 2.59 0.80 N 2660 4195 2277 9132 Significance 0.587 0.187 0.001 0.003 Cumulative abnormal return of portfolios formed based on surprise earnings (SUE) and surprise revenue (SUS) for the period 1 day after report announcement through the day of the next earnings report announcement Source: Livnat (2003) page 35 The least noticed and researched element of financial reports is the management comment. Feldman, Govindaraj, Livnat and Segal (2010) looked at the management discussion in financial reports as an additional variable predicting future stock returns. They define the tone of management discussion as positive or negative based on number of words classified as positive or negative. However, they point to the fact, that it was not the level of pessimism or optimism, but 39 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 69,
    "chunk_index": 72,
    "word_count": 409,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "additional variable predicting future stock returns. They define the tone of management discussion as positive or negative based on number of words classified as positive or negative. However, they point to the fact, that it was not the level of pessimism or optimism, but 39 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 69,
    "chunk_index": 73,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "its change in tone from the most recent report, that affected investors’ reaction. The autocorrelation between adjacent report’s tone is very high, they show that the correlation coefficient is 70% for negative tone and 65% for positive tone, which means that managements’ views and opinion change slowly and a surprise tone change is not likely but is very valuable and persistent when it happens. They verified their hypothesis based on sample data from period 1993-2007 and showed that management’s tone change is a significant additional factor, next to accruals and earnings number, that explains price drift after financial report announcement, they also prove that the level of tone itself is not statistically significant is explaining price drift. Their results show that hedged portfolio (positive tone change minus negative tone change) produces a 1.3% abnormal return over a 90-day period after controlling for SUE and accruals. 1.6. Transaction costs Bushee and Raedy (2005) verified seven well known and documented investment strategies with real world trading constraints, divided into two categories unavoidable and avoidable. The unavoidable category includes such factors as: explicit trading costs, price pressure related to block trades and short selling, the avoidable group includes maximum stake size limit, maximum portfolio weight constraint, minimum price constraint, maximum price impact and fund management characteristics. The PEAD anomaly was one of the four to survive all the implementability constraints, and still earn positive abnormal returns. The magnitude of PEAD abnormal return was reduced by 35% through implementation of all the trading constraints, from 7.2% to 4.7%. The authors conclude that: “post earnings announcement drift strategy generates positive abnormal return after including all of the implementability constraints … could be implemented across a broad range of realistic situations.” Table 19 presents authors calculations for all examined anomalies and costs categories. Among all the transaction costs categories, the maximum stake constraint is the most expensive one, as it potentially reduces the exposure to smaller companies, but its significance is dependent on investor’s portfolio size. A more detailed look at the costs associated with exploiting PEAD was prepared by Chordia et al (2009). The authors concentrated their research on estimating indirect trading costs based on 40 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 69,
    "chunk_index": 74,
    "word_count": 366,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the exposure to smaller companies, but its significance is dependent on investor’s portfolio size. A more detailed look at the costs associated with exploiting PEAD was prepared by Chordia et al (2009). The authors concentrated their research on estimating indirect trading costs based on 40 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 69,
    "chunk_index": 75,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "liquidity of the stock. They found that the magnitude of PEAD is very low among the most liquid stocks, only 0.04% monthly return, and is highest among the least liquid stocks, 2.43% monthly. After estimating costs of spread and market impact, they found that the total costs account for 70%-100% of the magnitude of the anomaly. They proved that o $5 million long-short portfolio designed to exploit the post earnings announcement drift is not profitable, because of the trading costs. Table 19 Average annual abnormal returns to trading strategies with and without trading constraints (No price impact adjustment) Maximum Maximum Maximum Portfolio Minimum Price Strategy Stake Weight Price Impact No Constraint Constraint Constraint Constraint All constraints Only Only Only Only Constraints Book-to- .095 .001 .096 .101 .093 .004 Market Cash Flow- .117 .038 .119 .103 .116 .044 to-Price Return .060 .044 .061 .058 .066 .051 Momentum Operating .069 -.009 .079 .036 .056 .004 Accruals Return .051 -.019 .056 .048 .061 .020 Reversals Size .016 -.085 .017 .034 .022 -.046 PEAD .105 .058 .106 .094 .103 .061 Source: Bushee and Raedy (2005) page 42 Ng et al (2008) also looked at the transaction costs for an explanation of PEAD existence. They used relative bid-ask spread plus commission as a measure of costs of making a round trip trade. They divided firms into clusters based on their level of transaction costs to check if the magnitude of post announcement drift is correlated with the level of transaction costs. They also showed the mechanics of a trade exploiting announced unexpected earnings, proving that arbitrage cannot totally adjust market price to new equilibrium due to trading cost barrier, therefore the market price tends to drift in the direction of earnings surprise. They used data from years 1998 to 2005 to verify their hypothesis. They defined the earnings surprise as the difference of reported earnings and earnings reported four quarters before, divided by market value of company four quarters before. The decile portfolios created using that definition have couple of interesting characteristics. Namely, average beta is highest in extreme portfolios and lowest in middle decile portfolios, average firm size is lowest in extreme portfolios and highest in the middle of the ranking, also the total stock volatility is highest in extreme portfolios and lowest in the middle of the ranking, these characteristics are very similar to observations shown by Doyle et al (2006) . 41 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 69,
    "chunk_index": 76,
    "word_count": 405,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "lowest in extreme portfolios and highest in the middle of the ranking, also the total stock volatility is highest in extreme portfolios and lowest in the middle of the ranking, these characteristics are very similar to observations shown by Doyle et al (2006) . 41 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 69,
    "chunk_index": 77,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "The computed total cost of trade equals to 4.53% and 4.04% for extreme portfolios and only 1.45% for middle portfolio, Figure 9 presents comparison of magnitude of PEAD effect and transaction costs for all years in authors’ sample. Figure 9 Abnormal returns (AbRet12) and transaction costs (ESpread) by calendar year for PEAD trading strategy – long first decile portfolio, short last decile portfolio. Source: Ng, Rusticus and Verdi (2008) page 690 These observations clearly prove that extreme decile portfolios are riskier and cost of trading is more than two times higher than for middle decile portfolios. On the other hand, authors also looked at initial market reaction to surprise earnings announcement and found that the magnitude of the initial reaction is positively corelated with the transaction costs, which also offers an explanation why firms with higher transaction costs experience higher post announcement drift. This observation is also consistent with efficient investor behaviour, as investors are discouraged from trading in stocks with higher transaction costs, which they perceive as higher risk trades. Their results lead them to conclusion that indeed post earnings announcement drift is higher among firms with higher transaction costs and second conclusion: that “earnings response coefficient” is lower among firms with higher transaction costs. Their results also show, that after adjusting for transaction costs, profitability of the strategy is equal for firms with lower and higher transaction costs. The last conclusion means that the PEAD does offer abnormal returns, and the variations of the magnitude of the drift are only a reflection of trading costs. Another addition to trading costs research segment was offered by Battallio and Mendenhall (2011) who looked at exact timing of earnings announcement and liquidity costs as potential 42 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 69,
    "chunk_index": 78,
    "word_count": 290,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "returns, and the variations of the magnitude of the drift are only a reflection of trading costs. Another addition to trading costs research segment was offered by Battallio and Mendenhall (2011) who looked at exact timing of earnings announcement and liquidity costs as potential 42 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 69,
    "chunk_index": 79,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "additive information factors. Most of the prior PEAD research is based on assumption, that investors can trade on earnings announcement date at the closing price, which is true in most cases, but as Battallio and Mendenhall (2011) point out, according to their detailed study, in around 33.7% cases this means investors trade prior to real time of earnings announcement. The authors, using actual earnings announcement date and time, established the first closing price investors are able to trade based on announced earnings information. They found that moving the date of the trade by one day, changes the abnormal returns, by 3.78% per quarter. They recomputed the PEAD abnormal returns, based on the first real closing price after earnings announcement and added the component of potential intraday abnormal return achieved by trading right after the time of the financial report announcement. Authors also focus their attention on liquidity cost, because investors willing to trade quickly after earnings announcement are constrained most of all by available liquidity and the bid-ask spread at the time right after profit announcement. Table 20 Normal (non-event) and event-time bid-ask spreads Good News Bad News N=2,637 N=3,595 Normal Actual Normal Actual Mean 2.69% 3.39% 3.63% 4.81% 75th percentile 3.48% 4.44% 4.79% 6.45% Median 1.97% 2.26% 2.79% 3.45% 25th percentile 1.01% 1.02% 1.50% 1.59% Std. dev. 2.52% 3.74% 3.12% 4.82% Source: Battallio and Mendenhall (2011) page 530 They also calculate the liquidity cost based on real data at the time of the potential trade as opposed to previous research which assumed that the bid-ask spread is constant over time and take the average spread in their calculations. Their data shows that on average the actual spread at the time of profit announcement is higher by 50% for good news portfolios and 30% for bad news portfolios. Battallio and Mendenhall (2011) calculations show that investors can earn a gross abnormal return of 7.30% by investing in first decile portfolio, and 3.19% by shorting the last decile portfolio, which gives an 10.49% gross abnormal quarter return for a long-short spread portfolio. Similar calculations conducted based on announcement date closing price as defined in previous research earn an abnormal return of 13.15%, and by delaying the first transaction by one day 10.49%. This proves that all previously presented PEAD abnormal returns were overstated by around a quarter, while delaying the transaction by one day is too conservative. After accounting for full liquidity costs at the time of announcement, the profitability of the strategy decreases significantly to 4.61% for first decile and 0.43% loss for last decile portfolios, the spread is still 43 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 69,
    "chunk_index": 80,
    "word_count": 436,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "while delaying the transaction by one day is too conservative. After accounting for full liquidity costs at the time of announcement, the profitability of the strategy decreases significantly to 4.61% for first decile and 0.43% loss for last decile portfolios, the spread is still 43 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 69,
    "chunk_index": 81,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "positive at 4.18%. All their results were proven statistically significant at 1% level. They conclude that: “Our results leave little doubt, therefore, that a marginal investor acting on an earnings surprise could have taken nontrivial positions that would have earned abnormal returns of at least 14% per year.” 1.7. Explanations of PEAD existence Previous research has generally ruled out transactions costs as possible explanation for existence of PEAD (Bearnard and Thomas 1989, Ball 1992). Bhushan (1994) focused his research on the relationship between direct and indirect transaction costs and the PEAD. He concludes that transaction costs in conjunction with limited information processing abilities can explain the drift. First, he noticed that the previously spotted correlation between firm size and drift size is in fact an artefact of the positive relationship between higher transaction costs and higher drift, as smaller firms are characterized by higher bid-ask spreads and higher indirect transaction costs. He argues that professional investors such as mutual funds do not engage in trading in smaller size firms, because of the low potential value of such transactions, which engages managers time while affects their returns in negligible way. On the other hand, individual investors are burdened by much higher transaction costs which discourages them from exploiting PEAD among small size firms. Therefore, the mispricing that appears after unexpected profit announcement takes longer to fade away. Transaction costs are also pointed as one of the factors affecting the magnitude of post announcement drift by Brown and Pope (1996). Authors looked into various potential explanations for the magnitude of the drift and found that the probability of surviving in the highest SUE (standardized unexpected error) decile is one of the explanatory variables. From previous research (Bernard and Thomas 1990) we know that firms are likely to stay in the same SUE decile for 3 quarters and then are more likely to move to opposite end of the ranking. Figure 10 presents their results, the first group of bars show that a firm in SUE decile 1 four quarters ago is most likely to end up in SUE decile 10 with probability almost 25%, on the other end of the ranking company from SUE 10 is most likely to advance to SUE 1 with 18% probability or stay in SUE 10 with 14% probability. 44 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 69,
    "chunk_index": 82,
    "word_count": 388,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "is most likely to end up in SUE decile 10 with probability almost 25%, on the other end of the ranking company from SUE 10 is most likely to advance to SUE 1 with 18% probability or stay in SUE 10 with 14% probability. 44 Electronic copy available at: https://ssrn.com/abstract=3281679 Figure 10 Conditional probability of SUE[t] given SUE [t-4] Source: Brown and Pope (1996) page 34 Companies included in the middle deciles 3-7 are equally likely to end up in any SUE decile four quarters later. These results suggest that in fact being a member of one of the extreme deciles is riskier, as it has a higher probability of change in SUE decile. They also point to the fact that SUE explanatory power is significantly diminished when controlled for financial distress risk. The other factor helpful in explaining the drift is the bid-ask spread, the authors point to the fact, that previous research used closing prices in computing the abnormal returns, which does not account for the bid-ask spread, they calculate, that for a small size firm, the bid-ask spread adjustment may be in similar magnitude as the PEAD itself. Another approach in explaining expectations forming process was presented by Maines and Hand (1996). They surveyed individuals equipped with 10-years series of earnings data, some of it fake and some real company data. Their observations show that forecasts were sensitive to serial correlation in EPS changes, however they observed systematic deviations in forecasting model parameters compared to the optimal one. Their results confirm that investors on average underestimate the moving average component of the earnings series. Interpretation of the autoregressive component was more complex. Investors on average correctly weighted the 45 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 69,
    "chunk_index": 83,
    "word_count": 287,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "however they observed systematic deviations in forecasting model parameters compared to the optimal one. Their results confirm that investors on average underestimate the moving average component of the earnings series. Interpretation of the autoregressive component was more complex. Investors on average correctly weighted the 45 Electronic copy available at: https://ssrn.com/abstract=3281679 autoregressive component when it was moderate, underweighted it when it was large, and overweighed it when it was non-existent or small. They also point to the fact that earnings are presented in the financial literature in comparison to data lagged four quarters, which may influence the way investors interpret the auto regression component of earnings surprise. Figure 11 Average 2-day announcement cumulative abnormal return (CAR[0,1]) against earnings surprise decile for “low-news days” and “high-news days” Source: Hirshleifer, Lim and Teoh (2009) page 2304 Underreaction was mentioned by many authors (eg. Bernard and Thomas (1989)) as possible explanation of PEAD existence. The next question is what causes the underreaction. Hirshleifer, Lim and Teoh (2009) studied investors behaviour to find possible answer to that question, their suspicion turned to investor distraction. The sources of limited investor attention can be varying, like: announcement during non-trading hours, down market periods, low trading volume, multiple announcements at the same time and many others. Humans attention is limited, people cannot process multiple information at the same time and can be easily distracted by other events that seem more, or equally, important. Successful analysis of new information requires time and attention, if the information consumer gets distracted, processing time will increase causing the drift in stock price to be extended not instantaneous, like the efficient market hypothesis assumes. Hirshleifer et al (2009) produced a ranking based on earnings surprise and then divided 46 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 69,
    "chunk_index": 84,
    "word_count": 291,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "time and attention, if the information consumer gets distracted, processing time will increase causing the drift in stock price to be extended not instantaneous, like the efficient market hypothesis assumes. Hirshleifer et al (2009) produced a ranking based on earnings surprise and then divided 46 Electronic copy available at: https://ssrn.com/abstract=3281679 announcement days to “high-news days” – days in top decile of number of announcements and “low-news days” – opposite side of ranking. Figure 12 Average 60-day announcement cumulative abnormal return (CAR[2,61]) starting from 2nd day after announcement to 60th day, against earnings surprise decile for “low-news days” and “high-news days” Source: Hirshleifer, Lim and Teoh (2009) page 2304 Figure 11 presents markets reaction for 10 SUE decile portfolios on day 0 and day 1 after profit announcement for “Low-news days” and “High news days”. Hirshleifer, Lim and Teoh (2009) found that good earnings announcement stocks on “high-news days” earn an abnormal return of 5.81%, while on “low-news days” the average market reaction was 7.02%, which means that indeed investor reaction is more subdued on “high-news days”. They also looked at the magnitude of PEAD on “high-news days” and “low-news days”, presented in Figure 12, and found that post earnings announcement drift is much stronger for firms announcing earnings on “high- news days”, 7.18% over 60 days, and only 2.66% over 60 days for “low-news days”. This evidence exactly supports investors’ inattention hypothesis. A special case of investor distraction was studied by DellaVigna and Pollet (2009) who concentrated their research on Friday earnings announcements to find if the day of earnings announcement affects the magnitude of PEAD. Investors are more likely to be preoccupied with weekend planning and other week deadlines, which makes it more likely that they will miss earnings information. 47 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 69,
    "chunk_index": 85,
    "word_count": 297,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "their research on Friday earnings announcements to find if the day of earnings announcement affects the magnitude of PEAD. Investors are more likely to be preoccupied with weekend planning and other week deadlines, which makes it more likely that they will miss earnings information. 47 Electronic copy available at: https://ssrn.com/abstract=3281679 Figure 13 Average monthly return for zero-investment drift portfolio, yearly Soure: DellaVigna and Pollet (2009) page 734 They found that PEAD for companies announcing results on Friday is 15% higher than on other weekdays. Almost 60% of companies announcing earnings on Friday will encounter delayed investors response comparing to 40% in other weekdays. This evidence supports underreaction hypothesis presented earlier by Bernard and Thomas (1989), as Friday inattention caused by other non-work-related activities makes investors react with a delay. DellaVigna and Pollet (2009) constructed a portfolio strategy that specifically exploits “Friday inattention effect” by buying a hedged PEAD portfolio for Friday announcing companies and selling short a PEAD portfolio constructed with companies announcing on other weekdays and holding the portfolios for one month. The average Friday portfolio consists of only 15 stocks; therefore, the returns are more volatile. Figure 13 presents performance of those two strategies in years 1995-2006. The Friday portfolio outperforms the other weekdays portfolio by, on average, 3.84% per month, and produces better returns in 10 out of 12 years. Authors studied also the distribution of PEAD across time for Friday announcement portfolios and other weekdays announcement portfolios, the results are presented in Figure 14. 48 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 69,
    "chunk_index": 86,
    "word_count": 254,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "other weekdays portfolio by, on average, 3.84% per month, and produces better returns in 10 out of 12 years. Authors studied also the distribution of PEAD across time for Friday announcement portfolios and other weekdays announcement portfolios, the results are presented in Figure 14. 48 Electronic copy available at: https://ssrn.com/abstract=3281679 The Friday portfolio has a slightly lower drift for the first 10 days following announcement and starts to significantly outperform only after 20th day. Authors propose two explanations to this phenomenon: ” investors do not realize that they have ignored an announcement until they revisit their investment decisions for other reasons” or “investors may mistakenly believe that after missing the opportunity to trade on the day of or the day after the announcement there is no benefit to trade during the subsequent week”. Figure 14 Drift performance as a function of horizon for Friday announcements and other weekdays announcements Soure: DellaVigna and Pollet (2009) page 728 deHaan et al (2015) offer a different explanation for varying post announcement price drift. They conjecture that its managements intentional action to announce negative news in times of lower investors’ attention. However, as they noticed Friday is not a low attention period, those periods are late announcement times and busy reporting days. They show that companies frequently change announcement times to hide or highlight news and earnings news in low attention periods tends to be worse. A market microstructure approach to explaining PEAD was presented by Chung and Hrazdil (2011) who constructed a market efficiency variable based on multivariate regression including 49 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 69,
    "chunk_index": 87,
    "word_count": 263,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "change announcement times to hide or highlight news and earnings news in low attention periods tends to be worse. A market microstructure approach to explaining PEAD was presented by Chung and Hrazdil (2011) who constructed a market efficiency variable based on multivariate regression including 49 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 69,
    "chunk_index": 88,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "measures of order imbalance and daily market illiquidity. They prove that firms in the highest market efficiency decile experience a 2.5% lower PEAD drift than firms in the lowest market efficiency decile. They also looked at other proxies of barriers to arbitrage and found that their market efficiency measure dominates other variables used beforehand, like transaction costs, volume, residual volatility and investor sophistication. According to their calculations, presented in Table 22, transaction costs almost fully eliminate PEAD in the most market efficient group, while only lower its magnitude in low market efficient group. These results are broadly in line with academic evidence by Ng et al (2008) and Chordia et al (2009). Table 21 Post Earnings Announcement Drift abnormal returns (CAR) and Market Efficiency Measure (ME) for unexpected earnings decile portfolios CAR [+1,+60] ME QSPR ESPR n Unexpected earnings Mean Median St dev Mean Mean Mean Decile 1 -0.0188 -0.0231 0.2806 -0.0633 0.0238 0.0177 6,131 Decile 2 -0.0186 -0.0173 0.2156 -0.0635 0.0154 0.0106 6,155 Decile 3 -0.0131 -0.0103 0.1842 -0.0630 0.0112 0.0076 5,256 Decile 4 -0.0064 -0.0037 0.2094 -0.0471 0.0110 0.0074 7,147 Decile 5 0.0004 0.0024 0.1997 -0.0559 0.0113 0.0079 6,307 Decile 6 0.0198 0.0177 0.1915 -0.0481 0.0077 0.0050 5,925 Decile 7 0.0074 0.0090 0.1994 -0.0562 0.0093 0.0062 6,158 Decile 8 0.0088 0.0107 0.2147 -0.0609 0.0115 0.0079 6,156 Decile 9 0.0179 0.0147 0.2241 -0.0627 0.0136 0.0095 6,158 Decile 10 0.0360 0.0259 0.2729 -0.0668 0.0192 0.0144 6,133 Total returns 0.0548 0.0490 0.0430 0.0310 (Decile 10 &Decile 1) ME – Market Efficiency Measure QSPR – Quoted Bid-Ask spread ESPRT – Effective Bid-Ask spread Source: Chung and Hrazdil (2011) page 939 Vega (2006) used a formal method in determining which variable causes the drift in prices. He used three variables – PIN – probability of private information-based trading, SUR – consensus public news surprise and MEDIA – number of days particular firm is mentioned in the news. He found that the information acquisition variables are correlated with increased activity of uniformed traders and have a different effect on the drift of price after information announcement than information acquisition variables correlated with increased activity of informed traders. The author’s empirical results prove that the more information the investors have about real value of the stock, the more they agree on the announced information and the more they trade on announced information the lower the drift after information announcement. Another explanation for PEAD magnitude was offered by Francis et al (2007) who examined post earnings announcement drift magnitude relatively to information uncertainty of the announced earnings (IU). They use a measure of IU previously introduced by Dechow and Dichev 50 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 69,
    "chunk_index": 89,
    "word_count": 440,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "drift after information announcement. Another explanation for PEAD magnitude was offered by Francis et al (2007) who examined post earnings announcement drift magnitude relatively to information uncertainty of the announced earnings (IU). They use a measure of IU previously introduced by Dechow and Dichev 50 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 69,
    "chunk_index": 90,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "(2002). The IU measure maps current accruals portion of earnings to cash flow, the lower the measure the higher the information uncertainty of the reported earnings, calculations of IU measure for all decile portfolios is presented in Table 22. Francis et al (2007) assume that rational investors react slower and weaker to information that is more noisy and harder to interpret, therefore in the unexpected earnings ranking, extreme portfolios are characterized by extreme information uncertainty. They prove that abnormal returns offered by accounting anomalies, especially PEAD are in fact investor’s response to high information uncertainty included in the earnings announcements. Table 22 Information Uncertainty of Securities in Unexpected Earnings Deciles Panel A: Mean Information Uncertainty of Securities in UE Deciles % D1 D2 D3 D4 D5 D6 D7 D8 D9 D10 Diff s-stat diff>0 0.045 0.037 0.033 0.032 0.030 0.031 0.031 0.032 0.033 0.038 0.007 32.49 98% Panel B: Proportion of High (low) Information Uncertainty Securities Within Extreme portfolios Low IU High IU Diff (t-stat) 17.0% 26.3% 43.52 Source: Francis, Lafond, Olsson and Schipper (2007) page 419 Similar conclusions were presented by Garfinkel and Sokobin (2006), they also blame investors’ earnings perception as the decisive factor. They however use a different measure on uncertainty, that is a pattern in daily volumes around earnings announcement day. Their logic is that if opinions about announced earnings diverge, some investors will be willing to sell stocks while others to buy stocks, therefore we see increased trading volume. Specifically, they define their measure as: “quantity of volume at the earnings announcement that is unexplained by prior trading behaviour”. They looked at analysts’ forecast divergence as a second possible proxy for investors opinion divergence. Authors examined their hypothesis on US stock market data from 1985 to 1998 and found that post-earnings announcement returns are increasing with increases in unexpected volume and are unrelated to changes in total volume. On the other hand, they found contradicting evidence when using analysts’ forecast dispersion as investor opinion divergence measure. Findings of Garfinkel and Sokobin (2006) were further developed by Lerman et al (2008), they however interpret the high-volume anomaly as separate phenomenon, that is complementary to PEAD, they also add a third complementary variable that is extraordinary return around earnings announcement. According to their reasoning high volume causes changes in stock visibility, that subsequently causes the post event drift. They inspect the relationship between abnormal returns 51 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 69,
    "chunk_index": 91,
    "word_count": 404,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "that is complementary to PEAD, they also add a third complementary variable that is extraordinary return around earnings announcement. According to their reasoning high volume causes changes in stock visibility, that subsequently causes the post event drift. They inspect the relationship between abnormal returns 51 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 69,
    "chunk_index": 92,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "and abnormal volume on stock market data from 1987 to 2006. Then they split the stocks into 25 cells based on abnormal volume measure quantiles and analyst forecast error quantiles. The quarterly spread in the volume ranking is 2.71% and, in the analyst forecast error ranking 4.31%, the combined ranking produces a spread of 7.64% between the high volume / high analyst forecast error and low volume/ low analyst forecast error. Table 23 shows their calculations for all cells. Table 23 Post-Earnings Announcement Drift Tabulated by Analyst Earnings Forecast Error and Abnormal Volume Rank for SUEAF 52 emulov rof knaR 0-Low 1 2 3 4-High All High- 20% 20% Low 0-Low 20% -2.67% -1.61% 0.34% 0.73% 1.04% -0.64% 3.71% <.001 <.001 0.237 0.033 0.011 <.001 <.001 7,026 6,593 5,667 4,994 5,030 29,310 1 -1.63% -0.40% 0.62% 0.74% 1.66% 0.18% 3.29% <.001 0.187 0.022 0.005 <.001 0.195 <.001 5,500 6,488 6,320 5,987 5,062 29,357 2 -1.56% -0.58% 0.84% 1.31% 1.58% 0.38% 3.14% <.001 0.049 0.002 <.001 <.001 0.006 <.001 5,065 5,990 6,470 6,296 5,534 29,355 3 -1.40% -0.15% 1.39% 1.28% 2,64% 0.86% 4.04% <.001 0.64 <.001 <.001 <.001 <.001 <.001 5,212 5,378 6,012 6,423 6,332 29,357 4-High 20% -1.21% 0.61% 2.21% 3.27% 4.97% 2.07% 6.18% <.001 0.106 <.001 <.001 <.001 <.001 <.001 6,519 4,969 4,856 5,617 7,366 29,327 All -1.73% -0.49% 1.04% 1.46% 2.58% 0.57% 4.31% <.001 <.001 <.001 <.001 <.001 <.001 <.001 29,322 29,418 29,325 29,317 29,324 146,706 High-Low 1.46% 2.22% 1.87% 2.54% 3.93% 2.71% 7.64% 0.001 <.001 <.001 <.001 <.001 <.001 <.001 Mean drift from day two after announcement to one day after subsequent announcement for abnormal volume ranked portfolios and analysts’ forecast error rankings. Second number is p-value and third is number of observations in cell. Source: Lerman, Livnat and Mendenhall (2008) page 32 Lerman et al (2008) used three earnings surprise measures, that is: analysts’ forecast error, time series earnings forecast error and announcement period abnormal return (like Brandt et all (2008)). They found that analyst based forecast error has the highest explanatory power of PEAD, while time series forecast error and announcement period abnormal return have similar power. To assess earning power of “high-volume” strategy they ran a separate portfolio simulation using only volume ranking and found that the effect produces significant abnormal returns on its own with 55 out of 70 inspected periods offering positive abnormal return with mean return of 2.71%. Figure 15 presents abnormal returns achieved across years using the volume ranking only. They conclude that in fact the “high-volume return premium” is a new market anomaly. A new line in PEAD explanation based on limited arbitrage possibilities was presented by Mendenhall (2004). He hypothesis that PEAD is created by investor’s underreaction to earnings Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 69,
    "chunk_index": 93,
    "word_count": 456,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the volume ranking only. They conclude that in fact the “high-volume return premium” is a new market anomaly. A new line in PEAD explanation based on limited arbitrage possibilities was presented by Mendenhall (2004). He hypothesis that PEAD is created by investor’s underreaction to earnings Electronic copy available at: https://ssrn.com/abstract=3281679 information and is not being eliminated by arbitrage because the required trades are risky. If indeed PEAD trades are risky, then its magnitude should be directly related to level of risk. In his research Figure 15 Abnormal returns of high-volume return premium strategy – investing in top quintile of firms ranked based on highest abnormal volume around earnings announcement Source: Lerman, Livnat and Mendenhall (2008) page 41 he used six explanatory variables to model arbitrage risk, they are: idiosyncratic risk, hedgeable risk, two variables linked to transaction costs, number of analysts covering the stock and percentage of stock held by institutional investors. He used US market data for period 1991-2000 and found that magnitude of post earnings announcement drift is significantly positively related to risks facing an arbitrageur, who tries to profit from the interim mispricing. Figure 16 shows dispersion of return for highest/lowest SUE decile portfolio dependent on overall arbitrage risk measure. According to authors results firms in extreme SUE decile with highest arbitrage risk quintile offer an abnormal return of 5.21% in 3-months, while those with the lowest arbitrage risk quintile offer a much lower abnormal return of only 1.32%. The magnitude of PEAD for differing arbitrage risk level is clearly dependent on level of arbitrage risk for both highest decile and lowest decile portfolios. 53 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 69,
    "chunk_index": 94,
    "word_count": 273,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "in 3-months, while those with the lowest arbitrage risk quintile offer a much lower abnormal return of only 1.32%. The magnitude of PEAD for differing arbitrage risk level is clearly dependent on level of arbitrage risk for both highest decile and lowest decile portfolios. 53 Electronic copy available at: https://ssrn.com/abstract=3281679 Figure 16 Abnormal cumulative total return of extreme SUE decile portfolios dividend into arbitrage risk quantiles. Source: Mendenhall (2004) page 890 Balakrishnan et al (2009) noticed that PEAD explanations offered so far concentrate on investors inability to correctly understand earnings time-series properties, because the underlying process is too complicated for humans, who would rather use a simplified model. Authors decided to check if a simplified version of PEAD based only on the sign of earnings figure regardless of earnings expectations. They base their beliefs on knowledge coming from social cognition, which suggests that people when faced with complex problems and limited processing capacity use simplified decision taking models. When applied to earnings number processing this suggests that inefficient patters may be found. Their motivation to check such oversimplified version of post announcement price drift comes from the fact that as previous literature shows (e.g. Basu (1997)) 54 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 69,
    "chunk_index": 95,
    "word_count": 202,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "capacity use simplified decision taking models. When applied to earnings number processing this suggests that inefficient patters may be found. Their motivation to check such oversimplified version of post announcement price drift comes from the fact that as previous literature shows (e.g. Basu (1997)) 54 Electronic copy available at: https://ssrn.com/abstract=3281679 losses are harder to predict using known time series models and announced surprise losses are larger on average than profits (Brown (2001)), losses are also less informative concerning future earnings prospects than profits (Hayn (1995), Collins et al (1999)). This suggests that predicting losses and appropriately reacting to announced losses is much harder for investors, which may cause additional market mispricing. They tested their hypothesis on a sample of 15143 firms in years 1976-2005. They found that over a 120-days period after earnings announcement portfolio consisting of lowest decile firms with largest losses produced a negative drift of over 6%, while the extreme positive portfolio (decile of highest profits) produced a positive drift of 4%, the annualized abnormal return of zero risk portfolio formed by going long “high profit” and short “high loss” portfolios earns around 21%. Full time scale of those portfolios’ abnormal returns are presented in Figure 17. Figure 17 Abnormal Returns of “High Loss” and “High Profit” portfolios over the period +1 to 240 days after earnings announcement Source: Balakrishnan, Bartov and Faurel (2009) page 39 Their test show that the anomaly is very powerful and holds after risk adjustment, up and down markets, short sell constraints and transaction costs, it works during whole 1976-2005 period and in every 10year subperiod. Table 24 shows Abnormal returns for deciles portfolios formed based on earnings level decile and SUE decile. The abnormal returns rise with both variables, with 55 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 69,
    "chunk_index": 96,
    "word_count": 295,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "down markets, short sell constraints and transaction costs, it works during whole 1976-2005 period and in every 10year subperiod. Table 24 shows Abnormal returns for deciles portfolios formed based on earnings level decile and SUE decile. The abnormal returns rise with both variables, with 55 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 69,
    "chunk_index": 97,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "the lowest value at the upper left corner (lowest earnings level and lowest SUE) and highest value at the lower-right corner. The combined zero risk portfolio gives an abnormal return of 12.5% in 120 days, compared with 10.2% for earnings level zero risk portfolio and 6.1% for SUE portfolio. Authors conclude that investors fail to properly estimate conditional probabilities of earnings data based on previous earnings and that on average investors take investment decisions based on oversimplified earnings predictions. Table 24 Abnormal Returns of earnings ranking decile portfolios and SUE decile portfolios over the period +1 to 120 days after earnings announcement SUE Decile 1 2 3 4 5 6 7 8 9 10 High- Low High Low SUE SUE SUE 56 eliceD sgninraE 1(Loss) -0.0429 -0.0584 -0.0369 -0.0604 -0.0370 -0.0253 -0.0217 -0.0453 -0.0276 -0.0120 0.0309 2 -0.0535 -0.0589 -0.0637 -0.0408 -0.0400 -0.0258 -0.0153 -0.0086 -0.0052 -0.0028 0.0507 3 -0.0354 -0.0425 -0.0342 -0.0335 -0.0136 -0.0052 -0.0139 0.0063 0.0002 0.0223 0.0577 4 -0.0244 -0.0197 -0.0150 -0.0105 -0.0075 -0.0009 0.0042 0.0163 0.0150 0.0358 0.0602 5 -0.0232 -0.0180 -0.0082 -0.0081 0.0006 0.0096 0.0232 0.0170 0.0267 0.0345 0.0577 6 -0.0236 -0.0140 -0.0019 0.0026 0.0164 0.0193 0.0281 0.0308 0.0402 0.0508 0.0744 7 -0.0098 -0.0124 0.0071 0.0114 0.0089 0.0113 0.0298 0.0297 0.0359 0.0465 0.0563 8 -0.0184 -0.0001 0.0068 0.0098 0.0176 0.0220 0.0347 0.0278 0.0501 0.0541 0.0724 9 0.0005 -0.0072 0.0144 0.0185 0.0393 0.0302 0.0434 0.0368 0.0467 0.0752 0.0747 10(Profit) 0.0104 0.0085 0.0138 0.0432 0.0371 0.0336 0.0351 0.0553 0.0653 0.0817 0.0713 High Profit 0.0533 0.0669 0.0508 0.1035 0.0741 0.0589 0.0568 0.1006 0.0929 0.0938 High Loss (7.82) (6.78) (4.24) (7.82) (5.53) (4.24) (4.15) (9.01) (9.13) (12.04) Source: Balakrishnan, Bartov and Faurel (2009) page 44 A further simplification of PEAD was presented by Frazzini and Lamont (2007), Barber et al (2012) and Savor and Wilson (2013), who noticed that the pure fact of earnings announcement is a return generating factor, regardless of the earnings number announced. Savor and Wilson (2013) found that the phenomenon is robust and significant, portfolio strategy of buying announcing firms and short selling all the other produces a 9.9% annualized abnormal return. Barber et al (2012) evidenced the earnings announcement premium globally in 46-country sample for a period 1991-2010 and found an average premium at 0.597%, that is the abnormal return for a strategy of holding stocks only in their announcement month, after controlling for size, momentum, value and country effect, the average premium increases to 0.955%. The achieved premium is consistent over time and is not dependent on the firm size. Savor and Wilson (2013) hypothesize that announcing firms are more risky than non-announcing firms, as the earnings report is a very valuable source of information not only for company level performance, but also for sector and wide economy performance. Authors found that the high announcement premium is consistent over time, that is companies who earn higher announcement premium, will also achieve higher premiums in the future, this effect exists for periods up to 20 years, as their results Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 69,
    "chunk_index": 98,
    "word_count": 500,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "for sector and wide economy performance. Authors found that the high announcement premium is consistent over time, that is companies who earn higher announcement premium, will also achieve higher premiums in the future, this effect exists for periods up to 20 years, as their results Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 69,
    "chunk_index": 99,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "prove. Another Savor’s and Wilson’s (2013) notable observation is that firms announcing earnings earn a higher premium, then companies announcing results later in the quarter, this observation confirms their risk-based explanation, as investors are able to extract many macroeconomic and economy sector trends from earnings reports published earlier and therefore the informative value of the later reports is lower for investors. Contradicting conclusions were presented by Ball and Shivakumar (2008), who asses the information load of earnings release based on R2 of stock return regression, where earnings announcement windows (3 days) returns are the proxies for information value of the earnings information. They prove that each earnings release account for only 1%-2% of annual total information, altogether earnings information makes 6% to 9% of the total information during a year. They conclude that the low information value of the earnings number comes from the fact, that earnings rarely surprise investors and are only a summary of the past, which is not 100% relevant to future company performance. Evidence supporting Savor and Wilson (2013) findings is presented by Easton et al (2010), who noticed that there is a price drift preceding the earnings announcement, especially for the late announcing firms. They show that it is a separate phenomenon from PEAD, that is a market reaction to information set read from earlier announcing firms. Table 25 PEAD magnitude distribution across quarters Panel A: SUE based on historical data Quarter All Negative Positive Surprises Surprises Surprises 1 0.499 0.171 0.121 2 0.477 0.123 0.097 3 0.428 0.124 0.054 4 0.321 0.012 0.066 Panel B: SUE based on analyst forecast Quarter All Negative Positive Surprises Surprises Surprises 1 0.349 0.120 0.119 2 0.365 0.124 0.135 3 0.291 0.082 0.115 4 0.245 0.061 0.063 Source: Livnat (2003a) page 29 Varying magnitude of PEAD across quarters was examined by Livnat (2003a), who proved that post earnings announcement drift is lower for fourth quarter release than for any other three quarters, he attributes this fact to lower persistency level of fourth quarter earnings. According to his hypothesis, earnings in fourth quarter are subject to various accounting adjustments, which make them more volatile than any other quarter, at the same time their persistency is much lower. 57 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 69,
    "chunk_index": 100,
    "word_count": 374,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "he attributes this fact to lower persistency level of fourth quarter earnings. According to his hypothesis, earnings in fourth quarter are subject to various accounting adjustments, which make them more volatile than any other quarter, at the same time their persistency is much lower. 57 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 69,
    "chunk_index": 101,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "He implies that earnings are more persistent within one accounting year, therefore the fourth quarter announcement is an extrapolation of the trend well known to investors from previous three quarters and investors are aware, that next earnings announcement cannot be easily extrapolated from fourth quarter announcement. This logic is similar to the one offered by Savor and Wilson (2013) concerning quarterly announcement distribution. Table 25 presents Livnat’s (2003a) results, magnitude of PEAD is highest after 1st quarter results and then falls every quarter and is lowest in fourth quarter, the same pattern is observed using time-series SUE and analyst forecast based SUE. Another criterion on which PEAD differs across firm was discovered by Cao and Narayanamoorthy (2012) who studied PEAD among firms with varying ex ante levels of earnings volatility and found that firms with lower ex ante earnings volatility have higher post announcement price drift. Their examination comes from the observation of Dichev and Tang (2009) who proved that volatile annual earnings are less persistent than lower volatility earnings. Cao et al (2012) extended this observation to quarterly earnings and proved that investors notice the fact of varying earnings volatility and do not react the same way to earnings surprise by company characterized by high volatility in earnings. They conducted their research on a sample of data from period 1987-2006 and found that one quarter PEAD abnormal return is 8.56% for lowest earnings volatility decile portfolio and 3.57% in highest earnings volatility decile portfolio, the difference is large and statistically significant. According to Cao and Narayanamoorthy (2012) quarterly earnings volatility is highly correlated with trading frictions, that is companies with higher earnings volatility have higher trading frictions, based on this observation they conclude that previous evidence by Mendehall (2004) can be extended and rephrased, in such a way that it is not the trading frictions that cause the difference in PEAD magnitude, but the earnings volatility that is the explanatory variable of the trading frictions. Inflation was the next factor studied by academics, when trying to explain varying magnitude of PEAD. Chordia and Shivakumar (2005) noticed that SUE ranked stocks are systematically positively related to rankings based on sensitivity of earnings to inflation. Their idea was that stock market investors fail to understand the implications of inflation when valuing stocks, and therefore undervalue stocks with high sensitivity to inflation and overvalue stocks with low (negative) sensitivity to inflation, which implies that stocks with high sensitivity to inflation will offer higher subsequent rates of return. Authors prove that future earnings growth and abnormal returns for SUE ranking stocks are positively correlated with past inflation. They conclude that investors may fail to notice the meaning of inflation because: 58 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 69,
    "chunk_index": 102,
    "word_count": 453,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "with high sensitivity to inflation will offer higher subsequent rates of return. Authors prove that future earnings growth and abnormal returns for SUE ranking stocks are positively correlated with past inflation. They conclude that investors may fail to notice the meaning of inflation because: 58 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 69,
    "chunk_index": 103,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "“possible reason for this underestimation is the complexity and the constantly changing nature of the economic system within which market participant make earnings forecasts”. 1.8. Summary of PEAD research Post Earnings Announcement Drift is a measure of markets inability to price correctly information contained in earnings report. Since it was first spotted by Ball and Brown (1968), it went through rigorous academic scrutiny, first to test if it really exists (Ball (1978), Latane and Jones (1977)), then to measure its magnitude in various time frames, to offer explanations for its existence and find more PEAD variations. On average academics found that the postponed response to earnings information produces about 6% abnormal 60 days return (Dechow et al (2013)). The whole market reaction attributed to earnings report, measured from 60 days prior to earnings release to 60 days after is estimated at 18%, which means that about a third of the whole market response is delayed - Dechow et al (2013). Figure 18 PEAD cumulative abnormal return over period 1971-2011 Source: Dechow, Sloan, Zha (2013) page 358 Figure 18 presents cumulative PEAD strategy abnormal returns for a 40-years period from 1971 to 2011. The total abnormal return of the strategy is an astonishing 350%, which is beat only by BTM (Book-to-Market) strategy. PEAD profits are very consistent up to late 90’s, then we can observe dips in the abnormal returns during internet bubble (1991-2001) and then during market recovery after 2008 crash. Since the middle of the 90’s PEAD returns became riskier and much 59 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 69,
    "chunk_index": 104,
    "word_count": 259,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "(Book-to-Market) strategy. PEAD profits are very consistent up to late 90’s, then we can observe dips in the abnormal returns during internet bubble (1991-2001) and then during market recovery after 2008 crash. Since the middle of the 90’s PEAD returns became riskier and much 59 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 69,
    "chunk_index": 105,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "lower than in the previous 25 years, it may be attributed to wider academic research in the field and wider recognition of the phenomenon among investors. The PEAD strategy is not easy to implement in practice as it requires large scale data collection and data processing, more recent advancements in information processing technologies may also affect the magnitude of PEAD exploitation. A dominant part of research on PEAD was conducted in the US and based on US stock market data. The magnitude of PEAD computed by academics across time, since 1968 when first academic paper mentioning PEAD was published, up to the most recent evidence, are shown in Table 26. As many world markets vary with respect to companies’ size, investor structure, accounting rules, information dissemination channels etc. it is not obvious if the PEAD exists in all world markets and what is its magnitude. PEAD premium computed based on US market data by academics is not easily comparable. There are differences in period studied, subset of stocks used, definitions of expected earnings or unexpected earnings signal altogether. Among the results presented in Table 26, the highest return 14.03% in 120 days presented by Balakrishnan et al (2009) and the lowest is Chordia and Shivakumar (2005) 0.9% in 1 month. Both of those research papers confirm PEAD premium existence, but Chordia and Shivakumar (2005) focus their attention on explaining joint anomalies of momentum and PEAD, and form portfolios each month regardless of profit announcement date, taking last announced earnings in their SUE ranking, which obviously weakens the earnings signal. Balakrishnan et al (2009) study post announcement drift based on absolute value of published earnings, which is a simplified version of PEAD, they contribute strength of this signal to behavioural explanation (limited processing ability). All those research results presented in Table 26 and 27 differ to some extent and cannot be easily compared without deeper understanding of the underlying return generation process. Column 4 in those tables presents “Return period” as presented by authors of specified research. Standardizing the “Abnormal Return” column to some common standard like annualized return does not help, as the trajectory of PEAD returns are not linear and the resulting annualized return would be misleading and by far different from annual returns achievable by following the PEAD based strategy. Additionally, PEAD based trading is available to investors only four times a year, not constantly. 60 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 69,
    "chunk_index": 106,
    "word_count": 403,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "trajectory of PEAD returns are not linear and the resulting annualized return would be misleading and by far different from annual returns achievable by following the PEAD based strategy. Additionally, PEAD based trading is available to investors only four times a year, not constantly. 60 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 69,
    "chunk_index": 107,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Table 26 Summary of PEAD tests in the US market Year of Years used in Abnormal Author Return period publication research Return Ball and Brown 1968 1946-1966 7.2% 6 months Latane and Jones 1977 1971-1975 9.74% 1 month Watts 1978 1950-1968 1.2%-2.1% 13 weeks Foster, Olsen and Shevlin 1984 1970-1981 8.3% 90 days Freeman and Tse 1989 1984-1988 3.23% 1 month Bernard and Thomas 1989 1974-1986 4.2% 60 days Affleck-Graves and Mendengall 1992 1982-1987 4.83% 61 days Abarbanell and Bernard 1992 1976-1986 4.98% 1 month Chan, Jegadeesh, Lakonishok 1996 1977-1993 4.3% 6 months Collins and Hribar 2000 1988-1997 7.84% 120 days Liang 2003 1989-2000 6% 60 days Livnat 2003 1987-2002 3.94% 1 quarter Chordia and Shivakumar 2005 1972-1999 0.9% 1 month Doyle, Lundholm and Soliman 2006 1988-2000 13.95% 1 year Jegadeesh and Livnat 2006 1987-2003 5.55% 6 months Sadka 2006 1983-2001 1.94% 1 month Battalio and Mendenhall 2011 1993-2002 4% to 8% 1 quarter Francis, Lafond, Olsson and Schipper 2007 1982-2001 4.66% 1 quarter Lerman, Livnat, Mendenhall 2008 1987-2005 2.73% 1 quarter Livnat and Mendenhall 2006 1987-2003 5.21% 1 quarter Ali, Chen, Yao and Yu 2007 1990-2014 3.06% 1 quarter Ng, Rusticus and Verdi 2008 1988-2005 2.43% 1 month Brandt, Kishore, Santa-Clara and 2008 1987-2004 2.99% 3 days Venkatachalam Balakrishnan, Bartov and Faurel 2010 1976-2005 14.03% 120 days Hirschleifer, Lim and Teoh 2009 1995-2004 4.52% 60 days Chen, Chen, Hsin and Lee 2009 1997-2007 1.07% 3 months Easter, Gao and Gao 2010 1976-2008 1.161% 1 month Chung and Hrazdil 2011 1993-2004 5.48% 60 days Zhou and Zhu 2012 1971-2009 3.63% 1 quarter Dechow, Sloan and Zha 2013 1971-2011 ~4% annualized Bird, Choi and Yeung 2014 1986-2009 0.781% 60 days Chen, Huang and Jiang 2016 1981-2013 7.874% 1 quarter Agapova and Mailibayeva 2017 1961-2008 6.91% 30 days Baker, Ni, Saadi and Zhu 2017 1996-2015 2.39% 60 days Source: own work based on authors mentioned in text Comparing PEAD premium cross country is even more challenging. Apart from differences mentioned in the previous paragraph there are additional differences derived from country specific culture, regulation and market structure. Table 27 presents results of PEAD research conducted based on markets other than US, first part of the table is devoted to developed markets and second part to emerging markets. Research based on emerging markets often is even more challenging as there are fewer stocks listed, the history of listing may be short and clean data may not be easily available. In many emerging markets regulations governing accounting standards often change, making comparisons across time difficult or impossible. In some market companies do not have a unified earnings publishing platform, which makes it very difficult to precisely identify the moment of announcement. In some markets companies publish various fragmented financial data, 61 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 69,
    "chunk_index": 108,
    "word_count": 462,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "accounting standards often change, making comparisons across time difficult or impossible. In some market companies do not have a unified earnings publishing platform, which makes it very difficult to precisely identify the moment of announcement. In some markets companies publish various fragmented financial data, 61 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 69,
    "chunk_index": 109,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "making the PEAD study dubious. Some researchers study earnings impact on abnormal returns but do not construct portfolios to compare abnormal returns, instead concentrate their effort on regression parameters estimation – Ariff, Loh and Chew (1997), Filip and Reffournier (2010) or Angelovska (2017), which does not produce any clear abnormal return figure to compare with other studies. In summary, the presented abnormal return levels in emerging markets do not vary significantly from developed markets or US market levels. Table 27 Summary of PEAD tests in International markets – outside US Year of Years used Abnormal Return Author Country publication in research Return period Developed Markets Booth, Kallunki and Matikainen Finland 1996 1989-1993 2.9% 10 days Huffel, Joo and Ooghe Belgium 1996 1990-1993 <0% Hew, Skerratt, Strong and Walker UK 1996 1979-1992 3.0% 120 days Liu and Strong UK 2003 1988-1998 11.75% 6 months Degiannakis and Giannopoulos Greece 2009 1994-1999 7.5% 40 days Forner and Sanabria Spain 2010 1993-2003 1.4% - 1.7% 1 month Troung New Zealand 2010 1994-2008 6% 60 days Gerard Europe 2012 1997-2010 1.66% 60 days Hung, Li and Wang 18 countries 2014 2003-2007 1.72% 3 months Emerging Markets Ariff, Loh and Chew Singapore 1997 1981-1992 - - Szyszka Poland 2001 1997-2000 7.2% 60 days Lu China H-share 2008 1997-2005 ~ -11% 90 days Hussin, Ahmed and Ying Malaysia 2010 2006 ~3%-6%1 10 days Filip and Raffournier Romania 2010 1998-2004 - - Troung China 2011 1994-2009 9.5% 1 year Iqba and Farooqi Pakistan 2011 2004-2008 No drift Park, Lee and Song South Korea 2014 2001-2010 3.66% 10 days Swart and Hoffman South Africa 2015 1991-2010 2.07% 6 months Goh and Jeon South Korea 2017 2000-2015 1.98% 1 month Angelovska Macedonia 2017 2008-2009 - - Muchori Tibbs Ondiek Kenya 2018 2011-2015 1.54% 9 days Sojka Poland 2018 1998-2017 6.1% 90 days Sojka Poland 2018 2010-2017 3.4% 90 days 1 – combined earnings and dividend change Source: own work based on authors mentioned in text 62 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 69,
    "chunk_index": 110,
    "word_count": 331,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Macedonia 2017 2008-2009 - - Muchori Tibbs Ondiek Kenya 2018 2011-2015 1.54% 9 days Sojka Poland 2018 1998-2017 6.1% 90 days Sojka Poland 2018 2010-2017 3.4% 90 days 1 – combined earnings and dividend change Source: own work based on authors mentioned in text 62 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "1.1. PEAD anomaly discovery and early research",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 69,
    "chunk_index": 111,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.1. PEAD anomaly discovery and early research (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Abarbanell, J., and V. L. Bernard. 1992. Tests of analysts’ overreaction/ underreaction to earnings information as an explanation for anomalous stock price behavior. Journal of Finance 47 (3) Abarbanell, J. and Lehavy, R., 2003. Biased forecasts or biased earnings? The role of reported earnings in explaining apparent bias and over/underreaction in analysts’ earnings forecasts. Journal of Accounting and Economics, 36(1-3), pp.105-146. Affleck-Graves, J. and Mendenhall, R.R., 1992. The relation between the Value Line enigma and post- earnings-announcement drift. Journal of Financial Economics, 31(1), pp.75-96. Ali, A., Klein, A. and Rosenfeld, J., 1992. Analysts' use of information about permanent and transitory earnings components in forecasting annual EPS. Accounting Review, pp.183-198. Ali, A., Klasa, S. and Li, O.Z., 2008. Institutional stakeholdings and better-informed traders at earnings announcements. Journal of Accounting and Economics, 46(1), pp.47-61. Ali, A., Chen, X., Yao, T. and Yu, T., 2008. Do mutual funds profit from the accruals anomaly?. Journal of Accounting Research, 46(1), pp.1-26. Angelovska, J., 2017. Investors’ behaviour in regard to company earnings announcements during the recession period: evidence from the Macedonian stock exchange. Economic research-Ekonomska istraživanja, 30(1), pp.647-660. Ariff, M., Loh, A.L. and Chew, P.M., 1997. The impact of accounting earnings disclosures on stock prices in Singapore. Asia Pacific Journal of Management, 14(1), pp.17-29. Ayers, B.C., Li, O.Z. and Yeung, P.E., 2011. Investor trading and the post-earnings-announcement drift. The Accounting Review, 86(2), pp.385-416. Baker, M., Litov, L., Wachter, J.A. and Wurgler, J., 2010. Can mutual fund managers pick stocks? Evidence from their trades prior to earnings announcements. Journal of Financial and Quantitative Analysis, 45(5), pp.1111-1131. Balakrishnan, K., Bartov, E. and Faurel, L., 2010. Post loss/profit announcement drift. Journal of Accounting and Economics, 50(1), pp.20-41. Ball, R., and P. Brown. 1968. An empirical evaluation of accounting income numbers. Journal of Accounting Research 6 (2): 159–178. Ball, R., 1978. Anomalies in relationships between securities' yields and yield-surrogates. Journal of Financial Economics, 6(2), pp.103-126. Ball, R., Kothari, S.P. and Watts, R., 1990. Economic Determinants of the Relation Between Earnings Changes and Stock Returns. Rochester, Business-Managerial Economics Research Center. 63 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63",
    "total_pages": 69,
    "chunk_index": 112,
    "word_count": 345,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "6 (2): 159–178. Ball, R., 1978. Anomalies in relationships between securities' yields and yield-surrogates. Journal of Financial Economics, 6(2), pp.103-126. Ball, R., Kothari, S.P. and Watts, R., 1990. Economic Determinants of the Relation Between Earnings Changes and Stock Returns. Rochester, Business-Managerial Economics Research Center. 63 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 69,
    "chunk_index": 113,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Ball, R. and Bartov, E., 1995. The earnings event-time seasonal and the calendar-time seasonal in stock returns: Naive use of earnings information or announcement timing effect?. Journal of Accounting, Auditing & Finance, 10(4), pp.677-698. Barber, B., and T. Odean. 2000. Trading is hazardous to your wealth: The common stock investment performance of individual investors. Journal of Finance 55 (2): 773–806. Barber, B.M., Odean, T. and Zhu, N., 2008. Do retail trades move markets?. The Review of Financial Studies, 22(1), pp.151-186. Barber, B., Lee, Y., Liu, Y. and Odean, T., 2009. How much do investor lose from trade?. Review of Financial Studies, 22(2), pp.609-632. Barber, B.M., De George, E.T., Lehavy, R. and Trueman, B., 2013. The earnings announcement premium around the globe. Journal of Financial Economics, 108(1), pp.118-138. Bartov, E., 1992. Patterns in unexpected earnings as an explanation for post-announcement drift. Accounting Review, pp.610-622. Bartov, E., S. Radhakrishnan, and I. Krinsky. 2000. Investor sophistication and patterns in stock returns after earnings announcements. The Accounting Review 75: 43–63. Basu, S., 1997. The conservatism principle and the asymmetric timeliness of earnings1. Journal of accounting and economics, 24(1), pp.3-37. Battalio, R.H. and Mendenhall, R.R., 2011. Post‐Earnings Announcement Drift: Bounds on Profitability for the Marginal Investor. Financial Review, 46(4), pp.513-539. Beaver, W.H. and Landsman, W.R., 1981. Note on the behavior of residual security returns for winner and loser portfolios. Journal of Accounting and Economics, 3(3), pp.233-241. Bernard, V.L. and Thomas, J.K., 1989. Post-earnings-announcement drift: delayed price response or risk premium?. Journal of Accounting research, pp.1-36. Bhushan, R., 1994. An informational efficiency perspective on the post-earnings announcement drift. Journal of Accounting and Economics, 18(1), pp.45-65. Bird, R., Choi, D.F. and Yeung, D., 2014. Market uncertainty, market sentiment, and the post-earnings announcement drift. Review of Quantitative Finance and Accounting, 43(1), pp.45-73. Booth, G.G., Kallunki, J.P. and Martikainen, T., 1996. POST‐ANNOUNCEMENT DRIFT AND INCOME SMOOTHING: FINNISH EVIDENCE. Journal of Business Finance & Accounting, 23(8), pp.1197- 1211. Brandt, M., R. Kishore, P. Santa-Clara, and M. Venkatachalam. 2008. Earnings announcements are full of surprises. SSRN 909563 Brown, S.J. and Pope, P.F., 1995. Post-Earnings Announcement Drift: Market Inefficiency or Research Design Biases?. 64 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 69,
    "chunk_index": 114,
    "word_count": 357,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "FINNISH EVIDENCE. Journal of Business Finance & Accounting, 23(8), pp.1197- 1211. Brandt, M., R. Kishore, P. Santa-Clara, and M. Venkatachalam. 2008. Earnings announcements are full of surprises. SSRN 909563 Brown, S.J. and Pope, P.F., 1995. Post-Earnings Announcement Drift: Market Inefficiency or Research Design Biases?. 64 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 69,
    "chunk_index": 115,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Brown, L., 2001. A temporal analysis of earnings surprises: Profits versus losses. Journal of Accounting Research 39, 221–241. Bushee, B., and J. S. Raedy. 2005. Factors affecting the implementability of stock market trading strategies. Working paper. Campbell, J. Y., T. Ramadorai, and A. Schwartz. 2009. Caught on tape: Institutional trading, stock returns, and earnings announcements. Journal of Financial Economics 92: 66–91. Cao, S.S. and Narayanamoorthy, G.S., 2012. Earnings volatility, post–earnings announcement drift, and trading frictions. Journal of Accounting Research, 50(1), pp.41-74. Chan, L.K., Jegadeesh, N. and Lakonishok, J., 1996. Momentum strategies. The Journal of Finance, 51(5), pp.1681-1713. Chen, H.Y., Chen, S.S., Hsin, C.W. and Lee, C.F., 2010. Price, earnings, and revenue momentum strategies. Electronic copy available at: http://ssrn. com/abstract, 1571883. Chen, L.H., Huang, W. and Jiang, G.J., 2017. Herding on Earnings News: The Role of Institutional Investors in Post–Earnings-Announcement Drift. Journal of Accounting, Auditing & Finance, 32(4) Chordia, T., and L. Shivakumar. 2005. Inflation illusion and post-earnings-announcement drift. Journal of Accounting Research 43: 521–556. Chordia, T., A. Goyal, G. Sadka, R. Sadka, and L. Shivakumar. 2009. Liquidity and the post-earnings announcement drift. Financial Analysts Journal 65 (4): 18–32. Chung, D.Y. and Hrazdil, K., 2011. Market efficiency and the post‐earnings announcement drift. Contemporary Accounting Research, 28(3), pp.926-956. Collins, D.W., Pincus, M. and Xie, H., 1999. Equity valuation and negative earnings: The role of book value of equity. The Accounting Review, 74(1), pp.29-61. Collins, D., and P. Hribar. 2000. Earnings-based and accrual-based market anomalies: One effect or two? Journal of Accounting and Economics 29: 101–123. Dechow, P.M. and Dichev, I.D., 2002. The quality of accruals and earnings: The role of accrual estimation errors. The accounting review, 77(s-1), pp.35-59. Dechow, P.M., Sloan, R.G. and Zha, J., 2013. Stock prices and earnings: A history of research. Annual Review of Financial Economics, 6, pp.343-363. Degiannakis, S.A. and Giannopoulos, G., 2009. Is PEAD a consequence of the presence of the cognitive bias of self-attribution in investors’ expectations regarding permanent earnings? Evidence from Athens Stock Exchange. International Journal of Computational Economics and Econometrics, 1(1) DeHaan, E., Shevlin, T.J. and Thornock, J.R., 2015. Market (in) attention and the strategic scheduling and timing of earnings announcements. Journal of Accounting and Economics, 60(1), pp.36-55. DellaVigna, S., and J. Pollet. 2009. Investor inattention and Friday earnings announcements. Journal of Finance 64 (2): 709–749. 65 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 69,
    "chunk_index": 116,
    "word_count": 388,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "E., Shevlin, T.J. and Thornock, J.R., 2015. Market (in) attention and the strategic scheduling and timing of earnings announcements. Journal of Accounting and Economics, 60(1), pp.36-55. DellaVigna, S., and J. Pollet. 2009. Investor inattention and Friday earnings announcements. Journal of Finance 64 (2): 709–749. 65 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 69,
    "chunk_index": 117,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Dey, M.K. and Radhakrishna, B., 2007. Who trades around earnings announcements? Evidence from TORQ data. Journal of Business Finance & Accounting, 34(1‐2), pp.269-291. Dichev, I.D. and Tang, V.W., 2009. Earnings volatility and earnings predictability. Journal of accounting and Economics, 47(1-2), pp.160-181. Doyle, J. T., R. J. Lundholm, and M. T. Soliman. 2003. The predictive value of expenses excluded from pro forma earnings. Review of Accounting Studies 8 (2–3): 145–174. Doyle, J., R. Lundholm, and M. Soliman. 2006. The extreme future stock returns following I/B/E/S earnings surprises. Journal of Accounting Research 44 (5): 849–887. Easton, P.D., Gao, G. and Gao, P., 2010. Pre-earnings announcement drift. Available at SSRN 1786697. Ertimur, Y., Livnat, J. and Martikainen, M., 2003. Differential market reactions to revenue and expense surprises. Review of Accounting Studies, 8(2-3), pp.185-211. Fama, E.F., 1998. Market efficiency, long-term returns, and behavioral finance. Journal of financial economics, 49(3), pp.283-306. Feldman, R., Govindaraj, S., Livnat, J. and Segal, B., 2010. Management’s tone change, post earnings announcement drift and accruals. Review of Accounting Studies, 15(4), pp.915-953. Filip, A. and Raffournier, B., 2010. The value relevance of earnings in a transition economy: The case of Romania. The International Journal of Accounting, 45(1), pp.77-103. Forner, C. and Sanabria, S., 2010. Post-earnings announcement drift in Spain and behavioural finance models. European Accounting Review, 19(4), pp.775-815. Foster, G. 1977. Quarterly accounting data: Time-series properties and predictive-ability results. The Accounting Foster, G., C. Olsen, and T. Shevlin. 1984. Earnings releases, anomalies, and the behavior of security returns. The Accounting Review 59 (4): 574–603. Francis, J., R. Lafond, P. Olsson, and K. Schipper. 2007. Information uncertainty and post-earnings- announcement-drift. Journal of Business Finance & Accounting 34 (3–4): 403–433 Frazzini, A. and Lamont, O.A., 2007. The earnings announcement premium and trading volume. NBER working paper, (w13090). Freeman, R.N. and Tse, S., 1989. The multiperiod information content of accounting earnings: Confirmations and contradictions of previous earnings reports. Journal of Accounting Research, 27, pp.49-79. Garfinkel, J., and J. Sokobin. 2006. Volume, opinion divergence, and returns: A study of post-earnings announcement drift. Journal of Accounting Research 44 (1): 85–112. Gerard, X., 2012. Information uncertainty and the post-earnings announcement drift in Europe. Financial Analysts Journal, 68(2), pp.51-69. 66 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 69,
    "chunk_index": 118,
    "word_count": 367,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Research, 27, pp.49-79. Garfinkel, J., and J. Sokobin. 2006. Volume, opinion divergence, and returns: A study of post-earnings announcement drift. Journal of Accounting Research 44 (1): 85–112. Gerard, X., 2012. Information uncertainty and the post-earnings announcement drift in Europe. Financial Analysts Journal, 68(2), pp.51-69. 66 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 69,
    "chunk_index": 119,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Goh, J. and Jeon, B.H., 2017. Post-earnings-announcement-drift and 52-week high: Evidence from Korea. Pacific-Basin Finance Journal, 44, pp.150-159. Griffin, J.M. and Xu, J., 2009. How smart are the smart guys? A unique view from hedge fund stock holdings. The Review of Financial Studies, 22(7), pp.2531-2570. Hayn, C., 1995. The information content of losses. Journal of accounting and economics, 20(2) Hew, D., Skerratt, L., Strong, N. and Walker, M., 1996. Post-earnings-announcement drift: some preliminary evidence for the UK. Accounting and Business Research, 26(4), pp.283-293. Hirshleifer, D.A., Myers, J.N., Myers, L.A. and Teoh, S.H., 2003. Do individual investors drive post- earnings announcement drift? Direct evidence from personal trades. Working Paper Hirshleifer, D.A., Myers, J.N., Myers, L.A. and Teoh, S.H., 2008. Do individual investors cause post- earnings announcement drift? Direct evidence from personal trades. The Accounting Review, 83(6) Hirshleifer, D., S. Lim, and S. Teoh. 2009. Driven to distraction: Extraneous events and underreaction to earnings news. Journal of Finance, forthcoming. van Huffel G., Joos P. & Ooghe H. 1996. Semi-annual earnings announcements and market reaction: some recent findings for a small capital market. European Accounting Review, 5:4, 693-713, Hung, M., Li, X. and Wang, S., 2014. Post-earnings-announcement drift in global markets: Evidence from an information shock. The Review of Financial Studies, 28(4), pp.1242-1283. Hussin, B.M., Ahmed, A.D. and Ying, T.C., 2010. Semi-strong form efficiency: Market reaction to dividend and earnings announcements in Malaysian stock exchange. IUP Journal of Applied Finance, 16(5), p.36. Iqbal, J. and Farooqi, F.A., 2011. Stock price reaction to earnings announcement: the case of an emerging market. Jegadeesh, N. and Titman, S., 1993. Returns to buying winners and selling losers: Implications for stock market efficiency. The Journal of finance, 48(1), pp.65-91. Jegadeesh, R., and J. Livnat. 2006. Revenue surprises and stock returns. Journal of Accounting and Economics 41: 147–171. Jones, C.P. and Litzenberger, R.H., 1970. Quarterly earnings reports and intermediate stock price trends. The Journal of Finance, 25(1), pp.143-148. Ke, B. and Ramalingegowda, S., 2005. Do institutional investors exploit the post-earnings announcement drift?. Journal of Accounting and Economics, 39(1), pp.25-53. Latané, H.A., Jones, C.P. and Rieke, R.D., 1974. Quarterly earnings reports and subsequent holding period returns. Journal of Business Research, 2(2), pp.119-132. Latane, H., and C. Jones. 1977. Standardized unexpected earnings—A progress report. Journal of Finance 32 (5): 1457–1465. 67 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 67,
    "page_range": "p.67",
    "total_pages": 69,
    "chunk_index": 120,
    "word_count": 385,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.67)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Accounting and Economics, 39(1), pp.25-53. Latané, H.A., Jones, C.P. and Rieke, R.D., 1974. Quarterly earnings reports and subsequent holding period returns. Journal of Business Research, 2(2), pp.119-132. Latane, H., and C. Jones. 1977. Standardized unexpected earnings—A progress report. Journal of Finance 32 (5): 1457–1465. 67 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 69,
    "chunk_index": 121,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Lerman, A., J. Livnat, and R. R. Mendenhall. 2007. Double surprise into higher future returns. Financial Analysts Journal 63 (4): 63–71. Lerman, A., J. Livnat, and R. R. Mendenhall. 2008. The high-volume return premium and post earnings announcement drift. Working paper. Available at SSRN: 1122463 Lev, B. and Ohlson, J.A., 1982. Market-based empirical research in accounting: A review, interpretation, and extension. Journal of Accounting research, pp.249-322. Liang, L., 2003. Post-earnings announcement drift and market participants' information processing biases. Review of Accounting Studies, 8(2-3), pp.321-345. Litzenberger, R.H., Joy, O.M. and Jones, C.P., 1971. Ordinal predictions and the selection of common stocks. Journal of Financial and Quantitative Analysis, pp.1059-1068. Liu, W., Strong, N. and Xu, X., 2003. Post–earnings–announcement Drift in the UK. European Financial Management, 9(1), pp.89-116. Livnat, J., 2003. Post-earnings-announcement drift: The role of revenue surprises and earnings persistence, available at SSRN id:416302 Livnat, J., 2003a. Differential persistence of extremely negative and positive earnings surprises: Implications for the post-earnings-announcement drift, available at SSRN id: 421000 Livnat, J., and R. R. Mendenhall. 2006. Comparing the post-earnings announcement drift for surprises calculated from analyst and time series forecasts. Journal of Accounting Research 44 (1): 177–205. Lu, Jing, Uncertainty of Information, Reaction of Investors and Post-Earnings Announcement Drift: Some Empirical Evidences from A-H Share Markets of China (April 20, 2008). Available at SSRN: 1652700 Mendenhall, R.R., 2004. Arbitrage risk and post‐earnings‐announcement drift. The Journal of Business, 77(4), pp.875-894. Maines, L.A. and Hand, J.R., 1996. Individuals' perceptions and misperceptions of time series properties of quarterly earnings. Accounting Review, pp.317-336. Muchori, S.M., Tibbs, C.Y. and Ondiek, A.B., Annual Earnings Announcements and Stock Returns: A Test of Semi-Strong Form of Efficiency of the Banking Sector of the Nairobi Securities Exchange. Narayanamoorthy, G., 2006. Conservatism and Cross‐Sectional Variation in the Post–Earnings Announcement Drift. Journal of Accounting Research, 44(4), pp.763-789. Ng, J., T. Rusticus, and R. Verdi. 2008. Implications of transaction costs for the post-earnings- announcement drift. Journal of Accounting Research 46 (3): 661–696. Odean, T. 1999. Do investors trade too much? American Economic Review 89: 1279–1289. Park, T.J. and Lee, Y., 2014. Informed trading before positive vs. negative earnings surprises. Journal of Banking & Finance, 49, pp.228-241. 68 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 69,
    "chunk_index": 122,
    "word_count": 365,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "post-earnings- announcement drift. Journal of Accounting Research 46 (3): 661–696. Odean, T. 1999. Do investors trade too much? American Economic Review 89: 1279–1289. Park, T.J. and Lee, Y., 2014. Informed trading before positive vs. negative earnings surprises. Journal of Banking & Finance, 49, pp.228-241. 68 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 69,
    "chunk_index": 123,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "Reinganum, M.R., 1981. Misspecification of capital asset pricing: Empirical anomalies based on earnings' yields and market values. Journal of financial Economics, 9(1), pp.19-46. Rendleman, R.J., Jones, C.P. and Latane, H.A., 1982. Empirical anomalies based on unexpected earnings and the importance of risk adjustments. Journal of Financial Economics, 10(3), pp.269-287. Richardson, S., Teoh, S.H. and Wysocki, P.D., 2004. The walk‐down to beatable analyst forecasts: The role of equity issuance and insider trading incentives. Contemporary accounting research, 21(4) Sadka, R. 2006. Momentum and postearnings-announcement drift anomalies: The role of liquidity risk. Journal of Financial Economics 80: 309–349. Savor, P. and Wilson, M., 2013. How much do investors care about macroeconomic risk? Evidence from scheduled economic announcements. Journal of Financial and Quantitative Analysis, 48(2) Shanthikumar, D.M., 2003. Small and large trades around earnings announcements: Does trading behavior explain post-earnings-announcement drift?. Available at SSRN 449800. Sloan, R.G., 1996. Do stock prices fully reflect information in accruals and cash flows about future earnings?. Accounting review, pp.289-315. Sojka, M. 2018. Post Earnings Announcement Drift (PEAD) in Polish Stock Market, Emerging Markets: Finance eJournal Vol 10, Issue 90, July 27, 2018 Sojka, M. 2018, Analysts’ consensus based PEAD in Polish stock market, Emerging Markets: Finance eJournal Vol 11, Issue 3, January 09, 2019 Swart, D.J. and Hoffman, A.J., 2013. Analysis of the post-earnings announcement drift anomaly on the JSE. Investment Analysts Journal, 2013(77), pp.17-34. Szyszka, A., 2001. Quarterly financial reports and the stock price reaction at the Warsaw Stock Exchange. Available at SSRN: 295299 Taylor, D. 2010. Individual investors and corporate earnings. Working paper Truong, C., 2010. Post earnings announcement drift and the roles of drift-enhanced factors in New Zealand. Pacific-Basin Finance Journal, 18(2), pp.139-157. Truong, C., 2011. Post-earnings announcement abnormal return in the Chinese equity market. Journal of International Financial Markets, Institutions and Money, 21(5), pp.637-661. Vega, C. 2006. Stock price reaction to public and private information. Journal of Financial Economics Watts, R.L., 1978. Systematic ‘abnormal’ returns after quarterly earnings announcements. Journal of financial Economics, 6(2), pp.127-150. Zhang, Y., 2008. Analyst responsiveness and the post-earnings-announcement drift. Journal of Accounting and Economics, 46(1), pp.201-215. Zhou H, Zhu JQ. Jump on the Post–Earnings Announcement Drift (corrected). Financial Analysts Journal. 2012 May 1;68(3):63-80. 69 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 69,
    "page_range": "p.69",
    "total_pages": 69,
    "chunk_index": 124,
    "word_count": 370,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.69)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  },
  {
    "text": "returns after quarterly earnings announcements. Journal of financial Economics, 6(2), pp.127-150. Zhang, Y., 2008. Analyst responsiveness and the post-earnings-announcement drift. Journal of Accounting and Economics, 46(1), pp.201-215. Zhou H, Zhu JQ. Jump on the Post–Earnings Announcement Drift (corrected). Financial Analysts Journal. 2012 May 1;68(3):63-80. 69 Electronic copy available at: https://ssrn.com/abstract=3281679",
    "title": "50 Years in PEAD Research",
    "source_type": "pdf",
    "document_id": "4626a240b373",
    "source_file": "50 Years in PEAD Research.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 69,
    "chunk_index": 125,
    "word_count": 50,
    "author": "marek",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20190502140730+01'00'",
    "duration": null
  }
]