[
  {
    "text": "An Empirical Analysis of Option Valuation Techniques Using Stock Index Options Mohammad Yamin Yakoob1 Duke University Durham, NC April 2002 1 Mohammad Yamin Yakoob graduated cum laude from Duke University in 2002. He attained a Bachelor of Science in Economics with Distinction and a second major in Computer Science. Prior to attending Duke University, he completed the International Baccalaureate Diploma program at the United World College of South East Asia in Singapore. Originally from Pakistan, he has also lived in the United Arab Emirates (UAE) and Singapore.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 0,
    "word_count": 87,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Science in Economics with Distinction and a second major in Computer Science. Prior to attending Duke University, he completed the International Baccalaureate Diploma program at the United World College of South East Asia in Singapore. Originally from Pakistan, he has also lived in the United Arab Emirates (UAE) and Singapore. I am grateful to the following people for their advice and assistance in the course of writing this paper: Professor George Tauchen, William Henry Glasson Professor of Economics at Duke University, for serving as my thesis advisor. C. Alan Bester, Ph.D. candidate in the Department of Economics at Duke University, for his invaluable assistance. 1",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Acknowledgment",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 43,
    "chunk_index": 1,
    "word_count": 105,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Acknowledgment (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "following people for their advice and assistance in the course of writing this paper: Professor George Tauchen, William Henry Glasson Professor of Economics at Duke University, for serving as my thesis advisor. C. Alan Bester, Ph.D. candidate in the Department of Economics at Duke University, for his invaluable assistance. 1",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Abstract",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 2,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "This paper analyzes option valuation models using option contracts on the S&P 500 Index and S&P 100 Index. The option prices provided by various models are compared to the market prices of the options to gauge pricing accuracy. I find pricing errors in the Black-Scholes formula from analysis of the “implied volatility smile”. This benchmark model exhibits strong pricing biases across “moneyness”. The errors correspond to biases that arise if market prices actually incorporate a stochastic volatility for the underlying asset. Specifically, the Black-Scholes assumptions of constant volatility and Brownian motion for stock index values are overly simplifying. The Constant Elasticity of Variance model is evaluated as an alternative to Black-Scholes. The particular version of the model used is the Absolute Diffusion model. Using this model, non-constant volatility is introduced to approximate real-world conditions more accurately. I find the Absolute Diffusion model increases pricing errors and does not improve the pricing “fit” provided by the Black-Scholes model. A more comprehensive stochastic volatility model is proposed and evaluated. The Hull-White stochastic volatility model is used to introduce unpredictable random volatility. This model theoretically provides more accurate valuation compared to the relatively simple Black- Scholes model. Nonetheless, the empirical results indicate otherwise. The Hull-White model used in this analysis produces the worst pricing “fit” among the three models under consideration. The benchmark Black-Scholes model thus provides far greater accuracy in pricing. Furthermore, it retains the advantage of ease of use over more complicated models such as the Absolute Diffusion model and the Hull-White stochastic volatility model. 2",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Abstract",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 43,
    "chunk_index": 3,
    "word_count": 255,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "this analysis produces the worst pricing “fit” among the three models under consideration. The benchmark Black-Scholes model thus provides far greater accuracy in pricing. Furthermore, it retains the advantage of ease of use over more complicated models such as the Absolute Diffusion model and the Hull-White stochastic volatility model. 2",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Abstract",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 4,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Option valuation techniques entail pricing financial derivatives. A derivative asset is a security whose value is explicitly dependent on the exogenously given value of some underlying primitive asset on which the option is written. Substantial research has been conducted into the restrictive assumptions of the Black-Scholes pricing model. This research has been motivated by the pricing errors produced by the Black-Scholes model. The primary purpose of this study is to evaluate the role of two fundamental assumptions underlying the Black-Scholes formula. Alternative models that relax specific assumptions of the Black-Scholes model can then be assessed. The assumptions of the Black-Scholes model are: 1. The asset price follows a Brownian motion with µ and s constant 2. There are no transactions costs or taxes 3. There are no riskless arbitrage opportunities 4. The risk-free interest rate is constant 5. Security trading is continuous 6. There are no dividends during the life of the option2 The specific Black-Scholes assumptions under consideration are constant volatility and log-normality of the risk-neutral distribution of prices. These two assumptions form the foundation for the Black-Scholes formula. The Black-Scholes model is known to produce a “volatility smile” when implied volatilities are calculated to impute into the formula. This is evidence of pricing error or bias introduced by this model. This study will therefore analyze the shape of the implied volatility graph generated by the Black-Scholes formula when pricing stock index options across various strike prices. The two assumptions under study can be analyzed by considering the factors that give rise to evidently incorrect implied volatilities. Any option pricing model nonetheless has to make three basic assumptions. These relate to the underlying price process or the distributional assumption, the interest rate process and the market price of factor risks. Each of the assumptions allow many possible choices for the particular factor under consideration. Is the gain from a more realistic 2 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 245. 3",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 43,
    "chunk_index": 5,
    "word_count": 328,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "distributional assumption, the interest rate process and the market price of factor risks. Each of the assumptions allow many possible choices for the particular factor under consideration. Is the gain from a more realistic 2 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 245. 3",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 43,
    "chunk_index": 6,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "feature worth the additional complexity or cost of implementation? In this study, only the underlying price process will be thoroughly examined. In this way, complexity is increased by removing some of the restrictive restrictions in steps to gauge any potential benefit in terms of accuracy. This study will use European-style options on stock indices to analyze various option pricing models. This particular type of option contract is used to enable easier analysis. European options can be exercised only at maturity as opposed to American options, which may be exercised at any point prior to, and at, maturity. The Black- Scholes model in particular provides a closed form analytic expression for valuation of European-style options. American options that may be exercised early entail more complex valuation procedures. Considering that the Hull-White model employs the Black-Scholes formula and the Absolute Diffusion model employs a variant of the Black- Scholes model, it is most appropriate to use European options. 2. Black-Scholes adjusted for dividend-paying assets Stock indices pay dividends in a manner similar to individual stocks that pay dividends. The standard Black-Scholes model can be altered to account for dividend yields on stock indices and “dividend-paying” assets in general. With a continuous dividend yield, q, the asset price grows from S e-qT at time 0 to S at time T. The o T dividend-paying asset exhibits a decrease in the growth rate of its price due to the dividend yield. This occurs because the present value of actual dividends paid before maturity is subtracted from the index value. The decrease is exactly equal to the dividend yield q. This is the main difference between a dividend-paying asset and a non-dividend- paying asset. When valuing options on dividend-paying assets therefore, the stock price is reduced from S to S e-qT at time 0. o o 2.1. Black-Scholes for dividend-paying assets The Black-Scholes formula for a European call option on a dividend-paying stock is: c = S e-qTN(d ) – Xe-rtN(d ) o 1 2 and from put-call parity, a European put option on a dividend-paying stock is given by: 4",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 43,
    "chunk_index": 7,
    "word_count": 346,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "at time 0. o o 2.1. Black-Scholes for dividend-paying assets The Black-Scholes formula for a European call option on a dividend-paying stock is: c = S e-qTN(d ) – Xe-rtN(d ) o 1 2 and from put-call parity, a European put option on a dividend-paying stock is given by: 4",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 8,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "p = Xe-rtN(-d ) – S e-qTN(-d ) 2 o 1 where: d = {ln(S/X) + [r - q + s2/2]T}/s 2 vT 1 f 2 d = d – s vT 2 1 d is the probability that the option finishes “in the money” and d is the probability that 1 2 the option finishes “out of the money”.3 2.1.1 Determinants of Black-Scholes formula adjusted for “dividend paying” assets The Black-Scholes formula is dependent on six variables: 1. S – spot value of stock index 2. X – strike price (fixed characteristic of the option) 3. T – number of days until expiry 4. r – risk-free interest rate in the US f 5. q – dividend yield on the stock indices 6. s – volatility The first three are known and can be obtained easily. r and q are unknown but are easy to f estimate. Furthermore, it is known that the Black-Scholes formula is not sensitive to r f and therefore, not sensitive to q. Volatility on the other hand, is both unknown and somewhat harder to estimate. Furthermore, the Black-Scholes formula is extremely sensitive to volatility. There are essentially two solutions available to the problem of estimating volatility and these are discussed in Section 2.7. Briefly, the volatility for the stock index can be forecasted from historical index data. Alternatively, implied volatility can be calculated using market-quoted prices for the option. The determinants of the Black-Scholes formula have to be gathered before testing the formula. In the following sections, there is analysis of the specific determinants of the Black-Scholes formula with an indication of the source for the data. 3 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000. 5",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 43,
    "chunk_index": 9,
    "word_count": 288,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "the Black-Scholes formula have to be gathered before testing the formula. In the following sections, there is analysis of the specific determinants of the Black-Scholes formula with an indication of the source for the data. 3 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000. 5",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 10,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "The historical stock index values are required for the Black-Scholes formula as well as for the calculation of historical volatility. The data for stock index values was obtained using Yahoo! Finance4 and covers a one-year period from December 1, 2001 to December 3, 2001. 2.3 Stock Index Options The data used in the analysis is comprised of options on the S&P 500 Index (^SPX) and the S&P 100 Index (^XEO). The options written on the two stock indices under study are some of the most actively traded European-style contracts today5. Index options are settled in cash so upon exercise of a call option, the holder receives an amount by which the index exceeds the strike price at close of trading. For a put option, the holder receives the amount by which the strike price exceeds the index at close of trading. The value of each option contract is $100 times the value of the index. The options on both indices have maturity dates following the third Friday of the expiration month. Index options are used extensively for portfolio insurance, whereby ß and the strike price provide a measure of the level of insurance required.6 For options on stock indices, S is the spot value of the index instead of the stock price. Index options are similar to stock options in every other way though. The lognormal Brownian motion process for a stock index under Black-Scholes is as follows: dS = µSdt + sSdz z represents the Brownian process, which is a continuous path that is nowhere differentiable. dz is a mean zero normal random variable with variance dt. This implies that the percentage price change dS over the interval dt is normally distributed with instantaneous mean and variance, µ and s respectively. In this study, for each index there are five call options each of differing strike price and four put options each of differing strike price. For each option data series, observations were obtained from Bloomberg and are from trading days between 4 Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 5 Bakshi, Gurdip & Cao, Charles & Chen, Zhiwu. “Empirical Performance of Alternative Option Pricing Models”. Journal of Finance. 52(5), 1997: 2011. 6",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 43,
    "chunk_index": 11,
    "word_count": 362,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "each of differing strike price. For each option data series, observations were obtained from Bloomberg and are from trading days between 4 Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 5 Bakshi, Gurdip & Cao, Charles & Chen, Zhiwu. “Empirical Performance of Alternative Option Pricing Models”. Journal of Finance. 52(5), 1997: 2011. 6",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 43,
    "chunk_index": 12,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "November 13, 2001 and November 28, 2001. The S&P 500 options are of 19 January 2002 maturity and the S&P 100 options are of 15 February 2002 maturity. The difference in maturity for the two index options reflects the difficulty in obtaining data on sufficiently “thickly” traded contracts. 2.4 Time to Maturity – Calendar days or Trading days Whether to use calendar days to expiry or business days to expiry is a debatable issue. If calendar days are used in the study, the assumption is that the market would trade during weekends. This means that the volatility from Friday's close to Monday's open would be equivalent to the volatility between Monday's close and Thursday's open for example. This is a big overstatement of the weekend's volatility. On the other hand, analysis using trading days to expiry assumes that the volatility from Friday's close to Monday's open is equivalent to the volatility between Monday's close and Tuesday's open for example. This is an understatement of the weekend's volatility. During the two full days of weekend, there is much more time for important news to be incorporated into market prices.7 In most empirical studies and research however, it is widely assumed that use of trading days in options pricing models is most appropriate. In this study therefore, trading days have been used for the analysis and computation. 2.5 Interest Rate The risk-free interest rate in the option pricing formulae is the prevailing US risk- free interest rate of equal maturity as the option. The interest rate used in this analysis is the 3-month rate. This is the closest interest rate period to the maturity of the stock index options. Table 2 depicts the US risk-free interest rates as of November 28, 2001 obtained from the US Federal Reserve. Interest Rate 3-month 1.98% 6-month 2.04% 1-year 2.43% 6 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 296-297. 7 “Black & Scholes Option Pricing Model”. November 20, 2001. <http://www.geocities.com/WallStreet/2529/bsopm.htm> 7",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 43,
    "chunk_index": 13,
    "word_count": 331,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "US risk-free interest rates as of November 28, 2001 obtained from the US Federal Reserve. Interest Rate 3-month 1.98% 6-month 2.04% 1-year 2.43% 6 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 296-297. 7 “Black & Scholes Option Pricing Model”. November 20, 2001. <http://www.geocities.com/WallStreet/2529/bsopm.htm> 7",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 43,
    "chunk_index": 14,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Table 2 – US Interest Rates8 Relatively speaking, the Black-Scholes formula is not extremely sensitive to interest rates. Even if substantially different interest rates were used, the results would not be entirely misleading. Interest rates influence option valuation in two ways primarily. A purchase of an option requires payment of an upfront premium. This premium could be placed on time deposit to earn interest if the purchase had not been made. The option price will naturally reflect this lost interest. The higher the interest rate, the more lost interest, and so the lower the option premiums have to be to compensate for that lost interest. Secondly, the interest rate also reflects the expected return on the underlying stock during the period until maturity of the option. The expected return on a stock is equal to the prevailing interest rate plus a measure of the intrinsic risk of owning that stock. 2.6 Dividend Yield For dividend paying assets such as the stock indices, the present value of actual dividends paid before maturity is subtracted from the index value. The modified Black- Scholes formula in Section 2.1.1 effectively accounts for this. If the dividend yield alters during the life of the option the average annualized dividend yield during the life of the option has to be used. Table 1 displays the dividend yields used in the analysis. Dividend Yield on S&P 100Dividend Yield on S&P 500 Nov 1.40% 1.47% Dec 1.40% 1.38% Average 1.40% 1.43% Table 1 – Dividend Yields9 on S&P Indices The options in this analysis are November contracts so the November dividend yield is sufficient. If further data was gathered extending into December for example, the average 8 Data: Federal Reserve. “Selected Interest Rates”. G.13 (415). <http://www.federalreserve.gov/releases/G13/current/g13.pdf> 9 “Standard & Poor’s”. S&P Index Services. November 30, 2001. <http://www.spglobal.com/indexmain500_data.html> 8",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 43,
    "chunk_index": 15,
    "word_count": 300,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Indices The options in this analysis are November contracts so the November dividend yield is sufficient. If further data was gathered extending into December for example, the average 8 Data: Federal Reserve. “Selected Interest Rates”. G.13 (415). <http://www.federalreserve.gov/releases/G13/current/g13.pdf> 9 “Standard & Poor’s”. S&P Index Services. November 30, 2001. <http://www.spglobal.com/indexmain500_data.html> 8",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 16,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "annualized dividend yield would be required. These dividend yield figures were obtained from DataStream software10. 2.7 Calculating Volatility It is not necessary to forecast expected returns, however estimates of volatility are required in the analysis of the Black-Scholes formula. The price of an option is higher if the volatility of the underlying asset is high. Therefore, an appropriate procedure to calculate volatility has to be used. One method is to use historical volatility by using the historical value of the stock index to estimate future volatility. The past is essentially used as a gauge for the future. Alternatively, volatility can be measured using options prices themselves to obtain implied volatilities. This suggests that provided other relevant variables remain constant, the volatility of the underlying asset may be inferred from the market price of the associated option. If the Black-Scholes formula is true then European options on the same underlying asset with the same expiration date must have the same implied volatility. The implied volatility can be viewed as the markets’ forecast of the volatility of the underlying asset through the life of the option. If the options were priced consistently, they must be priced with the same volatility forecast. 2.7.1 Historical Volatility Historical volatility can be calculated from past stock index data using the following formula: Historical Volatility = ({1/T}{?(S – S )2} [from t=1 to T])1/2 t avg This method assumes that the volatility in the past is a good indicator of the volatility in the future. Each market has an intrinsic volatility and the past can be used as a rough guide to the future. For the short-term however, the past can be a very bad indication of the future. If a dramatic piece of news hits the market, historical volatility is not reliable. An example would be the terrorist attacks of September 11 in New York. There are no similar events in history that can be used for comparison purposes if need be. The 10 Ford Library at the Fuqua School of Business, Duke University, Durham, NC. 9",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 43,
    "chunk_index": 17,
    "word_count": 341,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "historical volatility is not reliable. An example would be the terrorist attacks of September 11 in New York. There are no similar events in history that can be used for comparison purposes if need be. The 10 Ford Library at the Fuqua School of Business, Duke University, Durham, NC. 9",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 18,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "repercussions of this particular event on the market could not be completely anticipated at the time of occurrence either. S&P 500 S&P 100 Daily 1.395% 1.524% Annual 22.14% 24.19% Table 3 – Historical Volatilities11 for S&P Indices Table 3 shows the historical volatilities calculated for index options using the above formula. In the event that historical volatility is unreliable, the best course of action may be to use the market to find volatility. 2.7.2 Implied Volatility The volatility implied by the price of an option is quite naturally termed its “implied volatility”. This is the level of volatility in the Black-Scholes formula that equates the market price of an option to its value given by the formula. Information implicit in option prices is forward-looking as compared to historical data, which reflect the past. In this way, the method of implied volatility provides a better measure of actual volatility. Yesterday’s stock price, r and the call price can be used for day T-1 to get f implied volatility. This implied volatility is used as an estimate for the volatility on day T to get the current call price12. This procedure assumes that the Black-Scholes formula correctly prices the option. The inversion of the Black-Scholes is not analytically possible. Implied volatility can be measured by computing the Black-Scholes formula “backwards”. In order to calculate implied volatility in this manner, the Black-Scholes formula has to be inverted knowing the call price. This can be done in Microsoft Excel. The Black-Scholes price can be equated to the actual market quote of a specific option. The varying parameter in the equation is set as the volatility. The implied volatility is thus that level of volatility, which allows the Black-Scholes price to be equal to the market price of the option. In this way, the implied volatility is the market measure of volatility. 11 Historical stock index data from Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 12 Rubinstein, Mark. “Implied Volatility”. In-The-Money. November 20, 2001.<http://www.in-the- money.com/presentation/sld102.htm> 10",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 43,
    "chunk_index": 19,
    "word_count": 329,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "volatility, which allows the Black-Scholes price to be equal to the market price of the option. In this way, the implied volatility is the market measure of volatility. 11 Historical stock index data from Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 12 Rubinstein, Mark. “Implied Volatility”. In-The-Money. November 20, 2001.<http://www.in-the- money.com/presentation/sld102.htm> 10",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "2.2 Stock Index Spot Values",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 20,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2 Stock Index Spot Values (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "To gauge pricing accuracy two measures have been used, namely, absolute pricing error and relative pricing error. The relevant measures are: 1. Absolute Pricing Error = |C – C | BS obs 2. Relative Pricing Error = (C – C )/C BS obs obs The Black-Scholes option pricing formula is used to infer the volatility of the stock index options from actual option price data. The observed pattern in the implied volatilities will provide insight into the pricing bias in the Black-Scholes formula for stock index options. The implied volatilities can then be graphed to ascertain the type of “volatility smile”. This is discussed in further detail in Section 4.1. The Absolute Diffusion model is used in an effort to relax the assumption of constant volatility in the Black-Scholes model. This model introduces non-constant volatility as explained in Section 5.2. Similarly, the Hull-White stochastic volatility model described in Section 6.2 is an even more generalized pricing model. The assumptions of constant volatility and lognormal distribution of prices under the risk- neutral distribution are both relaxed to allow stochastic, unpredictable volatility. The absolute pricing error for the Absolute Diffusion and Hull-White models relative to Black-Scholes enables an evaluation of the pricing accuracy of these particular models. 3.1 Use of Volatility In order to ensure that the most appropriate measure of volatility is used in this study, this section evaluates pricing given by Black-Scholes using historical and implied volatilities, respectively. Table 4 displays the relative percentage pricing error for call and put options on the S&P 500 over a variety of strike prices. The errors reported are an average of errors on eleven options per strike price, per option type. Implied Volatility Historical Volatility Implied Volatility Historical Volatility Average Call Pricing Average Call Pricing Average Put Pricing Average Put Pricing Strike Price Error Error Error Error 900 0.146% -1.479% 0.141% -95.933% 1050 0.215% -4.829% 1.104% -32.151% 1150 0.771% 5.035% 0.547% 6.715% 1250 0.330% 81.304% -0.130% 4.898% 11",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "3. Testing",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 43,
    "chunk_index": 21,
    "word_count": 325,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Testing (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "per option type. Implied Volatility Historical Volatility Implied Volatility Historical Volatility Average Call Pricing Average Call Pricing Average Put Pricing Average Put Pricing Strike Price Error Error Error Error 900 0.146% -1.479% 0.141% -95.933% 1050 0.215% -4.829% 1.104% -32.151% 1150 0.771% 5.035% 0.547% 6.715% 1250 0.330% 81.304% -0.130% 4.898% 11",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "3. Testing",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 22,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Testing (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Error -0.060% 70.684% 0.416% -29.118% Table 4 – Average Relative Pricing Error for Black-Scholes using S&P 500 options It is evident from the results in Table 4 that historical volatilities entail much greater pricing error than implied volatilities for S&P 500 options. The average error reported at the end is the mean of the average error reported per option type and per strike price. This is used as a simple indicator of the difference in accuracy in the use of historical volatilities and implied volatilities. Table 5 displays the relative percentage pricing error for call and put options on the S&P 100 over a variety of strike prices. From these results it is also evident that historical volatility entails much greater pricing error than implied volatility for S&P 100 options. Implied Volatility Historical Volatility Implied Volatility Historical Volatility Average Call Pricing Average Call Pricing Average Put Pricing Average Put Pricing Strike Price Error Error Error Error 460 0.245% -1.226% 0.254% -82.312% 540 0.280% -1.731% 0.997% -11.029% 580 0.459% 6.106% 0.714% 10.813% 620 1.068% 35.809% 0.202% 13.181% 700 1.269% 452.189% N/A N/A Average Error 0.664% 98.229% 0.542% -17.337% Table 5 – Average Relative Pricing Error for Black-Scholes using S&P 100 options Considering the greater accuracy of implied volatility compared to historical volatility, the analysis will employ implied volatilities. The use of implied volatilities instead of historical volatilities is consistent with the methodology of other similar research. Historical volatilities are essentially based on historical data reflecting events in the past. Information implicit in options prices is forward-looking and theoretically a better measure of real-world market conditions. 4. Black-Scholes in practice The emphasis in this analysis is on the fundamental assumptions of the Black- Scholes. The Black-Scholes formula is known to exhibit several forms of pricing bias. The known pricing biases include “moneyness” bias, maturity bias and bias in the 12",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 43,
    "chunk_index": 23,
    "word_count": 308,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "better measure of real-world market conditions. 4. Black-Scholes in practice The emphasis in this analysis is on the fundamental assumptions of the Black- Scholes. The Black-Scholes formula is known to exhibit several forms of pricing bias. The known pricing biases include “moneyness” bias, maturity bias and bias in the 12 accuracy of pricing calls relative to puts. However, it is essentially “moneyness” bias that results in the observed “volatility smiles”. This can be analyzed by graphing implied volatility against strike price for the various stock index options. The stochastic volatility in asset prices and non-log-normality of asset prices under the risk-neutral distribution are reasons for the bias present in the Black-Scholes. A key implication of the Black-Scholes formula is that all standard options on the same underlying asset with the same time-to-expiration should have the same implied volatility. This serves as a way of testing the validity of the Black-Scholes formula to evaluate whether implied volatilities are in fact the same independent of strike price. A graph of implied volatility against strike price is used to ascertain whether implied volatilities are in fact the same independent of strike price. 4.1 “Volatility Smirk” for S&P 500 Index Options The relation between implied volatility and strike price is termed the “implied volatility smile” and this in effect is “moneyness” bias. In this section, the implied volatility reported is an average value of the eleven implied volatilities per option, per strike price representing the amount of data for each option. This is outlined in Section 2.7.2. Figure 1 shows the “volatility smile” for call options on the S&P 500 Index. 13",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 43,
    "chunk_index": 24,
    "word_count": 268,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "In this section, the implied volatility reported is an average value of the eleven implied volatilities per option, per strike price representing the amount of data for each option. This is outlined in Section 2.7.2. Figure 1 shows the “volatility smile” for call options on the S&P 500 Index. 13 0.4500 0.4000 0.3500 0.3000 0.2500 0.2000 0.1500 0.1000 0.0500 0.0000 0.7975 0.9304 1.019 1.108 1.196 Moneyness 14 ytilitaloV deilpmI Figure 1 – Average implied volatility for S&P 500 call options over 10-day period The values along the x-axis in Figures 1 through 4 are the ratios between a particular strike price and the spot index value. This gives a measure of the “moneyness” of the option and is calculated in the following manner: “Moneyness” Ratio = X/S i The value of S used for the S&P 500 Index is 1128.52, which was the value of the index on November 28, 2001. Similarly, the value of S used for the S&P 100 Index is 578.92. This allows analysis of implied volatility relative to the “moneyness” of an option. Table 6 depicts the strike prices used for calls and puts on the S&P 500 Index. Call Put Deep in the money 900 N/A In the money 1050 1250 At the money 1150 1150 Out of the money 1250 1050 Deep out of the money 1350 900 Table 6 – S&P 500 Index Option Strike Prices If the Black-Scholes formula were entirely valid, the plot of implied volatility against strike price of options on the same asset with identical maturity would be a straight horizontal line. Instead, there is clearly a “volatility smirk” in the case of the S&P 500",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 43,
    "chunk_index": 25,
    "word_count": 277,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "S&P 500 Index Option Strike Prices If the Black-Scholes formula were entirely valid, the plot of implied volatility against strike price of options on the same asset with identical maturity would be a straight horizontal line. Instead, there is clearly a “volatility smirk” in the case of the S&P 500",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 43,
    "chunk_index": 26,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "call as shown in Figure 1. Figure 2 shows the implied volatility for S&P 500 Index put options. 0.4000 0.3500 0.3000 0.2500 0.2000 0.1500 0.1000 0.0500 0.0000 0.7975 0.9304 1.019 1.108 Moneyness 15 ytilitaloV deilpmI Figure 2 – Average implied volatility for S&P 500 put options over 10-day period There is clearly a “volatility smirk” in this case as well. For call options, increasing values along the x-axis represent higher strike prices and thus, options further “out of the money”. For put options on the other hand, increasing x-axis values represent options further “in the money”. In the case of both options, the volatility decreases as the strike price increases. The Black-Scholes formula therefore, would be expected to over-price “in the money” calls and “out of the money” puts. This is because implied volatility is highest for low strike prices corresponding to “in the money” calls and “out of the money” puts. In Table 4 of Section 3.2 low strike prices, those lower than 1150, correspond to higher positive relative pricing errors using implied volatilities for both call and put options. Similarly, at high strike prices there are negative relative pricing errors as calculated in Section 3.2. This is an indication that the Black-Scholes formula under-prices “out of the money” calls and “in the money” puts. The graphs in Figures 1 and 2 concur with this conclusion. The implied volatility is highest for “in the money” calls and “out of the money” puts. This implies that the Black-Scholes formula would over-price such options.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 43,
    "chunk_index": 27,
    "word_count": 253,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Black-Scholes formula under-prices “out of the money” calls and “in the money” puts. The graphs in Figures 1 and 2 concur with this conclusion. The implied volatility is highest for “in the money” calls and “out of the money” puts. This implies that the Black-Scholes formula would over-price such options. The opposite situation arises for “out of the money” calls and “in the money” puts. High strike prices correspond to lower implied volatilities. 4.1.1 “Volatility Smirk” for S&P 100 Index Options In this section, the “volatility smirk” for S&P 100 Index Options is analyzed. Table 7 displays the strike prices used for S&P 100 Index options in the analysis. Call Put Deep in the money 460 N/A In the money 540 620 At the money 580 580 Out of the money 620 540 Deep out of the money 700 460 Table 7 – S&P 100 Index Option Strike Prices Figure 3 shows the “volatility smile” for call options on the S&P 100 Index. There is clearly a “volatility smirk” in the case of the S&P 100 call as shown in Figure 3. Figure 4 displays the implied volatility for put options on the S&P 100 Index. 0.3500 0.3000 0.2500 0.2000 0.1500 0.1000 0.0500 0.0000 0.795 0.933 1.002 1.071 1.209 Moneyness 16 ytilitaloV deilpmI Figure 3 – Average implied volatility for S&P 100 call options over 10-day period",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 17,
    "page_range": "p.17-18",
    "total_pages": 43,
    "chunk_index": 28,
    "word_count": 227,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.17-18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "as shown in Figure 3. Figure 4 displays the implied volatility for put options on the S&P 100 Index. 0.3500 0.3000 0.2500 0.2000 0.1500 0.1000 0.0500 0.0000 0.795 0.933 1.002 1.071 1.209 Moneyness 16 ytilitaloV deilpmI Figure 3 – Average implied volatility for S&P 100 call options over 10-day period 0.3500 0.3000 0.2500 0.2000 0.1500 0.1000 0.0500 0.0000 0.7946 0.9328 1.002 1.071 Moneyness 17 ytilitaloV deilpmI Figure 4 – Average Implied Volatility for S&P 100 put options over 10-day period It is clear from both graphs that the implied volatility does decrease as strike price increases. The discussion in Section 4.1.1 regarding Black-Scholes formula pricing errors in S&P 500 options applies similarly to S&P 100 index options. Referring to Table 5 in Section 3.2 however, the results of bias in pricing are not quite as conclusive for S&P 100 options as for S&P 500 Index options. From that table, it is not evident that Black- Scholes over-prices “in the money” calls and “out of the money” puts and vice-versa. A detailed analysis of the “volatility smirk” is conducted in the following section to ascertain the exact pattern of Black-Scholes pricing bias and reasons for the pricing bias. 4.2 “Volatility Smirk” for Stock Index Options It is clear from Figures 1 through 4 that there exists a “volatility smirk” for stock index options. This “volatility smirk” arises because of the fundamental Black-Scholes assumptions of constant volatility and lognormal price distribution. In order for option prices to correctly follow the Black-Scholes formula, volatility has to be constant. Volatility is not constant over the life of most financial assets however. In reality, non-constant volatility and probability of “jumps” in the underlying asset price exist. In",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 43,
    "chunk_index": 29,
    "word_count": 282,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "of constant volatility and lognormal price distribution. In order for option prices to correctly follow the Black-Scholes formula, volatility has to be constant. Volatility is not constant over the life of most financial assets however. In reality, non-constant volatility and probability of “jumps” in the underlying asset price exist. In fact, volatility should be thought of as a random variable itself, whereby volatility changes over different time periods. Furthermore, stock prices are assumed to follow a geometric Brownian motion in the Black-Scholes model. This implies that the stock price is a continuous function of time. In reality though, information may lead to “jumps” in asset prices as markets incorporate information. These “jumps” are assumed away under the Black-Scholes model. 4.3 Reasons for the “Volatility Smirk” The “volatility smirk” arises because the fundamental assumptions of the Black- Scholes formula do not hold in reality. In the following sections, the reasons for the “volatility smirk” are discussed in greater depth. 4.3.1 Implied distribution vs. the lognormal distribution The distribution for stock index options is not lognormal. In fact, the distribution is such that there is a “fat left tail” and a “thin right tail” relative to the lognormal distribution. Figure 5 depicts the theoretical difference in the implied distribution observed for stock index options and the lognormal distribution assumed under the Black-Scholes formula. The evidence in the form of the volatility smirk is indicative of implicit stock return distributions that are negatively skewed with higher kurtosis than allowable in a lognormal distribution. 18",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 43,
    "chunk_index": 30,
    "word_count": 251,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "theoretical difference in the implied distribution observed for stock index options and the lognormal distribution assumed under the Black-Scholes formula. The evidence in the form of the volatility smirk is indicative of implicit stock return distributions that are negatively skewed with higher kurtosis than allowable in a lognormal distribution. 18",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Average",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 31,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Average (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Strike Price 13 Figure 5 – Lognormal and Implied Distributions for Stock Index Options The underlying implied distribution generally creates the “volatility smile”. According to the implied distribution, downward movements in prices are more likely than the lognormal distribution would predict. Similarly, upward movements in prices are less likely than the lognormal distribution would predict. The assumptions of log-normality do not realistically hold therefore. If there was a distribution with “fat tails” at both ends, the market would assume that movements in both directions are more likely than that predicted by the lognormal distribution. Such a distribution would give rise to a more U- shaped “volatility smile”. Figure 5 above can be used to predict the type of pricing error under the Black- Scholes to analyze whether the observations in Section 4.1 are valid. At low strike prices, “out of the money” puts will be overpriced under the implied distribution relative to the lognormal distribution. This is because the option pays off only if the stock index value moves below a particularly low strike price. The market predicts that downward movement is more likely than the lognormal distribution would predict. This is evident 13 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 439. 19",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 20,
    "page_range": "p.20-21",
    "total_pages": 43,
    "chunk_index": 32,
    "word_count": 209,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.20-21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "option pays off only if the stock index value moves below a particularly low strike price. The market predicts that downward movement is more likely than the lognormal distribution would predict. This is evident 13 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 439. 19 from the “fatter” tail under the implied distribution. The market thus assigns a greater value to the “out of the money” put than under the lognormal distribution. This means the “out of the money” puts are over-priced and have greater volatility. This is perfectly consistent with the observations in Section 4.1. This analysis holds for “in the money” calls because “out of the money” puts are essentially the same as “in the money” calls. Therefore, “in the money” calls are also over-priced by the Black-Scholes formula. At high strike prices, calls are “out of the money” and will be under-priced by the implied distribution. Such options pay off only if the stock index value moves above a particularly high strike price. According to the implied distribution “tail” at high strike prices, the market predicts that upward movement is less likely than the lognormal distribution would predict. The market thus assigns a smaller value to an “out of the money” call because there is less likelihood of the stock index value exceeding a given high strike price. This is also perfectly consistent with the observations in Section 4.1. Similar to the argument above, an “out of the money” call is the same as an “in the money” put. The Black-Scholes formula thus under-prices “in the money” put options. In reality, stochastic volatility leads to a greater likelihood of a negative outcome relative to the lognormal distribution. The implied distribution of asset price has greater kurtosis than the lognormal distribution. For stock index options, this translates to the implied distribution having the same mean and standard deviation as the lognormal distribution but a “fat left tail” and “thin right tail”. The primary reason for this is that implied distribution accounts for a potential market crash. 4.3.2 Systematic Shifts in Volatility The volatility of asset returns has been identified as an important determinant of options prices. The Black-Scholes model calculates implied volatilities on a daily basis so these are varying. The underlying assumption of the model however is that asset returns have a lognormal distribution with a constant variance rate. In reality, volatility is affected by factors such as trading volume and the incorporation of new information into market prices. Further, the lognormal distribution of asset returns is also a simplifying assumption. The results in Section 4.3.1 are clear evidence of a skewed asset return 20",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 43,
    "chunk_index": 33,
    "word_count": 443,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "a constant variance rate. In reality, volatility is affected by factors such as trading volume and the incorporation of new information into market prices. Further, the lognormal distribution of asset returns is also a simplifying assumption. The results in Section 4.3.1 are clear evidence of a skewed asset return 20",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 43,
    "chunk_index": 34,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "distribution as opposed to a lognormal distribution as assumed by the Black-Scholes formula. 4.4 Questioning the assumptions of Black-Scholes “Jumps” in the price of the underlying asset imply that the asset price doesn’t follow a perfect Brownian motion. Essentially, there are sharper movements in markets than if price movements were purely random. The stock market falls faster than it rises and the probability of a large fall is greater than that of a large rally. This is despite the fact that under the lognormal assumption, the asset can only drop by 100%. In other words, the asset loses all its value but on the upside, gains are unlimited so the asset can increase by more than 100% in value. Increase in leverage can perhaps explain the volatility smile in equity options. As corporate equity declines due to a decline in the market, the leverage of a given company increases. This leads to increased risk of the existing equity and hence, an increase in volatility. As the equity increases however, leverage decreases and thus volatility decreases due to lower risk. This translates to an increase in price and thus, volatility is a decreasing function of stock price.14 The Black-Scholes model is considered most inaccurate for options that are not “at the money”. From Tables 4 and 5 in Section 3.2, this is not immediately evident because the Black-Scholes model is not conclusively most accurate for “at the money” options. Nonetheless, any alternative to the Black-Scholes model should accurately price options that are not “at the money”. In most research in this field, these are the types of options that are considered most inaccurately priced. The Black-Scholes formula is a no arbitrage model in essence as it assumes away market frictions. This is not true in reality and may perhaps account for the pricing errors in the Black-Scholes formula. Arbitrage-based models also known as equilibrium pricing models15 can be used to verify this. 14 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 440. 15 Scott, Louis O. “Option Pricing when the Variance Changes Randomly: Theory, Estimation, and an Application”. Journal of Financial and Quantitative Analysis. 22(4), 1987: 419. 21",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 43,
    "chunk_index": 35,
    "word_count": 362,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "equilibrium pricing models15 can be used to verify this. 14 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 440. 15 Scott, Louis O. “Option Pricing when the Variance Changes Randomly: Theory, Estimation, and an Application”. Journal of Financial and Quantitative Analysis. 22(4), 1987: 419. 21",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 43,
    "chunk_index": 36,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Furthermore, there exist models that account for the “jump” in stock prices. These models account for the number of jumps that can occur during the life of the option, the period from purchase to maturity. The jump size has to be log-normally distributed as well because it determines the stock price fluctuation. The assumption of constant volatility is not true in reality and this particular assumption can be relaxed in models such as the Constant Elasticity of Variance model. One version of this particular model will be used to test the hypothesis concerning leverage effects on volatility. The version of this model, the Absolute Diffusion model is discussed in Section 5. Models that allow even further generalization by accommodating for completely stochastic volatility are termed stochastic volatility models. One such stochastic volatility model proposed by Hull and White16 is discussed in Section 6. 5. The Constant Elasticity of Variance Model An alternative model for option pricing is the Constant Elasticity of Variance model. This model incorporates a non-stationary variance rate. Under the model, the stock price has a volatility of sS-a for some a where 0 = a = 1. The variance of the price change thus has an inverse relationship to the stock price. The model implies that the volatility decreases as stock price increases. The particular version of the Constant Elasticity of Variance model to be used in the analysis is the Absolute Diffusion model in which the a parameter is 1. 5.1 The Absolute Diffusion Model When the a parameter is 1 the stock price volatility is directly inversely proportional to stock price. For individual firms, a fall in the firm’s stock price causes the market value of its equity to decrease faster than the market value of its debt. This increases leverage for a given level of fixed costs. This would be true even in the absence of debt so the risk increase is reflected in greater stock price volatility.17 This can be 16 Hull, John C. & White, Alan. “The Pricing of Options on Assets with Stochastic Volatilities”. The Journal of Finance. Vol. 42, 2 (1987) : 281-300. 17 Beckers, Stan. “The Constant Elasticity of Variance Model and Its Implications For Option Pricing”. Journal of Finance. 35 (3), 1980: 664. 22",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 43,
    "chunk_index": 37,
    "word_count": 376,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "be 16 Hull, John C. & White, Alan. “The Pricing of Options on Assets with Stochastic Volatilities”. The Journal of Finance. Vol. 42, 2 (1987) : 281-300. 17 Beckers, Stan. “The Constant Elasticity of Variance Model and Its Implications For Option Pricing”. Journal of Finance. 35 (3), 1980: 664. 22",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 43,
    "chunk_index": 38,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "translated to apply to stock indices. Essentially the stock index is a portfolio of individual stocks so the effects on the individual stock translate approximately to effects on the combination of individual stocks. When the stock index declines, the overall performance of the firms that make up the stock index decline. Thereby overall fixed costs have to be met with a lower level of performance and effectively, higher leverage. This translates to greater volatility. When the value of the index increases, performance increases for a given level of fixed costs thereby reducing volatility. In addition, downturns may lead to greater volatility in asset prices. This implies a drop in prices and subsequently, a drop in the value of the stock index. The model for the stock price under the absolute diffusion model is given by: dS = µSdt + sS1- a dz so: S – S = µ S dt + sS Z t t-1 t-1 t-1 t This indicates that the stock price changes are mapped by one variable parameter. The volatility parameter is dependent on the stock price. In the case of the Absolute Diffusion model, the asset returns are assumed to be the same as under the Black-Scholes assumption but volatility becomes a function of the stock index value. The a parameter is 1 so the volatility term is essentially sS-a as mentioned above. This gives the inverse relationship between volatility and stock index value. The Absolute Diffusion formula for a European call option is: c = (S – Xe-rt)N(y ) + (S + Xe-rt)N(y ) + ?[n(y ) – n(y )] o 1 o 2 1 2 where: ? = sv[(1-e-2rt)/2r] y = S – Xe-rt/ ? 1 o y = – S – Xe-rt/ ? 2 o n(y) = e-(y^2)/2/v2p The analysis of put options under the Absolute Diffusion model was conducted by essentially using the put-call parity condition directly. Recall that this condition states: c + Xe-rT = p + S o 23",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 43,
    "chunk_index": 39,
    "word_count": 329,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Xe-rt/ ? 1 o y = – S – Xe-rt/ ? 2 o n(y) = e-(y^2)/2/v2p The analysis of put options under the Absolute Diffusion model was conducted by essentially using the put-call parity condition directly. Recall that this condition states: c + Xe-rT = p + S o 23 The analysis of call options translates directly to put options through the put-call parity condition. 5.2 Absolute Diffusion Model in practice 2.000 1.800 1.600 1.400 1.200 1.000 0.800 0.600 0.400 0.200 0.000 900 1050 1150 1250 1350 Strike Price 24 rorrE ecirP etulosbA Absolute Diffusion Black-Scholes Figure 6 – Average Absolute Pricing Error for S&P 500 Call Options In order to test the Absolute Diffusion model, the same data that was used for testing the Black-Scholes formula was applied. In this analysis as before, an average of the pricing errors are reported for the eleven days of data per option, per strike price. Figure 6 displays the average absolute pricing error for call options on the S&P 500. It can be seen that the Absolute Diffusion model does not provide a better pricing estimate relative to the Black-Scholes. The accuracy of a deep “in the money” call option is improved through the use of the Absolute Diffusion model. Under the Black-Scholes model, these options are over-priced. The Absolute Diffusion model would predict a higher volatility at low strike prices similar to the Black-Scholes because of the inverse relationship of volatility to stock index value. It is possible however, that the Absolute Diffusion model gives a more accurate estimate of volatility at low strike prices.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 43,
    "chunk_index": 40,
    "word_count": 264,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "are over-priced. The Absolute Diffusion model would predict a higher volatility at low strike prices similar to the Black-Scholes because of the inverse relationship of volatility to stock index value. It is possible however, that the Absolute Diffusion model gives a more accurate estimate of volatility at low strike prices. 1.600 1.400 1.200 1.000 0.800 0.600 0.400 0.200 0.000 900 1050 1150 1250 Strike Price 25 rorrE gnicirP etulosbA Black-Scholes Absolute Diffusion Figure 7 – Average Absolute Pricing Error for S&P 500 Put Options Figure 7 displays the absolute pricing error for put options on the S&P 500. The “out of the money” puts in this case do not provide better pricing than the Black-Scholes as they would be expected to considering the improvement in accuracy for “in the money” calls. Figure 8 displays the average absolute pricing error for call options on the S&P 100 Index. In this case the Absolute Diffusion model provides greater accuracy for deep “in the money” calls. This is similar to the observation for call options on the S&P 500 Index. Figure 9, which depicts the average absolute pricing error for put options on the S&P 100 Index however, provides the same inconclusive results as those for the S&P 500 Index. Essentially, the absolute pricing error for deep “out of the money” puts is not better relative to the Black-Scholes pricing errors. 1.000 0.900 0.800 0.700 0.600 0.500 0.400 0.300 0.200 0.100 0.000 460 540 580 620 700 Strike Price 26 rorrE ecirP etulosbA Black-Scholes Absolute Diffusion Figure 8 – Average Absolute Pricing Error for S&P 100 Call Options 0.900 0.800 0.700 0.600 0.500 0.400 0.300 0.200 0.100 0.000 460 540 580 620 Strike Price rorrE ecirP etulosbA Black-Scholes Absolute Diffusion Figure 9 – Average Absolute Pricing Error for S&P 100 Put Options",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 43,
    "chunk_index": 41,
    "word_count": 299,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "etulosbA Black-Scholes Absolute Diffusion Figure 8 – Average Absolute Pricing Error for S&P 100 Call Options 0.900 0.800 0.700 0.600 0.500 0.400 0.300 0.200 0.100 0.000 460 540 580 620 Strike Price rorrE ecirP etulosbA Black-Scholes Absolute Diffusion Figure 9 – Average Absolute Pricing Error for S&P 100 Put Options",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 43,
    "chunk_index": 42,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "From these results therefore, it cannot be concluded that the Absolute Diffusion model provides more accurate pricing at low strike prices. This observation is valid for “in the money” call options but not “out of the money” put options. Overall, the Absolute Diffusion model worsens the fit to market prices when compared to the Black-Scholes model. From the empirical evidence in this analysis, it is clear that the Absolute Diffusion model is not a superior model to the Black-Scholes. Despite accounting for non-constant volatility, it cannot improve the results provided by the less complex and easier to implement Black-Scholes formula. Furthermore, the model potentially allows stock index values to be negative. There is no restriction on the magnitude and sign of the asset price so a negative stock index value is not impossible under this model. From the empirical absolute pricing error results presented herein the conclusion to be drawn is that the Absolute Diffusion model does not provide greater accuracy in option pricing. Perhaps a model that accounts for stochastic volatility rather than simply non- constant volatility is required. The fact that varying asset volatility albeit with a pattern still produces pricing errors implies that the next step in the process is necessary. The constant volatility assumption has to be relaxed completely to allow for unpredictable stochastic volatility. 5.3 Option valuation models that further relax Black-Scholes assumptions The Hull-White Stochastic Volatility model is a model that fulfills the requirement of unpredictable stochastic volatility. The model assumes that volatility is stochastic and uses mean reversion in the rate generation process18. The model considers volatility as a random variable with a density function. The method of Monte Carlo simulations can be used to approximate the prices implied by the Hull-White model. 18 Falkenstein, Eric. “Model Selection and Hedge Ratios”. Financial Engineering News. 1 (2). <http://fenews.com/1997/v1n2/modelselection.htm> 27",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 43,
    "chunk_index": 43,
    "word_count": 305,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "in the rate generation process18. The model considers volatility as a random variable with a density function. The method of Monte Carlo simulations can be used to approximate the prices implied by the Hull-White model. 18 Falkenstein, Eric. “Model Selection and Hedge Ratios”. Financial Engineering News. 1 (2). <http://fenews.com/1997/v1n2/modelselection.htm> 27",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "Distribution",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 44,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Distribution (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Under more realistic conditions, stock price volatility varies randomly over time. Furthermore, the variation in volatility is not predictable. The Black-Scholes model calculates implied volatility from options prices and the implied volatilities vary from one day to the next. The underlying assumption however is that stock returns have a lognormal distribution with a constant variance of the volatility, known as the variance rate. The real-world implications of such a distribution are explained in Section 4.3. Stochastic volatility models do not assume normally distributed asset returns. The variance of asset returns is assumed to change randomly albeit with a mean-reverting tendency. Such models provide control over the level of “skewness” of the asset return distribution and allow for volatility to change stochastically. The Hull-White model offers a flexible distributional structure whereby the correlation between volatility shocks and underlying stock returns serves to control the level of “skewness”. The ability to manage volatility variation allows control over the level of kurtosis in the distribution. 6.1 Hull-White stochastic volatility model Under the Hull-White model, the European call price is given by: ?8 c(Vaverage)g(Vaverage)dVaverage Vaverage is the average value of the variance rate, the square of the volatility; c is the Black-Scholes call price expressed as a function of Vaverage; and g is the probability density function of Vaverage under a risk-neutral probability. The following assumptions apply to the stochastic volatility model: 1. Frictionless markets 2. Risk-free rate and dividend yield are constant 3. Value of the stock index follows a stochastic process (geometric jump diffusion) and the variance rate, V, follows a mean-reverting square root process: dS/S = rdt + vVdzs dV = a(b-V)dt + ? Vadzv 19 19 Hull, John C. & White, Alan. “The Pricing of Options on Assets with Stochastic Volatilities”. The Journal of Finance. 42(2), 1987: 283. 28",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 43,
    "chunk_index": 45,
    "word_count": 299,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "(geometric jump diffusion) and the variance rate, V, follows a mean-reverting square root process: dS/S = rdt + vVdzs dV = a(b-V)dt + ? Vadzv 19 19 Hull, John C. & White, Alan. “The Pricing of Options on Assets with Stochastic Volatilities”. The Journal of Finance. 42(2), 1987: 283. 28",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 43,
    "chunk_index": 46,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "The additional stochastic volatility equation provides in effect, the basis for an increase in accuracy. The Brownian motion assumption of the Black-Scholes model specifies that the instantaneous percentage change in stock index value has a constant “drift” rate µ and volatility s: dS = µSdt + sSdz Under the stochastic volatility model the volatility is completely stochastic, indicated by the dV parameter, which comes into effect in the stock index value process. This model provides comprehensive generalization from the assumptions of the Black-Scholes formula. Instead of incorporating “jumps” or non-constant volatility as in the pure “jump” model and the Absolute Diffusion model respectively, the Hull-White model incorporates the stochastic volatility characteristic of observed securities. This is a more realistic feature and allows a theoretically better approximation of real-world market conditions. 6.2 Hull-White stochastic volatility model process and implications Computing the Hull-White model integral is extremely challenging. In order to do so, a finite approximation has to be used. Constants need to be input for the parameter values in the equations for the stock index value process and the variance rate. The parameters for the stock index value and variance rate above imply that there is constant jump intensity and a mean-reverting process for volatility. In order to estimate the integral, the volatility process can be simulated over the life of the option and an average value can be calculated. This process can be repeated to obtain multiple results and then summation over all the results produces an approximation for the integral. As opposed to the Absolute Diffusion model, the process for stochastic variance cannot take on negative values. This is consistent with real-world conditions whereas the Absolute Diffusion model may allow stock index values to be negative. It should be expected that many effects of stochastic volatility on option prices would be related to the time-series dynamics of volatility. A higher variance rate should result in over-pricing of options similar to the Black-Scholes model. Comparing the price and volatility parameters of the stochastic volatility model, it can be seen that the generalization offers a better theoretical fit to reality. Furthermore, the model allows for a 29",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 43,
    "chunk_index": 47,
    "word_count": 356,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "dynamics of volatility. A higher variance rate should result in over-pricing of options similar to the Black-Scholes model. Comparing the price and volatility parameters of the stochastic volatility model, it can be seen that the generalization offers a better theoretical fit to reality. Furthermore, the model allows for a 29",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 43,
    "chunk_index": 48,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "number of testable restrictions since it relates pricing biases to the dynamics of spot prices and the distribution of returns. 20 6.3 Hull-White stochastic volatility model in practice In order to compute the integral as specified: ?8 c(Vaverage)g(Vaverage)dVaverage the process can be modeled in Microsoft Excel. The integral over an infinite interval can be approximated using a finite sum. In order to perform this approximation, the sum has to be truncated at some point. Option prices are less than infinity so this must imply that the integral over the infinite interval is less than infinity. As a corollary, the terms of the sum are decreasing in value. Therefore, a finite sum can be used to approximate the integral up to some point M. In the general case, this condition is represented by: S8a ˜ SM a <8 n n The integral over an infinite interval can be viewed approximately as an infinite sum. For some sufficiently large value of M therefore, the truncated sum is a good approximation for the infinite sum. The first term in the integral is simply the Black-Scholes call price evaluated at the average volatility value. The following terms, g(Vaverage)*dVaverage, simply represent the following term, dG(Vaverage) in extended form. g is the derivative of the function G, which is simply the function describing the distribution of average volatility values. Given this consolidation of terms the integral simplifies to: ?8 c(Vaverage)dG(Vaverage) The distribution function of the average volatility values is simply the volatility process modeled in Section 6.4.1. The integral is thus equivalent to the expected value of the call price evaluated for each of the average volatility values given by the distribution function. This is expressed as: E[c(Vaverage)] If M is the number of average volatility values used then this expectation evaluates to: 20 Heston, Steven L. “A Closed-Form Solution for Options with Stochastic Volatility with Applications to 30",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 43,
    "chunk_index": 49,
    "word_count": 313,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "price evaluated for each of the average volatility values given by the distribution function. This is expressed as: E[c(Vaverage)] If M is the number of average volatility values used then this expectation evaluates to: 20 Heston, Steven L. “A Closed-Form Solution for Options with Stochastic Volatility with Applications to 30",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 43,
    "chunk_index": 50,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "(1/M)* SMc (Vaveragei) bs There are some simplifying and restrictive processes in this analysis. The parameters of the Hull-White model need to be estimated. Econometric tools are usually applied to obtain an accurate estimation procedure. Such procedures may not be practical in this analysis however due to the requirements on historical data and sheer computational resource needs. Furthermore, the results for European call options are directly transferable to European put options through the put-call parity condition. In the interest of space and computational resources this analysis will evaluate the Hull-White model for European call options. 6.3.1 Modeling the volatility process Considering the volatility process specified by: dV = a(b-V)dt + ? Vadzv it can be recognized that the a(b-V)dt component is the mean of the volatility and the ?Vadzv term is the variance of the volatility. For the purposes of this study, the value of a to be used is ½. This implies a square-root of volatility term specifying the variance in the volatility process equation. In the absence of a technical estimation procedure as indicated in Section 6.4, it is rather difficult to impute values for the constants in the above equation. Instead, the volatility process can be re-stated as: d(V – V) = k(V*-V) + ? V1/2dzv21 t+1 t t In this specification, the k component is the level of mean reversion, the ? term is the variance rate or the volatility of the volatility and V* is the long-run historical volatility of the asset. These values are either readily available or easier to estimate. Table 8 depicts the values used for both S&P 500 Index options and S&P 100 Index options. The values for V* are obtained directly from calculations of historical volatility in Section 3.2. Bond and Currency Options”. The Review of Financial Studies. Vol. 6, 2 (1993) : 327-343. 21 Professor George Tauchen, William Henry Glasson Professor of Economics, Duke University, Durham, NC 31",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 43,
    "chunk_index": 51,
    "word_count": 319,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "and S&P 100 Index options. The values for V* are obtained directly from calculations of historical volatility in Section 3.2. Bond and Currency Options”. The Review of Financial Studies. Vol. 6, 2 (1993) : 327-343. 21 Professor George Tauchen, William Henry Glasson Professor of Economics, Duke University, Durham, NC 31",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "6. Stochastic volatility models",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 43,
    "chunk_index": 52,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Stochastic volatility models (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "k 0.2 0.2 v* 0.16 0.16 c 0.4 0.4 22 Table 8 – Constant values used in the specification of the Hull-White model The above equation can be entered into Microsoft Excel directly to calculate the actual volatility given a sampling of normally distributed random values. The sampling of random numbers in effect produces the stochastic component. Using the stochastic numbers to compute volatility given the specification above results in a stochastic volatility process. In order to ensure that the modeled volatility is representative of real- world conditions, if the random number generation procedure produces negative volatilities, a minimum value of 0.01 is automatically imposed in place of the negative volatility. Essentially, for each simulation, the life of the option is “discretized” into one-day periods whereby each randomly generated number corresponds to one-day in the volatility process. The average volatility for that particular simulation is then the expected value of the volatility path over the life of the option given by: Vaveragei = (?/T)* S?i V? where ? is the “discretization” factor, which is one day in this analysis. The initial value for the volatility path is set as the implied volatility for an “at the money” option of the same type. This ensures that the volatility path produces an expected value similar to the implied volatility of an “at the money” option depending on the reversion coefficient and variance rate. 22 Professor George Tauchen, William Henry Glasson Professor of Economics, Duke University, Durham, NC 32",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 43,
    "chunk_index": 53,
    "word_count": 246,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "money” option of the same type. This ensures that the volatility path produces an expected value similar to the implied volatility of an “at the money” option depending on the reversion coefficient and variance rate. 22 Professor George Tauchen, William Henry Glasson Professor of Economics, Duke University, Durham, NC 32 1.00 0.90 0.80 0.70 0.60 0.50 0.40 0.30 0.20 0.10 0.00 19- Nov-01 26- Nov-01 3- Dec-01 10- Dec-01 17- Dec-01 24- Dec-01 31- Dec-01 7-Jan-02 14-Jan-02 Date 33 ytilitaloV Nov 19 Volatility Path Simulated Average Volatility Figure 10 – Volatility Path for S&P 500 Option (19 November 2001 to maturity) Figure 10 depicts the volatility path over the life of an S&P 500 option from November 19 2001 maturing on January 15 2002. The volatility path can be seen to exhibit variance according to the variance rate chosen but the average value obtained for that particular simulation is relatively similar to the implied volatility used. In order to obtain a volatility process, such volatility paths over the life of various options have to be repeatedly modeled. Each process produces one average volatility value. The accuracy of the Hull-White model increases with the square root of the number of simulations produced. In this analysis, one hundred simulations were run per option type for each of the eleven days of data. The average volatility values obtained were then used for options across the range of strike prices. In order to increase the accuracy by a factor of ten, the number of simulations would have to be increased by one thousand. Figure 11 depicts the average volatility values obtained using the modeling process to simulate one hundred processes.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 43,
    "chunk_index": 54,
    "word_count": 276,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "then used for options across the range of strike prices. In order to increase the accuracy by a factor of ten, the number of simulations would have to be increased by one thousand. Figure 11 depicts the average volatility values obtained using the modeling process to simulate one hundred processes. 1 0.9 0.8 0.7 0.6 0.5 0.4 0.3 0.2 0.1 0 34 1 4 7 01 31 61 91 22 52 82 13 43 73 04 34 64 94 25 55 85 16 46 76 07 37 67 97 28 58 88 19 49 79 001 Simulation ytilitaloV Average Volatility Average of Volatility Process Figure 11 – Simulated Volatility Process for S&P 100 Option (19 November 2001) This graph indicates that there is substantial variation in the volatility process over one hundred simulations. In this way, this process enables valuation of options across all strike prices. The average value of volatility over all the simulations nonetheless, reverts to the implied volatility for an “at the money” option. 6.3.2 Empirical results for the Hull-White model In order to test the Hull-White model, the same data that was used for the Black- Scholes model was applied. In this analysis as before, an average of the pricing errors are reported for the eleven days of data per option, per strike price. Figure 12 displays the average absolute pricing error for call options on the S&P 500. Figure 13 displays the average absolute pricing error for call options on the S&P 100 Index.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 43,
    "chunk_index": 55,
    "word_count": 249,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "an average of the pricing errors are reported for the eleven days of data per option, per strike price. Figure 12 displays the average absolute pricing error for call options on the S&P 500. Figure 13 displays the average absolute pricing error for call options on the S&P 100 Index. 7.000 6.000 5.000 4.000 3.000 2.000 1.000 0.000 900 1050 1150 1250 1350 Strike Price 35 rorrE gnicirP egarevA Black-Scholes Hull-White Figure 12 – Average Absolute Pricing Error for S&P 500 Call Options From the empirical evidence in this analysis, it cannot be categorically stated that the Hull-White model is superior to the Black-Scholes. It is evident from the substantial pricing error that the Hull-White model does not provide a better pricing “fit” relative to either the Black-Scholes or Absolute Diffusion models. Despite accounting for stochastic volatility the Hull-White model, as specified and computed in this study, cannot improve the results provided by the less complex and easier to implement Black-Scholes formula.",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 36,
    "page_range": "p.36-37",
    "total_pages": 43,
    "chunk_index": 56,
    "word_count": 162,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.36-37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "that the Hull-White model does not provide a better pricing “fit” relative to either the Black-Scholes or Absolute Diffusion models. Despite accounting for stochastic volatility the Hull-White model, as specified and computed in this study, cannot improve the results provided by the less complex and easier to implement Black-Scholes formula. 3.000 2.500 2.000 1.500 1.000 0.500 0.000 460 540 580 620 700 Strike Price 36 rorrE gnicirP egarevA Black-Scholes Hull-White Figure 13 – Average Absolute Pricing Error for S&P 100 Call Options The “at the money” options for both the S&P 500 Index and the S&P 100 Index should theoretically be priced best among all strike prices. This hypothesis stems from the fact that the starting value for the volatility process is the implied volatility for an “at the money” option. Subsequently, the volatility process should revert to this value in the long run. This hypothesis is supported by the S&P 500 Index options but not the S&P 100 Index options. Furthermore, the pricing accuracy for “at the money” options is considerably worse than under the Black-Scholes model. There does not seem to be an overall pattern to the inaccuracy in pricing. Rather, the Hull-White model produces inaccurate pricing throughout the range of strike prices. The volatility in the Hull-White model is simulated as a random motion and thus only follows a continuous, sample path. This feature restricts the ability of the model to produce enough short-term kurtosis to effectively restrict proper pricing of short-term",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 37,
    "page_range": "p.37-38",
    "total_pages": 43,
    "chunk_index": 57,
    "word_count": 245,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.37-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "model produces inaccurate pricing throughout the range of strike prices. The volatility in the Hull-White model is simulated as a random motion and thus only follows a continuous, sample path. This feature restricts the ability of the model to produce enough short-term kurtosis to effectively restrict proper pricing of short-term options. From the empirical absolute pricing error results presented herein the conclusion to be drawn is that the Hull-White model does not provide greater accuracy in option pricing. Despite the plausibility of the Hull-White model in the realm of theory, the practical application is extremely complex, time-consuming and prone to inaccuracy as is evident from this analysis. A far greater number of simulations is required if better accuracy is desired as highlighted in Section 6.4.1. Realistically speaking, to conduct ten thousand simulations to achieve a ten-fold increase in accuracy would merit an analysis of the costs accruing from the benefit of any improvement in accuracy. Nonetheless, one hundred simulations of the volatility process may be considered too few. Furthermore, the lack of a technical estimation procedure for the parameter values weakens the theoretical accuracy of the model. As described in Section 6.3, regressions would be required to obtain precise values for the parameters of the formula. In the end, human error is present in most empirical testing. It is very possible that the specification of the Hull-White model in Microsoft Excel in this analysis could be overly simplified or even incorrect. 7. Sources of Error There are several sources of error inherent in the data collected for this study. These may result in less than optimal or even misleading results. Since the quotes on historical options prices were closing prices obtained from Bloomberg the possibility of “artificial” prices exists. “Artificial” prices refer to market makers entering option prices at the end of a particular trading day to influence their margin requirements. The results in this paper therefore, are based on the general assumption that the options prices used are reliable and accurate. Furthermore, the study required options on a broad range of strike prices. Some options are not traded in depth and thus, the range of strike prices available was fairly restricted. Additionally, due to lack of trading volume for certain strike prices and options the prices may not reflect the true market measure of the option value. Furthermore, throughout the analysis markets have been assumed to be perfect with costless and limitless trading, at stated prices. 37",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 43,
    "chunk_index": 58,
    "word_count": 408,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "available was fairly restricted. Additionally, due to lack of trading volume for certain strike prices and options the prices may not reflect the true market measure of the option value. Furthermore, throughout the analysis markets have been assumed to be perfect with costless and limitless trading, at stated prices. 37",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 43,
    "chunk_index": 59,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Furthermore, the data for option prices was not obtained on a daily basis but instead historical closing prices were used. Similarly, the historical values of the stock index are closing values. Ideally, the two types of data should be from similar time periods. This would ensure no error in the form of non-synchronous index and options data. There is however, no guarantee that the closing times are similar for the two types of data. It would have been optimal to hand-collect the data daily and at a particular point in the trading day rather than at the close. This would ensure no “artificial” price entry by traders or market makers. Index options also present a unique situation through the problematic nature of the asset underlying the options. The underlying stock indices are portfolios of stocks and these indices are subject to alteration and revision. This re-constructive possibility for an index can translate into uncertain option prices or volatilities in the market itself. As a source of error inherent in the study, it was not possible to consider more options data and options of differing maturities. By using longer-term maturity options it may have been possible to perhaps better analyze the effects of pricing bias by the Black- Scholes model and the Absolute Diffusion model. Additionally, greater volume of data in terms of more trading days would have increased the accuracy of the results. Inferences drawn from this analysis must therefore be tentative considering the sources of error outlined. Further research with transactions data on options prices and asset prices for a larger sample is required. Only then can the performance of various option valuation models be conclusively assessed. 7.1 Conclusion The Black-Scholes model was tested to exhibit pricing bias attributable to its assumptions of constant volatility and Brownian motion for stock index values. The “volatility smirks” formed the basis of the analysis of the bias in pricing. The Absolute Diffusion model and the Hull-White stochastic volatility model were not found to provide a better “fit” to market prices. The increasing complexity and decreasing accuracy of complex models in this study does not support the claim that a model relaxing the assumptions concerning the volatility process is a better alternative to the Black-Scholes model. 38",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 43,
    "chunk_index": 60,
    "word_count": 374,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "stochastic volatility model were not found to provide a better “fit” to market prices. The increasing complexity and decreasing accuracy of complex models in this study does not support the claim that a model relaxing the assumptions concerning the volatility process is a better alternative to the Black-Scholes model. 38",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 43,
    "chunk_index": 61,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "It is not sufficient to simply assume non-constant volatility. The Absolute Diffusion model does this but it does not eliminate pricing error. On the other hand, the Absolute Diffusion model was shown not to improve the pricing “fit” relative to Black- Scholes. Essentially, a more comprehensive stochastic volatility model would be considered a necessary model to describe the random nature of asset volatilities. The Hull-White stochastic volatility model was tested to yield less than encouraging results. Even in the presence of stochastic, unpredictable volatility there is no increase in pricing accuracy for the option contracts used in this study. Nonetheless, further extensive study is required to conclusively establish the superiority of any of the models described in terms of pricing accuracy. The Black-Scholes option valuation formula provides a simplified approach to the pricing of options. It has to be borne in mind that the Black-Scholes model is an option valuation model not a theorem. There are always limitations with any such model when applied outside of a theoretical framework with specific assumptions. When the assumptions of the model are relaxed, it may be possible to discern exactly how much discrepancy the model introduces relative to real-life prices and values. According to John C. Hull: “An option pricing model is no more than a tool used by traders for understanding the volatility environment and for pricing illiquid securities consistently with the market prices of actively traded securities. If traders stopped using Black-Scholes and switched to another plausible model…the prices quoted in the market would not change appreciably”23 In the presence of the Black-Scholes pricing biases, practitioners have adopted methods to “live with the smirk”. A volatility matrix is one primary method. Volatility matrices combine volatility smiles with the volatility term structure to tabulate the volatilities appropriate for pricing an option with any strike price and any maturity. Options of a particular “moneyness” and life can be valued by imputing implied volatility values of other options with similar maturity and “moneyness” characteristics.24 23 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 442. 24 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 441. 39",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 43,
    "chunk_index": 62,
    "word_count": 361,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "and life can be valued by imputing implied volatility values of other options with similar maturity and “moneyness” characteristics.24 23 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 442. 24 Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000: 441. 39 The search for a perfect pricing model seems endless but ultimately, researchers have to question the associated costs. These costs can take the form of complexity, time, computational resources or implementation. Only if the benefits from further generalization of simplified models outweigh the relevant costs, should alternative models be implemented and used. Until then, the Black-Scholes model remains very practical and performs rather accurately considering the relative ease of implementation. 40",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "S&P 500 S&P 100",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 43,
    "chunk_index": 63,
    "word_count": 121,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "S&P 500 S&P 100 (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "take the form of complexity, time, computational resources or implementation. Only if the benefits from further generalization of simplified models outweigh the relevant costs, should alternative models be implemented and used. Until then, the Black-Scholes model remains very practical and performs rather accurately considering the relative ease of implementation. 40",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 43,
    "chunk_index": 64,
    "word_count": 50,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "• Hull, John C. Options, Futures, & Other Derivatives. New Jersey: Prentice Hall, 2000. • Stoll, Hans R. & Whaley, Robert E. Futures and Options. Cincinnati: South- Western Publishing Co, 1993. • Gruber, Martin J & Elton, Edwin J. Modern Portfolio Theory and Investment Analysis. New York: John Wiley & Sons, 1995. • Cox, John C. & Ross, Stephen A. “A Survey of Some New Results in Financial Option Pricing Theory”. Journal of Finance. 31(2), 1976: 383-402. • Beckers, Stan. “The Constant Elasticity of Variance Model and Its Implications For Option Pricing”. Journal of Finance. 35 (3), 1980: 661-673. • Hull, John C. & White, Alan. “The Pricing of Options on Assets with Stochastic Volatilities”. The Journal of Finance. 42(2), 1987: 281-300. • Sheikh, Aamir M. “Transaction Data Tests of S&P 100 Call Option Pricing”. Journal of Financial and Quantitative Analysis. 26(4), 1991: 459-475. • Macbeth, James D. & Merville, Larry J. “An Empirical Examination of the Black- Scholes Call Option Pricing Model”. Journal of Finance. 34(5), 1979: 1173- 1186. • Scott, Louis O. “Option Pricing when the Variance Changes Randomly: Theory, Estimation, and an Application”. Journal of Financial and Quantitative Analysis. 22(4), 1987: 419-438. • Bakshi, Gurdip & Cao, Charles & Chen, Zhiwu. “Empirical Performance of Alternative Option Pricing Models”. Journal of Finance. 52(5), 1997: 2003- 2049. • Bates, David S. “Jumps and Stochastic Volatility: Exchange Rate Processes Implicit in Deutsche Mark Options”. The Review of Financial Studies. Vol. 9, 1 (1996) : 69-107. • “Standard & Poor’s”. S&P Index Services. November 30, 2001. <http://www.spglobal.com/indexmain500_data.html> • Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 41",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 43,
    "chunk_index": 65,
    "word_count": 263,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  },
  {
    "text": "Finance. 52(5), 1997: 2003- 2049. • Bates, David S. “Jumps and Stochastic Volatility: Exchange Rate Processes Implicit in Deutsche Mark Options”. The Review of Financial Studies. Vol. 9, 1 (1996) : 69-107. • “Standard & Poor’s”. S&P Index Services. November 30, 2001. <http://www.spglobal.com/indexmain500_data.html> • Yahoo! Finance. “Historical Quotes.” <http://yahoo.finance.com> 41 • Rubinstein, Mark. “Implied Volatility”. In-The-Money. November 20, 2001.<http://www.in-the-money.com/presentation/sld102.htm> • Falkenstein, Eric. “Model Selection and Hedge Ratios”. Financial Engineering News. 1 (2). <http://fenews.com/1997/v1n2/modelselection.htm> • “Black & Scholes Option Pricing Model”. November 20, 2001. <http://www.geocities.com/WallStreet/2529/bsopm.htm> • Federal Reserve. “Selected Interest Rates”. G.13 (415). <http://www.federalreserve.gov/releases/G13/current/g13.pdf> • Chicago Board of Exchange .“Delayed Market Quotes”. <http://quote.cboe.com/QuoteTable.asp> 42",
    "title": "yakoob",
    "source_type": "pdf",
    "document_id": "bc63443e7378",
    "source_file": "An Empirical Analysis of Option Valuation Techniques.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 43,
    "chunk_index": 66,
    "word_count": 103,
    "author": "plane",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20020627101610",
    "duration": null
  }
]