[
  {
    "text": "d Title: ASYMMETRIC UNCERTAINTY AROUND EARNINGS ANNOUNCEMENTS: EVIDENCE FROM OPTIONS MARKETS e Authors: w 1. Sobhesh Kumar Agarwalla (Corresponding Author) Professor, Finance and Accounting Area e Email: sobhesh@iima.ac.in; Phone No. +91.79.71524865 Address: KLMDC Room No. 42, Indian Institute of Management Ahmedabad, Vastrapur, i Ahmedabad, Gujarat, India - 380015 v ORCID ID: 0000-0001-8693-2842 2. Sumit Saurav e Doctoral Candidate, Finance and Accounting Area Email: phd19sumits@iima.ac.in; Phone No. +91.8809388919 r Address: MSH-1402, Indian Institute of Management Ahmedabad, Vastrapur, Ahmedabad, Gujarat, India - 380015 ORCID ID: 0000-0003-4538-0601 r e 3. Jayanth R. Varma Professor, Finance and Accounting Area Email: jrvarma@iima.ac.in; Phone Noe. +91.79.71524867 Address: KLMDC Room No. 1, Indian Institute of Management Ahmedabad, Vastrapur, Ahmedabad, Gujarat, India - 380015 p ORCID ID: 0000-0002-7296-8956 Abstract: t We use the Indian stock options market to study the evolution of uncertainty and asymmetric o uncertainty around earnings announcements (EAs). We find that uncertainty (implied volatility) and asymmetric uncertainty (options skew) increase monotonically before the EA day and decrease after EA. Options volume (relantive to spot and to futures) also exhibits similar behavior, suggesting that informed investors prefer options markets to spot and futures markets. Both options skew and put-to- call volume ratio can p redict the sign of the EA surprise one day before EA, indicating that price discovery and information assimilation happen in the options market. t n Keywords: Earnings Announcements, Volatility Smile, Earnings Surprise, Options Volume, Emerging Markets i r JEL: G13, G14 p Data Availability Statement e Data sharing is not applicable to this article as no new data were created or analyzed in this study. The data that support the findings of this study are available from the National Stock Exchange of India. rRestrictions apply to the availability of these data, which were used under license for this study. P This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 41,
    "chunk_index": 0,
    "word_count": 312,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "study. The data that support the findings of this study are available from the National Stock Exchange of India. rRestrictions apply to the availability of these data, which were used under license for this study. P This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Asymmetric uncertainty around earnings announcements: Evidence from options markets e w Abstract e We use the Indian stock options market to study the evolution oif uncertainty and asym- v metric uncertainty around earnings announcements (EAs). We find that uncertainty e (implied volatility) and asymmetric uncertainty (options skew) increase monotonically before the EA day and decrease after EA. Options vrolume (relative to spot and to fu- tures) also exhibits similar behavior, suggesting th at informed investors prefer options r markets to spot and futures markets. Both options skew and put-to-call volume ratio e can predict the sign of the EA surprise one day before EA, indicating that price discovery e and information assimilation happen in the options market. p Keywords: Earnings Announcements, Volatility Smile, Earnings Surprise, Options Volume, Emerging Markets t JEL: G13, G14 o Declarations of interest: None n t n i r p e r P 1 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 41,
    "chunk_index": 1,
    "word_count": 213,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "happen in the options market. p Keywords: Earnings Announcements, Volatility Smile, Earnings Surprise, Options Volume, Emerging Markets t JEL: G13, G14 o Declarations of interest: None n t n i r p e r P 1 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 41,
    "chunk_index": 2,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "e Beginning with Ball and Brown (1968) and Beaver (1968), an extensive literature doc- w uments that earnings announcements (EAs) have significant information content for in- vestors. In addition, recent studies such as Beaver et al. (2018, 2020) have demonstrated e significant increase in the information content of EA in the 21st century. It is found that i uncertainty builds up ahead of the scheduled EA and is resolved by the announcement. v Accordingly, the implied volatility (IV) of stock options increases before EA, peaks on the e eve of the announcement, and decreases afterward (Donders and Vorst, 1996; Patell and r Wolfson, 1979, 1981). However, the literature is relatively sparse regarding the use of the full richness of information about asymmetric risks in the options market. Investors can r make asymmetric bets using put and call opteions with strikes substantially away from the current market price. These informed asymmetric bets are reflected in the options smirk e – higher volatility for out-of-the-money (OTM) puts than for OTM calls. Asymmetric p risks are essential for EA because it is well established in the literature that compared to positive surprises, negative ea rnings surprises are more credible and have a greater t impact on stock prices (Lu and Ray, 2016). o Most of the literature on options markets and EAs is focused on the US market, n and there is very little work on emerging markets. India is one of the world’s largest single stock options (SSO) markets (FIA, 2020). It is unique in also having a liquid t single stock fnutures (SSF) market, an attractive venue for informed traders with strong directional views. While both SSF as well as SSO market provides leverage benefits, i the SSOrmarkets provides additional benefit of asymmetric payoff. India is, therefore, an p idealcontexttostudytheevolutionofasymmetricuncertaintyaroundEAs. Westudythe edynamics of the IV smile and volume around all the EAs made during the 2015 to 2019 period by firms with derivatives contracts written on them. For estimating the options r smile parameters, we use a rigorous methodology that avoids calculating the dividend P yield and cost of carry and uses high-frequency trade dataset to alleviate the concern of asynchronous trading. We also analyze relative volume changes in the SSO market with 2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 41,
    "chunk_index": 3,
    "word_count": 387,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "methodology that avoids calculating the dividend P yield and cost of carry and uses high-frequency trade dataset to alleviate the concern of asynchronous trading. We also analyze relative volume changes in the SSO market with 2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 41,
    "chunk_index": 4,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d spot and futures markets to assess the change in the investors’ preference over the last five years, when the Indian market noticed a significant increase in the opteions volume relative to the futures volume. w Our key results are as follows. First, we notice a significant increase in the volatility e levels during the EA month. Second, there is a gradual increase in the volatility across different strikes, causing an upward shift of the volatility smilie before EA. The smile v comes down after EA. Third, we notice an increase in the options volume relative to the e futures volume (O/F ratio) and to the spot volume (O/S ratio) leading to EA and a subsequent fall in both the measures after EA. Fourtrh, while the IV at the center of the smile (ATM-IV) does not predict the earnings surprises, the skew of the options smile r (RR-IV) and the volume of the put options relative to the volume of the call options e (P/C ratio) predict the directions of the impending earnings surprises. We find that the e predictive power increases as we move closer to the EA day. Overall, our results confirm the forward-looking nature of the opptions market. Our results may also be construed as options markets being used by informed traders to benefit from the private information.1 t To the best of our knowledge, this is the first study that investigates the options o pricing and volume dynamics around EA in the Indian market, which has noticed a n significant increase in the SSO volume during the last decade. The only study using Indian data that is remotely related to this paper is Jain et al. (2019a). However, our t paper differs from Jain et al. (2019a) on various counts. First, while Jain et al. (2019a) n uses derivatives volume (O/S and F/S ratios) to identify informed traders’ preferred i market (spot, options, or futures) for trading around EA, we examine the dynamics of r IV spmile along with the P/C ratio to understand the behavior of asymmetric bets in the options market around EA, and whether they can be used to predict EA surprise.2 e 1For example, a recent SEBI (Indian capital market regulator) order in the matter of insider trading rhas the following notes, ‘...over the years, the derivatives segment of the market has become multiple timesthesizeofthecashsegmentandFuturesandOptions(FO)havebecomeanevenbiggeropportunity P for an insider to make profit using UPSI. In fact, the FO segment gives the insider a very “efficient” route to making unlawful gains ...’ SEBI Order No WTM/MB/ISD/13519/2021-22). Retrieved from https://www.sebi.gov.in/enforcement/orders/sep-2021/interim-order-in-the-matter-of-i nsider-trading-by-employees-of-infosys-limited-and-wipro-limited-in-the-shares-of-in fosys-limited 52968.html 2Asymmetric bets would reflect in the skewness of the IV curve and put-to-call ratio but not in the 3 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 41,
    "chunk_index": 5,
    "word_count": 462,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "“efficient” route to making unlawful gains ...’ SEBI Order No WTM/MB/ISD/13519/2021-22). Retrieved from https://www.sebi.gov.in/enforcement/orders/sep-2021/interim-order-in-the-matter-of-i nsider-trading-by-employees-of-infosys-limited-and-wipro-limited-in-the-shares-of-in fosys-limited 52968.html 2Asymmetric bets would reflect in the skewness of the IV curve and put-to-call ratio but not in the 3 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 41,
    "chunk_index": 6,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Second, we believe that the question of informed traders’ preferred market that was earlier examined by Jain et al. (2019a), requires a revisit. While the Jain eet al. (2019a) study uses data till 2015, the Indian SSO market has noticed a significant rise in volume w post 2015 both in absolute terms as well as relative to the other (SSF and Spot) markets (see Figure A1), thereby making it attractive for informed tradere(Easley et al., 1998). The increased liquidity of the SSO market post-2015 has led us to conjecture that the i v findings of the Jain et al. (2019a) study may not hold in our sample period (2015 to 2019). Our study also provides evidence of derivatives terading being motivated by views about future price movements, thereby providing support to the growing literature that r derivatives markets don’t just act as hedging tool but also help in the price discovery r process. Our findings are useful for regulators and the surveillance arm of exchanges to e identify instances of trading on the basis of unpublished price-sensitive information so that they can be taken up for detailed ienvestigation. The remaining part of our ppaper is structured as follows. Section 2 provides a brief review of the relevant literature along with the research questions. In Section 3, we present our research methotdology along with the details of the variables used in the o study. Section 4 provides the data sources and the descriptive statistics of the sample. Sections 5 and 6 shownour main results and those from the battery of robustness tests, respectively. Section 7 concludes. t n 2. Literature review and research questions i r Recent literature has documented an increase in the information content of EA (Beaver p et al., 2018, 2020). Past studies have found that the investors’ ex-ante belief of stock price e volatility, as implied by the options prices, increases before EA and decreases after the EA (Donders and Vorst, 1996; Patell and Wolfson, 1979, 1981). The Options IV increases r Psignificantly during the pre-event period and reaches a maximum on the eve of EA. It then (post the EA) drops sharply and gradually moves back to its long-run level (Donders relative derivatives to spot volume. 4 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 41,
    "chunk_index": 7,
    "word_count": 386,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "Psignificantly during the pre-event period and reaches a maximum on the eve of EA. It then (post the EA) drops sharply and gradually moves back to its long-run level (Donders relative derivatives to spot volume. 4 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 41,
    "chunk_index": 8,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d and Vorst, 1996). Recent papers (Rogers et al., 2009; Truong et al., 2012) have examined the differential impact of good and bad news released during EA and its effeect on the IV buildup and change during EA. Lu and Ray (2016) study the residual uncertainty in the w system after EA using risk-neutral density (RND) derived from options contracts and find that very good news does not reduce uncertainty. However,emost of the papers in this domain have used the IV of at-the-money (ATM) options, thus missing out on the i v full richness of information (such as asymmetric risks) that the IV smile provides. For example, the skewness of the IV smile (RR-IV) capturees the extent of asymmetric bets by investors in the options market. r Several studies focus on options volume around EA. Past studies have compared r the stock market reaction to EA for stocks acting as underlying for derivatives contracts e and other stocks. However, there is mixed evidence about the impact of the availability e of options contracts on the market reaction to EA. While studies by Skinner (1990) and Ho (1993) demonstrate that the stopck market reaction to EA is smaller for firms having listed options, Truong et al. (2012), using a different subsample, find no difference in the immediate price response fromtthe two groups of stocks. o Recent papers have used variations in the options volume (Truong, 2012) and the n options-to-stock volume (O/S) ratio (Rai and Tartaroglu, 2015) to explain the cross- sectional variation i n the market reaction to EA. However, there is limited usage of the t relative volume of put and call options (P/C ratio) in predicting earnings surprises. n Additionally, because of the absence of a liquid SSF market, one relatively unexplored i area is the behavior of the SSO-to-SSF volume (O/F ratio) around EA.3 In our first r reseaprch question, we attempt to fill this gap in the literature. Specifically, we analyze the volatility and volume of options around EA in the Indian financial market. While e doing so, we make two important departures from the literature. First, while examining r volatility, we consider the entire IV smile drawn using the IV of options across the full P range of strikes and examine how an EA surprise differentially influences the IV smile. 3Also, the literature on options markets dynamics around EA is mainly focused on the US and other developed markets, and there is very little work on the emerging economies. 5 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 41,
    "chunk_index": 9,
    "word_count": 429,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "surprise differentially influences the IV smile. 3Also, the literature on options markets dynamics around EA is mainly focused on the US and other developed markets, and there is very little work on the emerging economies. 5 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 41,
    "chunk_index": 10,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Second, we supplement our options volume analysis with O/S, O/F, and P/C ratios around EA. We also examine the differential impact of the EA surprise on Pe/C. Options markets are known to be a preferred venue for informatwion-based trading (Easley et al., 1998) for various reasons such as short-sale constraints (Johnson and So, e 2012), leverage effect (Ge et al., 2016), information asymmetry, and difference in opinions (Cao and Ou-Yang, 2008). Past studies have examined the abiliity of the options market v (using both IV and volume) to explain future stock returns and provided evidence in its e favor. The options prices, denominated by IV spread (Cremers and Weinbaum, 2010), options skew (Xing et al., 2010), O/S ratio (Johnsorn and So, 2012; Roll et al., 2010), and P/C ratio (Pan and Poteshman, 2006) are known to predict stock returns in general. r Studies have also found a higher predictive power of the options market (volume and IV) e before information events such as EA (Jin et al., 2012) and M&A (Cao and Ou-Yang, e 2008; Chan et al., 2015). Motivated by this line of literature, in our second research question, we analyze whether thepvariations in the ATM-IV, RR-IV, and P/C ratio leading to the EA day predict the EA surprise. Our investigation would inform us about the extent of informed tradingtin the Indian SSO market. o Like that of most emerging market peers, the literature on options market behavior n around EA pertaining to the Indian market is very scant. Past studies have focused on establishing the existence of post-earnings-announcement drift (PEAD) in the Indian t market and examining market efficiency around EA (Sen, 2009; Singh et al., 2018). Jain n et al. (2019a) examine the pattern of the option-to-spot volume (O/S) and the future-to- i spot volume (F/S) around EA using a sample spanning 2008 to 2015 and find that SSF is r prefeprred to SSO by informed traders before EA. However, the study did not examine the IV and P/C dynamics around EA. Our study aims to fill this gap in the literature using e a more recent dataset that includes the period when the Indian market has experienced r a marked increase in the options volume (Figure A1). P 6 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 41,
    "chunk_index": 11,
    "word_count": 388,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "aims to fill this gap in the literature using e a more recent dataset that includes the period when the Indian market has experienced r a marked increase in the options volume (Figure A1). P 6 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "1. Introduction d",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 41,
    "chunk_index": 12,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction d (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "e 3.1. Estimating volatility smile w We use time-matched high-frequency data of SSO and SSF markets to estimate the volatility smile. The presence of a liquid SSF market along witheSSO allows us to use the Black (1976) model for IV estimation. The use of time-matched high-frequency data i v and the Black (1976) model addresses the problems induced by asynchronous trading, stale prices, estimation of dividend yield, and the cost oef carry (Black and Scholes, 1973; Jain et al., 2019b). Our IV smile estimation method is broadly similar to that used by r Jain et al. (2019b). We apply various liquidity filte rs because some of the SSO contracts r traded in the Indian market are illiquid and there is evidence of manipulations in such e contracts (Jain et al., 2019b). We exclude all SSO contracts traded for less than five e minutes in a day and remove all options contracts whose market prices lay outside the Black’s model arbitrage bound. Following Jain et al. (2019b), we fit quadratic volatility p smiles for all SSO-day pairs using contracts that satisfy our filter conditions. We use the 91-day T-Bill rate, obtained from the Reserve Bank of India’s (RBI) website, as the t o risk-free rate for estimating the IV. n To ensure that sufficient data points are available for fitting the IV curve, we exclude SSO-day pairs having less than seven different SSO contracts trading on the day and not t having at least one call and one put SSO contract. A quadratic function is fitted for every n SSO-day pair to estimate the IV curve. Specifically, we use IV = a∆2 + b∆ + c, where i ∆ is the call delta of the options contract, to estimate the IV curve of each SSO-day pair. r Many previous studies have used a similar functional form to estimate the IV curve in the p Indian context (Agarwalla et al., 2021a,c; Jain et al., 2019b). For fitting the smile, the ∆ e of put options is converted into the ∆ of call options so that the ∆ ranges between [0,1]. r To ensure that IV always lies above the X-axis between [0,1], we estimate the a, b, and P c parameters with the restriction that a and c are non-negative. For this, c is shifted by b2/4a when −b/2a ∈ [0,1]; else, c is shifted by min(0,a+b). Deviating from Jain et al. (2019b), we aim to minimize the weighted mean-squared errors (WMSEs), using the log 7 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 41,
    "chunk_index": 13,
    "word_count": 428,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "For this, c is shifted by b2/4a when −b/2a ∈ [0,1]; else, c is shifted by min(0,a+b). Deviating from Jain et al. (2019b), we aim to minimize the weighted mean-squared errors (WMSEs), using the log 7 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 41,
    "chunk_index": 14,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d of the traded value as weights between the options market price and the estimated prices recursively. Also, the optimization is done by the Nelder–Mead (Nelder andeMead, 1965) simplex optimization function. w The above exercise gives us the values of a, b, and c for every SSO-day pair. The e values are then used to estimate four parameters that characterize the options smile, hereafter referred to as ‘smile parameters.’ The four parameteris are defined as follows. v (a) ATM-IV: the IV of options having delta equal to 0.5 (IV ). (b) IV : the ∆=0.5 ∆=0.75 e IV of options having delta equal to 0.75. (c) IV : the IV of options having delta ∆=0.25 equal to 0.25. (d) Risk-Reversal (RR-IV): the diffrerence of the IV of options having delta equal to 0.25 and 0.75 (IV −IV ). RR-IV becomes positive (negative) ∆=0.25 ∆=0.75 r when OTM calls are more (less) expensive than OTM puts. The parameter has been e used extensively in the literature as a measure of skewness of the IV curve. e 3.2. Estimating earnings psurprises We use two measures of earning s surprise in the study. The first measure is the earn- t ings surprise reported in the summary files of the IBES database, which we refer to as o IBES Surprise. The IBES database uses the following formula to estimate this surprise: n X −F i,q i,q IBES Surprise = (1) t F i,q n where X is the reported earnings per share (EPS) by firm i in quarter q and F is the i,q i,q i mean value of the latest analysts’ earnings estimates for firm i in quarter q. Our second r meapsure of the EA surprise is the widely used standardized unexpected earnings (SUE), estimated using the following equation: e r X −E(X ) i,q i,q P SUE = (2) i,q σ i,q where X is the actual EPS before extraordinary item, E(X ) is the expected EPS, and i,q i,q σ is the standard deviation of earnings surprises during the previous eight quarters. We i,q 8 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 41,
    "chunk_index": 15,
    "word_count": 359,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "σ i,q where X is the actual EPS before extraordinary item, E(X ) is the expected EPS, and i,q i,q σ is the standard deviation of earnings surprises during the previous eight quarters. We i,q 8 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 41,
    "chunk_index": 16,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d useaseasonalrandomwalkwithadriftmodeltoestimateexpectedearnings. Specifically, we use the following equation to estimate E(X ): e i,q w E(X ) = X +µ (3) i,q i,q−4 i,q e (cid:80)8 (X −X ) µ = n=1 i,q−n i,q−n−4 (4) i,q 8 i v 3.3. Smile parameters dynamics around EA e We first examine the behavior of options smile parameters in months having EA and r months not having EA. We compare the mean valu e of the smile parameters (ATM-IV, r IV , and IV ) for the EA month with the values for other months using the ∆=0.75 ∆=0.25 e difference-in-mean (t-test) test to verify the statistical significance of the variation in the e mean values of smile parameters. Second, to examine the behavpior of the options smile around EA, we plot the daily mean value of the smile parameters for the period starting from 10 days before (t= −10) t to10daysafter(t=+10)EA.Wehavenormalizedthesmileparametersusingtheaverage o of the daily values during the previous trading month. n Next, we analyze the behavior of the smile parameters around EA after categorizing the EA into three g roups on the basis of the magnitude and sign of the surprise. The t EAs are split into three quantiles on the basis of the EA surprise and are categorized as n large negative, small positive/negative, and large positive (quantiles 1 to 3, respectively). i We thenrplot the mean value of ATM-IV and RR-IV for ±10 days period around EA pseparately for the three categories of surprise. Our choice of the two parameters is influenced by past studies (Diavatopoulos et al., 2012; Truong et al., 2012) that have e documented differential increases in these two parameters before EA, depending on the r magnitude and sign of earnings surprises. P 9 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 41,
    "chunk_index": 17,
    "word_count": 302,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "influenced by past studies (Diavatopoulos et al., 2012; Truong et al., 2012) that have e documented differential increases in these two parameters before EA, depending on the r magnitude and sign of earnings surprises. P 9 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 41,
    "chunk_index": 18,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d 3.4. Volume dynamics around EA e To identify the investors’ preferences across the three markets, we analyze the change in the trading volume around EA in all the three markets —spot, optwions, and futures. We calculate the O/S and O/F ratios for each firm at a daily frequency. The trend of e O/S and O/F ratios around EA will give us an idea about the volume pickup in the options market relative to the spot and futures markets. If thie options market is the v investors’ preferred market, we will notice an increase in the O/S and O/F ratios in the e days leading to EA and a fall afterward. r We supplement our volume analysis by examining the trend of the P/C ratio. Past studieshavesuggestedthattheP/C ratioimpoundsinformationaboutfuturestockprices r (Pan and Poteshman, 2006). If this is true,ewe can expect the P/C ratio around EA to be sensitive to the EA surprise. To check this, we plot the mean value of P/C separately e for the three categories of earnings surprises (large negative, small positive/negative, and p large positive). t 3.5. Regression models o To examine the extent of informed trading in the options market before EA, we an- n alyze the predictive power of IV curve parameters (ATM-IV and RR-IV) and P/C. Specifically, we use pre-EA RR-IV, ATM-IV, and P/C to predict the surprise of the t impending EnA. Following the literature, we control for analysts’ coverage, analysts’ dis- persion, stock beta, the proportion of institutional shareholding in the firm, momentum, i r size, and pre-EA buy-and-hold return (BHAR). Our main regression model is given p below: e r PSurprise = β RR-IV +β P/C +β ATM-IV +λX +δ +γ +(cid:15) i,q 1 t−n,i,q 2 t−n,i,q 3 t−n,i,q i,q i q i,q (5) where Surprise is the earnings surprise of firm i’s EA for quarter q estimated using i,q 10 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 41,
    "chunk_index": 19,
    "word_count": 324,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "P/C +β ATM-IV +λX +δ +γ +(cid:15) i,q 1 t−n,i,q 2 t−n,i,q 3 t−n,i,q i,q i q i,q (5) where Surprise is the earnings surprise of firm i’s EA for quarter q estimated using i,q 10 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 41,
    "chunk_index": 20,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d two separate measures —IBES surprise and SUE. RR-IV is the value of firm i’s t−n,i,q RR-IV n number of days before the EA of quarter q. ATM-IV is theevalue of ith t−n,i,q firm ATM-IV n number of days before quarter q’s EA. X is a vector of control, and λ iq w is the vector of coefficients. We include the following controls. Analyst Coverage is i,q measuredaslog(1+p), wherepisthenumberofanalystsfollowingefirmiduringquarterq. Analyst Dispersion is firm i’s ratio of the standard deviation of the analysts’ forecast i,q i v and mean of analysts’ consensus during the quarter. Beta is the beta of firm m−1,i,q i’s stock lagged by one month (m is the result monthe). Institutional pct is the i,q−1 percentage of institutional holding in firm i lagged by a quarter. Momentum is the r i,q return of the last 11 months leading to the quarterly EA of stock i. Size is the m−1,i,q r average market capitalization of stock i lagged by a month. P/C is firm i’s ratio of t−n,i,q e put options volume to call options volume n number of days before a particular quarter EA.BHAR isfirmi’sbuy-ande-holdreturnfortheperiodt = −10daytot = −2. t−10,t−2,i,q δ and γ are firm-level and year-quarter fixed effects, respectively. i q p While estimating the above regression to predict earnings surprises, we use three different values of n = 1, 2, tand 3. This use of the lag values of the options smile o parameters helps us test the extent of informed trading in the options market during each of the three daysnbefore EA. 4. Data antd descriptive analysis n 4.1. Indiian derivatives market r ThepIndian capital market is well regulated and liquid, with multiple well-functioning exchanges. The National Stock Exchange (NSE) is the main exchange and accounts for e 99.9% of the derivatives contracts in India by volume. It ranks among the largest options r markets in the world (FIA, 2020). The Indian financial market is unique in many ways. P First, unlike in the US, where spot and derivatives contracts trade at different exchanges, in India, the underlying stocks and all their derivatives products (Index options, Index futures, SSO, and SSF) trade at the same exchange. Second, the existence of a liquid SSF 11 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 41,
    "chunk_index": 21,
    "word_count": 383,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "derivatives contracts trade at different exchanges, in India, the underlying stocks and all their derivatives products (Index options, Index futures, SSO, and SSF) trade at the same exchange. Second, the existence of a liquid SSF 11 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 41,
    "chunk_index": 22,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d market along with a liquid SSO market improves the efficiency of the Indian derivatives market (Jain et al., 2019b). Third, the Indian regulator allows the derivativees trading of large and liquid stocks that many analysts also follow. Though Jain et al. (2019b) find w that the Indian SSO market is microefficient with a low pricing error, many past studies have found huge expiry-day effects (Agarwalla and Pandey, 2013e; Vipul, 2005) and the use of illiquid SSO/SSF products for market manipulation (Jain et al., 2019b). i v 4.2. Data e WeconsiderallEAsmadefromJanuary2015toDecemrber2019byfirmswhosestocksact as underlying for derivatives contracts. Our sample selection period is motivated by the r fact that the options volume in India increased significantly from 2015 (see Figure A1). e We deliberately end our sample in the last quarter of 2019 to avoid the confounding effect e of the COVID-19 crisis, which has been found to have a significant effect on the Indian stock market (Agarwalla et al., 202p1b,c). The data used in the study is taken from various sources. The exact broadcast time t ofthequarterlyEAistakenfromtherespectivefirm’scorporateannouncementwebpages o on the NSE website. The EA dates are also cross-matched with the EA dates provided n by the IBES database. The exact time of EA helps us categorize EAs into during-the- market-hours (DMH ) and after-the-market-hours (AMH) announcements. We adjust the t event date of AMH-EA to the next trading date, as suggested by Berkman and Truong n (2009). Thus, for AMH-EA, the next trading date is considered as day zero. i TherSSO and SSF data (both price and volume) used in the study are taken from p the trading books and bhav copy of the NSE. As the near-month contracts are the most eliquid, we consider only the near-month options series that expires after the EA date. As the Indian options market is known to exhibit huge expiry-day effects (Vipul, 2005; r AgarwallaandPandey,2013), weremoveEAsmadelessthanthreedaysbeforetheexpiry P dayofthenear-monthoptionsseries. Theinformationrelatingtothespotmarket(returns and volume) and institutional shareholding in a firm is obtained from the CMIE Prowess 12 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 41,
    "chunk_index": 23,
    "word_count": 344,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "date. As the Indian options market is known to exhibit huge expiry-day effects (Vipul, 2005; r AgarwallaandPandey,2013), weremoveEAsmadelessthanthreedaysbeforetheexpiry P dayofthenear-monthoptionsseries. Theinformationrelatingtothespotmarket(returns and volume) and institutional shareholding in a firm is obtained from the CMIE Prowess 12 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 41,
    "chunk_index": 24,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d database. Analysts’ related information, such as coverage, mean, and standard deviation oftheestimates, isobtainedfromtheIBESdatabase. SeeTable1forindividuealvariables’ sources. Our final dataset consists of 2,081 firm-quarter observations of 191 unique firms. w As information relating to various dependent and independent variables is sourced from different datasets, the number of observations varies from analysiseto analysis, depending on data availability. All the variables used in the study are winsorized at the 5 and 95 i v percentiles. e Insert Table 1 herer r e 4.3. Descriptive statistics e Table 2 provides the summary statistics. Table 3 provides the correlation coefficients of p surprisemeasuresandourvariablesofinterest. RR-IV ,RR-IV ,andRR-IV t−1,i,q t−2,i,q t−3,i,q are, on average, negative (−0.0 11, −0.007, −0.006), indicating that the OTM puts t are more expensive than OTM calls just before EAs. Our two measures of earnings o surprise—SUE and IBES Surprise—are positively correlated (0.17), as expected. The n correlationcoefficientsofRR-IV andP/C (−0.228), RR-IV andP/C t−1,i,q t−1,i,q t−2,i,q t−2,i,q (−0.205), and RR-I V and P/C (−0.019) are negative, as expected (high put t−3,i,q t−3,i,q t options demand increases the P/C ratio and decreases RR-IV), but the magnitude is n very small. So, both the variables can be used in the same model without the issue of i multicollinearity. As we move closer to EA, the correlation between the surprise measures r andpRR-IV increases in magnitude. The correlation between SUE (IBES Surprise) and RR-IV increases monotonically from 0.078 to 0.162 (0.052 to 0.157) from t= −3 to e t= −1. As we come close to EA, we see a similar trend in the correlation between the r P/C ratio and surprise measures. The correlation between SUE (IBES Surprise) and P P/C decreases monotonically from −0.056 to −0.11 (−0.161 to −0.224) from t= −3 to t= −1. As expected, the correlation between ATM-IV and surprise measures does not show any clear pattern. 13 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 41,
    "chunk_index": 25,
    "word_count": 319,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "(IBES Surprise) and P P/C decreases monotonically from −0.056 to −0.11 (−0.161 to −0.224) from t= −3 to t= −1. As expected, the correlation between ATM-IV and surprise measures does not show any clear pattern. 13 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 41,
    "chunk_index": 26,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Insert Tables 2 and 3 here e w 5. Results and Discussion e i 5.1. Options smile dynamics around EA v e As discussed in Section 3.3, we first examine the behavior of options smiles in the EA and non-EA months. Table 4 shows the results of ourranalysis. We find that all the three smile parameters (ATM-IV, IV , and IV ) are elevated in the months having ∆=0.75 ∆=0.25 r EA than in the other months. The difference between the mean of the smile parameters e in the EA months and the mean in pre- and post-EA months is statistically significant. e The upward shift of the smile curve may reflect the increased volatility that the market expects in the price discovery procepss of the high information contents of EA. The price discovery process will lead to higher volatility, irrespective of the sign of the earnings surprises. Thus, our analysis ptrovides evidence of elevated smiles in the months having o EA than in the months without EA. n 5.1.1. Smile parameters around EA We examine thetbehavior of the option smiles around EA by first plotting the daily n mean value of the options smile parameters around the EA day. Figure 1 shows the i pattern of mean ATM-IV (plot a), IV (plot b), and IV (plot c). The figures ∆=0.75 ∆=0.25 r highlight two key points. First, all the three smile parameters show a monotonic increase p leadingtoEA,signifyingabuildupofuncertaintybeforeEA.Second, allthreeparameters e experience a sharp fall immediately after EA, signifying the resolution of the uncertainty r post-EA. These results confirm the uncertainty resolution role of EA, which is in line P with the findings from other countries (Truong et al., 2012). Insert Table 4 and Figure 1 here 14 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 41,
    "chunk_index": 27,
    "word_count": 303,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "the uncertainty r post-EA. These results confirm the uncertainty resolution role of EA, which is in line P with the findings from other countries (Truong et al., 2012). Insert Table 4 and Figure 1 here 14 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 41,
    "chunk_index": 28,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d e 5.1.2. Smile dynamics around EA classified on the basis of earnings surprises w a. ATM-IV and earnings surprises e Past studies have reported differences in the increase in ATM-IV before EA, depending on the sign of earnings surprises (Truong et al., 2012). However,ithe unique setting of the v Indian market provides us with an opportunity to explore the pricing of the uncertainty e in the options market in the presence of a liquid SSF market. While both SSF and SSO contracts provide leverage benefits, the SSO mrarket provides additional benefits to investors seeking protection against downside risks (Jain et al., 2019b). The high r informationcontentofEAwillmaketheoptionsmoreexpensivebeforeEAtocompensate e for the expected increase in volatility of the underlying stocks because of the impending e earnings information. To examine whether the increase in ATM-IV depends on the surprise, we plot the mean value pof ATM-IV around EA classified separately on the basis of the earnings surprises. t Figure 2 shows the trend of ATM-IV during the ±10-day window around EA clas- o sified on the basis of earnings surprises estimated using IBES Surprise (plot a) and n SUE (plot b). Consistent with our expectations, we find that ATM-IV increases in the few days before EA , but the increase is not dependent on the EA surprise. The increase t in ATM-IV reflects the increase in the options cost to compensate for the expected in- n crease in the volatility by the impending earnings release. The increased options costs i compensrate for the additional benefit of the nonlinear payoff that SSO contracts provide overpSSF contracts. Our analysis shows that a liquid SSF market can alter the trend of ATM-IV around EA. e r b. RR-IV and earnings surprises P RR-IV, defined as the difference between IV and IV , measures the risk of ∆=0.25 ∆=0.75 a large price increase or price crash. The use of options contracts before EA to hedge against the downside risk will increase the demand for put options relative to call options, 15 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 41,
    "chunk_index": 29,
    "word_count": 348,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "risk of ∆=0.25 ∆=0.75 a large price increase or price crash. The use of options contracts before EA to hedge against the downside risk will increase the demand for put options relative to call options, 15 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 41,
    "chunk_index": 30,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d causing RR-IV to be negative. A negative RR-IV indicates that IV is lower than ∆=0.25 IV , which is the case when OTM puts are costlier than OTM call optioens. We also ∆=0.75 expect RR-IV to be more negative in the case of EA having a large-negative surprise w than in other cases. Past studies have found evidence of options trading being motivated by views about the direction of future stock prices (Lakonishok et ael., 2007). An expected negative earnings surprise will increase the demand for put options than for call options, i v leading to negative RR-IV. e Figure 3 shows the trend of RR-IV for the two surprise measures —IBES Surprise (plot a) and SUE (plot b) —in a ±10-day window arorund EAs after classifying them into three groups on the basis of earnings surprises as before. We find that RR-IV is negative r before EA. It becomes more negative before EA, with a large-negative surprise than that e of the other two categories. This indicates that the options market could predict negative e surprises very close to the event as insiders and informed traders trade on their private information closer to the announcepment event. While insiders could benefit from taking positions in both options and futures markets, options contracts offer advantages such as a nonlinear payoff, greater levetrage, and possibly lower costs. While the options contract o buyers will have to pay the option premium (which would be lower for OTM contracts), the futures contract bnuyers will have to deposit margin money. The costs for the buyer of an options contract would mainly be the cost of option decay, which may be low for a very short periodt(given the investor holds the option only until EA). n i Insert Figures 2 and 3 here r p e 5.2. Volume dynamics around EA r 5.2.1. O/S and O/F around EA P While past research has already established that the O/S ratio increases leading to EA, little is known for markets where both SSO and SSF contracts trade simultaneously. 16 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 41,
    "chunk_index": 31,
    "word_count": 356,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "r 5.2.1. O/S and O/F around EA P While past research has already established that the O/S ratio increases leading to EA, little is known for markets where both SSO and SSF contracts trade simultaneously. 16 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 41,
    "chunk_index": 32,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d The Indian financial market provides us with a unique setting wherein we can examine the investor’s preference among the different markets (SSO, SSF, or spot)ebefore EA. For this, we plotted the daily mean values of O/S and O/F for ±10 days around EA. w Figure 4 shows that both O/S (plot a) and O/F (plot b) increase monotonically leading to EA. The two plots suggest that the investors prefer SSO maerkets to the spot and SSF markets, as suggested by the relatively high buildup in SSO volumes than in SSF i v and spot volumes. The high SSO volume may be explained by the fact that while both futures and options provide leverage and short-selling beenefits, the downside protection (nonlinear payoff) is only provided by the options contracts. r 5.2.2. P/C ratio and earnings surprises r e Our previous analysis suggests that investors prefer the SSO market to the SSF and spot markets, and one possible reasoneis the presence of insurance-seeking or informed investors. The presence of insurance-seeking investors will lead to an increase in the P/C p ratiobeforeEA,andthepresenceofinformedinvestorswouldcauseadifferentialincrease, depending on the surprise embedded in the impending EA. To test our conjecture, we t plot the daily mean P/C roatio around EA after classifying EAs into three groups on the basis of earnings surprises, as explained in Section 3.4. Figure 5 shows the trend of P/C n in a ±10-day window around EA classified on the basis of the two measures of earnings surprises—IBES Surprise(plota)andSUE (plotb). Consistentwithourexpectations, t n we find that the P/C ratio increases a few days before EA, indicating the use of options for hedging purposes. Regarding the information content of the options activity, we find i r that the increase in the P/C ratio is the highest in the case of large-negative surprises p and the lowest in the case of large-positive surprises. The trend indicates that the options e markets attract informed investors who trade on the basis of expected earnings surprises. In fact, taken along with the increase in the O/F ratio close to the EA day, one may also r Pconjecture informed investors’ preference for SSO over SSF contracts close to the EA day —a major information content release event. 17 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 41,
    "chunk_index": 33,
    "word_count": 383,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "the increase in the O/F ratio close to the EA day, one may also r Pconjecture informed investors’ preference for SSO over SSF contracts close to the EA day —a major information content release event. 17 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 41,
    "chunk_index": 34,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Insert Figures 4 and 5 here e w 5.3. Evidence of informed trading—Regression results e As discussed in Section 3.5, we use the regression specification in model 5 to exam- ine the evidence of informed trading. We separately estimate thie regression coefficients v using different lag values of the smile parameters. The results are shown in Tables 5 e and 6. Columns (1) and (2) present the estimated coefficients with SUE as the depen- dent variable, and columns (3) and (4) present the croefficients for the model that uses IBES Surprise as the dependent variable. Our variables of interest are the coefficients r of the smile parameters (RR-IV and ATM-IV) and the P/C ratio. e Table 5 shows the results of our regression model 5 when n =1. The estimated e coefficient for RR-IV is positive and significant, and that for P/C is negative t−1,i,q t−1,i,q p and significant. The coefficient estimate for ATM-IV is statistically nonsignificant, t−1,i,q which is consistent with our expec tations. Specifically, we find that the level of RR-IV on t the trading day immediately before EA can predict the sign of the EA surprise and that o the result remains robust for two alternative measures of surprises. Similarly, the level of n P/C one day before EA predicts the sign of the EA surprise, with a high value of P/C predicting a negativ e surprise. We find that the level of ATM-IV one day before EA t does not predict the sign of EA surprises. Our results indicate the presence of informed n traders in the SSO market one day before EA. i Tabrle 6 shows the results of our regression model 5 when n = 2 and 3. Corroborat- p ing our expectations, we find that the two- and three-day lag values of our first variables eof interest (RR-IV and RR-IV ) load positively on both the measures of sur- t−2,i,q t−3,i,q prise but are nonsignificant. Our second variable of interest, P/C, shows similar results. r P/C and P/C load negatively on both the surprise measures but are nonsignif- Pt−2,i,q t−3,i,q icant. Coupling the results shown in Tables 5 and 6, we can infer that the predictive power of RR-IV and P/C increases as we come closer to the EA date. Thus, our re- 18 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 41,
    "chunk_index": 35,
    "word_count": 396,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "Pt−2,i,q t−3,i,q icant. Coupling the results shown in Tables 5 and 6, we can infer that the predictive power of RR-IV and P/C increases as we come closer to the EA date. Thus, our re- 18 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 41,
    "chunk_index": 36,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d gression analysis provides evidence that the options market can distinguish between the forthcoming positive and negative earnings surprises closer to the announceement date. w Insert Tables 5 and 6 here e i v 6. Robustness e To test the robustness of our results, we use an alternative way to estimate smile pa- r rameters (ATM-IV and RR-IV). Instead of fittin g quadratic volatility smiles, we use r the moneyness of the options contract to categorize them into OTM, ATM, and ITM. e Following Xing et al. (2010), we categorize a call (put) option as OTM if the option’s e strike price by futures price (futures price by strike price) is between 1.05 and 1.20. A call (put) option is categorized as ATM if the option’s strike price by futures price (fu- p tures by strike price) is between 0.95 and 1.05. When there are multiple ATM and OTM options for a particular stock day, we estimate the volume-weighted IV of all the options t o contracts to arrive at one IV value for ATM and OTM for each SSO-day pair. Finally, we use the volume-weighted IV of ATM and OTM options of each SSO-day pair to calculate n the RR-IV of the respective stock day. We use the following formula to estimate RR-IV: t n Alt RR-IV = IV −IV OTMCall OTMPut i r where IV is the volume-weighted IV of all the OTM call options and IV is OTMCall OTMPut p the volume-weighted IV of all the OTM put options. The above exercise gives a single e value of ATM and OTM call and put options for every SSO-day pair. For the sake rof clarity, we call them Alt ATM-IV and Alt RR-IV. In our robustness test, we use PAlt ATM-IV and Alt RR-IV in our regression equation 5. The results reported in Tables 7 and 8 show that our main results remain qualitatively similar even if we use the alternate definitions of ATM-IV and RR-IV. 19 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 41,
    "chunk_index": 37,
    "word_count": 343,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "and Alt RR-IV in our regression equation 5. The results reported in Tables 7 and 8 show that our main results remain qualitatively similar even if we use the alternate definitions of ATM-IV and RR-IV. 19 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Insert Tables 7 and 8 here e w 7. Conclusion e i We examine the price and volume dynamics in the optionsvmarket before EAs to study how they reflect the asymmetric risks of earnings surprises in the Indian market. India is e unique in having liquid options and futures markets in individual stocks and provides an r ideal setting to study the evolution of the asymmetric uncertainty around EAs. Our key results are as follows. First, both uncertainty arnd asymmetric uncertainty are elevated e before EA and come down after it. Therefore, option volatility, smirk, and volumes increase before EA and decrease immediately after EA for options expiring after an EA. e Second, the markets can differentiate between forthcoming positive and negative earnings p surprises only very near to the announcement date. This suggests that firms’ internal controls and enforcement of insider trading laws ensure that, by and large, the actual t surprise content of EAs remains confidential until perhaps very close to their release. o Our results suggest that even in the presence of a liquid SSF market, informed traders n are attracted toward the options market, which becomes an important venue for price discoveryandtheassimilationofinformationaboutearningssurprises. Ourpaperaddsto t the larger debate on the options market’s role in helping price discovery and assimilation n of private information. i r p e r P 20 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 41,
    "chunk_index": 38,
    "word_count": 288,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "market, which becomes an important venue for price discoveryandtheassimilationofinformationaboutearningssurprises. Ourpaperaddsto t the larger debate on the options market’s role in helping price discovery and assimilation n of private information. i r p e r P 20 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 References d e Agarwalla, S.K., Pandey, A., 2013. Expiration-day effects and the impact of short trading w breaks on intraday volatility: Evidence from the Indian market. Journal of Futures Markets 33, 1046–1070. e Agarwalla, S.K., Saurav, S., Varma, J.R., 2021a. Lottery and bubble stocks and the i cross-section of option-implied tail risks. Journal of Futvures Markets 42, 231–249. Agarwalla, S.K., Varma, J.R., Virmani, V., 2021b. Theeimpact of COVID-19 on tail risk: Evidence from Nifty index options. Economics Letters 204, 109878. r Agarwalla, S.K., Varma, J.R., Virmani, V., 2021c. Rationalrepricingofriskduringcovid- r 19: Evidence from Indian single stock options market. Journal of Futures Markets e 41, 1498–1519. e Ball, R., Brown, P., 1968. Anempiricalevaluationofaccountingincomenumbers. Journal p of Accounting Research 6, 159–178. Beaver, W.H., 1968. The information content of annual earnings announcements. Journal t of Accounting Researcoh 6, 67–92. Beaver, W.H., McNicnhols, M.F., Wang, Z.Z., 2018. The information content of earn- ings announcements: New insights from intertemporal and cross-sectional behavior. Review of Actcounting Studies 23, 95–135. n Beaver, W.H., McNichols, M.F., Wang, Z.Z., 2020. Increased market response to earn- i ings announcements in the 21st century: An empirical investigation. Journal of r pAccounting and Economics 69, 101244. eBerkman, H., Truong, C., 2009. Event day 0? After-hours earnings announcements. Journal of Accounting Research 47, 71–103. r P Black, F., 1976. The pricing of commodity contracts. Journal of Financial Economics 3, 167–179. 21 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 41,
    "chunk_index": 39,
    "word_count": 292,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "69, 101244. eBerkman, H., Truong, C., 2009. Event day 0? After-hours earnings announcements. Journal of Accounting Research 47, 71–103. r P Black, F., 1976. The pricing of commodity contracts. Journal of Financial Economics 3, 167–179. 21 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 41,
    "chunk_index": 40,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Black, F., Scholes, M., 1973. The pricing of options and corporate liabilities. Journal of Political Economy 81, 637–654. e Cao, H.H., Ou-Yang, H., 2008. Differences of opinion of public informwation and specula- tive trading in stocks and options. The Review of Financial Studies 22, 299–335. e Chan, K., Ge, L., Lin, T.C., 2015. Informational content of options trading on acquirer i announcementreturn. JournalofFinancialandQuantitativeAnalysis50, 1057–1082. v Cremers, M., Weinbaum, D., 2010. Deviations from peut-call parity and stock return predictability. Journal of Financial and Quantitative Analysis 45, 335–367. r Diavatopoulos, D., Doran, J.S., Fodor, A., Peterson , D.R., 2012. The information content r of implied skewness and kurtosis changes prior to earnings announcements for stock e and option returns. Journal of Banking & Finance 36, 786–802. e Donders,M.W.,Vorst,T.C.,1996. Theimpactoffirmspecificnewsonimpliedvolatilities. p Journal of Banking & Finance 20, 1447–1461. Easley, D., O’hara, M., Srinivas, P.S., 1998. Option volume and stock prices: Evidence t on where informed traoders trade. The Journal of Finance 53, 431–465. FIA, A.W., 2020. 201n9 market data - derivatives volume grows BRIC by BRIC. Futures Industry Association URL: https://www.fia.org/marketvoice/articles/2019- market-datat-derivatives-volume-grows-bric-bric. n Ge, L., Lin, T.C., Pearson, N.D., 2016. Whydoestheoptiontostockvolumeratiopredict i stock returns? Journal of Financial Economics 120, 601–622. r p Ho, L.C.J., 1993. Option trading and the relation between price and earnings: A cross- sectional analysis. Accounting Review , 368–384. e Jain, S., Agarwalla, S.K., Varma, J.R., Pandey, A., 2019a. Informed trading around r Pearnings announcements—spot, futures, or options? Journal of Futures Markets 39, 579–589. 22 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 41,
    "chunk_index": 41,
    "word_count": 260,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "and earnings: A cross- sectional analysis. Accounting Review , 368–384. e Jain, S., Agarwalla, S.K., Varma, J.R., Pandey, A., 2019a. Informed trading around r Pearnings announcements—spot, futures, or options? Journal of Futures Markets 39, 579–589. 22 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 41,
    "chunk_index": 42,
    "word_count": 50,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "d Jain, S., Varma, J.R., Agarwalla, S.K., 2019b. Indian equity options: Smile, risk premi- ums, and efficiency. Journal of Futures Markets 39, 150–163. e Jin, W., Livnat, J., Zhang, Y., 2012. Option prices leading equity wprices: Do option traders have an information advantage? Journal of Accounting Research 50, 401– e 432. i Johnson, T.L., So, E.C., 2012. The option to stock volume ratio and future returns. v Journal of Financial Economics 106, 262–286. e Lakonishok, J., Lee, I., Pearson, N.D., Poteshman, A.M., 2007. Option market activity. r The Review of Financial Studies 20, 813–857. r Lu, Y., Ray, S., 2016. Too good to be true? An analysis of the options market’s reactions e to earnings releases. Journal of Business Finance & Accounting 43, 830–848. e Nelder, J.A., Mead, R., 1965. A simplex method for function minimization. The Com- p puter Journal 7, 308–313. Pan, J., Poteshman, A.M., 2006. The information in option volume for future stock t prices. The Review ofoFinancial Studies 19, 871–908. Patell,J.M.,Wolfson,nM.A.,1979. Anticipatedinformationreleasesreflectedincalloption prices. Journal of Accounting and Economics 1, 117–140. t Patell, J.M., Wolfson, M.A., 1981. The ex ante and ex post price effects of quarterly n earnings announcements reflected in option and stock prices. Journal of Accounting i Research 19, 434–458. r p Rai, A., Tartaroglu, S., 2015. The relative option to stock volume and market response to earnings surprises. Journal of Accounting, Auditing & Finance 30, 431–460. e Rogers, J.L., Skinner, D.J., Van Buskirk, A., 2009. Earnings guidance and market un- r Pcertainty. Journal of Accounting and Economics 48, 90–109. Roll, R., Schwartz, E., Subrahmanyam, A., 2010. O/S: The relative trading activity in options and stock. Journal of Financial Economics 96, 1–17. 23 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 41,
    "chunk_index": 43,
    "word_count": 293,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "guidance and market un- r Pcertainty. Journal of Accounting and Economics 48, 90–109. Roll, R., Schwartz, E., Subrahmanyam, A., 2010. O/S: The relative trading activity in options and stock. Journal of Financial Economics 96, 1–17. 23 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Sen, K., 2009. Earnings surprise and sophisticated investor preferences in India. Journal of Contemporary Accounting & Economics 5, 1–19. e Singh, S., Yadav, S.S., et al., 2018. Post-earnings-announcement driftwanomaly in India: A test of market efficiency. Theoretical Economics Letters 8, 3178. e Skinner, D.J., 1990. Options markets and the information content of accounting earnings i releases. Journal of Accounting and Economics 13, 191–211. v Truong, C., 2012. Options trading and the extent thatestock prices lead future earnings information. Journal of Business Finance & Accounting 39, 960–996. r Truong, C., Corrado, C., Chen, Y., 2012. The op tions market response to accounting r earnings announcements. Journal of International Financial Markets, Institutions e and Money 22, 423–450. e Vipul, V., 2005. Futures and options expiration-day effects: the Indian evidence. Journal p of Futures Markets 25, 1045. Xing, Y., Zhang, X., Zhao, R., 2010. What does the individual option volatility smirk t tell us about future eqouity returns? Journal of Financial and Quantitative Analysis 45, 641–662. n t n i r p e r P 24 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 41,
    "chunk_index": 44,
    "word_count": 238,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "X., Zhao, R., 2010. What does the individual option volatility smirk t tell us about future eqouity returns? Journal of Financial and Quantitative Analysis 45, 641–662. n t n i r p e r P 24 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Data Availability Statement e Data sharing is not applicable to this article as no new data were created or analyzed in this study. The data that support the findings of this study are awvailable from the National Stock Exchange of India. Restrictions apply to the availability of these data, e which were used under license for this study. i v e Data Citation r [dataset] National Stock Exchange of India Limited, January 1, 2015 through De- r cember 31, 2019, High-frequency single stock options and futures trade data, https: e //www.nseindia.com/nse-data-and-analytics. e [dataset] National Stock Exchange of India Limited, January 1, 2015 through De- p cember 31, 2019, Firm’s corporate announcement web pages, https://www.nseindia.c om/companies-listing/corpor ate-filings-announcements. t [dataset] I/B/E/S Esotimates, January 1, 2015 through December 31, 2019, Institu- tional Brokers Estimate System data, https://www.refinitiv.com/en/financial-d n ata/company-data/institutional-brokers-estimate-system-ibes [dataset] CMtIE Prowess , January 1, 2015 through December 31, 2019, Company dx n financial information data, Centre for Monitoring Indian Economy. https://prowessd x.cmie.comi/. r p e r P 25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 41,
    "chunk_index": 45,
    "word_count": 231,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "Estimate System data, https://www.refinitiv.com/en/financial-d n ata/company-data/institutional-brokers-estimate-system-ibes [dataset] CMtIE Prowess , January 1, 2015 through December 31, 2019, Company dx n financial information data, Centre for Monitoring Indian Economy. https://prowessd x.cmie.comi/. r p e r P 25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 Figure 1: IV parameter dynamics around EA The panels show the mean value of the normalized smile parameters (ATM-IV, IV , and IV ) for a ±10-day ∆=0.75 ∆=0.25 window across the EA day. The vertical lines indicate EA days. (a) ATM-IV (b) IV (c) IV ∆=0.75 ∆=0.25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 26 P r e p r i n t n o t p e e r r e v i e w e d Figure 2: ATM-IV and surprise The panels show the pattern of adjusted ATM-IV categorized on the basis of earnings surprise, measured using (a) IBES-reported surprise and (b) standardized unexpected earnings. All EAs are categorized into large negative, small positive/negative, and large positive, by dividing the surprise measure into three quantiles. The vertical lines indicate EA days. (a) IBES Surprise (b) SUE Surprise This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 27 P r e p r i n t n o t p e e r r e v i e w e d",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 27,
    "page_range": "p.27-29",
    "total_pages": 41,
    "chunk_index": 46,
    "word_count": 236,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.27-29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "The vertical lines indicate EA days. (a) IBES Surprise (b) SUE Surprise This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 27 P r e p r i n t n o t p e e r r e v i e w e d Figure 3: RR-IV and surprise The panels show the pattern of the skew of the IV smile (RR-IV = IV −IV ) categorized on the basis of earnings surprise, ∆=0.25 ∆=0.75 measured using (a) IBES-reported surprise and (b) standardized unexpected earnings. All EAs are categorized into large negative, small positive/negative and large positive, by dividing the surprise measure into three quantiles. The vertical lines indicate EA days. (a) IBES Surprise (b) SUE Surprise This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 28 P r e p r i n t n o t p e e r r e v i e w e d Figure 4: Relative volume and EA The panels show the mean value of the options-volume-to-stock-volume ratio (O/S) and the options-volume-to-SSF-volume ratio (O/F) for the ±10-day window around EA days (indicated by the vertical lines). (a) O/S (b) O/F This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 29 P r e p r i n t n o t p e e r r e v i e w e d",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 29,
    "page_range": "p.29-31",
    "total_pages": 41,
    "chunk_index": 47,
    "word_count": 237,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.29-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "around EA days (indicated by the vertical lines). (a) O/S (b) O/F This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 29 P r e p r i n t n o t p e e r r e v i e w e d Figure 5: Put-to-call ratio and surprise The panels show the pattern of the ratio of the volume of put options to the volume of call options (P/C) categorized on the basis of earnings surprise, measured using (a) IBES-reported surprise and (b) standardized unexpected earnings. All EAs are categorized into large negative, small positive/negative, and large positive, by dividing the surprise measure into three quantiles. The vertical lines indicate EA days. (a) IBES Surprise (b) SUE Surprise This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 30 P r e p r i n t n o t p e e r r e v i e w e d",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 31,
    "page_range": "p.31-32",
    "total_pages": 41,
    "chunk_index": 48,
    "word_count": 164,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.31-32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "The vertical lines indicate EA days. (a) IBES Surprise (b) SUE Surprise This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 30 P r e p r i n t n o t p e e r r e v i e w e d Table 1: Variable construction details Variable Name Variable Definition Source ATM-IV ForeverySSO-daypair,theIVofat-the-moneyoptions,i.e.,∆=0.5, NSE Trade Book divided by the mean value of ATM-IV of the month preceding the EA month. IV ForeverySSO-daypair,theIVoftheoptionshaving∆=0.75divided NSE Trade Book ∆=0.75 bythemeanvalueofIV ofthemonthprecedingtheEAmonth. ∆=0.75 IV ForeverySSO-daypair,theIVoftheoptionshaving∆=0.25divided NSE Trade Book ∆=0.25 bythemeanvalueofIV ofthemonthprecedingtheEAmonth. ∆=0.25 RR-IV For every SSO-day pair, the difference of the IV of options having NSE Trade Book delta equal to 0.25 and 0.75 (IV IV ). ∆=0.25 ∆=0.75 Analyst Coverage log(1+the number of analysts following the firm) IBES Beta Estimate r = α +β r +(cid:15) , where r and r are the returns CMIE Prowess jt j j mt jt jt mt for the stock j and the market at time t, respectively. We estimate a 60-month rolling window regression for each stock. Institutional pct Percentage of institutional shareholding in a firm CMIE Prowess Analyst Dispersion Ratio of the standard deviation of analyst’s EPS forecast and the IBES mean of analysts’ EPS consensus Momentum Month t momentum of a stock is its return over the t−12 to t−1 CMIE Prowess months Size Log of the average market capitalization of the stock in the pre-EA CMIE Prowess month. O/S Ratio of the daily trading volume of options and stocks NSE Bhav Copy & CMIE Prowess O/F Ratio of the daily trading volume of options and futures NSE Bhav Copy P/C Ratio of the daily trading volume of put options and call options NSE Bhav Copy BHAR Buy-and-hold return from −10 to −2 days before EA CMIE Prowess −10,−2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 31 P r e p r i n t n o t p e e r r e v i e w e d",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 41,
    "chunk_index": 49,
    "word_count": 342,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "Buy-and-hold return from −10 to −2 days before EA CMIE Prowess −10,−2 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 31 P r e p r i n t n o t p e e r r e v i e w e d d Table 2: Summary statistics e Statistic N Mean St. Dev. Min Pctl(25) Median Pctl(75) Max SUE Surprise 1,831 0.052 1.089 −2.678 −0.604 0.106 0.753 2.742 w IBES Surprise 1,460 −0.170 1.154 −7.248 −0.212 −0.026 0.086 3.504 RR-IV 2,081 −0.011 0.060 −1.440 −0.031 −0.003 0.017 0.324 t−1,i,q ATM-IV 2,081 0.455 0.142 0.226 0.363 0.430 0.520 1.053 t−1,i,q P/C 2,081 0.124 0.184 0.002 0.025e0.060 0.145 1.153 t−1,i,q RR-IV 1,768 −0.007 0.110 −4.171 −0.022 0.0003 0.018 0.403 t−2,i,q ATM-IV 1,768 0.448 0.157 0.138 0.355 0.422 0.502 1.947 t−2,i,q i P/C t−2,i,q 1,768 0.105 0.237 0.000 v0.024 0.053 0.118 7.383 RR-IV 1,578 −0.006 0.149 −5.700 −0.019 −0.0001 0.017 0.187 t−3,i,q ATM-IV 1,578 0.437 0.160 0.168 0.347 0.410 0.491 2.433 t−3,i,q e P/C 1,578 0.099 0.171 0.000 0.022 0.050 0.117 3.803 t−3,i,q Analyst Coverage 2,055 2.835 0.903 0.000 2.398 3.091 3.526 3.951 i,q Beta 1,971 1.265 0.595 0.0r50 0.842 1.245 1.690 2.827 m−1,i,q Institutional pct 2,081 34.226 14.708 7.586 23.380 32.416 42.971 86.689 i,q−1 Analyst Dispersion 2,002 0.101 0.229 −1.163 0.046 0.082 0.143 0.993 i,q r Momentum 2,080 0.028 0.393 −0.835 −0.220 −0.003 0.250 1.243 i,q Size 2,081 12.493 1.26e9 9.996 11.538 12.463 13.379 15.452 m−1,i,q BHAR 2,081 −0.003 0.056 −0.149 −0.037 −0.004 0.029 0.191 t−10,t−2,i,q e p t o n t n i r p e r P 32 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 41,
    "chunk_index": 50,
    "word_count": 280,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "1.243 i,q Size 2,081 12.493 1.26e9 9.996 11.538 12.463 13.379 15.452 m−1,i,q BHAR 2,081 −0.003 0.056 −0.149 −0.037 −0.004 0.029 0.191 t−10,t−2,i,q e p t o n t n i r p e r P 32 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Table 3: Correlation table e (1) (2) (3) (4) (5) (6) (7) (8) (9) (10) SUE 1 IBES Surprise 0.17 1 w RR-IV 0.162 0.157 1 t−1,i,q ATM-IV −0.061 −0.233 −0.305 1 t−1,i,q P/C −0.11 −0.224 −0.228 0.371 1 t−1,i,q e RR-IV 0.091 0.113 0.559 −0.267 −0.162 1 t−2,i,q ATM-IV −0.089 −0.249 −0.279 0.915 0.354 −0.273 1 t−2,i,q i P/C −0.082 −0.203 −0.177 0.368 0.882 −0.205 0.351 1 t−2,i,q v RR-IV 0.078 0.052 0.469 −0.158 0.047 0.591 −0.141 0.038 1 t−3,i,q ATM-IV −0.075 −0.227 −0.25 0.881 0.355 −0.253 0.964 0.347 −0.136 1 t−3,i,q P/C −0.056 −0.161 −0.154 0.367 0.81e−0.171 0.345 0.841 −0.019 0.348 t−3,i,q r r e e p t o n t n i r p e r P 33 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 41,
    "chunk_index": 51,
    "word_count": 186,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "0.881 0.355 −0.253 0.964 0.347 −0.136 1 t−3,i,q P/C −0.056 −0.161 −0.154 0.367 0.81e−0.171 0.345 0.841 −0.019 0.348 t−3,i,q r r e e p t o n t n i r p e r P 33 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 Table 4: Differences between the mean values of IV curve parameters Columns(1)to(3)reportthemeanvalueofIVcurveparameters(ATM-IV,IV ,andIV )forthemonthbefore ∆=0.75 ∆=0.25 the EA month, for the EA month, and for the month after the EA month. Columns (4) and (5) report the differences between the mean values of the EA month and the mean values of the month before the EA month and after the EA month, respectively, along with the t-statistics of the difference in the mean test. Pre-EA Month EA Month Post-EA Month (2)−(1) (t-stats) (2)−(3) (t-stats) IV curve parameters (1) (2) (3) (4) (5) ATM-IV 0.383 0.411 0.372 0.028 (6.70) 0.038 (10.84) IV 0.397 0.427 0.391 0.030 (6.42) 0.036 (9.13) ∆=0.75 IV 0.397 0.422 0.388 0.024 (5.59) 0.034 (9.21) ∆=0.25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 34 P r e p r i n t n o t p e e r r e v i e w e d",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 41,
    "chunk_index": 52,
    "word_count": 206,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "0.036 (9.13) ∆=0.75 IV 0.397 0.422 0.388 0.024 (5.59) 0.034 (9.21) ∆=0.25 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 34 P r e p r i n t n o t p e e r r e v i e w e d d Table 5: RR-IV, P/C, and EA surprise (n = 1) e Thetablereportstheregressioncoefficientsofequation5,withstandarderrorsin parenthesis. The dependent variables are SUE Surprise in columns (1) and (2) andIBES Surpriseincolumns(3)and(4). ***,**,and*reflectthesignificance w at 1, 5, and 10% levels, respectively. Dependent variable SUE IBES Surprise e (1) (2) (3) (4) RR-IV 2.168∗∗∗ 2.514∗∗∗ 0.750∗∗∗ 0.824∗∗∗ t−1,i,q i (0.594) (0.634) (0.242) (0.258) v P/C −1.078∗∗∗ −1.149∗∗∗ −0.575∗∗∗ −0.570∗∗∗ t−1,i,q (0.388) (0.397) (0.157) (0.162) ATM-IV 0.649∗ 0.416 e−0.069 −0.135 t−1,i,q (0.336) (0.362) (0.134) (0.145) Analyst Coverage i,q −0.272∗∗ −0.204∗ r0.044 0.060 (0.107) (0.113) (0.058) (0.061) Beta 0.144 0.185 0.032 0.046 m−1,i,q (0.142) (0.1r48) (0.054) (0.056) Institutional pct 0.016∗ 0.011 0.001 0.0001 i,q−1 e (0.009) (0.009) (0.004) (0.004) Analyst Dispersion −0.396 −0.361 0.072 0.045 i,q e (0.398) (0.402) (0.156) (0.159) Momentum −0.140∗ −0.039 0.053 0.077∗ i,q (0p.085) (0.094) (0.035) (0.040) Size 0.305∗∗∗ 0.190 −0.099∗∗ −0.086∗ m−1,i,q (0.110) (0.121) (0.045) (0.049) BHAR 1.074∗ 0.760 0.052 0.037 t−10,t−2,i,q t(0.547) (0.552) (0.218) (0.221) o Firm-level fixed effect Yes Yes Yes Yes Year-quarter fixed effect No Yes No Yes Observations n1,729 1,729 1,390 1,390 Adjusted R2 0.028 0.038 0.140 0.142 t n i r p e r P 35 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 41,
    "chunk_index": 53,
    "word_count": 252,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "(0.221) o Firm-level fixed effect Yes Yes Yes Yes Year-quarter fixed effect No Yes No Yes Observations n1,729 1,729 1,390 1,390 Adjusted R2 0.028 0.038 0.140 0.142 t n i r p e r P 35 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Table 6: RR−IV, P/C, and EA Surprise (n = 2 and 3) e Thetablereportstheregressioncoefficientsofequation5,withstandarderrorsin parenthesis. The dependent variables are SUE Surprise in columns (1) and (2) andIBES Surpriseincolumns(3)and(4). ***,**,and*reflectthesignificance w at 1, 5, and 10% levels, respectively. Dependent variable SUE IBES Surprise e (1) (2) (3) (4) RR-IV 0.673 0.400 t−2,i,q i (1.026) (0.413) v P/C −0.700 −0.096 t−2,i,q (0.590) (0.232) ATM-IV 0.107 e−0.292 t−2,i,q (0.464) (0.183) RR-IV t−3,i,q 1.809 r 0.667 (1.240) (0.499) P/C −0.274 −0.373 t−3,i,q (0.669)r (0.258) ATM-IV 0.575 −0.110 t−3,i,q e (0.532) (0.209) Analyst Coverage −0.173 −0.203 0.114∗ 0.076 i,q e (0.128) (0.141) (0.068) (0.074) Beta 0.233 0.340∗ 0.030 0.072 m−1,i,q (0.p162) (0.175) (0.061) (0.064) Institutional pct 0.004 0.008 −0.0002 0.003 i,q−1 (0.011) (0.011) (0.004) (0.004) Analyst Dispersion −0.607 −0.627 0.087 0.092 i,q t(0.442) (0.466) (0.174) (0.184) Momentum o0.021 0.044 0.073∗ 0.065 i,q (0.103) (0.112) (0.044) (0.047) Size 0.215 0.270∗ −0.083 −0.054 m−1,i,q n (0.135) (0.145) (0.055) (0.058) BHAR 1.257∗∗ 1.337∗∗ 0.152 −0.118 t−10,t−2,i,q (0.612) (0.666) (0.243) (0.259) t Firm-level fixed effect Yes Yes Yes Yes Year-nquarter fixed effect Yes Yes Yes Yes Observations 1,474 1,320 1,210 1,074 Adijusted R2 0.014 0.014 0.126 0.126 r p e r P 36 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 41,
    "chunk_index": 54,
    "word_count": 259,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "(0.612) (0.666) (0.243) (0.259) t Firm-level fixed effect Yes Yes Yes Yes Year-nquarter fixed effect Yes Yes Yes Yes Observations 1,474 1,320 1,210 1,074 Adijusted R2 0.014 0.014 0.126 0.126 r p e r P 36 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Table 7: Alternate estimate of IV: RR-IV, P/C, and EA surprise (n = 1) e Thetablereportstheregressioncoefficientsofequation5,withstandarderrorsin parenthesis. The dependent variables are SUE Surprise in columns (1) and (2) andIBES Surpriseincolumns(3)and(4). ***,**,and*reflectthesignificance w at 1, 5, and 10% levels, respectively. Dependent variable SUE IBES Surprise e (1) (2) (3) (4) AltRR-IV 1.844∗∗∗ 2.386∗∗∗ 0.428∗ 0.483∗ t−1,i,q i (0.656) (0.699) (0.256) (0.271) v P/C −0.635∗∗∗ −0.620∗∗∗ −0.188∗∗∗ −0.205∗∗∗ t−1,i,q (0.142) (0.145) (0.055) (0.057) AltATM-IV 0.718∗∗ 0.432 e−0.061 −0.115 t−1,i,q (0.337) (0.362) (0.134) (0.143) Analyst Coverage i,q −0.252∗∗ −0.170 r−0.013 −0.004 (0.110) (0.117) (0.060) (0.065) Beta 0.168 0.234 0.076 0.095∗ m−1,i,q (0.144) (0.1r50) (0.054) (0.055) Institutional pct 0.015 0.009 0.001 0.0001 i,q−1 e (0.009) (0.009) (0.004) (0.004) Analyst Dispersion −0.597 −0.594 0.032 0.013 i,q e (0.400) (0.405) (0.156) (0.159) Momentum −0.082 0.035 0.063∗ 0.086∗∗ i,q (0p.086) (0.096) (0.035) (0.040) Size 0.343∗∗∗ 0.229∗ −0.091∗∗ −0.072 m−1,i,q (0.110) (0.122) (0.045) (0.049) BHAR 1.107∗∗ 0.863 0.243 0.234 t−10,t−2,i,q t(0.548) (0.553) (0.216) (0.218) o Firm-level fixed effect Yes Yes Yes Yes Year-quarter fixed effect No Yes No Yes Observations n1,672 1,672 1,334 1,334 Adjusted R2 0.034 0.043 0.150 0.158 t n i r p e r P 37 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 41,
    "chunk_index": 55,
    "word_count": 256,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "(0.218) o Firm-level fixed effect Yes Yes Yes Yes Year-quarter fixed effect No Yes No Yes Observations n1,672 1,672 1,334 1,334 Adjusted R2 0.034 0.043 0.150 0.158 t n i r p e r P 37 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d Table 8: Alternate estimate of IV: RR-IV, P/C, and EA surprise (n = 2 and 3) e Thetablereportstheregressioncoefficientsofequation5,withstandarderrorsin parenthesis. The dependent variables are SUE Surprise in columns (1) and (2) andIBES Surpriseincolumns(3)and(4). ***,**,and*reflectthesignificance w at 1, 5, and 10% levels, respectively. Dependent variable SUE Surprise IBES e (1) (2) (3) (4) AltRR-IV 3.010∗∗∗ −0.167 t−2,i,q i (1.037) (0.415) v P/C −0.204 −0.108 t−2,i,q (0.190) (0.076) AltATM-IV 0.102 e−0.266 t−2,i,q (0.471) (0.185) AltRR-IV t−3,i,q 2.314∗ r 0.215 (1.213) (0.472) P/C −0.302 −0.057 t−3,i,q (0.19r1) (0.075) AltATM-IV 0.416 −0.179 t−3,i,q e (0.531) (0.203) Analyst Coverage −0.152 −0.147 0.101 0.080 i,q e (0.132) (0.143) (0.069) (0.074) Beta 0.344∗∗ 0.394∗∗ 0.061 0.075 m−1,i,q (0p.163) (0.174) (0.060) (0.062) Institutional pct 0.001 0.006 −0.002 0.004 i,q−1 (0.011) (0.012) (0.004) (0.005) Analyst Dispersion −0.892∗∗ −0.712 −0.010 0.190 i,q t(0.437) (0.472) (0.175) (0.182) Momentum o0.070 0.076 0.099∗∗ 0.077∗ i,q (0.105) (0.113) (0.043) (0.046) Size 0.232∗ 0.313∗∗ −0.112∗∗ −0.044 m−1,i,q n (0.134) (0.143) (0.054) (0.056) BHAR 1.277∗∗ 1.565∗∗ 0.304 0.009 t−10,t−2,i,q (0.607) (0.653) (0.238) (0.252) t Firm-level fixed effect Yes Yes Yes Yes Year-nquarter fixed effect Yes Yes Yes Yes Observations 1,429 1,273 1,157 1,030 Adijusted R2 0.031 0.027 0.129 0.157 r p e r P 38 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 41,
    "chunk_index": 56,
    "word_count": 263,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  },
  {
    "text": "(0.607) (0.653) (0.238) (0.252) t Firm-level fixed effect Yes Yes Yes Yes Year-nquarter fixed effect Yes Yes Yes Yes Observations 1,429 1,273 1,157 1,030 Adijusted R2 0.031 0.027 0.129 0.157 r p e r P 38 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d e w e i v e r r e e p Annexure t o n t n i r p e r P 39 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255 d e w e i v e r Figure A1: National Stock Exchange single stock op tions total turnover (in INR million) r e e p t o n t Source: CEIC (https://www.ceicdata.com/en) n i r p e r P 40 This preprint research paper has not been peer reviewed. Electronic copy available at: https://ssrn.com/abstract=4277255",
    "title": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets",
    "source_type": "pdf",
    "document_id": "2adf737cafee",
    "source_file": "Asymmetric Uncertainty Around Earnings Announcements Evidence from Options Markets.pdf",
    "section": "3. Research method d",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 41,
    "chunk_index": 57,
    "word_count": 144,
    "author": "Sobhesh Agarwalla",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3. Research method d (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20220206133600Z",
    "duration": null
  }
]