[
  {
    "text": "Black-Scholes Option Pricing Using Three Volatility Models: Moving Average, GARCH(1, 1), and Adaptive GARCH Bachelor Thesis by Heru Sataputera Na 260330 Informatics & Economics Erasmus University Rotterdam, Netherlands August 2003 copyright © Heru Sataputera Na 2003",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 0,
    "word_count": 36,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "I thank God for He has given me wisdom, strength, and time to be able to write this bachelor thesis. I am also very grateful to my supervisor, Dr. Ir. Associate Professor Jan van den Berg, for giving me the opportunity to evaluate this topic and especially for his time, inputs and very helpful comments during the writing process. Finally, I am really thankful for my family and friends who always supported and encouraged me along the way. 2 Table of Contents Abstract 4 1. Introduction 5 2. Option pricing and volatility models 2.1. Black-Scholes option pricing model 7 2.2. Volatility models 2.2.1. Moving Average model 9 2.2.2. GARCH (1,1) model 10 2.2.3. Adaptive GARCH 12 3. Experimental setup 3.1. Data description 13 3.2. Calculating option price 15 3.3. Performance Measure 16 4. Results 16 5. Discussion 18 6. Conclusion 21 References 23 Appendix A – Tables 24 Appendix B – Figures 31 3",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "Acknowledgements",
    "page_number": 2,
    "page_range": "p.2-3",
    "total_pages": 34,
    "chunk_index": 1,
    "word_count": 154,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Acknowledgements (p.2-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "Average model 9 2.2.2. GARCH (1,1) model 10 2.2.3. Adaptive GARCH 12 3. Experimental setup 3.1. Data description 13 3.2. Calculating option price 15 3.3. Performance Measure 16 4. Results 16 5. Discussion 18 6. Conclusion 21 References 23 Appendix A – Tables 24 Appendix B – Figures 31 3 This article evaluates the empirical performance of three different models to estimate the parameter volatility in the Black-Scholes option pricing model. The three models are: (a) Moving Average model, (b) GARCH(1,1) model, and (c) Adaptive GARCH model. I examine these models using two datasets: AEX index and ING GROEP CERTS asset. Performance is measured by minimizing the error between the model-determined price and the real market price. The Adaptive GARCH model and the Moving Average model outperform the GARCH(1,1) model. This might be due to the ability of the Adaptive GARCH model and the Moving Average model to update the information used in the maximization process daily. The Adaptive GARCH model outperforms the Moving Average model in the AEX data. Conversely, the Moving Average model does better when using the ING GROEP CERTS data. The underperformance of the Adaptive GARCH model via the ING data might be because of the extra volatility of the ING asset compared to the AEX index. 4",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "Abstract",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 2,
    "word_count": 212,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "the Moving Average model in the AEX data. Conversely, the Moving Average model does better when using the ING GROEP CERTS data. The underperformance of the Adaptive GARCH model via the ING data might be because of the extra volatility of the ING asset compared to the AEX index. 4",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "When Fischer Black and Myron Scholes developed the Black-Scholes model in the early 1970’s [1], it soon became a major breakthrough. Since then many traders use the Black-Scholes model as their premier model for pricing and hedging options. An important property of the Black-Scholes model is that all variables in the equation are not influenced by the risk preferences of investors. In particular, the analysis is based on a risk-neutral pricing approach1, which in return simplifies the analysis of derivatives. In the classic Black-Scholes model, the volatility is assumed to be constant. However, empirical research shows that the volatility of financial asset prices is following a stochastic process and varies through time. It means that while other properties of an option- such as exercise price, time to maturity, current price of underlying asset- can be observed directly from the market, the return volatility is the uncertainty factor in the Black-Scholes model. As volatility increases, the probability that stock price will raise or fall increases, which in response will also increase the value of both call and put options. Return volatility thus plays a major role in option pricing. Therefore, accurate measures and good forecasts of volatility are critical for option pricing theories as well as trading strategies. At present, there have been many models developed to determine volatility, and some of them act as alternatives or improvement from earlier models. The family of GARCH models is an example, starting from the autoregressive conditional heteroskedasticity (ARCH) model of Engle (1982) [4]. This paper will analyze the performance of option pricing by using three different models to estimate one-day-ahead volatility in the Black-Scholes model. The estimated volatility of each model is used as an input in the Black-Scholes option pricing formula to price 3-months-options daily during the lifetime of the options. The errors between the model-determined prices and the real price will then be computed. Smaller errors will denote a better performance. Call options from two underlying assets, namely the AEX 1 Explanation over the risk-neutral valuation is given in Hull [8], chapter 12.7. 5",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 4,
    "word_count": 343,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "during the lifetime of the options. The errors between the model-determined prices and the real price will then be computed. Smaller errors will denote a better performance. Call options from two underlying assets, namely the AEX 1 Explanation over the risk-neutral valuation is given in Hull [8], chapter 12.7. 5",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "index and the ING GROEP CERTS asset - one of the assets that construct the AEX index-, are chosen for this purpose. The first volatility model is the Moving Average model. In this model, daily volatility is determined by taking the mean of historical returns of underlying asset within a certain time horizon. The time horizon is set to be fixed. It is called the Moving Average volatility model because the average-based determined volatility moves with time. An assumption lying behind this model is that expected volatility today is given by the average of the returns in the past period. Estimated volatility is updated daily by recalculating the average of past returns within the same time horizon. The second model is chosen from the family of GARCH models, the GARCH(1,1) model. Although there are many more complicated GARCH models, GARCH(1,1) often performs as well as others. A study of comparing volatility models done by Hansen and Lunde [7], using GARCH(1,1) as benchmark, had as result that the best models do not provide a significantly better forecast than the GARCH(1,1) model. For this reason GARCH(1,1) is preferred here above all family of GARCH models. The volatility is computed from the observations of historical daily asset prices, taking both the conditional and unconditional variance into account in the estimation process. An alternative to the GARCH(1,1) model is also proposed to improve the performance of estimating volatility, which serves as our third model. Because the parameters of the GARCH model are maximized by means of historical data and then held constant afterward to forecast future volatility, it is possible that the information contained in the parameters differs from what will occur in the future. To avoid this, the parameters of the GARCH model are adjusted over time and updated daily through the option’s lifetime. Using this approach, the parameters are re-maximized on daily basis and expected to show an improvement in the performance of the model. The remainder of the paper is organized as follow: Section 2 explains the Black- Scholes model and the three models to forecast volatility. Section 3 describes the 6",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 6,
    "word_count": 351,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "Using this approach, the parameters are re-maximized on daily basis and expected to show an improvement in the performance of the model. The remainder of the paper is organized as follow: Section 2 explains the Black- Scholes model and the three models to forecast volatility. Section 3 describes the 6",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "experimental setup. Section 4 gives the results obtained from the experiment and Section 5 discusses the experiment’s outcomes. Finally, Section 6 concludes this thesis. 2. Option pricing and volatility models 2.1. Black-Scholes option pricing model A basic assumption of the Black-Scholes model is that the stock price is log- normally distributed. One of the attributes the lognormal distribution has is that stock price can never fall by more than 100 percent, but there is some small chance that it could raise by much more than 100 percent [3]. Several assumptions that lie behind the Black and Scholes model are [1]: a) Markets are efficient, which implies that people are unable to consistently predict the direction of the market or an individual asset. Stock prices are supposed to follow the continuous Itô process. To understand the Itô process, we have to know what a Markov process is. A Markov process is “a process where the observation at time t depends only on the previous observation.” An Itô process is simply a Markov process in continuous time2. b) Trading on securities is continuous and short selling is allowed. c) No commissions are charged to buy and sell options (no transaction costs or taxes). All securities are perfectly divisible. d) The stock pays no dividends during option’s life. European exercise terms are used; where the option can only be exercised on the expiration date. e) Risk free arbitrage opportunities are not available. f) The risk free interest rate (r) is known and remains constant for all maturities. Option prices can be determined by a risk neutral pricing approach. This valuation serves as the most important tool for the analysis of derivatives, because pricing a derivative that provides a payoff at one exact time in the future simply becomes taking the discounted value of the expected payoff from the option at its maturity. Using the risk-neutral valuation, the expected return (µ) from the underlying asset and the discount value is the risk-free interest rate (r). The Black-Scholes formulas for the prices of a 2 Further details over the Itô process are given in Hull [8], chapter 11. 7",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 8,
    "word_count": 354,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "the option at its maturity. Using the risk-neutral valuation, the expected return (µ) from the underlying asset and the discount value is the risk-free interest rate (r). The Black-Scholes formulas for the prices of a 2 Further details over the Itô process are given in Hull [8], chapter 11. 7",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "European call option on a non-dividend paying stock and a European put option on a non-dividend paying stock are given in the following equations [8]: c = S N(d )−Ke−rTN(d ) o 1 2 (1) p = Ke−rTN(−d )−S N(−d ) 2 o 1 The variables d and d are calculated by: 1 2 ln(S /K)+(r +σ2 /2)T d = 0 1 σ T (2) ln(S /K)+(r −σ2 /2)T d = 0 = d −σ T 2 1 σ T The variables c and p are the European call and European put price, S is the stock o price at time zero, K is the strike price of the option, r is the continuously compounded risk-free rate, σ is the stock price standard deviation, and T is the time to maturity of the option. N(x) is the cumulative probability distribution function for a standardized normal distribution, or the probability that a variable with a standard normal distribution, with zero mean and standard deviation is one, will be less than x. In the above formulas, standard deviation per annum is used instead of daily standard deviation as an input for the variable σ. Because we forecast the daily volatility, standard deviation per annum is obtained using: σ =σ × trading.days.per.year (4) per.annum daily The normal assumption in equity markets is that there are 252 trading days per year [8]. Nevertheless, recent findings show that volatility tends to vary over time and thus the assumption of constant volatility is unrealistic. Many models have been developed to relax the constant volatility assumption. One of them is GARCH option model, which assumes that the conditional volatility of stock prices depends on the past pricing errors. 8",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 10,
    "word_count": 282,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "that volatility tends to vary over time and thus the assumption of constant volatility is unrealistic. Many models have been developed to relax the constant volatility assumption. One of them is GARCH option model, which assumes that the conditional volatility of stock prices depends on the past pricing errors. 8",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "The first model to estimate volatility3 is based on historical returns from stock prices. Suppose that the value of the asset at the end of day i is S. Define u as the i i percentage change of asset price between the end of day i-1 and the end of day i, so that: S −S u = i i−1 (5) i S i−1 We can also define u as the continuously compounded return during day i (between the i end of day i-1 and the end of day i) by taking the logarithm of current asset value divided by value of the day before:  S  u =ln i  (6) i  S    i−1 The unbiased estimate of one-day volatility, using u of m days before today, is i 1 m σ2 = ∑(u −u)2 (7) n m−1 n−i i=1 In the equation above, ū is the mean of the u’s: i 1 m u = ∑u (8) m n−i i=1 A simplified approach to estimate volatility is given by [8]: 1 m σ2 = ∑u2 (9) n m n−i i=1 Variable u is estimated using the equation (5). Two modifications takes place in this i equation compared to the equation (7): ū is assumed to be zero and m-1 is replaced by m. The assumption of zero mean of u could be taken if the actual mean does give a value of i zero or almost zero. We will use the equation (9) to estimate volatility for the Moving Average model. 3 In this paper, we will use the term ‘volatility’ also for the variance rate. 9",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 12,
    "word_count": 274,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "mean of u could be taken if the actual mean does give a value of i zero or almost zero. We will use the equation (9) to estimate volatility for the Moving Average model. 3 In this paper, we will use the term ‘volatility’ also for the variance rate. 9",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "The amount of historical days used to estimate volatility should be determined carefully. Some expect that more data would lead to better precision, but data that are too old might be unrelated to predict the future. Closing prices from daily data over the last 90, 180 or even 252 days are often used. Another option is setting the amount of days, variable m in the equation (9), to be equal to the number of days to which the volatility is to be applied [8]. In another word, to value for instance a three month option, daily data for the last three months are used. We will also use this method in this paper. 2.2.2. GARCH(1,1) model Many models are developed that correspond to stochastic volatility process characteristic. One widely known model is the ARCH model, introduced by Engle (1982) [4]. This model is setting unconditional volatility constant, while allowing the conditional volatility to change over time. This conditional volatility is subsequently altered by past returns. The ARCH (q) model is specified as: q σ2 =ω+∑αu2 (10) n i n−i i=1 The variable ω is: ω=γ.V (11) L In this equation, ω > 0, and α ≥ 0 hold. V is the long-run average variance rate and γ is i L the weight assigned to V . Daily return (u) is calculated using the equation (5). The L i variable q is the order of dependency to past returns. This model differs with the Moving Average model in that it assigns more weight to recent data, and also a weight is assigned for the long-average variance rate (the unconditional volatility). An assumption underlying this model is that volatility is changing over time and there is tendency that a large error will be likely followed by a large error and a small error followed by a small error. The variable q is the period the conditional variance depends on. The larger the variable q, the longer is the period of volatility clustering. This characteristic coincides with the findings of Fama [6] and Mandelbrot [9] that the volatilities of financial series cluster. 10",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 14,
    "word_count": 350,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "error followed by a small error. The variable q is the period the conditional variance depends on. The larger the variable q, the longer is the period of volatility clustering. This characteristic coincides with the findings of Fama [6] and Mandelbrot [9] that the volatilities of financial series cluster. 10",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "A generalized approach of ARCH models was proposed by Bollerslev (1986) [2], and as well known as GARCH model. The GARCH (p, q) model is specified as: q p σ2 =ω+∑αu2 +∑βσ2 (12) n i n−i i n−i i=1 i=1 In this equation, ω > 0, α ≥ 0, and β ≥ 0 hold. i i As in ARCH models, variables p and q are the order of dependency. The distinction of GARCH model is that the conditional variance is specified not only as a linear function of past sample variances, but also including lagged conditional variances to enter the equation as well. This corresponds to some sort of adaptive learning mechanism. The simplest GARCH model is GARCH(1,1) model, which is expressed as: σ2 =ω+α⋅u2 +β⋅σ2 (13) i i−1 i−1 Although there are many GARCH models developed, GARCH(1,1) often performs as well as others4. GARCH(1,1) model is also the most popular among GARCH models. The weights assigned to both conditional and unconditional volatility - γ, α, and β - must sum to one. For a stable GARCH(1,1) process, α + β < 1 is required, otherwise the weight applied to the long-term variance is negative. An interesting empirical finding is that in financial series, particularly in daily series, α + β is often close to one. Engle and Bollerslev (1986) [5] introduced the IGARCH (Integrated GARCH) model in which the sum of α and β equals to 1. The parameters in the equation of the models are estimated using the maximum likelihood method. This method will choose the values of parameters by maximizing the probability of a set of observations occurring. Define v = σ2, which is the estimated i variance for day i. We assume that there are m observations, consisting of u , u … u and 1 2 m 4 For further details, see Hansen and Lunde [7]. 11",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 16,
    "word_count": 312,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "maximizing the probability of a set of observations occurring. Define v = σ2, which is the estimated i variance for day i. We assume that there are m observations, consisting of u , u … u and 1 2 m 4 For further details, see Hansen and Lunde [7]. 11",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "that the probability distribution of u is normal. The likelihood of the m observations is i [8]: m  1 −u2  ∏ exp i  (14)   i=1  2πv i  2v i  The best parameters are the ones that maximize this expression. Fortunately, maximizing an expression and maximizing the logarithm of the expression is equivalent. Taking logarithms of the expression in the equation (14), the log-likelihood is given by: m  1 u2 ∑ c+ −ln(v )− i  i=1  2  i v i  Ignoring constant multiplicative factors c and ½, we accordingly want to maximize: m  u2  ∑−ln(v )− i  (15)  i v  i=1 i  To find the maximum, we differentiate this formula to variable v and set the equation i result to zero. The maximum likelihood estimator of v is: i 1 m v = ∑u2 i m i i=1 2.2.3. Adaptive GARCH model The original GARCH(1,1) model estimates the parameters using maximum likelihood estimation given historical data. These parameters are then held constant and used to forecast future volatility by the equation (13) above. Hence, if historical returns of the last three months, for example, have a different structure compared to the returns in the next three months, then the maximized parameters might not be able to perform well to estimate daily volatility for the next three months. As an alternative, we can also define the parameters in GARCH as a function of time. It means that the parameters at day i are estimated by means of maximum likelihood just like the original GARCH(1,1) model, and subsequently these parameters are used to forecast volatility at day i. The difference is the parameters’ maximization is repeated daily during the lifetime of the options. The equation (13) is then adapted to: 12",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 18,
    "word_count": 307,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "day i are estimated by means of maximum likelihood just like the original GARCH(1,1) model, and subsequently these parameters are used to forecast volatility at day i. The difference is the parameters’ maximization is repeated daily during the lifetime of the options. The equation (13) is then adapted to: 12",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "σ2 =ω +α ⋅u2 +β ⋅σ2 (17) i i i i−1 i i−1 Parameters ω, α, β are changing over time. Assumption made is that the contributions of V , u2 and σ2 change over time and that they can be estimated over a fixed time L i-1 i-1 window. Because of daily maximization of the parameters, it is expected to obtain better maximized parameters which will be used to estimate future volatility on a daily basis. This model will be labeled ‘the Adaptive GARCH model’. 3. Experimental setup 3.1. Data description Data used for implementation consists of daily close prices from AEX index and ING GROEP CERTS from August 27, 2001 to February 15, 2002, which are collected for the purpose of estimating volatility; while daily close prices of AEX index and ING GROEP CERTS call options between November 19, 2001 and February 15 2002 are obtained to determine the performance result. We use this data based on the following consideration. First, the data is freely available at Erasmus University Rotterdam, acquired from DataStream. Second, AEX index is actively traded in the Euronext Amsterdam Exchange. AEX index is made up of the 25 most active securities in the Netherlands. While many studies have used indexes such as S&P 500 or Dow Jones as the experiment data because they are actively traded, we therefore also choose an index, AEX, to test the performance of the models. Third, the ING GROEP CERTS asset is one of the stocks included in the AEX index, which we shall use as our second underlying asset. A change in the return of the ING asset will have a fraction effect to the return of the AEX index. Hence, we are interested to see whether the performance result of each model is still the same when we use a stock in place of a market index. We choose for ING GROEP CERTS stock because the evolution of the price is rather similar with the AEX price during the period we are interested in. Figure 1A plots the movement of the AEX index levels in our sample, and Figure 1B plots the daily return for the period of 6 months. We can notice from Figure 1A that in 13",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 20,
    "word_count": 372,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "price is rather similar with the AEX price during the period we are interested in. Figure 1A plots the movement of the AEX index levels in our sample, and Figure 1B plots the daily return for the period of 6 months. We can notice from Figure 1A that in 13",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "the first 30 days, the index prices fall substantially, and afterward rise to in the neighborhood of € 500, and eventually vary within this region. The price of the index at the end of the period is 498.1. From Figure 1B, we can see that the volatility of AEX index changes over time. Meanwhile, Table 1 demonstrates that the returns have an average of 0.0011. The evolution of ING GROEP CERTS prices and the daily return are plotted in Figure 2A respectively Figure 2B. One can notice that the prices also exhibit a decreasing movement in the first 30 days, just like in the AEX index levels, except that these prices quickly increase to subsequently vary in the region of € 28. The price of the ING asset at the end of the period is 28.15. The daily return in Figure 2B shows that the volatility change is higher over time than the AEX volatility. The mean of return sequences is 0.0008, as we can read from Table 1. It is interesting to verify whether our implementation using the ING GROEP data will give the same result as when using the AEX index data. Therefore these two data are chosen to test the empirical performance of our models above. The options data have several attributes. In the first place, the time to expiration is 3 months. Second, we consider 5 options with different exercise prices for each underlying assets, whereas in- the-money, near at-the-money, and out of-the-money options are all included. For AEX index, we use options with exercise price 460, 480, 500, 520, and 540; while for ING asset, options with exercise price 26, 28, 30, 32, 34 are selected. We would like to see whether the performance of the option-pricing is constant on the options mentioned above. In Table 1, we give the actual means of the returns during the lifetime of the options. Because the mean values are always slightly above or below 0 and the average is approximately zero, we can then safely assume that the mean is zero. It is possible therefore to use the equation (9) above to estimate volatility. We also obtain the daily yield rates of Netherlands CBS Government Bond that matures within 9-10 years, during the life of the options. While there is no such thing as risk-free interest rate in the real world, we assume that the yield rates of long-term 14",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 22,
    "word_count": 402,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "above to estimate volatility. We also obtain the daily yield rates of Netherlands CBS Government Bond that matures within 9-10 years, during the life of the options. While there is no such thing as risk-free interest rate in the real world, we assume that the yield rates of long-term 14",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "government bond would serve as a good representative to fill in this parameter5. The interest rates of financial institutions are less appropriate because they are not risk-free rates. The reason is that financial institutions bear the risk to default. Even the most established institution bears this risk, though the amount is rather small. In contrast, government is very unlikely to default. The daily rates are then converted to continuously compounded rates. 3.2. Calculating option price In computing the spot volatility on a given day, the daily prices of each asset within 3-months prior to this day are used. Consequently, 6-months asset prices are obtained for this purpose, starting from August 27, 2001 until February 15, 2002. For the Moving Average model, we calculate the average of the last 3 months daily returns and apply this average of past squared returns of underlying asset as the obtained volatility to price an option. The average is updated daily and serves as the estimated volatility on the given day. This process is done through the options’ lifetime. For GARCH model, we use the daily returns of the first 3 months to estimate the parameters of the GARCH(1,1) equation, and afterward by means of these parameters to forecast volatility for the next 3 months. We make use of the maximum likelihood method to estimate the parameters that maximize the equation (15) above. We choose the Solver program in Microsoft Excel to implement the maximization process. Eventually for the Adaptive GARCH model, we estimate parameters and volatility each day through the lifetime of the options by means of assets’ daily returns of the last 3 months. Analogous to the Moving Average model, this process is also carried out on a daily basis starting from the first day the options come out to the market until the options expire. The next step to be taken is calculating the option price by means of the obtained volatility above. This would be a straightforward effort, since all inputs needed 5 We thank Mr. Rob Stevense for giving the advice that the long-term Netherlands Government Bond is usually used as input for the parameter ‘risk-free interest rate’ in the Black-Scholes model. 15",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 24,
    "word_count": 363,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "price by means of the obtained volatility above. This would be a straightforward effort, since all inputs needed 5 We thank Mr. Rob Stevense for giving the advice that the long-term Netherlands Government Bond is usually used as input for the parameter ‘risk-free interest rate’ in the Black-Scholes model. 15",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "for the parameters in the Black-Scholes formulas are already available within the data acquired. 3.3. Performance Measure The pricing error of the model for each option is expressed as: η =O −q (18) t t t Parameter η denotes the pricing error for an option at time t, Ot is the real market price of t this option, and q is the model-determined option price. t We implement this formula to all daily option prices calculated above. Because the error could be positive or negative, we make use of the square amount of the pricing errors. The Root Mean Squared Error (RMSE) is then the square root of the average of squared pricing errors of options in the whole sample, and given by: m ∑η2 i RMSE = i=1 (19) m Variable m is the lifetime of the options in the sample, or 3 months. The smaller the RMSE, the smaller pricing errors are, which subsequently means better price forecasting. Another possible measure is MAE (Mean Absolute Error), which stands for average of the absolute values of difference between the market option prices and model determined prices. In contrast with RMSE, MAE returns the mean from pricing errors that are given in absolute term. We will implement RMSE as our performance measure in this paper. 4. Results The parameters estimates of the GARCH(1,1) model appear in Table 2. Parameter α is 0.0346, β is 0.7664, and γ is 0.1990 for AEX, while the parameters α, β, and γ of the ING data are respectively 0, 0.8337, and 0.1663. Because the parameter α of ING is 0, it means that the past returns do not provide any weight to estimate the volatility in this model. 16",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 26,
    "word_count": 285,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "and γ is 0.1990 for AEX, while the parameters α, β, and γ of the ING data are respectively 0, 0.8337, and 0.1663. Because the parameter α of ING is 0, it means that the past returns do not provide any weight to estimate the volatility in this model. 16",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "The parameters of the Adaptive GARCH are given in Table 3. For AEX, the weights α, β, and γ begin by 0.0382, 0.7653, and 0.1965, respectively; and end by 0, 0.9938, and 0.0062, correspondingly. For ING, the weights α, β, and γ start by 0, 0.8288, and 0.1712, respectively; and finish by 0.0125, 0.9602, and 0.0273. The sum of α and β in the first ten days for AEX and the first twenty-one days for ING asset are less than 0.900. The evolution of the parameters is given in Figure 3A for the AEX index and Figure 3B for the ING GROEP CERTS asset. The sum of α, β, and γ is always 1. From Figure 3A we can see that the parameter α is going up first, and afterward decreasing to zero value at the end of the period. The parameter β declines in the beginning of the period and afterward rises gradually to almost reach value one, while the parameter γ rises in the first week and subsequently diminishes to slightly below the start value. Examining Figure 3B, we could notice a similar progress for the three parameters of the ING asset. The difference lies in that the parameter α is beginning with zero value, persisting in the first 10 days before rising and then decreasing to a value of 0.0125. As for the parameter β, it declines further than AEX in the first two weeks of December 2001, and suddenly increases significantly at 18th of December 2001, followed by a steady increase until the end of the period. The significant increase of the parameter β is matched by a significant decrease of the parameter γ at the same day, after stepping forward in the first month, and later on parameter γ evolves in the value range between 0.01 and 0.04, as we can read from Table 3. A worthy of note outcome is for the ING asset, in the first ten days, the Adaptive GARCH model estimates the parameter α as 0, which means that return from the preceding day during this period is not taken into account when calculating the volatility. The total squared differences between the real market prices and the model- determined prices and the RMSE (root mean squared error) are reported in Table 4 for the AEX index and Table 5 for the ING asset. For all the five options of the AEX index 17",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 28,
    "word_count": 402,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "calculating the volatility. The total squared differences between the real market prices and the model- determined prices and the RMSE (root mean squared error) are reported in Table 4 for the AEX index and Table 5 for the ING asset. For all the five options of the AEX index 17",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "considered, we could identify that the RMSE of the GARCH(1,1) model is larger than the RMSE of the Moving Average model, while the Adaptive GARCH model produces the smallest RMSE compared to the other two models. The RMSE of the Moving Average model is also better than the RMSE of the GARCH(1,1) model for the options of the ING asset; but we obtain a contrast result for the Adaptive GARCH model, where the RMSE is no longer superior. The Moving Average model generates the smallest RMSE, followed by the Adaptive GARCH model and the latest is GARCH(1,1) model. 5. Discussion In the last chapter we have seen that the Adaptive GARCH model gives the best estimation of the AEX option prices measured up to the Moving Average model, in the second place, and the GARCH(1,1) model in the third place. We obtain similar result for the GARCH(1,1) model using the ING options, creating the largest RMSE than the other two models. A possible explanation of the underperformance of the GARCH(1,1) model is that the historical returns used to maximize the parameters α, β, and γ differ a lot from the volatilities throughout the lifetime of the options. These parameters do not act as the appropriate weights for the equation of volatility estimates because we hold the parameters constant during the options’ lifetime. In the Moving Average model, volatility is calculated by the mean of the last 3- months returns, and this calculation is updated daily. The oldest return is removed and replaced with the newest return, where new information is taken into account in the volatility estimates. The Adaptive GARCH model follows this process by removing the earliest return with the latest return and uses this daily-updated-set of returns to re- maximize its parameters. This process is also repeated daily. We have obtained contrast results for the Moving Average model and the Adaptive GARCH model. The Adaptive GARCH is superior to the Moving Average model in estimating the AEX option prices, but the other way around in estimating the ING option prices. There are three outcomes that might explain why the Adaptive GARCH model does not perform well in estimating the volatility of the ING asset. First, an empirical 18",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 30,
    "word_count": 370,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "to the Moving Average model in estimating the AEX option prices, but the other way around in estimating the ING option prices. There are three outcomes that might explain why the Adaptive GARCH model does not perform well in estimating the volatility of the ING asset. First, an empirical 18",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "finding in financial series (as said before), particularly in daily series, α + β is often close to one. For AEX index, this characteristic happens after the 11th day of the options’ lifetime, where the sum of the parameters α and β rises from 0.8254 to 0.9826 after formerly generates value only in the range of 0.7663 and 0.8254. The sum then diverges itself to a value close to one, between 0.9695 and 0.9938. In contrast, the sum of α and β of the ING asset fluctuates in lower values than the sum of α and β of the AEX index. The sum alters in the first 21 days between 0.6112 and 0.8288 along with a rising in the 21st day (at December 18, 2001) from 0.6359 to 0.9875 and varies close to one, between 0.9534 and 0.9886. This means that the duration of the sum of α + β not close to one is longer in the volatility estimates of ING than AEX, which in turns might affect the performance of the model. Second, the parameter α of the AEX is estimated as zero for the last 3 days of the period. On the contrary, the parameter α of the ING is estimated as zero for a longer period, explicitly the first 10 days. The zero values of the parameter α mean that the previous-day return is not taken into account when estimating volatility. This condition might also affect the performance result of the model since the effect of this condition is heavier for the ING option prices estimates because the period is longer. Third, we can compare the estimated volatility of the three models with the implied volatility (volatility acquired from option real prices). These data are given in Figure 4A for the AEX index and Figure 4B for the ING asset. The implied volatility is obtained by taking the average of the implied volatilities of the individual call options each day throughout the lifetime of the options. We can notice from Figure 4A that the estimated volatility of the GARCH(1,1) model is far from the implied volatility. The volatility of the Moving Average model evolves progressively while the volatility of the Adaptive GARCH model responds quickly after 3 weeks and then evolves near by the implied volatility. In the last 2 weeks the implied volatility rises again and this is the only period the volatility of the Moving Average model is closer to the implied volatility than the volatility of the Adaptive GARCH model. Generally, during the 3-months period, the forecasted volatility of the Adaptive GARCH is closer to the implied volatility than the 19",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 32,
    "word_count": 438,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "rises again and this is the only period the volatility of the Moving Average model is closer to the implied volatility than the volatility of the Adaptive GARCH model. Generally, during the 3-months period, the forecasted volatility of the Adaptive GARCH is closer to the implied volatility than the 19",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "other two models. It clarifies why the Adaptive GARCH model provides the best volatility estimates in the AEX index. In Figure 4B, we can see that the estimated volatility of the GARCH(1,1) model is also far from the implied volatility. The volatility of the Moving Average model is closer to the implied volatility than the volatility of the Adaptive GARCH model in the first month, but in the second month the volatility of the Adaptive GARCH model is closer. In the third month, the first 20 days the volatilities of both models are more or less near by the implied volatility. In the following 10 days, the implied volatility rises significantly to a value of 0.0033 (above the volatility estimates of the GARCH(1,1) model – 0.0030), and the volatility of the Moving Average is closer to the implied volatility matched up to the volatility of the Adaptive GARCH.. The volatility estimates of the Moving Average model is in total amount of days closer to the implied volatility than the volatility estimates of the Adaptive GARCH model. This condition also clarifies why the Moving Average model has a better (smaller) RMSE than the Adaptive GARCH model, though the difference is small. Identical to what happens in the parameter estimates, the volatility of the Adaptive GARCH model is suddenly improved at 18th of December 2001. An explanation of this outcome is that the returns of the first month (August 27th, 2001 to September 27th, 2001) have left the basket of returns used to maximize the parameters. These returns do not represent as the proper estimation of the volatility for the rest of the period, because the movement is quite different with the rest. This leads to an improvement in the maximized parameters which consecutively improves the estimated volatility. In the AEX data, the returns of the first month have a similar shape as the returns of the ING data, except the volatility of the AEX returns is less than the volatility of the ING returns. As we can see from Figure 4A, the estimated volatility of the AEX data also improves significantly in the first period, though the improvement is smoother. 20",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 34,
    "word_count": 360,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "as the returns of the ING data, except the volatility of the AEX returns is less than the volatility of the ING returns. As we can see from Figure 4A, the estimated volatility of the AEX data also improves significantly in the first period, though the improvement is smoother. 20",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "2.2.1. Moving Average model",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2.2.1. Moving Average model (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "The empirical performance of the Black-Scholes option pricing model on the AEX options and the ING GROEP CERTS options, using three models to estimate volatility, has been evaluated in this paper. The three models chosen to forecast volatility are the Moving Average model, the GARCH(1,1) model and the Adaptive GARCH model. The Adaptive GARCH model outperforms the Moving Average model, in the second place, and the GARCH(1,1) model while pricing the AEX options. We obtain a different result when examining the ING option prices estimates. The GARCH(1,1) still underperforms the other two models, but the Moving Average model is giving a better result compared to the Adaptive GARCH model. We have found from this experiment that the Adaptive GARCH model and the Moving Average model have performed better than the GARCH(1,1) model to estimate daily volatility during the lifetime of the 3-months option. The performance result of the GARCH(1,1) model depends on the past returns used to maximize the parameters in the equation of volatility estimates. The poor performance of the GARCH(1,1) model is caused by the training data (in this case the first 3-months period of returns used to maximize the parameters) having a different evolution compared to the test data (the next 3-months period – the options’ lifetime). Because we hold the parameter constant during the volatility estimates, these parameters do not represent as the suitable weights for the equation and therefore do not able to forecast volatility accurately. Nevertheless, based on this experiment we are not able to conclude whether the Adaptive GARCH model is better in estimating volatility than the Moving Average model. We have indeed found that the underperformance of the Adaptive GARCH model in estimating the volatility of the ING asset might be due to the extra volatility this asset has contrast to the AEX index. This extra volatility can be identified by comparing the returns of the AEX index and the ING asset in Figure 1B and Figure 2B. 21",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "6. Conclusion",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 36,
    "word_count": 327,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Conclusion (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "GARCH model in estimating the volatility of the ING asset might be due to the extra volatility this asset has contrast to the AEX index. This extra volatility can be identified by comparing the returns of the AEX index and the ING asset in Figure 1B and Figure 2B. 21 Consequently, several adjustments could be made to improve the performance of the Adaptive GARCH model for the ING data. In the first instance, historical data with a longer period could be used to maximize the parameters of the equation, for example 6 months, 1 year or even later. Due to possible shocks in a short-period history data that in response might not represent the characteristic of the development of asset prices as a whole, the use of a longer-term data might result in a better analysis. Other possible adjustment is by implementing an alternative algorithm to calculate the maximum likelihood function, for example the Levenberg-Marquardt algorithm. In this paper we have used Solver algorithm in Microsoft Excel to compute the likelihood function. Finally, it might be necessary to do this experiment on the other 24 assets that compose the AEX index in order to be able to take a valid conclusion. We leave this for future research. 22",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "6. Conclusion",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 37,
    "word_count": 208,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "6. Conclusion (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "paper we have used Solver algorithm in Microsoft Excel to compute the likelihood function. Finally, it might be necessary to do this experiment on the other 24 assets that compose the AEX index in order to be able to take a valid conclusion. We leave this for future research. 22 1. Black, F., and Scholes, M. (1973): “The Pricing of Options and Corporate Liabilities,” Journal of Political Economy, 81, 637-659. 2. Bollerslev, T. (1986): “Generalized Autoregressive Conditional Heteroscedasticity,” Journal of Econometrics, 31, 307–327. 3. Brealey, R. A., and Myers, S. C. (2003). Principles of Corporate Finance. Seventh Edition. Chapter 21. 4. Engle, R. F. (1982): “Autoregressive Conditional Heteroscedasticity with Estimates of the Variance of UK Inflation,” Econometrica, 50, 987-1008. 5. Engle, R. F. and Bollerslev, T. (1986): “Modelling the Persistence of Conditional Variances”, Econometrics Reviews, 5, 1-50. 6. Fama, E. (1965): “The behavior of stock market prices,” Journal of Business, 38, 34- 105. 7. Hansen, P.R., and Lunde, A. (2001): “A Forecast Comparison of Volatility Models: Does Anything Beat a GARCH(1,1)?” Working Paper No. 01-04, Brown University, Department of Economics. 8. Hull, J.C. (2003). Options, Futures, and Other Derivatives. Fifth Edition. Chapter 5, 11, 12, 17. 9. Mandelbrot, B. (1966): “Forecast of future prices, unbiased markets, and martingale models,” Journal of Business, 39, 241-255. 23",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 34,
    "chunk_index": 38,
    "word_count": 215,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "Models: Does Anything Beat a GARCH(1,1)?” Working Paper No. 01-04, Brown University, Department of Economics. 8. Hull, J.C. (2003). Options, Futures, and Other Derivatives. Fifth Edition. Chapter 5, 11, 12, 17. 9. Mandelbrot, B. (1966): “Forecast of future prices, unbiased markets, and martingale models,” Journal of Business, 39, 241-255. 23 Appendix A – Tables Table 1 Actual Means of Returns (u) of the AEX Index and the ING GROEP CERTS Asset i The actual means of the returns of the last 3 months, calculated daily during the options’ lifetime are given below. DATE AEX ING DATE AEX ING 19/11/2001 -0.0009 0.0008 7/1/2002 0.0016 0.0010 20/11/2001 -0.0004 0.0008 8/1/2002 0.0011 0.0010 21/11/2001 -0.0007 0.0008 9/1/2002 0.0007 0.0010 22/11/2001 -0.0006 0.0009 10/1/2002 0.0010 0.0010 23/11/2001 -0.0002 0.0009 11/1/2002 0.0016 0.0010 26/11/2001 0.0000 0.0009 14/1/2002 0.0018 0.0010 27/11/2001 -0.0001 0.0009 15/1/2002 0.0010 0.0010 28/11/2001 -0.0002 0.0009 16/1/2002 0.0016 0.0010 29/11/2001 0.0000 0.0009 17/1/2002 0.0017 0.0010 30/11/2001 0.0005 0.0009 18/1/2002 0.0016 0.0010 3/12/2001 0.0007 0.0009 21/1/2002 0.0009 0.0010 4/12/2001 0.0017 0.0009 22/1/2002 0.0010 0.0010 5/12/2001 0.0017 0.0009 23/1/2002 0.0013 0.0010 6/12/2001 0.0019 0.0009 24/1/2002 0.0008 0.0009 7/12/2001 0.0031 0.0009 25/1/2002 0.0015 0.0009 10/12/2001 0.0025 0.0009 28/1/2002 0.0019 0.0009 11/12/2001 0.0021 0.0009 29/1/2002 0.0017 0.0008 12/12/2001 0.0025 0.0009 30/1/2002 0.0014 0.0008 13/12/2001 0.0031 0.0009 31/1/2002 0.0010 0.0007 14/12/2001 0.0033 0.0009 1/2/2002 0.0007 0.0007 17/12/2001 0.0023 0.0009 4/2/2002 0.0008 0.0006 18/12/2001 0.0024 0.0009 5/2/2002 0.0003 0.0006 19/12/2001 0.0022 0.0009 6/2/2002 -0.0003 0.0005 20/12/2001 0.0022 0.0010 7/2/2002 -0.0002 0.0005 21/12/2001 0.0012 0.0010 8/2/2002 0.0004 0.0005 24/12/2001 0.0023 0.0010 11/2/2002 -0.0004 0.0004 27/12/2001 0.0020 0.0010 12/2/2002 -0.0001 0.0004 28/12/2001 0.0025 0.0010 13/2/2002 -0.0002 0.0003 2/1/2002 0.0018 0.0010 14/2/2002 -0.0003 0.0003 3/1/2002 0.0016 0.0010 15/2/2002 -0.0002 0.0003 4/1/2002 0.0018 0.0010 Average 0.0011 0.0008 24",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 39,
    "word_count": 285,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "0.0005 20/12/2001 0.0022 0.0010 7/2/2002 -0.0002 0.0005 21/12/2001 0.0012 0.0010 8/2/2002 0.0004 0.0005 24/12/2001 0.0023 0.0010 11/2/2002 -0.0004 0.0004 27/12/2001 0.0020 0.0010 12/2/2002 -0.0001 0.0004 28/12/2001 0.0025 0.0010 13/2/2002 -0.0002 0.0003 2/1/2002 0.0018 0.0010 14/2/2002 -0.0003 0.0003 3/1/2002 0.0016 0.0010 15/2/2002 -0.0002 0.0003 4/1/2002 0.0018 0.0010 Average 0.0011 0.0008 24 Table 2 Maximum Likelihood Estimation of the GARCH(1,1) model for the Whole Sample The estimated parameters of the GARCH(1,1) model and the long-term variance rates of the AEX Index and the ING GROEP CERTS asset are reported. • AEX index VL ω γ α β α + β 7.7646E-04 1.5450E-04 0.1990 0.0346 0.7664 0.8010 • ING GROEP CERTS asset VL ω γ α β α + β 3.0308E-03 5.0404E-04 0.1663 0.0000 0.8337 0.8337 25",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 34,
    "chunk_index": 40,
    "word_count": 124,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "rates of the AEX Index and the ING GROEP CERTS asset are reported. • AEX index VL ω γ α β α + β 7.7646E-04 1.5450E-04 0.1990 0.0346 0.7664 0.8010 • ING GROEP CERTS asset VL ω γ α β α + β 3.0308E-03 5.0404E-04 0.1663 0.0000 0.8337 0.8337 25 Table 3 Maximum Likelihood Estimation of the Adaptive GARCH model during the lifetime of the options The estimated parameters of the Adaptive GARCH model and the long-term variance rates of the AEX Index and the ING GROEP CERTS asset on each day during the lifetime of the options are displayed. • AEX Index AEX VL ω γ α β α + β 19/11/2001 7.6572E-04 1.5047E-04 0.1965 0.0382 0.7653 0.8035 20/11/2001 7.5269E-04 1.4504E-04 0.1927 0.0436 0.7637 0.8073 21/11/2001 7.4367E-04 1.4357E-04 0.1931 0.0475 0.7595 0.8069 22/11/2001 7.3544E-04 1.5290E-04 0.2079 0.0487 0.7434 0.7921 23/11/2001 7.3044E-04 1.6132E-04 0.2209 0.0493 0.7298 0.7791 26/11/2001 7.2475E-04 1.6936E-04 0.2337 0.0510 0.7154 0.7663 27/11/2001 7.1768E-04 1.6351E-04 0.2278 0.0596 0.7126 0.7722 28/11/2001 7.1191E-04 1.4873E-04 0.2089 0.0701 0.7210 0.7911 29/11/2001 7.0048E-04 1.2809E-04 0.1829 0.0826 0.7345 0.8171 30/11/2001 7.0390E-04 1.2291E-04 0.1746 0.0949 0.7305 0.8254 3/12/2001 5.2335E-05 9.0877E-07 0.0174 0.1373 0.8453 0.9826 4/12/2001 2.6679E-05 4.0485E-07 0.0152 0.1556 0.8292 0.9848 5/12/2001 2.5461E-05 3.5066E-07 0.0138 0.1708 0.8155 0.9862 6/12/2001 1.5075E-04 4.3045E-06 0.0286 0.0727 0.8988 0.9714 7/12/2001 6.9137E-06 1.4938E-07 0.0216 0.0699 0.9085 0.9784 10/12/2001 6.9137E-06 1.4938E-07 0.0216 0.0699 0.9085 0.9784 11/12/2001 5.0340E-05 1.0642E-06 0.0211 0.0729 0.9059 0.9789 12/12/2001 3.8771E-05 9.7116E-07 0.0250 0.0650 0.9100 0.9750 13/12/2001 3.8771E-05 9.7116E-07 0.0250 0.0650 0.9100 0.9750 14/12/2001 3.0084E-05 6.7542E-07 0.0225 0.0371 0.9404 0.9775 17/12/2001 2.2280E-05 5.4494E-07 0.0245 0.0448 0.9308 0.9755 18/12/2001 1.6783E-04 5.1120E-06 0.0305 0.0394 0.9301 0.9695 19/12/2001 1.3368E-04 3.7917E-06 0.0284 0.0439 0.9277 0.9716 20/12/2001 1.3962E-05 2.8609E-07 0.0205 0.0350 0.9445 0.9795 21/12/2001 6.8300E-05 1.7017E-06 0.0249 0.0325 0.9425 0.9751 24/12/2001 1.1761E-04 2.7991E-06 0.0238 0.0278 0.9484 0.9762 27/12/2001 5.2499E-05 1.0728E-06 0.0204 0.0303 0.9493 0.9796 28/12/2001 1.8172E-05 2.6434E-07 0.0145 0.0181 0.9673 0.9855 2/1/2002 3.2457E-05 6.0595E-07 0.0187 0.0258 0.9555 0.9813 3/1/2002 6.2938E-06 1.0082E-07 0.0160 0.0251 0.9588 0.9840 4/1/2002 7.7324E-05 1.6322E-06 0.0211 0.0294 0.9495 0.9789 7/1/2002 3.9489E-05 7.5187E-07 0.0190 0.0277 0.9533 0.9810 8/1/2002 1.5848E-05 3.0416E-07 0.0192 0.0336 0.9472 0.9808 9/1/2002 1.3592E-05 2.6971E-07 0.0198 0.0433 0.9368 0.9802 10/1/2002 4.0607E-05 9.1357E-07 0.0225 0.0270 0.9505 0.9775 26",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 41,
    "word_count": 358,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "2/1/2002 3.2457E-05 6.0595E-07 0.0187 0.0258 0.9555 0.9813 3/1/2002 6.2938E-06 1.0082E-07 0.0160 0.0251 0.9588 0.9840 4/1/2002 7.7324E-05 1.6322E-06 0.0211 0.0294 0.9495 0.9789 7/1/2002 3.9489E-05 7.5187E-07 0.0190 0.0277 0.9533 0.9810 8/1/2002 1.5848E-05 3.0416E-07 0.0192 0.0336 0.9472 0.9808 9/1/2002 1.3592E-05 2.6971E-07 0.0198 0.0433 0.9368 0.9802 10/1/2002 4.0607E-05 9.1357E-07 0.0225 0.0270 0.9505 0.9775 26",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 42,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "11/1/2002 3.6309E-05 8.0311E-07 0.0221 0.0296 0.9483 0.9779 14/1/2002 2.9931E-05 6.3371E-07 0.0212 0.0276 0.9512 0.9788 15/1/2002 1.1140E-04 2.9430E-06 0.0264 0.0236 0.9500 0.9736 16/1/2002 1.3165E-05 1.4317E-07 0.0109 0.0099 0.9792 0.9891 17/1/2002 1.3525E-05 2.3601E-07 0.0175 0.0234 0.9591 0.9825 18/1/2002 1.6733E-05 2.5775E-07 0.0154 0.0156 0.9690 0.9846 21/1/2002 9.9341E-06 1.7549E-07 0.0177 0.0238 0.9586 0.9823 22/1/2002 1.9035E-05 3.8018E-07 0.0200 0.0304 0.9497 0.9800 23/1/2002 6.6753E-06 1.3178E-07 0.0197 0.0256 0.9546 0.9803 24/1/2002 4.0142E-06 8.5878E-08 0.0214 0.0351 0.9435 0.9786 25/1/2002 3.6379E-05 5.7551E-07 0.0158 0.0119 0.9723 0.9842 28/1/2002 8.5827E-06 1.5381E-07 0.0179 0.0216 0.9605 0.9821 29/1/2002 3.4045E-05 6.9711E-07 0.0205 0.0245 0.9551 0.9795 30/1/2002 1.6203E-05 3.1182E-07 0.0192 0.0258 0.9550 0.9808 31/1/2002 2.9254E-05 5.2999E-07 0.0181 0.0169 0.9650 0.9819 1/2/2002 8.5301E-06 1.5142E-07 0.0178 0.0233 0.9590 0.9822 4/2/2002 3.0246E-05 6.1760E-07 0.0204 0.0252 0.9544 0.9796 5/2/2002 2.9284E-05 6.1327E-07 0.0209 0.0268 0.9523 0.9791 6/2/2002 5.6134E-05 9.8579E-07 0.0176 0.0107 0.9718 0.9824 7/2/2002 7.5533E-06 1.1075E-07 0.0147 0.0122 0.9731 0.9853 8/2/2002 3.0494E-05 5.3839E-07 0.0177 0.0123 0.9700 0.9823 11/2/2002 6.8832E-05 6.2688E-07 0.0091 0.0001 0.9908 0.9909 12/2/2002 7.3231E-05 6.5836E-07 0.0090 0.0001 0.9909 0.9910 13/2/2002 1.3375E-05 8.2965E-08 0.0062 0.0000 0.9938 0.9938 14/2/2002 3.3805E-05 2.1983E-07 0.0065 0.0000 0.9935 0.9935 15/2/2002 1.6514E-05 1.0314E-07 0.0062 0.0000 0.9938 0.9938 • ING GROEP CERTS ING VL ω γ α β α + β 19/11/2001 2.9694E-03 5.0834E-04 0.1712 0.0000 0.8288 0.8288 20/11/2001 2.8944E-03 5.1306E-04 0.1773 0.0000 0.8227 0.8227 21/11/2001 2.8532E-03 5.0667E-04 0.1776 0.0000 0.8224 0.8224 22/11/2001 2.7828E-03 5.4961E-04 0.1975 0.0000 0.8025 0.8025 23/11/2001 2.7349E-03 5.8794E-04 0.2150 0.0000 0.7850 0.7850 26/11/2001 2.7501E-03 6.4055E-04 0.2329 0.0000 0.7671 0.7671 27/11/2001 2.7356E-03 6.7651E-04 0.2473 0.0000 0.7527 0.7527 28/11/2001 2.7389E-03 7.0324E-04 0.2568 0.0000 0.7432 0.7432 29/11/2001 2.7492E-03 7.0048E-04 0.2548 0.0000 0.7452 0.7452 30/11/2001 2.7375E-03 7.3457E-04 0.2683 0.0000 0.7317 0.7317 3/12/2001 2.4642E-03 5.4229E-04 0.2201 0.0135 0.7664 0.7799 4/12/2001 2.4213E-03 5.3604E-04 0.2214 0.0201 0.7585 0.7786 5/12/2001 2.4213E-03 5.3592E-04 0.2213 0.0201 0.7585 0.7787 6/12/2001 2.2784E-03 5.1043E-04 0.2240 0.0293 0.7467 0.7760 7/12/2001 2.2451E-03 5.9016E-04 0.2629 0.0377 0.6995 0.7371 10/12/2001 2.2300E-03 6.7669E-04 0.3035 0.0450 0.6516 0.6965 11/12/2001 2.2274E-03 8.0414E-04 0.3610 0.0518 0.5872 0.6390 12/12/2001 2.2113E-03 8.3735E-04 0.3787 0.0575 0.5638 0.6213 27",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 43,
    "word_count": 322,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "4/12/2001 2.4213E-03 5.3604E-04 0.2214 0.0201 0.7585 0.7786 5/12/2001 2.4213E-03 5.3592E-04 0.2213 0.0201 0.7585 0.7787 6/12/2001 2.2784E-03 5.1043E-04 0.2240 0.0293 0.7467 0.7760 7/12/2001 2.2451E-03 5.9016E-04 0.2629 0.0377 0.6995 0.7371 10/12/2001 2.2300E-03 6.7669E-04 0.3035 0.0450 0.6516 0.6965 11/12/2001 2.2274E-03 8.0414E-04 0.3610 0.0518 0.5872 0.6390 12/12/2001 2.2113E-03 8.3735E-04 0.3787 0.0575 0.5638 0.6213 27",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 44,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "13/12/2001 2.2122E-03 8.6015E-04 0.3888 0.0592 0.5520 0.6112 14/12/2001 2.1658E-03 7.8191E-04 0.3610 0.0666 0.5724 0.6390 17/12/2001 2.1694E-03 7.8996E-04 0.3641 0.0757 0.5602 0.6359 18/12/2001 2.4978E-05 3.1262E-07 0.0125 0.1004 0.8870 0.9875 19/12/2001 8.1162E-06 9.2822E-08 0.0114 0.0996 0.8889 0.9886 20/12/2001 2.9026E-05 3.3778E-07 0.0116 0.1051 0.8833 0.9884 21/12/2001 3.6505E-04 6.0762E-06 0.0166 0.1139 0.8694 0.9834 24/12/2001 5.3296E-05 9.7397E-07 0.0183 0.0860 0.8957 0.9817 27/12/2001 3.7635E-05 7.0973E-07 0.0189 0.0893 0.8919 0.9811 28/12/2001 0.0000E+00 0.0000E+00 0.0153 0.0860 0.8986 0.9847 2/1/2002 4.5896E-05 9.8053E-07 0.0214 0.0734 0.9052 0.9786 3/1/2002 6.1976E-05 1.0685E-06 0.0172 0.0543 0.9285 0.9828 4/1/2002 1.9456E-04 5.2955E-06 0.0272 0.0520 0.9208 0.9728 7/1/2002 1.5544E-04 3.9693E-06 0.0255 0.0445 0.9300 0.9745 8/1/2002 4.0130E-04 1.0916E-05 0.0272 0.0390 0.9338 0.9728 9/1/2002 3.1170E-04 7.8780E-06 0.0253 0.0429 0.9319 0.9747 10/1/2002 1.9608E-04 4.6480E-06 0.0237 0.0440 0.9323 0.9763 11/1/2002 5.0940E-05 1.0758E-06 0.0211 0.0428 0.9360 0.9789 14/1/2002 1.9096E-04 4.2955E-06 0.0225 0.0395 0.9380 0.9775 15/1/2002 2.9618E-04 7.4029E-06 0.0250 0.0437 0.9313 0.9750 16/1/2002 6.0571E-04 2.0039E-05 0.0331 0.0415 0.9254 0.9669 17/1/2002 5.4920E-04 1.6532E-05 0.0301 0.0448 0.9251 0.9699 18/1/2002 3.7026E-04 9.4940E-06 0.0256 0.0422 0.9322 0.9744 21/1/2002 5.1295E-04 1.3085E-05 0.0255 0.0524 0.9221 0.9745 22/1/2002 4.2211E-04 1.0128E-05 0.0240 0.0514 0.9246 0.9760 23/1/2002 3.1262E-04 6.5893E-06 0.0211 0.0527 0.9262 0.9789 24/1/2002 3.1262E-04 6.5893E-06 0.0211 0.0527 0.9262 0.9789 25/1/2002 8.6753E-05 1.5001E-06 0.0173 0.0135 0.9692 0.9827 28/1/2002 3.5962E-04 1.3778E-05 0.0383 0.0193 0.9424 0.9617 29/1/2002 2.0949E-04 5.2335E-06 0.0250 0.0156 0.9594 0.9750 30/1/2002 7.2620E-05 1.0919E-06 0.0150 0.0129 0.9721 0.9850 31/1/2002 5.0917E-05 7.6162E-07 0.0150 0.0131 0.9719 0.9850 1/2/2002 5.0917E-05 7.6162E-07 0.0150 0.0131 0.9719 0.9850 4/2/2002 4.8315E-04 2.2533E-05 0.0466 0.0135 0.9399 0.9534 5/2/2002 4.4565E-04 2.0458E-05 0.0459 0.0173 0.9367 0.9541 6/2/2002 3.9532E-04 1.4888E-05 0.0377 0.0152 0.9472 0.9623 7/2/2002 4.8607E-05 6.5621E-07 0.0135 0.0100 0.9765 0.9865 8/2/2002 4.5094E-06 5.9178E-08 0.0131 0.0108 0.9761 0.9869 11/2/2002 3.7603E-04 6.8210E-06 0.0181 0.0068 0.9750 0.9819 12/2/2002 4.4337E-04 1.6935E-05 0.0382 0.0114 0.9504 0.9618 13/2/2002 3.8674E-04 1.2234E-05 0.0316 0.0114 0.9569 0.9684 14/2/2002 3.4448E-04 1.0072E-05 0.0292 0.0135 0.9573 0.9708 15/2/2002 3.2759E-04 8.9389E-06 0.0273 0.0125 0.9602 0.9727 28",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 45,
    "word_count": 302,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "7/2/2002 4.8607E-05 6.5621E-07 0.0135 0.0100 0.9765 0.9865 8/2/2002 4.5094E-06 5.9178E-08 0.0131 0.0108 0.9761 0.9869 11/2/2002 3.7603E-04 6.8210E-06 0.0181 0.0068 0.9750 0.9819 12/2/2002 4.4337E-04 1.6935E-05 0.0382 0.0114 0.9504 0.9618 13/2/2002 3.8674E-04 1.2234E-05 0.0316 0.0114 0.9569 0.9684 14/2/2002 3.4448E-04 1.0072E-05 0.0292 0.0135 0.9573 0.9708 15/2/2002 3.2759E-04 8.9389E-06 0.0273 0.0125 0.9602 0.9727 28 Table 4 Aggregate Squared Loss and Pricing Errors of the Black-Scholes Option Pricing for the AEX Index The sum of squared differences between the market option prices and the model- determined prices for each option is given under ‘Total Squared Loss’. The RMSE (root mean squared error) of the three models is also reported. Exercise Price Moving Average GARCH(1,1) Adaptive GARCH Total Squared Total Squared Total Squared Loss 1122.7235 Loss 2684.8085 Loss 1107.5599 460 RMSE 4.3257 RMSE 6.6893 RMSE 4.2964 Total Squared Total Squared Total Squared Loss 2239.8875 Loss 5576.7700 Loss 1470.9104 480 RMSE 6.1099 RMSE 9.6409 RMSE 4.9513 Total Squared Total Squared Total Squared Loss 3369.8176 Loss 8120.6981 Loss 1648.7049 500 RMSE 7.4942 RMSE 11.6338 RMSE 5.2420 Total Squared Total Squared Total Squared Loss 5114.0224 Loss 8478.1884 Loss 2979.5121 520 RMSE 9.2322 RMSE 11.8871 RMSE 7.0469 Total Squared Total Squared Total Squared Loss 3915.4690 Loss 6992.3757 Loss 1865.2816 540 RMSE 8.0782 RMSE 10.7954 RMSE 5.5757 29",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 34,
    "chunk_index": 46,
    "word_count": 207,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "Loss 8120.6981 Loss 1648.7049 500 RMSE 7.4942 RMSE 11.6338 RMSE 5.2420 Total Squared Total Squared Total Squared Loss 5114.0224 Loss 8478.1884 Loss 2979.5121 520 RMSE 9.2322 RMSE 11.8871 RMSE 7.0469 Total Squared Total Squared Total Squared Loss 3915.4690 Loss 6992.3757 Loss 1865.2816 540 RMSE 8.0782 RMSE 10.7954 RMSE 5.5757 29 Table 5 Aggregate Squared Loss and Pricing Errors of the Black-Scholes Option Pricing for the ING GROEP CERTS asset The sum of squared differences between the market option prices and the model- determined prices for each option is given under ‘Total Squared Loss’. The RMSE (root mean squared error) of the three models is also reported. Exercise Price Moving Average GARCH(1,1) Adaptive GARCH Total Squared Total Squared Total Squared Loss 30.5696 Loss 141.0968 Loss 47.9347 26 RMSE 0.7138 RMSE 1.5335 RMSE 0.8938 Total Squared Total Squared Total Squared Loss 54.8849 Loss 214.2465 Loss 78.3715 28 RMSE 0.9564 RMSE 1.8896 RMSE 1.1429 Total Squared Total Squared Total Squared Loss 72.2765 Loss 243.4650 Loss 101.0783 30 RMSE 1.0975 RMSE 2.0144 RMSE 1.2979 Total Squared Total Squared Total Squared Loss 73.9135 Loss 216.4026 Loss 107.7862 32 RMSE 1.1099 RMSE 1.8991 RMSE 1.3403 Total Squared Total Squared Total Squared Loss 61.3883 Loss 166.3522 Loss 94.3840 34 RMSE 1.0115 RMSE 1.6651 RMSE 1.2542 30",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 30,
    "page_range": "p.30-31",
    "total_pages": 34,
    "chunk_index": 47,
    "word_count": 209,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.30-31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "Loss 243.4650 Loss 101.0783 30 RMSE 1.0975 RMSE 2.0144 RMSE 1.2979 Total Squared Total Squared Total Squared Loss 73.9135 Loss 216.4026 Loss 107.7862 32 RMSE 1.1099 RMSE 1.8991 RMSE 1.3403 Total Squared Total Squared Total Squared Loss 61.3883 Loss 166.3522 Loss 94.3840 34 RMSE 1.0115 RMSE 1.6651 RMSE 1.2542 30 Appendix B - Figures 560 540 520 500 480 460 440 420 400 380 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 8/9/9/9/9/9/0/0/0/0/0/0/1/1/1/1/1/2/2/2/2/2/1/1/1/1/1/2/2/ 2 6/1/7/ 1 3/ 1 9/ 2 5/ 1/ 1 7/ 1 3/ 1 9/ 1 5/ 1 1/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 15/ 1 1/ 1 7/ 2 3/ 2 9/4/ 1 0/ 1 1 2 3 1 1 2 3 1 1 2 3 Figure 1A: This figure shows the daily AEX Index levels from August 27, 2001 to February 15, 2002 0.1 0.08 0.06 0.04 0.02 0 -0.02 -0.04 -0.06 -0.08 -0.1 -0.12 -0.14 -0.16 2 6/ 8/ 2 0 1 0 / 9 1 / 2 0 7 0 / 9 1 / 2 1 0 3 0 / 9 1 / 2 1 0 9 0 / 9 1 / 2 2 0 5 0 / 9 1 / 2 1 0 / 1 0 0 1 / 2 7 0 / 1 0 0 1 / 2 3 0 / 1 0 0 1 / 2 9 0 / 1 0 0 1 / 2 5 0 / 1 0 0 1 / 2 1 0 / 1 0 0 1 / 2 6 0 / 1 0 1 1 / 2 2 0 / 1 0 1 1 / 2 8 0 / 1 0 1 1 / 2 4 0 / 1 0 1 1 / 2 0 0 / 1 0 1 1 / 2 6 0 / 1 0 2 1 / 2 2 0 / 1 0 2 1 / 2 8 0 / 1 0 2 1 / 2 4 0 / 1 0 2 1 / 2 0 0 / 1 0 2 1 / 2 0 5 0 / 1 1 / 2 1 0 1 0 / 1 2 / 2 1 0 7 0 / 1 2 / 2 2 0 3 0 / 1 2 / 2 2 0 9 0 / 1 2 / 2 0 4 0 / 2 2 / 2 1 0 0 0 / 2 2 / 2 0 0 2 1 1 2 3 1 1 2 3 1 1 2 3 Figure 1B: This figure shows the daily return of the AEX Index from August 27, 2001 to February 15, 2002 31",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 48,
    "word_count": 563,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "/ 2 2 / 2 1 0 0 0 / 2 2 / 2 0 0 2 1 1 2 3 1 1 2 3 1 1 2 3 Figure 1B: This figure shows the daily return of the AEX Index from August 27, 2001 to February 15, 2002 31",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "38 36 34 32 30 28 26 24 22 20 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 8/9/9/9/9/9/0/0/0/0/0/0/1/1/1/1/1/2/2/2/2/2/1/1/1/1/1/2/2/ 2 6/1/7/ 1 3/ 1 9/ 2 5/ 1/ 1 7/ 1 3/ 1 9/ 1 5/ 1 1/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 15/ 1 1/ 1 7/ 2 3/ 2 9/4/ 1 0/ 1 1 2 3 1 1 2 3 1 1 2 3 Figure 2A: This figure shows the daily ING GROEP CERTS asset from August 27, 2001 to February 15, 2002 0.1 0.08 0.06 0.04 0.02 0 -0.02 -0.04 -0.06 -0.08 -0.1 -0.12 -0.14 -0.16 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 8/ 2 9/ 2 9/ 2 9/ 2 9/ 2 9/ 2 0/ 2 0/ 2 0/ 2 0/ 2 0/ 2 0/ 2 1/ 2 1/ 2 1/ 2 1/ 2 1/ 2 2/ 2 2/ 2 2/ 2 2/ 2 2/ 2 1/ 2 1/ 2 1/ 2 1/ 2 1/ 2 2/ 2 2/ 2 2 6/1/7/ 1 3/ 1 9/ 2 5/ 1/ 1 7/ 1 3/ 1 9/ 1 5/ 1 1/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 15/ 1 1/ 1 7/ 2 3/ 2 9/4/ 1 0/ 1 1 2 3 1 1 2 3 1 1 2 3 Figure 2B: This figure shows the daily return of the ING GROEP CERTS asset from August 27, 2001 to February 15, 2002 32",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 50,
    "word_count": 452,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "1 4/ 1 0/ 15/ 1 1/ 1 7/ 2 3/ 2 9/4/ 1 0/ 1 1 2 3 1 1 2 3 1 1 2 3 Figure 2B: This figure shows the daily return of the ING GROEP CERTS asset from August 27, 2001 to February 15, 2002 32",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "1 0.75 Alpha 0.5 Beta Gamma 0.25 0 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 1/ 1/ 1/ 2/ 2/ 2/ 2/ 2/ 1/ 1/ 1/ 1/ 1/ 2/ 2/ 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 3A: This figure shows the evolution of the estimated parameters α, β, and γ for the AEX Index during the options’ lifetime. 1 0.75 Alpha 0.5 Beta Gamma 0.25 0 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 1/ 1/ 1/ 2/ 2/ 2/ 2/ 2/ 1/ 1/ 1/ 1/ 1/ 2/ 2/ 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 3B: This figure shows the evolution of the estimated parameters α, β, and γ for the ING GROEP CERTS asset during the options’ lifetime. 33",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 52,
    "word_count": 285,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "1 4/ 1 0/ 1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 3B: This figure shows the evolution of the estimated parameters α, β, and γ for the ING GROEP CERTS asset during the options’ lifetime. 33",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "0.0008 0.0007 0.0006 Moving Average 0.0005 GARCH (1,1) 0.0004 Adaptive GARCH 0.0003 Implied 0.0002 0.0001 0 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 1/ 1/ 1/ 2/ 2/ 2/ 2/ 2/ 1/ 1/ 1/ 1/ 1/ 2/ 2/ 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 4A: This figure shows the estimated volatility of the AEX Index obtained from the three models and the implied volatility during the lifetime of the options. 0.0035 0.003 0.0025 Moving Average 0.002 GARCH (1,1) 0.0015 Adaptive GARCH 0.001 Implied 0.0005 0 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 1/ 1/ 1/ 2/ 2/ 2/ 2/ 2/ 1/ 1/ 1/ 1/ 1/ 2/ 2/ 8/ 1 4/ 1 0/ 1 6/ 1 2/ 1 8/ 1 4/ 1 0/ 1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 4B: This figure shows the estimated volatility of the ING GROEP CERTS asset obtained from the three models and the implied volatility during the lifetime of the options. 34",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 54,
    "word_count": 308,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  },
  {
    "text": "1 5/ 1 1/ 1 7/ 2 3/ 2 9/ 4/ 1 0/ 1 2 3 1 1 2 3 Figure 4B: This figure shows the estimated volatility of the ING GROEP CERTS asset obtained from the three models and the implied volatility during the lifetime of the options. 34",
    "title": "Bachelor Thesis",
    "source_type": "pdf",
    "document_id": "0ee746cb02a2",
    "source_file": "Black-Scholes Option Pricing Using Three Vol Models MA, Garch 1,1, Adaptive Garch.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Heru",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20030901031723+02'00'",
    "duration": null
  }
]