[
  {
    "text": "Mark W. Nelson mwn2@cornell.edu 607-255-6323 Susan D. Krische sdk8@cornell.edu Robert J. Bloomfield rjb9@cornell.edu Johnson Graduate School of Management Cornell University Ithaca, New York, 14853-6201 September 28, 2000 We appreciate helpful comments received from Tom Dyckman, Jeffrey Hales, Bob Libby, Jeff Wilks, and workshop participants at Cornell University, Harvard University and the University of North Carolina at Chapel Hill. We are grateful for financial support provided by the Johnson Graduate School of Management at Cornell University, and for programming support provided by Don Honeycutt.",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "RELIANCE ON DISCIPLINED TRADING STRATEGIES",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 0,
    "word_count": 83,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "RELIANCE ON DISCIPLINED TRADING STRATEGIES (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Tom Dyckman, Jeffrey Hales, Bob Libby, Jeff Wilks, and workshop participants at Cornell University, Harvard University and the University of North Carolina at Chapel Hill. We are grateful for financial support provided by the Johnson Graduate School of Management at Cornell University, and for programming support provided by Don Honeycutt.",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "CONFIDENCE AND INVESTORS’",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 47,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CONFIDENCE AND INVESTORS’ (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Numerous archival papers indicate that investors can generate profit by following disciplined trading strategies that exploit the market’s incomplete adjustment for various accounting data. Even assuming efficient markets in which securities are not mispriced, evidence suggests that both individual and professional investors could improve their returns via disciplined trading strategies like market indexing. Yet, investors rarely follow such strategies. We use two experiments to examine factors that we believe affect reliance on trading strategies by affecting whether investors have more confidence in their own judgment or the recommendation of a trading strategy. We find that MBA-student investors deviate from a trading strategy more when the strategy is less accurate (but still more accurate than most well-known trading strategies), when they trade individual securities instead of portfolios, and when they receive positive feedback on trading decisions made prior to learning about the strategy. Thus, investors may lack the discipline to rely on profitable trading strategies, particularly when recent trading success has increased their confidence in their own judgment (as might occur in a sustained bull market like that experienced over the past decade). Our results also suggest ways that individual investors and portfolio managers can increase reliance on profitable trading strategies. 2",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "ABSTRACT",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 47,
    "chunk_index": 2,
    "word_count": 201,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "ABSTRACT (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "profitable trading strategies, particularly when recent trading success has increased their confidence in their own judgment (as might occur in a sustained bull market like that experienced over the past decade). Our results also suggest ways that individual investors and portfolio managers can increase reliance on profitable trading strategies. 2",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "CONFIDENCE AND INVESTORS’",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 47,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CONFIDENCE AND INVESTORS’ (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Numerous archival studies indicate that investors can generate profit by relying on disciplined trading strategies that exploit the market’s incomplete adjustment for various accounting data.1 Even assuming efficient markets in which securities are not mispriced, evidence suggests that both individual and professional investors could improve their returns via disciplined trading strategies like market indexing.2 In this paper, we describe two experiments that examine whether the extent to which investors rely on such disciplined trading strategies depends on factors that affect investors' confidence in their own judgment relative to their confidence in the trading strategy. In experiment 1 we test whether reliance varies with accuracy of the trading strategy; in experiment 2 we test whether reliance varies with perceived accuracy of individual judgment. In both experiments we test whether reliance depends on making trading decisions at the individual-security or portfolio level. This paper integrates research on trading strategies with the literature on decision aids, which has shown in a variety of other accounting tasks that decision-makers often fail to follow an aid’s recommendations, even though recommendations are based on statistical models that perform well in large samples. The paper also contributes to the literature that examines the 1 Such data include recent changes in earnings and prices (e.g., Bernard and Thomas 1990; Chan, Jagadeesh and Lakonishok 1996; Swaminathan and Lee 2000), accounting accruals (Sloan, 1996), or estimates of firms’ intrinsic value derived from analysts' earnings forecasts (Frankel and Lee, 1998). Some researchers argue that apparently successful trading strategies simply reflect misspecification of risk-adjusted return (e.g., Fama 1998). However, a growing number of researchers now accept that at least some trading programs do generate abnormal returns (Kothari 2000). 2 For example, individual investors decrease their returns via their frequent and poor trading decisions (Shefrin and Statman 1993, Odean 1999, Barber and Odean 2000), and actively managed mutual funds are regularly outperformed by passively managed index funds (Gruber 1996, O’Shaughnessy 1997).",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 47,
    "chunk_index": 4,
    "word_count": 318,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "trading programs do generate abnormal returns (Kothari 2000). 2 For example, individual investors decrease their returns via their frequent and poor trading decisions (Shefrin and Statman 1993, Odean 1999, Barber and Odean 2000), and actively managed mutual funds are regularly outperformed by passively managed index funds (Gruber 1996, O’Shaughnessy 1997).",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "judgments of individual investors (see, e.g., Maines and Hand 1996, Lipe 1998). Finally, the paper extends research on market anomalies by focusing on factors that might keep investors from exploiting pricing errors that arise from inaccurate use of accounting data. We view a trading strategy as a type of decision aid. Prior research suggests that reliance on decision aids depends largely on the balance of a decision-maker’s confidence in his or her own judgment relative to his or her confidence in the decision aid (Eining, Jones and Loebbecke 1997). We use two experiments to manipulate factors that we believe affect the balance of investors’ confidence in themselves and a trading strategy. We then test whether these manipulations affect the extent to which investors rely on the trading strategy. In both experiments, we use MBA students to proxy for investors. The investors buy or sell laboratory securities that are based on archival data. For each security, investors are given the recommendation of a trading program that operationalizes a particular trading strategy, and are told the accuracy of the program. They are also given additional accounting information. Investors are paid according to the profitability of their trading decisions. In experiment 1 we examine the effects of the accuracy of the trading program and the level of aggregation at which investors make trading decisions. We manipulate trading-program accuracy by choosing a trading program (based on DeBondt and Thaler, 1990) that is more accurate for sell recommendations than for buy recommendations. We manipulate decision aggregation by first asking investors to determine how many shares of each individual security they want to buy or sell, and then asking them to reconsider those judgments by making decisions at the portfolio level. We expect investors to deviate less from a trading program that picks stocks more accurately, because they will have greater confidence in the program’s ability, relative to their 2",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 6,
    "word_count": 314,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "they want to buy or sell, and then asking them to reconsider those judgments by making decisions at the portfolio level. We expect investors to deviate less from a trading program that picks stocks more accurately, because they will have greater confidence in the program’s ability, relative to their 2",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 47,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "own (see Powell 1991). We also expect investors to deviate less from a trading program when they make trading decisions on an aggregate portfolio basis. We derive this prediction from the “dual source” model of confidence (Sniezek, Paese and Switzer 1990). The dual-source model asserts that decision-makers assess from case-specific information their confidence for individual decisions (such as the trade of a single stock), which tends to encourage overconfidence, but assess confidence for a group of decisions (such as the creation of a security portfolio) from their knowledge of their general ability, which tends to be relatively more accurate (see, e.g., Sniezek and Buckley 1991). We extend the dual-source model to consider the level of aggregation at which decisions are made about reliance on trading programs (and other decision aids). Results from experiment 1 generally support our predictions. Investors deviate substantially from the program, and these deviations significantly lower their trading profits. Results also indicate an interaction between the accuracy and aggregation effects: investors deviate less from the trading program only when the program is more accurate and when they evaluate portfolios rather than individual securities. Deviations from the trading program are greatest when the program is less accurate. However, even our less-accurate program is more accurate than many well-known anomaly-based trading programs (such as those exploiting post- earnings-announcement drift), which correctly pick only slightly more than 50% of securities. This suggests that investors may lack the discipline to exploit and eliminate persistent market anomalies. Our second experiment examines whether investors’ confidence in their own ability affects reliance by presenting some of our investors with feedback on their performance trading five securities without access to the trading program. (Other investors receive no feedback, to replicate the trading conditions of experiment 1.) Investors in experiment 2 trade only in the 3",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 47,
    "chunk_index": 8,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "investors’ confidence in their own ability affects reliance by presenting some of our investors with feedback on their performance trading five securities without access to the trading program. (Other investors receive no feedback, to replicate the trading conditions of experiment 1.) Investors in experiment 2 trade only in the 3",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "more realistic “less accurate” trading program condition. Consistent with the “balance of confidence” perspective, investors who learn that they made good trading decisions subsequently rely less heavily on the trading program than investors who learn that they made poor trading decisions, even though no investor receives enough feedback to draw very reliable inferences about their abilities. Consistent with the dual-source model, viewing trades at a portfolio level encourages trading-program reliance when investors lack feedback, and encourages trading- program reliance to a greater extent when investors received negative feedback than when investors received positive feedback. Overall, our results suggest that investors’ reliance on trading strategies could be improved by encouraging decision making at the portfolio level. Our results also shed light on behavioral forces that may keep investors from exploiting known anomalies. Investors’ responses to feedback suggest that past trading success can reduce future performance by increasing investors’ overconfidence. An implication of this finding is that investors may be least likely to exploit known anomalies when a sustained bull market gives them much positive feedback (as has happened over the past decade). Results obtained with MBA students may not always generalize to the professional money managers who are in the best position to make trading decisions and exploit price biases. However, prior research suggests that the judgments of more experienced investors may display even more overconfidence in their own abilities to process information (see, e.g., Yates, McDaniel and Brown, 1991). Thus, professional investors may deviate even more often from trading strategies than do our less-experienced subjects. 4",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 10,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "exploit price biases. However, prior research suggests that the judgments of more experienced investors may display even more overconfidence in their own abilities to process information (see, e.g., Yates, McDaniel and Brown, 1991). Thus, professional investors may deviate even more often from trading strategies than do our less-experienced subjects. 4",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "The remainder of the paper is organized as follows. Section 2 describes hypotheses, method and results with respect for experiment 1. Section 3 does the same for experiment 2. Section 4 provides a summary and discusses the implications and limitations of the study. 2.0 Experiment 1 2.1 Background and hypotheses. 2.1.1 Trading Strategies and Decision Aids. Trading strategies are simple rules that use publicly available information to recommend whether to buy or sell securities.3 Quantitative mutual funds (“quant funds”) often implement such rules as explicit trading strategies or as preliminary filters for such strategies (Laing, 1995).4 However, even those money managers who espouse quantitative strategies appear to follow their strategies imperfectly (T. Longo, 1998). Quant fund managers “continually review their models and frequently make minor adjustments to tweak performance” (Weber, 1996, p. 107). Anecdotal evidence suggests that these “tweaks” may not always be beneficial. For example, Boatsman, Moeckel, and Pei (1997) cite the following: As the European bond markets were getting hammered in this year’s first quarter, risk management systems at Citicorp’s Citibank unit were flashing warnings … the model said ‘get out’ but senior managers in Europe overrode the system and stuck to their bets. The results? Big losses. (Wall Street Journal, Sept. 29, 1994) Similarly, LBS Capital Management trailed the S&P 500 in the early 1990s largely because LBS officials chose to ignore an important buy signal at the onset of the Gulf War in January, 1991, they sheepishly admit. By the time LBS 3A trading strategy, or a trading program that operationalizes a trading strategy, is different from “program trading,” defined by the New York Stock Exchange as a trade involving at least 15 different stocks (in a package or “basket” of stocks traded at the same time) and valued at a minimum of $1 million. Program trading could in principle be used to exploit anomalies, but is commonly used for index arbitrage, portfolio insurance, and computer-assisted trading (see Gastineau 1991 and Essinger 1989). 4 Quant funds may also use these programs as inputs into complex trading strategies, including inference-based expert systems (see e.g., Evans & Shirreff, 1994; Capon, 1998) or neural networks (see e.g., Laing, 1995; J. Longo & Long, 1997). 5",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 12,
    "word_count": 366,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "portfolio insurance, and computer-assisted trading (see Gastineau 1991 and Essinger 1989). 4 Quant funds may also use these programs as inputs into complex trading strategies, including inference-based expert systems (see e.g., Evans & Shirreff, 1994; Capon, 1998) or neural networks (see e.g., Laing, 1995; J. Longo & Long, 1997). 5",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 47,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "clambered aboard the stock market nine days later, share prices had risen by some eight percentage points. (Laing, 1995, p. 31) More generally, Finding exploitable investment strategies does not mean it's easy to make money, however. To do so requires an ability to consistently, patiently, and slavishly stick with a strategy, even when it's performing poorly relative to other methods. Few are capable of such action. (O'Shaughnessy, 1997, p. 6) Why do even professional investors have trouble adhering to trading strategies shown to be successful in large samples? Identifying relevant forces could indicate remedies that would allow investors to improve their trading returns. It could also suggest reasons why stock price anomalies are not driven away by the trading activities of money managers. We search for an answer by noting that trading strategies are a form of decision aid. In accounting, much decision-aid research has focused on auditing (see Messier 1995 for a review).5 Additional work has examined the application of decision aids in such judgments as bond ratings (Ashton 1990, 1992, Whitecotton, Saunders and Norris 1998, Whitecotton and Butler 1998), and earnings forecasts (Whitecotton 1996a, 1996b). In a typical decision-aid study, decision makers are given a recommendation based on large-sample statistical techniques. The recommendation typically outperforms individual decision makers. In the vast majority of these studies, participants (even experts) who deviate from the recommendations of the decision aid perform worse than if they had simply followed the aid (see, e.g., Einhorn 1972, Dawes, Faust and Meehl 1989, Kleinmuntz 1990).6 These 5 For example, aids have been developed that are designed to improve audit judgment by improving fraud detection (Boatsman et al. 1997, Eining et al. 1997), determining extent of control reliance (Libby and Libby, 1989), calculating appropriate sample sizes (Kachelmeier and Messier 1990), and aggregating error frequency information (Bonner, Libby and Nelson 1996). 6 A notable exception is that human decision makers often react more appropriately in dynamic information environments (Meehl, 1954). In such circumstances, “people–especially the experts in a field–are much better at selecting and coding information than they are at integrating it” (Dawes, 1979, p. 573), such that combinations of human decision maker and mechanical aid can produce the highest performance (Blattberg and Hoch 1990; McClish 6",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 47,
    "chunk_index": 14,
    "word_count": 370,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "environments (Meehl, 1954). In such circumstances, “people–especially the experts in a field–are much better at selecting and coding information than they are at integrating it” (Dawes, 1979, p. 573), such that combinations of human decision maker and mechanical aid can produce the highest performance (Blattberg and Hoch 1990; McClish 6",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 47,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "results parallel investors’ deviation from trading strategies, which make recommendations based on large-sample statistical techniques that appear to outperform individual decision-makers. Decision-makers’ agreement with a decision aid depends on their confidence in the decision aid relative to their confidence in their ability to analyze the available information themselves (Eining et al. 1997). Agreement with the aid decreases with variables that increase confidence in self relative to the aid, such as self-assessed expertise and sufficiency of knowledge about the decision setting (Arkes, Dawes, and Christensen 1986, Boatsman et al. 1997, Whitecotton 1996b). Agreement increases with variables that increase confidence in the aid relative to self, such as prior experience with decision aids (Whitecotton 1996b), involvement in selecting decision-aid inputs (Whitecotton and Butler 1998), increasing amounts of information used as inputs to the aid (E. Davis 1998, Ashton 1990), higher accuracy of the aid (Powell 1991), and decision-aid feedback (F. Davis and Kottemann, 1995).7 Decision-makers who have appropriate confidence in their own abilities and in the validity of the decision aid would presumably be able to outperform the decision aid by considering information not incorporated in the decision-aid’s recommendation. However, prior research has provided consistent evidence that people tend to be overconfident in their own accuracy for difficult judgments.8 This overconfidence could explain systematic under-reliance and Powell 1989; Hoch and Schkade 1996; Yaniv and Hogarth 1993). The fact that simple trading strategies tend to outperform individual investors suggests that they are effective in financial markets. 7 Other variables affect reliance as well, such as incentives for various outcomes (Ashton 1990; Boatsman et al. 1997; Kachelmeier and Messier 1990). 8 For reviews of the overconfidence literature, see Brenner, Koehler, Liberman, and Tversky (1996), Lichtenstein, Fischhoff and Phillips (1982), and Keren (1991). For research indicating that people generally over-rely on non- diagnostic case-specific information, see, e.g., Nisbett, Zukier, and Lemley (1981), Hackenbrack (1992), F. Davis, Lohse and Kottemann (1994), Glover (1997), Hoffman and Patton (1997), Shelton (1999). For applications of overconfidence in financial markets, see, e.g., Daniel, Hirshleifer and Subrhmanyam (1998), Odean (1998, 1999), Barber and Odean (2000), and Bloomfield, Libby, and Nelson (2000a, 2000b). 7",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 47,
    "chunk_index": 16,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Nisbett, Zukier, and Lemley (1981), Hackenbrack (1992), F. Davis, Lohse and Kottemann (1994), Glover (1997), Hoffman and Patton (1997), Shelton (1999). For applications of overconfidence in financial markets, see, e.g., Daniel, Hirshleifer and Subrhmanyam (1998), Odean (1998, 1999), Barber and Odean (2000), and Bloomfield, Libby, and Nelson (2000a, 2000b). 7",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "on decision aids, and presumably would also influence the extent to which investors inappropriately deviate from trading strategies. 2.1.2 The balance of confidence in the trading context. We extend decision-aid research by examining how investors’ confidence in a trading strategy, relative to their confidence in their own abilities, alters the extent to which they adhere to the strategy. The trading context differs from other decision-making contexts in three important ways, all of which have direct bearing on this process: the choice of trade size, the low accuracy of most trading strategies, and the ability to make decisions on either an individual or portfolio basis. 2.1.2.1 Trade size. Many decision-aid studies ask decision-makers to choose from a small number of options (e.g., accept or reject). An investor’s choice to buy or sell a security is thus similar to the choices in previous research. However, the trading task also involves an additional decision: how many shares to buy or sell. All else equal, theoretical models (e.g., Kyle 1985), experimental research (e.g., Bloomfield, Libby and Nelson, 1996) and anecdotal evidence (e.g., O’Brien, 2000) suggest that investors buy or sell more shares as their confidence increases. The trading context thus provides us with a powerful methodological tool to examine confidence effects. We can also examine differences in trading profit and loss to identify the practical consequences of deviations from a trading strategy. 2.1.2.2 Trading-strategy accuracy. Most trading strategies are relatively inaccurate. For example, consider the widely-known and apparently successful strategy exploiting post-earnings- announcement drift. As reported by Bernard and Thomas (1990, Table 2, Panel C), there is a statistically-significant correlation between earnings surprises and future returns; however, the correlation at the individual-firm level is less than 0.10. This suggests that one could use the 8",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 18,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "widely-known and apparently successful strategy exploiting post-earnings- announcement drift. As reported by Bernard and Thomas (1990, Table 2, Panel C), there is a statistically-significant correlation between earnings surprises and future returns; however, the correlation at the individual-firm level is less than 0.10. This suggests that one could use the 8",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 47,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "strategy to predict the direction of future abnormal return of a particular security only slightly more than 50% of the time. Most decision-aid studies provide a decision aid’s accuracy as a known constant, and so cannot investigate the effect of aid accuracy on aid reliance. One exception is Powell (1991), who manipulated aid accuracy via deception in the context of selecting from among three choices the winner of the National Baseball League Most Valuable Player (MVP) award. Accuracy had a significant but modest effect on the extent to which participants agreed with the decision aid. Ashton (1990 experiment 3) and E. Davis (1998) found that auditors on average agreed more with the recommendations of aids that appear to be based on more information. We interpret these results as evidence that low decision-aid accuracy reduces decision- makers’ confidence in the aid, relative to their confidence in their own judgment. We predict that investors likewise will rely less on a trading strategy as the strategy's accuracy decreases. 2.1.2.3 Trading-decision aggregation. Investment decisions differ from many other decisions because investors are encouraged to think about each of their investments in the aggregate context of their entire portfolio (Sharpe and Alexander 1990). This contrasts with prior decision-aid research where, because of the nature of the judgments made in most contexts, reliance on decision aids tends to be examined for individual cases. For example, auditors try to calculate appropriate sample size for a particular client (Kachelmeier and Messier 1990) or determine whether they face fraud for a particular client (Boatsman et al. 1997). Bond raters judge the credit-worthiness of a particular firm (Ashton 1990, Whitecotton and Butler 1998, Whitecotton et al, 1998). Those studies that have examined investment-related judgments such as earnings forecasts have done so on a security-by-security basis (Whitecotton 1996a, 1996b). 9",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 47,
    "chunk_index": 20,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "fraud for a particular client (Boatsman et al. 1997). Bond raters judge the credit-worthiness of a particular firm (Ashton 1990, Whitecotton and Butler 1998, Whitecotton et al, 1998). Those studies that have examined investment-related judgments such as earnings forecasts have done so on a security-by-security basis (Whitecotton 1996a, 1996b). 9",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 47,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Prior research suggests that investors who make trading decisions by evaluating portfolios are likely to behave quite differently from those who evaluate individual securities, because the overconfidence common in individual judgments is typically reduced when confidence is assessed in the aggregate. For example, a typical overconfidence study in psychology requires participants to answer a large number of quantitative general-knowledge questions, and for each question also asks participants to state bounds of a 90% confidence interval. Compared to actual performance, participants’ confidence intervals are insufficiently wide, indicating overconfidence. Yet, the same participants provide a much more accurate (i.e., lower) confidence assessment when asked aggregate questions like “What is the proportion of correct responses that you provided over the last X questions.”9 One useful explanation for this aggregation effect is the dual source model, introduced by Sniezek et al. (1990). Under the dual source explanation, confidence assessments on a case- by-case basis depend on relatively poor information about the specific case, but aggregate confidence assessments depend on more general factors like prior performance on similar tasks and self-assessed expertise with respect to the topic. Because people’s information about themselves is of generally higher quality than their information about the case, they tend to give more accurate aggregate confidence assessments (Sniezek and Buckley 1991, Treadwell and T. Nelson 1996). In the investing context, the dual source model suggests that investors’ confidence in their individual trades is likely to depend on relatively poor information about the specific case, leading to overconfidence in their own abilities, and under-reliance on the trading strategy. 9 See, e.g., Gigerenzer, Hoffrage and Kleinbolting (1991), Griffin and Tversky (1992), Keren (1991), Mazzoni and T. Nelson (1995), Schneider (1995), Sniezek et al. (1990), Sniezek and Buckley (1991), and Treadwell and T. Nelson (1996). 10",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 47,
    "chunk_index": 22,
    "word_count": 293,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "case, leading to overconfidence in their own abilities, and under-reliance on the trading strategy. 9 See, e.g., Gigerenzer, Hoffrage and Kleinbolting (1991), Griffin and Tversky (1992), Keren (1991), Mazzoni and T. Nelson (1995), Schneider (1995), Sniezek et al. (1990), Sniezek and Buckley (1991), and Treadwell and T. Nelson (1996). 10",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 47,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Investors’ confidence in portfolio decisions is likely to depend on relatively good information on their own (low) abilities, leading to reduced overconfidence and increased reliance on the trading strategy. Therefore, we predict trading-strategy reliance will be greater in the portfolio-trading setting than in the individual-trading setting. 2.2 Method 2.2.1 Trading program, securities and design. To test our predictions, we developed a trading program that allows us to manipulate trading-strategy accuracy while holding constant the basic decision task and information used by the decision aid. The program is based on systematic errors in analysts’ forecasts: analysts who predict large increases in earnings tend to be optimistic, while those who predict large decreases tend to be pessimistic (DeBondt and Thaler, 1990). In order to translate this finding into an implementable trading strategy, we construct 30 securities, each based on a real firm. A security has a value of $2 if the related firm’s actual earnings growth was at least the earnings growth predicted by analysts and $0 if the firm’s actual earnings growth was less than the earnings growth predicted by analysts. The price of this laboratory security is always $1.10 The trading program recommends that investors BUY securities with projected earnings declines and SELL securities with projected earnings growth. Half of the recommendations are SELL, the other half are BUY. SELL recommendations are more accurate (75% correct) than BUY recommendations (55% correct). Thus, trading-program accuracy is manipulated within- subjects via the different accuracy of BUY and SELL recommendations.11 10 Our securities are based on earnings, rather than on stock prices. This approach has the advantage of avoiding noise in responses that might occur if investors believe prices inefficiently reflect information. 11 Manipulating accuracy via BUY v. SELL means that accuracy is confounded with BUY v. SELL. Investors may be somewhat reluctant to sell securities they do not have, regardless of whether or not there are short-selling constraints. However, since we anticipate that investors will follow sell recommendations more than they follow buy recommendations, a reluctance to sell biases away from support for our hypothesis. 11",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 47,
    "chunk_index": 24,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "SELL. Investors may be somewhat reluctant to sell securities they do not have, regardless of whether or not there are short-selling constraints. However, since we anticipate that investors will follow sell recommendations more than they follow buy recommendations, a reluctance to sell biases away from support for our hypothesis. 11",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 47,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Investors first make trading decisions for 30 laboratory securities on a case-by-case basis. Then, investors review their trading decisions on an aggregate portfolio basis and modify their aggregate trades as they deem appropriate.12 Thus, trading-decision aggregation is also manipulated within subjects, leaving Experiment 1 with a 2x2, within-subjects design. 2.2.2 Participants. Eighty-one MBA students volunteered to participate as investors in a computerized stock-trading experiment in response to announcements made in MBA intermediate accounting classes and through an electronic mailing list. Investors were told they did not need prior experience with computers, financial markets, or securities trading. Investors participated in one of three scheduled sessions.13 Investors had completed a mean of 5.8 classes in accounting and finance, and a mean of 1.0 class in judgment and decision-making. One-fourth (23.5%) of investors were female. 2.2.3 Incentives to trade. Investors gained or lost laboratory dollars as a result of their trading decisions. Investors gained dollars by buying a security when actual earnings growth was at least the earnings growth predicted by analysts (in this case, a share in a security would be purchased for $1 when it was actually worth $2, making $1 profit), and also gained dollars by selling a security when actual earnings growth was less than the earnings growth predicted by analysts (in this case, a share in a security would be sold for $1 when it was actually worth $0, making $1 profit). Investors were told that their profits in laboratory dollars would be converted into U.S. dollars by adding an adjustment factor to their gains or losses in laboratory dollars and then 12 It is natural for the aggregation decision to follow the individual decisions, since deviation from the aggregate decision is difficult without knowledge of individual securities. However, because aggregate judgments always followed individual judgments, order is confounded with aggregation, and an apparent affect of aggregation might instead be an effect of reminding investors to follow the program. Experiment 2 includes an analysis that provides evidence against such a \"reminder\" effect. 12",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 47,
    "chunk_index": 26,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "without knowledge of individual securities. However, because aggregate judgments always followed individual judgments, order is confounded with aggregation, and an apparent affect of aggregation might instead be an effect of reminding investors to follow the program. Experiment 2 includes an analysis that provides evidence against such a \"reminder\" effect. 12",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 47,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "multiplying by an exchange rate. Although they did not learn the exact adjustment or exchange rates, investors were told that these parameters were positive, that the positive exchange rate meant they would take home more U.S. dollars if they won more (or lost fewer) laboratory dollars, that the positive adjustment meant they could lose laboratory dollars but still take home a substantial payment, that average cash payments would be about $20 per person, and that they were guaranteed a minimum payment of US$5. In order to alleviate concerns about cash requirements, investors were informed that they did not need to have cash to buy shares nor own shares in order to sell them, and that there were no transaction costs of any kind. Investors learned of their trading performance (in laboratory dollars) after completing the post- experimental questionnaire. 2.2.4 Materials. We used the I/B/E/S database to select securities. We selected the first- available mean consensus-forecast for one-year-ahead earnings (FY1) following an annual earnings announcement in the years 1995, 1996, and 1997, and reversed the stock-split- adjustment to obtain raw forecasts as reported. We then obtained each firm’s earnings before extraordinary items (COMPUSTAT annual items 18 and per share 58) and sales revenue (COMPUSTAT annual item 12). We limited our sample to manufacturing and wholesale/retail firms (one-digit SIC codes equal to 3 or 5), firms that had positive earnings in each of the relevant prior years, and firms for which analysts predicted a one-year-ahead earnings change of above 5% (for SELL recommendations) or below –5% (for BUY recommendations). The sample-selection procedures resulted in a total of 1,608 observations. Consistent with the findings of DeBondt and Thaler (1990), our program recommends BUY when analysts predict an earnings decrease (155 securities), and recommends SELL when analysts predict an earnings 13 After the first session, changes were made to the post-experimental questionnaire. Otherwise, the procedures 13",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 47,
    "chunk_index": 28,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "a total of 1,608 observations. Consistent with the findings of DeBondt and Thaler (1990), our program recommends BUY when analysts predict an earnings decrease (155 securities), and recommends SELL when analysts predict an earnings 13 After the first session, changes were made to the post-experimental questionnaire. Otherwise, the procedures 13",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 47,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "increase (1,453 securities). The trading program is more accurate when predicting a negative forecast error (74.0% of the SELL recommendations were correct) than when predicting a positive forecast error (52.9% of the BUY recommendations were correct). We selected a representative sample of 15 securities for which our program would recommend BUY and another representative sample of 15 securities for which our program would recommend SELL. The samples match closely the accuracy rates for the overall sample—11 of 15 (73.3%) for SELL recommendations and 8 of 15 (53.3%) for BUY recommendations. Three financial statistics were presented to investors in addition to the trading program's recommendations: predicted earnings growth, past earnings growth, and past sales growth. Predicted earnings growth (used by the trading program) is calculated as the percentage growth in analysts’ consensus earnings forecast for the target year t+1 over earnings per share before extraordinary items for the prior year t. Past earnings growth is calculated as the percentage growth in actual annual earnings before extraordinary items, averaged over the prior three years t, t–1, and t–2. Past sales growth is calculated as the percentage growth in annual sales revenue, averaged over the prior three years t, t–1, and t–2. The financial information offers investors a potential reason for deviating from the trading-program’s recommendations.14 2.2.5 Instructions and procedure. Investors were told that they would be presented with information on 30 different firms, selected from the set of all manufacturing and wholesale/retail firms listed on a major U.S. stock exchange in a recent three-year period. The instructions then applied to the three sessions were identical. Session is not significant when included as a variable in the analyses. 14 This information is incrementally useful. We performed a logistic regression on the sample of 30 securities presented to investors with the direction of the forecast error as the dependent variable and the program’s recommendation, predicted earnings growth, past earnings growth, and past sales growth as independent variables. 14",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 47,
    "chunk_index": 30,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "analyses. 14 This information is incrementally useful. We performed a logistic regression on the sample of 30 securities presented to investors with the direction of the forecast error as the dependent variable and the program’s recommendation, predicted earnings growth, past earnings growth, and past sales growth as independent variables. 14",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "reviewed the construction of the laboratory securities, the sample selection procedures applied, and the financial information provided for each security, before introducing the trading-program accuracy manipulation (described further below) and discussing investors’ financial incentives to trade. Although investors could not revisit previous computer screens, a “Help” function that provided a review of the relevant instructions was always accessible by right-clicking on an item on the screen. 15 2.2.5.1 Manipulation of trading program accuracy. Investors were informed that, in order to aid their trading decisions, they would learn the recommendation of a trading program which generated buy and sell recommendations by incorporating the information at their disposal into a predictive model. The next screen contained the within-subjects accuracy manipulation, as follows: When the program recommends that you BUY, actual earnings growth MEETS OR EXCEEDS the earnings growth predicted by analysts about 55% of the time. When the program recommends that you SELL, actual earnings growth FALLS BELOW the earnings growth predicted by analysts about 75% of the time. All investors were reminded that, on average, it was very hard to beat the program’s recommendations, but that the model was not perfect. Investors were reminded that the program made the wrong recommendation a substantial proportion of the time (25% of SELL recommendations were wrong, and 45% of BUY recommendations were wrong), reinforcing the within-subject manipulation of accuracy. Using a classification cutoff of 50%, we can predict the direction of the forecast error for 21 of the 30 securities, compared to 19 correct predictions based on the trading program alone. 15 We also varied between-subjects the extent of explanation provided about the trading program. All investors were informed about the accuracy of the program given a BUY or SELL recommendation, but some investors were provided a more elaborate description of the program input and a rationale for its effectiveness. We manipulated extent of explanation because prior research indicates it could affect agreement with a decision aid (see, e.g., Ye and Johnson 1995, F. Davis and Kotteman 1995). However, this variable was never significant in any analysis, and so will not be discussed further. 15",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 32,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "a rationale for its effectiveness. We manipulated extent of explanation because prior research indicates it could affect agreement with a decision aid (see, e.g., Ye and Johnson 1995, F. Davis and Kotteman 1995). However, this variable was never significant in any analysis, and so will not be discussed further. 15",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 47,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "2.2.5.2 Manipulation of decision aggregation. Additional instruction screens described how to use the trading mechanism to trade case-by-case securities (described further below) and presented a short series of true-or-false questions to ensure investors understood the instructions. Then the securities were presented to investors on a case-by-case basis in one of four possible orders.16 For each security, investors were provided with the trading-program’s recommendation and the three additional items of accounting information previously described. 17 Figure 1 shows an example of a trading screen. Investors indicated the direction of their trade by selecting one of the BUY or SELL buttons, and indicated the number of shares they wished to trade by clicking on a sliding scale. Investors were required to trade at least one share and could trade up to 50 shares of each security. After completing the case-by-case trades, investors were told that, before executing their trades, they would have the opportunity to review their selections. No mention of a review had been made prior to this statement. Investors learned that the 30 securities would be divided into four groups based on their initial decisions: securities they selected to BUY when the program recommended BUY; securities they selected to SELL when the program recommended BUY; securities they selected to BUY when the program recommended SELL; and, securities they selected to SELL when the program recommended SELL. Investors could change the direction and the average number of shares traded for the securities in that group, with the number of 16 Two of the orders began with BUY recommendations and the remaining two orders began with SELL recommendations. Within each order, securities were selected randomly, with the exception that no more than three of a given recommendation be sequentially presented. Investors were randomly assigned to orders in blocks of four. Order is not significant when included as a variable in the analyses. 17 This task is somewhat similar to one used by Whitecotton (1996a, 1996b), who required participants to assess the likelihood that the next year’s earnings would exceed the level expected based on previous four-year average change in earnings (see 1996b, Appendix A, p. 213), provided with the average change in earnings over the prior four years, the current year’s earnings per share, and the expectation of the next year’s earnings based on the trend, along with ROE, gross margin, operating return on total assets, total assets, ROA, and PE ratio for the current and first-year prior. 16",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 47,
    "chunk_index": 34,
    "word_count": 407,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "average change in earnings over the prior four years, the current year’s earnings per share, and the expectation of the next year’s earnings based on the trend, along with ROE, gross margin, operating return on total assets, total assets, ROA, and PE ratio for the current and first-year prior. 16",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 47,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "shares traded for each security in the group scaled accordingly. Additional screens provided a description of how to use the interface to make trading decisions at the portfolio level. Figure 2 shows an example of the portfolio-trading screen. 2.3 Results We first examine how the accuracy and aggregation manipulations affect investors’ agreement with the trading-program’s recommendations. We start by measuring agreement as investors’ net investment position in the recommended portfolios. We then decompose that agreement measure into two parts. \"Net security position\" measures investors’ directional agreement with the trading program. \"Net trade size per security\" measures investors’ confidence in their directional agreement. This decomposition allows us to isolate effects on investors' agreement with the program from effects on their confidence in that agreement. Finally, we examine how accuracy and aggregation affect investors’ total trading profits. 2.3.1 Net investment Position in Recommended Portfolio. Table 1, Panel A classifies the mean total shares traded, by program recommendation (SELL, which is more accurate; BUY, which is less accurate), decision aggregation (case-by-case; portfolio), and investors’ trading decision (Buy; Sell).18 We use these means to compute our measure of agreement with the trading program: investors’ net investment position in the recommended portfolio, defined as the total number of shares traded in the direction recommended by the trading program, minus the total number of shares traded against the trading program. Higher net investment positions indicate higher agreement with the recommendations. The maximum possible net investment 18 All analyses are based on the 72 investors who correctly identified the direction of the difference in program accuracy between buy and sell recommendations (based on their responses to questions on the post-experimental questionnaire). Repeating the analysis with all 81 investors eliminates the significance of the accuracy main effect (p > 0.10), but leaves significance of the aggregation main effect and the accuracy-by-aggregation interaction unchanged (both p < 0.01). All results are similar when based on non-parametric tests. 17",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 47,
    "chunk_index": 36,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "questions on the post-experimental questionnaire). Repeating the analysis with all 81 investors eliminates the significance of the accuracy main effect (p > 0.10), but leaves significance of the aggregation main effect and the accuracy-by-aggregation interaction unchanged (both p < 0.01). All results are similar when based on non-parametric tests. 17",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 47,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "position with respect to each type of program recommendation (BUY or SELL) is +750 shares (obtained if an investor trades the maximum number of 50 shares in agreement with all recommendations) and the minimum net investment position is –750 shares (obtained if an investor trades the maximum number of 50 shares against all recommendations). The overall mean net investment position in the recommended portfolios on case-by-case trades is +367.2 shares, which is significantly greater than zero (t = 13.2, p < 0.001 one-sided) but significantly less than its theoretical maximum of +750 (t = –13.8, p < 0.001 one-sided). This result indicates that investors significantly agreed with the program’s recommendations, but not to the maximum possible. As noted on Panel A of Table 1, this pattern is consistent for all four cells of the experimental design. We performed a 2 x 2 analysis of variance to test the effects of accuracy (higher / lower) and aggregation (case-by-case / portfolio) on investors’ net investment position. We report one- sided p-values for accuracy and aggregation main effects, as our hypotheses for these effects are directional. We report two-sided p-values for the interaction. We find significant main effects for both accuracy (F = 5.47, p = 0.011) and aggregation (F = 5.42, p = 0.011), and also a significant accuracy-by-aggregation interaction (F = 19.94, p < 0.001). Tests of the simple contrasts show that aggregation significantly increases agreement with the trading program only when its recommendations are more accurate (t = 4.27, p < 0.001 one-sided), not when its recommendations are less accurate (t = 0.55, n.s.). Similarly, higher accuracy increases agreement with the trading program only for aggregate portfolio trades (t = 3.32, p < 0.001 one- sided), not for individual case by case trades (t = 1.21, n.s.).19 19 Results are very similar when we normalize investors’ trades by dividing the number of shares each investor traded for a security with a given recommendation by the number of shares the investor traded for all securities with that same recommendation. 18",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 47,
    "chunk_index": 38,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "case by case trades (t = 1.21, n.s.).19 19 Results are very similar when we normalize investors’ trades by dividing the number of shares each investor traded for a security with a given recommendation by the number of shares the investor traded for all securities with that same recommendation. 18",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 47,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "2.3.2 Net Security Position. Investors’ net investment position in the recommended portfolios incorporates two distinct aspects of agreement with the trading program: investors’ directional agreement with the program’s recommendations and investors’ confidence in their chosen trade directions. We examine directional agreement by computing a second measure of agreement: net security position, defined as the number of securities that investors traded in the direction recommended by the trading program, minus the number of securities traded against the trading program. The maximum net security position is 15 securities (obtained if an investor trades each security in agreement with its recommendation) and the minimum net security position is –15 securities (obtained if an investor trades each security against its recommendations). Table 1, Panel B shows that the mean net security position is significantly positive in all cells of the design, but it is always significantly less than the maximum possible. Repeating the 2 x 2 analysis of variance, we observe no statistically significant main effects or interactions. Thus, our experiment shows no evidence that investors’ agreement with the trading program in selecting which securities to buy or sell was influenced by the accuracy of the program or the level of aggregation applied to the decision. 2.3.3 Net Trade Size Per Security. We examine investors’ confidence in their chosen trade direction by computing a third measure of agreement: net trade size per security, defined as the average number of shares that an investor traded per security in the direction recommended by the trading program, minus the average number of shares that an investor traded per security against the trading program. The maximum net trade size per security is 50 shares (obtained if an investor trades 50 shares of each security in agreement with all recommendations) and the 19",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 47,
    "chunk_index": 40,
    "word_count": 294,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "direction recommended by the trading program, minus the average number of shares that an investor traded per security against the trading program. The maximum net trade size per security is 50 shares (obtained if an investor trades 50 shares of each security in agreement with all recommendations) and the 19",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 47,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "minimum net trade size per security is –50 shares (obtained if an investor trades 50 shares of each security against all recommendations).20 Table 1, Panel C shows that the mean net trade size per security is significantly positive in all cells of the design, but significantly less than the maximum possible. Repeating the 2 x 2 analysis of variance, we find that both accuracy and aggregation have significant main effects (F = 10.39, p < 0.001 and F = 6.96, p < 0.005, respectively), and there is also a significant accuracy- by-aggregation interaction (F = 15.48, p < 0.001). Tests of simple effects show that aggregation increases agreement when the trading program is more accurate (t = 4.78, p < 0.001 one-sided), not when the program is less accurate (t = 0.12, n.s.). Similarly, higher accuracy increases agreement with the program significantly for aggregate portfolio trades (t = 4.28, p < 0.001 one- sided), but only marginally for individual-case-by-case securities (t = 1.654, p = 0.051 one- sided). Overall, these results indicate that the effects of accuracy and aggregation that we identify for investors’ net investment position in the recommended portfolios are driven primarily by effects on net trade size per security (and thus confidence), rather than by effects of directional agreement on security. The results highlight the importance of these variables for determining confidence in a trading strategy’s recommendations.21 20 For investors who had no securities in a particular combination of recommendation and decision, we assumed that they chose a trade size of 0 in that cell. Similar results are obtained when we exclude the 26 investors who did not trade in one or more cells of the design. 21 When we include number of accounting and finance courses as a covariate in analyses of net investment position and of net trade size per security, there is a significant 3-way interaction between number of courses, accuracy and aggregation. Splitting our sample at the median number of courses, the accuracy-by-aggregation interaction is significant regardless of whether investors had many courses or few courses. However, the interaction becomes less significant when investors had many courses, because in general they rely more on the trading strategy. These results suggest that the significance of the accuracy-by-aggregation interaction may diminish as investors become more sophisticated. We discuss this possibility further in Section 4.0. 20",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 47,
    "chunk_index": 42,
    "word_count": 390,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "or few courses. However, the interaction becomes less significant when investors had many courses, because in general they rely more on the trading strategy. These results suggest that the significance of the accuracy-by-aggregation interaction may diminish as investors become more sophisticated. We discuss this possibility further in Section 4.0. 20",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 47,
    "chunk_index": 43,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "2.3.4 Trading Profits. Table 2 lists the mean total trading profits earned by investors (in laboratory dollars), classified by program recommendation. The majority of investors’ trading profits are earned when they agree with a SELL recommendation, which is not surprising given the high accuracy of sell recommendations. Investors’ mean final loss of $23.02 from trading securities with a BUY recommendation and their mean final gain of $271.04 from trading securities with a SELL recommendation are significantly less than the amount investors could have earned by trading the maximum number of shares in agreement with the trading program ($50.00 and $350.00 respectively, t = –6.19 and –6.73 respectively, both p < 0.001). A 2 x 2 analysis of variance to test the effects of accuracy (higher / lower) and aggregation (case-by- case / portfolio) on investors’ total trading profits show significant main effects of accuracy (F = 271.41, p < 0.001) and aggregation (F = 10.26, p < 0.001), and a significant accuracy-by- aggregation interaction (F = 17.36, p < 0.001). These results suggest that the effects of accuracy and aggregation that we identify have consequences for investors’ total trading profits. 3.0 Experiment 2 3.1 Background and hypothesis. Experiment 1 provides support for the theory that trading-strategy reliance depends on the balance of confidence in self and confidence in the trading program. Both an accurate trading strategy and a portfolio approach were necessary to increase trading-strategy reliance. Given that trading strategies are of relatively low accuracy in practice (but reliance on them is still worthwhile), we focus on the less-accurate condition for purposes of Experiment 2. How can reliance on a less-accurate trading strategies be increased? One way to tip the balance of confidence towards reliance is to decrease investors’ overconfidence in their own abilities, which prior research suggests might be achieved via feedback. For example, in a 21",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 47,
    "chunk_index": 44,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "less-accurate condition for purposes of Experiment 2. How can reliance on a less-accurate trading strategies be increased? One way to tip the balance of confidence towards reliance is to decrease investors’ overconfidence in their own abilities, which prior research suggests might be achieved via feedback. For example, in a 21",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 45,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "production-planning context, F. Davis and Kottemann (1995) show that decision-aid reliance is increased by giving subjects explicit feedback about how much better they would have done had they used the decision aid. In contrast, Ashton (1990) finds that outcome feedback decreases reliance on a decision aid in a bond-rating task.22 This difference in results might be explained by differences in the studies’ task difficulty and decision-aid accuracy. Davis and Kottemann’s production-planning task is very difficult, yet their decision aid is relatively accurate. As a consequence, Davis and Kottemann's subjects’ feedback is almost uniformly negative when they fail to rely on the decision aid, decreasing their confidence in their own abilities, increasing their confidence in the decision aid, and increasing decision-aid reliance. Ashton’s bond-rating task is somewhat easier, yet his aid is relatively inaccurate. As a consequence, Ashton’s subjects received a mix of negative and positive feedback, and sometimes might have received positive feedback for not relying on the aid. This difference probably decreased Ashton’s subjects’ confidence in their decision aid, and also left them more vulnerable to “attribution bias,” whereby they could misattribute chance positive outcomes to their own expertise (see, e.g., Langer and Roth 1975). Thus, while Davis and Kotteman’s feedback convinced their subjects that they should rely on their relatively accurate aid, Ashton’s feedback convinced his subjects that they should continue with idiosyncratic strategies that had performed relatively well. Like the bond-rating context that Ashton (1990) examines, trading strategies tend to be of relatively low accuracy, and chance positive outcomes occur that could encourage attribution bias and increases investors’ overconfidence (De Long, Shleifer, Summers and Waldmann 1991, Daniel et al .1998, Kahneman and Riepe 1998). Therefore, we anticipate that some investors 22 Other accounting studies have examined the extent to which outcome feedback promotes learning in general. Bonner and Walker (1994) find that outcome feedback produces generally poor learning when it is not accompanied 22",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 46,
    "word_count": 317,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Waldmann 1991, Daniel et al .1998, Kahneman and Riepe 1998). Therefore, we anticipate that some investors 22 Other accounting studies have examined the extent to which outcome feedback promotes learning in general. Bonner and Walker (1994) find that outcome feedback produces generally poor learning when it is not accompanied 22",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 47,
    "chunk_index": 47,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "will receive positive feedback, others will receive negative feedback, and that investors will rely more on the trading program when they receive negative feedback. 3.2 Method. Except as noted otherwise, method in experiment 2 was the same as in experiment 1. 3.2.1 Trading program, securities and design. Because we are interested in reliance on less-accurate trading programs, we provided investors with only BUY recommendations (for which the trading program was accurate approximately 55% of the time). Analyses are based on trading decisions concerning the same 15 BUY securities that we used in experiment 1. We manipulated trading-decision aggregation within subjects as in experiment 1. We manipulated feedback by having investors trade five securities before learning about the trading program. Ten “no-feedback” investors received no feedback, and 44 “feedback” investors learned how many of their five trading decisions generated a trading profit. Whether feedback investors received positive or negative feedback depended on their performance. If feedback investors made money on 100%, 80% or 60% of their trades, they received positive feedback (“So far, you have made money on X% of your trades. You have performed very well on this task. Your performance is better than the trading program.”) If they made money on 40%, 20% or 0% of their trades, they received negative feedback (“So far, you have made money on X% of your trades. You have performed very poorly on this task. Your performance is worse than the trading program.”). To reinforce the treatment and provide a manipulation check, investors were also asked to estimate the number of the remaining 15 firms for which they thought they would make the correct trading decision, and then continued with trading as in experiment 1. by sufficient understanding or explanation of the relation between the decision-makers’ judgement and the outcome. Earley (2001) finds that self-explaining this relation also promotes learning. 23",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 47,
    "chunk_index": 48,
    "word_count": 308,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "the remaining 15 firms for which they thought they would make the correct trading decision, and then continued with trading as in experiment 1. by sufficient understanding or explanation of the relation between the decision-makers’ judgement and the outcome. Earley (2001) finds that self-explaining this relation also promotes learning. 23",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 47,
    "chunk_index": 49,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Whether a feedback-investor received positive or negative feedback was determined by their actual performance over their first five trading decisions. While this approach allowed us to truthfully inform investors that the experiment would not employ deception, it meant that we could not assign investors randomly to feedback treatments, thus raising the possibility that any correlation between feedback and trading-program reliance is driven by an omitted variable. For example, investors who approached the experiment with the belief that analysts’ forecasts are too extreme would tend to receive positive feedback and would appear to rely on the trading program, without positive feedback actually causing reliance. We addressed this issue by randomly assigning investors to one of two different sets of five securities to generate feedback. All securities involved projected earnings decreases for which the trading program would recommend BUY. Each security within a set corresponded to a security in the other set that had very similar information, but the two securities had different values (one had a value of $2, while the other had a value of $0). As a result, any systematic trading approach adopted by an investor would create a profitable trade (and positive feedback) for one set but created an unprofitable trade (and negative feedback) for the other set. Since data are pooled across both sets for analysis, such effects should cancel on average, enabling a relatively strong causal inference to be drawn from a significant relation between feedback and trading-program reliance. 3.2.2 Participants. Fifty-four students who had not participated in experiment 1 volunteered to participate in Experiment 2 (40 MBAs, 14 non-MBAs).23 23 MBAs had taken more accounting, finance and decision making courses than had non-MBAs, while non-MBAs had slightly more experience investing in mutual funds. Results are very similar for both groups, so they are collapsed in all analyses. 24",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 47,
    "chunk_index": 50,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "1 volunteered to participate in Experiment 2 (40 MBAs, 14 non-MBAs).23 23 MBAs had taken more accounting, finance and decision making courses than had non-MBAs, while non-MBAs had slightly more experience investing in mutual funds. Results are very similar for both groups, so they are collapsed in all analyses. 24",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 47,
    "chunk_index": 51,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "3.2.3 Instructions and procedure. Instructions were modified to omit any references to a trading program until after investors made case-by-case trading decisions regarding the first five feedback securities. Then, all investors were told that they would soon have access to a trading program that makes money on about 55% of its trading decisions. Feedback investors were also told that, to help them assess how good they are at the task, the next screen would provide them with feedback. Feedback was then provided, and the trading program was described. Instructions describing the trading program were modified to reflect the fact that all securities had projected earnings declines, and that the program would therefore recommend buying all securities. 3.3 Results. Table 3 classifies means of net investment position (Panel A), net security position (Panel B) and net trade size per security (Panel C), by feedback (negative; positive; none), decision aggregation (case-by-case; portfolio), and investors’ trading decision (Buy; Sell). As in experiment 1, investors in all conditions relied on the trading program to some extent, but not completely. No-feedback results indicate a significant aggregation effect for net investment position (Panel A) and net trade size per security (Panel C). The effect of aggregation on net investment position is driven by its effect on net trade size, consistent with the results of experiment 1. Recall that experiment 1 provided no evidence of an aggregation effect for the low-accuracy program. The presence of a more-accurate aid in experiment 1 may have led investors to discount the less-accurate program in that experiment regardless of the level of aggregation. Recall that, before learning about the trading program, we asked feedback investors how they thought they would perform in the next 15 securities. Responses to the question are 25",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 47,
    "chunk_index": 52,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "in experiment 1 may have led investors to discount the less-accurate program in that experiment regardless of the level of aggregation. Recall that, before learning about the trading program, we asked feedback investors how they thought they would perform in the next 15 securities. Responses to the question are 25",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 47,
    "chunk_index": 53,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "consistent with feedback affecting confidence, with negative-feedback investors thinking they would make fewer correct trading decisions than did positive-feedback investors (t=2.62, p<.0144). Table 3, Panel A, shows that the sign of feedback (positive vs. negative) significantly affects net investment position, both in isolation (F = 5.88, p<.010), and in interaction with decision aggregation (F= 3.02, p<.045). Analyses of simple effects (also shown in Panel A) indicate that decision aggregation increases reliance on the trading program in the negative- feedback condition, but (insignificantly) decreases reliance in the positive-outcome condition. These results support the dual-source prediction that portfolio trading increases the extent to which investors consider their general abilities in making trading decisions. The fact that reliance does not increase in the positive-outcome condition suggests that the effect of aggregation does not occur only because the aggregation treatment reminds investors to follow the trading program. The net investment position results are mirrored by results with respect to net trade size per security (Table 3, Panel C), with a significant interaction between feedback and decision aggregation (F= 3.30, p<.038), a significant main effect of feedback (F = 10.57, p<.001), and an insignificant effect of decision aggregation. These results are consistent with experiment 1, since effects on trade size contribute to effects on net investment position. Results with respect to net security position are similar, except there is an insignificant interaction between feedback and decision aggregation. Overall, these results are consistent with trading-strategy reliance being driven by the balance of investors’ assessments of confidence in self v. confidence in the trading strategy. Compared with investors who received positive feedback, investors receiving negative feedback 26",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 47,
    "chunk_index": 54,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "similar, except there is an insignificant interaction between feedback and decision aggregation. Overall, these results are consistent with trading-strategy reliance being driven by the balance of investors’ assessments of confidence in self v. confidence in the trading strategy. Compared with investors who received positive feedback, investors receiving negative feedback 26",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 47,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "tended to rely on the trading program to a greater extent, particularly when they adopted the portfolio perspective that we assert encourages evaluation of general ability. Feedback and decision aggregation appeared to effect net investment primarily through their effect on trade size, again highlighting that these variables affect trading decisions by affecting confidence.24 4.0 Conclusion Sticking to a trading strategy is a surprisingly difficult task. Although investors in our experiments typically made trading decisions that agreed in direction with the trading program, they usually failed to trade a sufficient number of shares. As a consequence, investors earned lower total trading profits than they would have by simply following the trading-program’s recommendations. Investors tended to rely more on a trading program when the program was more accurate, when making trading decisions at a portfolio level, or when trading was preceded by negative feedback concerning investors’ ability to earn profit without a program. Our results support the view that reliance on a trading strategy depends on investors’ confidence in the strategy relative to their confidence in their individual judgments. Our study complements prior experimental research showing that market participants tend to be overconfident in their own judgments (e.g., Moore, Kurtzberg, Fox, and Bazerman 1999). Our findings are also consistent with those of Bloomfield, et al. (2000a), who show that investors overreact to relatively unreliable information (such as the additional information provided for each security, case-by-case) and underreact to relatively reliable information (such as the recommendation of a trading strategy). Future research might seek to link our results more closely to archival research showing that individual investors trade too often, sell winners too early and hold losers (Shefrin and Statman 1993, Odean 1998, 1999, Barber and Odean 2000), 24 As in experiment 1, extent of reliance on the less-accurate program did not affect wealth significantly, so analyses 27",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 47,
    "chunk_index": 56,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "more closely to archival research showing that individual investors trade too often, sell winners too early and hold losers (Shefrin and Statman 1993, Odean 1998, 1999, Barber and Odean 2000), 24 As in experiment 1, extent of reliance on the less-accurate program did not affect wealth significantly, so analyses 27",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 47,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "and that professional mutual fund managers tend to under-perform passive investment strategies (Gruber 1996, O’Shaughnessy 1997). These behaviors are often attributed to errors in confidence, and therefore might be influenced by some of the factors we examine here. Portfolio managers make many decisions at the individual-security level, rather than the portfolio level, and most trading strategies discussed in the literature have relatively low accuracy at the individual-security level. Experiment 1 suggests that this combination leads to the most deviation from trading strategies, implying that investors may rarely succeed in applying disciplined trading strategies or in using such strategies to exploit and eliminate market anomalies. Experiment 2 suggests that under-reliance on trading strategies may be exacerbated by positive feedback. Thus, under-reliance may have been particularly severe in recent years, as a sustained bull market has provided investors with large positive returns whether or not they adhere to trading strategies that earn above-average returns in large samples. Our results suggest several approaches that could increase investors’ reliance on trading strategies. Since trading strategies in practice tend to be of relatively low accuracy (but are potentially still worth while), reliance is most likely to be increased by requiring consideration of trades at the portfolio level or by instituting training programs that highlight the difficulty of profitable trading. Reliance could also be enhanced by using purely automatic programs that remove investors from the decision process, or at least that determine trade size. Several differences between our laboratory setting and natural investment settings suggest that these recommendations be taken cautiously. Unlike the trading program applied in our experiment, trading strategies intended to exploit anomalies in real financial markets are not guaranteed to generate positive returns. Investors may be unable to construct the necessarily of effects on trading profit are not discussed. 28",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 47,
    "chunk_index": 58,
    "word_count": 297,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "settings suggest that these recommendations be taken cautiously. Unlike the trading program applied in our experiment, trading strategies intended to exploit anomalies in real financial markets are not guaranteed to generate positive returns. Investors may be unable to construct the necessarily of effects on trading profit are not discussed. 28",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 47,
    "chunk_index": 59,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "large portfolios, may doubt that the results will continue to be observed in the future, or may believe the research results are artifacts of the archival research design. Therefore, while it appears that the benefits of indexing or trading against anomalies like post-earnings- announcement drift appear relatively stable, reliance on such approaches might be less useful in practice. Further, requiring adherence to a decision aid may encourage inexperienced decision makers to approach aided tasks mechanistically, without becoming actively involved in the task or judgment, thereby hindering learning (Glover, Prawitt, and Spilker, 1997). Future research might examine these issues, which we do not address. Future research might also examine whether the behavior of student investors generalizes to professional investors in this context. Non-professional investors are important market participants and are thus worthy of study (Lipe 1998), but professional investors might tend to rely more on the recommendations of a trading strategy. Prior evidence on this question is mixed. Arkes et al. (1986) and Yates et al. (1991) provide evidence that overconfidence increases with individual expertise, suggesting that more-experienced subjects would tend to under-rely on a trading strategy to an even greater extent. Whitecotton (1996a) provides evidence that, while more experienced subjects were more accurate than less experienced subjects, all benefited from a decision aid to the same extent (although in different ways). As noted previously, we found that the number of accounting and finance courses an investor had taken actually increased their reliance on the trading program (though the results of hypothesis tests held regardless of number of courses). Future research could investigate how trading- strategy reliance differs across investor experience levels, as well as the mechanisms through which this might occur. 29",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 47,
    "chunk_index": 60,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "finance courses an investor had taken actually increased their reliance on the trading program (though the results of hypothesis tests held regardless of number of courses). Future research could investigate how trading- strategy reliance differs across investor experience levels, as well as the mechanisms through which this might occur. 29",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 47,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Future research might also examine more carefully the factors that drive our aggregation and feedback effects. Within our experimental design, several forces could lead to an aggregation effect. Our decision-aggregation manipulation always occurred in a particular order: investors first made case-by-case judgments, and then made portfolio judgments. Although the decrease in reliance demonstrated by positive-feedback investors indicates that the aggregation treatment did not uniformly increase reliance by serving as a reminder to follow the trading program, we cannot rule out some effect of order. Also, the portfolio treatment always organized investors’ trading decisions into the 2x2 design created from the trading-program recommendations and their case-by-case decisions. Thus, portfolio effects could have occurred because investors' decisions were more structured rather than because the portfolio approach encourages investors to consider their general ability and weigh that against the trading program’s accuracy. We chose our approach because we consider it likely that practical portfolio approaches would include structure and be used following consideration of security- specific information, but future research might seek to determine the extent to which ordering and structure affect results. Our design also does not allow us to separate the effects of aggregation on investors’ confidence in themselves from its effects on investors’ confidence in the trading program. It is possible that investors were more confident in the program when making decisions at the portfolio level because they focussed more on the probability that the program would produce a gain across all 15 securities, while at the individual-security level they focussed on only the probability that the program produced a profit for that security. To test whether investors are swayed by number of securities in this manner, we included a debriefing question that asked investors how many shares they would buy of a fund that purchased securities recommended by 30",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 47,
    "chunk_index": 62,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "focussed on only the probability that the program produced a profit for that security. To test whether investors are swayed by number of securities in this manner, we included a debriefing question that asked investors how many shares they would buy of a fund that purchased securities recommended by 30 the less-accurate trading program. We varied between-subjects the number of securities in the fund (10, 150). Investors’ purchasing decisions were insensitive to the number of securities, indicating that they do not spontaneously consider this factor. Finally, our feedback manipulation in experiment 2 could be driven by some unknown omitted variable, because we did not randomly assign feedback subjects in experiment 2 to positive- and negative feedback conditions. Instead, feedback was determined by investors’ decisions over their first five trading decisions. We made this choice because we wanted to comply with our promise to our subjects to not employ deception. As described earlier, we took steps to decrease the potential for omitted variables affecting our results, and we consider that explanation unlikely. However, the only way to rule it out is via random assignment to feedback conditions. 31",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 33,
    "page_range": "p.33-34",
    "total_pages": 47,
    "chunk_index": 63,
    "word_count": 187,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.33-34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "to comply with our promise to our subjects to not employ deception. As described earlier, we took steps to decrease the potential for omitted variables affecting our results, and we consider that explanation unlikely. However, the only way to rule it out is via random assignment to feedback conditions. 31 TABLE 1: Investors’ Agreement With Portfolio Trading Strategy Recommendations Panel A: Net investment position in recommended portfolio: total number shares traded in direction recommended by trading program, minus total number shares traded against trading program recommendation (maximum range: +750 to –750) Net Investment Position In Recommended Portfolio Taken In: Individual Case-By-Case Condition Aggregate Portfolio Condition Program BUY SELL Net Investment BUY SELL Net Investment Difference Recommendation Position Position =Aggr–Indv +11.4 BUY (less accurate) 426.6 76.5 350.2* 420.9 59.3 361.6* n.s. +71.2 SELL (more accurate) 81.8 466.0 384.2* 50.3 505.7 455.4* p < 0.001 Difference +34.0 +93.8 +59.8 =SELL–BUY n.s. p < 0.001 p < 0.001 Panel B: Net security position: total securities traded consistent with the portfolio recommendation minus total securities traded inconsistent with the portfolio recommendation (maximum range: +15 to –15) Net Security Position Taken In: Individual Case-By-Case Condition Aggregate Portfolio Condition Program BUY SELL Net BUY SELL Net Difference Recommendation Security Position Security Position =Aggr–Indv +0.47 BUY (less accurate) 12.26 2.74 9.53* 12.26 2.26 10.00* n.s. +0.64 SELL (more accurate) 3.04 11.96 8.92* 2.40 11.96 9.56* p = 0.079 Difference –0.61 –0.44 +0.17 =SELL–BUY n.s. n.s. n.s. Panel C: Net trade size per security: total shares/security traded consistent with the portfolio recommendation minus total shares/security traded inconsistent with the portfolio recommendation (maximum range: +50 to –50) Net Trade Size Per Security In: Individual Case-By-Case Condition Aggregate Portfolio Condition Program BUY SELL Net Trade Size BUY SELL Net Trade Size Difference Recommendation per Security per Security =Aggr–Indv +0.21 BUY (less accurate) 33.81 19.00 14.81* 34.35 19.33 15.01* n.s. +7.09 SELL (more accurate) 19.19 37.90 18.71* 15.56 41.37 25.80* p < 0.001 Difference +3.90 +10.79 +6.89 =SELL–BUY p = 0.051 p < 0.001 p < 0.001 NOTE: We report one-sided p-values for cell means and for simple contrasts and main effects, as our hypotheses for these means and effects are directional. We report two-sided p-values for interactions, as we have no directional hypotheses. We report p-values greater than 0.10 as non- significant (n.s.). All cell means (*) are significantly greater than zero at p<0.001 and significantly less than maximum possible at p<0.001. 32",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 47,
    "chunk_index": 64,
    "word_count": 403,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "hypotheses for these means and effects are directional. We report two-sided p-values for interactions, as we have no directional hypotheses. We report p-values greater than 0.10 as non- significant (n.s.). All cell means (*) are significantly greater than zero at p<0.001 and significantly less than maximum possible at p<0.001. 32 TABLE 2. Investors’ Trading Profit Individual Case-by-Case Aggregate Portfolio Condition Condition If Followed Trading Trading Difference in Trading Difference in Program Program Profits Trading Profits Trading Difference Recommendation Completely Profits Profits =Aggr–Indv –0.6 BUY (less accurate) 50.00 –23.03 –73.03* –23.63 –73.63* n.s. 38.3 SELL (more accurate) 350.00 232.71 –117.29* 271.04 –78.96* p < 0.001 Difference +255.74 –44.26 +294.67 –5.33 38.9 +300.00 =SELL–BUY p < 0.001 p = 0.009 p < 0.001 n.s. p < 0.001 33",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 47,
    "chunk_index": 65,
    "word_count": 126,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Difference Recommendation Completely Profits Profits =Aggr–Indv –0.6 BUY (less accurate) 50.00 –23.03 –73.03* –23.63 –73.63* n.s. 38.3 SELL (more accurate) 350.00 232.71 –117.29* 271.04 –78.96* p < 0.001 Difference +255.74 –44.26 +294.67 –5.33 38.9 +300.00 =SELL–BUY p < 0.001 p = 0.009 p < 0.001 n.s. p < 0.001 33 TABLE 3. Investors’ Agreement With Trading Strategy Recommendations Panel A: Net investment position in recommended portfolio: total number shares traded in direction recommended by trading program, minus total number shares traded against trading program recommendation (maximum range: +750 to –750) Individual Case-By-Case Condition Aggregate Portfolio Condition Performance on BUY SELL Net Investment BUY SELL Net Investment Difference First Five Securities Position Position =Aggr–Indv +40.1 Negative (n=18) 376.2 104.1 +272.2a 411.3 99.1 +312.2a p=0.024 –59.5 Positive (n=26) 314.2 129.8 +184.4a 255.8 131.0 +124.9a n.s. 34 KCABDEEF Difference +87.8 +187.4 +99.6 =Negative–Positive p=0.080 p=0.003 p=0.045 +44.2 No Feedback Control (n=10) 316.3 146.1 170.2a 350.1 135.7 214.4a p=0.014 Panel B: Net security position: total securities traded consistent with the portfolio recommendation minus total securities traded inconsistent with the portfolio recommendation (maximum range: +15 to –15) Individual Case-By-Case Condition Aggregate Portfolio Condition Performance on BUY SELL Net BUY SELL Net Difference First Five Securities Security Position Security Position =Aggr–Indv +0.0 Negative (n=18) 11.1 3.9 +7.2 a 11.1 3.9 +7.2 a n.s. –1.8 Positive (n=26) 10.1 4.9 +5.2 a 8.3 4.9 +3.4 a n.s. KCABDEEF Difference +2.0 +3.8 +1.8 =Negative–Positive p=0.067 p=0.015 n.s. +0.0 No Feedback Control (n=10) 10.2 4.8 +5.4a 10.2 4.8 +5.4 a n.s. Panel C: Net trade size per security: total shares/security traded consistent with the portfolio recommendation minus total shares/security traded inconsistent with the portfolio recommendation (maximum range: +50 to –50) Individual Case-By-Case Condition Aggregate Portfolio Condition Performance on BUY SELL Net BUY SELL Net Difference First Five Securities Security Position Security Position =Aggr–Indv +4.1 Negative (n=18) 33.1 21.5 +11.6 a 36.7 20.9 +15.7 a p=0.011 –5.1 Positive (n=26) 30.0 28.0 +2.0 n.s. 25.1 28.3 –3.2 n.s. n.s. KCABDEEF Difference +9.6 +18.9 +9.2 =Negative–Positive p=0.022 p=0.001 p=0.038 +3.3 No Feedback Control (n=10) 32.7 26.7 +6.0b 35.8 26.5 +9.3a p=0.0291 NOTE: We report one-sided p-values, as our hypotheses for these means and effects are directional. We report p-values greater than 0.10 as non- significant (n.s.). All cell means are significantly greater than zero at (a) p<0.01, (b) p<0.05, (c) p<0.10, (n.s.) p>0.10.",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 47,
    "chunk_index": 66,
    "word_count": 390,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "(n=10) 32.7 26.7 +6.0b 35.8 26.5 +9.3a p=0.0291 NOTE: We report one-sided p-values, as our hypotheses for these means and effects are directional. We report p-values greater than 0.10 as non- significant (n.s.). All cell means are significantly greater than zero at (a) p<0.01, (b) p<0.05, (c) p<0.10, (n.s.) p>0.10.",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "1.0 Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1.0 Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Arkes, H. R., R. M. Dawes, and C. Christensen. 1986. Factors influencing the use of a decision rule in a probabilistic task. Organizational Behavior And Human Decision Processes 37: 93-110. Ashton, R. H. 1990. Pressure and performance in accounting decision settings: Paradoxical effects of incentives, feedback, and justification. Journal of Accounting Research 28 (Supplement): 148-180. Ashton, R. H. 1992. Effects of justification and a mechanical aid on judgment performance. Organizational Behavior And Human Decision Processes 52 (2): 292-306. Barber, B. M., and T. Odean. 2000. Trading is hazardous to your wealth: The common stock investment performance of individual investors. The Journal of Finance 55: 773-806. Bernard, V. and J. Thomas. 1990. Evidence that stock prices do not fully reflect the implications of current earnings for future earnings. Journal Of Accounting And Economics 13: 305- 340. Blattberg, R. C., and J. S. Hoch (1990). Database models and managerial intuition: 50% model and 50% manager. Management Science 36 (8): 887-899. Bloomfield, R. J., R. Libby, and M. W. Nelson. 1996. Communication of confidence as a determinant of group judgment accuracy. Organizational Behavior And Human Decision Processes 68: 287-300. Bloomfield, R. J., R. Libby, and M. W. Nelson. 2000a. Underreactions overreactions and moderated confidence. Journal of Financial Markets 3: 113-137. Bloomfield, R. J., R. Libby, and M. W. Nelson. 2000b. Do investors over-rely on old elements of the earnings time-series? Working paper, Cornell University. 37",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 47,
    "chunk_index": 68,
    "word_count": 232,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Decision Processes 68: 287-300. Bloomfield, R. J., R. Libby, and M. W. Nelson. 2000a. Underreactions overreactions and moderated confidence. Journal of Financial Markets 3: 113-137. Bloomfield, R. J., R. Libby, and M. W. Nelson. 2000b. Do investors over-rely on old elements of the earnings time-series? Working paper, Cornell University. 37 Boatsman, J. R., C. Moeckel, and B.K.W. Pei (1997). The effects of decision consequences on auditors’ reliance on decision aids in audit planning. Organizational Behavior And Human Decision Processes 71 (2): 2311-247. Bonner, S. E., R. Libby, and M. Nelson. 1996. Using decision aids to improve auditors’ conditional probability judgments. The Accounting Review 71 (2): 221-240. Bonner, S. E., and P. L. Walker. 1994. The effects of instruction and experience on the acquisition of auditing knowledge. The Accounting Review 69 (1): 157-178. Brenner, L. A., D. J. Koehler, V. Liberman, and A. Tversky. 1996. Overconfidence in probability and frequency judgments: A critical examination. Organizational Behavior and Human Decision Processes 65 (3): 212-219. Capon, A. 1998. Best quantitative manager: Pareto Partners. Global Investor. 109: 24. Chan, L. K. C., N. Jegadeesh, and J. Lakonishok. 1996. Momentum strategies. Journal of Finance 51 (5): 1681-1713. Daniel, K., D. Hirshleifer, and A. Subrahmanyam. Investor psychology and security market under- and overreactions. The Journal of Finance 53 (6): 1839-1885. Davis, E. B. (1998). Decision aids for going-concern evaluation: Expectations of partial reliance. In. Advances In Accounting Behavioral Research, Vol. 1, edited by J. E. Hunton, pp. 33-59. Stamford, CT: Jai Press Inc. Davis, F. D., G. L. Lohse, and J. E. Kottemann. 1994. Harmful effects of seemingly helpful information on forecasts of stock earnings. Journal of Economic Psychology 15: 253- 267. Davis, F. D. and J. E. Kottemann. 1995. Determinants of decision rule use in a production planning task. Organizational Behavior And Human Decision Processes 63: 145-157. 38",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 47,
    "chunk_index": 69,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "and J. E. Kottemann. 1994. Harmful effects of seemingly helpful information on forecasts of stock earnings. Journal of Economic Psychology 15: 253- 267. Davis, F. D. and J. E. Kottemann. 1995. Determinants of decision rule use in a production planning task. Organizational Behavior And Human Decision Processes 63: 145-157. 38 Dawes, R. M. 1979. The robust beauty of improper linear models in decision making. American Psychologist 34: 571-582. Dawes, R. M., D. Faust, and P. E. Meehl. 1989. Clinical Versus Actuarial Judgement. Science 243: 1668-1674. DeBondt, W. F. M. and R. H. Thaler. 1990. Do security analysts overreact? Journal Of Accounting And Economics 80: 52-57. De Long, J. B., A. Shleifer, L. Summers, and R. J. Waldmann. 1991. Positive feedback investment strategies and destabilizing rational speculation. The Journal of Finance 45 (2): 379-396. Earley, C. E. 2001. Knowledge acquisition in auditing: Training novice auditors to recognize cue relationships in real estate valuation. The Accounting Review, forthcoming. Einhorn, J. H. 1972. Expert measurement and mechanical combination. Organizational Behavior And Human Decision Performance 7 (1): 86-106. Eining, M. M., D. R. Jones, and J. K. Loebbecke. 1997. Reliance on decision aids: An examination of auditors’ assessment of management fraud. Auditing: A Journal Of Practice And Theory 16: 1-19. Evans, G., and D. Shirreff. 1994. Distilling the gambler's art. Euromoney 307 (November): 35- 41. Essinger, J. 1989. The debate over computer-assisted trading: Who is right? Financial Executive 5 (1): 49-55. Fama, E.F. 1998. Market efficiency, long-term returns, and behavioral finance. Journal of Financial Economics 49: 283-306. 39",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 47,
    "chunk_index": 70,
    "word_count": 254,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "16: 1-19. Evans, G., and D. Shirreff. 1994. Distilling the gambler's art. Euromoney 307 (November): 35- 41. Essinger, J. 1989. The debate over computer-assisted trading: Who is right? Financial Executive 5 (1): 49-55. Fama, E.F. 1998. Market efficiency, long-term returns, and behavioral finance. Journal of Financial Economics 49: 283-306. 39 Frankel, R., and C. M. C. Lee. 1998. Accounting valuation, market expectation, and cross- sectional stock returns. Journal Of Accounting And Economics 25: 283-319. Gastineau, G. L. 1991. From the board: A short history of program trading. Financial Analysts Journal 47 (5): 4-7. Gigerenzer, G. U. Hoffrage, and H. Kleinbolting. 1991. Probabilistic mental models: A Brunswikian theory of confidence. Psychological Review 98 (4): 506-528. Glover, S. M. 1997. The influence of time pressure and accountability on auditors' processing of nondiagnostic information. Journal Of Accounting Research 35: 213-226. Glover, S. M., D. F. Prawitt, and B. C. Spilker (1997). The influence of decision aids on user behavior: Implications for knowledge acquisition and inappropriate reliance. Organizational Behavior And Human Decision Processes 72 (2): 232-255. Griffin, D., and A. Tversky. 1992. The weighing of evidence and the determinants of confidence. Cognitive Psychology 24: 411-435. Gruber, M. J. 1996. Another puzzle: The growth in actively managed mutual funds. The Journal of Finance 51: 783-810. Hackenbrack, K. 1992. Implications of seemingly irrelevant evidence in audit judgment. Journal Of Accounting Research. 30(1): 126-136. Hoch, S. J., and D. A. Schkade. 1996. A psychological approach to decision support systems. Management Science 42 (1): 51-64. Hoffman, V. B., and J. M. Patton. 1997. Accountability, the dilution effect, and conservatism in auditors' fraud judgements. Journal Of Accounting Research 35 (2): 227-237. 40",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 47,
    "chunk_index": 71,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Accounting Research. 30(1): 126-136. Hoch, S. J., and D. A. Schkade. 1996. A psychological approach to decision support systems. Management Science 42 (1): 51-64. Hoffman, V. B., and J. M. Patton. 1997. Accountability, the dilution effect, and conservatism in auditors' fraud judgements. Journal Of Accounting Research 35 (2): 227-237. 40 Kachelmeier, S. J. and W. F. Messier, Jr. 1990. An investigation of the influence of a nonstatistical decision aid on auditor sample size decisions. Accounting Review 65 (1): 209-226. Kahneman, D., and M. W. Riepe. 1998. Aspects of investor psychology. Journal of Portfolio Management 24 (4): 52-65. Keren, G. 1991. Calibration and probability judgments: Conceptual and methodological issues. Acta-Psychologica 77 (3): 217-273. Kleinmuntz, B. 1990. Why we still use our heads instead of formulas: Towards an integrative approach. Psychological Bulletin 107: 296-310. Kothari, S. P. 2000. Capital markets research in accounting. Working paper, M.I.T. Kyle, A. S. 1985. Continuous auctions and insider trading. Econometrica 53: 1315-1336. Laing, J. R. 1995. New brains: How “smart” computers are beating the stock market. Barron’s, February 27: 29-33. Langer, E. J., and J. Roth. 1975. Heads I win tails it’s chance: The illusion of control as a function of the sequence of outcomes in a purely chance task. Journal of Personality and Social Psychology 32: 951-955. Libby, R., and P. A. Libby. 1989. Expert measurement and mechanical combination in control reliance decisions. Accounting Review 64 (4): 729-747. Lichtenstein, S., B. Fischhoff, and L.D. Phillips. 1982. Calibration of Probabilities: The State of the Art to 1980. In Judgment Under Uncertainty: Heuristics and Biases, edited by D. Kahneman, P. Slovic, and A. Tversky, 306-334. Cambridge, MA: Cambridge University Press. 41",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 47,
    "chunk_index": 72,
    "word_count": 274,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "in control reliance decisions. Accounting Review 64 (4): 729-747. Lichtenstein, S., B. Fischhoff, and L.D. Phillips. 1982. Calibration of Probabilities: The State of the Art to 1980. In Judgment Under Uncertainty: Heuristics and Biases, edited by D. Kahneman, P. Slovic, and A. Tversky, 306-334. Cambridge, MA: Cambridge University Press. 41",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 47,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Lipe, M. G. 1998. Individual investors' risk judgments and investment decisions: The impact of accounting and market data. Accounting, Organizations And Society 23 (7): 625-640. Longo, T. 1998. The numbers don’t lie. Financial Planning. September 1: 85-88. Longo, J. M., and M. S. Long. 1997. Using neural networks to differentiate between winner and loser stocks. Journal Of Financial Statement Analysis 2 (2): 5-15. Maines, L.A., and Hand, J.R.M., 1996. Individuals' perceptions and misperceptions of time series properties of quarterly earnings. The Accounting Review 71: 317-337. Mazzoni, G., and T. O. Nelson. 1995. Judgments of learning are affected by the kind of encoding in ways that cannot be attributed to the level of recall. Journal Of Experimental Psychology: Learning, Memory, And Cognition 21 (5): 1263-1274. McClish, D. K., and S. H. Powell. 1989. How well can physicians estimate mortality in a medial intensive-care unit. Medical Decision Making 9 (2): 125-132. Meehl, P. E. 1954. Clinical Versus Statistical Prediction; A Theoretical Analysis And A Review Of The Evidence. Minneapolis, MN: University of Minnesota Press. Messier, W. F. Jr. (1995). Research in and development of audit decision aids. In Judgment And Decision-Making Research In Accounting And Auditing, edited by R. Ashton and A. H. Ashton, 207-228. New York, NY: Cambridge University Press. Moore, D. A., T. R. Kurtzberg, C. R. Fox, and M. H. Bazerman. 1999. Positive illusions and forecasting errors in mutual fund investment decisions. Organizational Behavior And Human Decision Processes 79 (2): 95-114. Nisbett, R. E., H. Zukier, and R. E. Lemley. 1981. The dilution effect: Nondiagnostic information weakens the implications of diagnostic information. Cognitive Psychology 13 (2): 248-277. 42",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 47,
    "chunk_index": 74,
    "word_count": 269,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "M. H. Bazerman. 1999. Positive illusions and forecasting errors in mutual fund investment decisions. Organizational Behavior And Human Decision Processes 79 (2): 95-114. Nisbett, R. E., H. Zukier, and R. E. Lemley. 1981. The dilution effect: Nondiagnostic information weakens the implications of diagnostic information. Cognitive Psychology 13 (2): 248-277. 42 O’Brien, R. 2000. For the New Year, trading volume is soaring, signaling conviction. Wall Street Journal, January 18: C2. Odean, T. 1998. Volume, volatility, price, and profit when all traders are above average. Journal of Finance 53: 1887-1934. Odean, T. 1999. Do investors trade too much? The American Economic Review 89: 1279-1298. O’Shaughnessy, J. P. 1997. What Works On Wall Street: A Guide to the Best-Performing Investment Strategies of All Time. New York, NY: McGraw-Hill. Powell, J. L. 1991. An attempt at increasing decision rule use in a judgment task. Organizational Behavior And Human Decision Processes 48: 89-99. Schneider, S. L. 1995. Item difficulty, discrimination, and the confidence-frequency effect in a categorical judgment task. Organizational Behavior And Human Decision Processes 61 (2): 148-167. Sharpe, W., and G. Alexander. 1990. Investments (4th edition). Englewood Cliffs, NJ: Prentice Hall. Shefrin, H. M., and M. Statman. 1993. The disposition to sell winners too early and ride losers too long: Theory and evidence. In Advances In Behavioral Finance, edited by R. H. Thaler, 507-526. New York, NY: Russell Sage Foundation. Shelton, S. W. 1999. The effect of experience on the use of irrelevant evidence in auditor judgment. Accounting Review 74 (2): 217-224. Sloan, R. G. 1996. Do stock prices fully reflect information in accruals and cash flows about future earnings? Accounting Review 71: 289-315. Sniezek, J. A. and T. Buckley. 1991. Confidence depends on level of aggregation. Journal Of Behavioral Decision Making 4: 263-272. 43",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 47,
    "chunk_index": 75,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "auditor judgment. Accounting Review 74 (2): 217-224. Sloan, R. G. 1996. Do stock prices fully reflect information in accruals and cash flows about future earnings? Accounting Review 71: 289-315. Sniezek, J. A. and T. Buckley. 1991. Confidence depends on level of aggregation. Journal Of Behavioral Decision Making 4: 263-272. 43 Sniezek, J. A., P. W. Paese, and F. S. Switzer. 1990. The effect of choosing on confidence in choice. Organizational Behavior And Human Decision Processes 46 (2): 264-282. Swaminathan, B., and C. M. C. Lee. 2000. Do stock prices overreact to earnings news? Working paper, Cornell University. Treadwell, J. R., and T. O. Nelson. 1996. Availability of information and the aggregation of confidence in prior decisions. Organizational Behavior And Human Decision Processes 68: 13-27. Weber, D. 1996. When a fund manager is a computer. Medical Economics 73 (12): 105-108, 111. Whitecotton, S. M. 1996a. The effect of experience and a decision aid on the slope, scatter and bias of earnings forecasts. Organizational Behavior And Human Decision Processes 66 (1): 111-121. Whitecotton, S. M. 1996b. The effects of experience and confidence on decision aid reliance: A causal model. Behavioral Research In Accounting 8: 194-216. Whitecotton, S. M., and S. A. Butler. 1998. Influencing decision aid reliance through involvement in the information selection process. Behavioral Research In Accounting 10: 182-200. Whitecotton, S. M., D. E. Sanders, and K. B, Norris. 1998. Improving predictive accuracy with a combination of human intuition and mechanical decision aids. Organizational Behavior And Human Decision Processes 76 (3): 325-348. Yaniv, I., and R. M. Hogarth. 1993. Judgmental versus statistical prediction: Information asymmetry and combination rules. Psychological Science 4 (1): 58-62. 44",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 47,
    "chunk_index": 76,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  },
  {
    "text": "Sanders, and K. B, Norris. 1998. Improving predictive accuracy with a combination of human intuition and mechanical decision aids. Organizational Behavior And Human Decision Processes 76 (3): 325-348. Yaniv, I., and R. M. Hogarth. 1993. Judgmental versus statistical prediction: Information asymmetry and combination rules. Psychological Science 4 (1): 58-62. 44 Yates, J. F., L. S. McDaniel, and E. S. Brown. 1991. Probabilistic forecasts of stock prices and earnings: The hazards of nascent expertise. Organizational Behavior And Human Decision Processes 49: 60-79. Ye and Johnson, 1995. The impact of explanation facilities on user acceptance of expert systems advice. MIS Quarterly 19 (2): 157-172. 45",
    "title": "Confidence and Investors Reliance on Disciplined Trading Strategies",
    "source_type": "pdf",
    "document_id": "88880f2e3609",
    "source_file": "Confidence and Investors Reliance on Disciplined Trading Strategies.pdf",
    "section": "REFERENCES",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 47,
    "chunk_index": 77,
    "word_count": 103,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "REFERENCES (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20001110134202",
    "duration": null
  }
]