[
  {
    "text": "* Day trading for a living? Fernando Chague(cid:132), Rodrigo De-Losso(cid:133), Bruno Giovannetti(cid:159) June 13, 2020 Abstract We show that it is virtually impossible for individuals to day trade for a living, contrary to what course providers claim. We observe all individuals who began to day trade between 2013 and 2015 in the Brazilian equity futures market, the third in terms of volume in the world. We (cid:28)nd that 97% of all investors who persisted for more than 300 days lost money. Only 1.1% earned more than the Brazilian minimum wage and only 0.5% earned more than the initial salary of a bank teller (cid:22) all with great risk. JEL Codes: C92, G02, G11, G12 Keywords: day trade, retail investors, course providers *WethankCVM(ComissªodeValoresMobiliÆrios)forprovidingthedata(ConvŒnioUSP/5988;Processo CVM: 19957.003353/2015-85) and Justin Birru, Bernardo Guimaraes, Bernard Herskovic, and Emanuel Ornelas for their valuable comments. (cid:132)Sao Paulo School of Economics - FGV, Brazil. (cid:133)Department of Economics, University of Sao Paulo, Brazil. E-mail: delosso@usp.br. (cid:159)SaoPauloSchoolofEconomics-FGV,Brazil. E-mail: bruno.giovannetti@fgv.br. Correspondingauthor at: Rua Itapeva, 474, Sao Paulo - SP, Brazil. E-mail: bruno.giovannetti@fgv.br. 1 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 9,
    "chunk_index": 0,
    "word_count": 177,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "Bernardo Guimaraes, Bernard Herskovic, and Emanuel Ornelas for their valuable comments. (cid:132)Sao Paulo School of Economics - FGV, Brazil. (cid:133)Department of Economics, University of Sao Paulo, Brazil. E-mail: delosso@usp.br. (cid:159)SaoPauloSchoolofEconomics-FGV,Brazil. E-mail: bruno.giovannetti@fgv.br. Correspondingauthor at: Rua Itapeva, 474, Sao Paulo - SP, Brazil. E-mail: bruno.giovannetti@fgv.br. 1 Electronic copy available at: https://ssrn.com/abstract=3423101 1 Introduction (cid:16)[...] Our task is to use our research and teaching to curb the rent-seeking dimension of (cid:28)nance. We should use our research to challenge exiting practices in (cid:28)nance and blow the whistle on what does not work. We should be watchdogs of the (cid:28)nancial industry [...].(cid:17) 2015 American Finance Association presidential address (Zingales, 2015). Day trading is the activity of buying and selling the same (cid:28)nancial asset on the same day in the same quantity. According to a 2017 article in Forbes, (cid:16)day trading is the new 1 sexy that gets an inordinate amount of hype.(cid:17) A web search for the term (cid:16)day trading for a 2 living(cid:17) displays encouraging results. For instance, an article by Investopedia with the title (cid:16)Should you quit your job to trade stocks?(cid:17) begins as follows: (cid:16)Trading is often viewed as a high barrier-to-entry (cid:28)eld, but this is simply not the case in today’s market. Now, anyone with ambition and patience can trade, and do it for a living, even with little to no money. Sounds fantastic? It is, and there are so many options available to people with the desire to put in the time to learn.(cid:17) Indeed, many brokerage houses and websites provide day trading 3 courses for individuals. Is it really possible to day trade for a living? The few existing studies that evaluate the performance of retail day traders report somewhat encouraging results. Linnainmaa (2003; 2005), Jordan and Diltz (2003), Choe and Eom (2009), Ryu (2012), and Kuo and Lin (2013) document that more than 20% of the individuals pro(cid:28)t. However, they do not di(cid:27)erentiate individuals with a single day trade from those who day trade regularly. Naturally, the odds of winning at the casino roulette decreases with the number of times one plays. The same occurs with day trading, as we show. 1https://www.forbes.com/sites/nealegodfrey/2017/07/16/day-trading-smart-or-stupid/#411e5d8a1007 (as of June 12, 2020). 2Investopedia is an American website based in New York City that focuses on investing and (cid:28)- nancial education and has nearly 100 million monthly page views. The article can be found at https://www.investopedia.com/articles/trading/09/how-to-trade-for-a-living.asp (as of June 20, 2020). 3See, for instance, https://www.investopedia.com/articles/active-trading/061214/best-daytrading- schools.asp, as of June 20 2020. 2 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 9,
    "chunk_index": 1,
    "word_count": 414,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "website based in New York City that focuses on investing and (cid:28)- nancial education and has nearly 100 million monthly page views. The article can be found at https://www.investopedia.com/articles/trading/09/how-to-trade-for-a-living.asp (as of June 20, 2020). 3See, for instance, https://www.investopedia.com/articles/active-trading/061214/best-daytrading- schools.asp, as of June 20 2020. 2 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 9,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "Only two papers, Barber, Lee, Liu, and Odean (2014) and Barber et al. (2019), also split day traders according to the number of days they trade. They (cid:28)nd that less than 3% of the frequent day traders present consistent pro(cid:28)t. Our results con(cid:28)rm this low fraction. However, Barber, Lee, Liu, and Odean (2014) report that the top frequent day traders earn very high and consistent pro(cid:28)ts, what can still encourage individuals to try to day trade for a living. We do not (cid:28)nd that. The very top frequent day trader in our sample earned only US$310 per day with a enormous risk (a standard deviation of US$2,560). A possible reason for the di(cid:27)erence is that, during their sample (1992 to 2006), retail day traders did not have to compete for pro(cid:28)ts with institutional high-frequency trading (HFTs) algorithms, which are increasingly active in today’s market. We are also the (cid:28)rst paper to analyze if frequent day traders improve their performance over time, a crucial piece of information for those willing to enroll in day trading courses. We (cid:28)nd they do not. 2 The empirical analysis OurdatasetcomesfromtheComissªodeValoresMobiliÆrios(CVM),theBrazilianequivalent to the Securities and Exchange Commission (SEC) in the US. We follow all individuals 4 who day traded (cid:16)mini-Ibovespa(cid:17) futures contracts . Mini-Ibovespa futures are the preferred assets by day traders in Brazil, being the third most traded equity index futures and options contracts in the world(cid:22)ahead of the E-mini S&P 500 Futures and S&P 500 Index Options, 5 for example. We observe the day trading pro(cid:28)ts for the mini-Ibovespa futures contracts of all individuals, uniquely and anonymously identi(cid:28)ed, from 2012 to 2017. We use the (cid:28)rst year of our dataset, 2012, to identify new retail day traders as follows. 4The underlying asset of the mini-Ibovespa future is the Ibovespa index, a portfolio with the 66 most liquid stocks listed in Brazil. 5AccordingtotheFuturesIndustryAssociation(FIA)2018report, themini-Ibovespafuturestotaled706 million contracts, ahead of the E-mini S&P 500 Futures (445 million contracts), S&P 500 Index Options (371), EuroStoxx50IndexFutures(318), andNikkei225MiniFutures(273). Alsoaccordingtothisreport, thefuturesandoptionstradingvolumeoftheBrazilianExchangerankedthirdintheworldwith2.57billion contracts closed. 3 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 9,
    "chunk_index": 3,
    "word_count": 338,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "of the mini-Ibovespa future is the Ibovespa index, a portfolio with the 66 most liquid stocks listed in Brazil. 5AccordingtotheFuturesIndustryAssociation(FIA)2018report, themini-Ibovespafuturestotaled706 million contracts, ahead of the E-mini S&P 500 Futures (445 million contracts), S&P 500 Index Options (371), EuroStoxx50IndexFutures(318), andNikkei225MiniFutures(273). Alsoaccordingtothisreport, thefuturesandoptionstradingvolumeoftheBrazilianExchangerankedthirdintheworldwith2.57billion contracts closed. 3 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 9,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "We say an individual began to day trade in 2013 if we see no day trading activity from him or her in 2012; analogously, we say an individual began to day trade in 2014 if we see no day trading activity from him or her in 2012 and 2013; and so on. We observe a total of 19,646 individuals beginning to day trade from 2013 to 2015. We do not consider the individuals who began to day trade in 2016 and 2017 (53,246 individuals) since we need to have at least two years of day trading to evaluate performance. We analyze pro(cid:28)ts net of transaction costs by subtracting exchange and brokerage fees. Importantly, we abstract from income taxes and other relevant expenses such as costs of trading platforms and courses. As such, our results overestimate day trading pro(cid:28)ts. Out of the 19,646 new day traders, 1,111 (5.7%) day traded only one day, 9,978 (50.8%) between 2 to 50 days, 3,100 (15.8%) between 51 to 100 days, 2,738 (13.9%) between 101 to 200 days, 1,168 (5.9%) between 201 to 300 days, and 1,551 (7.9%) for more than 300 days. Figure 1 shows the fraction of individuals with a positive net pro(cid:28)t in each of these six groups. The probability of an individual exhibiting a positive pro(cid:28)t monotonically de- creases with the number of days he or she trades. This peculiar pattern is contrary to what (cid:16)self-selection(cid:17)(cid:22)individuals who persist in an activity are generally those with better perfor- mance(cid:22)and (cid:16)learning by doing(cid:17) would suggest. In turn, patterns like this are usually found in gambling activities, such as the casino roulette, where the proportion of successful players also monotonically decreases with the number of rounds played. We then run individual-day panel regressions (with the 1,551 individuals who decided to persist for at least 300 trading days) of the day trade daily pro(cid:28)t on seq, a variable that chronologically orders the trading day of each individual (it is 1 for the (cid:28)rst day of day trading, 2 for the second day of day trading, and so on). Alternatively, we use as explanatory variables two dummy variables, (cid:28)rst third and last third, that are one in the (cid:28)rst third of the investor’s trading days and in the last third of the investor’s trading days, respectively. Regressions include day traders (cid:28)xed-e(cid:27)ects. If there is learning on average among these persistent day traders, we should observe a positive coe(cid:30)cient of seq, and a 4 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 9,
    "chunk_index": 5,
    "word_count": 412,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "(cid:28)rst third of the investor’s trading days and in the last third of the investor’s trading days, respectively. Regressions include day traders (cid:28)xed-e(cid:27)ects. If there is learning on average among these persistent day traders, we should observe a positive coe(cid:30)cient of seq, and a 4 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 9,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "positive coe(cid:30)cient of last third along with a negative coe(cid:30)cient of (cid:28)rst third. Table 1 shows the results. In columns 1 and 2 (gross pro(cid:28)t) and 3 and 4 (net pro(cid:28)t) we (cid:28)nd no evidence of learning. [Table 1 about here] Finally, we evaluate the performance of the 1,551 individuals who day traded for at least 300 days. Considering the performance net of exchange and brokerage fees, we (cid:28)nd that 97% of all investors who persisted for more than 300 days lost money. Only 17 individuals (1.1% of 1,551) earned more than the Brazilian minimum wage (US$ 16 per day), only eight individuals (0.5% of 1,551) earned more than the initial salary of a bank teller (US$ 6 54 per day), and the individual who earned the most earned US$ 310 per day on average. Importantly, theeightindividualswhoearnedmorethantheinitialsalaryofabanktellerdid so with great volatility: the standard deviation of the daily pro(cid:28)t of these eight individuals ranges from US$ 632 to US$ 3,308. This can be seen in Figure 2, which displays a scatter- plot with the the daily net pro(cid:28)t average (horizontal axis) and the daily net pro(cid:28)t standard deviation (vertical axis) of each one of the 47 day traders who obtained positive net pro(cid:28)t. [Figure 2 about here] 3 Conclusion We show that it is virtually impossible for an individual to day trade for a living, contrary to what brokerage specialists and course providers often claim. The previous literature was not so clear about this. 6TheaverageminimumwageinBrazilduringtheyears2013-2017isUS$3,965.96peryear. Ourreference for a bank teller wage is US$13,648.86 per year, which is the minimum bank teller wage agreed between unions and banks for 2016 (we consider the bank workers’ union with the largest number of members in Brazil, see http://spbancarios.com.br/sites/default/(cid:28)les/cct/arquivo/1181_cct_2016_2018.pdf). All legal bene(cid:28)ts are included to compute yearly wages. 5 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 9,
    "chunk_index": 7,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "wage is US$13,648.86 per year, which is the minimum bank teller wage agreed between unions and banks for 2016 (we consider the bank workers’ union with the largest number of members in Brazil, see http://spbancarios.com.br/sites/default/(cid:28)les/cct/arquivo/1181_cct_2016_2018.pdf). All legal bene(cid:28)ts are included to compute yearly wages. 5 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 9,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "Barber, B., Y. Lee, Y. Liu, T. Odean, and K. Zhang, 2019, Learning, fast or slow, Review of Asset Pricing Studies, forthcoming . Barber, Brad M., Yi-Tsung Lee, Yu-Jane Liu, and Terrance Odean, 2014, The cross-section of speculator skill: Evidence from day trading, Journal of Financial Markets 18, 1(cid:21)24. Choe, Hyuk, and Yunsung Eom, 2009, The disposition e(cid:27)ect and investment performance in the futures market, Journal of Futures Markets 29, 496(cid:21)522. Jordan, Douglas J., and J. David Diltz, 2003, The pro(cid:28)tability of day traders, Financial Analysts Journal 59, 85(cid:21)94. Kuo, Wei-Yu, and Tse-Chun Lin, 2013, Overcon(cid:28)dent individual day traders: Evidence from the taiwan futures market, Journal of Banking and Finance 37, 3548 (cid:21) 3561. Linnainmaa, Juhani, 2003, The Anatomy of Day Traders, SSRN Scholarly Paper ID 472182, Social Science Research Network, Rochester, NY. Linnainmaa, Juhani, 2005, The individual day trader, University of California, Berkeley, working paper . Ryu, D, 2012, The pro(cid:28)tability of day trading: An empirical study using high-quality data, Investment Analysts Journal 41, 43(cid:21)54. Zingales, Luigi, 2015, Presidential Address: Does Finance Bene(cid:28)t Society?, The Journal of Finance 70, 1327(cid:21)1363. 6 Electronic copy available at: https://ssrn.com/abstract=3423101 A Tables and Graphs gross net of fees tiforp evitisop htiw sredart yad fo noitcarF 4.0 3.0 2.0 1.0 0 1 2 to 50 51 to 100 101 to 200 201 to 300 > 300 Number of trading days Figure 1: Fraction of day traders with positive pro(cid:28)t This (cid:28)gure shows the fraction of individuals with positive gross pro(cid:28)t (black line with circles) and positive net pro(cid:28)t (red line with triangles). Individuals are separated into six groups accordingtotheirtotalnumberoftradingdays. Thedashedlinesindicatethe95%con(cid:28)dence interval. 7 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "References",
    "page_number": 6,
    "page_range": "p.6-7",
    "total_pages": 9,
    "chunk_index": 9,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.6-7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "of trading days Figure 1: Fraction of day traders with positive pro(cid:28)t This (cid:28)gure shows the fraction of individuals with positive gross pro(cid:28)t (black line with circles) and positive net pro(cid:28)t (red line with triangles). Individuals are separated into six groups accordingtotheirtotalnumberoftradingdays. Thedashedlinesindicatethe95%con(cid:28)dence interval. 7 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 9,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "noitaived dradnats tiforp ten yliaD 000,4 000,3 000,2 000,1 0 egaw muminim egaw laitini rellet knab 0 100 200 300 Daily net profit average (US$) Figure 2: A closer look at the 47 day traders with positive net pro(cid:28)t This (cid:28)gure shows the daily net pro(cid:28)t average (horizontal axis) and the daily net pro(cid:28)t stan- dard deviation (vertical axis) of each one of the 47 day traders (3.0% of the 1,551 persistent day traders) who obtained positive net pro(cid:28)t. The (cid:28)rst dashed vertical line indicates the Brazilian minimum wage (US$ 16 per day) and the second, the initial salary of a bank teller (US$ 54 per day). 8 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": ")$SU(",
    "page_number": 8,
    "page_range": "p.8-9",
    "total_pages": 9,
    "chunk_index": 11,
    "word_count": 113,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")$SU( (p.8-9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  },
  {
    "text": "the 47 day traders (3.0% of the 1,551 persistent day traders) who obtained positive net pro(cid:28)t. The (cid:28)rst dashed vertical line indicates the Brazilian minimum wage (US$ 16 per day) and the second, the initial salary of a bank teller (US$ 54 per day). 8 Electronic copy available at: https://ssrn.com/abstract=3423101 gnidart yad yb gninraeL :1 elbaT eW .syad gnidart 003 tsael ta rof tsisrep ot dediced ohw sredart yad 155,1 eht htiw snoisserger lenap yad-laudividni swohs elbat sihT eht rof 2 ,yad tsr(cid:28) eht rof 1( sedart yad s’rotsevni eht sredro yllacigolonorhc taht elbairav a ,qes no )$SU ni( t(cid:28)orp yliad rieht sserger gnidart s’rotsevni eht fo driht tsr(cid:28) eht ni eno era taht (cid:17),driht tsal(cid:16) dna (cid:17)driht tsr(cid:28)(cid:16) ,selbairav ymmud owt no dna ,)...no os dna ,yad dnoces snmuloc dna ,st(cid:28)orp ssorg edart yad redisnoc 2 dna 1 snmuloC .ylevitcepser ,syad gnidart s’rotsevni eht fo driht tsal eht ni dna syad srorre dradnatS .stce(cid:27)e dex(cid:28) redart yad edulcni snoisserger llA .seef egarekorb dna egnahcxe fo ten st(cid:28)orp edart yad redisnoc 4 dna 3 .ylevitcepser ,slevel %01 dna ,%5 ,%1 eht ta ecnac(cid:28)ingis etacidni * dna ,** ,*** .sisehtnerap ni era level rotsevni eht ta deretsulc t(cid:28)orp ten yliad t(cid:28)orp ssorg yliad )4( )3( )2( )1( *910.0- 500.0 qes )110.0( )110.0( 247.1 335.0- driht tsr(cid:28) )757.2( )094.2( 967.5- 021.0- driht tsal )695.3( )693.3( ***54.84- ***99.44- ***70.82- ***74.92- tnatsnoc )36.1( )58.2( )35.1( )27.2( %40.2 %40.2 %23.1 %23.1 2R 736,417 736,417 736,417 736,417 N 9 Electronic copy available at: https://ssrn.com/abstract=3423101",
    "title": "Day Trading for a Living",
    "source_type": "pdf",
    "document_id": "4f3d7742da8a",
    "source_file": "Day Trading for a Living.pdf",
    "section": ")$SU(",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 9,
    "chunk_index": 12,
    "word_count": 248,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")$SU( (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20200613175712-03'00'",
    "duration": null
  }
]