[
  {
    "text": "Did Retail Traders Take Over Wall Street? A Tick-by-Tick Analysis of GameStop’s Price Surge* Guofu Zhou† Zhaoque (Chosen) Zhou‡ Current Version: November 2023 *WearegratefultoJeremyBertomeu,XingHuang,RobertKieschnick,ChristopherReilly,PingleWang and Kelsey Wei, and seminar participants at Fordham University, Iowas State University, Stevens Institute of Technology, University of Illinois Chicago, University of Texas in Dallas and Washington University in St. Louisfortheirhelpfulcomments. †WashingtonUniversityinSt. Louis,JohnM.OlinBusinessSchool,zhou@wustl.edu. ‡WashingtonUniversityinSt. Louis,JohnM.OlinBusinessSchool,zhaoque@wustl.edu. Electronic copy available at: https://ssrn.com/abstract=4560320 Did Retail Traders Take Over Wall Street? A Tick-by-Tick Analysis of GameStop’s Price Surge Abstract In January 2021, GameStop experienced an extraordinary surge in its stock price, soaring from $17.25 on January 4 to a pre-market value of $514.50 on January 28. In contrast to previous studies, we use tick-by-tick data of stock and option trading to demonstrate that this remarkable surge comes mainly from overnight trading, driven mainly by institutional orders rather than by those from retail investors. Moreover, the daily GME holdings of retail investors are trending down, rather up, right before the surge. Although sophisticated option traders typically maintain a positive gamma position, option market makers regulate their gamma exposure by participating in retail option trades. An “after-hours gamma squeeze” was triggered by a twitter catalyst, causing eventually the well-known GME short squeeze. We also provide an extended model of BrunnermeierandPedersen(2005)thatexplainssomeofourmajorfindings. Keywords: GameStop,shortsqueeze,gammasqueeze,institutionaltrading,shortseller. JELClassification: G12,G13,G14,G18. Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-3",
    "total_pages": 84,
    "chunk_index": 0,
    "word_count": 217,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "positive gamma position, option market makers regulate their gamma exposure by participating in retail option trades. An “after-hours gamma squeeze” was triggered by a twitter catalyst, causing eventually the well-known GME short squeeze. We also provide an extended model of BrunnermeierandPedersen(2005)thatexplainssomeofourmajorfindings. Keywords: GameStop,shortsqueeze,gammasqueeze,institutionaltrading,shortseller. JELClassification: G12,G13,G14,G18. Electronic copy available at: https://ssrn.com/abstract=4560320 “Marketscanstayirrationallongerthanyoucanstaysolvent.” —JohnMaynardKeynes 1 Introduction The performance of GameStop stock between late January and early February 2021 was an extraordinaryeventinthestockmarkethistory. Inamerethreeweeks,thestockpriceofthevideo gameretailerskyrocketedfrom$17.25persharetoanall-timehighof$514.50,1 anunprecedented increaseofalmost3,000%. Thisrapidandsubstantialsurgecausedconsiderablefinanciallossesto well-knownshortsellers. Thoughthisaccomplishestheobjectiveofnumerousonlineretailtraders who assert this as they defeat the Wall street in their own game. There are a number of important unanswered questions. Are they really the major force behind the surge? As a group, are they makingprofits? Fromaregulatorypointofview,istherereallyashortsqueeze? WhoisresponsibletheGameStopshortsqueeze? NewsmediaandrecentstudiesbyAllenetal. (2023), Bradley et al. (2023), and Hu et al. (2021) suggest that the short squeeze is mainly caused by retail investors and social media platforms. Although the media, the SEC, and congressional hearings have mainly focused on these retail investors, the institutional side of the short squeeze has received little consideration. We use tick-by-tick data of both stock and option trading to identify retail and institutional trades, and find that it is the institutional investors who play a greater role in exploiting the apparent media hype that drives the meme stocks for consecutive daily rallies, and it is a subsequent twitter catalyst that triggers both short and gamma squeezes, resulting the GameStop price climax. Interestingly, prior to the surge, the daily GME holdings of retail investors are trending down instead of trending up, suggesting that both the timing of the surgeanditsmagnitudearebeyondtheirexpectations. Our paper reveals that the price rises of the GameStop stock are mainly attributable to after- hourssessionsratherthantheregulartradingsessions. Weinvestigateinstitutionalandretailorder 1OnJanuary28at6:03AMEST,twotransactionswerecompletedatthisprice. 1 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 84,
    "chunk_index": 1,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "to the surge, the daily GME holdings of retail investors are trending down instead of trending up, suggesting that both the timing of the surgeanditsmagnitudearebeyondtheirexpectations. Our paper reveals that the price rises of the GameStop stock are mainly attributable to after- hourssessionsratherthantheregulartradingsessions. Weinvestigateinstitutionalandretailorder 1OnJanuary28at6:03AMEST,twotransactionswerecompletedatthisprice. 1 Electronic copy available at: https://ssrn.com/abstract=4560320 flows over different time frames, including daily, regular and after-hour trading sessions, and 1- minuteintervals. Ourfindingsconsistentlyshowthatinstitutionaltradinghasadominatingpositive effect on GameStop’s price dynamics, particularly during periods of the price surge. Contrary to popularbelief,retailtradingdoesnothavenearlythesamelevelofinfluence. Although it is difficult to definitively tell whether the overnight institutional order flow is mainly from institutional short sellers or institutional speculators, we have uncovered their large trades that have enormous impact on prices. While short sellers usually cover their short positions inaliquidmarkettoreducefurtherlosses,speculatorswhowanttotriggertheshortsqueezeprefer tobuyinanilliquidmarkettocausepricesurgeswithlimitedtrades. Consisientwiththeirinterest to drive up the price up, it is these institutional speculators who are active players during the day sessions of trading, primary players in the after-hour sessions, and are main drivers of the price surge. Ourdetailedtickbytickanalysisprovidesabetterunderstandingoftheroleofinstitutional tradersintheGameStopshortsqueeze. Do institutional speculators, as sophisticated traders, take advantage of options during a short squeeze? Mittsetal.(2022)highlightthepresenceofagammasqueezeinGameStopoptions. Our researchusestick-by-tickoptiontradedatatodemonstratethatbothretailandsophisticatedoption traders tend to write call and put options rather than buying them during the surge period from January1,2021toMarch31,2021. Additionally,weproposeamethodtocalculatedailynetopen interestdelta. Itsvalueimpliesthatoptionsmarketmakersholdlargerunderlyingpositions,leading to a decrease in the supply of tradable shares. Therefore, a larger net delta predicts a higher after- hours return, while also having a negative effect on the following day’s market quality. We also compute a net open interest gamma measure. Although sophisticated option traders only slightly mitigatetheirgammapositionsduringthesurgeperiod,optionsmarketmakersstrategicallyreduce their gamma risk by engaging with retail option traders. This strategy allows them to effectively manage their gamma exposure, resulting in their gamma risk being at its lowest level during the sampleperiodpriortotheonsetoftheshortsqueeze. ThisfindingisinlinewiththeOctober2021 SECreport,whichfindslimitedevidenceofintradaygammasqueeze. 2 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 84,
    "chunk_index": 2,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "interest gamma measure. Although sophisticated option traders only slightly mitigatetheirgammapositionsduringthesurgeperiod,optionsmarketmakersstrategicallyreduce their gamma risk by engaging with retail option traders. This strategy allows them to effectively manage their gamma exposure, resulting in their gamma risk being at its lowest level during the sampleperiodpriortotheonsetoftheshortsqueeze. ThisfindingisinlinewiththeOctober2021 SECreport,whichfindslimitedevidenceofintradaygammasqueeze. 2 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 84,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "However,ourpaperrevealsauniquetypeofthegammasqueeze,whichwerefertoasthe“after- hoursgammasqueeze”thatiscausedbyasuddenincreaseintheafter-hoursstockprice. Thisprice surge turns large quantity of out-of-the-money (OTM) call options into large quantity of at-the- money (ATM) call options, significantly increasing gamma exposure. As a result, option market makers, who may have a minor gamma exposure at the end of the day, experience an incredible rapid increase in delta exposure due to the amplified gamma exposure, thus necessitating them to hedge their positions in the thinly traded stock market during the after-hours session. This is the only choice for them to hedge since the options market is closed during after-hours session. For example, on the night of January 26, the position of 6,506 net long OTM call options, with strike pricesrangingfrom$150to$230,suddenlybecomesdeepin-the-moneyafterthepricesurgesover $300,apricejumpduetoElonMusk’ssurprisingtweetthatalsohasalinktothewellknowReddit WallStreetBets. This creates the perfect environment for an “after-hours gamma squeeze”, which helps to understand the actions of the various types of option traders involved in the GameStop shortsqueeze. Due to anonymity of individual players in our data, we are unable to definitively find out how and which institutional speculators use stocks and options to contribute mainly to the short squeeze. Nevertheless, to provide some insights on that, we extend the model of Brunnermeier and Pedersen (2005) to incorporate options trading and explain the actions of the speculators who target short sellers. Our model suggests that the predators, in order to maximize their profits, are likely to initiate a short squeeze in a market with limited liquidity while maintaining a positive gammastance. Thispredictionisconsistentwithourempiricalresults. Furthermore, our model describes that during the early stages of the short squeeze, both institutionalspeculatorsandinstitutionalshortsellersengageinbuyingstocks. Asthepricereaches its zenith, the institutional speculators divest their holdings to the short sellers. This dynamic, as posited by our model, engenders a balanced institutional order flow and contributes to minor price fluctuations. Remarkably, both of these phenomena were observed on January 27, 2021, 3 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 84,
    "chunk_index": 4,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "institutionalspeculatorsandinstitutionalshortsellersengageinbuyingstocks. Asthepricereaches its zenith, the institutional speculators divest their holdings to the short sellers. This dynamic, as posited by our model, engenders a balanced institutional order flow and contributes to minor price fluctuations. Remarkably, both of these phenomena were observed on January 27, 2021, 3 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 84,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "when Melvin Capital closed their short position during the afternoon of the same day,2 leading to substantiallossesinthebillionsofdollars. Overall, our evidence suggests that it is the sophisticated institutional investors who take advantage of the situation and go along with the retail investors, and then make the most out of it in the end. Consistent with our tick-by-tick trading analysis, anecdotal evidence shows that, althoughtheretailinvestorswonthewarwiththeshortsellers,theylosttheirmoneyintheprocess. Our study contributes to several areas of literature. Our primary focus is on the literature that examines short squeezes. A related contribution is Brunnermeier and Pedersen (2005), who develop a theoretical model for predatory trading. This concept involves intentional trading in conjunction with large traders being forced to liquidate a position. They argue that such trading would reduce market liquidity and increase costs for large traders. Allen et al. (2021) investigate the Porsche-Volkswagen (VW) short squeeze of 2008. Through a unique dataset obtained from legalproceedingsagainstPorsche,theauthorsreconstructPorsche’sstockandoptionsholdingsin VW. Their analysis reveals how Porsche’s management orchestrates one of the most remarkable short squeezes in history. Our research builds on this literature by conducting an empirical and theoretical analysis of the GameStop short squeeze. We use tick by tick data to analyze the price impact during regular and after-hours trading, and the role of institutions and individual traders. Ourextendedmodeltakesintoaccounttheroleoftheoptionsmarket,akeyfactorinshort squeezes,andprovidesinsightsintotheoptimalstrategyofpredatorytraders,whichareconsistent with our empirical findings. While the October 2021 SEC report finds limited signs of a short squeeze,3 recentstudiesbyAllenetal.(2023)andMittsetal.(2022)suggestotherwise. Ourstudy providesdetailedandtradinglevelevidencethatthereareshortsqueezesinbothstocksandoptions hedging. Our study adds to the literature on retail investors. Barber and Odean (2000) provide the first 2https://www.cnbc.com/video/2021/01/27/melvin-capital-sells-out-of-gamestop.html 3See the SEC’s “Staff Report on Equity and Options Market Structure Conditions in Early 2021,” at https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early-2021.pdf 4 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 84,
    "chunk_index": 6,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "limited signs of a short squeeze,3 recentstudiesbyAllenetal.(2023)andMittsetal.(2022)suggestotherwise. Ourstudy providesdetailedandtradinglevelevidencethatthereareshortsqueezesinbothstocksandoptions hedging. Our study adds to the literature on retail investors. Barber and Odean (2000) provide the first 2https://www.cnbc.com/video/2021/01/27/melvin-capital-sells-out-of-gamestop.html 3See the SEC’s “Staff Report on Equity and Options Market Structure Conditions in Early 2021,” at https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early-2021.pdf 4 Electronic copy available at: https://ssrn.com/abstract=4560320 empirical evidence that trading is hazardous to the wealth of retail investors. Consistent with their message, we find that in the era of zero commissions, retail investors still lose in trading. Among thelargebodyoftheliterature,Boehmeretal.(2021)provideanalgorithmtoidentifyretailtrades, and McLean et al. (2023a,b) analyze how retail investors respond to analysts’ revisions, and what their return predictive ability is. Recently, Barber et al. (2023) refine the algorithm for identifying retailtrades. Incontrasttothesestudies,ourpaperisthefirsttostudytheroleofretailinvestorsin ashortsqueeze. Our study also adds to the growing body of literature on intraday trading behaviors among different participants in the options market. Bryzgalova et al. (2022) develop a method to distinguish retail option trades, finding that retail investors usually opt for cheaper weekly options and lose money. Moussawi et al. (2023) discover the advantage of market makers who provide liquidityinbothETFandoptionsmarkets. Thesemarketmakerstakeadvantageoftheirdualroles by engaging in intraday arbitrage following ETF order flow shocks, profiting from the liquidity providedbysophisticatedoptiontraders. Bryzgalovaetal.(2023)revealsub-optimalnon-exercise of retail call options, with market makers profiting from these mistakes. Our contribution to this fieldisourproposedapproachtocalculatethenetopeninterestGreeks,whichservesasaproxyfor the option market makers risk exposure. Additionally, we demonstrate that option market makers strategically reduce their gamma exposure before short squeezes through retail options trades, despitesophisticatedoptiontraders’tendencytokeeptheirgammapositions. The remainder of this paper is organized as follows. Section 2 summarizes the background of GameStop 2021 event. Section 3 describes the underlying data. Section 4 analyzes stock market orderflows. Section5providesanalysesrelatedtotheoptionsmarket. Section6takesacloselook atthedaysofthefinals. Section7developsamodeltoexplaintheempiricalobservations. Section 8concludes. 5 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 84,
    "chunk_index": 7,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "before short squeezes through retail options trades, despitesophisticatedoptiontraders’tendencytokeeptheirgammapositions. The remainder of this paper is organized as follows. Section 2 summarizes the background of GameStop 2021 event. Section 3 describes the underlying data. Section 4 analyzes stock market orderflows. Section5providesanalysesrelatedtotheoptionsmarket. Section6takesacloselook atthedaysofthefinals. Section7developsamodeltoexplaintheempiricalobservations. Section 8concludes. 5 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 84,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "2 Background Due to the Covid-19 pandemic and the advent of commission-free trading platforms such as Robinhood, there is a large increase of retail investors’ involvement in the stock market prior to January 1, 2021. During this time, the stocks that piqued the interest of these retail investors were primarily those widely recognized by consumers, the so-called “meme stocks” including GME. The discussions focused on the GameStop in particular have escalated on social media platforms, and some of the postings, such as those from Keith Gill, who is a well-known writer and an influential trader, call explicitly the followers to buy GME, which, along with other meme stocks, starts to rise quickly in early January. But the trading volume and short interest are much not as extreme as at this time and the attention just starts to accumulate and explode later. As Figure 1 shows, the daily closing prices and trading volumes of GameStop have seen a dramatic increase since the beginning of 2021, with the peak occurring in late January. It should be noted that there havebeennosignificantchangestothecompanyduringthistime. [InsertFigure1here.] In countering the large, fundamental-baseless price moves, hedge funds and other institutions, such as Melvin Capital and Citron Research, enter short positions to profit from mispricing from the fundamental value. On the other hand, some other institutions and famous investors, such as RCVenturesLLC,havelonglargepositionsandtakearideintheGMEpricemovement.4 Hence, anensuringbattleofpricebetweenthelongandtheshorthasstarted. In fact, even before the huge publicity and intensified social media attention, Melvin Capital, forexample,hadalreadybetGMEtogodown,whichreportedholding60,000longputoptionsin its Q4 2020 Form 13-F (short positions are unreported as required by the SEC5). In contrast, RC 4Some speculators may go long, as the famous George Soros reported said, “When I see a bubble forming, I rush in to buy, ... this is not irrational.” (see. e.g., https://seekingalpha.com/article/ 4085934-when-i-see-bubble-forming-i-rush-in-to-buy(2017). 5Seeformoredetailsfrom“FAQaboutform13F”,https://www.sec.gov/divisions/investment/13ffaq. 6 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 84,
    "chunk_index": 9,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "positions are unreported as required by the SEC5). In contrast, RC 4Some speculators may go long, as the famous George Soros reported said, “When I see a bubble forming, I rush in to buy, ... this is not irrational.” (see. e.g., https://seekingalpha.com/article/ 4085934-when-i-see-bubble-forming-i-rush-in-to-buy(2017). 5Seeformoredetailsfrom“FAQaboutform13F”,https://www.sec.gov/divisions/investment/13ffaq. 6 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 84,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "VenturesLLCcontinuestoincreaseitsstakeinGameStop,reachingownershipof9millionshares accordingtotheirDecember17Form13-Dfiling. By January 22, the GameStop stock enjoys a remarkable change in its stock price to $65.01. On January 25, Melvin Capital was given $2.75 billion from Citadel and Point72 to help mitigate margincallriskfromitslosingpositions.6 The performance of the stock in after-hours trading was remarkable. On January 25, it opened at $96.73, a significant jump from the previous close of $65.01. Then it skyrocketed to a peak of $159.18, before settling at $76.79 at the end of the day. On January 26, after another significant surgeinafter-hourstrading,thestockopenedat$88.56andendedat$147.98. At 4:08 PM EST on January 26, Elon Musk sent out a tweet that caused an unprecedented market reaction: “Gamestonk!!”. This resulted in a 140% surge in the stock price overnight, with theopeningpriceonJanuary27being$354.83. Laterthatday,MelvinCapitalcloseditsGameStop short position,7 which had little effect on the price. The closing price at the end of the day was $347.51,almostthesameastheopeningprice. On January 27, the National Securities Clearing Corporation (NSCC) experienced a record- breakingtransactionvolume.8 Thiswasfollowedbythereleaseofdailymarginstatementsshortly after 5 AM EST on January 28. As a result, many clearing members saw a significant increase in VaRcharges,leadingtoadditionalcapitalpremiumcharges. Robinhood,inparticular,wasrequired to provide a $1.4 billion deposit to the NSCC pre-market on January 28, which was an increase from the $690 million by the end of the day on January 27.9 At 9 AM EST, the NSCC waived excess capital premium charges for clearing members.10 Subsequently, the GameStop stock price dropped from the all-time high of $514.50 at 6:03 AM to an opening price of $265, before rising 6https://www.wsj.com/articles/citadel-point72-to-invest-2-75-billion-into-melvin-capital-management-11611604340 7https://www.cnbc.com/video/2021/01/27/melvin-capital-sells-out-of-gamestop.html 8https://www.dtcc.com/-/media/Files/PDFs/Testimony-of-Michael-Bodson-050621.pdf 9https://www.congress.gov/117/meeting/house/111207/witnesses/HHRG-117-BA00-Wstate-TenevV-20210218. pdf 10Inaccordancewiththe“T+2”settlementruleintheUSequitymarket,atwo-day“settlementperiod”isobserved. Withinthistimeframe,clearingmembers,suchasRobinhood,areobligatedtoprovideadepositfromtheirownfunds (notcustomerfunds)totheNSCC.Thisdepositservestomitigateriskuntilthetradeissuccessfully“settled.” 7 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 84,
    "chunk_index": 11,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "9 AM EST, the NSCC waived excess capital premium charges for clearing members.10 Subsequently, the GameStop stock price dropped from the all-time high of $514.50 at 6:03 AM to an opening price of $265, before rising 6https://www.wsj.com/articles/citadel-point72-to-invest-2-75-billion-into-melvin-capital-management-11611604340 7https://www.cnbc.com/video/2021/01/27/melvin-capital-sells-out-of-gamestop.html 8https://www.dtcc.com/-/media/Files/PDFs/Testimony-of-Michael-Bodson-050621.pdf 9https://www.congress.gov/117/meeting/house/111207/witnesses/HHRG-117-BA00-Wstate-TenevV-20210218. pdf 10Inaccordancewiththe“T+2”settlementruleintheUSequitymarket,atwo-day“settlementperiod”isobserved. Withinthistimeframe,clearingmembers,suchasRobinhood,areobligatedtoprovideadepositfromtheirownfunds (notcustomerfunds)totheNSCC.Thisdepositservestomitigateriskuntilthetradeissuccessfully“settled.” 7 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 84,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "totheintradaypeakof$483. Iteventuallyclosedat$193.60onJanuary28. The price and volatility of GameStop stock remained high after its peak in late January. On February 24, a surge in short-dated call option activity was observed, with call option volumes reaching their highest point in almost three weeks.11 The stock price rose twofold in the last 90 minutes of regular trading, closing at $91.71. This momentum continued into after-hours trading, resulting in an 85% increase to the opening price of $169.56 on February 25. The price stayed around$200foranothermonth. AsofMarch24,ReutersreportedthatshortinterestinGameStop had dropped to 15%, a significant decrease from the peak of 141% in the first week of 2021.12 This decline was further confirmed by semi-monthly equity short interest data from the Financial Industry Regulatory Authority (FINRA) which shows a continuous downward trend from January 1, 2021 to March 31, 2021.13 Thus, we can conclude that the price surge period has ended. After March 31, 2021, the price remained above $150, but volatility and volume have decreased significantly. The GameStop episode in January 2021 is often described as a modern-day battle between small and large, with retail investors battling against major financial institutions. Is this really the case? Are they the winners or are they eventually the victims too? After the price surge in late March, many Reddit users reported considerable losses. Reddit CEO Steve Huffman commented that most users end up losing money.14 In what follows, we will focus on whether retail investors areresponsiblefortheshortsqueezeingeneral,andthesurgeandsubsequentlyfallonJanuary27. Thesqueezehasreportedlycausedsignificantfinanciallosses,amountingtobillionsofdollars,for somewell-knownshortsellers.15 11https://www.ft.com/content/50eaa1b5-d244-4b3e-b460-736828c049cd 12https://www.reuters.com/article/idUSKBN2BG28H 13https://www.finra.org/finra-data/browse-catalog/equity-short-interest/data 14https://www.washingtonpost.com/technology/2021/02/02/gamestop-stock-plunge-losers/ 15By the end of January 2021, media reports indicated that Melvin Capital lost $3.75 billion and D1 Capital Partners lost $4 billion. ( https://www.theguardian.com/business/2021/jan/27/ gamestop-stocks-us-hedge-fund-pulls-out-after-heavy-losses and https://www.bloomberg.com/ news/articles/2021-01-28/dan-sundheim-s-20-billion-d1-capital-loses-about-20-this-month# xj4y7vzkg) 8 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 84,
    "chunk_index": 13,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "follows, we will focus on whether retail investors areresponsiblefortheshortsqueezeingeneral,andthesurgeandsubsequentlyfallonJanuary27. Thesqueezehasreportedlycausedsignificantfinanciallosses,amountingtobillionsofdollars,for somewell-knownshortsellers.15 11https://www.ft.com/content/50eaa1b5-d244-4b3e-b460-736828c049cd 12https://www.reuters.com/article/idUSKBN2BG28H 13https://www.finra.org/finra-data/browse-catalog/equity-short-interest/data 14https://www.washingtonpost.com/technology/2021/02/02/gamestop-stock-plunge-losers/ 15By the end of January 2021, media reports indicated that Melvin Capital lost $3.75 billion and D1 Capital Partners lost $4 billion. ( https://www.theguardian.com/business/2021/jan/27/ gamestop-stocks-us-hedge-fund-pulls-out-after-heavy-losses and https://www.bloomberg.com/ news/articles/2021-01-28/dan-sundheim-s-20-billion-d1-capital-loses-about-20-this-month# xj4y7vzkg) 8 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 84,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "3 Data and Descriptive Statistics Using intraday trade-level information from January 1, 2020 to December 31, 2021, our paper draws from the Daily Trades and Quotes (DTAQ) and CBOE LiveVol datasets. These sources provide a detailed view of tick-by-tick GME stock and options trades. The CBOE trade data provide insights into transaction prices, implied volatility, delta, trading volume, best bid and ask quotes for options, and underlying prices. We follow the methodology of Holden and Jacobsen (2014)andAndersenetal.(2021),respectively,filterandcleantheintradaystockandoptionsdata. Weimproveouranalysisbyincorporatingintradaydatasetswithadditionaldatasources. Weobtain daily return and stock price information from CRSP, daily options volume and options’ Greek information from OptionMetrics, daily stock market quality data from the Intraday Indicators database by WRDS, the daily securities lending market data from IHS Markit and daily short salevolumefromFINRA. [InsertTable1here.] Wepresent acomprehensive setof descriptive statisticsregarding GameStop’sperformancein Table 1. The surge period, which is the time frame in which we observe a monotonic reduction in short interest, is from January 1, 2021, to March 31, 2021. The pre-surge phase is from January 1, 2020, to December 31, 2020, and the post-surge period is from April 1, 2021, to December 31, 2021. Table 1 Panel A reveals that the all-day return (close-to-close) is significantly higher during the surge period. When broken down into its components - overnight return (close-to-open) and intraday return (open-to-close) - the substantial divergence is mainly due to the overnight return. On the other hand, the intraday return during the surge period does not differ significantly from the pre- and post-surge periods. Additionally, both overnight and intraday volumes experience a dramatic increase during the surge period. In particular, the primary cause of this substantial increase is the intraday volume, which increases from 5.98 million shares prior to the surge, to 9 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 84,
    "chunk_index": 15,
    "word_count": 289,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "from the pre- and post-surge periods. Additionally, both overnight and intraday volumes experience a dramatic increase during the surge period. In particular, the primary cause of this substantial increase is the intraday volume, which increases from 5.98 million shares prior to the surge, to 9 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 84,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "41.27 million shares during the surge. Furthermore, using the Lee and Ready (1991) algorithm, weclassifytradesasbuyer(seller)initiatedtradesandcomputethesignedvolumeasthedifference between buy volume and sell volume. The signed volume indicates that only the overnight signed volume has a significant change during surge period. This is evidenced by more overnight buy trades and more intraday sell trades being executed during surge period. Furthermore, the average overnight signed volume during surge period is 100.53 thousand shares, which is close to the average all-day signed volume of 101.98 thousand shares during pre-surge period. These metricsdemonstrateadistinctdivergenceinthetradingpatternbetweentheintradayandovernight sessions. Table 1 Panel B provides an overview of the metrics of the options market. As expected, both realized and implied volatilities show a significant increase during the surge period. Additionally, the trading volume of options experiences a considerable surge, with a shift in the preferences of options traders. Specifically, there is an increase in the trading of put options during the surge period,whilecalloptionsarepredominantbeforeandafterthesurge. Moreover,weclassifybuyer- initiated option trades as those with trade prices above the midpoint, and seller-initiated option tradesasthosewithtradepricesbelowthemidpoint,excludingmidpointtrades,asperthemethod outlined in Savickas and Wilson (2003).16 The statistics demonstrate a nearly equal buying and sellingpatterninbothcallandputoptions. 4 Is There a Short Squeeze? The GameStop short squeeze has been investigated by both the Securities and Exchange Commission (SEC) and academic researchers. In October 2021, the SEC released a report that 16Savickas and Wilson (2003) demonstrate that such a method has the highest success rate among four popular optiontradeclassificationrules. Furthermore,Bryzgalovaetal.(2022)usearecentdataset(November2019toJune 2021) to confirm that the option trade imbalances calculated based on the quote rule we used are highly correlated (94%)withtheoneswiththeMuravyev(2016)method. 10 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 84,
    "chunk_index": 17,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "SEC released a report that 16Savickas and Wilson (2003) demonstrate that such a method has the highest success rate among four popular optiontradeclassificationrules. Furthermore,Bryzgalovaetal.(2022)usearecentdataset(November2019toJune 2021) to confirm that the option trade imbalances calculated based on the quote rule we used are highly correlated (94%)withtheoneswiththeMuravyev(2016)method. 10 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 84,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "suggestslimitedevidenceofashortsqueeze.17 Allenetal.(2023)andMittsetal.(2022),however, provide evidence contrary to the SEC conclusion of no short squeeze. Based on considerable increases in short interest and average borrowing fees, as well as a notable rise in available short quantityduringtheperiodofthepricesurge,Allenetal.(2023)concludethatshortsqueezeshave taken place among the meme stocks, including GameStop. Mitts et al. (2022) use primarily the volume of shares returned to lenders as a metric, and they find that the associated trading volume accounts for around 80% from January 27 to 29. This pattern of high trading volume returned to lenders during the most severe price surge period provide clear evidence of short squeeze and liquidation on both sides. The SEC’s investigation mainly focuses on intraday trading activities, wheretheyfindthatbuyingbythosewithshortpositionswasonlyasmallfractionofthetotalbuy volume.18 We aim to provide more direct and arguably more substantially evidence on short squeeze. First, we make a clear distinction of regular-hours trading and after-hours trading and find that the major price moves come from after-hours trading. Second, we identify retail and institutional tradesandfindthatitisinstitutionaltraderswhodrivethemarket,especiallyinafter-hourstrading. Third, we obtain multiple evidence, from signed trading volume, weighted price contribution and intraday high-frequency analysis, to confirm further the main results. Moreover, option trading analysis, provided in the next Section, provides additional evidence on the short squeeze and on whoarethemaindriverofthesqueeze. 4.1 Short Interest and Short Volume Allen et al. (2023) propose that a short-squeeze event is characterized by a sudden rise in stock 17SEC published a “Staff Report on Equity and Options Market Structure Conditions in Early 2021” that can be downloadedfrom https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early-2021. pdf 18Their intraday Volume Weighted Average Price (VWAP) chart, depicted as Figure 6 in the report, falls short in capturing the intricate details of after-hour price movements, particularly the overnight activity that occurred on January26th. 11 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 84,
    "chunk_index": 19,
    "word_count": 282,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Conditions in Early 2021” that can be downloadedfrom https://www.sec.gov/files/staff-report-equity-options-market-struction-conditions-early-2021. pdf 18Their intraday Volume Weighted Average Price (VWAP) chart, depicted as Figure 6 in the report, falls short in capturing the intricate details of after-hour price movements, particularly the overnight activity that occurred on January26th. 11 Electronic copy available at: https://ssrn.com/abstract=4560320 price, a high short interest before the surge, and a decrease in short interest during and after the surge. They employ the securities lending market data to verify that GameStop exhibited a short-squeeze pattern during the beginning of 2021, thus conclude that there is a short squeeze on GameStop. How do short sellers behave during the surge period? Do the short-selling market run wellduringsurgeperiod? Toanswerthesequestions,weexplorefurtherbyincorporatingthedaily shortvolumedataobtainedfromFINRA. [InsertFigure2here.] Figure2displaysthedailyshortinterestandthedailyshortvolumeovertime. Theshortinterest is measured by the ‘quantity on loan’ in IHS Markit data, while the short volume is the total share amountofshortsaletradesexecutedondifferentexchanges. Theamountofshortinterestdecreases significantly from 53 million shares on January 4, 2021 to 7.7 million shares on March 31, 2021. However, daily short sales trading is highly active in the same period, with an average daily short volume of 9.5 million shares, which is six times higher than the average daily short volume in 2020(1.5millionshares). Thisobservationyieldstwoinsights. First,thedecreaseinshortinterest during the surge period is likely due to short sellers closing their pre-existing positions, as new short selling positions are continuously being created. The high short volume also indicates that theshort-sellingmarketisfunctioningproperlyduringthesurgeperiod,whichmayhaveprevented an even more extreme price surge on GameStop. Second, active short-selling activities during the surgeperiodmakeiteasierforshortsellerstocovertheirpositions,astheycanbuyfrominvestors who are initiating fresh short-selling positions when other investors keep holding the underlying stock. Inconclusion,thereisapotentialshortsqueezeeventoccurringinGameStop,however,due tothehighlydevelopedshort-sellingmarketintheUS,theeffectofthissqueezeismild. 12 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 84,
    "chunk_index": 20,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "positions are continuously being created. The high short volume also indicates that theshort-sellingmarketisfunctioningproperlyduringthesurgeperiod,whichmayhaveprevented an even more extreme price surge on GameStop. Second, active short-selling activities during the surgeperiodmakeiteasierforshortsellerstocovertheirpositions,astheycanbuyfrominvestors who are initiating fresh short-selling positions when other investors keep holding the underlying stock. Inconclusion,thereisapotentialshortsqueezeeventoccurringinGameStop,however,due tothehighlydevelopedshort-sellingmarketintheUS,theeffectofthissqueezeismild. 12 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 84,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "In addition to regular trading hours (RTH) between 9:30 AM and 4 PM Eastern Time (EST) in the United States, both NASDAQ and NYSE offer after-hours trading sessions that include pre-market (from 4 AM to 9:30 AM EST) and after-market (from 4 PM to 8 PM EST) trading. Barclay and Hendershott (2003) demonstrate that after-hours trading has distinct characteristics compared to trading during regular market hours. During after-hours sessions, the trading volume is usually lower, market makers are less likely to provide quotes, and trading costs are usually higher than during regular trading hours. Although some popular brokers allow their customers to submitandexecuteordersoutsideofregulartradinghours,19 retailcustomersareoftendiscouraged from participating due to warnings of increased risk levels. Therefore, Barclay and Hendershott (2003) suggest that the after-hours trading session is mainly dominated by professional or quasi- professionaltraderswhohavestrongincentivestotrade. [InsertFigure3here.] Figure 3 illustrates the cumulative overnight and intraday returns for GameStop (GME) and a benchmark stock BestBuy (BBY) which is in the same industry and of similar size but is not targeted by social media. The overnight returns on day t are calculated as the difference between the closing price at 4:00 PM on day t−1 and the opening price at 9:30 AM on day t. GME’s overnightreturnsappeartohaveagreaterimpactonthestockpricethanitsintradayreturns,which are the returns from the market open to close. The high correlation between GME’s overnight cumulativereturnsanditsbuy-and-holdreturns(ρ=0.99)suggeststhatovernighttradingactivities significantly affect the price of GME stock. In addition, 79.19% of the GME buy-and-hold return from January 2020 to December 2021 is attributed to the overnight period. This is in agreement with the significant increase in overnight return, as seen in Table 1. If the findings of Barclay 19As of May 2023, several prominent brokerage firms, including Charles Schwab, E*Trade, Interactive Brokers’ IBKR Lite, Robinhood, and TD Ameritrade, execute their customers’ after-hours orders during two time periods: 7 AM to 9:30 AM EST and 4 PM to 8 PM EST. Additionally, Interactive Brokers’ IBKR Pro offers its clients early accesstothemarketsstartingfrom4AMEST. 13 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 84,
    "chunk_index": 22,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "including Charles Schwab, E*Trade, Interactive Brokers’ IBKR Lite, Robinhood, and TD Ameritrade, execute their customers’ after-hours orders during two time periods: 7 AM to 9:30 AM EST and 4 PM to 8 PM EST. Additionally, Interactive Brokers’ IBKR Pro offers its clients early accesstothemarketsstartingfrom4AMEST. 13 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 84,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "and Hendershott (2003) still hold in recent years, these substantial price movements during surge periodmaybemainlydrivenbyinstitutionaltraders. 4.3 Retail and Institutional Order Flows The importance of retail traders in GameStop short squeezes has been highlighted in various studies, such as Allen et al. (2023) and Hu et al. (2021). However, the institutional side has not beengivenmuchconsideration. Inthissection,weinvestigatetheorderflowpatternsofbothretail andinstitutionaltradersduringsurgeperiod. We employ the approach proposed by Boehmer et al. (2021) to distinguish retail trades. They observe that most of internalized retail orders usually receive a price improvement of less than one cent per share. Boehmer et al. (2021) report that this price improvement is seen in between 60% and 99% of the trades in ’retail venues’, allowing them to be classified as retail trades.20 To measure institutional trading, we use intermarket sweep orders (ISO) trades. These trades enable traders to quickly access liquidity at multiple price levels and across multiple markets to execute largeblocktradesthroughparallelordersubmissions. Generally,institutionssubmitISOorders,21 which can be identified in the TAQ database with the sale condition code F. Chakravarty et al. (2012)providedempiricalevidencethatinformedinstitutionsarethemainusersofISOorders. It is essential to be aware that the methods mentioned above only account for a part of retail and institutional trades. However, for our research, we assume that retail and institutional traders maintain a steady pattern of order submission during the sample period. By taking advantage of these two proxies, internalized retail trades and ISO trades, we can analyze the order flow of both retailandinstitutionaltraders. 20Twocritiques(Battalioetal.(2022),Barberetal.(2023))pointoutthelimitedaccuracyofthemethodproposed byBoehmeretal.(2021),withanapproximaterateof30%to35%. 21The ISO order is an exception case of Rule 611(order protection rule) under regulation NMS. SEC requires that “when an order is designated as an ISO, the broker-dealer routing the order must assume the responsibility for transmitting additional orders, as necessary, to execute against any better-priced protected quotations”. Therefore, broker-dealers have no incentive to submit ISOs for retail traders. More details refer to https://www.sec.gov/ divisions/marketreg/rule611faq.pdf 14 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 84,
    "chunk_index": 24,
    "word_count": 307,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "is designated as an ISO, the broker-dealer routing the order must assume the responsibility for transmitting additional orders, as necessary, to execute against any better-priced protected quotations”. Therefore, broker-dealers have no incentive to submit ISOs for retail traders. More details refer to https://www.sec.gov/ divisions/marketreg/rule611faq.pdf 14 Electronic copy available at: https://ssrn.com/abstract=4560320 To examine how retail and institutional order flows evolved over time, we divide the dataset into distinct periods as follows: 1) the pre-surge period, denoted as before January 1, 2021, is capturedbytheconstantα;2)IS isadummythatisoneduringthesurgeperiod,whichspansfrom t January 1, 2021 to March 31, 2021, and zero otherwise; 3) IPS is a dummy that is one after the t surge period, which extends from April 1, 2021 to December 31, 2021, and zero otherwise. We estimatethefollowingregressionmodel: OrderFlow =α+β IS+β IPS+Controls +ε , (1) t 1 t 2 t t−1 i,t where the order flows measures come from either retail traders or institutions. To control market trading activity and market performance, we include the daily trading volume of SPY, the daily returnoftheSPXindex,andtheVIXindex. Allcontrolvariablesarelaggedforonetradingday. [InsertTable2here.] PanelAofTable2revealsaremarkableandstatisticallysignificantincreaseinallfourtypesof orderflows: after-hoursinstitutional,intradayinstitutional,after-hoursretail,andintradayretail. In particular, daily intraday institutional and retail trading volumes have grown significantly, with an increaseof9.96millionand8.39millionsharesduringthesurgeperiod,respectively. Comparedto the total intraday trading volume before the surge period, which stood at only 5.98 million shares (as shown in Table 1), the surge in intraday institutional and retail trading volume is thus quite substantial. A similar trend is also observed in after-hours trading sessions, where increases in trading activity are also statistically significant, although of a smaller magnitude. Specifically, the daily after-hours institutional order flow increases by 1.68 million shares, while the daily after- hoursretailorderflowincreasesby0.05millionsharesafterthemarketcloses. Thecoefficientsforthepost-surgeperiod’stradingvolumesofallfourordertypessuggestthat the activity has returned to pre-surge levels. Of particular interest is the divergence in behavior betweeninstitutionalandretailorderflows. Institutionalorderflowshaveinsignificantbutpositive 15 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 84,
    "chunk_index": 25,
    "word_count": 287,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "are also statistically significant, although of a smaller magnitude. Specifically, the daily after-hours institutional order flow increases by 1.68 million shares, while the daily after- hoursretailorderflowincreasesby0.05millionsharesafterthemarketcloses. Thecoefficientsforthepost-surgeperiod’stradingvolumesofallfourordertypessuggestthat the activity has returned to pre-surge levels. Of particular interest is the divergence in behavior betweeninstitutionalandretailorderflows. Institutionalorderflowshaveinsignificantbutpositive 15 Electronic copy available at: https://ssrn.com/abstract=4560320 post-surge coefficients, indicating that institutional traders are still engaging in trading activities in post-surge period. On the other hand, retail order flows have negative post-surge coefficients, suggesting that retail traders have chosen to divest from GME stocks after the surge period. This isfurthersupportedbythepost-surgecoefficientsresultsinPanelB. Furthermore,wediscoverthatthecompositionofthevolumehasshiftedsignificantly. PanelB inTable2revealsthatduringintradaytrading,bothinstitutionalandretailtradesseeanincreasein their market shares, with increases of 4% and 5%, respectively. However, a dramatic shift occurs during the after-hours trading session. After the market closes, institutional trades’ market share experiencesadramaticsurgeof14%,jumpingfrom22%to36%,whileretailtrades’marketshare experiencesasharpdecreaseof13%,droppingfrom22%to9%. The results of Panel B demonstrate that institutional traders have taken a substantial amount of the retail traders’ market share in after-hours sessions during and after the surge, resulting in a lasting change in the makeup of after-hours trading volume.22 Before the surge, both institutional and retail trading volumes made up around 22% of the total trading volume. However, after the short squeeze event, institutional trade volume was dominant, accounting for 36% of the total after-hours trading volume, while the contribution of retail traders dropped significantly to only 9%. As most of the large price movements on GameStop occur in the after-hours session, this shift intradingvolumecompositionhighlightsthesignificantimpactofinstitutionaltradingontheshort squeeze. With institutions having a greater presence in after-hours trading, the overall impact of retailtradersonthepricemovesissignificantlyreduced. 22We observe a significant increase in institutional trading behavior during the surge period only for GameStop. Institutionaltradingforthematchedfirm,BestBuy,remainthesameduringthistime. Thenon-squeezedmemestocks experience little changes in intraday institutional trading and a rise in after-hours institutional trading, however the sizeisonlyone-thirdofthatofGameStop. TheresultsformatchedfirmandmemestockscanbefoundinAppendix A1. 16 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 84,
    "chunk_index": 26,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "after-hours trading, the overall impact of retailtradersonthepricemovesissignificantlyreduced. 22We observe a significant increase in institutional trading behavior during the surge period only for GameStop. Institutionaltradingforthematchedfirm,BestBuy,remainthesameduringthistime. Thenon-squeezedmemestocks experience little changes in intraday institutional trading and a rise in after-hours institutional trading, however the sizeisonlyone-thirdofthatofGameStop. TheresultsformatchedfirmandmemestockscanbefoundinAppendix A1. 16 Electronic copy available at: https://ssrn.com/abstract=4560320 4.4 Which Trades Move the Price? Although increased institutional trading and significant stock price surges occur concurrently in after-hours sessions, it remains unclear how these price movements are primarily driven by retail or institutional trades. In this session, we present in three aspects to demonstrate that institutional trades are the main driving force behind the upward movement of the stock price. This direct evidenceconfirmsthepresenceofashortsqueezeinGameStop. 4.4.1 CumulativeSignedVolume We begin our investigation using the Lee and Ready (1991) algorithm to differentiate between buyer-initiated and seller-initiated institutional trades. For retail trades, we adopt Boehmer et al. (2021)’sapproachtolabelthemasbuyorsell. Wethenusethetradedata,whichincludesintraday andafter-hourstradingsessions,tocalculatethedailysignedsharevolume,thedifferencebetween buy and sell volume, for both institutional and retail trades.23 The cumulative signed volumes for institutionalinvestorsandretailtradersareshowninFigure4. [InsertFigure4here.] ExaminingtheleftsideofFigure4,apatternisevident: institutionalinvestorsbegantoincrease theirownershipofGameStopsharesfromlateAugust2020. Thisisinlinewiththelargepurchase byRyanCohen,theformerCEOofChewy.24 Followingthis,retailtradersalsobegantobuymore of the stock in early October, which coincides with GameStop’s announcement of a multiyear strategicpartnershipwithMicrosoft.25 Thisnewscausedaremarkableone-daypricejump,taking 23By employing Barber et al. (2023) method to identify the direction of retail trades, our findings become more significant. TheresultsarepresentedinAppendixA2. 24Ryan Cohen submitted a Form 13-D disclosing ownership of 5.8 million GameStop shares on August 28. Subsequent amendments to the form were made on August 31, September 21 and December 17. His September 21(December17)filingindicatedownershipof6.5(9.0)millionshares,reflectinga9.98%(12.9%)stake. 25Refertohttps://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/ 17 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 19,
    "page_range": "p.19-20",
    "total_pages": 84,
    "chunk_index": 27,
    "word_count": 246,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.19-20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "of retail trades, our findings become more significant. TheresultsarepresentedinAppendixA2. 24Ryan Cohen submitted a Form 13-D disclosing ownership of 5.8 million GameStop shares on August 28. Subsequent amendments to the form were made on August 31, September 21 and December 17. His September 21(December17)filingindicatedownershipof6.5(9.0)millionshares,reflectinga9.98%(12.9%)stake. 25Refertohttps://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/ 17 Electronic copy available at: https://ssrn.com/abstract=4560320 the stock from $9.54 to $13.49 on October 8, 2020. At the same time, GameStop’s short interest exceeded100%ofitstotalfloat.26 When we take a closer look at the surge period (as seen in the right panel of Figure 4), an interesting pattern emerges: retail traders significantly decreased their ownership just before the dramatic increase in price. From January 13 to January 22, 2021, they sold off the stock, while its price rose from $19.95 (closing price on January 12) to $65.01 (closing price on January 22). On the other hand, institutional investors kept up their considerable net buying of GameStop shares until January 26, 2021, when the price skyrocketed from January 26’s close price of $147.98 to January27’sopenpriceof$354.83. Interestingly,aftertheshortsqueezewastriggeredduringafter-hourssessiononJanuary26,the total amount of shares bought and sold by both institutional investors and retail traders remained steady from January 27 to February 24. This implies that there was no significant daily order discrepancy between institutional trades and retail trades during this period. This result may initially appear to be in opposition to the expected large buying from short sellers during the short squeeze, as demonstrated in Mitts et al. (2022), wherein the number of shares returned by short sellersexperiencedasubstantialincreaseonJanuary27andstayedhighuntilFebruary1. Our model, which is an extension of Brunnermeier and Pedersen (2005) and presented in Section 7, explains this phenomenon. Initially, both short sellers and institutional speculators are involvedinnetbuying. Whentheshortsqueezeissuccessfullyactivated,anabnormallyhighprice serves as a signal, prompting institutional speculators to sell their holdings to short sellers. This is why we observe a flat cumulative order imbalance in the institutional order flow after January 27 inFigure4. An examination of institutional and retail daily signed volume indicates that the considerable large price movement during the surge period is likely to be mainly caused by net buying from institutionaltrading,ratherthannetsellingfromretailtrading. 26Refertohttps://seekingalpha.com/news/3620910-gamestop-jumps-21-percent-after-microsoft-partnership-agreement 18 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 84,
    "chunk_index": 28,
    "word_count": 345,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "cumulative order imbalance in the institutional order flow after January 27 inFigure4. An examination of institutional and retail daily signed volume indicates that the considerable large price movement during the surge period is likely to be mainly caused by net buying from institutionaltrading,ratherthannetsellingfromretailtrading. 26Refertohttps://seekingalpha.com/news/3620910-gamestop-jumps-21-percent-after-microsoft-partnership-agreement 18 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.2 Large Price Moves in After-Hours Trading",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 84,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.2 Large Price Moves in After-Hours Trading (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "In this section, we aim to identify the types of trades that are responsible for the price fluctuations observed during intraday and after-hours trading sessions. To do this, we calculate the weighted pricecontribution(WPC)tomeasuretheextenttowhichaparticulartypeoftradesaffectsthetotal pricechangeofastock,aspreviouslydoneinstudiessuchasBarclayandWarner(1993),Barclay andHendershott(2003),andO’haraetal.(2014). Specifically,theWPCisdefinedas WPCi = ∑ N n=1 δ n,i r n,t , (2) t ∑ N n=1 r n,t where suppose N trades are executed on day t, δ is an indicator variable that takes the value of n,i one if the nth trade is type i trade, and zero otherwise. r is the difference between the price of n,t trades n and n−1. The weighted price contribution for particular types of trades is defined as the samplemeanofthedailyWPCi. t [InsertTable3here.] The positive WPCs for institutional trades in Table 3 reveal that institutional investors are the mainforcebehindthepricemovementsofGameStop’sstock,bothduringintradayandafter-hours trading, in both surge and non-surge periods. On the other hand, retail investors have a restraining effect on the price, as indicated by the negative WPC values for their trades. The WPC of 44.96 forinstitutionaltradesduringafter-hourssessionsinthesurgeperiodismuchhigherthantheWPC of -1.13 for retail trades during the same period, which demonstrates the greater informativeness ofinstitutionaltrades. Evenduringnormaltimes,after-hoursinstitutionaltradeshaveasignificant impact on the stock price, with a WPC of 3.37, while retail trades only account for 0.33 of the WPC. These results are in line with the findings of Chakravarty et al. (2012), which suggest that informedinstitutionspredominantlyuseISOtrades. Retail investors are more active in their trading during regular trading hours, but their trades usually go against the current price trend, leading to a negative WPC for intraday trades. This is 19 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 84,
    "chunk_index": 30,
    "word_count": 256,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "with the findings of Chakravarty et al. (2012), which suggest that informedinstitutionspredominantlyuseISOtrades. Retail investors are more active in their trading during regular trading hours, but their trades usually go against the current price trend, leading to a negative WPC for intraday trades. This is 19 Electronic copy available at: https://ssrn.com/abstract=4560320 especiallytrueduringsurgeperiods,wheretheWPCforretailtradesismuchlower(-155.65)than during normal times (-5.84). On the other hand, institutional trades tend to follow the intraday price movement, resulting in positive WPC values of 3.64 during normal times and 8.90 during surgeperiods. These findings not only validate the observations made through cumulative signed volume analysis, but also provide novel insights into the distinct roles played by institutional and retail investorsininfluencingGameStop’spricemovementsduringvarioustradingsessions. 4.4.3 IntradayHigh-FrequencyRegression In this section, we try to answer whether institutional and/or retail trading contribute to the increasesinhigh-frequencyprices. Wefirstconstructthescaled1-minuteorderimbalancemeasure for different types of trades, which is defined as the ratio of 1-minute signed volume to 1-minute totalvolume. Next,weestimatethefollowingmodel: R =α+β Retail +β Inst +β Retail ×IS+β Inst ×IS t 1 t 2 t 3 t t 4 t t (3) +β Retail ×IPS+β Inst ×IPS+ε , 5 t t 6 t t t where R are 1-minute midpoint quote returns measured by basis points, Retail and Inst are 1- t t t minute order imbalance ratios for retail trades and institutional trades, IS and IPS, as before, are t t dummy variables for surge period and post-surge period. We restrict our analysis to intraday data exclusively because the after-hours trading session exhibits low liquidity, even during the surge period. Consequently, utilizing the scaled order imbalance measure in such illiquid conditions mayleadtomisleadingresults. [InsertTable4here.] Table 4 reports the results. Column 3 reveals that a 1% rise in institutional (retail) order imbalance leads to a 0.1555 bps (0.0396 bps) return on GameStop during normal times. During 20 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 84,
    "chunk_index": 31,
    "word_count": 299,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Consequently, utilizing the scaled order imbalance measure in such illiquid conditions mayleadtomisleadingresults. [InsertTable4here.] Table 4 reports the results. Column 3 reveals that a 1% rise in institutional (retail) order imbalance leads to a 0.1555 bps (0.0396 bps) return on GameStop during normal times. During 20 Electronic copy available at: https://ssrn.com/abstract=4560320 surgeperiod,thesame1%increaseininstitutional(retail)orderimbalanceresultsinanadditional return of 0.9073 bps (0.1474 bps). These positive coefficients demonstrate that the 1-minute net trading directions on retail and institutional trades are in agreement with the corresponding 1- minutepricemovementdirections. It is evident that institutional trades have a greater impact on the GameStop price than retail trades, as the coefficients of institutional trades are consistently higher. Running regressions solelyonretailandinstitutionalvariablesfurthersubstantiatesthispoint,asevidencedbythehigh R2 value (0.111) in column 3, predominantly attributable to the institutional variables (0.108 in column2). Despitethefactthatretailorderimbalancemeasureshaveasignificantcorrelationwith contemporaneousreturns,theydonotprovideagreatdealofexplanatorypower. To summarize, our analysis encompasses results from various time frame levels, including daily, different intraday trading sessions, and intraday 1-minute intervals, and consistently shows that institutional trading had a positive effect on the price of GameStop, particularly during the surge period. This is in contrast to the comparatively limited influence of retail trading. This evidence supports the idea that a short squeeze occurred in GameStop in early 2021, and institutionaltradingplayedanimportantroleinthepriceincrease. 5 The Role of the Options Market As indicated in Table 1, the options trading volume experienced a substantial increase during the surge period. In this section, we first examine whether options market participants, both retail tradersandsophisticatedtraders,alteredtheirtradingbehaviorsduringthistime. Furthermore,we exploretheimpactofoptionstradingonthestockmarket,usingthenetopeninterestdelta. Finally, weinvestigatewhetheragammasqueezeoccurredonGameStop. 21 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 84,
    "chunk_index": 32,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "2021, and institutionaltradingplayedanimportantroleinthepriceincrease. 5 The Role of the Options Market As indicated in Table 1, the options trading volume experienced a substantial increase during the surge period. In this section, we first examine whether options market participants, both retail tradersandsophisticatedtraders,alteredtheirtradingbehaviorsduringthistime. Furthermore,we exploretheimpactofoptionstradingonthestockmarket,usingthenetopeninterestdelta. Finally, weinvestigatewhetheragammasqueezeoccurredonGameStop. 21 Electronic copy available at: https://ssrn.com/abstract=4560320 5.1 Are There More Put-Call Parity Violations? Allen et al. (2023) use daily market-close options data to construct the synthetic stock price based on the put-call parity. They observe a considerable rise in the gap between the synthetic stock price and the stock close price, which serves as a proxy for the put-call parity violation, during the squeeze period. Cremers and Weinbaum (2010) suggest that such put-call parity violations are caused by a non-zero implied volatility spread between calls and puts, and that the implied volatility spread can significantly forecast future stock returns. Furthermore, Muravyev et al. (2022) develop a formula that links this implied volatility spread to the borrow fee. Therefore, the proxy used in Allen et al. (2023) may capture the information of the borrow fee, thus an increase ofthisproxyisobservedduringthesqueezeperiod. In this section, we can use tick-by-tick options trade data to detect trades that violate the put- call parity, which could potentially generate a risk-free arbitrage gain before taking into account transaction costs. These arbitrage trades are usually submitted by inexperienced option traders, thus giving us some understanding of the trading habits of novice option traders during the GME event. TheGMEoptionsareoftheAmericanstyle,and,undermildno-arbitrageassumptions,itisnot optimaltoexerciseanAmericancallbeforetheexpirationdate. However,itmaybeadvantageous to exercise an American put before the expiration date. This results in the put-call parity between anAmericancallandputbeingexpressedasaninequality Call+PV(K)≤S+Put ≤Call+K, whereSisthestockprice,K andPV(K)arethestrikepriceanditspresentvalue. Call andPut are optiontransactionprices. Our options trade data only include the contemporary underlying stock quote and do not encompass contemporary quotes for other options. Given that options’ prices are nonnegative, 22 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 84,
    "chunk_index": 33,
    "word_count": 302,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "expiration date. This results in the put-call parity between anAmericancallandputbeingexpressedasaninequality Call+PV(K)≤S+Put ≤Call+K, whereSisthestockprice,K andPV(K)arethestrikepriceanditspresentvalue. Call andPut are optiontransactionprices. Our options trade data only include the contemporary underlying stock quote and do not encompass contemporary quotes for other options. Given that options’ prices are nonnegative, 22 Electronic copy available at: https://ssrn.com/abstract=4560320 wedefinetheoptionsrisk-freearbitragetradeswhicharetheput-callparityviolationsasfollows27 S +Put <K or S >Call+K. Ask Bid [InsertFigure5here.] Before the surge, the daily average of arbitrage trades was 324 contracts, with the majority (86.14%) being call options. However, when the surge began, these numbers increased dramati- cally, reaching an average of 4,325 contracts per day, with call options making up 96.62% of all trades. As seen in Figure 5, the peak of arbitrage trades occurred on January 27, 2021, following theshortsqueeze. Itisevidentthatthosewhopurchaseoptionscanmakerisk-freeprofitsbyengaginginarbitrage trades, as option sellers sell in-the-money (ITM) options at a lower price by mistake. However, naked writing ITM options is not a popular practice due to the high margin requirements. We believe that option sellers in these arbitrage trades may be closing their positions inadvertently, when they could potentially make more money by exercising their options early, although early exercise might not always be the optimal choice. It appears that these risk-free arbitrage opportunitiesareusuallytakenadvantageofbylessexperiencedoptionstraders. Theprevalenceof calloptionsinthesetradessuggeststhatnoviceoptiontradersaremorelikelytotakelongpositions oncalloptions,whichcouldleadtomarketmakersbuyingmoreunderlyingstock. Figure5showsadramaticriseinthenumberofregularoptiontrades,fromanaverageof44,965 contractsperdaybeforethesurgeto409,330contractsperdayduringthesurge. OnJanuary22to 26, the daily option volume even surpassed 1 million contracts before the short squeeze occurred. 27IfS +Put<K,thenthebuyeroftheputoptioncanbuythestockataskpriceandearlyexercisetheoptionto Ask sellthestockatpriceK,thenthetotalrisk-freepayoffisK−(S +Put)>0. IfS >Call+K,thenthebuyerof Ask Bid thecalloptioncanearlyexercisetheoptiontobuythestockatpriceK,andsellthestockatbidprice,thenthetotal risk-freepayoffisS −(Call+K)>0. bid 23 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 84,
    "chunk_index": 34,
    "word_count": 238,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "the optimal choice. It appears that these risk-free arbitrage opportunitiesareusuallytakenadvantageofbylessexperiencedoptionstraders. Theprevalenceof calloptionsinthesetradessuggeststhatnoviceoptiontradersaremorelikelytotakelongpositions oncalloptions,whichcouldleadtomarketmakersbuyingmoreunderlyingstock. Figure5showsadramaticriseinthenumberofregularoptiontrades,fromanaverageof44,965 contractsperdaybeforethesurgeto409,330contractsperdayduringthesurge. OnJanuary22to 26, the daily option volume even surpassed 1 million contracts before the short squeeze occurred. 27IfS +Put<K,thenthebuyeroftheputoptioncanbuythestockataskpriceandearlyexercisetheoptionto Ask sellthestockatpriceK,thenthetotalrisk-freepayoffisK−(S +Put)>0. IfS >Call+K,thenthebuyerof Ask Bid thecalloptioncanearlyexercisetheoptiontobuythestockatpriceK,andsellthestockatbidprice,thenthetotal risk-freepayoffisS −(Call+K)>0. bid 23 Electronic copy available at: https://ssrn.com/abstract=4560320 On January 27, the volume dropped to 849,609 contracts. In the following sections, our analysis onlyconsiderregularoptiontrades,leavingoutarbitragetrades. 5.2 How Does the Implied Volatility Change During Surge Period? Option prices can provide us with an insight into what the market expects the volatility of the underlying return to be. By examining a cross section of option prices for different strikes, we can estimate the expected volatility of an asset return under the risk-neutral probability measure without specific modeling assumptions. This model-free implied volatility (MFIV) is a sign of the economic uncertainty anticipated by the market and can be beneficial for volatility trading, hedging, and portfolio management. Following the method of Bakshi et al. (2003), we estimate the intraday 7-day annualized MFIV using trade data for all intraday non-overlapped 30-minute timeintervals. [InsertFigure6here.] Figure 6 shows the daily MFIV at the end of the trading day. Since April 2020, the MFIV has beenmostlybelow1.5. OnJanuary25,2021,itfirstexceeded1.5,andthenincreasedsteadilyover the next four days, reaching its highest point of 3.31 on January 28, 2021. We will explore these four days in more depth in Section 6. Moreover, we also observe that the MFIV stays at a high level(mean1.44)duringthesurgeperiodandgraduallydecreasesto0.5afterMarch2021. In Easley et al. (1998), an asymmetric information model is proposed which suggests that informedtradersmayopttotradeintheoptionsmarket. Professionaltradersmaycarryontrading in the after-hours stock market after the options market closes. Consequently, we first observe an increase in the MFIV in the options market. Generally, the increase in MFIV only implies that there will be some large price movement in the future, but it does not provide any directional information. An empirical example of this is that before earning announcement days, the options’ implied volatility increases. But if option informed traders have the directional information and 24 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 84,
    "chunk_index": 35,
    "word_count": 335,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "there will be some large price movement in the future, but it does not provide any directional information. An empirical example of this is that before earning announcement days, the options’ implied volatility increases. But if option informed traders have the directional information and 24 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 84,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "trade in both options and stock market, in this case, the MFIV may incorporate some directional information, and thus can significantly predict overnight returns during the surge period. To test thishypothesis,werunthefollowingregression: R =α+β IS+β IPS+β MFIV ×IS+β MFIV ×PS+Controls +ε , (4) t+1 1 t 2 t 3 t t 4 t t t t where R can be overnight, intraday and close-to-close return, MFIV is the end of day model- t+1 t free implied volatility on day t. IS and IPS are dummy variables for surge and post-surge period, t t respectively. To control market trading activity and market performance, we include the daily tradingvolumeofSPY,thedailyreturnoftheSPXindexandtheVIXindex. [InsertTable5here.] Table 5 shows that there is a significant overnight and intraday return predictability during the surge period. We observe significant coefficients of β and β for the prediction of overnight and 1 3 intraday returns but insignificant coefficients of β and β for all cases. This finding confirms that 2 4 thispredictabilityisshort-livedanddisappearsinthepost-surgeperiod. Thisfleetingpredictability can be due to two possible sources: option informed traders trading their directional information in the stock market directly after the option market closes, and/or option market makers transmit the directional information via delta hedging in the after-hours session. In the unlisted results, we included the net open interest delta, which will be discussed in a later section, in the regression. The coefficients of the net open interest delta are significant at the 0.10 level, and the coefficients of MFIV change little. We propose that option informed traders have a high likelihood of trading t inboththeoptionsandafter-hoursessionsinthestockmarkets. 5.3 Do Put Options Become More Popular During Surge Period? Table 1 reveals that the average daily call option volume is 28.16 thousand during the pre-surge period, which is significantly higher than the put option volume of 16.81 thousand. This trend 25 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 84,
    "chunk_index": 37,
    "word_count": 303,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "trading t inboththeoptionsandafter-hoursessionsinthestockmarkets. 5.3 Do Put Options Become More Popular During Surge Period? Table 1 reveals that the average daily call option volume is 28.16 thousand during the pre-surge period, which is significantly higher than the put option volume of 16.81 thousand. This trend 25 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 84,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "is reversed during the post-surge period, with the average daily call option volume increasing to 65.58 thousand and the put option volume rising to 37.43 thousand. Evidently, there is a shift in tradingpatternsduringthesurgeperiod,withputoptionsbecomingmorepopular. In our analysis, we not only identify the direction of option trades, but also use the method proposed by Bryzgalova et al. (2022) to label the options trade with the “SLAN” trade flag, which indicates the use of a single-leg price improvement mechanism, as retail option trades. Furthermore,Moussawietal.(2023)revealsthatoptionstraderswhoplacemulti-legordersdisplay contrasting trading patterns compared to those who use single-leg orders in the SPX options market,particularlywhenS&P500-basedETFsexperienceliquidityshocks. Sincemulti-legtrades are usually submitted by experienced options traders, we use them as a proxy to comprehend the tradingbehaviorofthisparticulargroup. [InsertFigure7here.] In Figure 7, we can observe that the trading volume of both retail and multi-leg trades experienced a significant increase during the surge period. Both groups of traders showed similar tradingvolumesforbothcallandputoptionsduringthisperiod. However,priortothesurge,retail traders had a preference for call options, while sophisticated traders tended to favor put options. This is in line with the observation in Figure 4 that retail stock traders continued to net buy on GameStopsincelate2020,asretailoptiontradersalsoshowedapreferenceforbuyingcalloptions during the same period. The average buy-to-sell call ratio increased from 88.73% before October 8,whichmarkstheannouncementofthepartnershipwithMicrosoft,to94.26%inlate2020. Sophisticatedtradersmayhaveapreferenceforputoptionsduringthepre-surgeperiodfortwo possible reasons. First, short sellers may move to the options market due to the high cost of short selling in the stock market, and use put options to create a short position on the stock. Second, institutional speculators may write put options as a way to increase their profits before a potential short squeeze is triggered. This strategy also implies a positive outlook on future prices, which is inlinewiththeexpectationsofthesespeculators. 26 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 84,
    "chunk_index": 39,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "put options to create a short position on the stock. Second, institutional speculators may write put options as a way to increase their profits before a potential short squeeze is triggered. This strategy also implies a positive outlook on future prices, which is inlinewiththeexpectationsofthesespeculators. 26 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 84,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "As we observe a substantial increase on trading volume across different types of option trades during surge period, to determine the significance of this change, we estimate the following regressionmodel: OV =α+β IS+β IPS+Controls +ε , (5) t 1 t 2 t t−1 i,t where OV is the specific type of options volume that is of particular interest to us, IS and IPS are t t t dummy variables for surge and post-surge period, respectively. To control market trading activity and market performance, we include the daily trading volume of SPY, the daily return of the SPX index,andtheVIXindex. Allcontrolvariablesarelaggedforonetradingday. [InsertTable6here.] Table 6 shows a remarkable increase in options trading across different types of trades (calls and puts, buys and sells) and investor groups (retail traders and sophisticated traders) during and after the surge period. Even though the option market activity cool off after the surge period, with β being smaller than β , the trading volumes for various types of trades stay significantly higher 2 1 thanthoseseenbeforethesurgeperiod. Thispatternisdifferentfromwhatisobservedinthestock market, where trading volumes return to pre-surge levels during the post-surge period, as seen in Table1. The first three columns in Table 6 show a significant increase in the volume of options during the surge period, as measured by the coefficients β . This is mainly due to put option trades 1 from all investor groups. Retail (sophisticated) traders traded an extra 37.36 (72.40) thousand contracts during this period, and more than half of these volume, amounting to 20.71 (37.36) thousand contracts, being put options. However, a different pattern was observed during the post- surgeperiod,withcalloptionsregainingtheirdominance. Duringthisperiod,retail(sophisticated) traderstradedanadditional8.92(13.96)thousandcontractsdaily,withthemajorityofthesetrades, 5.68 (9.08) thousand contracts, being call options. This suggests a change in options trading strategiesandpreferencesamonginvestorsduringthesurgeperiod. 27 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 84,
    "chunk_index": 41,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "period, and more than half of these volume, amounting to 20.71 (37.36) thousand contracts, being put options. However, a different pattern was observed during the post- surgeperiod,withcalloptionsregainingtheirdominance. Duringthisperiod,retail(sophisticated) traderstradedanadditional8.92(13.96)thousandcontractsdaily,withthemajorityofthesetrades, 5.68 (9.08) thousand contracts, being call options. This suggests a change in options trading strategiesandpreferencesamonginvestorsduringthesurgeperiod. 27 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 84,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "The last four columns in Table 6 reveal that during and after the surge period, there are increases in options volume across four types of trades: buying calls, selling calls, buying puts, and selling puts. Panels B and C of the table demonstrate that both retail and sophisticated traders had a preference for writing call and put options rather than buying them during the surge period. This trend is consistent with the October 2021 SEC report28, and continues into the post-surge period, contrary to the usual preference of option traders to buy options rather than sell them before the surge. Interestingly, the at-the-money implied volatility is not significantly different (t-stat=0.20) between the pre-surge and post-surge periods, suggesting that the observed change in option trading behavior cannot be explained by rational option pricing alone. This implies that other factors, such as investor sentiment and speculative motives, may have played a role in the shiftinoptionstradingpatterns. 5.4 How Does Options Trading Affect the Stock Market? Optionmarketmakerslinktheoptionmarketandstockmarkettightlythroughtheirdelta-hedging activities. Toinvestigatetheinfluenceofoptionstradingonthestockmarket,wemustfirstmeasure the open interest and options risk exposure, as measured by the options greeks, for the option market makers. In agreement with prior research (Garleanu et al. (2008), Christoffersen et al. (2018)), we assume that option market makers take on the net demand from option end users. Consequently, we propose a method to calculate the daily net open interest and daily net option greeks exposure for the option end users based on tick-by-tick options trades and daily market closeinformation,asoutlinedfollow: Step 1: We classify option trades as buyer-initiated or seller-initiated, following the method- ology established in Savickas and Wilson (2003). Afterward, we calculate the daily net trading volume,thedifferencebetweenthebuyandsellvolume,foreachoptioncontract. Step 2: We sum the cumulative net open interest from the previous trading day with the net 28SECstaffpointedoutthatoptionmarketmakerstendtowritecalloptionsingeneralandretailinvestorstendto purchasemoreputoptionsthancalloptions. 28 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 84,
    "chunk_index": 43,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "classify option trades as buyer-initiated or seller-initiated, following the method- ology established in Savickas and Wilson (2003). Afterward, we calculate the daily net trading volume,thedifferencebetweenthebuyandsellvolume,foreachoptioncontract. Step 2: We sum the cumulative net open interest from the previous trading day with the net 28SECstaffpointedoutthatoptionmarketmakerstendtowritecalloptionsingeneralandretailinvestorstendto purchasemoreputoptionsthancalloptions. 28 Electronic copy available at: https://ssrn.com/abstract=4560320 tradingvolumeobtainedfromStep1todeterminethecumulativenetopeninterestforeachoption contract on the current day. We get the overall net open interest by summing the net open interest acrossallunexpiredoptioncontracts. Step 3: We multiply the cumulative net open interest obtained from Step 2 by the correspond- ing greeks (such as delta) from OptionMetrics. The resulting calculation yields the net greeks exposureforeachoptioncontract. Step 4: We conclude by adding together the net greeks values from Step 3 for all unexpired optioncontracts. Thissummationyieldsthenetopeninterestgreeks(suchasdelta)fortheday. Inthissection,weusethenetopeninterestandnetopeninterestdeltawhicharecalculatedfol- lowing the above method to demonstrate that sophisticated and retail investors behave differently in the options market. Furthermore, we show that option market makers’ delta hedging increases theunderlyingvolatilityandhasasignificanteffectonafter-hourspricemovementsandthequality ofthefollowingday’smarket. 5.4.1 Dosophisticatedandretailinvestorsactdifferentlyinoptiontrading? In section 5.3, we discovered that trading activity on puts and calls, both buying and selling, rises during the surge period. Furthermore, both experienced and novice traders tend to sell options rather than buy options during the surge period. Do they close the existing positions or establish new position through their writing options? Ni et al. (2021) suggest that when option marketmakershavenetbuying(selling)positions,theirdeltarebalancingtradinghaveastabilizing (destabilizing)effectontheunderlyingprices,thusreducing(increasing)theunderlyingvolatility. Consequently, the open selling and close selling of options by options traders can lead to very different trading behaviors for options market makers. We investigate the net open interest of optionenduserswhichiscalculatedusingthemethodoutlinedabove,todeterminewhetheroption marketmakers’hedgingincreases(decreases)theunderlyingvolatility. 29 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 84,
    "chunk_index": 44,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "writing options? Ni et al. (2021) suggest that when option marketmakershavenetbuying(selling)positions,theirdeltarebalancingtradinghaveastabilizing (destabilizing)effectontheunderlyingprices,thusreducing(increasing)theunderlyingvolatility. Consequently, the open selling and close selling of options by options traders can lead to very different trading behaviors for options market makers. We investigate the net open interest of optionenduserswhichiscalculatedusingthemethodoutlinedabove,todeterminewhetheroption marketmakers’hedgingincreases(decreases)theunderlyingvolatility. 29 Electronic copy available at: https://ssrn.com/abstract=4560320 [InsertFigure8here.] Figure 8 illustrates the net open interest of both sophisticated and retail option traders over time. Itisinterestingtonotethatthetwogrouptradersdisplaycontrastingtradingbehaviorsinthe options market. Specifically, retail traders tend to buy calls prior to the surge, while sophisticated traders are more likely to buy puts. This is in line with the Reddit users who posted their long call positions online and the institutional short sellers who reported their long put positions on 13-F forms. During the surge period, both retail and sophisticated traders experience a decrease in the net open interest of all types of options. However, the net open interest remains above zero,indicatingthatoptionsmarketmakershaveanetsellingposition,whichinturnincreasesthe underlying volatility through delta hedging trades. Following the post-surge period, sophisticated and retail traders have conflicting views on the underlying price, which leads to different trading preferences. Sophisticated traders tend to purchase more puts (calls), while retail traders tend to buymorecalls(puts). Inconclusion,sophisticatedandretailtradershavedistincttradingpreferencesbeforeandafter the surge period. During the surge period, the high volatility, as seen in Figure 6, causes all traders to sell options. Additionally, options market makers significantly decrease their net open interest, yet still maintain a net selling position. Therefore, their delta hedging trades increase the underlyingvolatility. 5.4.2 DoesNetOpenInterestDeltaPredictAfter-HoursReturn? In the options market, market makers trade the underlying stock to manage their delta exposure. This is especially relevant when they have a large delta exposure, as it can affect market liquidity andstockpricemovements. wefirstlookintothenetopeninterestdelta,whichisameasureofthe totaldeltaexposureofalloptiontraders. [InsertFigure9here.] 30 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 84,
    "chunk_index": 45,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "delta hedging trades increase the underlyingvolatility. 5.4.2 DoesNetOpenInterestDeltaPredictAfter-HoursReturn? In the options market, market makers trade the underlying stock to manage their delta exposure. This is especially relevant when they have a large delta exposure, as it can affect market liquidity andstockpricemovements. wefirstlookintothenetopeninterestdelta,whichisameasureofthe totaldeltaexposureofalloptiontraders. [InsertFigure9here.] 30 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 84,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Options market makers, in their role as counterparts to options traders, have a net open interest delta opposite. To achieve a delta-neutral state, market makers need to hold an amount of underlyingequivalenttothenetopeninterestdelta. Therefore,thenetopeninterestdeltabecomes a critical factor, reflecting the hedging demand for option market makers. The graph in Figure 9 indicates that the net open interest delta has been significantly greater than the cumulative signed volume of retail and institutional traders (as presented in Figure 4) since late 2020. This suggests thatdeltahedgingbyoptionmarketmakerscouldhaveasubstantialeffectonthestockprice. WehavediscoveredthatmostofGameStop’spricemovementstakeplaceinafter-hourstrading. Unfortunately, options trading is not available during these after-hours sessions. This leads to the question of whether the net open interest delta has an effect on after-hours returns. Generally, optionsmarketmakersensurethattheirholdingsaredelta-neutralatthemarketclose. Thisimplies that if the gamma is low and/or the after-hours movement is minor, options market makers may not feel the need to trade the underlying assets to rebalance the delta of their holdings during the after-hours session. However, when there is considerable after-hours movement that results in a large delta exposure, trading the underlying stock is necessary to reduce delta risk, despite the highercostsassociatedwithtradingduringafter-hourssessions. As we observe that the net open interest delta presents different patterns during the pre-surge, surge, and post-surge period, we introduce three dummy variables to explore the relationship between the daily net open interest delta and the subsequent after-hours return via the following model: RAH =α+β ∆iIBS+β ∆iIS+β ∆iIPS+Controls +ε , (6) t+1 1 t t 2 t t 3 t t t t where∆i isthenetopeninterestdeltabasedontypeitradesatthedailymarketclose(4PMEST), t RAH is the after-hours return from 4 PM to next day’s market open at 9:30 AM. IBS, IS and IPS t+1 are dummy variables representing the before-surge, surge and post-surge period, respectively. To control market trading activity and market performance, we include the daily trading volume of 31 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 84,
    "chunk_index": 47,
    "word_count": 296,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "after-hours return from 4 PM to next day’s market open at 9:30 AM. IBS, IS and IPS t+1 are dummy variables representing the before-surge, surge and post-surge period, respectively. To control market trading activity and market performance, we include the daily trading volume of 31 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 84,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "SPY,thedailyreturnoftheSPXindex,andtheVIXindex. [InsertTable7here.] Table 7 reports the regression results of Equation (6). The significant and positive coefficients β indicate that the net open interest delta during surge period can reliably predict after-hours 2 returns. Moreover,Thisobservationholdsconsistentlyacrossvariousinvestorgroupsanddifferent typesofoptions. However,theinsignificantcoefficientsβ andβ revealthatsuchpredictabilityis 1 3 only present during the surge period. Such short-lived predictability may be mainly driven by the tradingbehaviorofinstitutionalspeculatorswhotradestockandoptionsatthesametime. Institutional speculators, armed with options carrying positive delta exposure and/or aware of optionsmarketmakers’obligationtohedgeinresponsetosignificantafter-hourspricemovements, possessastrongmotivationtotriggerasurgeinthestockpriceoncethemarketcloses. Thisexploit leverages the illiquid nature of the after-hours market, allowing them to use a small number of trades to generate a substantial price surge. Moreover, being aware of the hedging practices of options market makers, who strive to maintain delta neutrality, the institutional speculators seek to exploit any significant after-hours price movement to force market makers into adjusting their positions. This further amplifies the surge in the stock price, creating a reinforcement loop of increased hedging demand and higher prices. Therefore, we observe a significant but transient predictabilityofafter-hoursreturnsbasedonthenetopeninterestdeltaduringthesurgeperiod. We also note that the case of put options net delta from sophisticated traders shows the least information on after-hours return, although the coefficient (β ) remains significant at the 0.05 2 level, the adjusted R2 is negative. As we explained earlier, sophisticated traders encompass both short-sellers and institutional speculators, who possess conflicting interests and exhibit opposite preferences in options trading. Before the surge period, short sellers can buy puts to short sell the stock, while institutional speculators can sell puts to increase their revenue. During the surge period, when short sellers decide to close their short-selling positions, they may sell puts tooffsetsomelosses,whileinstitutionalspeculatorsmaypreferbuyingputstolockintheirprofits. 32 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 84,
    "chunk_index": 49,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "options trading. Before the surge period, short sellers can buy puts to short sell the stock, while institutional speculators can sell puts to increase their revenue. During the surge period, when short sellers decide to close their short-selling positions, they may sell puts tooffsetsomelosses,whileinstitutionalspeculatorsmaypreferbuyingputstolockintheirprofits. 32 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 84,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "This dynamic could potentially explain why we observe less significant results in the case of sophisticatedtraders’putoptions. 5.4.3 DoesNetOpenInterestDeltaAffecttheNextDay’sMarketQuality? The magnitude of the net open interest delta is significant. Therefore, the substantial underlying held by option market makers could decrease the supply in the stock market, potentially leading to a deterioration in market quality in the following days. To test this hypothesis, we obtain five daily market quality measures from the Intraday Indicators database by WRDS and estimate the followingmodel: L =α+β ∆ IBS+β ∆ IS+β ∆ IPS+Controls +ε , (7) t+1 1 t t 2 t t 3 t t t t where ∆ is the net open interest delta based on all options trades at the daily market close (4 t PM EST), L is one of the daily market quality measures, including dollar quoted spread, t+1 percentage quoted spread, dollar price impact, percent price impact, and intraday quote-based volatility. IBS, I and IPS are dummy variables representing the before-surge, surge and post-surge S period, respectively. To control market trading activity and market performance, we include the dailytradingvolumeofSPY,thedailyreturnoftheSPXindex,andtheVIXindex. [InsertTable8here.] Table 8 presents the regression results of Equation (7). The results indicate significant and positive coefficients β , which support our hypothesis that a substantial net open interest delta 2 during surge periods worsens the market quality the following day. This is evidenced by observed higherquotedspreads,largerpriceimpacts,andincreasedintradayvolatility. Furthermore, significant coefficients β associated with dollar-type market quality measures 3 (dollar quoted spread and dollar price impact) can be attributed to the high stock prices during the 33 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 84,
    "chunk_index": 51,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "during surge periods worsens the market quality the following day. This is evidenced by observed higherquotedspreads,largerpriceimpacts,andincreasedintradayvolatility. Furthermore, significant coefficients β associated with dollar-type market quality measures 3 (dollar quoted spread and dollar price impact) can be attributed to the high stock prices during the 33 Electronic copy available at: https://ssrn.com/abstract=4560320 post-surge period. Larger price stocks tend to exhibit wider dollar quoted spreads, and a similar patternisobservedinthecaseofdollarpriceimpact. Theotherinsignificantcoefficientsβ andβ 1 3 suggest that during normal times, the net open interest delta does not appear to have a significant impactonthemarketqualitythefollowingday. OurfindingsalignwithpriorresearchbyAllenetal.(2023)andtheOctober2021SECreport, which both confirm a deterioration in market quality during surge period. By identifying the large net open interest delta as one of the potential reasons for this deterioration, our study contributes additionalevidencetotheexistingbodyofliterature. 5.5 Is There a Gamma Squeeze? Agammasqueezeoccurswhenoptionmarketmakersbuystockstohedgetheriskassociatedwith theirpositivedeltahedgingdemand. Thisadditionalbuyingactivityexertsupwardpressureonthe underlying stock price, which could be a plausible explanation for the price surge on GameStop. It should be noted that the October 2021 SEC report stated that its staff did not find evidence of a gamma squeeze during that period. However, some researchers, such as Muravyev (2016), argue thatGameStopmighthavebeensusceptibletoagammasqueeze. In this section, we first employ the net open interest gamma measure to assess the likelihood of a gamma squeeze on GameStop during the intraday trading session. The results suggest a low probability of a gamma squeeze occurrence during this time. However, later in this section, we present empirical evidence indicating the possibility of some gamma squeeze activities during after-hourstradingsessions. 5.5.1 NetOpenInterestGamma The option’s gamma is a metric that quantifies the rate of change of its delta in response to shifts in the underlying asset’s price. A gamma squeeze materializes when a substantial positive gamma 34 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 84,
    "chunk_index": 52,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "the possibility of some gamma squeeze activities during after-hourstradingsessions. 5.5.1 NetOpenInterestGamma The option’s gamma is a metric that quantifies the rate of change of its delta in response to shifts in the underlying asset’s price. A gamma squeeze materializes when a substantial positive gamma 34 Electronic copy available at: https://ssrn.com/abstract=4560320 emerges from the perspective of investors. In such a case, the notable positive gamma triggers a positive(negative) hedging demand for options market makers when the underlying increases (decreases), thus hedging from options market makers has the potential to diminish the liquidity within the stock market and amplify the upward surge when the stock price follows an ascending trend. [InsertFigure10here.] To identify gamma squeezes, we can monitor the cumulative net gamma and the underlying liquidity. Following a similar approach that calculates the net open interest delta, we calculate the daily net open interest gamma. Figure 10 displays the time series plots of the net open interest gammaatthecloseofthemarket. Remarkably,thenetopeninterestgammaconsistentlymaintains a positive value throughout the entire sample period. This implies that delta hedging trades from optionsmarketmakersmayincreasetheunderlyingvolatilitybecausetheybuy(sell)theunderlying whenthepriceincreases(decreases). Although the net open interest gamma remains stable in late 2020, a significant inflection occursthereafter,asevidencedbyasharpdecreasefrom16.03millionsharesonJanuary4,2021,to 0.16millionsharesatmarketclosesonJanuary26,2021. Subsequently,thenetgammaexperiences further contraction, dwindling to 2,270 shares on January 27 and diminishing even further to 840 shares on January 28. Moreover, this low level of net gamma persists for the subsequent duration ofthesampledperiod. Thispatternstronglyindicatesthatoptionsmarketmakersadeptlymitigate theirgammaexposurepriortotheinitiationoftheshortsqueezeevent. Totacticallyreducethenet gammaexposure,optionsmarketmakerscanslightlyincreaseimpliedvolatility. Bydoingso,they attract a larger number of investors to engage in writing options. The tendency towards increased writing options, observed during and after the surge period (detailed in Table 6), substantiates this strategic shift. Furthermore, this phenomenon aligns with findings from Lakonishok et al. (2007), theyprovideempiricalevidencethatoptionsinvestorsbuyandsellmoreoptionswhenvolatilityis high,buttheimpactofvolatilityoninvestors’optionwritingisgreaterthantheimpactofvolatility 35 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 84,
    "chunk_index": 53,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "a larger number of investors to engage in writing options. The tendency towards increased writing options, observed during and after the surge period (detailed in Table 6), substantiates this strategic shift. Furthermore, this phenomenon aligns with findings from Lakonishok et al. (2007), theyprovideempiricalevidencethatoptionsinvestorsbuyandsellmoreoptionswhenvolatilityis high,buttheimpactofvolatilityoninvestors’optionwritingisgreaterthantheimpactofvolatility 35 Electronic copy available at: https://ssrn.com/abstract=4560320 ontheiroptionsbuying. While we observed some large daily net gamma, surpassing 16 million shares, during late 2020, it is important to recognize that a substantial net gamma alone may not necessarily trigger a gammasqueeze. Thisisduetothefactthatoptionsmarketmakerscanexecutetheirdeltahedging strategiesinacontrolledmanner,whichmaynotsignificantlyimpacttheunderlyingliquidityofthe asset. To gain further insight, our investigation extends directly to GameStop’s liquidity. We seek todeterminewhetherthereisanyindicationofaliquidityshortageoccurringwithintheGameStop market. In particular, on January 22, the net gamma level amounted to 1.02 million shares. This occurrence marked the final instance in which the net gamma surpassed the 1 million threshold before the short squeeze. Examining the time frame from January 4, 2021 to January 22, 2021, the maximum daily percentage quoted spread was documented at 0.25%. This specific value was observed on January 22, closely resembling the average daily quoted spread witnessed during the firsthalfof2020. In conclusion, our observations reveal a substantial net gamma along with a well-functioning stock market environment leading up to January 22, 2021. Subsequently, a decline in net gamma is observed after this date. Both pieces of evidence suggest that options market makers adeptly navigateandmanagetheirgammaexposurethroughoutoursampleperiod. Asaresult,ourfindings offer limited support for the appearance of a gamma squeeze, aligning with the conclusion in the Ocotober2020SECreport. 5.5.2 WhoReducetheNetGammaDuringSurgePeriod? Having observed the significant decrease in net open interest gamma during and after the surge period,weseriouslytestthesignificanceofthischangeandinvestigatewhattypesofoptionstrade underliethedecreaseingamma. Toanswerthesequestions,weestimatethefollowingmodel: Γi =α+β IS+β IPS+Controls +ε , (8) t 1 t 2 t t−1 i,t 36 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 84,
    "chunk_index": 54,
    "word_count": 278,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "a gamma squeeze, aligning with the conclusion in the Ocotober2020SECreport. 5.5.2 WhoReducetheNetGammaDuringSurgePeriod? Having observed the significant decrease in net open interest gamma during and after the surge period,weseriouslytestthesignificanceofthischangeandinvestigatewhattypesofoptionstrade underliethedecreaseingamma. Toanswerthesequestions,weestimatethefollowingmodel: Γi =α+β IS+β IPS+Controls +ε , (8) t 1 t 2 t t−1 i,t 36 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 84,
    "chunk_index": 55,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "where Γi is the net gamma calculated based on the specific type i of options. To control market t trading activity and market performance, we include the daily trading volume of SPY, the daily returnoftheSPXindex,andtheVIXindex. Allcontrolvariablesarelaggedforonetradingday. [InsertTable9here.] Table 9 reports the estimation results for Equation (8). In particular, significant coefficients β 1 andβ areevidentacrossvarioustypesofoptionstrade. Thisrobustlyconfirmsthattheconsistent 2 reductioningammaacrossdifferentoptionstradebothduringsurgeandpost-surgeperiods. Focusing on the first three columns, the average net gamma for all options trades decreases 4.44 million shares compared to the average pre-surge level. Of this 4.44 million shares decrease, 68%(3.01/4.44 = 0.68) is attributed to call options and remaining 32%(1.42/4.44 = 0.32) originates from put options. As the underlying price surges, the long ATM and OTM call options with positive gamma become deep ITM call options, leading to zero gamma. In tandem, more traders write call options to generate the negative gamma. Both mechanisms contribute to the reduction in net gamma. Transitioning to the post-surge period, the landscape further crystallizes. The average daily net gamma registers a reduction of 5.01 million shares compared to the average pre-surge level. Impressively, this reduction is predominantly influenced by call options trades, mirroringthepatternobservedduringthesurgeperiod. Upon examination of trades executed by sophisticated traders (from the fourth to the sixth column), a contrasting trend emerges. The reduction in gamma is predominantly influenced by put options trading (0.61/1.01=0.60). Because the underlying price increases during surge period, writing put options become the predominant means of gamma reduction. Moreover, the gamma reduction of 1.65 million during the post-surge period exceeds that of the surge period by 63% (as opposed to the surge period’s reduction of 1.01 million). However, the overall post-surge gamma reduction exhibits only a 13% (5.01/4.44-1=0.13) increase over the surge period. Given the sustained positive gamma from sophisticated traders throughout the entire sample period, an intriguing hypothesis emerges. It is plausible to argue that sophisticated traders are inclined to 37 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 84,
    "chunk_index": 56,
    "word_count": 315,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "However, the overall post-surge gamma reduction exhibits only a 13% (5.01/4.44-1=0.13) increase over the surge period. Given the sustained positive gamma from sophisticated traders throughout the entire sample period, an intriguing hypothesis emerges. It is plausible to argue that sophisticated traders are inclined to 37 Electronic copy available at: https://ssrn.com/abstract=4560320 uphold heightened gamma levels during the surge period, indicative of their anticipation that their optionsholdingspossessthepotentialtoinciteagammasqueezescenario. While analyzing the behavior of the retail trader (from the seventh to the ninth column), a familiarpatternakintotheoverallscenarioemerges. Inparticular,72%(0.49/0.68=0.72)ofgamma reduction is attributed to call options. Furthermore, the size of the surge and post-surge gamma reductionaresimilar,withadifferenceof13%. ItisworthnotingthattheBryzgalovaetal.(2022) method only identifies a subset of all retail trades. However, given the nearly identical patterns observed across all trades and this subset of retail trades, it is reasonable to infer that retail traders playasubstantialroleindrivingtheoverallgammareduction. In sum, the early months of 2021 saw options market makers keenly addressing gamma risk, successfully controlling net gamma exposure ahead of the short squeeze. Certain sophisticated traders chose to strategically maintain elevated gamma levels during surge periods, possibly with the intent of stimulating a gamma squeeze scenario. Ultimately, options market makers skillfully managedtheirgammaexposurethroughinvolvementwithretailtrades. 5.5.3 OvernightGammaRisk Optionmarketmakersappeartosignificantlyreducetheirgammaexposurepriortoashortsqueeze. However,theovernightpricemovementduringthesurgeperiodisstillconsiderable. Isthegamma exposurelowenoughforoptionmarketmakersthattheydonotneedtorebalancetheirdeltainthe after-hours session? Or, even though they reduce their gamma exposure, the large price surge still forces them to do delta trading overnight? We can answer this question by assuming that option market makers do not engage in overnight stock trading, but rather only perform discrete delta hedging at two different times: 4PM EST and 9:30AM EST (stock market close and open). This typeofhedgingleadstoahedginglossforthemarketmakerssincetheyareholdingashortgamma position.29 BoyleandEmanuel(1980)firstshowthatdiscretedeltahedginggeneratesgammarisk. 29Figure10presentthattheoptionendusersholdnetlonggammapositions,therefore,optionmarketmakershold shortgammaposition. 38 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 84,
    "chunk_index": 57,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "can answer this question by assuming that option market makers do not engage in overnight stock trading, but rather only perform discrete delta hedging at two different times: 4PM EST and 9:30AM EST (stock market close and open). This typeofhedgingleadstoahedginglossforthemarketmakerssincetheyareholdingashortgamma position.29 BoyleandEmanuel(1980)firstshowthatdiscretedeltahedginggeneratesgammarisk. 29Figure10presentthattheoptionendusersholdnetlonggammapositions,therefore,optionmarketmakershold shortgammaposition. 38 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 84,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Thuswenamedthelossastheovernightgammarisk,andmeasureapproximatelyas: 1 Risk = |Γ σ2(S2 −S2 )|dt, (9) t 2 t t t+1,open t,close where Γ is the net open interest gamma on day t, σ is the implied volatility selected by option t t market makers for delta hedging calculation. In this case, we select the 7-day MFIV on day t. S and S are the closing price of the stock on dayt and the open price on dayt+1. dt t,close t+1,open isthetimeintervalbetweentwodiscretehedgings,andwemakeitequalto1/365. [InsertFigure11here.] Figure 11 shows the time series of overnight gamma risk calculated using Equation (9). We notice an unexpected surge on January 26, 2021, which suggests that the overnight gamma risk is $145 million. This would be the case if option market makers only rebalanced their delta positions at the opening price of $354.83 on January 27, instead of doing more precise delta hedging when the price rose from the closing price of $147.98 during the night of January 26. If this were to happen, option market makers would suffer a loss of $145 million in their market makingportfolios. The evidence strongly suggests that option market makers are compelled to perform delta rebalancing on the night of January 26, despite their attempts to effectively manage their gamma exposure. Inotherwords,agammasqueezeoccursonthenightofJanuary26. 6 What make matters worse? We present evidence to demonstrate the presence of a short squeeze and a gamma squeeze on GameStop. In this section, we draw attention to two facts suggesting that the extraordinary surge during January 26 to 28 may be linked to something that had been overlooked. First, institutional investorskeepacloseeyeonthesocialmediaplatform,allowingthemtorespondmuchfasterthan 39 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 84,
    "chunk_index": 59,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "demonstrate the presence of a short squeeze and a gamma squeeze on GameStop. In this section, we draw attention to two facts suggesting that the extraordinary surge during January 26 to 28 may be linked to something that had been overlooked. First, institutional investorskeepacloseeyeonthesocialmediaplatform,allowingthemtorespondmuchfasterthan 39 Electronic copy available at: https://ssrn.com/abstract=4560320 retail traders. Second, the components of options market maker holdings has a major impact on their overnight delta hedging, leading to a special type of gamma squeeze in the GameStop case, whichweterman“after-hoursgammasqueeze”. [InsertFigure12here.] Figure 12 depicts the intraday price movement and trading activities on three big move days (January 26, 27 and 28). We observe that the stock price becomes more volatile during the overnight session, which is contrary to the typical volatility seasonality.30 In contrast to the active intraday session, the overnight session is relatively quiet measured by trading activities. As we havedemonstratedpreviously,theovernightinstitutionaltradingdrivestheovernightpricesurge. 6.1 Who Follows Influencers More Closely? Previous research has suggested that amateur investors who post on Reddit and Twitter have the upper hand over professional traders who short sell, resulting in a significant loss for the latter in the GameStop case, thus creating a David-versus-Goliath story. However, institutional investors, who may not be active on Reddit and Twitter, can still keep track of these social media platforms in real time. This allows them to engage in front-running, which involves buying from the market beforeretailinvestorsandthensellingtoretailinvestorswhoreadthoseinfluencers’postlater. [InsertFigure13here.] At4:08:02PMESTonJanuary26,ElonMusktweeted“Gamestonk!!”withaRedditlink. The figure 13 displays the second-by-second level trading activities and the price chart from 4:07:00 to 4:09:00. As demonstrated in the figure, three ISO orders were executed three seconds after the tweetwassent. Additionally,forthefollowing10seconds(4:08:06to4:08:15),institutionstraded 30Onaverage,stockintradayvolatilityismuchhigherthanovernight. SeeOldfieldandRogalski(1980)andStoll andWhaley(1990) 40 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 84,
    "chunk_index": 60,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "involves buying from the market beforeretailinvestorsandthensellingtoretailinvestorswhoreadthoseinfluencers’postlater. [InsertFigure13here.] At4:08:02PMESTonJanuary26,ElonMusktweeted“Gamestonk!!”withaRedditlink. The figure 13 displays the second-by-second level trading activities and the price chart from 4:07:00 to 4:09:00. As demonstrated in the figure, three ISO orders were executed three seconds after the tweetwassent. Additionally,forthefollowing10seconds(4:08:06to4:08:15),institutionstraded 30Onaverage,stockintradayvolatilityismuchhigherthanovernight. SeeOldfieldandRogalski(1980)andStoll andWhaley(1990) 40 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 84,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "a total of 89.5 thousand shares, while retail traders were inactive during this period. This example indicatesthatinstitutionsareabletokeeptrackoftherenownedsocialmediaplatforminrealtime, andcanactontheopinionofinfluencerswithinsecondsbytradinginthemarket. [InsertFigure14here.] Keith Gill, a famous Reddit influencers and individual retail trader, attended a US House hearings on GameStop and posted his GameStop holdings daily during the period of significant price movement.31 Figure 14 illustrates the intraday pattern on days with large price movements. It is interesting to note that institutional traders are active during the morning and after-hours sessions, while retail traders tend to trade during the regular trading session. Although some brokers allow retail traders to submit orders overnight, these orders are not processed in real time, but rather at 8AM, which explains the spike in retail trades at that time. On the cumulative signed volume figure, we observe upward jumps after 3PM, which is coincidentally matched the timing of Keith Gill’s posts. Additionally we notice that when the market opens, institutional investors tend to sell their holdings while retail traders continue to purchase. In the afternoon, however, the opposite occurs; institutions buy the asset while retail traders close their long positions. This trading pattern is only seen in these big move days, and when combined with the overnight price surge information, it appears that institutions are buying after Keith Gill’s post, and then closing their positions when retail traders open long positions after the market opens. In summary, we provide two empirical examples to show that institutional traders follow influencers more closely thanretailtraders. 6.2 After-Hours Gamma Squeeze Althoughwehaveshownthattheycaneffectivelymanagegammaexposureduringregulartrading hours and there was an overnight gamma squeeze on January 26, in this section we argue that it 31At15:05:36onJanuary25,KeithGillsharedhisGameStopstake. Thefollowingday,at15:08:03onJanuary26, heposteditagain. OnJanuary27,heposteditathirdtimeat15:15:35,andonJanuary28,heposteditforthefourth timeat15:06:23. 41 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 84,
    "chunk_index": 62,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "summary, we provide two empirical examples to show that institutional traders follow influencers more closely thanretailtraders. 6.2 After-Hours Gamma Squeeze Althoughwehaveshownthattheycaneffectivelymanagegammaexposureduringregulartrading hours and there was an overnight gamma squeeze on January 26, in this section we argue that it 31At15:05:36onJanuary25,KeithGillsharedhisGameStopstake. Thefollowingday,at15:08:03onJanuary26, heposteditagain. OnJanuary27,heposteditathirdtimeat15:15:35,andonJanuary28,heposteditforthefourth timeat15:06:23. 41 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 84,
    "chunk_index": 63,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "is essential for option market makers to take into account their composition of holdings when the overnightvolatilityishigh. Itisnotedthatthelongoptiongammaischangedwiththeunderlyingpriceandisatitshighest when the option is around ATM with reasonable implied volatility. In situations where investors long significant quantities of deep OTM call options, an overnight price surge has the potential to transform these OTM calls into ATM calls. This transformation leads to a pronounced gamma exposureforoptionmarketmakers. Addingtothecomplexity,thesituationcanbeexacerbatedby theclosingoftheoptionsmarket,whichrestrictsoptionmarketmakerstotradingtheunderlyingin an illiquid after-hours stock market. This combination of factors creates a scenario that we named “after-hours gamma squeeze”. This concept is illustrated through the examples of January 26 and January27in2021: [InsertFigure15here.] Figure 15 presents the signed volume charts for high strike price options and the GameStop overnight price charts for two trading days. On January 26, 2021, GameStop’s closing price stood at $147.98 with an intraday peak of $150. The upper left chart shows the signed volume of high strikepriceoptions. Foreachstrikeprice,weaggregate thesignedvolumeacrossoptioncontracts with different expiration dates. In particular, barring contracts with a strike price of $150, all other high strike price contracts are of first-day issuance, implying that these holdings represent net open interest for these contracts. The upper right graph shows the overnight midpoint quote price, depicted at a 1-minute interval. The tweet “Gamestonk!!” posted by Elon Must at 4:08PM prompted a rapid surge in price, propelling it from $144.55 at 4:08 PM to a temporary zenith of $247.445 at 5:04 PM. Subsequently, the price maintained a relatively steady range between $200 and$250until8PM.Thisphenomenonisanindicationtowardthegammasqueeze. Based on options theory, the gamma of OTM call options increases with price, reaches the peak when options become ATM and decreases with the price when these calls are ITM. The total gamma, which is the sum of gamma for individual trades, also undergoes fluctuations as 42 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 84,
    "chunk_index": 64,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "options theory, the gamma of OTM call options increases with price, reaches the peak when options become ATM and decreases with the price when these calls are ITM. The total gamma, which is the sum of gamma for individual trades, also undergoes fluctuations as 42 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 84,
    "chunk_index": 65,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "the asset’s price changes, but it is profoundly influenced by the composition of the holdings. For example, the options with strike prices $175 and $190 have similar positive signed volume. As thestockpriceincreases,thedeclininggammaarisingfromtheoptionswithastrikepriceof$175 potentially counteracts the increasing gamma arising from options with a strike price of $190. If this hypothesis holds, it is possible that the net gamma remained relatively stable within the price range of $170 to $190. This enduring demand for hedging between the $170 and $190 range compels options market makers keep buying underlying. However, it should be noted that the total net gamma might start to decline once the price reaches $230. Above this price level, all call options’ gamma decreases due to their ITM status. Therefore, the sustained buying pressure that was maintaining the price around $230 might start to ease. This dynamic alignment between continuousbuyingpressureandtheasset’spricearound$230isnotablyobservedinthepricechart. Incontrast,anopposingscenariounfoldsduringtheovernightsessionofJanuary27th. Notable positivesignedvolumesareobservedonthefirst-dayissuedcalloptionswithstrikepricesof$400 and$430. Onthecontrary,thereisanegativesignedvolumeonthecalloptionswithastrikeprice of $500. During the morning session, the stock price climbed through $400, crested at $503, and then readjusted and stabilized around $430 at around 7 AM. The price pattern can be related to the call options associated with a strike price of $500, which exerts a negative influence on the total gamma. This dynamic imparts a greater decrease in total gamma as the price approaches $500. Therefore,thisinterplayunderminesthemomentumnecessaryforthepricetoriseabovethe $500 barrier. As such, the absence of a strong driving momentum restricts the asset’s price from surmountingthe$500mark. In summary, the change in total gamma in response to the variation in the underlying price during the after-hours session has significant implications. During this period, options market makersfacethechallengeofmitigatingtheirdeltariskinanilliquidstockmarketonly. Moreover, the dynamics of total gamma is distinctly influenced by the composition of holdings, occasionally precipitating an “after-hours gamma squeeze.” Remarkably, this phenomenon has largely evaded theattentionofregulatorybodies. Althoughwehavehighlightedonlytwoinstancestounderscore 43 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 84,
    "chunk_index": 66,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "the underlying price during the after-hours session has significant implications. During this period, options market makersfacethechallengeofmitigatingtheirdeltariskinanilliquidstockmarketonly. Moreover, the dynamics of total gamma is distinctly influenced by the composition of holdings, occasionally precipitating an “after-hours gamma squeeze.” Remarkably, this phenomenon has largely evaded theattentionofregulatorybodies. Althoughwehavehighlightedonlytwoinstancestounderscore 43 Electronic copy available at: https://ssrn.com/abstract=4560320 thisconcept,atheoreticalstudyonthisisdesired. 7 A Model on Short-Selling Predators The empirical evidence presented in the preceding sections confirms three key points. First, institutional order flows move the stock price. Second, certain sophisticated options traders maintain a positive gamma during surge period. Third, the occurrence of an after-hours gamma squeeze was evident on the night of January 26. In this section, we further develop the model proposedbyBrunnermeierandPedersen(2005)toelucidatethebehaviorofshortsellingpredators. Ourmodelisconsistentwiththeempiricalevidencewehaveobserved. 7.1 Equilibrium Price FollowingBrunnermeierandPedersen(2005)setup,weconsideracontinuous-timeeconomywith twoassets,arisklessbondwithzerorisk-freerateandariskyasset. Theriskyassethasanaggregate supply of S>0 and a final random payoff v with E(v)= µ at time T. The price of the risky asset attimet isdenotedby p(t). DivergingfromBrunnermeierandPedersen(2005)32,weextendtheir model by accommodates three types of agents: large strategic traders encompassing both short sellersandpredators,long-terminvestors,anddelta-hedgingtraders. Strategic traders, i ∈ 1,2,···,I, are risk neutral and seek to maximize their expected profit. Each strategic trader is sizable, and thus, their trading has an effect on the equilibrium price. Therefore,theyactstrategicallyandconsidertheirpriceimpactwhentrading. Eachstrategictrader i has a given initial holding, xi(0), of the risky asset and can continuously trade with his trading itensity,ai(t). Hence,hisholdingattimet,xi(t),oftheriskassetis (cid:90) t xi(t)=xi(0)+ ai(τ)dτ, (10) 0 32Theirmodelincludeslargestrategictradersandlong-terminvestors. 44 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 84,
    "chunk_index": 67,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "strategic trader is sizable, and thus, their trading has an effect on the equilibrium price. Therefore,theyactstrategicallyandconsidertheirpriceimpactwhentrading. Eachstrategictrader i has a given initial holding, xi(0), of the risky asset and can continuously trade with his trading itensity,ai(t). Hence,hisholdingattimet,xi(t),oftheriskassetis (cid:90) t xi(t)=xi(0)+ ai(τ)dτ, (10) 0 32Theirmodelincludeslargestrategictradersandlong-terminvestors. 44 Electronic copy available at: https://ssrn.com/abstract=4560320 andtheaggregateholdingforallstrategictradersisX(t)=∑ xi(t). i In addition to strategic traders, the market is populated by long-term investors such as pension fundsandhedgedfunds. Thelong-terminvestorsareprice-takersandhaveanaggregatedemand 1 Y(p)= (µ−p), (11) λ where λ is the price impact which is measured the liquidity of the risky asset. The demand (11) dependsonlyonthecurrentprice p,thatis,long-terminvestorsdonotattempttoprofitfromprice fluctuations. Finally,thedelta-hedgingtradershaveanaggregatehedgingdemand (cid:90) t (cid:90) t D(t)= d∆(τ)= Γ(τ)dp(τ)≈Γ(p(t)−p ). (12) 0 0 0 Weassumethecumulativenetopeninterestgammaisstableint ∈[0,T]. Therefore,thetotaldemandisY(p(t))+X(t)+D(t),andthetotalsupplyisS−∆ ,where∆ is 0 0 the net open interest delta att =0. The market clearing price p(t) solvesY(p(t))+X(t)+D(t)= S−∆ ,andsothepriceis 0 1 λ p(t)= µ− [S−∆ +Γp −X(t)] 0 0 1−Γλ 1−Γλ (13) 1 λ λ = µ− (S−X(t))+ (∆ −Γp ). 0 0 1−Γλ 1−Γλ 1−Γλ |dP| At the equilibrium price, Γλ < 1. λ is Kyle (1985) price impact, defined as λ = > 0. dVolumet On the other hand, Γ = d∆t. Therefore, if Γ is positive, Γλ = d∆t must be less than 1 in dP dVolumet equilibrium, since the additional hedging demand d∆ should be less than the additional liquidity t supply dVolume . Note that in practice, if the hedging demand is temporarily higher than the t liquidity supply, the price will increase, then the positive Γ will decrease with the price, thus the price will reach a new equilibrium where Γλ <1. If Γ=0 and ∆ =0, the equilibrium price (13) 0 isinagreementwiththeequilibriumestablishedbyBrunnermeierandPedersen(2005). 45 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 84,
    "chunk_index": 68,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "demand is temporarily higher than the t liquidity supply, the price will increase, then the positive Γ will decrease with the price, thus the price will reach a new equilibrium where Γλ <1. If Γ=0 and ∆ =0, the equilibrium price (13) 0 isinagreementwiththeequilibriumestablishedbyBrunnermeierandPedersen(2005). 45 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "4.4.2 WeightedPriceContribution",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 84,
    "chunk_index": 69,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.4.2 WeightedPriceContribution (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "We categorize strategic traders into two groups: short sellers and predators. The number of short sellers is IS > 0, and the number of predators is IP > 1, thus IS+IP = I. At t , short sellers are 0 exposed to financial distress and begin to buy to cover. Predators can easily know the moment t 0 by monitoring the order flow in the stock market. We are interested in the optimal strategy for predatorsforthetimeperiod[t ,T]. 0 UnlikeBrunnermeierandPedersen(2005),33 weexpecttheholdingsaredifferentforthesetwo groups     <0 iftraderiisashortseller. xi(t ) (14) 0    ≥0 iftraderiisapredator. Predators are short-term investors who expect to profit from short sellers. In contrast to short- sellers, predators exhibit either a lack of opinion or a positive perspective on the underlying. This also provides a straightforward method to distinguish between predators and short sellers byanalyzingtheirinitialholdingsbeforetheoccurrenceofashortsqueeze. Moreover,weassume thatbothshort-sellersandpredatorsholdtheiropinionsduring[t ,T],thatis, 0 Forallt ∈[t ,T] 0     xi(t)≤0 iftraderiisashortseller. (15)    xi(t)≥0 iftraderiisapredator. As mentioned earlier, the price impact should be considered due to the size of these strategic traders. We assume that the liquidity capacity is a given A and traders suffer temporary impact costsattimet if |∑ai(t)|>A. (16) i 33Theyassumeallstrategictradershavethesameholdingsatt . 0 46 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 84,
    "chunk_index": 70,
    "word_count": 206,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "  xi(t)≥0 iftraderiisapredator. As mentioned earlier, the price impact should be considered due to the size of these strategic traders. We assume that the liquidity capacity is a given A and traders suffer temporary impact costsattimet if |∑ai(t)|>A. (16) i 33Theyassumeallstrategictradershavethesameholdingsatt . 0 46 Electronic copy available at: https://ssrn.com/abstract=4560320 Moreover, the temporary price impact cost for trader i is Gi(t,γ), where γ is a significant large temporary price impact. In other words, the trader i has no temporary price impact if ai ∈[a(i),a¯(i)]. WeassumethatattimeT,predatorshavethepositionlimit,x¯,wherex¯≥xi(t ),andshortsellers 0 have zero position. Furthermore, we also assume that T is large enough to allow short sellers to cover their short positions. Brunnermeier and Pedersen (2005) have position limit throughout the period, but we do not set a position limit in [t ,T). First, margin trading is popular and the capital 0 of strategic traders is large. Second, the liquidity capacity is limited, and strategic traders would sufferthesignificanttemporarypriceimpactcostiftheyplacelargemarketorders. The strategic trader i is to maximize his expected wealth subject to the constraints described above,andastrategictrader’sobjectivefunctionis (cid:18) (cid:90) T (cid:19) maxE xi(T)p(T)− [ai(t)p(t)+Gi(t,γ)]dt . (17) ai 0 Following Brunnermeier and Pedersen (2005), we define an equilibrium set as a set of processes (a1,···,aI)s.t,foreachi,ai solvesEquation(17),takinga−i=(a1,···,ai−1,ai+1,···,aI)asgiven. Two considerations can help us simplify the objective function. First, it is not optimal to incur thetemporaryimpactcost. Therefore,theoptimaltraderintensityfollowsai∈[a(i),a¯(i)]. Second, because X(t ) < 0 < X(T), from equation (13), the price follows p(t ) < p(T), therefore, any 0 0 optimal trading strategy satisfies xi(T)=x¯ for i∈IP. Based on these two considerations and put equation(13)intoequation(17),werewriteourobjectivefunctionas ForlargeT andeachi (cid:18)(cid:90) T (cid:19) (cid:18)(cid:90) T (cid:19) MinE [ai(t)p(t)]dt ⇒MinE [ai(t)X−i(t)]dt , (18) ai 0 ai 0 s.t. ai(t)∈[a,a¯] where X−i(t) = ∑ xj(t). This implies that strategic traders (both short sellers and predators) j̸=i 47 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 84,
    "chunk_index": 71,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Based on these two considerations and put equation(13)intoequation(17),werewriteourobjectivefunctionas ForlargeT andeachi (cid:18)(cid:90) T (cid:19) (cid:18)(cid:90) T (cid:19) MinE [ai(t)p(t)]dt ⇒MinE [ai(t)X−i(t)]dt , (18) ai 0 ai 0 s.t. ai(t)∈[a,a¯] where X−i(t) = ∑ xj(t). This implies that strategic traders (both short sellers and predators) j̸=i 47 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 84,
    "chunk_index": 72,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "try to minimize their own trading cost, but not taking into account their price impact. These traders, particularly predators, generate profits by capitalizing on the influence of other traders on prices. This fundamental distinction serves as a means to distinguish predatory trading from price manipulation,whereatrader’sowntransactionsdirectlyimpactprices. Furthermore,therewritten objective function in (18) indicates that once short sellers decide to close their short positions, which is the time t in the model, optimal strategies for strategic traders, including short sellers 0 andpredators,arenotrelatedtotheunderlyingprice,butonlyrelatedtothetradingintensity. Untilnow,wehavethesameobjectivefunctionasBrunnermeierandPedersen(2005)butwith slightly different constraints. Following their method, we get the unique equilibrium for our case. To simplify, att , all short sellers’ positions are xS(t )<0, and all predators’ positions are xP(t ), 0 0 0 satisfying x¯≥xP(t )≥0. The optimal strategy for short sellers is to repurchase at constant speed 0 A/I until time tend =t −xS(t )/(A/I). The optimal strategy for predators is to buy at constant 0 0 speedA/Iduring[t ,t +τ),thenselltheirholdingstoshortsellersduring[t +τ,t −xS(t )/(A/I)]. 0 0 0 0 0 Theoptimaltradingintensityforpredatoratdifferentperiodis      A I fort ∈[t 0 ,t 0 +τ);    ai∗(t)= − (A/I)IS fort ∈[t +τ,t − xS(t 0 ) );  IP−1 0 0 A/I  (19)     0 fort ≥t 0 − x A S( / t 0 I ) , (IP−1)(x¯−xP(t ))−xS(t )IS A 0 0 where τ = / . I−1 I To ensure t +τ ≤ t −xS(t )/(A/I), x¯ ≤ xP(t )−xS(t ) must hold. This condition implies 0 0 0 0 0 thattheholdingchangeforpredators,x¯−xP(t ),mustbesmallerthanthedemandofshortsellers, 0 −xS(t ), which should be held in practice. Under this condition, predators have the opportunity to 0 selltheirholdingstoshortsellersbeforeshortsellersfinishcoveringtheirshortpositions. 48 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 84,
    "chunk_index": 73,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "To ensure t +τ ≤ t −xS(t )/(A/I), x¯ ≤ xP(t )−xS(t ) must hold. This condition implies 0 0 0 0 0 thattheholdingchangeforpredators,x¯−xP(t ),mustbesmallerthanthedemandofshortsellers, 0 −xS(t ), which should be held in practice. Under this condition, predators have the opportunity to 0 selltheirholdingstoshortsellersbeforeshortsellersfinishcoveringtheirshortpositions. 48 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 84,
    "chunk_index": 74,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Withtheoptimaltradingintensity,thepricedynamicsare       p(t 0 )+ 1− λ Γλ A[t−t 0 ] fort ∈[t 0 ,t 0 +τ);   (cid:16) (cid:17) p∗(t)= p(t )+ λ Aτ− (A/I)IS [t−(t +τ)] fort ∈[t +τ,t − xS(t 0 ) ); (20)  0 1−Γλ IP−1 0 0 0 A/I      p(t 0 )+ 1− λ Γλ [IP(x¯−xP(t 0 ))−xS(t 0 )IS] fort =tend =t 0 − x A S( / t 0 I ) . Equation (20) reveals that the price reaches its highest point at t = τ, which means that predators have completed their acquisitions and begin to sell to short-sellers. Additionally, when comparingtheslopeofthepricefunctionduringthepredatorbuyingperiodandthepredatorselling period, it is evident that the price rises sharply when predators buy and gradually decreases when predatorssell. 7.3 When to Initiate the Short Squeeze? Based on the trading intensity in Equation (19) and the price dynamics in Equation (20), The predator’sprofitduring[t ,tend]is 0 (cid:90) tend WP = p∗(tend)x¯− p∗(t)ai∗(t)dt−p(t )xP(t ) 0 0 t 0 (21) λ = g(x¯,xP(t ),xS(t ),IS,IP), 0 0 2(1−Γλ) where g(·) function is always positive. This implies that predators can definitely earn money once shortsellersdecidetoclosetheirshortpositions. To maximize profit, when should predators initiate a short squeeze? Our model offers some insights. First of all, Equation (21) indicates that the profit is not related to the price p(t ). g(·) 0 functiondependsonthemarketstructureofshortsellersandpredators(xP(t ),xS(t ),IS,IP)andthe 0 0 final holding of predators x¯. All these parameters are predetermined. Predators can only increase theprofitbyaffectingΓandλ. 49 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 84,
    "chunk_index": 75,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Our model offers some insights. First of all, Equation (21) indicates that the profit is not related to the price p(t ). g(·) 0 functiondependsonthemarketstructureofshortsellersandpredators(xP(t ),xS(t ),IS,IP)andthe 0 0 final holding of predators x¯. All these parameters are predetermined. Predators can only increase theprofitbyaffectingΓandλ. 49 Electronic copy available at: https://ssrn.com/abstract=4560320 The positive ∂WP suggests that initiating a short squeeze during times of higher λ (indicating ∂λ moreilliquid)benefitspredators. Thisalignswithourobservedlargepricemovementduringafter- hours sessions. The predators have made several attempts to initiate the short squeeze. Similarly, positive ∂WP means that predators with positive gamma option trades can increase profits. Our ∂Γ empirical data concurs, highlighting that sophisticated option traders maintain a positive gamma midstsurges. In summary, predators could strategically initiate a short squeeze during periods of market illiquidity while also considering the presence of positive gamma holdings among investors in the options market. Therefore, the after-hours session emerges as an optimal window, particularly when significant deep in-the-money options positions manifest, serving as an indicator for the after-hoursgammasqueeze. 8 Conclusion TheGameStopshortsqueezestandsoutasarguablythemostdramaticeventinthemodernhistory of finance. In January 2021, a staggering 140 percent of the float shares had been sold short, leadingtoafrenziedrushofbuyingthatpropelledthepricefarbeyondallexpectations. Thissurge resultedinsubstantiallossesforshortsellersandevenledtothebankruptcyofcertainhedgefunds thathadtakenpositionsagainstthebubble. In our study, we reveal several crucial aspects of GameStop price dynamics that highlights its remarkable dependency on overnight trading activities. Our empirical results show that the prices during the surge period are mainly driven by institutional trades during both the day and after- hour sessions. Moreover, the after-hours volatility prominently hinges on institutional order flows rather than on retail order flows. With an in-depth examination, we find that the prices charge aheadsharplyintheilliquidafter-hoursmarket,whenitisbeneficialforinstitutionalspeculatorsto strategically orchestrate a short squeeze in a situation in which short sellers have little possibility 50 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 84,
    "chunk_index": 76,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "hour sessions. Moreover, the after-hours volatility prominently hinges on institutional order flows rather than on retail order flows. With an in-depth examination, we find that the prices charge aheadsharplyintheilliquidafter-hoursmarket,whenitisbeneficialforinstitutionalspeculatorsto strategically orchestrate a short squeeze in a situation in which short sellers have little possibility 50 Electronic copy available at: https://ssrn.com/abstract=4560320 ofcoveringtheirshortpositionsatnight. Furthermore, our analysis identifies the participation of sophisticated option traders who have consistently maintained long gamma positions throughout the surge period. In particular, our evidencesuggeststhattheremarkableincreaseduringtheafter-hourssessiononJanuary26,2021, is attributable to an after-hours gamma squeeze. The squeeze is caused by sudden price jumps during after-hour sessions and a large positive net open interest in OTM call options, leading to amplifiedgammaexposureandsuboptimalhedgingbyoptionmarketmakerswho,amongtheshort seller,areforcedtobuysharesatrisingprices. Although our available data do not permit a definitive identification of which institutional speculators are responsible, we extend the model of Brunnermeier and Pedersen (2005) to explain their potential collective behaviors. Our model predicts that these institutional speculators would optimize their gains by orchestrating the short squeeze within an environment of limited liquidity while simultaneously maintaining a positive gamma position within the options market. Interestingly,thesemodelpredictionsarewellsupportedbyourempiricalevidence. References Allen, Franklin, Marlene Haas, Eric Nowak, Matteo Pirovano, and Angel Tengulov, 2023, Squeezingshortsthroughsocialmediaplatforms,AvailableatSSRN3823151. Allen, Franklin, Marlene D Haas, Eric Nowak, and Angel Tengulov, 2021, Market efficiency and limits to arbitrage: Evidence from the volkswagen short squeeze, Journal of Financial Economics142,166–194. Andersen, Torben, Ilya Archakov, Leon Grund, Nikolaus Hautsch, Yifan Li, Sergey Nasekin, Ingmar Nolte, Manh Cuong Pham, Stephen Taylor, and Viktor Todorov, 2021, A descriptive study of high-frequency trade and quote option data, Journal of Financial Econometrics 19, 128–177. 51 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 84,
    "chunk_index": 77,
    "word_count": 260,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "squeeze, Journal of Financial Economics142,166–194. Andersen, Torben, Ilya Archakov, Leon Grund, Nikolaus Hautsch, Yifan Li, Sergey Nasekin, Ingmar Nolte, Manh Cuong Pham, Stephen Taylor, and Viktor Todorov, 2021, A descriptive study of high-frequency trade and quote option data, Journal of Financial Econometrics 19, 128–177. 51 Electronic copy available at: https://ssrn.com/abstract=4560320 Bakshi, Gurdip, Nikunj Kapadia, and Dilip Madan, 2003, Stock return characteristics, skew laws, and the differential pricing of individual equity options, Review of Financial Studies 16, 101– 143. Barber, Brad M, Xing Huang, Philippe Jorion, Terrance Odean, and Christopher Schwarz, 2023, A (sub) penny for your thoughts: Tracking retail investor activity in TAQ, Journal of Finance, forthcoming. Barber, Brad M, and Terrance Odean, 2000, Trading is hazardous to your wealth: The common stockinvestmentperformanceofindividualinvestors,JournalofFinance55,773–806. Barclay, Michael J, and Terrence Hendershott, 2003, Price discovery and trading after hours, ReviewofFinancialStudies16,1041–1073. Barclay, Michael J, and Jerold B Warner, 1993, Stealth trading and volatility: Which trades move prices?,JournalofFinancialEconomics34,281–305. Battalio, Robert, Robert Jennings, Mehmet Saglam, and Jun Wu, 2022, Identifying market maker tradesas‘Retail’fromTAQ:Noshortageoffalsenegativesandfalsepositives? Workingpaper. Boehmer, Ekkehart, Charles M Jones, Xiaoyan Zhang, and Xinran Zhang, 2021, Tracking retail investoractivity,JournalofFinance76,2249–2305. Boyle, Phelim P, and David Emanuel, 1980, Discretely adjusted option hedges, Journal of FinancialEconomics8,259–282. Bradley, Daniel, Jan Hanousek Jr, Russell Jame, and Zicheng Xiao, 2023, Place your bets? the market consequences of investment research on reddit’s wallstreetbets, Available at SSRN 3806065. Brunnermeier, Markus K, and Lasse Heje Pedersen, 2005, Predatory trading, Journal of Finance 60,1825–1863. 52 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 84,
    "chunk_index": 78,
    "word_count": 243,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Journal of FinancialEconomics8,259–282. Bradley, Daniel, Jan Hanousek Jr, Russell Jame, and Zicheng Xiao, 2023, Place your bets? the market consequences of investment research on reddit’s wallstreetbets, Available at SSRN 3806065. Brunnermeier, Markus K, and Lasse Heje Pedersen, 2005, Predatory trading, Journal of Finance 60,1825–1863. 52 Electronic copy available at: https://ssrn.com/abstract=4560320 Bryzgalova, Svetlana, Anna Pavlova, and Taisiya Sikorskaya, 2022, Retail trading in options and theriseofthebigthreewholesalers,JournalofFinance,forthcoming. Bryzgalova, Svetlana, Anna Pavlova, and Taisiya Sikorskaya, 2023, Profiting from investor mistakes: Evidencefromsuboptimaloptionexercise,AvailableatSSRN4295297. Chakravarty, Sugato, Pankaj Jain, James Upson, and Robert Wood, 2012, Clean sweep: Informed trading through intermarket sweep orders, Journal of Financial and Quantitative Analysis 47, 415–435. Christoffersen,Peter,RuslanGoyenko,KrisJacobs,andMehdiKaroui,2018,Illiquiditypremiain theequityoptionsmarket,ReviewofFinancialStudies31,811–851. Cremers, Martijn, and David Weinbaum, 2010, Deviations from put-call parity and stock return predictability,JournalofFinancialandQuantitativeAnalysis45,335–367. Easley, David, Maureen O’hara, and Pulle Subrahmanya Srinivas, 1998, Option volume and stock prices: Evidenceonwhereinformedtraderstrade,JournalofFinance53,431–465. Garleanu, Nicolae, Lasse Heje Pedersen, and Allen M Poteshman, 2008, Demand-based option pricing,ReviewofFinancialStudies22,4259–4299. Holden,CraigW,andStaceyJacobsen,2014,Liquiditymeasurementproblemsinfast,competitive markets: Expensiveandcheapsolutions,JournalofFinance69,1747–1785. Hu, Danqi, Charles M Jones, Valerie Zhang, and Xiaoyan Zhang, 2021, The rise of reddit: How socialmediaaffectsretailinvestorsandshort-sellers’rolesinpricediscoveryAvailableatSSRN 3807655. Kyle,AlbertS,1985,Continuousauctionsandinsidertrading,Econometrica53,1315–1335. Lakonishok, Josef, Inmoo Lee, Neil D Pearson, and Allen M Poteshman, 2007, Option market activity,ReviewofFinancialStudies20,813–857. 53 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 55,
    "page_range": "p.55-56",
    "total_pages": 84,
    "chunk_index": 79,
    "word_count": 190,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.55-56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Allen M Poteshman, 2008, Demand-based option pricing,ReviewofFinancialStudies22,4259–4299. Holden,CraigW,andStaceyJacobsen,2014,Liquiditymeasurementproblemsinfast,competitive markets: Expensiveandcheapsolutions,JournalofFinance69,1747–1785. Hu, Danqi, Charles M Jones, Valerie Zhang, and Xiaoyan Zhang, 2021, The rise of reddit: How socialmediaaffectsretailinvestorsandshort-sellers’rolesinpricediscoveryAvailableatSSRN 3807655. Kyle,AlbertS,1985,Continuousauctionsandinsidertrading,Econometrica53,1315–1335. Lakonishok, Josef, Inmoo Lee, Neil D Pearson, and Allen M Poteshman, 2007, Option market activity,ReviewofFinancialStudies20,813–857. 53 Electronic copy available at: https://ssrn.com/abstract=4560320 Lee, Charles MC, and Mark J Ready, 1991, Inferring trade direction from intraday data, Journal ofFinance46,733–746. McLean, R David, Jeffrey Pontiff, and Christopher Reilly, 2023a, Retail investors and analysts WorkingPaper. McLean, R David, Jeffrey Pontiff, and Christopher Reilly, 2023b, Taking sides on return predictabilityAvailableatSSRN3637649. Mitts, Joshua, Robert H Battalio, Jonathan Brogaard, Matthew D Cain, Lawrence R Glosten, and BrentKochuba,2022,Areportbytheadhocacademiccommitteeonequityandoptionsmarket structureconditionsinearly2021,AvailableatSSRN4030179. Moussawi, Rabih, Lai Xu, and Zhaoque (Chosen) Zhou, 2023, A market maker of two markets: theroleofoptionsinETFarbitrage,AvailableatSSRN4395938. Muravyev, Dmitriy, 2016, Order flow and expected option returns, Journal of Finance 71, 673– 708. Muravyev, Dmitriy, Neil D Pearson, and Joshua Matthew Pollet, 2022, Why does options market informationpredictstockreturns?,AvailableatSSRN2851560. Ni, Sophie X, Neil D Pearson, Allen M Poteshman, and Joshua White, 2021, Does option trading have a pervasive impact on underlying stock prices?, Review of Financial Studies 34, 1952– 1986. O’hara, Maureen, Chen Yao, and Mao Ye, 2014, What’s not there: Odd lots and market data, JournalofFinance69,2199–2236. Oldfield, GeorgeS, andRichard J Rogalski,1980, A theoryof commonstock returns overtrading andnon-tradingperiods,JournalofFinance35,729–751. Savickas, Robert, and Arthur J Wilson, 2003, On inferring the direction of option trades, Journal ofFinancialandQuantitativeAnalysis38,881–902. 54 Electronic copy available at: https://ssrn.com/abstract=4560320 Stoll, Hans R, and Robert E Whaley, 1990, Stock market structure and volatility, Review of FinancialStudies3,37–71. 55 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 56,
    "page_range": "p.56-57",
    "total_pages": 84,
    "chunk_index": 80,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.56-57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "A theoryof commonstock returns overtrading andnon-tradingperiods,JournalofFinance35,729–751. Savickas, Robert, and Arthur J Wilson, 2003, On inferring the direction of option trades, Journal ofFinancialandQuantitativeAnalysis38,881–902. 54 Electronic copy available at: https://ssrn.com/abstract=4560320 Stoll, Hans R, and Robert E Whaley, 1990, Stock market structure and volatility, Review of FinancialStudies3,37–71. 55 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure1. TimeSeriesofClosePriceandVolume ThefiguresdepictthedailyclosepriceforGameStop,S&P500indexandvolumeforGameStopduringfull sampleperiod. ThesampleperiodcoversJanuary1,2020,toDecember31,2021. ClosePrice Volume 350 300 250 200 150 100 50 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 ecirP 5000 4500 4000 3500 3000 2500 2000 leveL xednI 2 Gamestop 1.8 S&P500 index 1.6 1.4 1.2 1 0.8 0.6 0.4 0.2 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 emuloV 108 56 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure2. DailyShortInterestandShortVolume The figures depict the daily short interest and short volume for GameStop (GME) during the full sample period and the surge period, respectively. Short interest is the ‘quantity on loan’ reported in IHS Markit data. TheshortvolumeisobtainedfromFINRA.ThesampleperiodisfromJanuary1,2020,toDecember 31,2021. FullSamplePeriod SurgePeriod 6 5 4 3 2 1 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 tnuomA erahS 107 6 Short Interest Short Volume 5 4 3 2 1 0 20210104 20210127 20210224 20210310 20210331 tnuomA erahS 107 Short Interest Short Volume 57 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 58,
    "page_range": "p.58-60",
    "total_pages": 84,
    "chunk_index": 81,
    "word_count": 225,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.58-60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "1 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 tnuomA erahS 107 6 Short Interest Short Volume 5 4 3 2 1 0 20210104 20210127 20210224 20210310 20210331 tnuomA erahS 107 Short Interest Short Volume 57 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure3. CumulativeOvernightandIntradayReturns The figures depict the cumulative overnight return and intraday return for GameStop (GME) and BestBuy (BBY) during the full sample period and the surge period, respectively. The overnight return is defined as the return between the closing time of the last trading day at 4:00 PM and the opening time of the current tradingdayat9:30AM.Theintradayreturnisdefinedasthereturnfrommarketopentoclose. Thesample periodisfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 600% 500% 400% 300% 200% 100% 0% -100% 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 snruteR 500% Overnight Return-GME Intraday Return-GME Overnight Return-BBY 400% Intraday Return-BBY 300% 200% 100% 0% -100% 20210104 20210127 20210224 20210310 20210331 snruteR Overnight Return-GME Intraday Return-GME Overnight Return-BBY Intraday Return-BBY 58 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure4. CumulativeSignedVolumeforDifferentTypesofTrades The figures show the cumulative signed share volume for institution investors and retail traders during the fullsampleperiodandthesurgeperiod,respectively. FullSamplePeriod SurgePeriod 3.5 3 2.5 2 1.5 1 0.5 0 -0.5 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 emuloV dengiS .muC 107 2.5 Retail Trades Inst. Trades 2 1.5 1 0.5 0 -0.5 -1 20210104 20210127 20210224 20210310 20210331 emuloV dengiS .muC 107 Retail Trades Inst. Trades 59 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 60,
    "page_range": "p.60-61",
    "total_pages": 84,
    "chunk_index": 82,
    "word_count": 251,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.60-61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 emuloV dengiS .muC 107 2.5 Retail Trades Inst. Trades 2 1.5 1 0.5 0 -0.5 -1 20210104 20210127 20210224 20210310 20210331 emuloV dengiS .muC 107 Retail Trades Inst. Trades 59 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure5. OptionArbitrageTradesOverTime Thefiguresdepicttheoptionarbitragetradesandregulartradesduringthefullsampleperiodandthesurge period,respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 14 12 10 8 6 4 2 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 stcartnoC fo # 105 6 5 4 3 2 1 0 stcartnoC fo # 104 14 Non-Arb Trades(Left) Arb Trades(Right) 12 10 8 6 4 2 0 20210104 20210127 20210224 20210310 20210331 stcartnoC fo # 105 6 5 4 3 2 1 0 stcartnoC fo # 104 Non-Arb Trades(Left) Arb Trades(Right) 60 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure6. 7-DayAnnualizedMFIVOverTime The figures depict the 7-day annualized MFIV during the full sample period and the surge period, respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 3.5 3 2.5 2 1.5 1 0.5 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 VIFM yaD7 3.5 3 2.5 2 1.5 1 0.5 20210104 20210127 20210224 20210310 20210331 VIFM yaD7 61 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 62,
    "page_range": "p.62-64",
    "total_pages": 84,
    "chunk_index": 83,
    "word_count": 206,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.62-64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 3.5 3 2.5 2 1.5 1 0.5 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 VIFM yaD7 3.5 3 2.5 2 1.5 1 0.5 20210104 20210127 20210224 20210310 20210331 VIFM yaD7 61 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure7. DifferentTypesofOptionTrades The figures plot daily calls and puts volume from retail trades and multi-leg trades during the full sample periodandthesurgeperiod,respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31, 2021. RetailTrade(FullSamplePeriod) RetailTrade(SurgePeriod) 10 9 8 7 6 5 4 3 2 1 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 stcartnoC fo # 104 10 Call Put 9 8 7 6 5 4 3 2 1 0 20210104 20210127 20210224 20210310 20210331 stcartnoC fo # 104 Call Put Multi-LegTrade(FullSamplePeriod) Multi-LegTrade(SurgePeriod) 18 16 14 12 10 8 6 4 2 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 stcartnoC fo # 104 18 Call Put 16 14 12 10 8 6 4 2 0 20210104 20210127 20210224 20210310 20210331 stcartnoC fo # 104 Call Put 62 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 64,
    "page_range": "p.64-65",
    "total_pages": 84,
    "chunk_index": 84,
    "word_count": 191,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.64-65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 stcartnoC fo # 104 18 Call Put 16 14 12 10 8 6 4 2 0 20210104 20210127 20210224 20210310 20210331 stcartnoC fo # 104 Call Put 62 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure8. NetOpenInterestforDifferentGroupofTraders The figures plot daily calls and puts net open interest from retail trades and multi-leg trades during the full sample period and the surge period, respectively. The sample period covers from January 1, 2020, to December31,2021. RetailTrade(FullSamplePeriod) RetailTrade(SurgePeriod) 2.5 2 1.5 1 0.5 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 tseretnI nepO teN 105 2.5 Calls Puts 2 1.5 1 0.5 0 20210104 20210127 20210224 20210310 20210331 tseretnI nepO teN 105 Calls Puts Multi-LegTrade(FullSamplePeriod) Multi-LegTrade(SurgePeriod) 9 8 7 6 5 4 3 2 1 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 tseretnI nepO teN 105 9 Calls Puts 8 7 6 5 4 3 2 1 0 20210104 20210127 20210224 20210310 20210331 tseretnI nepO teN 105 Calls Puts 63 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure9. NetOpenInterestDeltaOverTime Thefiguresdepictthenetopeninterestdeltaduringthefullsampleperiodandthesurgeperiod,respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 2 1.5 1 0.5 0 -0.5 -1 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 atleD teN 108 10 8 6 4 2 0 -2 -4 20210104 20210127 20210224 20210310 20210331 atleD teN 107 64 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 84,
    "chunk_index": 85,
    "word_count": 250,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "FullSamplePeriod SurgePeriod 2 1.5 1 0.5 0 -0.5 -1 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 atleD teN 108 10 8 6 4 2 0 -2 -4 20210104 20210127 20210224 20210310 20210331 atleD teN 107 64 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure10. NetOpenInterestGammaOverTime The figures depict the net open interest gamma during the full sample period and the surge period, respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 2 1.8 1.6 1.4 1.2 1 0.8 0.6 0.4 0.2 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 ammaG teN 107 18 16 14 12 10 8 6 4 2 0 20210104 20210127 20210224 20210310 20210331 ammaG teN 106 65 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure11. OvernightGammaRiskOverTime Thefiguresdepicttheovernightgammariskduringthefullsampleperiodandthesurgeperiod,respectively. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. FullSamplePeriod SurgePeriod 15 10 5 0 20200102 20200630 202 2 1 0 0 2 1 1 0 0 4 127 20210331 20211231 ksiR ammaG 107 15 10 5 0 20210104 20210127 20210224 20210310 20210331 ksiR ammaG 107 66 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure12. IntradayPriceandTradingActivitiesonThreeBigMoveDays ThefigurespresenttheintradaypricemovementandtradingactivitiesonJanuary26,27and28,2021. Price Volume 500 450 400 350 300 250 200 150 100 1/26 Open 1/26 Close 1/27 Open 1/27 Close 1/28 Open 1/28 Close ecirP 2.5 2 1.5 1 0.5 0 1/26 Open 1/26 Close 1/27 Open 1/27 Close 1/28 Open 1/28 Close emuloV 106 67 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure13. ReactiononElonMusk’sTweet Thefigurespresentthecumulativetradingvolumeforvariousordertypesandpricechartoneminutebefore andafterElonMusktweetedonJanuary26,2021. Volume PriceChart 2.5 2 1.5 1 0.5 0 4:07:00 4:07:30 4:08:02 4:08:30 4:09:00 emuloV .muC 105 150 Retail Volume Inst. Volume 149 Total Volume 148 147 146 145 144 143 142 141 140 4:07:00 4:07:30 4:08:02 4:08:30 4:09:00 ecirP 68 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 67,
    "page_range": "p.67-70",
    "total_pages": 84,
    "chunk_index": 86,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.67-70)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "https://ssrn.com/abstract=4560320 Figure13. ReactiononElonMusk’sTweet Thefigurespresentthecumulativetradingvolumeforvariousordertypesandpricechartoneminutebefore andafterElonMusktweetedonJanuary26,2021. Volume PriceChart 2.5 2 1.5 1 0.5 0 4:07:00 4:07:30 4:08:02 4:08:30 4:09:00 emuloV .muC 105 150 Retail Volume Inst. Volume 149 Total Volume 148 147 146 145 144 143 142 141 140 4:07:00 4:07:30 4:08:02 4:08:30 4:09:00 ecirP 68 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure14. IntradayTradingPatternonBigMoveDays Thefigurespresenttheintradaytradingdensityandcumulativesignedtradingvolumeforinstitutionaltrader andretailtraders. SamplecoversfromJanuary25,2021toJanuary28,2021. TradingDensity Cum. SignedVolume 8 7 6 5 4 3 2 1 0 4AM 7AM8AM9:30AM 4PM 8PM ytisned gnidarT 10-3 14 Retail Trades Inst. Trades 12 10 8 6 4 2 0 -2 -4 4AM 7AM8AM9:30AM 4PM 8PM emuloV dengiS .muC 105 Retail Trades Inst. Trades 69 Electronic copy available at: https://ssrn.com/abstract=4560320 Figure 15. Options Estimated Net Option Interest and Overnight Price Chart on Jan 26 and 27 The figures show the estimated net option interest of high strike price options at market close and correspondingovernightpricechartonJanuary26and27. Est. NetOpenInterest(Jan26) PriceChart(Jan26) 1500 1000 500 0 -500 -1000 -1500 150155160165170175180185190195200 210 220 230 Strike Price tseretnI nepO teN detamitsE 400 350 300 250 200 150 Call Put 100 4PM 5PM 6PM 7PM 8PM 4AM 5AM 6AM 7AM 8AM 9 9 A : M 30AM ecirP Est. NetOpenInterest(Jan27) PriceChart(Jan27) 1000 500 0 -500 -1000 -1500 350 400 450 500 Strike Price tseretnI nepO teN detamitsE 550 500 450 400 350 300 250 Call Put 200 4PM 5PM 6PM 7PM 8PM 4AM 5AM 6AM 7AM 8AM 9 9 A : M 30AM ecirP 70 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 71,
    "page_range": "p.71-73",
    "total_pages": 84,
    "chunk_index": 87,
    "word_count": 238,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.71-73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "PriceChart(Jan27) 1000 500 0 -500 -1000 -1500 350 400 450 500 Strike Price tseretnI nepO teN detamitsE 550 500 450 400 350 300 250 Call Put 200 4PM 5PM 6PM 7PM 8PM 4AM 5AM 6AM 7AM 8AM 9 9 A : M 30AM ecirP 70 Electronic copy available at: https://ssrn.com/abstract=4560320 Table1 DescriptiveStatistics Thetablereportsthesummarystatisticsofreturnandvolumeforboththestockandoptionsmarkets. Thepre-surgeperiodisfromJanuary1,2020, toDecember31,2020,thesurgeperiodisfromJanuary1,2021toMarch31,2021,andthepost-surgeperiodisfromApril1,2021toDecember31, 2021. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. Pre-Surge(1) SurgePeriod(2) Post-Surge(3) Diff mean median std mean median std mean median std (2)-(1) (3)-(2) PanelA:Stockmarket Return(Unit:percentage) AllDay 0.71 -0.23 7.45 8.02 0.17 32.36 0.04 -0.22 5.87 7.32*** -7.98*** Overnight 0.28 0.00 3.68 7.56 1.01 25.83 0.02 -0.02 2.52 7.28*** -7.54*** Intraday 0.42 -0.22 6.29 0.91 -1.64 23.98 0.03 -0.57 5.55 0.49 -0.88 Volume(Unit:millionshares) AllDay 6.24 3.74 8.44 45.26 30.61 45.16 4.32 2.73 4.14 39.01*** -40.94*** Overnight 0.26 0.06 1.04 4.00 1.62 8.36 0.22 0.08 0.46 3.74*** -3.78*** Intraday 5.98 3.65 7.81 41.27 29.76 41.55 4.10 2.67 3.90 35.29*** -37.17*** Signedvolume(Unit:thousandshares) AllDay 101.98 -6.92 587.36 45.73 -3.76 2072.58 21.17 -7.05 271.11 -56.25 -24.56 Overnight -0.67 -0.26 148.23 100.53 27.16 412.56 6.30 -0.35 117.50 101.20*** -94.23*** Intraday 100.72 -0.66 552.28 -38.86 -6.38 2003.89 14.79 -3.75 252.27 -139.59 53.65 PanelB:Optionsmarket Realizedvolatility 0.74 0.67 0.33 3.69 3.85 1.67 0.86 0.78 0.64 2.95*** -2.83*** ATMimpliedvolatility 1.20 1.11 0.45 2.01 1.96 0.51 1.15 1.00 0.47 0.81*** -0.86*** Volume(Unit:thousandcontracts) Total 44.96 22.01 68.26 409.33 377.16 294.74 103.01 76.35 74.34 364.37*** -306.32*** Call 28.16 12.34 40.50 172.27 135.25 127.34 65.58 49.20 48.47 144.11*** -106.69*** Put 16.81 7.84 29.88 237.06 185.82 199.74 37.43 25.48 32.32 220.26*** -199.64*** BuyCall 13.13 6.33 19.34 83.72 64.38 65.02 31.28 23.15 24.08 70.59*** -52.44*** SellCall 13.66 5.89 19.60 83.46 67.94 59.17 31.95 23.97 23.25 69.80*** -51.50*** BuyPut 8.00 3.29 15.37 114.82 85.93 100.79 17.16 11.56 15.58 106.82*** -97.66*** SellPut 7.92 3.84 13.33 114.80 94.42 95.51 18.61 13.05 16.00 106.87*** -96.19*** Electronic copy available at: https://ssrn.com/abstract=4560320 71",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 73,
    "page_range": "p.73",
    "total_pages": 84,
    "chunk_index": 88,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.73)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "83.72 64.38 65.02 31.28 23.15 24.08 70.59*** -52.44*** SellCall 13.66 5.89 19.60 83.46 67.94 59.17 31.95 23.97 23.25 69.80*** -51.50*** BuyPut 8.00 3.29 15.37 114.82 85.93 100.79 17.16 11.56 15.58 106.82*** -97.66*** SellPut 7.92 3.84 13.33 114.80 94.42 95.51 18.61 13.05 16.00 106.87*** -96.19*** Electronic copy available at: https://ssrn.com/abstract=4560320 71 Table2 RetailandInstitutionalOrderFlowDuringSurgePeriod PanelAofthistablereportstheresultsfromtheorderflowregression OrderFlow =α+β IS+β IPS+Controls +ε , t 1 t 2 t t−1 i,t where dependent variables are the volumes associated with various order flow: after-hours and intraday institutional order flow, after-hours and intraday retail order flows. Panel B reports the same results except now the dependent variables in Panel B are the proportion of total volumes for each of the four types of order flow. The sample period covers from January 1, 2020, to December 31, 2021. Controls include the SPY daily trading volume, SPX index daily return and daily VIX index, all control variables are lagged for one trading day. The t-statistics are reported in parentheses. The symbols, ***, **, and * indicate significanceatthe1%,5%and10%levels,respectively. PanelA:Volume(unit: millionshares) Institutions RetailTraders After-hours(1) Intraday(2) After-hours(3) Intraday(4) Surge(β ) 1.68*** 9.96*** 0.05*** 8.39*** 1 (13.19) (16.44) (13.64) (15.30) Post-Surge(β ) 0.10 0.06 -0.006** -0.30 2 (1.02) (0.13) (-2.42) (-0.72) Obs 505 505 505 505 Controls Yes Yes Yes Yes AdjR2 0.271 0.379 0.337 0.358 PanelB:Proportionalvolume Institutions RetailTraders After-hours(5) Intraday(6) After-hours(7) Intraday(8) Surge(β ) 0.14*** 0.04*** -0.13*** 0.05*** 1 (7.70) (6.99) (-8.80) (9.34) Post-Surge(β ) 0.17*** 0.05*** -0.14*** -0.02*** 2 (12.06) (10.95) (-12.30) (-5.17) Obs 505 505 505 505 Controls Yes Yes Yes Yes AdjR2 0.332 0.306 0.267 0.371 72 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 74,
    "page_range": "p.74",
    "total_pages": 84,
    "chunk_index": 89,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.74)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "PanelB:Proportionalvolume Institutions RetailTraders After-hours(5) Intraday(6) After-hours(7) Intraday(8) Surge(β ) 0.14*** 0.04*** -0.13*** 0.05*** 1 (7.70) (6.99) (-8.80) (9.34) Post-Surge(β ) 0.17*** 0.05*** -0.14*** -0.02*** 2 (12.06) (10.95) (-12.30) (-5.17) Obs 505 505 505 505 Controls Yes Yes Yes Yes AdjR2 0.332 0.306 0.267 0.371 72 Electronic copy available at: https://ssrn.com/abstract=4560320 Table3 WeightedPriceContribution Thistablereportstheweightedpricecontributionofboththeretailandinstitutionaltrades,duringthesurge andnon-surgeperiod,intradayandafterhourssessions. After-hours Intraday Surgeperiod Non-surgeperiod Surgeperiod Non-surgeperiod Retailtrades -1.13 0.33 -155.65 -5.84 Institutionaltrades 44.96 3.37 8.90 3.64 73 Electronic copy available at: https://ssrn.com/abstract=4560320 Table4 IntradayReturnsandOrderImbalanceRatioRegression Thistablereportstheresultsfromthereturnandorderimbalanceratioregression R =α+β Retail +β Inst +β Retail ×IS+β Inst ×IS t 1 t 2 t 3 t t 4 t t +β Retail ×IPS+β Inst ×IPS+ε . 5 t t 6 t t t The sample period covers from January 1, 2020, to December 31, 2021. The t-statistics are reported inparentheses. Thesymbols,***,**,and*indicatesignificanceatthe1%,5%and10%levels,respectively. (1) (2) (3) Constant 0.07 0.24* 0.13 (0.47) (1.77) (0.97) Retail 4.72*** 3.96*** t (16.38) (14.96) Inst 15.20*** 15.55*** t (55.53) (53.71) Retail ×IS 38.19*** 14.74*** t t (29.93) (13.15) Inst ×IS 93.42*** 90.73*** t t (103.49) (97.29) Retail ×IPS -0.10 -0.96** t t (-0.19) (-2.00) Inst ×IPS 4.22*** 3.67*** t t (9.45) (7.98) Obs 186,416 182,908 177,815 AdjR2 0.0083 0.108 0.111 74 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 75,
    "page_range": "p.75-77",
    "total_pages": 84,
    "chunk_index": 90,
    "word_count": 199,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.75-77)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "15.55*** t (55.53) (53.71) Retail ×IS 38.19*** 14.74*** t t (29.93) (13.15) Inst ×IS 93.42*** 90.73*** t t (103.49) (97.29) Retail ×IPS -0.10 -0.96** t t (-0.19) (-2.00) Inst ×IPS 4.22*** 3.67*** t t (9.45) (7.98) Obs 186,416 182,908 177,815 AdjR2 0.0083 0.108 0.111 74 Electronic copy available at: https://ssrn.com/abstract=4560320 Table5 ForecastingReturnUsingMFIV Thistablereportstheresultsfromthereturnpredictionregression R =α+β IS+β IPS+β MFIV ×IS+β MFIV ×IPS+Controls +ε . t+1 1 t 2 t 3 t t 4 t t t t Thedependentvariablesareovernightreturns,intradayreturnsandclose-to-closereturnsreportedin(1),(2) and(3)columns. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. Controlsinclude the SPY daily trading volume, SPX index daily return and daily VIX index. The t-statistics are reported inparentheses. Thesymbols,***,**,and*indicatesignificanceatthe1%,5%and10%levels,respectively. Overnight Intraday Close-to-Close (1) (2) (3) IS -0.08*** 0.18*** 0.10** t (-2.76) (5.81) (2.38) IPS 0.002 0.003 0.005 t (0.08) (0.14) (0.16) MFIV ×IS 0.11*** -0.12*** -0.02 t t (5.89) (-6.38) (-0.70) MFIV ×IPS -0.006 -0.02 -0.02 t t (-0.17) (-0.49) (-0.51) Obs 505 505 505 Controls Yes Yes Yes AdjR2 0.115 0.072 0.027 75 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 77,
    "page_range": "p.77-78",
    "total_pages": 84,
    "chunk_index": 91,
    "word_count": 159,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.77-78)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "t (-2.76) (5.81) (2.38) IPS 0.002 0.003 0.005 t (0.08) (0.14) (0.16) MFIV ×IS 0.11*** -0.12*** -0.02 t t (5.89) (-6.38) (-0.70) MFIV ×IPS -0.006 -0.02 -0.02 t t (-0.17) (-0.49) (-0.51) Obs 505 505 505 Controls Yes Yes Yes AdjR2 0.115 0.072 0.027 75 Electronic copy available at: https://ssrn.com/abstract=4560320 Table6 OptionsTradingVolumeDuringSurgePeriod Thistablereportstheresultsfromtheorderflowregression OV =α+β IS+β IPS+Controls +ε . t 1 t 2 t t i,t ThedependentvariablesinPanelAaretheoptionsvolumesforvarioustradetypes,includingalltrades,call optionstrades,putoptionstrades,buycalloptionstrades,sellcalloptionstrades,buyputoptionstradesand sell put options trades. The dependent variables in Panel B are options volumes from retail traders, while Panel C examines options volumes from sophisticated traders. The sample period covers from January 1, 2020, to December 31, 2021. Controls include the SPY daily trading volume, SPX index daily return and daily VIX index. The t-statistics are reported in parentheses. The symbols, ***, **, and * indicate significanceatthe1%,5%and10%levels,respectively. PanelA:TotalVolume(unit: thousandcontracts) All CallOnly PutOnly BuyCall SellCall BuyPut SellPut Surge(β ) 367.50*** 143.99*** 223.52*** 70.58*** 69.70*** 108.59*** 108.34*** 1 (20.81) (16.42) (20.50) (16.07) (16.84) (19.77) (20.83) Post-Surge(β ) 64.31*** 37.50*** 26.82*** 18.27*** 18.26*** 12.50*** 13.47*** 2 (4.71) (5.54) (3.18) (5.38) (5.71) (2.95) (3.35) Obs 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes AdjR2 0.476 0.369 0.469 0.357 0.382 0.451 0.476 PanelB:Volumefromretailtraders(unit: thousandcontracts) All CallOnly PutOnly BuyCall SellCall BuyPut SellPut Surge(β ) 37.36*** 16.65*** 20.71*** 7.87*** 8.41*** 9.30*** 10.30*** 1 (15.92) (10.83) (19.15) (10.57) (11.46) (18.48) (19.30) Post-Surge(β ) 8.92*** 5.68*** 3.24*** 2.79*** 2.97*** 1.40*** 1.80*** 2 (4.92) (4.78) (3.87) (4.85) (5.24) (3.61) (4.36) Obs 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes AdjR2 0.357 0.227 0.434 0.217 0.247 0.417 0.436 PanelC:Volumefromsophisticatedtraders(unit: thousandcontracts) All CallOnly PutOnly BuyCall SellCall BuyPut SellPut Surge(β ) 72.40*** 35.04*** 37.36*** 16.41*** 16.69*** 15.57*** 19.43*** 1 (17.54) (19.42) (14.26) (18.48) (19.71) (11.93) (15.66) Post-Surge(β ) 13.96*** 9.08*** 4.88** 3.97*** 4.37*** 1.62*** 2.74*** 2 (4.38) (6.51) (2.41) (5.79) (6.68) (1.61) (2.86) Obs 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes AdjR2 0.476 0.369 0.469 0.357 0.382 0.451 0.476 76 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 78,
    "page_range": "p.78",
    "total_pages": 84,
    "chunk_index": 92,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.78)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "(19.71) (11.93) (15.66) Post-Surge(β ) 13.96*** 9.08*** 4.88** 3.97*** 4.37*** 1.62*** 2.74*** 2 (4.38) (6.51) (2.41) (5.79) (6.68) (1.61) (2.86) Obs 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes AdjR2 0.476 0.369 0.469 0.357 0.382 0.451 0.476 76 Electronic copy available at: https://ssrn.com/abstract=4560320 Table7 ForecastingAfter-HoursReturnUsingNetOpenInterestDelta Thistablereportstheresultsfromtheafter-hoursreturnpredictionregression RAH =α+β ∆iIBS+β ∆iIS+β ∆iIPS+Controls +ε . t+1 1 t t 2 t t 3 t t t t We run the regression using various net open interest deltas (∆i) derived from different types of options trades. The dependent variable in each t regressionistheafter-hoursreturns,whichremainsconsistentacrossallthedifferentregressions. Thenetopeninterestdeltaismeasuredinmillion shares, while the after-hours returns are quantified in basis points (bps). The sample period covers from January 1, 2020, to December 31, 2021. Controls include the SPY daily trading volume, SPX index daily return and daily VIX index. The t-statistics are reported in parentheses. The symbols,***,**,and*indicatesignificanceatthe1%,5%and10%levels,respectively. Alltraders Sophisticatedtraders Retailtraders All CallOnly PutOnly All CallOnly PutOnly All CallOnly PutOnly Pre-Surge(β ) -0.45 0.06 -2.04 -3.91 -1.01 -5.46 6.66 2.02 27.08 1 (-0.10) (0.01) (-0.22) (-0.30) (-0.03) (-0.36) (0.25) (0.06) (0.36) Surge(β ) 18.76*** 49.67*** 15.45*** 51.63*** 269.31*** 31.05** 216.08*** 303.15*** 412.78*** 2 (5.78) (7.93) (2.94) (4.69) (8.95) (2.18) (7.58) (7.94) (4.81) Post-Surge(β ) 0.23 0.87 -0.56 1.68 3.89 0.51 7.41 6.87 8.64 3 (0.13) (0.19) (-0.27) (0.19) (0.18) (0.04) (0.31) (0.22) (0.18) Obs 505 505 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes Yes Yes AdjR2 0.054 0.103 0.007 0.033 0.130 -0.001 0.094 0.103 0.035 Electronic copy available at: https://ssrn.com/abstract=4560320 77",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 79,
    "page_range": "p.79",
    "total_pages": 84,
    "chunk_index": 93,
    "word_count": 255,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.79)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "0.51 7.41 6.87 8.64 3 (0.13) (0.19) (-0.27) (0.19) (0.18) (0.04) (0.31) (0.22) (0.18) Obs 505 505 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes Yes Yes AdjR2 0.054 0.103 0.007 0.033 0.130 -0.001 0.094 0.103 0.035 Electronic copy available at: https://ssrn.com/abstract=4560320 77 Table8 TheImpactofNetOpenInterestDeltaonMarketQuality Thistablereportstheresultsfromthemarketqualityregression L =α+β ∆ IBS+β ∆ IS+β ∆ IPS+Controls +ε . t+1 1 t t 2 t t 3 t t t t The dependent variable is one of five market quality measures, including dollar quoted spread, percentage quoted spread, dollar price impact, percentage price impact, and intraday quote-based volatility. The net open interest delta is measured in million shares. The sample period covers from January 1, 2020, to December31,2021. ControlsincludetheSPYdailytradingvolume,SPXindexdailyreturnanddailyVIX index. Thet-statisticsarereportedinparentheses. Thesymbols, ***, **, and*indicatesignificanceatthe 1%,5%and10%levels,respectively. QuotedSpread PriceImpact IntradayVolatility Dollar(10−3) Percentage(10−6) Dollar(10−3) Percentage(10−6) (10−9) Pre-Surge(β ) -2.52*** -23.47*** -1.50 -12.11 -1.21 1 (-2.79) (-6.55) (-1.09) (-1.50) (-1.60) Surge(β ) 3.17*** 9.25*** 4.16*** 13.88** 2.16*** 2 (4.93) (3.63) (4.26) (2.41) (4.01) Post-Surge(β ) 2.24*** -1.83 0.87* -4.35 -0.003 3 (6.62) (-1.37) (1.69) (-1.44) (-0.01) Obs 504 504 504 504 504 Controls Yes Yes Yes Yes Yes AdjR2 0.232 0.258 0.042 0.054 0.067 78 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 80,
    "page_range": "p.80-81",
    "total_pages": 84,
    "chunk_index": 94,
    "word_count": 201,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.80-81)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "Surge(β ) 3.17*** 9.25*** 4.16*** 13.88** 2.16*** 2 (4.93) (3.63) (4.26) (2.41) (4.01) Post-Surge(β ) 2.24*** -1.83 0.87* -4.35 -0.003 3 (6.62) (-1.37) (1.69) (-1.44) (-0.01) Obs 504 504 504 504 504 Controls Yes Yes Yes Yes Yes AdjR2 0.232 0.258 0.042 0.054 0.067 78 Electronic copy available at: https://ssrn.com/abstract=4560320 Table9 NetOpenInterestGammaDuringSurgePeriod Thistablereportstheresultsfromthenetopeninterestgammaregression Γi =α+β IS+β IPS+Controls +ε . t 1 t 2 t t−1 i,t The dependent variables are various net open interest gamma (Γi) derived from different types of options trades. The net open interest gamma is t measuredinmillionshares. ThesampleperiodcoversfromJanuary1,2020,toDecember31,2021. ControlsincludetheSPYdailytradingvolume, SPX index daily return and daily VIX index, all control variables are lagged for one trading day. The t-statistics are reported in parentheses. The symbols,***,**,and*indicatesignificanceatthe1%,5%and10%levels,respectively. Alltraders Sophisticatedtraders Retailtraders All CallOnly PutOnly All CallOnly PutOnly All CallOnly PutOnly Surge(β ) -4.44*** -3.01*** -1.42*** -1.01*** -0.40*** -0.61*** -0.68*** -0.49*** -0.19*** 1 (-10.39) (-11.56) (-6.23) (-5.55) (-9.96) (-3.91) (-12.67) (-11.25) (-9.58) Post-Surge(β ) -5.01*** -3.28*** -1.73*** -1.65*** -0.44*** -1.21*** -0.77*** -0.55*** -0.22*** 2 (-15.19) (-16.27) (-9.83) (-11.72) (-14.10) (-10.02) (-18.51) (-16.35) (-14.20) Obs 505 505 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes Yes Yes AdjR2 0.491 0.507 0.317 0.326 0.470 0.246 0.569 0.487 0.490 Electronic copy available at: https://ssrn.com/abstract=4560320 79",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "7.2 Optimal Strategy for Predators",
    "page_number": 81,
    "page_range": "p.81",
    "total_pages": 84,
    "chunk_index": 95,
    "word_count": 208,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "7.2 Optimal Strategy for Predators (p.81)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "-1.21*** -0.77*** -0.55*** -0.22*** 2 (-15.19) (-16.27) (-9.83) (-11.72) (-14.10) (-10.02) (-18.51) (-16.35) (-14.20) Obs 505 505 505 505 505 505 505 505 505 Controls Yes Yes Yes Yes Yes Yes Yes Yes Yes AdjR2 0.491 0.507 0.317 0.326 0.470 0.246 0.569 0.487 0.490 Electronic copy available at: https://ssrn.com/abstract=4560320 79 A1 Retail and Institutional Order Flow in Other Firms Table 2 reveals that the proportion of institutional order flow is significantly higher during surge periods. This result is consistent across both regular trading sessions and after-hours sessions. In this section, we conduct a similar analysis on other companies to determine whether the rise in institutionaltradingactivityispresentinothernon-squeezedstocks. Table A1 presents the results for two groups of stocks. Panel A displays the findings for the matched firm, BestBuy. The results of the analysis suggest that institutional and retail trading do not experience significant pattern changes during the GameStop surge period, as indicated by insignificant coefficients β . Panel B shows the results for six non-squeezed meme stocks 1 which are examined in Allen et al. (2023). These six non-squeezed meme stocks are Black Berry, Castor, Koss, Nokia, Sundial Growers Inc. and Trivago NV. We observe that the coefficients β 1 are significantly higher in the after-hours session for institutional trading, similar to the case of GameStop. However, compared to the coefficient in Table 2 (0.14 for institutional order flow in the after-hours session), the six non-squeezed meme stocks have much lower coefficients (0.06). Furthermore, the intraday patterns of the six meme stocks during the GameStop surge period are similartothoseobservedbeforethesurge. ThisisinstarkcontrasttotheGameStopcase,wherewe observe a significant increase in both intraday institutional and retail trading during surge period. ThisdifferenceinbehaviorbetweenGameStopandthesixmemestocksmayexplainwhynoneof thememestocksexperiencesashortsqueezeduringtheGameStopsurge. 80 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Appendix",
    "page_number": 82,
    "page_range": "p.82",
    "total_pages": 84,
    "chunk_index": 96,
    "word_count": 279,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.82)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "session), the six non-squeezed meme stocks have much lower coefficients (0.06). Furthermore, the intraday patterns of the six meme stocks during the GameStop surge period are similartothoseobservedbeforethesurge. ThisisinstarkcontrasttotheGameStopcase,wherewe observe a significant increase in both intraday institutional and retail trading during surge period. ThisdifferenceinbehaviorbetweenGameStopandthesixmemestocksmayexplainwhynoneof thememestocksexperiencesashortsqueezeduringtheGameStopsurge. 80 Electronic copy available at: https://ssrn.com/abstract=4560320 TableA1 RetailandInstitutionalOrderFlowDuringSurgePeriod Thistablereportstheresultsfromtheorderflowregression OrderFlow =α+β IS+β IPS+Controls +ε , t 1 t 2 t t−1 i,t where dependent variables are the volumes proportion associated with various order flow: after-hours and intraday institutional order flow, after-hours and intraday retail order flows. Panel A reports the results for matched firm, BestBuy. Panel B reports the same results for six non-squeezed meme stocks discussed in Allen et al. (2023). The sample period covers from January 1, 2020, to December 31, 2021. Controls include the SPY daily trading volume, SPX index daily return and daily VIX index, all control variables are lagged for one trading day. The t-statistics are reported in parentheses. The symbols, ***, **, and * indicatesignificanceatthe1%,5%and10%levels,respectively. PanelA:BestBuy Institutions RetailTraders After-hours(1) Intraday(2) After-hours(3) Intraday(4) Surge(β ) 0.01 0.01** 0.004 -0.01* 1 (0.45) (2.16) (0.41) (-1.96) Post-Surge(β ) 0.02 0.02*** -0.008 -0.004 2 (1.29) (5.89) (-1.23) (-1.53) Obs 505 505 505 505 Controls Yes Yes Yes Yes AdjR2 0.051 0.138 0.022 0.049 PanelB:Sixnon-squeezedmemestocks Institutions RetailTraders After-hours(5) Intraday(6) After-hours(7) Intraday(8) Surge(β ) 0.06*** 0.0009 -0.05*** -0.007 1 (4.76) (0.22) (-6.33) (-1.46) Post-Surge(β ) 0.09*** 0.009*** -0.06*** -0.02*** 2 (8.46) (3.03) (-4.6) (-6.39) Obs 505 505 505 505 Controls Yes Yes Yes Yes FirmFixedEffect Yes Yes Yes Yes AdjR2 0.059 0.306 0.180 0.557 81 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Appendix",
    "page_number": 83,
    "page_range": "p.83",
    "total_pages": 84,
    "chunk_index": 97,
    "word_count": 264,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.83)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "After-hours(7) Intraday(8) Surge(β ) 0.06*** 0.0009 -0.05*** -0.007 1 (4.76) (0.22) (-6.33) (-1.46) Post-Surge(β ) 0.09*** 0.009*** -0.06*** -0.02*** 2 (8.46) (3.03) (-4.6) (-6.39) Obs 505 505 505 505 Controls Yes Yes Yes Yes FirmFixedEffect Yes Yes Yes Yes AdjR2 0.059 0.306 0.180 0.557 81 Electronic copy available at: https://ssrn.com/abstract=4560320 A2 Retail Trades Identification Barber et al. (2023) suggest a new quote midpoint method, which eliminates off-exchange trades thatarebetween40and60%oftheNBBOtoidentifyretiltradesandthedirectionofretailtrades. This section follows their method to distinguish between buy and sell retail trades and displays the signed volume of the retail traders using different methods in Figure A1. The results of either Boehmer et al. (2021) or Barber et al. (2023) demonstrate that retail traders begin to offload their investmentspriortoashort-squeeze. InBarberetal.(2023),thepositiveretailorder-imbalanceratioforGameStopduringearly2021 is reported in Internet Appendix (Figure IA.1). Their ratio is determined based on the number of trade measures, which is calculated as the difference between the number of buy and sell trades divided by the total number of buy and sell trades. When using the share volume-based measure, wecangetthenegativeretailorder-imbalanceratioduringearly2021. FigureA1. CumulativeSignedVolumeforDifferentTypesofTrades The figures show the cumulative signed share volume for institution investors and retail traders during the surgeperiod. 2.5 2 1.5 1 0.5 0 -0.5 -1 -1.5 4 7 4 0 1 0 2 2 1 3 1 1 2 3 3 0 0 0 0 0 1 1 1 1 1 2 2 2 2 2 0 0 0 0 0 2 2 2 2 2 emuloV dengiS .muC 107 Retail Trades(Boehmer et al.(2021)) ISO Trades Retail Trades(Barber et al.(2023)) 82 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Appendix",
    "page_number": 84,
    "page_range": "p.84",
    "total_pages": 84,
    "chunk_index": 98,
    "word_count": 257,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.84)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  },
  {
    "text": "1 1 2 3 3 0 0 0 0 0 1 1 1 1 1 2 2 2 2 2 0 0 0 0 0 2 2 2 2 2 emuloV dengiS .muC 107 Retail Trades(Boehmer et al.(2021)) ISO Trades Retail Trades(Barber et al.(2023)) 82 Electronic copy available at: https://ssrn.com/abstract=4560320",
    "title": "Did Retail Traders Take Over Wall Street A Tick - by - Tick Analysis of GameStop's Price Surge",
    "source_type": "pdf",
    "document_id": "306adaec65cf",
    "source_file": "Did Retail Traders Take Over Wall Street A Tick-by-Tick Analysis of GameStop's Price Surge.pdf",
    "section": "Appendix",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 84,
    "chunk_index": 99,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20231111003220Z",
    "duration": null
  }
]