[
  {
    "text": "Do Individual Investors Learn from Their Trading Experience?∗ Gina Nicolosi College of Business, University of Cincinnati Liang Peng∗∗ College of Business, University of Cincinnati Ning Zhu Graduate School of Management, University of California Davis Current Draft: March 2004 Abstract This paper investigates whether individual investors adjust their stock trading according to their stock selection abilities, which can be inferred from their trading history. Fixed- effect panel regressions provide strong evidence that the ability to forecast future stock returns significantly affects investors’ trading activity: investors purchase more actively if they are more likely to have stock selection ability. Furthermore, trading experience – measured by the number of purchases, the number of different stocks purchased, and the variance of purchase dollar amounts – significantly helps improve investors’ portfolio performance. In addition, we find that learning behavior varies across investors, which corroborates the heterogeneity of individual investors. JEL classification: D19, G14 Key words: individual investors, learning, rationality, trading ∗ We thank Brad Barber, Jim Clayton, Michael Ferguson, Brain Hatch, Yong Kim, Brian Kluger, Steve Slezak, Steve Wyatt and seminar participants at University of Cincinnati for constructive comments. All errors are ours alone. ∗∗ Corresponding author, PO Box 210195, Cincinnati, OH 45221-0195, Phone: (513)556-6829, Fax: (513)556-0979, Email: liang.peng@uc.edu.",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 28,
    "chunk_index": 0,
    "word_count": 204,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "trading ∗ We thank Brad Barber, Jim Clayton, Michael Ferguson, Brain Hatch, Yong Kim, Brian Kluger, Steve Slezak, Steve Wyatt and seminar participants at University of Cincinnati for constructive comments. All errors are ours alone. ∗∗ Corresponding author, PO Box 210195, Cincinnati, OH 45221-0195, Phone: (513)556-6829, Fax: (513)556-0979, Email: liang.peng@uc.edu. Do Individual Investors Learn from Their Trading Experience? Rationality of economic agents is a classic assumption in modern economics and finance. This assumption simplifies the decision-making processes associated with constrained optimization problems, so that economic phenomena can be analyzed with mathematical models. An important justification for this assumption is that agents are not likely to make systematic mistakes. For instance, the assumption of rational expectations “does not deny that people often make forecasting errors, but it does suggest that errors will not persistently occur on one side or the other” (Sargent, 1993). The argument is certainly appealing, but not necessarily substantiated. This paper empirically tests whether a special group of agents - individual investors - learn about their stock selection ability from their own trading experience and adjust their trading behavior accordingly. This study provides direct evidence regarding the fundamental argument of agent rationality: rational investors learn from their mistakes and thus mistakes should not be repeated systematically. The study of individual learning behavior has important economic implications. First, the growing literature of behavioral economics and finance provides strong evidence that agents are not always fully rational at the aggregate level (see, e.g., Shleifer, 2000; Barberis and Thaler, 2002, for useful surveys). However, there is much less evidence on whether individual economic agents learn to reduce their mistakes over time. Our study helps fill this gap. Second, our study provides empirical evidence regarding the appropriateness of assumed rationality. Specifically, if individuals do not learn, the rationality assumption, as well as the numerous ensuing economic theories, would be challenged. Furthermore, our study is important because it helps facilitate future research concerning the behavior of economic agents by disentangling two possible sources of limited rationality at the aggregate level. One possibility is that individuals are not fully rational and do not learn. Another possibility is that while individuals do learn to become more rational over time, the representative agent remains limitedly rational because amateur agents continually join the economy. In this case, population composition plays a significant economic role.1 1 See Bakshi and Chen (1994) and Ang and Maddaloni (2003) for examples about relations between economy and demography. 2",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 28,
    "chunk_index": 1,
    "word_count": 407,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "learn to become more rational over time, the representative agent remains limitedly rational because amateur agents continually join the economy. In this case, population composition plays a significant economic role.1 1 See Bakshi and Chen (1994) and Ang and Maddaloni (2003) for examples about relations between economy and demography. 2",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 28,
    "chunk_index": 2,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "We test two hypotheses regarding individual investors’ learning behavior. The first hypothesis concerns whether trading history affects future trading activity. We assume individual investors are able to infer their stock selection ability from their trading history. If investors are rational, their inferred stock selection ability should affect their future trading patterns. Specifically, when they think they are able (unable) to select winning stocks, they should trade more (less) actively. The second hypothesis concerns whether trading experience helps improve future portfolio performance. Traders with more experience have more data (i.e., past trading activity) to infer their ability. Therefore, their inferences should be more accurate, which should lead to better trading decisions and hence better portfolio performance. We use the nonparametric statistical model developed by Henriksson and Merton (1981), modified by Cumby and Modest (1987), and applied by Hartzmark (1991) and others to infer two types of stock selection ability: the ability to forecast the signs of future excess stock returns as well as the ability to forecast both the signs and magnitudes of future excess stock returns. We construct a time-series of inferred ability for each investor, and then use a fixed-effect panel data approach to investigate the effect of the inferred ability on investor trading, controlling for other possible trading-driving variables. Our empirical results provide evidence that both types of abilities to forecast over the coming month (20 trading days) significantly affect investors’ equity purchase decisions, while the ability to make short term (5 trading days) forecasts do not affect purchases. We also find that trading experience helps improve portfolio performance. Particularly, the more experienced an individual investor is (in terms of the number of purchases, the number of stocks purchased, and the variance of purchase dollar amounts), the higher is the future risk-adjusted return of her portfolio. On the other hand, our results also demonstrate behavior variations across different categories of investors. For example, active traders adjust their trading according to their inferred ability more dramatically than inactive traders. Overall, our empirical findings suggest that (i) individual investors rationally learn from their own experience and adjust their stock purchases accordingly, and (ii) learning behavior is heterogeneous across individual investors. 3",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 28,
    "chunk_index": 3,
    "word_count": 361,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "of investors. For example, active traders adjust their trading according to their inferred ability more dramatically than inactive traders. Overall, our empirical findings suggest that (i) individual investors rationally learn from their own experience and adjust their stock purchases accordingly, and (ii) learning behavior is heterogeneous across individual investors. 3",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 28,
    "chunk_index": 4,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "We study individual investors because they are normally considered to be the most uninformed and unskilled economic agents. They seem to be the real-world counterparts to the noise traders described by behavioral models (see, for example, De Long et al., 1990; Shleifer and Vishny, 1997, among others). Individual investors have been modeled or documented to behave in many naïve ways. For example, they may under-react or over-react to news; they may insufficiently or naïvely diversify their portfolios; they may hold too many local or domestic equities; they may make investment decisions based on familiarity instead of utility maximization; and confusion concerning stock tickers may even lead them to respond to news incorrectly.2 In short, individual investors seem to be making a variety of mistakes that have significant economic consequences. Therefore, they are suitable subjects for investigating potential learning behavior. If they are able to learn rationally, it seems plausible to argue that other more sophisticated economic agents should be able to learn as well. We study learning behavior pertaining to trading because, unlike other economic processes in which different types of behavior could all be rational, it is easier to identify trading mistakes. Since trading is costly, it is reasonable to argue that individual investors should not trade unless they have legitimate reasons. Legitimate reasons include having (i) security analysis ability – the ability to select individual stocks that will outperform the market; (ii) market timing ability as defined by Merton (1981) – the ability to forecast stock market performance market relative to fixed-income securities; (iii) a need to rebalance their portfolios due to changes in personal preference or changes in the covariance matrix of asset returns; (iv) a desire to exploit tax benefits; or (v) a need to meet liquidity demands. Our analysis is based on a sizeable panel data set containing the trading activities of individuals belonging to a large national discount brokerage firm (see Odean 1998 and Barber and Odean 2000 for more descriptions of the data). This data set has several features that dramatically motivate our research. First, the data allow us to observe individuals’ detailed trading history (including prices and shares of stock bought and sold on a given date), dramatically facilitating the inference of investor security analysis ability. Second, the data allow us to follow individuals 2 See for example Alpert and Raiffa (1982), Barber and Odean (2000), Benartzi (2001), Benartzi and Thaler (2001), Coval and Moskowitz (1999), Daniel et al. (1998), Fischoff et al. (1977), Goetzmann and Kumar (2003), Hong and 4",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 28,
    "chunk_index": 5,
    "word_count": 419,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "of investor security analysis ability. Second, the data allow us to follow individuals 2 See for example Alpert and Raiffa (1982), Barber and Odean (2000), Benartzi (2001), Benartzi and Thaler (2001), Coval and Moskowitz (1999), Daniel et al. (1998), Fischoff et al. (1977), Goetzmann and Kumar (2003), Hong and 4",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 28,
    "chunk_index": 6,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "over a period of six years, which is beneficial because the learning process is naturally a temporal process. Finally, the data set contains a large number of individual investors, therefore we are able to attain more inference power by exploiting the variation across individuals and thus mitigate possible sample selection problems. It is worth noting that rational learning behavior (i.e., whereby investors adjust their trading according to their inferred ability) relates to but also differs from irrational performance- feedback trading (i.e., whereby investors become overconfident after good performance and consequently trade more actively). First, rational learning captures the relation between ability and trading activity, while performance-feedback trading captures the relation between performance and trading activity. Good performance does not necessarily suggest skill or ability since performance can be due entirely to luck. Ability is estimated using methodology established in Henriksson and Merton (1981) and modified by Cumby and Modest (1987), which is based on significant statistical relations that are unlikely to be outcomes of chance. Second, performance-feedback trading may suggest asymmetric reinforcement. Good performance may lead to overconfidence and thus more trading, but poor performance does not necessarily lead to less trading. On the other hand, rational learning suggests that investors should adjust their trading activity according to their ability, regardless of their past performance (i.e., good or bad). Finally, rational learning behavior suggests that trading experience should help improve future investor performance, while performance-feedback trading lacks this implication. This paper relates to literature regarding individual investor trading, which has documented several important, and often not fully rational, behaviors.3 For example, investors trade excessively: investors who trade the most earn the lowest average returns after transaction costs. Interestingly, on average, men trade more actively yet perform worse than women. Investors who switch from phone-based trading to online trading also trade more and earn lower returns. Additionally, individual investors are often reluctant to realize their losses. Finally, the trading activity of individual investors is affected by past returns and historical price patterns. Our empirical results provide evidence that, despite these irrational behaviors, individual investors Stein (1999), Huberman (2001), Ivkovich and Weisbenner (2003), Rashes (2001), Zhu (2003), among others. 5",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 28,
    "chunk_index": 7,
    "word_count": 358,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "are often reluctant to realize their losses. Finally, the trading activity of individual investors is affected by past returns and historical price patterns. Our empirical results provide evidence that, despite these irrational behaviors, individual investors Stein (1999), Huberman (2001), Ivkovich and Weisbenner (2003), Rashes (2001), Zhu (2003), among others. 5",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 28,
    "chunk_index": 8,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "rationally learn from their trading experience and adjust their trading according to their stock selection ability, thus indicating the complexity of human behavior. This paper also relates to recent finding concerning individual investors’ ability to beat the market. Coval et al. (2003) show that a portion of individual investors persistently earn average excess returns, suggesting that at least some individual investors are able to select stocks. Our empirical results suggest that individual investors can become better traders over time: if they have (do not have) stock selection ability, they will trade more (less) actively, and trading experience helps them achieve better portfolio performance. Our empirical evidence corroborates recent findings pertaining to individual learning behavior in marketplaces. Using experiments, List (2003) finds that market experience plays a significant role in eliminating the endowment effect - individual behavior converges to neoclassical predictions as market experience increases. Dhar and Zhu (2003) find that trading experience helps alleviate individual investors’ tendency to sell winning stocks too soon and hold losing stocks too long. We find that individual investors, despite their various investment mistakes, are able to achieve better portfolio performance by adjusting their stock purchases according to their trading experience. This finding emphasizes the importance of heterogeneity among economic agents in the economy. The composition of investors, e.g. experienced vs. inexperienced, could potentially influence how the market functions. The paper proceeds as follows. Section I describes the data. Section II discusses our research design. Section III reports our estimation results. Section IV concludes. I. Data The data used in this study come from a large discount brokerage firm, and cover the investments of 78,000 households from January 1991 to December 1996.4 The data have three important components: (1) Position data record the sample households’ end-of-month portfolio 3 See Barber and Odean (2000, 2001, 2002a, 2002b), Odean (1998, 1999), and Grinblatt and Keloharju (2001) among others. 4 The end-of-month portfolio position data is available from January 1991 to January 1997. The trade data is available from January 1991 to November 1996. 6",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 28,
    "chunk_index": 9,
    "word_count": 337,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "the sample households’ end-of-month portfolio 3 See Barber and Odean (2000, 2001, 2002a, 2002b), Odean (1998, 1999), and Grinblatt and Keloharju (2001) among others. 4 The end-of-month portfolio position data is available from January 1991 to January 1997. The trade data is available from January 1991 to November 1996. 6",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 28,
    "chunk_index": 10,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "positions. (2) Trade data record all trades made by sample investors. Both the trading and position files include common stocks, mutual funds, and other securities (i.e., American Deposit Receipt, fixed income securities, and options). (3) An investor characteristics file includes investor characteristics such as investors’ income levels, occupation categories, ages, and when they opened their accounts. In this study, we focus on investors’ stock selection ability so we exclude 11,535 investors who do not hold common stocks in any month of our sample period. Sample households can open multiple accounts at the discount brokerage firm. An average sample household has two accounts. The most common reason for two accounts is the tax-preferred status of retirement accounts. Common stocks make up roughly 60 percent of the account values and slightly more than 60 percent of all trades. The dataset is filtered as follows: First, if a household has multiple trading accounts, we treat these accounts as one large account, aggregating monthly trades across all accounts associated with a particular household. Then, only households that opened their first account in 1990 or 1991 are examined because their entire timeline of trading activity beginning with their very first trade can be observed. Finally, to be in the sample at time t, household i must have non- missing data for all variables utilized in this analysis. These requirements result in a sample of 65,118 household-months for 2,973 households, spanning the calendar time March, 1991 to November, 1996. Table 1 summarizes the trading activities and shows that individual investors have very different trading behavior. For example, the average number of trades per month varies dramatically from a minimum of 0 to a maximum of 113.0; the average number of buys per month varies from 0 to 49.67; and the average number of sells varies from 0 to 63.33. II. Research Design We test two null hypotheses regarding investors’ learning behavior: (i) investors’ stock purchases are not affected by their security analysis ability, which they estimate using past purchases and post-purchase stock returns; (ii) trading experience does not help investors 7",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 28,
    "chunk_index": 11,
    "word_count": 345,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "number of sells varies from 0 to 63.33. II. Research Design We test two null hypotheses regarding investors’ learning behavior: (i) investors’ stock purchases are not affected by their security analysis ability, which they estimate using past purchases and post-purchase stock returns; (ii) trading experience does not help investors 7",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 28,
    "chunk_index": 12,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "improve the performance of their portfolios. To test the first hypothesis, we construct monthly series of security analysis ability proxies for each investor, then run fixed effect regressions of the number of stock purchases on the ability proxies, controlling for other variables that may affect stock purchases. Two types of security analysis abilities are studied: the ability to forecast the signs of future risk-adjusted excess stock returns and the ability to forecast both the signs and the magnitudes of future risk-adjusted excess stock returns, where the future is defined as the 5 and 20 trading days following the purchase, respectively. To test the second hypothesis, we construct time series of 3 different measures of trading experience for each household, and run fixed effect regressions of investors’ portfolio risk-adjusted excess return on the trading experience measures. We follow Coval et al. (2003) and use trades that initiate or expand existing positions in companies in order to infer investors’ abilities. Essentially, we consider buys as predictions of future price increases, but do not consider sales as predictions of future price decreases. The rationale is, as Coval et al. (2003) argue, that sales are often not strongly driven by private information or specific analysis of the sold stock. Instead, investors may sell to satisfy liquidity needs or to move into other firms expected to outperform the market, etc. We also ignore short- sales since there are very few occurrences. Does Ability Affect Future Purchases? The evaluation of investors’ forecasting ability is a well-studied problem in finance (see Becker et al., 1999, Henriksson and Merton, 1981, Cumby and Modest, 1987, Hartzmark, 1987 and 1991, Jagannathan and Korajczyk, 1986, and Merton, 1981, among many others). It is conventional (e.g., Merton, 1981) to partition forecasting skills into “microforecasting” and “macroforecasting,” defined as forecasting individual stocks’ price movements relative to the market and stock market price movements relative to fixed-income securities, respectively. The former is frequently referred to “security analysis” and the latter is termed “market timing.” This paper focuses on investors’ security analysis abilities. The first type of security analysis ability we study is the ability to forecast the signs of future risk-adjusted excess stock returns. A classic approach to evaluate this type of ability is 8",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 28,
    "chunk_index": 13,
    "word_count": 371,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "“security analysis” and the latter is termed “market timing.” This paper focuses on investors’ security analysis abilities. The first type of security analysis ability we study is the ability to forecast the signs of future risk-adjusted excess stock returns. A classic approach to evaluate this type of ability is 8",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 28,
    "chunk_index": 14,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "developed by Henriksson and Merton (1981) and later modified by Cumby and Modest (1987) and concerns whether the conditional probability of correctly forecasting the signs of future price changes significantly differs from 0.5. This approach and its extensions are widely used to study the performance of mutual funds and futures market traders, as well as the forecasting ability of newsletters.5 Since we study only purchases, inferring security analysis ability is dramatically simplified under the assumption that investors are equally capable of forecasting future price increases and decreases. The inference of investors’ abilities to forecast the signs of future risk-adjusted excess returns consists of the following steps. First, we estimate the risk-adjusted excess return of purchased stocks in the week (5 trading days) and month (20 trading days) after the purchases, respectively. The different horizons are chosen to investigate investors’ ability to forecast short-term and longer-term excess returns. To do this, for each purchased stock, we first run a time series regression of its daily returns net the Treasury-bill rates on the Fama-French factors using a time window spanning 100 trading days before to 100 days after the purchase day. The stock’s excess return over the week or month following the purchase is the sum of its estimated regression intercept and the error terms during the period in question; or equivalently, the realized return minus the sum of the estimated factor loadings times the realized value of each of the factors. We start with the day following the purchase to mitigate possible price impacts. For investor i at the beginning of month t, the information with which the investor can infer her ability includes N and G . N is the number of purchases made at least 5 or 20 trading days i,t i,t i,t before t (depending on the forecasting time horizon). G is the number of good purchases, i,t which are purchases with nonnegative risk-adjusted excess returns over the 5 or 20 subsequent trading days (depending on the forecasting time horizon). Assuming the sign of the excess return is generated from a binomial process, the null hypothesis is that the probability that the risk- adjusted excess return conditional upon purchase will be positive is 0.5. A two-sided test of the hypothesis is straightforward, and we follow Hartzmark (1991) and define a proxy for the security selection ability as 5 See Bollen and Busse (2001), Chance and Hemler (2001), Graham and Harvey (1996), and Womack (1996), among others. 9",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 28,
    "chunk_index": 15,
    "word_count": 409,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "upon purchase will be positive is 0.5. A two-sided test of the hypothesis is straightforward, and we follow Hartzmark (1991) and define a proxy for the security selection ability as 5 See Bollen and Busse (2001), Chance and Hemler (2001), Graham and Harvey (1996), and Womack (1996), among others. 9",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 28,
    "chunk_index": 16,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "FS = ( 1−probability significance level ) ×sign of i,t −0.5 (1) i,t i,t  N   i,t  This proxy incorporates information on the direction and significance of the ability. For example, if G N equals 0.8 and the probability significance level is 0.15, then i,t i,t FS =(1−0.15)×1=0.85. Therefore, the range ( −1≤ FS ≤1 ) encompasses the universe of i,t i,t investors: those with statistically significant inferior ability, those with no ability, and those with statistically significant superior ability. To differentiate the ability estimated using the risk- adjusted excess return in the week after the purchase from that estimated using the excess return over the following month, we denote the former by FS5 and the latter by FS20. i,t i,t Hartzmark (1991) defines the big hit ability as the capability to predict both the magnitude and direction of future price changes. Investors with superior big hit ability will establish larger long positions when higher excess returns are anticipated. At time t, denote by R the subsequent i,j risk-adjusted excess return of the j th stock purchased by investor i , and by D the dollar i,j amount of the purchase (the number of shares multiplied by the transaction price). At the beginning of month t, we run a times-series regression investor i, R =α+β D +ε , (2) i,j i,t i,j i,j using all purchases made 5 or 20 trading days before t, respectively. To incorporate information on the sign of the estimator of β, standard errors, and degree of freedom into one aggregate measure, we follow Hartzmark (1991) and define the big hit ability for investor i at t, FB , as i,t ( ) ( ) FB = 1−probability significance level × sign of β . (3) i,t i,t i,t Apparently, the range of FB is still (−1,1). To differentiate FB estimated using the excess i,t i,t return in the week after the purchase from that estimated using the excess return in the following month, we denote the former by FB5 and the latter by FB20. i,t i,t We study the relation between investors’ purchases and security analysis abilities using the following fixed effect regression. 10",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 28,
    "chunk_index": 17,
    "word_count": 362,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "i,t return in the week after the purchase from that estimated using the excess return in the following month, we denote the former by FB5 and the latter by FB20. i,t i,t We study the relation between investors’ purchases and security analysis abilities using the following fixed effect regression. 10",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 28,
    "chunk_index": 18,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "( ) T =c +ρF +ρT +ρR +ρR +ρP +ρ SD −SD i,t i 1 i,t 2 i,t−1 3 m,t−1 4 i,t−1 5 i,t−1 6 m,t m,t−1 (4) +ρGR3 +ρV +ρDEC +ρ JAN +ε 7 m,t−1 8 m,t−1 9 t 10 t i,t In equation (4), T is the number of purchases made by investor i in month t; F is investor i,t i,t i’s security analysis ability and takes the value of FS5 , FS20, FB5 and FB20, respectively; i,t i,t i,t i,t R is the lagged S&P500 index return; R is the lagged personal portfolio return of the m,t−1 i,t−1 investor; P is the market value of investor i’s portfolio (consisting of both mutual funds and i,t−1 stocks) at the end of month t−1; SD is the cross-sectional standard deviation of all stock m,t returns in the market, and SD −SD captures the change in the cross-stock return standard m,t m,t−1 deviation; GR3 is the compounded return of S&P500 over the past three years; V is the m,t−1 m,t−1 dollar value of NYSE/AMEX/NASDAQ stocks traded in the prior month; DEC is a dummy t variable for December; and JAN is a dummy variable for January. t Equation (4) includes F as an explanatory variable to study whether security analysis ability i,t affects trading. If an investor is rational, when F is positive, she should capitalize on her i,t ability by purchasing stocks more actively, and when F is negative, she should reduces her i,t trading activity. Therefore, a positive ρ is consistent with the existence of rational investor 1 learning. Besides F , we include other explanatory variables in equation (4) to control for other trading i,t needs. First, we include lagged purchases to control for possible serial correlation in trading activity. Second, we use the change in cross-sectional standard deviation of all stocks returns in the market as a proxy for the change in the covariance of stock returns to control for rational portfolio rebalancing. In addition, we include lagged market and personal portfolio returns. The lagged personal portfolio return helps control for performance-feedback trading, and the lagged long-run historical market performance helps capture the possible evolution of trading behavior, such as that caused by changing investor sentiment correlated with market trends. In addition, we include the lagged market value of investors’ portfolios to control for possible relations between trading and portfolio size. For instance, some investors may cease trading simply 11",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 28,
    "chunk_index": 19,
    "word_count": 405,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "helps capture the possible evolution of trading behavior, such as that caused by changing investor sentiment correlated with market trends. In addition, we include the lagged market value of investors’ portfolios to control for possible relations between trading and portfolio size. For instance, some investors may cease trading simply 11",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 28,
    "chunk_index": 20,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "because they have consumed almost all of their wealth and thus have no money with which to trade. We also include lagged market trading volume in dollar terms to control for fads and/or herding in the investment market. Furthermore, we use December and January dummy variables to capture possible trading seasonality (see e.g., Kumar and Lee, 2002). Finally, we include an individual time-invariant intercept to capture trading associated with time-invariant components of latent variables such as the investor’s risk attitude, gender, personal income, education, etc. Other trading needs are captured by the error term. Does Experience Help Improve Performance? If investors rationally learn from past trading, as an investor’s trading experiences increases (e.g., more purchase transactions and/or more stocks purchased) so does the information set with which the investor estimates her stock selection ability. This larger sample size should improve the precision of the ability estimates, and subsequent trading decisions should improve performance more significantly. We first construct monthly time series of risk-adjusted portfolio returns, RER , for each investor i,t by adding the estimated intercept term to the estimation residuals of the regression of monthly investor portfolio returns net the Treasury-bill rates on the Fama-French factors. These risk- adjusted portfolio returns are measures of investors’ portfolio performance. We use three measures of the trading experience, denoted by E . The first measure is simply the number of i,t all purchases made before t: ∑t−1 T . The second measure is the number of different stocks an s=1 i,s investor has ever purchased prior to time t. The third measure is the variance of the dollar amounts of purchases prior to t. It is not implausible to argue that the more purchases an investor has made and the more different stocks an investor has purchased, the better equipped she is to infer her security analysis ability. Furthermore, the larger is the variance of the explanatory variable, which is the dollar amounts of purchases in regression (2), the more accurately the big hit ability can be estimated. We investigate the relation between trading experience and portfolio performance using the following fixed effect regression. 12",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 28,
    "chunk_index": 21,
    "word_count": 353,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "security analysis ability. Furthermore, the larger is the variance of the explanatory variable, which is the dollar amounts of purchases in regression (2), the more accurately the big hit ability can be estimated. We investigate the relation between trading experience and portfolio performance using the following fixed effect regression. 12",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 28,
    "chunk_index": 22,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "RER =c +ρE +ε (5) i,t i i,t i,t In (5), RER is the estimated risk-adjusted excess return of investor i’s portfolio at time t; E i,t i,t is investor i’s trading experience at time t, and can assume three measures respectively; c is an i individual time-invariant intercept that captures unobserved individual specific factors; ε is a i,t zero mean error term. A positive ρ is consistent with the existence of rational investor learning. Sub-sample Analysis We conduct a variety of sub-sample studies. First, we re-estimate equations (4) and (5) using data in odd and even transaction months. Second, we re-estimate the equations for two categories of investors: active traders (complete at least 25 trades in the sample period) and inactive traders. Finally, we re-estimate the equations after categorizing investors according to their average excess portfolio performance as winners (top one third), average (middle one third), and losers (bottom one third). The results of these sub-sample studies may have different interpretations. Under the assumption of homogenous investors, these studies are robustness checks. However, allowing for the heterogeneity of investors, these studies may reveal systematic differences between different types of individual investors. III. Empirical Results Table 2 reports the results of regression (4) based on all investors in our sample. First, we find that the coefficients of both FS20 and FB20 are significantly positive at the 1% level. Therefore, i,t i,t we reject the null hypothesis that investors’ stock purchases are not affected by their abilities to forecast the signs and magnitudes of excess stock returns over the time horizon of 20 business days. Furthermore, the positive signs of the coefficients are consistent with the rational learning hypothesis: when investors believe they are able to forecast excess returns, they purchase more actively; when they do not believe in their ability, they reduce their stock purchases. Note that the past performance of investors and the stock market have been controlled, so our results are not caused by performance-feedback trading. At the same time, we find that FS5 significantly i,t 13",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 28,
    "chunk_index": 23,
    "word_count": 339,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "purchase more actively; when they do not believe in their ability, they reduce their stock purchases. Note that the past performance of investors and the stock market have been controlled, so our results are not caused by performance-feedback trading. At the same time, we find that FS5 significantly i,t 13",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 28,
    "chunk_index": 24,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "reduces stock purchases and FB5 is insignificant, which suggests that investors do not adjust i,t their purchases according to their ability to forecast excess returns over the time horizon of 5 business days. Consequently, we can not reject the null hypothesis that investors are not learning from their trading experience. However, it is worth noting that the negative or insignificant coefficients do not necessarily support the null hypothesis. There are a variety of possible reasons why rational learning investors may not adjust their stock purchases according to their ability to forecast short term excess returns. For example, individual investors may simply intend to profit in a longer time horizon. Tables 3 to 9 report the results of regression (4) using different sub-samples. Tables 3 and 4 report the results based on observations in each investor’s odd and even transaction months. Tables 5 and 6 examine active and inactive investors. Tables 7, 8, and 9 are for households whose arithmetic average monthly portfolio return in excess of the market return belonged in the top, middle, and bottom one third of the distribution. These tables suggest that, on one hand, the learning behavior we find in table 2 is observed in most sub sample studies. First, the coefficient of FS20 is significantly positive except for winners and even transaction months, for which the i,t coefficient is insignificant. It is worth noting that an insignificant coefficient does not necessarily suggest that investors do not learn. It is possible that the insignificant coefficient of winners is an artifact. For example, the number of purchases made by winners may be relatively stable even if they actively learn and trade accordingly, because investors’ purchasing activity can be limited by their wealth levels. Second, the coefficient of FB20 is significantly positive i,t except for inactive traders, average performance and losers, for which the coefficient is insignificant. On the other hand, tables 3 to 9 also suggest the learning behavior differs across investors. For instance, losers respond more dramatically to their ability to forecast the direction of future excess returns, while winners do not seem to respond. However, the differences may not be surprising since the heterogeneity of economic agents is an expected and established fact. Table 10 reports the results of regression (5) using the full sample along with different sub- samples. All three proxies are significantly positive, which rejects the null hypothesis that trading experience does not help improve portfolio performance and is consistent with rational 14",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 28,
    "chunk_index": 25,
    "word_count": 411,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "agents is an expected and established fact. Table 10 reports the results of regression (5) using the full sample along with different sub- samples. All three proxies are significantly positive, which rejects the null hypothesis that trading experience does not help improve portfolio performance and is consistent with rational 14 investor learning behavior. The sub-sample studies, on the other hand, suggest heterogeneity across investors. For example, inactive traders benefit much more significantly from the number of prior purchases and the number of different purchased stocks than active traders. In addition, investors with average performance benefit more from their trading experience than winners and losers. IV. Conclusions This paper investigates whether a special group of economic agents - individual investors - learn about their stock selection ability from their own trading experience and then accordingly adjust their stock trading activity. We find that stock selection ability – particularly the ability to forecast the signs and both the signs and magnitudes of excess stock returns in coming month – significantly affects stock purchases. However, the ability to make short term (5 trading days) forecasts does not affect purchasing activity. We also find that trading experience helps improve portfolio performance. Particularly, as an investor completes more purchase transactions and purchases more unique stocks, her portfolio’s subsequent risk-adjusted monthly return is higher. Overall, our empirical findings are consistent with the hypothesis that individual investors (despite making numerous documented mistakes) learn from their own trading experience, adjust their stock purchases accordingly, and achieve higher portfolio performance. Our empirical results also highlight the importance of individual investor heterogeneity. Specifically, learning behavior varies across different categories of investors. For example, active traders adjust their stock purchases according to their abilities more dramatically than inactive traders. 15",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 28,
    "chunk_index": 26,
    "word_count": 289,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "trading experience, adjust their stock purchases accordingly, and achieve higher portfolio performance. Our empirical results also highlight the importance of individual investor heterogeneity. Specifically, learning behavior varies across different categories of investors. For example, active traders adjust their stock purchases according to their abilities more dramatically than inactive traders. 15",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": " G ",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 28,
    "chunk_index": 27,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": " G  (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Alpert M., and H. Raiffa, 1982. A Progress Report on the Training of Probability Assessors,” in D. Kahneman, P. Slovic and A. Tversky, eds., Judgment under Uncertainty: Heuristics and Biases, Cambridge: Cambridge University Press. Ang, Andrew and Angela Maddaloni, 2003. Do Demographic Changes Affect Risk Premiums? Evidence from International Data. Journal of Business, forthcoming. Bakshi, Gurdip and Zhiwu Chen, 1994. Baby Boom, Population Aging, and Capital Markets. Journal of Business, 67 (2), 165-202. Barber, Brad M. and Terrance Odean, 2000. Trading Is Hazardous to Your Wealth: The Common Stock Investment Performance of Individual Investors. Journal of Finance, 55, 773- 806. Barber, Brad M. and Terrance Odean, 2001. Boys Will Be Boys: Gender, Overconfidence, and Common Stock Investment. Quarterly Journal of Economics, 141, 261-292. Barber, Brad M. and Terrance Odean, 2002a. Online Investors: Do the Slow Die First? Review of Financial Studies, 15, 455-487. Barber, Brad, and Terrance Odean, 2002b. All that Glitters: The Effect of Attention and News on the Buying Behavior of Individual and Institutional Investors. Working paper, UC Berkeley. Barberis, Nicholas and Thaler, Richard, 2002. A Survey of Behavioral Finance. Handbook of the Economics of Finance, edited by George Constantinides, Milt Harris and Rene Stulz, forthcoming. Becker, Connie, David Myers, and Michael Schill, 1999. Conditional Market Timing with Benchmark Investors. Journal of Financial Economics, 52, 119-148. Benartzi, Shlomo, 2001. Excessive Extrapolation and the Allocation of 401(k) Accounts to Compnay Stock. Journal of Finance 56, 1747-1764. Benartzi, Shlomo, and Richard Thaler, 2001. Naive Diversification Strategies in Defined Contribution Saving Plans. American Economic Review, 91:79-98. Bollen, N.P.B. and J.A. Busse, 2001. On the Timing Ability of Mutual Fund Managers. Journal of Finance, 56 (3): 1075-1094. Chance, D.M. and M.L. Hemler, 2001. The Performance of Professional Market Timers: Daily Evidence from Executed Strategies. Journal of Financial Economics, 62 (2): 377-411. Coval, Joshua, David Hirshleifer, and Tyler Shumway, 2003. Can Individual Investors Beat the Market? Harvard NOM working paper. 16",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 28,
    "chunk_index": 28,
    "word_count": 318,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Managers. Journal of Finance, 56 (3): 1075-1094. Chance, D.M. and M.L. Hemler, 2001. The Performance of Professional Market Timers: Daily Evidence from Executed Strategies. Journal of Financial Economics, 62 (2): 377-411. Coval, Joshua, David Hirshleifer, and Tyler Shumway, 2003. Can Individual Investors Beat the Market? Harvard NOM working paper. 16",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 28,
    "chunk_index": 29,
    "word_count": 50,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Coval, Joshua, and Toby Moskowitz, 1999. Home Bias at Home: Local Equity Preference in Domestic Portfolios. Journal of Finance, 54, 2045-73 Cumby, Robert E. and David M. Modest, 1987. Testing for Market Timing Ability: A Framework for Forecast Evaluation. Journal of Financial Economics, 19: 169-190. Daniel, Kent, David Hirshleifer, and Avanidhar Subrahmanyam, 1998. Investor Psychology and Security Market under- and overreactions. Journal of Finance, 53, 1839-1886. Dhar, Ravi and Ning Zhu, 2002. Up Close and Personal: An Individual Level Analysis of the Disposition Effect. Yale ICF Working Paper. De Long, J.B., A. Shleifer, L. Summer, and R. Waldmann, 1990. Noise Trader Risk in Financial Markets. Journal of Political Economy, 98, 703-738. Erev, Ido and Alvin E. Roth, 1998. Predicting How People May Play Games: Reinforcement Learning in Experimental Games with Unique, Mixed Strategy Equilibria. American Economic Review, 88(4), pp. 818-881. Fischoff B., P. Slovic, and S. Lichtenstein, 1977. Knowing with Certainty: The Appropriateness of Extreme Confidence. Journal of Experimental Psychology: Human Perception and Performance, 3, 552-564. Goetzmann, William, and Alok Kumar, 2003. Diversification Decisions of Individual Investors and Asset Prices. Yale ICF Working Paper. Graham, J.R. and Harvey, C.R., 1996, Market Timing Ability and Volatility Implied in Investment Newsletters' Asset Allocation Recommendations. Journal of Financial Economics 42 (3): 397-421. Grinblatt, Mark and Matti Keloharju, 2001. What Makes Investors Trade? Journal of Finance, 56(2): 589-616. Hartzmark, Michael L., 1991. Luck Versus Forecast Ability – Determinants of Trader Performance in Futures Markets. Journal of Business, 64 (1): 49-74. Henriksson, Roy D. and Merton, Robert C., 1981. On Market Timing and Investment Performance. 2. Statistical Procedures for Evaluating Forecasting Skills. Journal of Business, 54(4): 513-533. Hong, Harrison and Jeremy Stein, 1999. A Unified Theory of Underreaction, Momentum Trading, and Overreaction in Asset Markets. Journal of Finance, 54, 2143-2184. Huberman, G., 2001. Familiarity Breeds Investment. Review of Financial Studies, 14, 659-680. 17",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 28,
    "chunk_index": 30,
    "word_count": 308,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Investment Performance. 2. Statistical Procedures for Evaluating Forecasting Skills. Journal of Business, 54(4): 513-533. Hong, Harrison and Jeremy Stein, 1999. A Unified Theory of Underreaction, Momentum Trading, and Overreaction in Asset Markets. Journal of Finance, 54, 2143-2184. Huberman, G., 2001. Familiarity Breeds Investment. Review of Financial Studies, 14, 659-680. 17 Ivkovich, Zoran, and Scott J. Weisbennner, 2003. Local Does as Local Is: Information Content of the Geography of Individual Investors’ Common Stock Investments. University of Illinois at Urbana-Champaign Working Paper. Jagannathan, R., and R. A. Korajczyk, 1986. Assessing the Market Timing Performance of Managed Portfolios. Journal of Business, 59 (2) 217-235. Kumar, Alok, and Charles M. C. Lee, 2002, Individual Investor Sentiment and Comovement in Small Stock Returns, University of Notre Dame Working Paper. List, John A. 2003. Does Market Experience Eliminate Market Anomalies? Quarterly Journal of Economics, 118 (1): 41-71. Merton, Robert C., 1981. On Market Timing and Investment Performance. I. An Equilibrium Theory of Value for Market Forecasts. Journal of Business, 54 (3): 363-406. Odean, Terrance, 1998. Are Investors Reluctant to Realize Their Losses? Journal of Finance, 53: 1775-1798. Odean, Terrance, 1999. Do Investors Trade Too Much? American Economic Review, 89: 1279- 1298 Rashes, 2001. Massively Confused Investors Making Conspicuously Ignorant Choices (MCI- MCIC). Journal of Finance, 56(5), 1911-1927. Sargent, Thomas J., Rational Expectations. The Concise Encyclopedia of Economics. Library of Economics and Liberty. Retrieved August 24, 2003 from the World Wide Web: http://www.econlib.org/library/Enc/RationalExpectations.html Shleifer, A., and R. Vishny, 1997. The Limits of Arbitrage. Journal of Finance, 52, 35-55. Shor, Mikhael, 2003. Learning to Respond: The Use of Heuristics in Dynamic Games. Vanderbilt University Working Paper. Womack, K.L., 1996. Do Brokerage Analysts’ Recommendations Have Investment Value? Journal of Finance, 51 (1): 137-167. Zhu, Ning, 2003. The Local Bias of Individual Investors. Yale ICF Working Paper. 18",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 28,
    "chunk_index": 31,
    "word_count": 298,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Finance, 52, 35-55. Shor, Mikhael, 2003. Learning to Respond: The Use of Heuristics in Dynamic Games. Vanderbilt University Working Paper. Womack, K.L., 1996. Do Brokerage Analysts’ Recommendations Have Investment Value? Journal of Finance, 51 (1): 137-167. Zhu, Ning, 2003. The Local Bias of Individual Investors. Yale ICF Working Paper. 18 Table 1 Data Summary: Trading Activities This table reports summary statistics of the trading activities of households who opened their first accounts in 1990 and 1991, respectively. Average number of trades per month Accounts Min 25% Median 75% Max 1990 0.00 0.17 0.38 0.80 43.16 1991 0.00 0.15 0.34 0.79 113.00 Total 0.00 0.16 0.37 0.79 113.00 Average number of buys per month Accounts Min 25% Median 75% Max 1990 0.00 0.09 0.21 0.45 21.06 1991 0.00 0.07 0.19 0.45 49.67 Total 0.00 0.08 0.20 0.45 49.67 Average number of sells per month Accounts Min 25% Median 75% Max 1990 0.00 0.07 0.17 0.37 22.09 1991 0.00 0.05 0.14 0.36 63.33 Total 0.00 0.06 0.15 0.36 63.33 19",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 19,
    "page_range": "p.19-20",
    "total_pages": 28,
    "chunk_index": 32,
    "word_count": 168,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.19-20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "Max 1990 0.00 0.09 0.21 0.45 21.06 1991 0.00 0.07 0.19 0.45 49.67 Total 0.00 0.08 0.20 0.45 49.67 Average number of sells per month Accounts Min 25% Median 75% Max 1990 0.00 0.07 0.17 0.37 22.09 1991 0.00 0.05 0.14 0.36 63.33 Total 0.00 0.06 0.15 0.36 63.33 19 Table 2 Security Analysis Ability and Stock Purchases This table reports the results of the following fixed effect regression. ( ) T =c +ρF +ρT +ρR +ρR +ρP +ρ SD −SD i,t i 1 i,t 2 i,t−1 3 m,t−1 4 i,t−1 5 i,t−1 6 m,t m,t−1 +ρGR3 +ρV +ρDEC +ρ JAN +ε 7 m,t−1 8 m,t−1 9 t 10 t i,t T is the number of purchases household i made in month t. F takes on the value of FS5 , FS20, i,t i,t i,t i,t FB5 and FB20, respectively. FS5 and FS20 measure investors’ abilities to forecast the signs of future i,t i,t i,t i,t excess returns in the coming week (5 trading days) and month (20 trading days), respectively. FB5 and i,t FB20 measure investors’ abilities to forecast both the signs and magnitudes of future excess returns in i,t the coming week and month, respectively. Additional explanatory variables are lagged purchases T , i,t−1 lagged market return R , lagged portfolio return R , households’ lagged mutual fund and stock m,t−1 i,t−1 positions P (coefficients are multiplied by 1,000,000), change of cross-sectional standard deviation of i,t−1 stock returns in the market SD −SD , lagged three-year S&P500 return GR3 , dollar value of m,t m,t−1 m,t−1 NYSE/AMEX/NASDAQ stocks traded in the prior month V , and December DEC and January m,t−1 t JAN dummy variables. Coefficients with * are significant at the 5% level, and coefficients with ** are t significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ *-0.044 **0.073 0.009 **0.054 1 ρ **0.262 **0.262 **0.262 **0.262 2 ρ **0.811 **0.805 **0.811 **0.812 3 ρ **0.148 **0.147 **0.148 **0.147 4 ρ **-0.375 **-0.385 **-0.380 **-0.383 5 ρ **0.421 **0.424 **0.422 **0.421 6 ρ **0.511 **0.504 **0.509 **0.509 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ -0.027 -0.027 -0.027 -0.027 9 ρ *0.045 *0.045 *0.045 *0.045 10 20",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 28,
    "chunk_index": 33,
    "word_count": 366,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ **0.811 **0.805 **0.811 **0.812 3 ρ **0.148 **0.147 **0.148 **0.147 4 ρ **-0.375 **-0.385 **-0.380 **-0.383 5 ρ **0.421 **0.424 **0.422 **0.421 6 ρ **0.511 **0.504 **0.509 **0.509 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ -0.027 -0.027 -0.027 -0.027 9 ρ *0.045 *0.045 *0.045 *0.045 10 20 Table 3 Security Analysis Ability and Stock Purchases: Odd Months This table reproduces Table 2 but only uses data for each household’s odd moths (transaction time). Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ -0.016 **0.108 -0.029 *0.057 1 ρ **0.291 **0.290 **0.291 **0.290 2 ρ **0.955 **0.941 **0.955 **0.955 3 ρ *0.127 *0.127 *0.127 *0.126 4 ρ -0.077 -0.085 -0.077 -0.084 5 ρ **0.467 **0.469 **0.465 **0.467 6 ρ **0.528 **0.521 **0.529 **0.527 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ -0.015 -0.014 -0.015 -0.015 9 ρ 0.050 0.050 0.050 0.050 10 21 Table 4 Security Analysis Ability and Purchases: Even Months This table reproduces Table 2 but only uses data for each household’s even months (transaction time). Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ *-0.071 0.041 0.045 *0.051 1 ρ **0.231 **0.231 **0.231 **0.231 2 ρ *0.664 *0.660 *0.661 *0.663 3 ρ **0.167 **0.167 **0.167 **0.167 4 ρ **-0.681 **-0.693 **-0.688 **-0.692 5 ρ *0.379 *0.385 *0.382 *0.383 6 ρ **0.496 **0.491 **0.492 **0.494 7 ρ **-0.000 *-0.000 *-0.000 *-0.000 8 ρ -0.041 -0.041 -0.041 -0.041 9 ρ 0.041 0.042 0.042 0.042 10 22",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 21,
    "page_range": "p.21-22",
    "total_pages": 28,
    "chunk_index": 34,
    "word_count": 277,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.21-22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ *0.664 *0.660 *0.661 *0.663 3 ρ **0.167 **0.167 **0.167 **0.167 4 ρ **-0.681 **-0.693 **-0.688 **-0.692 5 ρ *0.379 *0.385 *0.382 *0.383 6 ρ **0.496 **0.491 **0.492 **0.494 7 ρ **-0.000 *-0.000 *-0.000 *-0.000 8 ρ -0.041 -0.041 -0.041 -0.041 9 ρ 0.041 0.042 0.042 0.042 10 22 Table 5 Security Analysis Ability and Purchases: Active Traders This table reproduces Table 2 but only uses households that performed at least 25 transactions throughout the entire sample period. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ *-0.084 **0.084 0.018 **0.075 1 ρ **0.280 **0.280 **0.280 **0.280 2 ρ **1.408 **1.391 **1.406 **1.409 3 ρ **0.207 **0.206 **0.207 **0.206 4 ρ *-0.414 *-0.429 *-0.422 *-0.426 5 ρ **0.650 **0.652 **0.651 **0.650 6 ρ **0.721 **0.716 **0.723 **0.721 7 ρ -0.000 -0.000 -0.000 -0.000 8 ρ -0.026 -0.026 -0.026 -0.026 9 ρ 0.070 0.070 0.070 0.071 10 23 Table 6 Security Analysis Ability and Purchases: Inactive Traders This table reproduces Table 2 but only uses households who performed less than 25 transactions throughout the entire sample period. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ **0.051 **0.064 0.006 0.012 1 ρ 0.007 0.007 0.008 0.008 2 ρ -0.022 -0.023 -0.024 -0.024 3 ρ 0.033 0.033 0.033 0.033 4 ρ **-0.331 **-0.334 **-0.327 **-0.328 5 ρ 0.025 0.026 0.024 0.024 6 ρ **0.339 **0.340 **0.343 **0.343 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ **-0.031 **-0.031 **-0.031 **-0.031 9 ρ 0.009 0.009 0.008 0.008 10 24",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 23,
    "page_range": "p.23-24",
    "total_pages": 28,
    "chunk_index": 35,
    "word_count": 284,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.23-24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ -0.022 -0.023 -0.024 -0.024 3 ρ 0.033 0.033 0.033 0.033 4 ρ **-0.331 **-0.334 **-0.327 **-0.328 5 ρ 0.025 0.026 0.024 0.024 6 ρ **0.339 **0.340 **0.343 **0.343 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ **-0.031 **-0.031 **-0.031 **-0.031 9 ρ 0.009 0.009 0.008 0.008 10 24 Table 7 Security Analysis Ability and Purchases: Winners This table reproduces Table 2 but only uses households whose arithmetic average monthly portfolio return in excess of the market return belonged in the top one third of the sample. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ *-0.114 -0.009 0.026 **0.154 1 ρ **0.329 **0.329 **0.329 **0.328 2 ρ **1.292 **1.287 **1.285 **1.278 3 ρ **0.145 **0.145 **0.145 **0.144 4 ρ -0.287 -0.299 -0.294 -0.294 5 ρ *0.471 *0.473 *0.474 *0.471 6 ρ **0.461 **0.464 **0.464 **0.459 7 ρ 0.000 0.000 0.000 0.000 8 ρ -0.046 -0.046 -0.046 -0.046 9 ρ 0.067 0.067 0.067 0.067 10 25",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 25,
    "page_range": "p.25-26",
    "total_pages": 28,
    "chunk_index": 36,
    "word_count": 176,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.25-26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ **1.292 **1.287 **1.285 **1.278 3 ρ **0.145 **0.145 **0.145 **0.144 4 ρ -0.287 -0.299 -0.294 -0.294 5 ρ *0.471 *0.473 *0.474 *0.471 6 ρ **0.461 **0.464 **0.464 **0.459 7 ρ 0.000 0.000 0.000 0.000 8 ρ -0.046 -0.046 -0.046 -0.046 9 ρ 0.067 0.067 0.067 0.067 10 25 Table 8 Security Analysis Ability and Purchases – Performance Groups (Average) This table reproduces Table 2 but only uses households whose arithmetic average monthly portfolio return in excess of the market return belonged in the middle one third of the sample. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ **-0.116 **0.080 0.045 -0.031 1 ρ **0.177 **0.177 **0.177 **0.177 2 ρ 0.514 0.507 0.516 0.515 3 ρ **0.286 **0.287 **0.287 **0.288 4 ρ 0.046 0.006 0.026 0.032 5 ρ **0.404 **0.407 **0.406 **0.406 6 ρ **0.516 **0.509 **0.513 **0.515 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ 0.003 0.003 0.003 0.003 9 ρ 0.046 0.045 0.045 0.045 10 26",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 26,
    "page_range": "p.26-27",
    "total_pages": 28,
    "chunk_index": 37,
    "word_count": 179,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.26-27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ 0.514 0.507 0.516 0.515 3 ρ **0.286 **0.287 **0.287 **0.288 4 ρ 0.046 0.006 0.026 0.032 5 ρ **0.404 **0.407 **0.406 **0.406 6 ρ **0.516 **0.509 **0.513 **0.515 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ 0.003 0.003 0.003 0.003 9 ρ 0.046 0.045 0.045 0.045 10 26 Table 9 Security Analysis Ability and Purchases – Performance Groups (Losers) This table reproduces Table 2 but only uses households whose arithmetic average monthly portfolio return in excess of the market return belonged in the bottom one third of the sample. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. FS5 FS20 FB5 FB20 i,t i,t i,t i,t ρ **0.180 **0.184 *-0.077 0.032 1 ρ **0.247 **0.246 **0.248 **0.248 2 ρ 0.485 0.477 0.477 0.481 3 ρ 0.060 0.062 0.063 0.064 4 ρ **-0.915 **-0.915 **-0.902 **-0.904 5 ρ *0.356 *0.365 *0.358 *0.355 6 ρ **0.577 **0.578 **0.601 **0.592 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ *-0.060 *-0.060 *-0.061 *-0.060 9 ρ 0.024 0.024 0.023 0.023 10 27",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 27,
    "page_range": "p.27-28",
    "total_pages": 28,
    "chunk_index": 38,
    "word_count": 179,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.27-28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  },
  {
    "text": "2 ρ 0.485 0.477 0.477 0.481 3 ρ 0.060 0.062 0.063 0.064 4 ρ **-0.915 **-0.915 **-0.902 **-0.904 5 ρ *0.356 *0.365 *0.358 *0.355 6 ρ **0.577 **0.578 **0.601 **0.592 7 ρ **-0.000 **-0.000 **-0.000 **-0.000 8 ρ *-0.060 *-0.060 *-0.061 *-0.060 9 ρ 0.024 0.024 0.023 0.023 10 27 Table 10 Trading Experience and Portfolio Performance This table reports the results of fixed effect regressions that test whether investors’ experience helps increase the risk adjusted excess returns of their portfolios. RER =c +ρE +ε i,t i i,t i,t RER is the Fama French three factor-adjusted excess portfolio return of household i at month t, i,t and E is household i’s trading experience prior to t, which is measured by three different i,t proxies. The first experience proxy is household i’s number of purchase transactions. The second proxy is the number of different stocks household i has ever purchased. The third proxy is the variance of the dollar amounts of household i ’s purchases. Coefficients have been multiplied by 1,000,000. Coefficients with * are significant at the 5% level, and coefficients with ** are significant at the 1% level. Proxy 1 Proxy 2 Proxy 3 All samples Coefficient **131.255 **366.745 **0.000 Odd Months Coefficient 100.198 *340.954 0.000 Even Months Coefficient **163.004 **391.744 *0.000 Active Traders Coefficient **116.248 **322.120 *0.000 Inactive Traders Coefficient **2280.551 **2659.029 0.000 Winners Coefficient 115.402 316.317 0.000 Average Coefficient **213.002 **396.693 0.000 Losers Coefficient 89.677 433.041 0.000 28",
    "title": "DoIndividualInvestorsLearn2004 - 3 - 21",
    "source_type": "pdf",
    "document_id": "17a67480377d",
    "source_file": "Do Individual Investors Learn from Their Trading Experience.pdf",
    "section": "References",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 28,
    "chunk_index": 39,
    "word_count": 241,
    "author": "penglg",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20040322135524-05'00'",
    "duration": null
  }
]