[
  {
    "text": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices?* Neil D. Pearson University of Illinois at Urbana-Champaign Allen M. Poteshman University of Illinois at Urbana-Champaign Joshua White University of Illinois at Urbana-Champaign February 23, 2007 * Department of Finance, College of Business, University of Illinois at Urbana-Champaign, 340 Wohlers Hall, 1206 South Sixth Street, Champaign, IL 61820 (Phone: (217) 244-0490, e-mail: pearson2@uiuc.edu; phone: (217) 265- 0565, e-mail: poteshma@uiuc.edu; and phone: (217) 244-1166, email: jswhite@uiuc.edu.) We thank Joe Levin, Eileen Smith, and Dick Thaler for assistance with the data used in this paper. We thank Michael Barclay, Stewart Mayhew, and seminar participants at Case-Western, Florida, Illinois, Oklahoma, Rochester, and the Utah Winter Finance Conference for their helpful comments. Qian Deng provided excellent research assistance. We bear full responsibility for any remaining errors. ElectronEilce cctoropny ico fc tohpisy paavpaeilra bisl ea vaat:i lhatbtples :a//ts: shrtntp.c:/o/sms/ranb.csotrmac/at=b9s7tr0a5c9t=2970592 Does Option Trading Have a Pervasive Impact on Underlying Stock Prices? ABSTRACT The question of whether and to what extent option trading impacts underlying stock prices has been a focus of intense interest since options began exchange-based trading in 1973. Despite considerable effort, no convincing evidence for a pervasive impact has been produced. A recent strand of theoretical literature predicts that rebalancing by traders who hedge their option positions increases (decreases) underlying stock return volatility when these traders have net written (purchased) option positions. This paper tests this prediction and finds a statistically and economically significant negative relationship between stock return volatility and net purchased option positions of investors who are likely to hedge. Hence, we provide the first evidence for a substantial and pervasive influence of option trading on stock prices. ElectronEilce cctoropny ico fc tohpisy paavpaeilra bisl ea vaat:i lhatbtples :a//ts: shrtntp.c:/o/sms/ranb.csotrmac/at=b9s7tr0a5c9t=2970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 47,
    "chunk_index": 0,
    "word_count": 289,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "economically significant negative relationship between stock return volatility and net purchased option positions of investors who are likely to hedge. Hence, we provide the first evidence for a substantial and pervasive influence of option trading on stock prices. ElectronEilce cctoropny ico fc tohpisy paavpaeilra bisl ea vaat:i lhatbtples :a//ts: shrtntp.c:/o/sms/ranb.csotrmac/at=b9s7tr0a5c9t=2970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 1,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Ever since individual equity options began trading in 1973, investors, exchange officials, and regulators have been concerned that underlying stock prices would be impacted.1 Despite a substantial effort to identify such impact and the existence of a strand of theoretical literature modeling the effects of option hedge rebalancing on underlying stock prices, little evidence has been produced that option trading influences the prices of underlying stocks.2 Indeed, the only convincing evidence that option activity alters underlying stocks involves stock price deviations right at option expiration. The present paper investigates whether option market activity has a substantially more pervasive influence on underlying stock prices. A first strand of research on the impact of option trading on underlying stocks examines whether option introduction generates a one-time change in stock price level. Earlier papers by Conrad (1989) and Detemple and Jorion (1990) indicate that option introduction produces an increase in the level of underlying stock prices. These findings, however, do not appear to be robust. Sorescu (2002) and Ho and Liu (1997) show that in a later time period stock prices decrease upon option introduction, and Mayhew and Mihov (2004) find that the price level effects disappear when benchmarked against the price changes of matched firms that do not have options introduced. Most recently, Lundstrum and Walker (2006) provide evidence that the introductions of LEAPS are associated with small declines in the prices of underlying stocks. A second strand of research investigates whether option activity causes systematic changes in the prices of the underlying stocks at option expiration dates. An early CBOE (1976) 1 See Whaley (2003) for an account of the early period of exchange traded options. 2 A separate strand of literature examines the impact of futures trading on the volatility of underlying stock indices (e.g., Bessembinder and Seguin (1992) and Gulen and Mayhew (2000)), especially at index expiration (e.g., Barclay, Hendershott, and Jones (2006) and the references therein). Researchers have also considered the possible impact of mortgage hedging and OTC derivatives dealers’ hedging on interest rates (Perli and Sack (2003), Chang, McManus, and Ramagopal (2005), Kambhu (1998), and Kambhu and Mosser (2004)). 1 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 47,
    "chunk_index": 2,
    "word_count": 358,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "(e.g., Barclay, Hendershott, and Jones (2006) and the references therein). Researchers have also considered the possible impact of mortgage hedging and OTC derivatives dealers’ hedging on interest rates (Perli and Sack (2003), Chang, McManus, and Ramagopal (2005), Kambhu (1998), and Kambhu and Mosser (2004)). 1 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 3,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "report does not find evidence of abnormal underlying stock price behavior leading up to option expiration. Using small samples, Klemkosky (1978) documents negative returns on underlying stocks in the week leading up to expiration and positive returns in the week after expiration while Cinar and Vu (1987) find that the average return and volatility of optioned stocks on the Thursday to Friday of expiration week are largely the same as from the Thursday to Friday of non-expiration weeks. Ni, Pearson, and Poteshman (2005), on the other hand, provide strong evidence that the prices of optioned stocks cluster at strike prices—and therefore are altered—on option expiration dates. A final strand of research on the impact of individual equity options examines whether options produce pervasive changes in underlying stock price movements—changes not limited to the times that options are introduced or expire. Bansal, Pruitt, and Wei (1989), Conrad (1989), and Skinner (1989) all find that being optioned yields a decrease in the volatility of underlying stock prices. However, Lamoureux and Panikkath (1994), Freund, McCann, and Webb (1994), and Bollen (1998) demonstrate that the apparent decrease in volatility is probably rooted in the fact that exchanges tend to introduce options after increases in volatility. In particular, they show that the decrease in volatility that occurs after option introduction is also observed in samples of matched control firms that lack option introduction. All in all, the literature contains little evidence that option trading has a significant impact on underlying stock prices. The only compelling evidence that stock prices are altered is limited to expiration dates. Specifically, Ni, Pearson, and Poteshman (2005) document that the prices of optionable stocks (i.e., stocks with exchange-traded options) cluster at option strike prices on option expiration dates, and show that stock trading undertaken by option market participants in order to keep their portfolios hedged as the deltas of their expiring option positions change 2 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 47,
    "chunk_index": 4,
    "word_count": 320,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "prices of optionable stocks (i.e., stocks with exchange-traded options) cluster at option strike prices on option expiration dates, and show that stock trading undertaken by option market participants in order to keep their portfolios hedged as the deltas of their expiring option positions change 2 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 47,
    "chunk_index": 5,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "rapidly as the remaining time to expiration shrinks to zero is a major driver of this stock price clustering.3 Avellaneda and Lipkin (2003) model this mechanism, focusing on the role of the time derivatives of option deltas. These are large for options that are near the money and close to expiration, and have signs depending upon whether the options are purchased or written. Due to these time derivatives, as time passes delta-hedgers who have net purchased (written) option positions will sell (buy) stock when the stock price is above the option strike price and buy (sell) stock when the price is below the strike price, tending to drive the stock price toward the option strike price. As documented by Ni, Pearson, and Poteshman (2005), this causes clustering (de- clustering) at option expiration when delta-hedging option market participants have net purchased (written) positions in options on an underlying stock. The finding that re-hedging of option positions just before expiration produces measurable deviations in stock price paths leads naturally to the question of whether re-hedging away from expiration also changes stock price movements. In the theoretical literature, Jarrow (1994), Frey and Stremme (1997), Frey (1998), Platen and Schweizer (1998), Sircar and Papanicolaou (1998), Frey (2000), and Schönbucher and Wilmott (2000) model the effect of the delta-hedging of derivative positions on underlying assets that are not perfectly liquid. The key result in this literature is that dynamic trading strategies that replicate purchased option positions (i.e., positions that have convex payoffs) involve buying the underlying asset after its price has increased and selling it after its price has decreased. This pattern of buying and selling causes the underlying asset to be more volatile than it otherwise would have been and may even exacerbate large movements in the price of the underlying asset. The models also imply that dynamic trading strategies that replicate written option positions (i.e., positions that have 3 The delta of an equity option is the change in its value per unit increase in the value of the underlying stock. 3 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 47,
    "chunk_index": 6,
    "word_count": 344,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "of the underlying asset. The models also imply that dynamic trading strategies that replicate written option positions (i.e., positions that have 3 The delta of an equity option is the change in its value per unit increase in the value of the underlying stock. 3 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 7,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "concave payoffs) will cause volatility to be lower than it otherwise would have been. The gamma of an option is its change in delta per unit increase in the underlying asset, and the gamma of purchased (written) options is positive (negative). The specific prediction of the theoretical models is formulated in terms of option gamma. In particular, the models predict that when the gamma of the net option position on an underlying stock of delta-hedging investors is positive (negative), hedge re-balancing will reduce (increase) the volatility of the stock. This prediction has not yet been empirically tested.4 We investigate whether the net gamma of delta-hedging investors is indeed negatively related to the volatility of the underlying stock by using a dataset that allows us to compute on a daily basis for each underlying stock the gamma of the net option position of likely delta hedgers. We indeed find a highly significant negative relationship between the gamma of the net option position of likely delta-hedgers and the absolute return of the underlying stock. The finding is robust to controlling for persistence in stock volatility and also for the possibility that the option positions of likely delta-hedgers are changed as the result of investors trading options to profit from information about the future volatility of underlying stocks. In addition, the finding is present for large and small underlying stocks, in the first and second half of our sample period, when we define likely delta hedgers to include firm proprietary traders as well as market makers, and when we exclude the week of option expiration from our analysis. Hence, we provide evidence that option market activity has a pervasive impact on the price paths of underlying stocks. In particular, the impact is not limited to times very close to option expiration. 4 Cetin, Jarrow, Protter, and Warachka (2006) carry out empirical work examining the effects of stock illiquidity on option prices for five different stocks, but do not address the impact of option hedging on stock prices. 4 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 47,
    "chunk_index": 8,
    "word_count": 340,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "limited to times very close to option expiration. 4 Cetin, Jarrow, Protter, and Warachka (2006) carry out empirical work examining the effects of stock illiquidity on option prices for five different stocks, but do not address the impact of option hedging on stock prices. 4 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 9,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Furthermore, the effect is economically significant. The average daily absolute return of the stocks in our sample is 310 basis points and a one standard deviation shock to the gamma of the net option position variable is associated with a 37 basis point change in absolute return. Consequently, we estimate that on the order of 12 percent (=37/310) of the daily absolute return of optioned stocks can be accounted for by option market participants re-balancing the hedges of their option positions. We also show that the effect is not restricted to small or medium size absolute returns. Examination of large absolute daily returns reveals that a one standard deviation shock to the gamma of the net option positions changes the probability of a daily absolute return greater than 300 (500) basis points by 11 (18.5) percent. Our results shed light on the literature that investigates whether option introduction (i.e., the existence of option trading) leads to an overall increase or decrease in the variability of underlying stocks. As noted above, this literature finds that with proper benchmarking no overall increase or decrease in volatility is detectable. We show, by contrast, that volatility increases or decreases depending upon the sign of the net gamma of delta-hedging investors. Consequently, even though option trading changes the variability of underlying stock returns, it is not surprising that there is no evidence of an unconditional increase or decrease of volatility associated with option trading. The remainder of the paper is organized as follows. Section 2 develops our empirical predictions. The third section describes the data. Section 4 presents the results, and Section 5 briefly concludes. 5 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 47,
    "chunk_index": 10,
    "word_count": 276,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "evidence of an unconditional increase or decrease of volatility associated with option trading. The remainder of the paper is organized as follows. Section 2 develops our empirical predictions. The third section describes the data. Section 4 presents the results, and Section 5 briefly concludes. 5 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "1. Introduction",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 11,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "1. Introduction (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Dynamic trading strategies that involve replicating or delta-hedging options require buying or selling the underlying asset as the delta of the option or options portfolio changes. Unless the underlying asset is traded in a perfectly liquid market, such trading will lead to changes in the price of the underlying asset. Both intuitive arguments and a number of theoretical models imply that this trading due to hedge rebalancing will either increase or decrease the volatility of the underlying asset, depending upon the nature (negative or positive gamma) of the option positions that are being hedged. This section develops the main testable prediction about the relation between the net positions of delta-hedging option investors and the volatilities of underlying stocks. Letting V(t, S) denote the value of an option or options portfolio, recall that the delta is Δ(t, S)= ∂V(t, S)/∂S and the gamma is Γ(t, S) = ∂Δ(t, S)/∂S = ∂2V(t, S)/∂S2. Consider an option market maker who has written options and wants to maintain a delta-neutral position, that is he or she wants the delta of the combined position of options and the underlying stock to be zero. Because the option position consists of written contracts, its gamma is negative, and to maintain delta-neutrality the market maker must buy the underlying stock when its price increases and sell it when its price decreases. Similarly, the trading strategy to delta-hedge a positive-gamma option position (purchased options) requires selling the underlying asset after its price has increased and buying it after its price has decreased. Intuition suggests that if the gamma of the aggregate position of market makers and other delta-hedgers is negative, then the trading due to hedge rebalancing (buying if the stock price increases, and selling if it decreases) will have the effect of increasing the volatility of the underlying stock. Conversely, if the gamma of the aggregate position of market makers and other delta-hedgers is positive, then the trading due to 6 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 47,
    "chunk_index": 12,
    "word_count": 328,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "(buying if the stock price increases, and selling if it decreases) will have the effect of increasing the volatility of the underlying stock. Conversely, if the gamma of the aggregate position of market makers and other delta-hedgers is positive, then the trading due to 6 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 47,
    "chunk_index": 13,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "hedge rebalancing (selling if the stock price increases, and buying if it decreases) will have the effect of reducing the volatility of the underlying stock. This reasoning predicts that the volatility of the underlying stock will be negatively related to the gamma of the aggregate option position of the option market makers and any other delta hedgers. As briefly mentioned in the introduction, the possible effects of the stock trading stemming from hedge rebalancing have been the focus of a strand of the theoretical literature. Consistent with the intuition above, a number of models have the implication that unless the market for the underlying asset is perfectly liquid the associated trading will cause the volatility of the underlying asset to be greater than or less than it would have been in the absence of such trading, depending on whether the gamma of the aggregate option position of the delta-hedgers is less than or greater than zero. Below we briefly summarize the results of several models that provide explicit formulas showing the effect of hedge rebalancing on volatility. As expected, in these models the gamma of the position being delta-hedged plays the key role. In addition to formalizing the intuition described above, the formulas also provide guidance for the empirical work about how to normalize the gammas of the option positions so that they are comparable across firms. These models are built so that in the special cases of no delta hedgers the price dynamics of the underlying asset specialize to the usual geometric Brownian motion with constant instantaneous volatility σ that underlies the Black-Scholes-Merton analysis. When there are delta hedgers, the instantaneous volatility is of the form volatility = v(●)σ, where σ is a constant and the arguments of the scaling function v include the gamma of the delta hedgers’ aggregate option position. 7 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 47,
    "chunk_index": 14,
    "word_count": 309,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "σ that underlies the Black-Scholes-Merton analysis. When there are delta hedgers, the instantaneous volatility is of the form volatility = v(●)σ, where σ is a constant and the arguments of the scaling function v include the gamma of the delta hedgers’ aggregate option position. 7 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 15,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Frey and Stremme (1997), Sircar and Papanicolaou (1998), and Schönbucher and Wilmott (2000) analyze essentially the same model, with different focuses and emphases. In this model there are “reference traders” whose demands are driven by an underlying Brownian motion and are decreasing in the price of the underlying asset, and also “program traders” who follow a pre-specified dynamic trading strategy that can be interpreted as the strategy to delta- hedge an option position. When the demand functions and other assumptions are chosen so that the model reduces to geometric Brownian motion and the Black-Scholes-Merton model in the special case of no program traders, the form of the scaling function v is5 1+Δ(t,S)/M ⎛ (S/M)Γ(t,S)⎞ v(t,S)= =1 ⎜1+ ⎟, (1) 1+Δ(t,S)/M +(S/M)Γ(t,S) ⎝ 1+Δ(t,S)/M ⎠ where M is the number of shares of stock outstanding, S is the price per share, Δ = ∂V(t, St)/∂S and Γ = ∂2V(t, S)/∂S2 are the delta and gamma of the delta-hedgers’ aggregate option position, and V(t, S) is the value of the option position of the delta-hedgers. Platen and Schweizer (1998) describe a similar model in which the scaling function is6 1 v(t,S)= , (2) 1+(S/γ)Γ(t,S) where γ is a parameter that appears in the demand function. In this model it seems natural to assume that the demand parameter is proportional to the number of shares outstanding, i.e. that γ = M/α, where α is constant.7 Making this assumption, the scaling function in (2) becomes 5 See equation (24) on p. 55 of Sircar and Papanicolaou (1998), the definition of ρ in terms of ζ on page 51, and the meaning of ζ on p. 50. The signs on Δ and Γ differ from those that appear in Sircar and Papanicolaou (1998) because here the symbols Δ and Γ represent the partial derivatives of the delta hedgers’ aggregate option position, while the results in Sircar and Papanicolaou are expressed in terms of the trading strategy in shares. (The hedging strategy involves a position of –Δ shares.) 6 This is based on equation (2.7) of Platen and Schweizer (1998), where we have used the fact that ∂ξ/∂(log s) = s(∂ξ/∂s) and also adjusted the equation to reflect the fact that equation (2.7) of Platen and Schweizer (1998) provides the volatility rather than the scaling function v. 8 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 47,
    "chunk_index": 16,
    "word_count": 387,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "equation (2.7) of Platen and Schweizer (1998), where we have used the fact that ∂ξ/∂(log s) = s(∂ξ/∂s) and also adjusted the equation to reflect the fact that equation (2.7) of Platen and Schweizer (1998) provides the volatility rather than the scaling function v. 8 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 47,
    "chunk_index": 17,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "1 v(t,S) = . (3) 1+α(S/M)Γ(t,S) Finally, Frey (2000) presents a simple model in which the scaling function is 1 v(t,S)= , (4) 1+ρSΓ(t,S) where the parameter ρ measures the sensitivity of the stock price to the trades stemming from hedge rebalancing. In this case, it seems reasonable to assume that ρ is inversely proportional to the shares outstanding, i.e., that it can be written as ρ = λ/M. Under this assumption, the scaling function in (4) becomes 1 v(t,S)= . (5) 1+λ(S/M)Γ(t,S) Recalling that the instantaneous volatility is given by the product v(t,S)σ, the main testable prediction that comes from these analyses is that hedge rebalancing will impact the variability of the returns of the underlying stocks. In particular, there will be a negative relationship between the net gamma of delta-hedging investors’ option positions on an underlying stock and the variability of the stock’s return. Notably, in all models Γ(t, S) is either the key or (except for the parameters) the only determinant of the scaling function v. Further, scaling by S/M is either part of the model (i.e., equation (1)), or a consequence of auxiliary assumptions that seem natural (equations (3) and (5)).8 For these reasons, our empirical analysis below focuses on the relation between gamma and stock return volatility using the normalized gamma (S/M) Γ(t, S). In the empirical work we use the Black-Scholes model to compute the net gamma of the hedge rebalancer’s option position on an underlying stock. As a 7 The demand function is equation (2.3) of Platen and Schweizer (1998). 8 Dimensional analysis also suggests scaling Γ(t, S) by the ratio S/M. The units of Δ, Γ, S, and M are shares, (shares)2/$, $/share, and shares, respectively, implying that the ratio (S/M)×Γ(t, S) is dimensionless. 9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 47,
    "chunk_index": 18,
    "word_count": 298,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "function is equation (2.3) of Platen and Schweizer (1998). 8 Dimensional analysis also suggests scaling Γ(t, S) by the ratio S/M. The units of Δ, Γ, S, and M are shares, (shares)2/$, $/share, and shares, respectively, implying that the ratio (S/M)×Γ(t, S) is dimensionless. 9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 47,
    "chunk_index": 19,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "robustness check, we also re-estimate the empirical models using option gammas from the OptionMetrics Ivy DB database. 3. Data The primary data for this paper were obtained from the Chicago Board Options Exchange (CBOE). These data include several categories of daily open interest for every equity option series that trades at the CBOE from the beginning of 1990 through the end of 2001. When equity options on an underlying stock trade both at the CBOE and also at other exchanges, the open interest data cover the option series on the underlying stock from all exchanges. If equity options on an underlying stock are not traded at the CBOE, then they are not included in the data. The data set contains four categories of open interest for each option series at the close of every trade day: purchased and written open interest by public customers and purchased and written open interest by firm proprietary traders. The categorization of investors as public customers or firm proprietary traders follows the Option Clearing Corporation (OCC) classification. Since the OCC assigns an origin code of public customer, firm proprietary trader, or market maker to each side of every transaction, the CBOE data encompass all non-market maker open interest. Investors trading through Merrill Lynch or E*trade are examples of public customers while an option trader at Goldman Sachs who trades for the bank’s own account is an example of a firm proprietary trader. Daily returns, closing prices, and number of shares outstanding are obtained for the underlying stocks for which we have option data from the Center for Research in Securities Prices (CRSP). For some analyses we use option gammas taken from the Ivy DB database produced by OptionMetrics LLC. 10 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 47,
    "chunk_index": 20,
    "word_count": 290,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "prices, and number of shares outstanding are obtained for the underlying stocks for which we have option data from the Center for Research in Securities Prices (CRSP). For some analyses we use option gammas taken from the Ivy DB database produced by OptionMetrics LLC. 10 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "2. Empirical Predictions",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 21,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "2. Empirical Predictions (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "In order to address the questions of whether rebalancing of delta hedges impacts stock price paths we need daily measures of the net gamma of the option positions of likely delta hedgers. This section of the paper begins by defining these measures and then goes on to investigate the impact of delta hedger gamma on stock return volatility. 4.1. Net gamma of likely delta-hedgers The number of purchased and written positions in each option series is necessarily identical. Consequently, at any point in time for any underlying stock, the net gamma of the option positions in each option series (and, hence, in the options on any underlying stock) of all investors is zero. Some investors, however, are more likely than others to delta-hedge their option positions. Cox and Rubinstein (1985) maintain that market makers are the option market actors who are most likely to delta-hedge their net option positions on underlying stocks. They write: … many Market Makers attempt to adhere quite strictly to a delta-neutral strategy. However, a delta-neutral strategy usually requires relatively frequent trading. As a result, it is not advisable as a consistent practice for investors with significant transaction costs. While public investors fall into this category, Market Makers do not. (p. 308) Hull (2003, pp. 299, 309) similarly maintains that market makers and firm proprietary traders but not public customers are likely to delta-hedge their net option positions. He explains that delta- hedging is relatively more attractive to investors who hold large portfolios of options on an underlying stock. These investors can delta-hedge their entire portfolios with a single transaction in the underlying stock and thereby offset the hedging cost with the profits from many option trades. Delta-hedging by investors who hold only a small number of options on an underlying 11 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 47,
    "chunk_index": 22,
    "word_count": 301,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "underlying stock. These investors can delta-hedge their entire portfolios with a single transaction in the underlying stock and thereby offset the hedging cost with the profits from many option trades. Delta-hedging by investors who hold only a small number of options on an underlying 11 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 47,
    "chunk_index": 23,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "asset, on the other hand, is extremely expensive. McDonald (2006) devotes an entire chapter of his textbook to “Market Making and Delta-Hedging.” Based on the widely held view that non- public investors are the predominant delta-hedgers in the option market, our tests assume that delta-hedging is concentrated either in market makers or in market makers plus firm proprietary traders. We denote by netGamma the net gamma of the likely delta-hedgers’ option positions on t an underlying stock at the close of trade date t. The likely delta hedgers are either market makers or market makers plus firm proprietary traders, who together constitute all non-public traders. Although we do not have data on market maker open interest, we do have data on the purchased and written open interest of public customers and firm proprietary traders. We use the fact that the sum of the market maker, public customer, and firm proprietary trader open interest on any option series at any point of time must be zero to construct the netGamma variable, as follows. t For each underlying stock, we measure the likely delta hedgers’ net open interest at the close of trade date t in the jth option series as the negative of the net open interest of the other investor classes. Specifically, the delta hedger net open interest in option series j at the close of trade date t is netOpenInterest =−⎡1 (OpenInterestPurchased,FirmProp −OpenInterestWritten,FirmProp) j,t ⎣ {MM} j,t j,t (6) +OpenInterestPurchased,Public −OpenInterestWritten,Public⎤, j,t j,t ⎦ where netOpenInterest is the net open interest (in units of option contracts) of the likely delta j,t hedgers in option series j and OpenInterestx,y is the open interest of type x (i.e., purchased or j,t written) by investor class y (i.e., Firm Proprietary or Public) in option series j at the close of trade date t. The indicator function 1 takes the value one if the set of likely delta hedgers is {●} 12 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 47,
    "chunk_index": 24,
    "word_count": 324,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "type x (i.e., purchased or j,t written) by investor class y (i.e., Firm Proprietary or Public) in option series j at the close of trade date t. The indicator function 1 takes the value one if the set of likely delta hedgers is {●} 12 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 47,
    "chunk_index": 25,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "assumed to consist only of market makers (MM), and zero if the set of likely delta hedgers is assumed to include both market makers and firm proprietary traders. The delta hedger net gamma due to option series j is just the product of the delta hedger net open interest in that series and the gamma of series j for time t and stock price S, denoted t Γ(t, S), multiplied by 100 to account for the fact that option gammas conventionally are j t expressed on a per-share basis and each option is for 100 shares of the underlying stock. Summing over the different option series, the normalized delta hedger net gamma on an underlying stock at the close of trade date t is ⎛ S ⎞ N t netGamma =100⎜ t ⎟×∑netOpenInterest Γ (t,S ) , (7) t M j,t j t ⎝ t ⎠ j=1 where N, S, and M are respectively the number of option series available for trading, the t t t underlying stock price, and the number of shares outstanding, all as of the close of trading on date t. As discussed in Section 2, the normalization by S/M is either required or suggested by t t the theoretical models. When computing Γ(t, S) all quantities other than the stock price (i.e., the j t time to expiration of the jth option, the risk free rate, and the volatility and dividend rates of the underlying stock) are at their time t values. In the empirical work below, we use Black-Scholes gammas as proxies for Γ(t, S). j t When computing the Black-Scholes gammas, the risk-free rate is set to day t’s continuously compounded, annualized 30 day LIBOR rate, the volatility of the underlying asset is set to the annualized sample volatility estimated from daily log returns over the 60 trading days leading up to t, and the dividend rate is set equal to the continuously compounded, annualized rate that produces a present value of dividends over the interval from t to the option expiration equal to the present value of the actual dividends paid over the interval. The assumptions of the Black- 13 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 47,
    "chunk_index": 26,
    "word_count": 363,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "rate is set equal to the continuously compounded, annualized rate that produces a present value of dividends over the interval from t to the option expiration equal to the present value of the actual dividends paid over the interval. The assumptions of the Black- 13 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 47,
    "chunk_index": 27,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Scholes model are violated in a number of ways (e.g., the volatilities of the underlying stocks are not constant, there may well be jumps in the underlying stock return process, and the options are American rather than European.) We believe the Black-Scholes model provides adequate approximations to gamma for our purposes. Any noise in our estimates of gamma should bias against finding significant results. Nonetheless, as a robustness check we also present some results using option gammas taken from the Ivy DB database from OptionMetrics LLC in order to verify that our findings are not affected in any important way by our use of the Black-Scholes model. The OptionMetrics gammas are computed using the binomial model to incorporate the possibility of early exercise, and take account of the volatility skew by using for each option series the implied volatility of that series. 4.2. Relation between market maker net gamma and stock return volatility Figure 1 is a bar chart that depicts average absolute stock return on day t+1 as a function of market maker net option gamma on the underlying stock at the close of day t. We construct Figure 1 in the following way. First, for each underlying stock for which there are data available for at least 200 trade days, we use equations (6) and (7) to obtain at the end of each trade date the market maker net option gamma. Recall that this market maker net gamma is normalized by multiplying by the trade day’s closing stock price and dividing by the number of shares outstanding. Next, we sort the stock’s daily normalized market maker net gamma into ten equally sized bins and compute for each bin the stock’s average next day absolute return. The height of each bin in the figure is the average of this quantity across underlying stocks. Figure 1 makes it clear that there is a negative relationship between market maker net option gamma and the variability of stock returns. Indeed, the negative relationship is monotonic and economically meaningful: the average daily absolute return of the low net market maker 14 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 47,
    "chunk_index": 28,
    "word_count": 353,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "stocks. Figure 1 makes it clear that there is a negative relationship between market maker net option gamma and the variability of stock returns. Indeed, the negative relationship is monotonic and economically meaningful: the average daily absolute return of the low net market maker 14 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 29,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "gamma group is 100 basis points greater than the average absolute return for the high net market maker gamma group.9 In addition, the relationship is very strong statistically. We do not, however, report the results of statistical tests, because we recognize that there is a possible alternative explanation for the negative relationship. In particular, if investors trade on private volatility information in the option market, then we would expect them to buy (sell) options when they have information that the variability of underlying stocks is going to increase (decrease). As a result, option market makers will sell (buy) options, and, therefore, decrease (increase) the net gamma of their positions before volatility increases (decreases). Our concern about trading based on private information about volatility is mitigated by Lakonishok, Lee, Pearson, and Poteshman’s (2006) finding that explicit volatility trading through straddles, strangles, and butterflies constitutes a small fraction of option market activity. Nonetheless, the evidence in Ni, Pan, and Poteshman (2006) that volatility information trading is detectable from total option market demand for volatility leads us to develop a specification that recognizes the possibility of informed volatility trading in the option market. Our specification also addresses the possibility that investors might trade options based on past public information that is correlated with future stock return volatility. 4.3. Impact of options on underlying stock price paths The key to developing a specification that recognizes the possibility of trading in the option market based on private information about future stock return volatility is the identification of changes in the net option gamma of likely delta hedgers that do not result from investors buying or selling options on the basis of such information. We isolate such changes by recognizing that part of the change in the delta hedgers’ net gamma from time t−τ to time t 9 The figure is similar if the market maker net gamma is not normalized or if market maker plus firm proprietary net gamma is used in place of market maker net gamma. 15 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 47,
    "chunk_index": 30,
    "word_count": 339,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "in the delta hedgers’ net gamma from time t−τ to time t 9 The figure is similar if the market maker net gamma is not normalized or if market maker plus firm proprietary net gamma is used in place of market maker net gamma. 15 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 47,
    "chunk_index": 31,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "comes from changes in the gammas of the “old” option positions held by the delta hedgers at t−τ, and argue below that this component of the change in the net gamma is likely to be uncorrelated with trading based on private information about volatility. While most of the discussion is cast in terms of private information, the identification strategy also applies to public information that is not accounted for by the control variables included in the regression model that we will develop. In the context of the regression model, public information that is not captured by the control variables plays the same role as private information. We begin by decomposing the delta hedgers’ net gamma at time t into the part that is due to positions that existed τ dates earlier at time t – τ and the part that is due to new positions that were established between t – τ and t. To decompose the net gamma, first defineNt to be the t−τ number of different contracts on an underlying stock that were available for trading at time t – τ and expire after t, and then define ⎛ S ⎞ N t t −τ netGamma (t−τ,S )=100⎜ t ⎟×∑netOpenInterest Γ (t,S ) (8) t t M j,t−τ j t ⎝ t ⎠ j=1 to be the net gamma at time t of the likely delta hedger option positions that existed at date t – τ. This definition uses the net open interest from time t – τ, netOpenInterest , but sums only j,t−τ over the option series that expire after time t and uses for each series the gamma as of time t. In other words, this is the net gamma, at time t, of the “old” positions that existed τ days earlier (and that expire after t). In terms of this more general notation, the net gamma variable defined earlier in equation (7) isnetGamma = netGamma(t,S ). t t t Given the definition in equation (8), we can decompose the net gamma at time t into the part due to the old positions that existed at date t – τ and the part due to the new positions established between t – τ and t, that is 16 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 47,
    "chunk_index": 32,
    "word_count": 377,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "in equation (8), we can decompose the net gamma at time t into the part due to the old positions that existed at date t – τ and the part due to the new positions established between t – τ and t, that is 16 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 47,
    "chunk_index": 33,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "netGamma =netGamma (t−τ,S )+[netGamma −netGamma (t−τ,S )]. (9) t t t t t t This decomposition is useful because the option positions that existed at t – τ cannot have been established based on private volatility information acquired subsequent to the close of trading at day t−τ. If volatility information were sufficiently short-lived, and in particular if volatility information obtained prior to t – τ were not useful in predicting volatility after t, then this decomposition would be sufficient. Specifically, we could include the variables netGamma(t −τ,S ) and netGamma −netGamma(t−τ,S ) separately in the regression t t t t t specification and the coefficient on netGamma(t −τ,S ) would reflect only the effect of hedge t t rebalancing on volatility. Volatility information, however, may not be sufficiently short lived, and we address this possibility by further decomposing the net gamma of the delta hedgers’ old positions that existed at t – τ as netGamma (t−τ,S )=[netGamma (t−τ,S )−netGamma (t−τ,S )] t t t t t t−τ (10) +netGamma (t−τ,S ), t t−τ where netGamma(t −τ,S ) is defined by substituting S for S in equation (8). The second t t−τ t−τ t component on the right hand side of equation (10), netGamma (t−τ,S ), is the gamma of the t t−τ delta hedgers’ positions held at t – τ, computed using the time t – τ stock price, while the first component netGamma(t −τ,S )−netGamma(t −τ,S ) represents the change in the net t t t t−τ gamma of the delta hedgers’ positions at t − τ that is due to changes in the stock price from S t−τ to S. Variation in this latter variable comes from the fact that the gamma of an option is greatest t (or smallest, for a written option) when the stock price is close to the option strike price, and close to zero when the stock price is distant from the strike. Because the likely delta hedgers’ net 17 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 47,
    "chunk_index": 34,
    "word_count": 332,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "the gamma of an option is greatest t (or smallest, for a written option) when the stock price is close to the option strike price, and close to zero when the stock price is distant from the strike. Because the likely delta hedgers’ net 17 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 47,
    "chunk_index": 35,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "option position will be different at different strikes, movement of the stock price toward or away from a strike, or from the neighborhood of one strike to the neighborhood of another, leads to variation in the variable netGamma(t −τ,S )−netGamma(t −τ,S ). t t t t−τ We use this variation to identify the effect of hedge rebalancing on volatility as follows. Option positions that existed at t – τ cannot have been established based on private volatility information acquired subsequent to the close of trading at date t – τ. Hence, the change in the delta hedgers’ net gamma due to the changes in the gammas of these options cannot result from volatility information acquired by traders between t−τ and t. Furthermore, although private volatility information prior to t−τ may well be responsible for some of the option positions held at t−τ, such volatility information is highly unlikely to induce a negative correlation between the change in the gammas of those option positions between t – τ and t, netGamma(t −τ,S )−netGamma(t −τ,S ), and the absolute return between t and t+1, |r |. t t t t−τ t+1 Indeed, in order for any part of the correlation (whether positive or negative) between the variable netGamma(t −τ,S )−netGamma(t −τ,S ) and the absolute return |r | to be due to t t t t−τ t+1 private volatility information about |r | acquired on or prior to t – τ , two conditions must both t+1 be met. First, some part of the volatility information must be realized prior to date t (and thus contribute to the stock price change from t – τ to t and thereby the change in gamma netGamma(t −τ,S )−netGamma(t −τ,S )) and some part of the information must be t t t t−τ realized after t in the return |r |. Second, any dependence between the stock price change from t+1 t – τ to t and |r | must not be captured by the lagged absolute return control variables that we t+1 will include in our regression specification. 18 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 47,
    "chunk_index": 36,
    "word_count": 350,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "t in the return |r |. Second, any dependence between the stock price change from t+1 t – τ to t and |r | must not be captured by the lagged absolute return control variables that we t+1 will include in our regression specification. 18 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 47,
    "chunk_index": 37,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Since these conditions cannot be entirely ruled out a priori, it is worth noting that even if they are satisfied it is more likely that the correlation between volatility information and netGamma(t −τ,S )−netGamma(t −τ,S ) will be positive than negative. A positive t t t t−τ correlation will increase the estimated coefficient on the netGamma(t −τ,S )−netGamma(t −τ,S ) variable and hence bias against any finding that t t t t−τ hedge rebalancing affects stock return volatility. In order to see why any correlation is likely to be positive, suppose that just prior to t – τ some public customer (e.g., a hedge fund) obtains private information that volatility will increase and buys a large number of near-the-money options in order to profit from the information. Market makers will write these options, and the gamma of the corresponding market maker position will be negative. As the underlying stock price changes from S to S, the near-the-money options will move away from the money which t−τ t will cause the gammas of the options to decrease and the market maker gamma to increase (since they have written the options). As a result, the change in gamma netGamma (t−τ,S )−netGamma (t−τ,S ) will be positively related to the customers’ private t t t t−τ information about |r |. Conversely, if a customer obtains private information that volatility will t+1 decrease he or she will write options, the corresponding market maker gamma will be positive, and the change in gamma due to a stock price change from S to S will likely be negative and t−τ t thus positively correlated with the (negative) private information about |r |. t+1 In light of these considerations, the main variable in our specification isnetGamma(t −τ,S )−netGamma(t −τ,S ), that is the change in the net gamma between t t t t−τ t−τ and t of option positions held by the likely delta hedgers at time t−τ that results from the change in the underlying stock price from S to S . In addition, we also include the other two t−τ t 19 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 47,
    "chunk_index": 38,
    "word_count": 352,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "t t t t−τ t−τ and t of option positions held by the likely delta hedgers at time t−τ that results from the change in the underlying stock price from S to S . In addition, we also include the other two t−τ t 19 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 47,
    "chunk_index": 39,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "components netGamma(t −τ,S ) and netGamma −netGamma(t−τ,S ) separately as t t−τ t t t independent variables in our regression specifications. These three variables sum to the delta hedger net gamma at time t, netGamma. t Our specification must also control for other variables that predict volatility and are correlated with the gamma measures. The leading candidates for such control variables are functions of past returns, as the existence of volatility clustering in returns (i.e., GARCH effects) has been well documented. We control for volatility clustering in a computationally tractable fashion by including lagged absolute returns in the regression specification. This approach to modeling volatility clustering was proposed by Schwert and Seguin (1990) and recently used by Barclay, Hendershott, and Jones (2006). Because we estimate the regressions firm-by-firm, we do not need to control explicitly for firm characteristics that affect volatility, as these will be subsumed in the constant terms. By taking account of both firm characteristics and the effect of lagged returns, our regression specification includes the most important publicly available predictors of stock return volatility. While the regression model almost certainly does not capture all public information about volatility, the preceding discussion of private information also applies to public information, because the part of public information that is not captured by the control variables ends up in the regression residuals and plays the same role as private information. As with private information, any public information that is not captured by the controls can induce a negative correlation between the absolute return |r | and the variable t+1 netGamma(t −τ,S )−netGamma(t −τ,S ) only if some part of it is realized in stock returns t t t t−τ on or prior to date t and thus contributes to the change in gamma netGamma(t −τ,S )−netGamma(t −τ,S )) and some part of it is realized in the return |r |, t t t t−τ t+1 20 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 47,
    "chunk_index": 40,
    "word_count": 321,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "realized in stock returns t t t t−τ on or prior to date t and thus contributes to the change in gamma netGamma(t −τ,S )−netGamma(t −τ,S )) and some part of it is realized in the return |r |, t t t t−τ t+1 20 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 47,
    "chunk_index": 41,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "and this dependence between the returns before t and the absolute return |r | is not captured by t+1 the controls for volatility clustering. Our specification has one time-series equation for each underlying stock, and the main variable netGamma(t −τ,S )−netGamma(t −τ,S ) is the first one on the right hand side of t t t t−τ the following equation: [ ] r =a+b netGamma (t−τ,S )−netGamma (t−τ,S ) +cnetGamma (t−τ,S ) t+1 t t t t−τ t t−τ [ ] +d netGamma (t,S )−netGamma (t−τ,S ) +e|r |+f |r |+g|r |+h|r | (11) t t t t t t−1 t−2 t−3 +i|r |+j|r |+k|r |+ |r |+m|r |+n|r |+ε, t =1,...,T l t−4 t−5 t−6 t−7 t−8 t−9 t We will estimate model (11) for each underlying stock with τ set equal to 3, 5, and 10 trade dates. Our primary prediction is that the b coefficients are negative. For each underlying stock, the second independent variable netGamma(t −τ,S ) t t−τ measures the likely delta hedgers’ net gammaτ trade dates in the past. The delta-hedging effect also predicts that this variable’s coefficient will be negative. However, a negative estimate for c will not provide unambiguous evidence that delta-hedging impacts underlying stock variability, because the volatility information effect will also tend to make this coefficient negative. Of course, insofar as any increase or decrease in volatility associated with volatility information trading appears and disappears in fewer than τ days, a negative c coefficient does in fact indicate that delta-hedging effects stock price variability. We cannot, however, be certain of the horizon of volatility changes predicted by volatility information trading. The third independent variable netGamma −netGamma(t−τ,S )measures the change in net gamma from t−τ to t that results t t t from the change in the delta hedgers’ option position from t−τ to t. Since both the delta re- hedging and volatility information stories predict a negative coefficient for this variable, a negative coefficient estimate does not provide straightforward evidence for either. These second 21 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 47,
    "chunk_index": 42,
    "word_count": 340,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "t from the change in the delta hedgers’ option position from t−τ to t. Since both the delta re- hedging and volatility information stories predict a negative coefficient for this variable, a negative coefficient estimate does not provide straightforward evidence for either. These second 21 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 43,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "and third independent variables also serve to control for volatility trading based on private information. The current and nine past daily lags of absolute returns control for volatility clustering in stock returns. We estimate all 2,308 equations (one for each underlying stock) simultaneously in a stacked regression, allowing coefficients in each equation to be independently determined. We exclude stocks for which there are fewer than 200 trade days for which observations on all of the variables are available. Standard errors for the coefficient averages are clustered by date. Specifically, we first form a covariance matrix V of all coefficients, clustered by date. We then derive the standard error for the average directly from this covariance matrix as ΞVΞ', where Ξ is chosen to construct the arithmetic average of individual equation coefficients from the stacked coefficient vector. An advantage of this approach is that standard errors are robust to the cross- sectional covariance structure of the individual equation regression errors, which is of unknown structure. Table 1 contains descriptive statistics on the absolute return variables |r| and the t normalized net position gamma netGamma for the two groups of likely delta hedgers, market t makers (Market Makers) and market makers plus firm proprietary traders ( Market Maker + Firm Proprietary). The descriptive statistics are first calculated for each underlying stock and then the averages across the underlying stocks are reported. The average mean and median absolute returns are 0.031 or 3.1% and 0.022 or 2.2%, respectively, and the average minimum and maximum values are zero and 0.31 (31%). For market makers the average mean value of the normalized net position gamma is 3.106 and the average standard deviation is 6.772. The average means and standard deviations of the corresponding unnormalized variables are 9,993 and 19,058, respectively. For market makers plus firm proprietary traders, the average mean and 22 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 47,
    "chunk_index": 44,
    "word_count": 312,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "mean value of the normalized net position gamma is 3.106 and the average standard deviation is 6.772. The average means and standard deviations of the corresponding unnormalized variables are 9,993 and 19,058, respectively. For market makers plus firm proprietary traders, the average mean and 22 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 47,
    "chunk_index": 45,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "standard deviation are slightly larger. For market makers, the average minimum and maximum values for the normalized netGamma variable are, respectively, −22.536 shares and 43.307, while the corresponding quantities for the unnormalized net position gamma are −56,690 and 128,513. As one might expect, for market makers plus firm proprietary traders the average minimum and maximum values are slightly more extreme. Table 2 reports the results of estimating model (11) for the case when market makers are the likely delta hedgers and τ=5 trade days. The table reports averages across underlying stocks of point estimates and t-statistics for the averages, where the t-statistics are constructed from standard errors based on clustering by date as described above. Hence, the t-statistics account for any cross-sectional correlation in the data. The average of the coefficient estimates on the key right-hand side variable netGamma(t −τ,S )−netGamma(t −τ,S ) is equal to −0.000543 and highly significant, with t t t t−τ a t-statistic of −7.624. The negative average coefficient indicates that there is a negative relationship between market maker net gamma and the variability of the underlying stock price that is not rooted in volatility information trading. Hence, the main prediction from above is confirmed, and there is evidence that option market activity has a pervasive influence on underlying stock price paths. Furthermore, the effect appears to be economically meaningful. The average daily absolute return of the stocks in our sample is 310 basis points and from Table 1 the standard deviation of the market maker normalized net position gamma is 6.772. Thus, a one standard deviation shock to the market maker net position gamma is associated with a 0.000543×6.772 = 36.8 basis points change in absolute return. Consequently, we estimate that on the order of 11.8 percent (=36.8/310) of the daily absolute return of optioned stocks can be accounted for by option market participants re-balancing the hedges on their option positions. 23 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 47,
    "chunk_index": 46,
    "word_count": 322,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "a 0.000543×6.772 = 36.8 basis points change in absolute return. Consequently, we estimate that on the order of 11.8 percent (=36.8/310) of the daily absolute return of optioned stocks can be accounted for by option market participants re-balancing the hedges on their option positions. 23 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 47,
    "chunk_index": 47,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "The average coefficients on the variables netGamma(t −τ,S ) and t t−τ netGamma −netGamma(t−τ,S ) are also negative and significant. In both cases, the negative t t t estimates may come from the market makers delta hedging their option positions, volatility information trading of non-market makers, or some combination of the two. The current and lagged absolute stock return variables all have positive and significant coefficient estimates, which is consistent with the well-known phenomenon of volatility clustering in stock returns. Finally, we note that in unreported results the estimates on the three net gamma variables are similar when the absolute stock return variables are omitted from the model. Since the absolute return control variables capture the first-order features of the volatility process, the fact that omitting them does not change our findings suggests that our results are unlikely to change much if alternative techniques are used to control for the time-series properties of volatility. The absolute returns also provide a control for the overall level of volatility. Here again, the fact that omitting them all together does not change our findings suggests that our results would not change with alternative controls for the overall level of volatility.10 The fourth and fifth columns of Table 2 (the columns headed “Market Maker plus Firm Proprietary Positions”) are based on the alternative assumption that both market makers and firm proprietary traders delta-hedge their option positions. Thus, the three gamma variables in this specification are computed using the combined option position of the market makers and firm proprietary traders. As with the results using the market maker gammas, we estimate a time- series equation for each of the 2,308 underlying stocks for which there are at least 200 trade days 10 It is unclear that there is any need to control for the overall level of volatility. While net gamma may vary systematically with the level of volatility, there is no reason to believe that the differenced net gamma variable that is the main object of interest is lower (higher) when overall volatility is higher (lower). 24 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 47,
    "chunk_index": 48,
    "word_count": 348,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "the overall level of volatility. While net gamma may vary systematically with the level of volatility, there is no reason to believe that the differenced net gamma variable that is the main object of interest is lower (higher) when overall volatility is higher (lower). 24 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 47,
    "chunk_index": 49,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "on which observations on all of the variables are available and report in the table the means of the 2,038 coefficient estimates and the associated t-statistics. These results are very similar to those using the market maker gamma variables, with the principal difference being that the magnitudes of the average coefficient estimates on the three gamma variables are slightly smaller. For example, the average coefficient on the variable netGamma(t −τ,S )−netGamma(t −τ,S ) is –0.000476 (with t-statistic –6.861) rather than t t t t−τ –0.000543. There are similar small differences in the average coefficient estimates on the other two gamma variables, while the average coefficient estimates on the lagged absolute return variables are almost unchanged. The small decreases in the magnitudes of the coefficient estimates on the gamma variables are consistent with the hypothesis that not all of the firm proprietary traders delta-hedge and thus including their positions in the computation of the gamma variables dampens the effect. Regardless, these results also indicate that there is a negative relation between gamma and volatility that is not due to volatility information trading. The extent to which re-balancing by delta-hedgers impacts the frequency of large stock price moves is also of interest. We assess the impact on large stock price movements by re- estimating equation (11) with the dependent variable |r | replaced by one of two indicator t+1 variables: the first takes the value one when |r | is greater than 3% and otherwise is zero, and t+1 the second takes the value one when |r | is greater than 5% and otherwise is zero. The t+1 estimation is carried out in the same way as before, and the results are reported in Table 3. The results indicate that the average coefficient on the netGamma(t −τ,S )−netGamma(t −τ,S ) t t t t−τ variable is negative and significant for both the 3% and the 5% dependent indicator variables. Consequently, there is evidence that the re-balancing of delta hedges of option positions impacts the probability of large absolute stock returns on underlying stocks. In order to understand the 25 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 47,
    "chunk_index": 50,
    "word_count": 352,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "variable is negative and significant for both the 3% and the 5% dependent indicator variables. Consequently, there is evidence that the re-balancing of delta hedges of option positions impacts the probability of large absolute stock returns on underlying stocks. In order to understand the 25 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 47,
    "chunk_index": 51,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "economic importance of the hedge re-balancing effect on large absolute stock returns, note that in our sample the unconditional probability that a daily absolute return will be greater than 3% is 0.282. A one standard deviation movement in the netGamma variable is 6.772. As a result, a t one standard deviation shock to this variable reduces the probability that the daily absolute return on the underlying stock is greater than or equal to 3% by –0.0318 (= –0.0047 × 6.772). This change in probability corresponds to an 11% reduction from 0.282 to 0.250. A similar argument indicates that for daily absolute returns greater than 5%, the probability is reduced by 18.5% from 0.139 to 0.113. Hence, delta hedge rebalancing by market makers appears to have an important impact on large stock price movements. Although it is unclear how microstructure effects such as bid-ask bounce could bias toward our findings in the first place, the fact that the main effect is present for large absolute returns suggests that microstructure phenomena are unlikely to provide an alternative explanation for our results. 4.4 Analysis of subsamples Ni, Pearson, and Poteshman (2005) present evidence that stock trading to rebalance option market makers’ delta hedges of their option positions contributes to stock price clustering on the option expiration Friday and the preceding Thursday, but find no evidence of any effect prior to the expiration week. This raises the possibility that the negative relation between volatility and gamma documented above is not pervasive but rather is driven by the observations from option expiration dates or the immediately preceding trading days. This concern is exacerbated by the fact that the gammas of options that are very close-to-the-money become large as the remaining time to expiration shrinks to zero, implying that delta hedgers with 26 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 47,
    "chunk_index": 52,
    "word_count": 302,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "the observations from option expiration dates or the immediately preceding trading days. This concern is exacerbated by the fact that the gammas of options that are very close-to-the-money become large as the remaining time to expiration shrinks to zero, implying that delta hedgers with 26 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 47,
    "chunk_index": 53,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "positions in such options may need to engage in considerable stock trading just prior to expiration in order to maintain their hedges. Table 4 addresses this issue by presenting results for a sub-sample that excludes the data from the expiration week. The regression specifications are identical to those that were used for the results reported in Table 2, and the sample is identical except that observations for which the trade date t was from an option expiration week were dropped. This resulted in eliminating slightly less than 25 percent of the observations. Following the format of Table 2, Table 4 reports the averages across firms of the coefficient estimates of the time-series regressions for the underlying stocks. The results in Table 4 are almost identical to those in Table 2. When the gammas are computed using only market maker option positions the mean coefficient estimate for the key variable netGamma(t −τ,S )−netGamma(t −τ,S ) is –0.000535 (with t-statistic –5.451) t t t t−τ instead of the average of –0.000543 (t-statistic –7.624) reported in Table 2. We expect the reduction in the t-statistic, because approximately 25% of the data have been eliminated. The average coefficient estimates for the other two gamma variables are also nearly unchanged. When the gammas are computed using the positions of market makers plus firm proprietary traders the situation is the same—the average coefficient estimates on the position gamma variables reported in Table 4 are only very slightly different from the corresponding averages in Table 2. The average coefficient estimates on the lagged absolute return variables also are little changed. These results indicate that the relation between the gamma of delta hedgers’ option positions and stock return volatility is pervasive and not limited to option expiration weeks. Table 5 presents results for sub-samples based on a different time partition. In particular, the second and third columns present the average coefficient estimates and associated t-statistics 27 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 47,
    "chunk_index": 54,
    "word_count": 323,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "delta hedgers’ option positions and stock return volatility is pervasive and not limited to option expiration weeks. Table 5 presents results for sub-samples based on a different time partition. In particular, the second and third columns present the average coefficient estimates and associated t-statistics 27 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 47,
    "chunk_index": 55,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "from time-series regressions for each stock using data from the first half of the sample period 1990–1995, while the fourth and fifth columns present the average coefficient estimates and associated t-statistics from the second half of the sample period 1996–2001. For both sub- samples and all three net gamma variables the average coefficients are significantly different from zero, consistent with the results in previous tables. However, the magnitudes of the coefficient estimates from the 1990–1995 sub-sample are markedly smaller than those from the entire sample period reported in Table 2, while those from the 1996–2001 sub-sample are slightly larger than the corresponding coefficients in Table 2.11 A similar pattern is observed in the average coefficient estimates on the lagged absolute return variables—the estimates from the 1990–1995 sub-sample are smaller than those for the entire sample period, while some of the estimates for the 1996–2001 sub-sample are a bit larger than those for the entire sample period. The differences between the results for the two sub-samples might arise either because the period 1990–1995 was one of generally low volatility, or because the characteristics of optionable stocks changed due to the considerable growth in the number of optionable stocks during the 1990’s. In any event, it remains the case that the average coefficients for all three position gamma variables are significantly different from zero for both sub-samples. Table 6 presents the results of estimating model (11) for sub-samples of large firms and other firms, where the prior positions are those that were held τ = 5 days prior to date t. In each year a large firm is defined to be a firm that was among the 250 optionable stocks with greatest stock market capitalization as of December 31 of the previous year. In the second column the average coefficient estimate for the key variable is −0.000492 (t-statistic −3.728), similar to the 11 The finding that that estimates based on the entire sample period are not close to a simple average of those from the two subperiods should not be surprising. More stocks were optionable during the 1996-2001 time period than during the 1990-1995 period, so the computation of the mean coefficient estimates across firms has the effect of placing more weight on the 1996-2001 period. 28 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 47,
    "chunk_index": 56,
    "word_count": 380,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "those from the two subperiods should not be surprising. More stocks were optionable during the 1996-2001 time period than during the 1990-1995 period, so the computation of the mean coefficient estimates across firms has the effect of placing more weight on the 1996-2001 period. 28 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 47,
    "chunk_index": 57,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "corresponding average coefficient estimates in Tables 2, 4 and 5. Interestingly, the magnitude of the average coefficient estimate on the variable netGamma −netGamma(t−τ,S ) measuring t t t the change in position gamma stemming from new option positions is now smaller, consistent with the hypothesis that there is less volatility information trading in large stocks, though this may well be over-interpreting the differences in the point estimates. Turning to the results for the other firms in the fourth column, one can see that the magnitudes of the average coefficient estimates for the first and second position gamma variables are similar to the corresponding averages for the large firms. However, the magnitude of the average coefficient estimate on the variable netGamma −netGamma(t−τ,S ) measuring the change in position gamma stemming t t t from new option positions is now larger, consistent with the hypothesis that there is more volatility information trading in smaller stocks. However, again this may be over-interpreting the differences in the point estimates. Regardless, the results in Table 6 indicate that the effect of hedge rebalancing of stock return volatility is found in both large and small firms. Section 4.5 Robustness to choice of lag length τ and use of the Black-Scholes gammas The primary results in Table 2 are based on a choice of τ = 5 days in constructing the prior option positions. Such a choice is inherently somewhat arbitrary. Those results also are based on option gammas from the Black-Scholes model, a simplification. This subsection presents evidence that the results are robust to different choices. Table 7 reports the results of re-estimating the regressions from Table 2, but now defining the prior option positions to be those that existed τ = 10 days previously. Following the format of Table 2, the second and third columns headed “Market Maker Positions” present the averages of the coefficient estimates from the stock time-series regressions and the 29 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 47,
    "chunk_index": 58,
    "word_count": 324,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "defining the prior option positions to be those that existed τ = 10 days previously. Following the format of Table 2, the second and third columns headed “Market Maker Positions” present the averages of the coefficient estimates from the stock time-series regressions and the 29 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 47,
    "chunk_index": 59,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "corresponding standard errors assuming market makers are the delta hedgers, while the fourth and fifth columns headed “Market Maker plus Firm Proprietary Positions” provide the results assuming that both market makers and firm proprietary traders delta hedge their option positions. Comparing the average coefficient estimates for the position gamma variables shown in Table 7 to the corresponding averages in Table 2, one can see that the results are very similar. For example, in the second columns the average coefficient on the key variable netGamma(t −τ,S )−netGamma(t −τ,S ) changes from −0.000543 (t-statistic = −7.624) to t t t t−τ −0.000484 (t-statistic = −8.052), while in the fourth columns the average coefficient on this variable changes from −0.000476 (t-statistic = −6.861) to −0.000418 (t-statistic = −7.359). In addition, the average coefficient estimates for the absolute return variables are almost unchanged. Unreported results based on a lag length of τ = 3 days are also similar to those for the lag length of τ = 5 days reported in Table 2. The averages of the coefficients on the second gamma variable netGamma (t−τ,S )are t t−τ virtually unchanged, going from −0.000599 and −0.000534 in the second and fourth columns of Table 2 to −0.000575 and −0.000507 in the second and fourth columns of Table 7, respectively. This lack of change in the coefficient estimates when the lag τ is increased from 5 to 10 days suggests that option positions established between t – 10 and t – 5 contain little private information about |r |. Among the position gamma variables the largest change occurs in the t+1 average coefficient estimate on the variable netGamma −netGamma(t−τ,S ), which changes t t t from −0.001085 to −0.000851 for the case of “Market Maker Positions” and from −0.000950 to −0.000742 for the case of “Market Maker plus Firm Proprietary Positions.” This variable measures the component of the net gamma on day t that is due to option positions established 30 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 47,
    "chunk_index": 60,
    "word_count": 330,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "−0.001085 to −0.000851 for the case of “Market Maker Positions” and from −0.000950 to −0.000742 for the case of “Market Maker plus Firm Proprietary Positions.” This variable measures the component of the net gamma on day t that is due to option positions established 30 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 47,
    "chunk_index": 61,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "after t – τ, and the average estimated coefficient reflects the fact that traders with information about |r | might open new option positions during the period between t – τ and t. The t+1 reduction in the magnitude of the average estimated coefficient when the lag τ is increased from five to ten days also suggests that option trades between t – 10 and t – 5 contain much less information about |r | than do option trades between t – 5 and t. Regardless of these t+1 interpretations about the information contained in the second and third gamma variables, the important finding in Table 7 is that the average coefficient estimate on the first position gamma variable is little affected by increasing the lag τ from five to ten days. As mentioned above, the option position gammas that underlie the results in Tables 2–7 were computed using Black-Scholes gammas for the options that constitute the positions. Table 8 addresses the issue of whether the results are robust to using different estimates of individual option gammas in computing the position gammas. The regressions for which results are reported in Table 8 use position gammas that are computed using option gammas taken from the OptionMetrics Ivy DB database when they are available, and Black-Scholes gammas when OptionMetrics gammas are not available. OptionMetrics computes gammas using standard industry practices: it uses the binomial model to capture the possibility of early exercise of American options, the actual implied volatility of the option for which the gamma is being computed, the term structure of interest rates, and estimates of the dividend yield on the underlying stock and the future ex-dividend dates (OptionMetrics LLC 2005, pp. 27–28). Thus the OptionMetrics gammas capture both the American feature of exchange-traded individual equity options and the dependence of option implied volatilities on the option strike price and time to expiration. A limitation of the OptionMetrics gammas is that they are not always available. First, options that are well away-from-the-money frequently have quoted prices that 31 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 47,
    "chunk_index": 62,
    "word_count": 343,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "exchange-traded individual equity options and the dependence of option implied volatilities on the option strike price and time to expiration. A limitation of the OptionMetrics gammas is that they are not always available. First, options that are well away-from-the-money frequently have quoted prices that 31 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 47,
    "chunk_index": 63,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "violate elementary arbitrage bounds. In such cases (specifically, when the bid-ask average violates elementary arbitrage bounds) OptionMetrics is unable to compute the implied volatility, and thus is unable to compute the option gamma. For our purposes this problem is not important, because the gammas of away-from-the-money options tend to be small regardless of the option-pricing model used to compute them, and we can safely use Black-Scholes gammas in such cases. Second, the OptionMetrics data begin only in 1996, and thus are not available during the first half of our sample period of 1990–2001. However, this problem is not as severe as it might seem at first glance because the number of optionable stocks grew rapidly during the 1990’s. Thus, most of our sample is from 1996 and later. Table 8 presents the average coefficient estimates for the stock time-series regressions and the corresponding standard errors for the two cases in which either market makers or market makers plus firm proprietary traders are assumed to delta hedge their option positions using data from 1996–2001, the period for which the OptionMetrics gammas are available. The results for market makers in the second and third columns of Table 8 correspond to the results for the 1996– 2001 sub-sample in the fourth and fifth columns of Table 5. Comparing the average coefficient estimates for the gamma variables displayed in Table 8 to the corresponding averages in Table 5, one sees that the results are similar. For example, the average coefficient on the variable netGamma(t −τ,S )−netGamma(t −τ,S ) changes from −0.000600 (t-statistic = −7.800) to t t t t−τ −0.000507 (t-statistic = −12.863). The estimates for the lagged return variables are also only slightly different. The fourth and fifth columns of Table 8 present results for Market Makers plus Firm Proprietary traders, and also are consistent with previous results. These results suggest that our use of the Black-Scholes model to compute the option gammas does not introduce any important errors in the regression results. 32 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 47,
    "chunk_index": 64,
    "word_count": 336,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "of Table 8 present results for Market Makers plus Firm Proprietary traders, and also are consistent with previous results. These results suggest that our use of the Black-Scholes model to compute the option gammas does not introduce any important errors in the regression results. 32 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "4. Results",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 65,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4. Results (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "We have documented that there is a significant negative relationship between stock return volatility and the net gammas of the option positions of the option market participants likely to engage in delta hedging of their option positions. This relationship is consistent with both intuitive reasoning and theoretical models implying that rebalancing of option hedges should affect stock return volatility. In addition to being statistically significant, the relation is also economically significant. We estimate that on the order of 12 percent of the daily absolute return of optioned stocks can be accounted for by option market participants re-balancing the stock hedges of their option positions. Furthermore, the re-balancing is estimated to alter the probability of daily absolute stock returns greater than 300 (500) basis points by 11 (18) percent. The negative relationship is found in both large and small capitalization optioned stocks and is not restricted to the option expiration week. To our knowledge, these results constitute the first evidence that the option markets have a pervasive influence on underlying stock prices. The previous systematic evidence of stock price clustering related to option trading in Ni, Pearson, and Poteshman (2005) was limited to option expiration Fridays and the preceding trading day. Our results show that hedge rebalancing has substantial impact on the prices of optioned stocks at all times. 33 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "5. Conclusion",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 47,
    "chunk_index": 66,
    "word_count": 224,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5. Conclusion (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "evidence of stock price clustering related to option trading in Ni, Pearson, and Poteshman (2005) was limited to option expiration Fridays and the preceding trading day. Our results show that hedge rebalancing has substantial impact on the prices of optioned stocks at all times. 33 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 47,
    "chunk_index": 67,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Avellaneda, Marco and Michael D. Lipkin, 2003, A market-induced mechanism for stock pinning. Quantitative Finance 3, 417–425. Bansal, V. K., S. W. Pruitt, and K. C. J. Wei, 1989, An empirical examination of the impact of CBOE option initiation on the volatility and trading volume of the underlying equities: 1973-1986, Financial Review 24, 19–29. Barclay, M. J., T. Hendershott, and C. M. Jones, 2006, Order consolidation, price efficiency, and extreme liquidity shocks, working paper, University of Rochester. Bessembinder, H. and P. J. Seguin, 1992, Futures-trading activity and stock price volatility, Journal of Finance 47, no. 5, 2015–2034. Bollen, N. P. B., 1998, A note on the impact of options on stock return volatility, Journal of Banking and Finance 22, 1181–1191. Cetin, U., R. Jarrow, P. Protter, and M. Warachka, 2006, Pricing options in an extended Black- Scholes economy with illiquidity: Theory and empirical evidence, Review of Financial Studies 19, No. 2, 493–529. Chang, Y., D. McManus, and B. Ramagopal, 2005, Does mortgage hedging raise long-term interest rate volatility?, Journal of Fixed Income 15 (March), 57–66. Chicago Board Options Exchange, 1976, Analysis of volume and price patterns in stocks underlying CBOE options from December 30, 1974 to April 30, 1975, Chicago Board Options Exchange. Cinar, E. Mine, and Joseph Vu, 1987, Evidence on the effect of option expirations on stock prices, Financial Analysts Journal 43, 55-57. Conrad, Jennifer, 1989, The price effect of option introduction, Journal of Finance 44, 487-498. Cox, John C., and Mark Rubinstein, 1985, Options Markets, (Prentice-Hall, Englewood Cliffs, NJ). Detemple, Jerome, and Philippe Jorion, 1990, Option listing and stock returns: An empirical analysis, Journal of Banking and Finance 14, 781–801. Freund, Steven P., Douglas McCann, and Gwendolyn P. Webb, 1994, A regression analysis of the effects of option introductions on stock variances, Journal of Derivatives 1, 25–38. Frey, R., 1998, Perfect option hedging for a large trader, Finance and Stochastics 2, 115-141. Frey, R., 2000, Market Illiquidity as a Source of Model Risk, in Dynamic Hedging in R. Gibson, ed.: Model Risk (RISK Publications, London). 34 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 47,
    "chunk_index": 68,
    "word_count": 344,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "variances, Journal of Derivatives 1, 25–38. Frey, R., 1998, Perfect option hedging for a large trader, Finance and Stochastics 2, 115-141. Frey, R., 2000, Market Illiquidity as a Source of Model Risk, in Dynamic Hedging in R. Gibson, ed.: Model Risk (RISK Publications, London). 34 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 47,
    "chunk_index": 69,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Frey, R. and A. Stremme, 1997, Market volatility and feedback effects from dynamic hedging, Mathematical Finance 7, No. 4, 351–374. Gulen, H. and S. Mayhew, 2000, Stock index futures trading and volatility in international equity markets, Journal of Futures Markets 20, no. 7, 661–685. Ho, Li Chin Jennifer and Chao Shin Liu, 1997, A reexamination of price behavior surrounding option introduction, Quarterly Journal of Business and Economics 36, 39–50. Hull, John C., 2003, Options, Futures, and Other Derivatives, Fifth Edition, (Prentice-Hall, Upper Saddle River, NJ). Jarrow, R., 1994, Derivatives securities markets, market manipulation, and option pricing theory, Journal of Financial and Quantitative Analysis 29, 241–261. Khambu, J., 1998, Dealers’ hedging of interest rate options in the U.S. dollar fixed-income market, FRBNY Economic Policy Review 4, No. 2 (June), 35–75. Khambu, J., and P. C. Mosser, 2004, The effect of interest rate options hedging on term-structure dynamics, FRBNY Economic Policy Review 10, No. 4 (December), 51–70. Klemkosky, R. C., 1978, The impact of option expirations on stock prices, Journal of Financial and Quantitative Analysis 13, 507–518. Lakonishok, Josef, Inmoo Lee, Neil D. Pearson, and Allen M. Poteshman, 2006, Option market activity, Review of Financial Studies, forthcoming. Lamoureux, Christopher and Sunil K. Panikkath, 1994, Variations in stock returns: Asymmetries and other patterns, Working paper. Lundstrum, L. L. and M. D. Walker, 2006, LEAPS introductions and the value of the underlying stocks, Journal of Financial Intermediation 15, No. 4, 494–510. Mayhew, Stewart, and Vassil Mihov, 2004, Short sale constraints, overvaluation, and the introduction of options, Working paper, University of Georgia and Texas Christian University. McDonald, Robert L., 2006, Derivatives Markets, Second Edition, (Pearson Education, Boston, MA). Ni, Sophie Xiaoyan, Jun Pan, and Allen M. Poteshman, 2006, Volatility information trading in the option market, Working paper, University of Illinois at Urbana-Champaign. Ni, Sophie Xiaoyan, Neil D. Pearson, and Allen M. Poteshman, 2005, Stock price clustering on option expiration dates, Journal of Financial Economics 78, 49–87. 35 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 47,
    "chunk_index": 70,
    "word_count": 327,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Pan, and Allen M. Poteshman, 2006, Volatility information trading in the option market, Working paper, University of Illinois at Urbana-Champaign. Ni, Sophie Xiaoyan, Neil D. Pearson, and Allen M. Poteshman, 2005, Stock price clustering on option expiration dates, Journal of Financial Economics 78, 49–87. 35 Electronic copy available at: https://ssrn.com/abstract=970592 OptionMetrics LLC, 2005, Ivy DB File and Data Reference Manual (version 2.5) Perli, R. and B. Sack, 2003, Does mortgage hedging amplify movements in long-term interest rates?, Journal of Fixed Income 13, No. 3 (December), 7–17. Platen E. and M. Schweizer, 1998, On feedback effects from hedging derivatives, Mathematical Finance 8, 67–84. Schönbucher, P. J. and P. Wilmott, 2000, The feedback effects of hedging in illiquid markets, SIAM Journal on Applied Mathematics 61, 232–272. Schwert, G. W. and P. Seguin, 1990, Heteroskedasticity in stock returns, Journal of Finance 45, 1129–1155. Sircar, K. R. and G. Papanicolaou, 1998, Generalized Black-Scholes models accounting for increased market volatility from hedging strategies, Applied Mathematical Finance 5, No. 1, 45–82. Skinner, D., 1989, Options markets and stock return volatility, Journal of Financial Economics 23, 61–78. Sorescu, S. M., 2000, The effect of options on stock prices: 1973 to 1995, Journal of Finance 55, 487–514. Srivastava, V. K., and D. E. A. Giles, 1987, Seemingly Unrelated Regression Equations Models: Estimation and Inference, (Marcel Dekker, New York, NY). Whaley, R. E., 2003, Derivatives, in G. M. Constantinides, M. Harris, and R. Stulz, eds.: Handbook of the Economics of Finance (Elsevier Science B.V). 36 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 47,
    "chunk_index": 71,
    "word_count": 251,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "K., and D. E. A. Giles, 1987, Seemingly Unrelated Regression Equations Models: Estimation and Inference, (Marcel Dekker, New York, NY). Whaley, R. E., 2003, Derivatives, in G. M. Constantinides, M. Harris, and R. Stulz, eds.: Handbook of the Economics of Finance (Elsevier Science B.V). 36 Electronic copy available at: https://ssrn.com/abstract=970592 0.035 0.034 0.033 0.032 0.031 0.03 0.029 0.028 0.027 0.026 0.025 1 2 3 4 5 6 7 8 9 10 (Low) (High) Bins of Normalized Market Maker Net Gamma nruteR yaD txeN etulosbA naeM Figure 1. Normalized market maker net gamma is computed every day for every underlying stock that has at least 200 trade days of data over the 1990-2001 time period. The normalized market maker gamma for each underlying stock is then sorted into ten bins of equal size and the average next day stock return is computed for each bin. This figure depicts the results for each bin of averaging this quantity across underlying stocks. Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39-40",
    "total_pages": 47,
    "chunk_index": 72,
    "word_count": 164,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39-40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "The normalized market maker gamma for each underlying stock is then sorted into ten bins of equal size and the average next day stock return is computed for each bin. This figure depicts the results for each bin of averaging this quantity across underlying stocks. Electronic copy available at: https://ssrn.com/abstract=970592 Table 1 Descriptive Statistics This table reports means, standard deviations, extrema, and quantiles for the variables used in the estimated models. The descriptive statistics are first calculated for each underlying stock and then the averages across the underlying stocks are reported. Quantiles Std. Mean Dev. Min 0.01 0.05 0.1 0.25 0.5 0.75 0.9 0.95 0.99 Max |r| 0.031 0.032 0.000 0.000 0.001 0.003 0.010 0.022 0.041 0.067 0.088 0.149 0.310 netGamma, non-normalized: Market Maker 9,933 19,058 −56,690 −28,258 −12,758 −6,995 −63 6,967 17,075 31,582 42,736 69,326 128,513 netGamma, non-normalized: Market Maker + Firm Proprietary 12,014 22,667 −62,425 −31,921 −14,127 −7,328 405 8,279 19,833 36,802 50,115 84,638 160,071 netGamma, normalized: Market Maker 3.106 6.772 −22.536 −11.651 −5.488 −3.151 −0.379 2.157 5.867 10.837 14.589 23.937 43.307 netGamma, normalized: Market Maker + Firm Proprietary 3.359 7.588 −25.773 −13.624 −6.284 −3.475 −0.421 2.367 6.332 11.782 15.962 26.541 47.477 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 47,
    "chunk_index": 73,
    "word_count": 199,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "−7,328 405 8,279 19,833 36,802 50,115 84,638 160,071 netGamma, normalized: Market Maker 3.106 6.772 −22.536 −11.651 −5.488 −3.151 −0.379 2.157 5.867 10.837 14.589 23.937 43.307 netGamma, normalized: Market Maker + Firm Proprietary 3.359 7.588 −25.773 −13.624 −6.284 −3.475 −0.421 2.367 6.332 11.782 15.962 26.541 47.477 Electronic copy available at: https://ssrn.com/abstract=970592 Table 2 Regressions of Absolute Return on Components of Net Position Gammas, τ = 5 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas and lagged returns using data from the period 1990–2001, where the prior positions are those that were held τ = 5 days prior to date t. The model is estimated for the trader groups Market Makers and Market Makers plus Firm Proprietary traders, whose positions together comprise all positions of non-public traders. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported in parentheses next to the average coefficient estimates. Marker Maker + Firm Market Maker Positions Proprietary Positions Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.020 (68.558) 0.020 (68.606) netGamma (t−τ,S ) t t −0.000543 (−7.624) −0.000476 (−6.861) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000599 (−18.834) −0.000534 (−18.005) t t netGamma t −0.001085 (−17.369) −0.000950 (−16.043) −netGamma (t−τ,S ) t t |r| 0.126 (45.968) 0.127 (46.082) t |r | 0.051 (16.654) 0.051 (16.706) t−1 |r | 0.038 (14.950) 0.038 (15.082) t−2 |r | 0.026 (13.540) 0.027 (13.613) t−3 |r | 0.034 (12.769) 0.035 (12.866) t−4 |r | 0.023 (10.259) 0.023 (10.299) t−5 |r | 0.022 (11.774) 0.022 (11.827) t−6 |r | 0.021 (8.819) 0.022 (8.831) t−7 |r | 0.021 (11.215) 0.021 (11.285) t−8 |r | 0.021 (10.909) 0.022 (10.964) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 47,
    "chunk_index": 74,
    "word_count": 327,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.027 (13.613) t−3 |r | 0.034 (12.769) 0.035 (12.866) t−4 |r | 0.023 (10.259) 0.023 (10.299) t−5 |r | 0.022 (11.774) 0.022 (11.827) t−6 |r | 0.021 (8.819) 0.022 (8.831) t−7 |r | 0.021 (11.215) 0.021 (11.285) t−8 |r | 0.021 (10.909) 0.022 (10.964) t−9 Electronic copy available at: https://ssrn.com/abstract=970592 Table 3 Large Return Regression This table contains the results of estimating model (11) with the dependent variable replaced by an indicator for absolute returns in excess of 3%, in the left column, and 5%, in the right column. Gamma variables correspond to market-maker positions. The reported coefficient estimates are the averages of coefficients from OLS regressions for individual stocks. Standard errors for this cross-sectional average are constructed from a variance-covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported in parentheses next to the average coefficient estimates. |r | > 0.03 |r | > 0.05 t+1 t+1 Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.221 (71.574) 0.0875 (32.977) netGamma (t−τ,S ) t t −0.0047 (−6.427) −0.0038 (−5.995) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.0057 (−15.875) −0.0052 (−17.027) t t netGamma t −0.0080 (−9.187) −0.0088 (−14.816) −netGamma (t−τ,S ) t t |r| 1.532 (50.860) 1.078 (41.036) t |r | 0.706 (21.933) 0.457 (17.442) t−1 |r | 0.508 (17.111) 0.336 (13.004) t−2 |r | 0.373 (15.063) 0.226 (11.896) t−3 |r | 0.475 (14.461) 0.310 (11.111) t−4 |r | 0.296 (11.437) 0.210 (9.668) t−5 |r | 0.313 (12.187) 0.207 (10.455) t−6 |r | 0.311 (12.385) 0.178 (8.393) t−7 |r | 0.312 (12.140) 0.201 (10.173) t−8 |r | 0.314 (12.931) 0.180 (9.717) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 47,
    "chunk_index": 75,
    "word_count": 277,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.226 (11.896) t−3 |r | 0.475 (14.461) 0.310 (11.111) t−4 |r | 0.296 (11.437) 0.210 (9.668) t−5 |r | 0.313 (12.187) 0.207 (10.455) t−6 |r | 0.311 (12.385) 0.178 (8.393) t−7 |r | 0.312 (12.140) 0.201 (10.173) t−8 |r | 0.314 (12.931) 0.180 (9.717) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 47,
    "chunk_index": 76,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Table 4 Regressions of Absolute Return on Components of Net Position Gammas Omitting Observations from Option Expiration Weeks, τ = 5 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas and lagged returns using data from the period 1990–2001, where all observations from the week of option expiration are omitted and the prior positions are those that were held τ = 5 days prior to date t. The model is estimated for the trader groups Market Makers and Market Makers plus Firm Proprietary traders, whose positions together comprise all positions of non-public traders. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported in parentheses next to the average coefficient estimates. Marker Maker + Firm Market Maker Positions Proprietary Positions Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.020 (65.666) 0.020 (65.827) netGamma (t−τ,S ) t t −0.000535 (−5.451) −0.000455 (−4.834) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000558 (−16.288) −0.000480 (−15.829) t t netGamma t −0.001058 (−14.382) −0.000930 (−13.777) −netGamma (t−τ,S ) t t |r| 0.127 (40.285) 0.127 (40.405) t |r | 0.050 (16.323) 0.051 (16.381) t−1 |r | 0.037 (13.978) 0.038 (14.104) t−2 |r | 0.026 (11.819) 0.026 (11.949) t−3 |r | 0.032 (12.779) 0.032 (12.895) t−4 |r | 0.025 (9.617) 0.025 (9.674) t−5 |r | 0.024 (11.224) 0.024 (11.256) t−6 |r | 0.021 (9.698) 0.021 (9.777) t−7 |r | 0.024 (10.948) 0.024 (10.983) t−8 |r | 0.023 (11.114) 0.023 (11.148) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 47,
    "chunk_index": 77,
    "word_count": 294,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.026 (11.949) t−3 |r | 0.032 (12.779) 0.032 (12.895) t−4 |r | 0.025 (9.617) 0.025 (9.674) t−5 |r | 0.024 (11.224) 0.024 (11.256) t−6 |r | 0.021 (9.698) 0.021 (9.777) t−7 |r | 0.024 (10.948) 0.024 (10.983) t−8 |r | 0.023 (11.114) 0.023 (11.148) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 47,
    "chunk_index": 78,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Table 5 Regressions of Absolute Return on Components of Net Position Gammas For the Periods 1990–1995 and 1996–2001, τ = 5 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas and lagged returns for the subperiods 1990–1995 and 1996–2001, where the prior positions are those that were held τ = 5 days prior to date t. The model is estimated for the trader group Market Makers. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported in parentheses next to the average coefficient estimates. 1990–1995 1996–2001 Variable Coefficient t-Statistic Coefficient t-Statistic Constant 0.016 (101.211) 0.021 (62.814) netGamma (t−τ,S ) t t −0.000149 (−3.302) −0.000600 (−7.800) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000247 (−6.971) −0.000652 (−19.549) t t netGamma t −0.000303 (−3.996) −0.001254 (−19.337) −netGamma (t−τ,S ) t t |r| 0.109 (46.941) 0.126 (39.363) t |r | 0.041 (17.624) 0.051 (14.748) t−1 |r | 0.022 (11.330) 0.038 (13.533) t−2 |r | 0.020 (9.646) 0.026 (11.588) t−3 |r | 0.019 (9.454) 0.036 (11.551) t−4 |r | 0.014 (6.778) 0.023 (9.158) t−5 |r | 0.013 (6.684) 0.022 (10.391) t−6 |r | 0.009 (5.075) 0.022 (7.865) t−7 |r | 0.011 (6.054) 0.022 (10.052) t−8 |r | 0.013 (6.889) 0.021 (9.483) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 47,
    "chunk_index": 79,
    "word_count": 260,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.026 (11.588) t−3 |r | 0.019 (9.454) 0.036 (11.551) t−4 |r | 0.014 (6.778) 0.023 (9.158) t−5 |r | 0.013 (6.684) 0.022 (10.391) t−6 |r | 0.009 (5.075) 0.022 (7.865) t−7 |r | 0.011 (6.054) 0.022 (10.052) t−8 |r | 0.013 (6.889) 0.021 (9.483) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 47,
    "chunk_index": 80,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Table 6 Regressions of Absolute Return on Components of Net Position Gammas for Subsamples of Large Firms and Other Firms, τ = 5 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas and lagged returns for the subsamples of large firms and other firms, where the prior positions are those that were held τ = 5 days prior to date t. In each year a large firm is defined to be a firm that was among the 250 optionable stocks with greatest market capitalization as of December 31 of the previous year. The model is estimated for the trader group Market Makers. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported next to the average coefficient estimates. Large Firms All Other Firms Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.016 (39.801) 0.021 (71.225) netGamma (t−τ,S ) t t −0.000492 (−3.728) −0.000565 (−6.032) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000655 (−8.481) −0.000590 (−17.959) t t netGamma t −0.000668 (−4.644) −0.001199 (−18.574) −netGamma (t−τ,S ) t t |r| 0.100 (19.913) 0.128 (48.267) t |r | 0.048 (10.547) 0.050 (16.698) t−1 |r | 0.036 (7.890) 0.037 (15.644) t−2 |r | 0.031 (7.976) 0.025 (13.453) t−3 |r | 0.037 (7.695) 0.032 (12.792) t−4 |r | 0.028 (6.134) 0.021 (10.025) t−5 |r | 0.024 (6.187) 0.021 (11.807) t−6 |r | 0.023 (5.281) 0.020 (8.603) t−7 |r | 0.024 (6.393) 0.021 (11.255) t−8 |r | 0.024 (6.414) 0.021 (10.704) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 47,
    "chunk_index": 81,
    "word_count": 297,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.025 (13.453) t−3 |r | 0.037 (7.695) 0.032 (12.792) t−4 |r | 0.028 (6.134) 0.021 (10.025) t−5 |r | 0.024 (6.187) 0.021 (11.807) t−6 |r | 0.023 (5.281) 0.020 (8.603) t−7 |r | 0.024 (6.393) 0.021 (11.255) t−8 |r | 0.024 (6.414) 0.021 (10.704) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 47,
    "chunk_index": 82,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Table 7 Regressions of Absolute Return on Components of Net Position Gammas, τ = 10 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas and lagged returns using data from the period 1990–2001, where the prior positions are those that were held τ = 10 days prior to date t. The model is estimated for the trader groups Market Makers and Market Makers plus Firm Proprietary traders, whose positions together comprise all positions of non-public traders. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a variance-covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported next to the averages of the coefficient estimates. Marker Maker + Firm Market Maker Positions Proprietary Positions Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.020 (69.872) 0.020 (69.652) netGamma (t−τ,S ) t t −0.000484 (−8.052) −0.000418 (−7.359) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000575 (−15.260) −0.000507 (−14.571) t t netGamma t −0.000851 (−18.821) −0.000742 (−17.126) −netGamma (t−τ,S ) t t |r| 0.126 (45.767) 0.126 (45.862) t |r | 0.051 (17.015) 0.051 (17.020) t−1 |r | 0.037 (15.174) 0.037 (15.270) t−2 |r | 0.025 (12.994) 0.026 (13.076) t−3 |r | 0.032 (12.215) 0.032 (12.290) t−4 |r | 0.022 (9.904) 0.023 (9.949) t−5 |r | 0.022 (11.694) 0.022 (11.764) t−6 |r | 0.021 (8.710) 0.021 (8.751) t−7 |r | 0.021 (11.766) 0.022 (11.826) t−8 |r | 0.023 (11.538) 0.023 (11.534) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 47,
    "chunk_index": 83,
    "word_count": 277,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.026 (13.076) t−3 |r | 0.032 (12.215) 0.032 (12.290) t−4 |r | 0.022 (9.904) 0.023 (9.949) t−5 |r | 0.022 (11.694) 0.022 (11.764) t−6 |r | 0.021 (8.710) 0.021 (8.751) t−7 |r | 0.021 (11.766) 0.022 (11.826) t−8 |r | 0.023 (11.538) 0.023 (11.534) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 47,
    "chunk_index": 84,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "Table 8 Regressions of Absolute Return on Components of Net Position Gammas Using Alternative Estimates of Option Gammas for the Period 1996–2001, τ = 5 days This table presents the results of estimating model (11) expressing the absolute return |r | in t+1 terms of the components of the normalized net position gammas based on option gammas from OptionMetrics and lagged returns using data from the period 1996–2001, where the prior positions are those that were held τ = 5 days prior to date t. The model is estimated for the trader groups Market Makers and Market Makers plus Firm Proprietary traders, whose positions together comprise all positions of non-public traders. The second and fourth columns report the average coefficient estimates from OLS regressions for individual stocks. Standard errors for the cross-sectional averages are constructed from a covariance matrix for all coefficients, which is formed by clustering observations by date. The t-statistics associated with these standard errors are reported next to the average coefficient estimates. Market Maker + Firm Market Maker Positions Proprietary Positions Variable Coefficient t-Statistic Coefficient t-Statistic constant 0.021 (61.281) 0.021 (61.690) netGamma (t−τ,S ) t t −0.000507 (−12.863) −0.000441 (−12.201) −netGamma (t−τ,S ) t t−τ netGamma(t−τ,S ) −0.000596 (-20.246) −0.000514 (−19.353) t t netGamma t −0.001089 (−20.083) −0.000938 (−18.953) −netGamma (t−τ,S ) t t |r| 0.123 (36.657) 0.123 (36.780) t |r | 0.051 (14.298) 0.051 (14.338) t−1 |r | 0.037 (12.752) 0.037 (12.818) t−2 |r | 0.025 (10.924) 0.026 (11.007) t−3 |r | 0.035 (10.982) 0.035 (11.024) t−4 |r | 0.023 (8.499) 0.023 (8.535) t−5 |r | 0.023 (10.503) 0.023 (10.520) t−6 |r | 0.021 (7.610) 0.021 (7.624) t−7 |r | 0.022 (10.116) 0.022 (10.159) t−8 |r | 0.021 (9.407) 0.021 (9.426) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 47,
    "chunk_index": 85,
    "word_count": 291,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  },
  {
    "text": "0.026 (11.007) t−3 |r | 0.035 (10.982) 0.035 (11.024) t−4 |r | 0.023 (8.499) 0.023 (8.535) t−5 |r | 0.023 (10.503) 0.023 (10.520) t−6 |r | 0.021 (7.610) 0.021 (7.624) t−7 |r | 0.022 (10.116) 0.022 (10.159) t−8 |r | 0.021 (9.407) 0.021 (9.426) t−9 Electronic copy available at: https://ssrn.com/abstract=970592",
    "title": "Does Option Trading Impact Underlying Stock Prices",
    "source_type": "pdf",
    "document_id": "942ecef557de",
    "source_file": "Does Option Trading Have a Pervasive Impact on Underlying Stock Prices..pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 47,
    "chunk_index": 86,
    "word_count": 50,
    "author": "poteshma",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20070223144749-06'00'",
    "duration": null
  }
]