[
  {
    "text": "Finance and Economics Discussion Series Divisions of Research & Statistics and Monetary Affairs Federal Reserve Board, Washington, D.C. Downside Variance Risk Premium Bruno Feunou, Mohammad R. Jahan-Parvar and Cedric Okou 2015-020 Please cite this paper as: Bruno Feunou, Mohammad R. Jahan-Parvar and Cedric Okou (2015). “Downside Variance Risk Premium,” Finance and Economics Discussion Series 2015-020. Washington: Board of Governors of the Federal Reserve System, http://dx.doi.org/10.17016/FEDS.2015.020. NOTE: Staff working papers in the Finance and Economics Discussion Series (FEDS) are preliminary materials circulated to stimulate discussion and critical comment. The analysis and conclusions set forth are those of the authors and do not indicate concurrence by other members of the research staff or the Board of Governors. References in publications to the Finance and Economics Discussion Series (other than acknowledgement) should be cleared with the author(s) to protect the tentative character of these papers.",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 66,
    "chunk_index": 0,
    "word_count": 142,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "forth are those of the authors and do not indicate concurrence by other members of the research staff or the Board of Governors. References in publications to the Finance and Economics Discussion Series (other than acknowledgement) should be cleared with the author(s) to protect the tentative character of these papers.",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 66,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Bruno Feunou∗ Mohammad R. Jahan-Parvar† C´edric Okou‡§ Bank of Canada Federal Reserve Board UQAM March 2015 Abstract We propose a new decomposition of the variance risk premium in terms of upside and downside variance risk premia. The difference between upside and downside variance risk premia is a measureofskewnessriskpremium. Weestablishthatthedownsidevarianceriskpremiumisthe main component of the variance risk premium, and that the skewness risk premium is a priced factorwithsignificantpredictionpowerforaggregateexcessreturns. Ourempiricalinvestigation highlightsthepositiveandsignificantlinkbetweenthedownsidevarianceriskpremiumandthe equitypremium,aswellasapositiveandsignificantrelationbetweentheskewnessriskpremium andtheequitypremium. Finally,wedocumentthefactthattheskewnessriskpremiumfillsthe time gap between one quarter ahead predictability, delivered by the variance risk premium as a shorttermpredictorofexcessreturnsandtraditionallongtermpredictorssuchasprice-dividend or price-earning ratios. Our results are supported by a simple equilibrium consumption-based asset pricing model. Keywords: Risk-neutral volatility, Realized volatility, Downside and upside variance risk premium, Skew- ness risk premium JEL Classification: G12 ∗Bank of Canada, 234 Wellington St., Ottawa, Ontario, Canada K1A 0G9. Email: feun@bankofcanada.ca. †Corresponding Author: Federal Reserve Board, 20th Street and Constitution Avenue NW, Washington, DC 20551 United States. E-mail: Mohammad.Jahan-Parvar@frb.gov ‡E´coledesSciencesdelaGestion,UniversityofQuebecatMontreal,315Sainte-CatherineStreetEast,Montreal, Quebec, Canada H2X 3X2. Email: okou.cedric@uqam.ca §We thank seminar participants at the Federal Reserve Board, Johns Hopkins Carey Business School, Midwest Econometric Group Meeting 2013, Manchester Business School, CFE 2013, and SNDE 2014. We are grateful for conversations with Diego Amaya, Sirio Aramonte, Federico Bandi, Nicola Fusari, Hening Liu, Olga Kolokolova, BruceMizrach,MarenHansen,Yang-HoPark,andAlexTaylor. WethankJamesPinningtonforresearchassistance. We also thank Bryan Kelly and Seth Pruitt for sharing their cross-sectional book-to-market index data. The views expressed in this paper are those of the authors. No responsibility for them should be attributed to the Bank of Canada or the Federal Reserve Board. Remaining errors are ours.",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 66,
    "chunk_index": 2,
    "word_count": 252,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Kolokolova, BruceMizrach,MarenHansen,Yang-HoPark,andAlexTaylor. WethankJamesPinningtonforresearchassistance. We also thank Bryan Kelly and Seth Pruitt for sharing their cross-sectional book-to-market index data. The views expressed in this paper are those of the authors. No responsibility for them should be attributed to the Bank of Canada or the Federal Reserve Board. Remaining errors are ours.",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 66,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "1 Introduction In contrast to the traditional efficient-market hypothesis prediction that market returns are unpre- dictable, current asset pricing research accepts that equity market returns are largely predictable over long horizons. A number of recent studies have additionally argued that the variance risk premium – the difference between option-implied and realized variance – yields superior forecasts for stock market returns over shorter, within-year horizons (typically one quarter ahead). Exam- ples of these studies include, among others, Bollerslev, Tauchen, and Zhou (2009); Drechsler and Yaron(2011); andKellyandJiang(2014). Bollerslev,Tauchen,andZhou(2009)(henceforth,BTZ) show that the variance risk premium explains a nontrivial fraction of the time-series variation in aggregate stock market returns, and that high (low) variance risk premia predict high (low) future returns. Drawing on the intuition that investors like good uncertainty – as it increases the potential of substantial gains – but dislike bad uncertainty – as it increases the likelihood of severe losses – we propose a new decomposition of the variance risk premium (VRP), expressed in terms of upside and downside variance risk premia (VRPU and VRPD).1 We show that this decomposition a) identifies the main sources of return predictability uncovered by BTZ and b) characterizes the role oftheskewnessriskpremium(SRP)–measuredthroughthedifferencebetweenVRPU andVRPD – in predicting aggregate stock market returns. We find that on average, and similar to results in Kozhan, Neuberger, and Schneider (2014), over 80% of the VRP is compensation for bearing changesindownsiderisk. Inaddition,weshowthata)theVRPD explainstheempiricalregularities reported by BTZ (including the hump-shaped R2 and slope parameter patterns), b) the VRPU’s contribution to the results reported by BTZ is at best marginal, and c) there is a contribution of the SRP to the predictability of returns which takes effect beyond the one-quarter-ahead window documented by BTZ. 1We define the down(up)side variance as the realized variance of the stock market returns for negative (positive) returns, respectively. The down(up)side variance risk premium is the difference between option-implied and realized down(up)sidevariance. DecomposingvarianceinthiswayispioneeredbyBarndorff-Nielsen,Kinnebrock,andShep- hard(2010),andsuccessfullyusedinempiricalstudiesbyFeunou,Jahan-Parvar,andT´edongap(2013,2014),among others. In addition, we define the difference between upside and downside variances as the relative upside variance. Feunou, Jahan-Parvar, and T´edongap (2014) show that relative upside variance is a measure of skewness. Based on their work, we use the difference between option-implied and realized relative upside variances as a measure of skewness risk premium. 1",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 66,
    "chunk_index": 4,
    "word_count": 369,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the difference between upside and downside variances as the relative upside variance. Feunou, Jahan-Parvar, and T´edongap (2014) show that relative upside variance is a measure of skewness. Based on their work, we use the difference between option-implied and realized relative upside variances as a measure of skewness risk premium. 1",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 66,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "We show that the prediction power of VRPD and SRP increases over the term structure of equity returns. In addition, through extensive robustness testing, we show that this result is robust to the inclusion of a wide variety of common pricing factors. This leads to the conclusion that the in-sample predictability of aggregate returns by downside risk and skewness measures introduced hereisindependentfromothercommonpricingratiossuchastheprice-dividendratio,price-earning ratio, or default spread. Based on revealed the in-sample predictive power of these measures, we conduct out-of-sample forecast ability comparisons, and show that in comparison with VRPD and SRP, other common predictors do not have a superior forecast ability. Finally, we study the link between changes in downside variance risk and skewness risk premia and events or news related to policy uncertainty, comparable to Amengual and Xiu (2014). Theoretically, we support our findings by a simple endowment equilibrium asset pricing model, where the representative agent is endowed with Epstein and Zin (1989) preferences, and where the consumption growth process is affected by distinct upside and downside shocks. Our model shares some features with Bansal and Yaron (2004), Bollerslev, Tauchen, and Zhou (2009), Segal, Shalias- tovich, and Yaron (2015), among others. We show that under common distributional assumptions forshockstotheeconomy,wecanderivetheequityriskpremium,upsideanddownsidevariancerisk premium, and skewness risk premium in closed form. Our findings support the empirical findings presented in the paper. Similar to Colacito, Ghysels, and Meng (2014), our study is not an alternative to jump-tail risk concerns – as studied in Bollerslev and Todorov (2011a,b) – or rare disaster models,in Nakamura, Steinsson, Barro, and Ursu´a (2013). Our framework addresses asymmetries that are observed in “normal times”. However, our model is well-suited and capable of addressing regularities that emerge from a rare disaster happening, such as the Great Recession of 2007-2009. Essentially, our approach provides simple yet insightful economic intuitions supporting the joint directional and volatility jump risk of Bandi and Ren`o (2014). We show that our methodology is intuitive, easy to implement, and generates robust predictions that close the horizon gap between short term models such as BTZ and long-horizon predictive models such as Fama and French (1988), Campbell and Shiller (1988), Cochrane (1991), and Lettau and Ludvigson (2001). Our study is comprised of two natural and linked components. First, we study the role of 2",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 66,
    "chunk_index": 6,
    "word_count": 374,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "that close the horizon gap between short term models such as BTZ and long-horizon predictive models such as Fama and French (1988), Campbell and Shiller (1988), Cochrane (1991), and Lettau and Ludvigson (2001). Our study is comprised of two natural and linked components. First, we study the role of 2",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 66,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the VRPD as the main driver of the within-year predictability results documented by BTZ. In this effort, we highlight the inherent asymmetry in responses of market participants to negative and positive market outcomes. To accomplish this goal, we draw on the vast existing literature on realized and risk-neutral volatility measures and their properties, to construct nonparametric measures of up and downside realized and risk-neutral semi-variances. We then proceed to show empirically how the stylized facts documented in the VRP literature are driven almost entirely by the contribution of VRPD – the difference between realized and risk-neutral semi-variances extracted from high frequency data. As in Chang, Christoffersen, and Jacobs (2013), our approach avoids the traditional trade-off problem with estimates of higher moments from historical returns data needing long windows to increase precision but short windows to obtain conditional instead of unconditionalestimates. Second, weshowthatusingtherelativeupsidevarianceofFeunou, Jahan- Parvar, and T´edongap (2013, 2014), a nonparametric measure of skewness, we can enhance the predictivepowerofthevarianceriskpremiumtohorizonsbeyondonequarterahead.2 Additionally, we find and document the predictive power of a priced factor – the SRP – that fills the gap between the variance risk premium and common long-term equity returns predictors. Thus, we need reliable measures for realized and risk-neutral variance and skewness. A sizable portionofempiricalfinanceandfinancialeconometricsliteratureisdevotedtomeasuresofvolatility. Canonical papers focused on properties and construction of realized volatility are Andersen, Boller- slev, Diebold, and Ebens (2001a); Andersen, Bollerslev, Diebold, and Labys (2003); and Andersen, Bollerslev, Diebold, and Labys (2001b), among others. The construction of realized downside and upside volatilities (also known as realized semi-variances) is addressed in Barndorff-Nielsen, Kin- nebrock,andShephard(2010). Wefollowtheconsensusintheliteratureaboutconstructionofthese measures. Similarly, based on pioneering studies such as Carr and Madan (1998, 1999, 2001) and Bakshi, Kapadia, and Madan (2003), we have a clear view on how to construct risk-neutral mea- sures of volatility. The construction of option-implied downside and upside volatilities is addressed in Andersen, Bondarenko, and Gonzalez-Perez (2014). Again, we follow the existing literature in this respect. On the other hand, traditional measures of skewness have well-documented empirical problems. 2The relative upside variance is the difference between the upside and downside variances. 3",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 66,
    "chunk_index": 8,
    "word_count": 342,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "construction of option-implied downside and upside volatilities is addressed in Andersen, Bondarenko, and Gonzalez-Perez (2014). Again, we follow the existing literature in this respect. On the other hand, traditional measures of skewness have well-documented empirical problems. 2The relative upside variance is the difference between the upside and downside variances. 3",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 66,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Kim and White (2004) demonstrate the limitations of estimating the traditional third moment. Harvey and Siddique (1999, 2000) explore time variation in conditional skewness by imposing au- toregressive structures. More recently, Feunou, Jahan-Parvar, and T´edongap (2013) and Ghysels, Plazzi, and Valkanov (2011) use Pearson and Bowley’s skewness measures, respectively. They over- come many problems associated with the centered third moment, such as the excessive sensitivity to outliers documented in Kim and White (2004), by using alternative and more robust measures. Neuberger(2012)andFeunou, Jahan-Parvar, andT´edongap(2014)studythepropertiesofreal- ized measures of skewness used in Amaya, Christoffersen, Jacobs, and Vasquez (2013) and Chang, Christoffersen, and Jacobs (2013) in predicting the cross-section of returns at weekly frequency. Building on results presented in Feunou, Jahan-Parvar, and T´edongap (2014, 2013), we first con- firmthatskewness–measuredasthedifferencebetweenupsideanddownsidevariances–isapriced factor. We then provide new evidences that the SRP – measured as the difference between the risk neutral and historical expectations of skewness – is both priced and has superior predictive power. Ourstudyisalsorelatedtotherecentmacro-financeliteraturewhichemphasizestheimportance of higher-order risk attitudes such as prudence – a precautionary behavior which characterizes the aversion towards downside risk – in the determination of equilibrium asset prices. Among those studies, Eeckhoudt and Schlesinger (2008) investigate necessary and sufficient conditions for an increase in savings induced by changes in higher-order risk attitudes while Dionne, Li, and Okou (2014) restate a standard consumption-based capital asset pricing model (using the concept of expectation dependence) to show that consumption second-degree expectation dependence risk – a proxy for downside risk which accounts for nearly 80% of the equity premium – is a fundamental source of the macroeconomic risk driving asset prices. Based on the work of Amengual and Xiu (2014), we document the links that macroeconomic announcements and events share with the SRP and VRPD. Following Ludvigson and Ng (2009) and Feunou, Fontaine, Taamouti, and T´edongap (2014), we survey in a robustness study the correlations between VRP components and 124 macroeconomic and financial indicators. We find a much lower correlation of the said macroeconomic and financial indicators with VRPD, as well as with the SRP; the correlation is greater with the VRP, as well as with the VRPU. We show through careful robustness exercises that the prediction power of VRPD and SRP 4",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 66,
    "chunk_index": 10,
    "word_count": 365,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "indicators. We find a much lower correlation of the said macroeconomic and financial indicators with VRPD, as well as with the SRP; the correlation is greater with the VRP, as well as with the VRPU. We show through careful robustness exercises that the prediction power of VRPD and SRP 4",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 66,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "are independent from other common pricing variables. Additionally, in order to address data- mining concerns raised by Goyal and Welch (2008), we conduct out-of-sample forecasting exercises to establish that our predictive variables perform at least as well as other common pricing variables in forecasting excess returns. The rest of the paper proceeds as follows. In Section 2 we present our decomposition of the VRP and the method for construction of risk-neutral and realized semi-variances, as well as the relative upside variance – which is our measure of skewness. Section 3 details the data used in this study and the empirical construction of predictive variables used in our analysis. We present and discuss our main empirical results in Section 4. Specifically, we intuitively describe the components of variance risk and skewness risk premia, link them to macroeconomic factors, to policy news, discuss their predictive ability, and explore their robustness in Sections 4.1, 4.2, 4.3, 4.4, and 4.5, respectively. In Sections 4.6 and 4.7, we investigate the out-of-sample forecasting performance of ourmeasures. InSection5, wepresentasimpleequilibriumconsumption-basedassetpricingmodel that supports our empirical results. Section 6 concludes. 2 Decomposition of the Variance Risk Premium In what follows, we decompose equity price changes into positive and negative returns with respect to a suitably chosen threshold. In this study, we set this threshold to zero, but it can assume other values, given the questions to be answered. We sequentially build measures for upside and downside variances, and for skewness. When taken to data, these measures are constructed non- parametrically. We posit that stock prices or equity market indices such as the S&P 500, S, are defined over the physical probability space characterized by (Ω,P,F), where {F }∞ ∈ F are progressive filters on t t=0 F. The risk neutral probability measure Q is related to the physical measure P through Girsanov’s change of measure relation dQ | = Z ,T < ∞. At time t, we denote total equity returns as dP FT T Re = (S +D −S )/S where D is the dividend paid out in period [t−1,t]. In high enough t t t t−1 t−1 t samplingfrequencies, D is effectivelyequal tozero. Then, we denotethe logof pricesbys = lnS , t t t log-returns by r = s −s and excess log-returns by re = r −rf, where rf is the risk-free rate t t t−1 t t t t observed at time t−1. We obtain cumulative excess returns by summing one-period excess returns, 5",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 66,
    "chunk_index": 12,
    "word_count": 408,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "logof pricesbys = lnS , t t t log-returns by r = s −s and excess log-returns by re = r −rf, where rf is the risk-free rate t t t−1 t t t t observed at time t−1. We obtain cumulative excess returns by summing one-period excess returns, 5",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 66,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "re = (cid:80)k re , where k is our prediction/forecast horizon. t→t+k j=0 t+j 2.1 Construction of the variance risk premium We build the variance risk premium following the steps in BTZ as the difference between option- implied and realized variances. Alternatively, these two components could be viewed as variances under risk-neutral and physical measures, respectively. In our approach, this construction requires four distinct steps: building the upside and downside variances under the physical measure, and then doing the same under the risk neutral measure. For a given trading day t, following Andersen et al. (2003, 2001a), we construct the realized varianceofreturnsasRV = (cid:80)nt r2 , wherer2 isthejth intradaylog-returnandn isthenumber t j=1 j,t j,t t of intraday returns observed on that day. We add the squared overnight log-return (the difference in log price between when the market opens at t and when it closes at t−1), and we scale the RV series to ensure that the sample average realized variance equals the sample variance of daily t log-returns. For a give threshold κ, we decompose the realized variance into upside and downside realized variances following Barndorff-Nielsen, Kinnebrock, and Shephard (2010): (cid:88) nt RVU(κ) = r2 I , (1) t j,t [rj,t>κ] j=1 (cid:88) nt RVD(κ) = r2 I . (2) t j,t [rj,t≤κ] j=1 We add the squared overnight “positive” log-return (exceeding the threshold κ) to the upside realizedvarianceRVU,andthesquaredovernight“negative”log-return(fallingbelowthethreshold t κ) to the downside realized variance RVD. Because the daily realized variance sums the upside t and the downside realized variances, we apply the same scale to the two components of the realized variance. Specifically, we multiply both components by the ratio of the sample variance of daily log-returns over the sample average of the (pre-scaled) realized variance. For a given horizon h, we obtain the cumulative realized quantities by summing the one-day realized quantities over the h periods: 6",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 66,
    "chunk_index": 14,
    "word_count": 310,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "of the realized variance. Specifically, we multiply both components by the ratio of the sample variance of daily log-returns over the sample average of the (pre-scaled) realized variance. For a given horizon h, we obtain the cumulative realized quantities by summing the one-day realized quantities over the h periods: 6 h (cid:88) RVU(κ) = RVU (κ), t,h t+j j=1 h (cid:88) RVD(κ) = RVD (κ), t,h t+j j=1 h (cid:88) RV = RV (κ). (3) t,h t+j j=1 By construction, the cumulative realized variance adds up the cumulative realized upside and downside variances: RV ≡ RVU(κ)+RVD(κ). (4) t,h t,h t,h Next, wecharacterizetheVRP ofBTZthroughpremiaaccruedtobearingupsideanddownside variance risks, following these steps: VRP = EQ [RV ]−EP [RV ], t,h t t,h t t,h (cid:16) (cid:17) (cid:16) (cid:17) = EQ [RVU(κ)]−EP [RVU(κ)] + EQ [RVD(κ)]−EP [RVD(κ)] , t t,h t t,h t t,h t t,h VRP ≡ VRPU (κ)+VRPD(κ). (5) t,h t,h t,h Eq. (5) represents the decomposition of the VRP of BTZ into upside and downside variance risk premia – VRPU (κ) and VRPD(κ), respectively – that lies at the heart of our analysis. t,h t,h 2.1.1 Construction of P-expectation The goal here is to evaluate EP [RVU(κ)] and EP [RVD(κ)]. To this end, we consider three t t,h t t,h specifications: • Random Walk EP [RV U/D (κ)] = RV U/D (κ), t t,h t−h,h where U/D stands for “U or D”; this is the model used in BTZ. 7",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Downside Variance Risk Premium",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 66,
    "chunk_index": 15,
    "word_count": 238,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Downside Variance Risk Premium (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "goal here is to evaluate EP [RVU(κ)] and EP [RVD(κ)]. To this end, we consider three t t,h t t,h specifications: • Random Walk EP [RV U/D (κ)] = RV U/D (κ), t t,h t−h,h where U/D stands for “U or D”; this is the model used in BTZ. 7 EP [RV U/D (κ)] = ωU/D +β U/D RV U/D (κ)+βU/DRV U/D (κ)+βU/DRV U/D (κ). t t+1 d t w t,5 m t,20 • M-HAR EP [MRV (κ)] = ω+β MRV (κ)+β MRV (κ)+β MRV (κ), t t+1 d t w t,5 m t,20 where MRV (κ) ≡ (RVU(κ),RVD(κ))(cid:48). t,h t,h t,h Both U/D-HAR and M-HAR specifications mimic Corsi (2009)’s HAR-RV model. To get gen- uine expected values for realized measures that are not contaminated by forward bias or use of contemporaneous data, we perform an out-of-sample forecasting exercise to predict the three real- ized variances, at different horizons, corresponding to 1, 2, 3, 6, 9, 12, 18 and 24 months ahead. In oursubsequentanalysis, wefindthatthesealternativespecificationsprovidesimilarresults. Hence, for simplicity and to save space, we only report the results based on the random walk model. 2.1.2 Construction of Q-expectation To build the risk-neutral expectation of RV , we follow the methodology of Andersen and t,h Bondarenko (2007): (cid:104)(cid:90) t+h (cid:105) EQ [RVU(κ)] ≈ EQ σ2I du , t t,h t u [ln(Fu|Ft)>κ] t (cid:104)(cid:90) t+h (cid:105) = EQ σ2I du . t u [Fu>Ftexp(κ)] t Thus, (cid:90) ∞ M (S) EQ [RVU(κ)] ≈ 2 0 dS, (6) t t,h S2 Ftexp(κ) M (S) = min(P (S),C (S)), 0 t t where, P (S),C (S), and S are prices of European put and call options (with maturity h), and t t the strike price of the underlying asset, respectively. F is the price of a future contract at time t, t 8",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 66,
    "chunk_index": 16,
    "word_count": 299,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "M (S) = min(P (S),C (S)), 0 t t where, P (S),C (S), and S are prices of European put and call options (with maturity h), and t t the strike price of the underlying asset, respectively. F is the price of a future contract at time t, t 8",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 66,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "defined as F = S exp(rfh). Similarly for EQ [RVD(κ)], we get: t t t t t,h EQ [RVD(κ)] ≈ 2 (cid:90) Ftexp(κ) M 0 (S) dS. (7) t t,h S2 −∞ We simplify our notation by renaming EQ [RVU(κ)] and EQ [RVD(κ)] as t t,h t t,h IVU = EQ [RVU(κ)], (8) t,h t t,h IVD = EQ [RVD(κ)]. (9) t,h t t,h U/D We refer to IV as the “risk-neutral semi-variance” or “implied semi-variance” of returns. These t,h quantities are conditioned on the threshold value κ, which we suppress to simplify notation. As evident in this section, our measures of realized and implied volatility are model-free. 2.2 Construction of the skewness risk premium Proposition 2.1 in Feunou, Jahan-Parvar, and T´edongap (2014) shows that the difference between upside and downside variances (standardized by total variance) meets the criteria set forth by Groeneveld and Meeden (1984) as a measure for skewness. It is invariant to affine transformation of a random variable, is an odd function of a random variable, and assumes zero value for a symmetrically distributed random variable. Since this skewness measure only depends on the existence of the second moment, it can be computed in instances when the third moment of a distribution is undefined; see Feunou, Jahan-Parvar, and T´edongap (2014). To build this measure of skewness, denoted as RSV , we simply subtract downside variance t,h from upside semi-variance: RSV (κ) = RVU(κ)−RVD(κ). (10) t,h t,h t,h Thus, if RSV (κ) < 0 we have a left-skewed distribution, and when RSV (κ) > 0 it is right- t,h t,h skewed. Inaddition, weintroducethenotionofaskewnessriskpremium, closelyresemblingthevariance risk premium. It can be shown that the skewness risk premium is the difference between the 9",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 66,
    "chunk_index": 18,
    "word_count": 283,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(κ) = RVU(κ)−RVD(κ). (10) t,h t,h t,h Thus, if RSV (κ) < 0 we have a left-skewed distribution, and when RSV (κ) > 0 it is right- t,h t,h skewed. Inaddition, weintroducethenotionofaskewnessriskpremium, closelyresemblingthevariance risk premium. It can be shown that the skewness risk premium is the difference between the 9",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 66,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "two components of the VRP and is defined as the difference between risk neutral and objective expectations of the realized skewness. We denote skewness risk premium by SRP , and construct t,h it as follows: SRP = EQ [RSV ]−EP [RSV ], t,h t,h t,h SRP = VRPU (κ)−VRPD(κ). (11) t,h t,h t,h If RSV < 0, we view SRP as a skewness premium – the compensation for an agent who bears t,h t,h downside risk. On the other hand, if RSV > 0, we view SRP as a skewness discount – the t,h t,h amount that the agent is willing to pay to secure a positive return on an investment. Since this measure of skewness risk premium is nonparametric and model-free, it is easier to implement and interpret than competing parametric counterparts. Also, as mentioned earlier, through a suitable choice of κ it can be used to investigate tail behavior of returns – if such an exercise is desired. In this study, we are not interested in this application. 3 Data BTZ results establish that the difference between current returns variation (approximated by RV) and the markets risk-neutral expectation of future returns variation (approximated by IV) is a use- ful predictor of the future returns; it deos this by effectively isolating the systematic risk associated with the volatility-of-volatility. In this study, we adapt BTZ’s methodology and use modified mea- sures introduced in Section 2.1. As shown above, these measures also lead to construction of SRP as a byproduct. We thus need suitable data to construct excess returns, realized semi-variances (RVU/D), and risk-neutral semi-variances (IVU/D). In what follows, we discuss the raw data and methods we use to construct our empirical measures. Throughout the study, we set κ = 0. 3.1 Excess returns Following BTZ, we are interested in documenting the prediction power of upside and downside variances risk premia, as well as the skewness risk premium for monthly excess returns of an equity market portfolio. Our empirical analysis is based on the S&P 500 composite index as a proxy for 10",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 66,
    "chunk_index": 20,
    "word_count": 342,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "returns Following BTZ, we are interested in documenting the prediction power of upside and downside variances risk premia, as well as the skewness risk premium for monthly excess returns of an equity market portfolio. Our empirical analysis is based on the S&P 500 composite index as a proxy for 10",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 66,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the aggregate market portfolio. Since our study requires reliable high-frequency data and option- implied volatilities, our sample spans the September 1996 to December 2010 period. We construct the excess returns by subtracting 3-month Treasury Bill rates from log-differences in the S&P 500 composite index, sampled at the end of each month. We report the summary statistics of equity returns in Panel A of Table 1. We report annualized mean, median, and standard deviations of returns in percentages. The table also reports monthly skewness, excess kurtosis, and the first order autoregressive coefficient (AR(1)) for the S&P 500 monthly excess returns. 3.2 Options data and risk-neutral variances Since our study hinges on decomposition of the variance process into upside and downside semi- variances, we cannot follow BTZ by using VIX as a measure of risk-neutral volatility. As a result, weconstructourownmeasuresofrisk-neutralupsideanddownsidevariances(IVU/D). Weusetwo sourcesofdatatoconstructupsideanddownsideIV measures. First,weobtainfromOptionMetrics Ivy DB daily data of European-style put and call options on the S&P 500 index. We then match theseoptiondatawithreturnseriesontheunderlyingS&P500indexandrisk-freeratesdownloaded from CRSP files. For each day in the sample period, which begins in September 1996 and ends in December 2010, we sort call and put option data by maturity and strike price. We construct option prices by averaging the bid and ask quotes for each contract. To obtain consistent risk-neutral moments, we preprocessthedatabyapplyingthesamefiltersasinChang,Christoffersen,andJacobs(2013).3 We onlyconsiderout-of-the-money(OTM)contracts. Suchcontractsarethemosttraded,andthus,the mostliquidoptions. Thus, wediscardcalloptionswithmoneynesslevels–theratiosofstrikeprices to the underlying asset price – lower than 97% (S/S < 0.97). Similarly, we discard put options with moneyness levels greater than 103% (S/S > 1.03). Raw option data contain discontinuous strike prices. Therefore, on each day and for any given maturity, we interpolate implied volatilities over a finely-discretized moneyness domain (S/S), using a cubic spline to obtain a dense set of implied volatilities. We restrict the interpolation procedure to days that have at least two OTM 3That is, we discard options with zero bids, those with average quotes less than $3/8, and those whose quotes violate common no-arbitrage restrictions. 11",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 66,
    "chunk_index": 22,
    "word_count": 321,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(S/S), using a cubic spline to obtain a dense set of implied volatilities. We restrict the interpolation procedure to days that have at least two OTM 3That is, we discard options with zero bids, those with average quotes less than $3/8, and those whose quotes violate common no-arbitrage restrictions. 11",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 66,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "call prices and two OTM put prices available. Forout-of-rangemoneynesslevels(beloworabovetheobservedmoneynesslevelsinthemarket), we extrapolate the implied volatility of the lowest or highest available strike price. We perform this interpolation-extrapolation procedure to obtain a fine grid of 1000 implied volatilities, for moneyness levels between 0.01 % and 300%. We then map these implied volatilities into call and put prices. Call prices are constructed for moneyness levels larger than 100% (S/S > 1) whereas put prices are generated from moneyness levels smaller than 100% (S/S < 1). We approximate the integrals using a recursive adaptive Lobatto quadrature. Finally, for any given future horizon of interest (1 to 24 months), we employ a linear interpolation to compute the corresponding moments, and rely on Eq. (6) and (7) to compute the upside and downside risk-neutral variance measures. We obtain 3,860 daily observations of upside/downside risk-neutral variances for maturities from 1 to 24 months. An important issue in the construction of risk-neutral measures is the respective density of put and call contracts, especially for deep OTM contracts. Explicitly, precise computation of risk- neutral volatility components hinges on comparable numbers of OTM put and call contracts in longer horizon maturities (18 to 24 months). Our data set provides a rich environment which supports this data construction exercise. As clear from Table 2, while there are more OTM put contracts than OTM call contracts by any of the three measures used – moneyness, maturity, or VIX level – the respective numbers of contracts are comparable. In addition, Figure 1 shows that the growth of these contracts has continued unabated. We conclude that our construction of risk-neutral volatility components is not subject to bias due to sparsity of data in deep OTM contracts. Ourcomputationsarebasedondecompilingthevarianceriskpremiumbasedonrealizedreturns to be above or below a cut-off point, κ = 0. However, κ is not directly applicable to the risk- neutral probability space. Thus, we make the appropriate transformation to use our cut-off point by letting rf represent the instantaneous risk-free rate, and denote time-to-maturity by τ. Then, for the market price index at time t, we define the applicable cut-off point B = F exp(κ) using the t forward price F = S exp (cid:0) rfτ (cid:1) . We then use B to compute the risk-neutral upside and downside t t variances, which thus can be viewed as a model-free corridor risk-neutral volatilities as discussed 12",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 66,
    "chunk_index": 24,
    "word_count": 390,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "define the applicable cut-off point B = F exp(κ) using the t forward price F = S exp (cid:0) rfτ (cid:1) . We then use B to compute the risk-neutral upside and downside t t variances, which thus can be viewed as a model-free corridor risk-neutral volatilities as discussed 12",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 66,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "in Andersen, Bondarenko, and Gonzalez-Perez (2014); Andersen and Bondarenko (2007) and Carr and Madan (1999), among others. Panel B of Table 1 reports the summary statistics of risk-neutral volatility measures. As ex- pected, these series are persistent – AR(1) parameters are all above 0.95 – and demonstrate signif- icant skewness and excess kurtosis. It is also clear that the main factor behind volatility behavior is the downside variance. Figure 2 provides a stark demonstration of this point. It is immediately obvious that the contribution of upside variance to risk-neutral volatility is considerably less than that of downside variance. In fact, for most maturities, the median upside variance is about 50 to 80% smaller than the median downside variance. As time-to-maturity increases – a good measure for future expectations – the size of the median IVU decreases. Notice that the size of this quantity is never as large as the median IVD. On the other hand, the size of median IVD increases uniformly over time-to-maturity, is close to median risk-neutral volatility values at each corresponding point in time-to-maturity, and demonstrates the same pattern of median risk-neutral volatility. Thus, compared to its upside counterpart, the downside risk-neutral variance is clearly the main component of the risk-neutral volatility. We buttress this claim in the remainder of the paper through empirical analysis. 3.3 High frequency data and realized variance components Weusedailyclose-to-closeS&P500returns, realizedvariancesdatacomputedfrom5-minuteintra- day S&P 500 prices and 3-Month Treasury Bill Rates for the period September 1996 to December 2010, which yields a total of 3,608 daily observations. The data is available through the Institute of Financial Markets. To construct the daily RVU/Ds series, we use intraday S&P 500 data. We sum the 5-minute squared negative returns for the downside realized variance (RVD) and the 5-minute squared pos- itive returns for the upside realized variance (RVU). We nest add the daily squared overnight negative returns to the downside semi-variance, and daily squared overnight positive returns to the upside realized variance. The overnight returns are computed for 4:00 PM to 9:30 AM. The total realized variance is obtained by adding the downside and the upside realized variance. For the 13",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 66,
    "chunk_index": 26,
    "word_count": 354,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the daily squared overnight negative returns to the downside semi-variance, and daily squared overnight positive returns to the upside realized variance. The overnight returns are computed for 4:00 PM to 9:30 AM. The total realized variance is obtained by adding the downside and the upside realized variance. For the 13",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 66,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "three series, we use a multiplicative scaling of the average total realized variance series to match the unconditional variance of S&P 500 returns.4 4 Empirical Results Inthissection,weprovideeconomicintuitionandempiricalsupportforourproposeddecomposition of the variance risk premium. First, based on a sound financial rationale, we intuitively describe the expected behavior of the components of variance risk premium and skewness risk premium. We also present some empirical facts about the size and variability of these components. Since our approach is non-parametric, these facts stand as challenges for realistic models (reduced-form and general equilibrium). Second, we establish that decomposing the variance risk premium into upside and downside variance risk premia reveals that while VRP components are positively correlated with several macroeconomic and financial indicators, the level of spanning across these components differ. Third, we study the reaction of variance risk premium components to macroeconomic and financial announcements. In particular, we are interested in uncovering the relationship between announcements that reduce or resolve uncertainty surrounding monetary or fiscal policy. Fourth, weprovideanextensiveinvestigationofpredictabilityofequitypremia, basedonvariancepremium anditscomponentsaswellasskewnessriskpremium. Weempiricallydemonstratethecontribution of downside risk and skewness risk premia and characterize the sources of VRP predictability doc- umented by BTZ. Subsequently, we provide comprehensive robustness study. Finally, we conclude with out-of-sample forecast ability properties of our proposed predictors – downside variance risk and skewness risk premia. 4.1 Description of the variance risk premium components TheVRPcanbeinterpretedasthepremiumamarketparticipantiswillingtopaytohedgeagainst variation in future realized volatilities. It is expected to be positive because of the intuition that risk-averse investors dislike large swings in volatility, especially in “bad times”. This intuition is rationalized within the general equilibrium model of BTZ, where it is shown that the variance risk premium is in general positive and proportional to the volatility of volatility. We confirm these 4Hansen and Lunde (2006) discuss various approaches to adjusting open-to-close RVs. 14",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 66,
    "chunk_index": 28,
    "word_count": 292,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "especially in “bad times”. This intuition is rationalized within the general equilibrium model of BTZ, where it is shown that the variance risk premium is in general positive and proportional to the volatility of volatility. We confirm these 4Hansen and Lunde (2006) discuss various approaches to adjusting open-to-close RVs. 14",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 66,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "findings by reporting in Table 1 some summary statistics. We also plot the time-series of VRP, its components, and SRP in Figure 7. From 1996 to 2010, we can see that the variance risk premium is positive most of the time, and remains high in uncertain times. However, several studies including Feunou, Jahan-Parvar, and T´edongap (2013) and Segal, Shaliastovich, and Yaron (2015) show that there are good and bad uncertainties. On one hand, market participants like good uncertainty when returns are positive, as it signals the potential of earning an even higher return. In other words, risk-averse agents like upside variations, and are willing to pay to be exposed to fluctuations in the upside variance. This argument should induce a negative expected value for VRPU. Table 1 clearly illustrates these intuitions as the average VRPU is about −4.41%. Moreover, Figure 7 shows that VRPU is usually negative through our sample period. On the other hand, investors dislike bad uncertainty (when returns are negative), as it increases the likelihood of losses. Because risk averse agents dislike downside variations, they are willing to pay a premium to hedge against fluctuations in future downside variances. Therefore, VRPD is expected to be positive most of the time. These intuitions are supported by the empirical evidence in Table 1, where the average downside variance premium is about 3.4%, and in Figure 7, where we observe that VRPD is usually positive. Upsideanddownsidevarianceriskpremiatendtohaveoppositesigns. Thus,the(total)variance risk premium that sums these two components essentially mixes together market participants’ (asymmetric) views about good and bad uncertainties. This entails that positive (total) variance risk premium reflects the fact that investors are willing to pay more in order to hedge against changes in bad uncertainty than that for exposure to variations in good uncertainty. Hence, focusingonthe(total)varianceriskpremiumdoesnotprovideadetailedoverviewofthe trade-offbetweengoodandbaduncertainties,asasmallpositivenumberdoesnotnecessarilyimply a lower level of risk and/or risk aversion. It is rather an indication of a smaller difference between what agents are willing to pay for downside variation hedging versus upside variation exposure. Building on the same intuition, the sign of the SRP stems from the expected behavior of the two components of the VRP. The SRP is obtained by subtracting VRPD from VRPU. Given that (on average) VRPU appears negative whereas VRPD tends to be positive, the SRP is expected to be negative. This intuition is supported by Figure 7 where the average skewness risk premium is 15",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 66,
    "chunk_index": 30,
    "word_count": 393,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the two components of the VRP. The SRP is obtained by subtracting VRPD from VRPU. Given that (on average) VRPU appears negative whereas VRPD tends to be positive, the SRP is expected to be negative. This intuition is supported by Figure 7 where the average skewness risk premium is 15",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 66,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "−7.8%. Alternatively, this negative sign may be interpreted as follows: market participants prefer higher skewness, and would like to be exposed to variations in future skewness. Table1alsorevealshighlypersistent,negatively-skewed,andfat-taileddistributionsfor(down/upside) variance and skewness risk premia. Nonetheless, upside variance and skewness risk premia appear moreleft-skewedandleptokurticascomparedto(total)varianceanddownsidevarianceriskpremia. 4.2 Links to macroeconomic and financial indicators FollowingLudvigsonandNg(2009)andFeunouetal.(2014),wesurveythecorrelationsofvariance, upside variance, downside variance, and skewness risk premia with 124 financial and economic indicators. We carry out this exercise to document the contemporaneous correlation of variance andskewnessriskpremiawithwell-knownmacroeconomicandfinancialvariables. TheVRPandits componentsarepredictorsofriskinfinancialmarkets,thatis,anincreaseinVRPorVRPD implies expectations of elevated risk levels in the future and hence compensation for bearing that risk. Fama and French (1989) document the counter-cyclical behavior of the equity premium: investors demand a higher equity premium in bad times. It follows that VRP should be mildly pro-cyclical and positively correlated with cyclical macroeconomic and financial variables. The relationship between SRP and macroeconomic and financial factors is an empirically open issue that we address in this study. Finally, we are interested in the spanning of VRP, its components, and SRP by macroeconomic and financial factors. Briefly, low levels of spanning imply the information content in the risk premium measures that is orthogonal to the information content of common financial or economic quantities. Inourempiricalinvestigation,wefocusoncontemporaneouscorrelationsandadjustedR2ssince, given orthonormal factors, the regression coefficients depend on identification assumptions. The analysis and results here are based on a contemporaneous univariate regression model, where the dependent variable is one of the variance risk premium or skewness measures, and the independent variable is one of the variables studied by Feunou et al. (2014).5 Table3reportsthetenvariablesthatyieldthehighestR2sforeach(semi-)varianceriskpremium componentandtheirrespectiveslopeparameterStudent-tstatistics. Thecompositionofthefactors 5The complete list of these variables and supplementary results regarding our analysis are available in an online Appendix. 16",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 66,
    "chunk_index": 32,
    "word_count": 272,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the dependent variable is one of the variance risk premium or skewness measures, and the independent variable is one of the variables studied by Feunou et al. (2014).5 Table3reportsthetenvariablesthatyieldthehighestR2sforeach(semi-)varianceriskpremium componentandtheirrespectiveslopeparameterStudent-tstatistics. Thecompositionofthefactors 5The complete list of these variables and supplementary results regarding our analysis are available in an online Appendix. 16",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 66,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "thatexplainthevariationinvariance, upsidevariance, downsidevariance, andskewnessriskpremia and the size of the adjusted R2s above the 10% threshold wide-ranging. Clearly, variables listed on this table all yield slope parameters statistically different from zero at conventional significance levels, as evidenced by the high Student-t statistics. Slope parameters for VRP and its components are all positive, and imply positive correlation with the mainly pro-cyclical macroeconomic variables listed in the table. Overall, payroll measures and industrial production indices are the most important predictors for VRP and its components, accounting for virtually all top predictors for these quantities. Total payroll in the private sector is the most powerful contemporaneous predictor for VRP and VRPU. It yields an adjusted R2 of over 50% for VRPU and 40% for VRP. The level of explanatory power of this variable, measured by the adjusted R2, drops to under 25% for VRPD. SlopeparametersfortheregressionmodelcontainingSRPasthepredictedvariableandmacroe- conomic and financial variables as predictors, imply a negative contemporaneous correlation. The top variables with a significant correlation with SRP differ from those in the other three panels of Table 3. For example, total payroll in the private sector does not have much explanatory power for the SRP; it yields an adjusted R2 equal to 11.63% and is the 9th variable in the list. The sources of predictability for the SRP – while much weaker – are diverse. Price indices and bond yields have weak, contemporaneous prediction power for the SRP. Since payroll measures and bond yields, especially those with shorter maturities such as 6-month Treasury Bills are pro-cyclical, these findings imply counter-cyclical behavior for the SRP. Together, the regularities discussed above lead us to conclude that the common financial and macroeconomic indicators do not span well the VRP components or SRP, since none of them explains more than 53% of the variation in these premia contemporaneously. Moreover, these indicators seem to have the least success spanning downside variance and skewness risk premia. This observation sheds further light on the success of these two factors in predicting equity premia – their information content is largely uncorrelated with that of a large set of macroeconomic and financial variables. Similarly, the relatively high correlation of VRPU with several macroeconomic variables partially explains its poor predictive performance with respect to the equity premium – it contains less unspanned information. 17",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 66,
    "chunk_index": 34,
    "word_count": 378,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "equity premia – their information content is largely uncorrelated with that of a large set of macroeconomic and financial variables. Similarly, the relatively high correlation of VRPU with several macroeconomic variables partially explains its poor predictive performance with respect to the equity premium – it contains less unspanned information. 17",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "• U/D-HAR",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 66,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "• U/D-HAR (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Amengual and Xiu (2014) study the impact on decisions and announcements that reduce or resolve uncertainty, especially regarding monetary and fiscal policies. We use the same set of events com- piled by Amengual and Xiu (2014) to study the impact of events, such as FOMC announcements, speeches by Federal Reserve officials and the Presidents of the United States, as well as economic and political news that had significant impact on market returns or measures of market volatility. The events are summarized in Table 4. We report in Table 5 the changes in the variance, upside variance, downside variance, and skewnessriskpremiaaswellastheirend-of-the-daylevelsoneventdates. Themoststrikingoutcome from this exercise is the observation that across the board and for all variance risk components and skewness risk premia, policy announcements that resolve financial or monetary uncertainty, also reduce the premia. The impact on the SRP, however, is mixed: announcements can increase or decrease the size of this premium. This observation, by construction, hinges on the size of the reduction imputed by the announcement on VRPU and VRPD. That said, in 16 out of 22 events studied, the impact of events on the SRP is negative. InadditiontomatchingtheeventsrecordedbyAmengualandXiu(2014)tochangesinvariance risk premium components, we conducted an exercise to perform targeted searches for the largest changes in variance risk premium components in suitably chosen date intervals that contain the event date – in this case, a trading week before and after the event date – to identify the largest changes in (semi-)variance risk premium components in that interval. The results are not funda- mentally different from what is reported in Table 5. Most large movements are very close to the event date. Thus they are not reported to save space, but are available upon request. We may view these observations as evidence that resolution of policy uncertainty or reduction of political tensions have a negative impact on premia demanded by the market participants to bear variance or skewness risk. 4.4 Predictability of the equity premium BTZ derive a theoretical model where the VRP emerges as the main driver of time variation in the equity premium. They show both theoretically and empirically that a higher VRP predicts higher 18",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 66,
    "chunk_index": 36,
    "word_count": 356,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "demanded by the market participants to bear variance or skewness risk. 4.4 Predictability of the equity premium BTZ derive a theoretical model where the VRP emerges as the main driver of time variation in the equity premium. They show both theoretically and empirically that a higher VRP predicts higher 18",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 66,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "future excess returns. Intuitively, the variance risk premium proxies the premium associated with the volatility of volatility, which not only reflects how future random returns vary, but also assesses fluctuations in the tail thickness of the future returns distribution. Because the VRP sums downside and upside variance risk premia, BTZ’s framework entails imposing the same coefficient on both (upside and downside) components of the VRP when they are jointly included in a predictive regression of excess returns. However, such a constraint seems very restrictive given the asymmetric views of investors on good uncertainty – proneness to upward variability – versus bad uncertainty – aversion to downward variability. Sections 4.1, 4.2 and 4.3 document that both VRPD and VRPU have intrinsically different features. Intuitively, risk-averse investors like variability in positive outcomes of returns, but dislike it in negative outcomes. Hence in a joint regression, we expect coefficient of VRPD to be positive and that of VRPU to be negative. These observations boil down to a simple intuition: risk-averse investors ask for a premium to face risks they do not like while they are willing to pay for exposure to favorable uncertainties – risks they like. Panel A in Table 9 reports results of joint regressions of excess returns on both VRPD and VRPU. Our findings confirm our intuition at all horizons. It is important to point out that by highlighting the disparities between upside and downside varianceriskpremia,wedonotintendtoinvalidateBTZ’smodel. Theirstudyisbuilttorationalize the importance of variance risk premium in explaining the dynamics of the equity premium. Our study pushes further, by documenting that the SRP is pivotal in disentangling the upside from the downside premium related to future changes in variability. Thus, our goal is to build on BTZ’s framework, showingthatintroducingasymmetryintheVRPanalysisprovidesadditionalflexibility to the trade-off between return first and second moment risk premia. Ultimately, our approach is intended to strengthen the concept behind the variance risk premium of BTZ. Our results are based on a simple linear regression of k-step-ahead cumulative S&P 500 excess returns on values of a set of predictors that include the VRP, VRPU, VRPD, and SRP. Following theresultsofAngandBekaert(2007),reportedStudent’st-statisticsarebasedonheteroscedasticity and serial correlation consistent standard errors that explicitly take account of the overlap in the regressions, as advocated by Hodrick (1992). The model used for our analysis is simply: 19",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 66,
    "chunk_index": 38,
    "word_count": 376,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "500 excess returns on values of a set of predictors that include the VRP, VRPU, VRPD, and SRP. Following theresultsofAngandBekaert(2007),reportedStudent’st-statisticsarebasedonheteroscedasticity and serial correlation consistent standard errors that explicitly take account of the overlap in the regressions, as advocated by Hodrick (1992). The model used for our analysis is simply: 19",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 66,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "re = β +β x (h)+(cid:15) , (12) t→t+k 0 1 t t→t+k where r is the cumulative excess returns between time t, t+k, x (h) is one of the predictors t→t+k t discussed in Sections 2.1 and 2.2 at time t, h is the construction horizon of x (h), and (cid:15) is a zero- t t mean error term. We focus our discussion on the significance of the estimated slope coefficients (β s), determined by the robust Student-t statistics. We report the predictive ability of regressions, 1 measured by the corresponding adjusted R2s. For highly persistent predictor variables, the R2s for the overlapping multi-period return regressions must be interpreted with caution, as noted by BTZ and Jacquier and Okou (2014), among others. Following our discussion of the observed mildly cyclical behavior of the VRP and those of VRPU and VRPD in Section 4.2, and given the counter-cyclical behavior of the equity premium, weexpecttoobservepositiveslopeparametersintheregressionmodelinequation(12), whenx (h) t is one of variance risk premia quantities. We decompose the contribution of our predictors to show that: 1) predictability results doc- umented by BTZ are driven by the downside variance risk premium, 2) predictability results are mainly driven by risk-neutral expectations – thus, risk neutral measures contribute more than re- alized measures, and 3) the contribution of the skewness risk premium increases as a function of both the predictability horizon (k) and construction horizon (h). Ourempiricalfindings,presentedinTables6to9,supportallthreeclaimsmadeabove. InPanel A, Table 6, we show that the two main regularities uncovered by BTZ, hump-shaped increase in robust Student-t statistics and adjusted R2s reaching their maximum at k = 3 (one quarter ahead), are present in the data. Both regularities are visible in the upper-left-hand-side plots in Figures 4 and 5. These effects, however, weaken as the construction horizon (h) increases from one month to three months or more: the predictability pattern weakens and then largely disappears for h > 6. Panel B of Table 6 reports the predictability results based on using VRPD as the predictor. A visual representation of these results is available in the upper-right-hand-side plots in Figures 4 and 5. It is immediately obvious that both regularities observed in the VRP predictive regressions are preserved. We observe the hump-shaped pattern for Student’s t-statistics and the adjusted R2s reaching their maximum between k = 3 or k = 6 months. Moreover, these results are more robust 20",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 66,
    "chunk_index": 40,
    "word_count": 393,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Figures 4 and 5. It is immediately obvious that both regularities observed in the VRP predictive regressions are preserved. We observe the hump-shaped pattern for Student’s t-statistics and the adjusted R2s reaching their maximum between k = 3 or k = 6 months. Moreover, these results are more robust 20",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 66,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "to the construction horizon of the predictor. We notice that in contrast to the VRP results – where predictability is only present for monthly or quarterly constructed risk premia – the VRPD results are largely robust to construction horizons; the slope parameters are statistically different from zero even for annually constructed downside variance risk premia (h = 12). Moreover, the VRPD resultsyieldhigheradjustedR2scomparedwiththeVRPregressionsatsimilarpredictionhorizons, an observation that we interpret as the superior ability of the VRPD to explain the variation in aggregate excess returns. Last but not least, we notice a gradual shift in prediction results from the familiar one-quarter-ahead peak of predictability documented by BTZ to 9-12-months-ahead peaks, once we increase the construction horizon h. Based on these results, we infer that the the VRPD is the likely candidate to explain the predictive power of VRP, documented by BTZ. Our results for predictability based on the VRPU, reported in Panel C of Table 6 and the two lower left-hand-side plots in Figures 4 and 5, are weak. The hump-shaped pattern in both robust Student’s t-statistics and in adjusted R2s, while present, is significantly weaker than the results reported by BTZ. Once we increase the construction horizon h, these results are lost. We conclude that bearing upside variance risk does not appear to be an important contributor to the equity premium, and hence, is not a good predictor of this quantity. In addition, we interpret these findings as a low contribution of the VRPU to overall VRP. We observe a set of interesting regularities, however, when we use the SRP as our predictor. These results are reported in Panel D of Table 6 and the bottom-right-hand-side plots in Figures 4 and 5. It is immediately clear that this factor displays predictive power at longer horizons than the VRP. For monthly excess returns, the SRP slope coefficient is statistically different from zero at prediction horizons of 6-months-ahead or longer. At k = 6, the adjusted R2 of the SRP is comparable in size with that of the VRP (2.30% against 3.65%, respectively) and is strictly greater thereafter. At k = 6, the adjusted R2 for the monthly excess return regression based on the SRP is smaller than that of the VRPD. However, their sizes are comparable at k = 9 and k = 12 months ahead. Both trends strengthen as we consider higher aggregation levels for excess returns. At the semi-annual construction level (h = 6), the SRP already has more predictive power than both the VRP and VRPD at a quarter-ahead prediction horizon. The increase in adjusted R2s of the SRP is not monotonic in the construction horizon level. We can detect a maximum 21",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 66,
    "chunk_index": 42,
    "word_count": 443,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "excess returns. At the semi-annual construction level (h = 6), the SRP already has more predictive power than both the VRP and VRPD at a quarter-ahead prediction horizon. The increase in adjusted R2s of the SRP is not monotonic in the construction horizon level. We can detect a maximum 21",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 66,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "at a roughly three-quarters-ahead prediction window for semi-annual and annually constructed SRPs. This observation implies that this factor is the intermediate link between one-quarter-ahead predictability using the VRP uncovered by BTZ and the long-term predictors such as the price- dividend ratio, dividend yield, or consumption-wealth ratio of Lettau and Ludvigson (2001). We conclude that predictability of cumulative excess returns by the SRP increases in both prediction horizon, k, and construction horizon, h, for the SRP. At this point, it is natural to inquire about including both VRP components in a predictive regression. We present the empirical evidence from this estimation in Panel A of Table 9. After inclusionoftheVRPU andVRPD inthesameregression,thestatisticalsignificanceoftheVRPU’s slope parameters is broadly lost. We also notice a sign change in Student’s t-statistics associated withtheestimatedslopeparametersoftheVRPU andVRPD. Thisobservation, asdocumentedin Feunou, Jahan-Parvar, and T´edongap (2013), lends credibility to the role of the SRP as a predictor of aggregated excess returns.6 Weclaimthatthepatternsdiscussedabove,andhencethepredictivepoweroftheVRP,VRPD, and SRP are rooted in expectations. That is, the driving force behind our results, as well as those of BTZ, are expected risk-neutral measures of the volatility components. To show the empirical findings supporting our claim, we run predictive regressions, using Equation (12). Instead of using the “premia” employed so far, we use realized and risk-neutral measures of variances, up- and downside variances, and skewness for x , based on our discussions in Section 2, respectively. t Our empirical findings using risk-neutral volatility measures are available in Table 7. In Panel A, we report the results of running a predictive regression when the predictor is the risk-neutral variance obtained from direct application of the Andersen and Bondarenko (2007) method. It is clear that the estimated slope parameters are statistically different from zero for k ≥ 3 at most constructionhorizons, h. ThereportedadjustedR2salsoimplythatthepredictiveregressionshave explanatorypowerforaggregateexcessreturnvariationsatk ≥ 3. Thesamepatternsarediscernible for risk-neutral downside and upside variances (Panels B and C) and risk-neutral skewness (Panel D).AdjustedR2sreportedarelowerthanthosereportedinTable6,andthesemeasuresofvariation 6Briefly,basedonargumentssimilartothoseadvancedbyFeunou,Jahan-Parvar,andT´edongap(2013),weexpect estimated parameters of the VRPU and VRPD to have opposite signs, and be statistically “close”. As such, they imply that the SRP is the factor we should have included. 22",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 66,
    "chunk_index": 44,
    "word_count": 341,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "explanatorypowerforaggregateexcessreturnvariationsatk ≥ 3. Thesamepatternsarediscernible for risk-neutral downside and upside variances (Panels B and C) and risk-neutral skewness (Panel D).AdjustedR2sreportedarelowerthanthosereportedinTable6,andthesemeasuresofvariation 6Briefly,basedonargumentssimilartothoseadvancedbyFeunou,Jahan-Parvar,andT´edongap(2013),weexpect estimated parameters of the VRPU and VRPD to have opposite signs, and be statistically “close”. As such, they imply that the SRP is the factor we should have included. 22",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 66,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "yield statistically significant slope parameters at longer prediction horizons than what we observe for the VRP and its components. Taken together, these observations imply that using the premium (rather than the risk-neutral variation) yields better predictions. However, in comparison with realized (physical) variation measures, risk-neutral measures yield better results. The analysis using realized variation measures are available in Table 8. It is obvious that by themselves, the realized measures do not yield reasonable predictability, an observation corroborated by empirical findings of Bekaert, Engstrom, and Ermolov (2014). The majority of estimated slope parameters are statistically indistinguishable from zero, and adjusted R2s are low. Inclusion of both risk-neutral or realized variance components does not change our findings dra- matically, as demonstrated in Panels B and C of Table 9. WeobserveinPanelDofTable8andinPanelCof9statisticalsignificanceandnotableadjusted R2s for realized skewness in long prediction horizons (k ≥ 6) and for construction horizons (h ≥ 6). By itself (as opposed to the SRP studied earlier), the realized skewness lacks predictive power in low construction or prediction horizons. Based on our results presented in Table 6, we argue that the SRP (and not the realized skewness) is a more suitable predictive factor, as it overcomes these two shortcomings. A visual representation of the prediction power of risk neutral (integrated) and physical (re- alized) variation components is available in Figure 6. Given the weak performance of realized measures, it is easy to conclude that realized variation plays a secondary role to risk-neutral varia- tion measures in driving the predictability results documented by BTZ or in this study. However, we need both elements in construction of the variance or skewness risk premia since realized or risk-neutral measures individually posses inferior prediction power. 4.5 Robustness We perform extensive robustness exercises to document the prediction power of the VRPD and SRP for aggregate excess returns, in the presence of traditional predictor variables. The goal is to highlight the contribution of our proposed variables in a wider empirical context. Simply put, we observe that predictive power does not disappear when we include other pricing variables, implying that the VRPD and SRP are not simply proxies for other well-known pricing ratios. 23",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 66,
    "chunk_index": 46,
    "word_count": 355,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "predictor variables. The goal is to highlight the contribution of our proposed variables in a wider empirical context. Simply put, we observe that predictive power does not disappear when we include other pricing variables, implying that the VRPD and SRP are not simply proxies for other well-known pricing ratios. 23",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 66,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "FollowingBTZandFeunouetal.(2014)amongmanyothers,weincludeequitypricingmeasures such as log price-dividend ratio (log(p /d )), lagged log price-dividend ratio (log(p /d ), and t t t−1 t log price-earning ratio (log(p /e )); yield and spread measures such as term spread (tms ) – the t t t differencebetween10-yearU.S.TreasuryBondyieldand3-monthU.S.TreasuryBillyield–,default spread(dfs )–thedifferencebetweenBBBandAAAcorporatebondyields–; CPIinflation(infl ), t t and finally Kelly and Pruitt (2013) partial least squares-based, cross-sectional in-sample and out- of-sample predictive factors (kpis and kpos , respectively). t t We consider two periods for our analysis: our full sample – September 1996 to December 2010 – and a pre-Great Recession sample – September 1996 to December 2007. The latter ends at the same point in time as the BTZ sample. We report our empirical findings in Tables 10 to 13. These results are based on semi-annually aggregated excess returns and estimated for the one-month- ahead prediction horizon.7 In this robustness study, we scale the cumulative excess returns; we use re /6 as the predicted value and regress it on a one-month lagged predictive variable. t→t+6 Full-sample simple predictive regression results are available in Table 10. Among VRP com- ponents, only the downside variance risk premium (dvrp ) and skewness risk premium (srp ) have t t slope parameters that are statistically different from zero and have adjusted R2s comparable in magnitude with other pricing variables. Once we use dvrp along with other pricing variables, we t observe the following regularities in Table 11 which reports the following joint multi-variate regres- sion results. First, the estimated slope parameter for dvrp is statistically different from zero in all t cases, except when we include srp . This result is not, however, surprising since srp and dvrp are t t t linearly dependent. Second, these regressions yield adjusted R2s which range between 3.10% (for dvrp and tms , in line with findings of BTZ that report weak predictability for tms ) to 25.71% t t t (for dvrp and infl ).8 The downside variance risk premium in conjuncture with the variance risk t t premium or upside variance risk premium remains statistically significant and yields adjusted R2s that are in the 7% neighborhood. 7Acompletesetofrobustnesschecks,includingmonthly,quarterly,andannuallyaggregatedexcessreturnsresults, are available in an online Appendix. 8The dynamics of inflation during the Great Recession period mimic the behavior of our variance risk premia. Gilchrist et al. (2014) meticulously study the behavior of this variable in the 2007-2009 period. According to their study,bothfullandmatchedPPIinflationintheirmodeldisplayanaggregatedropin2008-2009,whilethereaction of financially sound and weak firms are asymmetric, with the former lowering prices and the latter raising prices in this period. Thus, the predictive power of this variable, given the inherent asymmetric responses, is not surprising. 24",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 66,
    "chunk_index": 48,
    "word_count": 433,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "the behavior of this variable in the 2007-2009 period. According to their study,bothfullandmatchedPPIinflationintheirmodeldisplayanaggregatedropin2008-2009,whilethereaction of financially sound and weak firms are asymmetric, with the former lowering prices and the latter raising prices in this period. Thus, the predictive power of this variable, given the inherent asymmetric responses, is not surprising. 24",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 66,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "We obtain adjusted R2s that are decidedly lower than those reported by BTZ for quarterly and annually aggregated multivariate regressions. These differences are driven by inclusion of the Great Recession period data in our full sample. To illustrate this point, we repeat our estimation with the data set ending in December 2007. Simple predictive regression results based on this data are available in Table 12. We immediately observe that exclusion of the Great Recession period data improves even the univariate predictive regression adjusted R2s across the board. The estimated slope parameters are also closer to BTZ estimates and generally statistically significant. In Table 13, we report multivariate regression results, based on 1996-2007 data. We notice that once dvrp is included in the regression model, the variance risk premium, upside variance risk t premium and skewness risk premium are no longer statistically significant. Other pricing variables, except for term spread, default spread, and inflation, yield slope parameters that are statistically significant. Thus, inflation seems to lack prediction power in this sub-sample. We do not observe statistically insignificant slope parameters for the downside variance risk premium except when we include vrp . Across the board, adjusted R2s are high in this sub-sample. t 4.6 Out-of-sample analysis Our goal in this section is to compare the forecast ability of downside variance and skewness risk premia with common financial and macroeconomic variables used in equity premium predictability exercises. To assess the ability of downside variance risk and skewness risk premia to forecast excess re- turns, we follow the literature on predictive accuracy tests. We assume a benchmark model (B) and a competitor model (C) in order to compare their predictive power for a given sample {y}T . t=1 To generate k-period out-of-sample predictions y for y , we split the total sample of T obser- t+k|t t+k vations into in-sample and out-of-sample portions, where the first 1,...,t in-sample observations R are used to obtain the initial set of regression estimates. The out-of-sample observations span the last portion of the total sample t = t +1,...,T and are used for forecast evaluation. The models R are recursively estimated with the last in-sample observation ranging from t = t to t = T −k, R at each t forecasting t+k. That is, we use time t data to forecast the k-step ahead value. In our analysis, we use half of the total sample for the initial in-sample estimation, that is t = (cid:98)T(cid:99) where R 2 25",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 66,
    "chunk_index": 50,
    "word_count": 411,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "= t to t = T −k, R at each t forecasting t+k. That is, we use time t data to forecast the k-step ahead value. In our analysis, we use half of the total sample for the initial in-sample estimation, that is t = (cid:98)T(cid:99) where R 2 25",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 66,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(cid:98)y(cid:99) denotes the largest integer that is less than or equal to y. In order to generate subsequent sets of forecasts, we employ a recursive scheme (expanding window), even though the in-sample period can be fixed or rolling. The forecast errors from the two models are eB = y −yB , t+k|t t+k t+k|t eC = y −yC , t+k|t t+k t+k|t where t = t ,...,T −k. Thus, we obtain two sets of t = T −t −k+1 recursive forecast errors. R R The accuracy of each forecast is measured by a loss function L(•). Among the popular loss functions are the squared error loss L(e ) = (e )2 and the absolute error loss L(e ) = t+k|t t+k|t t+k|t |e |. Let dBC = L(e )B−L(e )C be the error loss differential between the benchmark and t+k|t t t+k|t t+k|t competitor models, and denote the expectation operator by E(•). To gauge if a model yields better forecasts than an alternative specification, a two-sided test may be run, where the null hypothesis is that the “two models have the same forecast accuracy” against the alternative hypothesis that the “two models have different forecast accuracy”. Formally: H : E(dBC) = 0 vs. H : E(dBC) (cid:54)= 0. 0 t A t Alternatively, a one-sided test may be considered, where the null hypothesis is that “model C does not improve the forecast accuracy compared to model B” against the alternative hypothesis that “model C improves the forecast accuracy compared to model B”. Formally: H : E(dBC) ≤ 0 vs. H : E(dBC) > 0. 0 t A t In the context of our study, we apply forecast accuracy tests to non-nested models. The inno- vation of our analysis is to introduce two new predictors, the VRPD and SRP. We compare the benchmark model B, which includes our proposed predictors, and the competitor C, which con- tains a traditional predictive variable such as the price-dividend ratio, dividend yield, price-earning ratio, etc. Failure to reject the null leads us to conclude that the classical predictor does not yield moreaccurateforecaststhanourproposedpredictor. DieboldandMariano(1995)andWest(1996) 26",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 66,
    "chunk_index": 52,
    "word_count": 349,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "compare the benchmark model B, which includes our proposed predictors, and the competitor C, which con- tains a traditional predictive variable such as the price-dividend ratio, dividend yield, price-earning ratio, etc. Failure to reject the null leads us to conclude that the classical predictor does not yield moreaccurateforecaststhanourproposedpredictor. DieboldandMariano(1995)andWest(1996) 26",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 66,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "provide further inference results on this class of forecast accuracy tests. 4.7 Out-of-sample empirical findings Following the influential study of Inoue and Kilian (2004), we first investigate the in-sample fit of the data by our proposed predictors – the VRPD and SRP – and traditional predictors studied in the literature. Inoue and Kilian (2004) convincingly argue that to make dependable out-of-sample inference, we need reasonable in-sample fit. The second column of Table 14 reports adjusted R2s for monthly, quarterly, and semi-annually aggregated excess returns regressed on our proposed and traditional predictors. These are in-sample results and no forecasting is performed. We notice that, first, for all predictors, adjusted R2s improve with the prediction horizon. Second, we notice that for all predictors except Kelly and Pruitt’s 2013 out-of-sample cross-sectional book-to-market index,adjustedR2sarereasonablyhigh. TheKelly-Pruittindexisbyconstructionanout-of-sample predictor. Thus, the seemingly poor in-sample performance is not a cause for concern for us. Onceweestablishthein-samplepredictionpower, wemovetoinvestigateout-of-sampleforecast ability. Not surprisingly, out-of-sample adjusted R2s – reported in the third column of Table 14 – are much smaller than their in-sample counterparts, with the exception of the Kelly-Pruitt index. This observation may be due to inclusion of data from the 2007-2009 Great Recession period in the out-of-sample exercise. As documented in Section 4.5, most predictors lose significant prediction power once data from this period is included in the analysis. Our task is to investigate the relative forecast performance of our proposed downside and skewness risk premium measures against other well-known predictors. To this end, we implement the Diebold and Mariano (1995) (henceforth, DM) tests of prediction accuracy. The results of performing out-of-sample forecast accuracy tests are available in the fourth and the sixth column of Table 14, where we report DM test statistics, and in the fifth and the seventh columns of the same Table, where we report the associated p-values. We cannot reject the null of equal or superior forecast accuracy when the benchmark is the downside variance (or skewness) risk premium and the alternative model contains one of the traditional predictors, since p-values are greater than the conventional 5% test size. We note the following important considerations. First, these results are based on the DM forecast accuracy test for non-nested models. Our findings are robust for 27",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 66,
    "chunk_index": 54,
    "word_count": 368,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(or skewness) risk premium and the alternative model contains one of the traditional predictors, since p-values are greater than the conventional 5% test size. We note the following important considerations. First, these results are based on the DM forecast accuracy test for non-nested models. Our findings are robust for 27",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 66,
    "chunk_index": 55,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "all the horizons we consider in our analysis (1, 3 and 6 months). Second, the null hypothesis states that the mean squared forecast error of the alternative model is larger than or equal to that of the benchmark model. This is a one-sided test, and negative DM statistics indicate that the alternative model performed worse than the benchmark model. Third, we interpret the p-values cautiously, following Boyer, Jacquier, and van Norden (2012). They point out that p-values are hard to interpret due to the Lindley-Smith paradox, and in addition, they need to be adjusted. To be precise, we produce multiple p-values in this analysis. Using unadjusted p-values in such an environment overstates the evidence against the null. Thus, following Boyer, Jacquier, and van Norden (2012), we apply a Bonferroni adjustment to the generated p-values. Our reported findings are, therefore, suitably conservative and reliable. Conventional competing variables such as the variance risk premium, price-dividend ratio, and price-earning ratio, have lower forecast accuracy than our proposed measures. In a nutshell, the prediction power of the downside variance risk premium and skewness risk premium are not a figment of good in-sample fit of the data. In comparison with other pricing ratiosandvariables, ourproposedmeasureshaveatleastsimilar(andoftensuperior)out-of-sample accuracy. 5 A Simple Equilibrium Model Ourgoalinthissectionistoshowthatourempiricalfindingsaresupportedbyasimpleequilibrium consumption-based asset pricing model. Our main objective is to highlight the roles that upside anddownsidevarianceplayinpricingariskyassetinanotherwisestandardassetpricingmodel. In particular,weshowthatunderstandardandmildassumptions,theweightsandthesignsattributed to upside and downside variances are inline with our empirical findings. To save space, we only report the main results. An online Appendix reports our derivations in great detail. 5.1 Preferences We consider a endowment economy in discrete time. The representative agent’s preferences over the future consumption stream are characterized by Kreps and Porteus (1978) intertemporal pref- erences, as formulated by Epstein and Zin (1989) and Weil (1989): 28",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 66,
    "chunk_index": 56,
    "word_count": 292,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "results. An online Appendix reports our derivations in great detail. 5.1 Preferences We consider a endowment economy in discrete time. The representative agent’s preferences over the future consumption stream are characterized by Kreps and Porteus (1978) intertemporal pref- erences, as formulated by Epstein and Zin (1989) and Weil (1989): 28",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 66,
    "chunk_index": 57,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(cid:20) 1−γ (cid:16) (cid:17)1(cid:21) 1− θ γ U = (1−δ)C θ +δ E U1−γ θ , (13) t t t t+1 whereC istheconsumptionbundleattimet, δ isthesubjectivediscountfactor, γ isthecoefficient t of risk aversion, and ψ is the elasticity of intertemporal substitution (IES). Parameter θ is defined as θ ≡ 1−γ . If θ = 1, then γ = 1/ψ and EZ preferences collapse to expected power utility, which 1−1 ψ implies an agent who is indifferent to the timing of resolution of uncertainty of the consumption path. With γ > 1/ψ, the agent prefers early resolution of uncertainty. For γ < 1/ψ, the agent prefers late resolution of uncertainty. Epstein and Zin (1989) show that the logarithm of stochastic discount factor (SDF) implied by these preferences is given by: θ lnM = m = θlnδ− ∆c +(θ−1)r , (14) t+1 t+1 t+1 c,t+1 ψ (cid:16) (cid:17) where ∆c = ln Ct+1 is the log growth rate of aggregate consumption, and r is the log return t+1 Ct c,t of the asset that delivers aggregate consumption as dividends. This asset represents the returns on a wealth portfolio. The Euler equation states that E [exp(m +r )] = 1, (15) t t+1 i,t+1 where r represents the log returns for the consumption generating asset (r ). The risk-free rate, c,t c,t which represents the returns on an asset that delivers a unit of consumption in the next period with certainty, is defined as: (cid:20) (cid:21) 1 rf = ln . (16) t E (M ) t t+1 5.2 Consumption Dynamics under the Physical Measure Our specification of consumption dynamics incorporates elements from Bansal and Yaron (2004), Bekaert, Engstrom, and Ermolov (2014), and especially BTZ and Segal, Shaliastovich, and Yaron (2015). Fundamentally, we follow Bansal and Yaron (2004) in assuming that consumption growth has a predictable component. We differ from Bansal and Yaron in assuming that the predictable 29",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 66,
    "chunk_index": 58,
    "word_count": 314,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "dynamics incorporates elements from Bansal and Yaron (2004), Bekaert, Engstrom, and Ermolov (2014), and especially BTZ and Segal, Shaliastovich, and Yaron (2015). Fundamentally, we follow Bansal and Yaron (2004) in assuming that consumption growth has a predictable component. We differ from Bansal and Yaron in assuming that the predictable 29",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 66,
    "chunk_index": 59,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "component is proportional to consumption growth’s upside and downside volatility components:9 ∆c = µ +µ V +µ V +σ (ε −ε ), (17) t+1 0 1 u,t 2 d,t c u,t+1 d,t+1 where ε and ε are two mean-zero shocks that affect both the realized and expected con- u,t+1 d,t+1 sumption growth.10 ε represents upside shocks to consumption growth, and ε stands for u,t+1 d,t+1 downside shocks. Following Bekaert, Engstrom, and Ermolov (2014) and Segal, Shaliastovich, and Yaron(2015), weassumethattheseshocksfollowademeanedGammadistributionandmodelthem as ε = ε˜ −V i = {u,d}, (18) i,t+1 i,t+1 i,t where ε˜ ∼ Γ(V ,1). These distributional assumptions imply that volatilities of upside and i,t+1 i,t downside shocks are time-varying and driven by shape parameters V and V . In particular, we u,t d,t have that Var [ε ] = V , i = {u,d}. (19) t i,t+1 i,t Naturally, the total conditional variance of consumption growth when ε and ε are condi- u,t+1 d,t+1 tionally independent, is simply σ2(V +V ). c u,t d,t As a result, sign and size of µ and µ matter in this context. With µ = µ , we have a 1 2 1 2 stochastic volatility component in the conditional mean of consumption growth process, similar to the classic GARCH-in-Mean structure for modeling risk-return trade-off in equity returns. With bothslopeparametersequaltozero,themodelyieldstheBTZunpredictableconsumptiongrowth.11 If |µ | = |µ |, with µ > 0 and µ < 0, we have Skewness-in-Mean, similar in spirit to Feunou, 1 2 1 2 9Segal,Shaliastovich,andYaron(2015)maintainthisassumptionintheirdefinitionofthelong-runriskcomponent. 10This assumption is for the sake of brevity. Violating this assumption adds to algebraic complexity, but does not affect our analytical findings. 11It can be shown that assuming an unpredictable consumption growth process does not support the existence of distinct upside and downside variance risk premia that are supported by empirical evidence, if we assume agents endowed with Epstein and Zin (1989) preferences. In particular we have found that combining constant expected consumptiongrowthwithEpsteinandZin(1989)preferenceswillalwaysyieldspositiveupsidevariancerisk-premium, which is in contradiction with our empirical findings. Using asymmetric preferences, such as smooth ambiguity aversionpreferencesofKlibanoff,Marinacci,andMukerji(2009)ordisappointmentaversionofGul(1991),itmaybe possibletoderiveplausibleupsideanddownsidevarianceriskpremiaforaneconomywithunpredictableconsumption growth. Thecostwepayisthelossofclosedformanalyticalresults. Miao,Wei,andZhou(2012)usesmoothambiguity aversion preferences to motivate their study of variance risk premium, but assume time-variation in the conditional mean of the consumption growth. 30",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 66,
    "chunk_index": 60,
    "word_count": 360,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "we have found that combining constant expected consumptiongrowthwithEpsteinandZin(1989)preferenceswillalwaysyieldspositiveupsidevariancerisk-premium, which is in contradiction with our empirical findings. Using asymmetric preferences, such as smooth ambiguity aversionpreferencesofKlibanoff,Marinacci,andMukerji(2009)ordisappointmentaversionofGul(1991),itmaybe possibletoderiveplausibleupsideanddownsidevarianceriskpremiaforaneconomywithunpredictableconsumption growth. Thecostwepayisthelossofclosedformanalyticalresults. Miao,Wei,andZhou(2012)usesmoothambiguity aversion preferences to motivate their study of variance risk premium, but assume time-variation in the conditional mean of the consumption growth. 30",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 66,
    "chunk_index": 61,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Jahan-Parvar, and T´edongap (2013) formulation for equity returns. With µ (cid:54)= µ , we have free 1 2 parameters that have an impact on loadings of risk factors on risky asset returns and the stochastic discount factor. Both µ and µ are real-valued. Intuitively, we expect µ > 0: a rise in upside 1 2 1 volatility at time t implies higher consumption growth at time t+1, all else equal. By the same logic, we intuitively expect a negative-valued µ , implying an expected fall in consumption growth 2 following an up-tick in downside volatility – following bad economic outcomes, households curb their consumption. In what follows, we buttress our intuition with theory and derive the analytical bounds on these parameters that ensure consistency with empirical facts. We observe that lnE exp(νε ) = f(ν)V , (20) t i,t+1 i,t where f(ν) = −(ln(1−ν)+ν). Both Bekaert, Engstrom, and Ermolov (2014) and Segal, Shalias- tovich, and Yaron (2015) use this compact functional form for the Gamma-distribution cumulant. It simply follows that f(ν) > 0,f(cid:48)(cid:48)(ν) > 0, and f(ν) > f(−ν) for all ν > 0. We assume that V follow a time-varying, square root process with time-varying volatility- i,t of-volatility, similar to the specification of the volatility process in Bollerslev, Tauchen, and Zhou (2009): √ V = α +β V + q zu , (21) u,t+1 u u u,t u,t t+1 √ q = γ +γ q +ϕ q z1 , (22) u,t+1 u,0 u,1 u,t u u,t t+1 √ V = α +β V + q zd , (23) d,t+1 d d d,t d,t t+1 √ q = γ +γ q +ϕ q z2 , (24) d,t+1 d,0 d,1 d,t d d,t t+1 where zi are standard normal innovations, and i = {u,d,1,2}. The parameters must satisfy the t following restrictions: α > 0,α > 0,γ > 0,γ > 0,|β | < 1,|β | < 1,|γ | < 1,|γ | < u d u,0 d,0 u d u,1 d,1 1,ϕ > 0,ϕ > 0. In addition we assume that {zu}, (cid:8) zd(cid:9) , (cid:8) z1(cid:9) , and (cid:8) z2(cid:9) are i.i.d. ∼ N(0,1), and u d t t t t jointly independent from {ε } and {ε }. u,t d,t The assumptions above yield time-varying uncertainty and asymmetry in consumption growth. Through volatility-of-volatility processes q and q , the set up induces additional temporal vari- u,t d,t ation in consumption growth. Temporal variation in volatility-of-volatility process is necessary for 31",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 66,
    "chunk_index": 62,
    "word_count": 410,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "jointly independent from {ε } and {ε }. u,t d,t The assumptions above yield time-varying uncertainty and asymmetry in consumption growth. Through volatility-of-volatility processes q and q , the set up induces additional temporal vari- u,t d,t ation in consumption growth. Temporal variation in volatility-of-volatility process is necessary for 31",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 66,
    "chunk_index": 63,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "generating sizable variance risk premium. Asymmetry is needed to generate upside and downside variance risk premia, as we show in what follows. We solve the model following the same methodology proposed by Bansal and Yaron (2004), Bollerslev, Tauchen, and Zhou (2009), Segal, Shaliastovich, and Yaron (2015), and many others. We consider that the logarithm of wealth-consumption ratio w or price-consumption ratio (pc = t t (cid:16) (cid:17) ln Pt ) for the asset that pays the consumption endowment {C }∞ , is affine with respect to Ct t+i i=1 state variables V and q . i,t i,t We then posit that the consumption-generating returns are approximately linear with respect to the log price-consumption ratio, as popularized by Campbell and Shiller (1988). That is: r = κ +κ w −w +∆c , c,t+1 0 1 t+1 t t+1 w = A +A V +A V +A q +A q , t 0 1 u,t 2 d,t 3 u,t 4 d,t where κ and κ are log-linearization coefficients and A ,A ,A ,A and A are factor loading 0 1 0 1 2 3 4 coefficients to be determined. We solve for the consumption-generating asset returns, r , using c,t theEulerequation(15). Followingstandardarguments,wefindtheequilibriumvaluesofcoefficients A to A : 0 4 (cid:20) (cid:21) f σ (1−γ) +(1−γ)µ c 1 A = − , (25) 1 θ(κ β −1) 1 u (cid:20) (cid:21) f −σ (1−γ) +(1−γ)µ c 2 A = − , (26) 2 θ(κ β −1) 1 d (cid:112) (1−κ γ )− (1−κ γ )2−θ2ϕ2κ4A2 A = 1 u,1 1 u,1 u 1 1, (27) 3 θκ2ϕ2 1 u (cid:113) (1−κ γ )− (1−κ γ )2−θ2ϕ2κ4A2 1 d,1 1 d,1 d 1 2 A = , (28) 4 θκ2ϕ2 1 d lnδ+ (cid:0) 1− 1(cid:1) µ +κ +κ (cid:0) α A +α A +γ A +γ A (cid:1) ψ 0 0 1 u 1 d 2 u,0 3 d,0 4 A = . (29) 0 1−κ 1 It is easy to see that while A and A are negative-valued, the signs of A and A depend 3 4 1 2 on signs and sizes of µ and µ . We report the conditions that ensure A > 0 and A < 0 after 1 2 1 2 32",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 66,
    "chunk_index": 64,
    "word_count": 374,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "is easy to see that while A and A are negative-valued, the signs of A and A depend 3 4 1 2 on signs and sizes of µ and µ . We report the conditions that ensure A > 0 and A < 0 after 1 2 1 2 32",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 66,
    "chunk_index": 65,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "introducing the dynamics of the model under the risk-neutral measure. Standard algebraic manipulations yield the following representations for conditional equity pre- mium and innovations of conditional equity premium: (cid:20) (cid:21) (cid:20) (cid:21) µ µ f[σ (1−γ)] µ f[−σ (1−γ)] 0 1 c 2 c r = lnδ+ + − V + − V c,t+1 u,t d,t ψ ψ θ ψ θ +σ (ε −ε )+(κ γ −1)A q +(κ γ −1)A q (30) c u,t+1 d,t+1 1 u,1 3 u,t 1 d,1 4 d,t +κ (cid:104) (cid:0) A zu +ϕ A z1 (cid:1)√ q + (cid:16) A zd +ϕ A z2 (cid:17)√ q (cid:105) , 1 1 t+1 u 3 t+1 u,t 2 t+1 d 4 t+1 d,t r −E (r ) = σ (ε −ε ) c,t+1 t c,t+1 c u,t+1 d,t+1 +κ (cid:104) (cid:0) A zu +ϕ A z1 (cid:1)√ q + (cid:16) A zd +ϕ A z2 (cid:17)√ q (cid:105) . (31) 1 1 t+1 u 3 t+1 u,t 2 t+1 d 4 t+1 d,t It is immediately obvious that there is significant correspondence between our characterization of risky returns and equation (10) of BTZ. The differences are driven by the different distribu- tional assumptions regarding consumption growth shocks and the fact that we model upside and downside uncertainty explicitly rather than targeting aggregate uncertainty as in BTZ. Notice that (cid:104) (cid:105) (cid:104) (cid:105) − f[σc(1−γ)] < − f[−σc(1−γ)] and both terms are positive-valued. Thus, the impact of V and θ θ u,t V on expected returns depend on µ and µ . We provide a crisp characterization of the equity d,t 1 2 premium to complete the analysis subsequently. Due to differences in distributional assumptions, we do not follow BTZ or Bansal and Yaron methods for deriving equity premium and various variance risk premia. The dynamics specified so farareallunderthephysicalmeasure(P). Weneedtocomputethedynamicsundertherisk-neutral measure (Q) to derive the formulae for upside and downside variance risk premia and skewness risk premium. 5.3 Risk-Neutral Dynamics and the Premia We derive the risk-neutral distribution of all the shocks, ε , ε , zu , zd , z1 , and z2 . u,t+1 d,t+1 t+1 t+1 t+1 t+1 Namely, we construct the characteristic functions of the shocks and exploit their salient properties to derive the expectations under the risk-neutral measure. Thus, our computations yield exact equity and risk premia measures, in contrast to approximate values reported by, for example, in equation (15) of Bollerslev, Tauchen, and Zhou (2009) or in Drechsler and Yaron (2011). Details 33",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 66,
    "chunk_index": 66,
    "word_count": 413,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "shocks and exploit their salient properties to derive the expectations under the risk-neutral measure. Thus, our computations yield exact equity and risk premia measures, in contrast to approximate values reported by, for example, in equation (15) of Bollerslev, Tauchen, and Zhou (2009) or in Drechsler and Yaron (2011). Details 33",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 66,
    "chunk_index": 67,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "of these derivations are available in the online Appendix. The risk-neutral expectations of the upside and downside consumption shocks are γσ EQ [ε ] = f(cid:48)(−γσ )V = − c V , t u,t+1 c u,t 1+γσ u,t c γσ EQ [ε ] = f(cid:48)(γσ )V = c V . t d,t+1 c d,t 1−γσ d,t c Using a similar methodology, we characterize the risk-neutral distributions of Gaussian shocks zu , zd , z1 , and z2 : t+1 t+1 t+1 t+1 zu ∼ Q N (cid:0) (θ−1)κ A √ q ,1 (cid:1) t+1 1 1 u,t zd ∼ Q N (cid:0) (θ−1)κ A √ q ,1 (cid:1) t+1 1 2 d,t z1 ∼ Q N (cid:0) (θ−1)κ A ϕ √ q ,1 (cid:1) t+1 1 3 u u,t z2 ∼ Q N (cid:0) (θ−1)κ A ϕ √ q ,1 (cid:1) . t+1 1 4 d d,t Any premium – whether equity, variance risk, or skewness risk premia – can be defined as the difference between the physical and risk-neutral expectations of processes. Hence, we commence computing the premia of interest, starting with the equity risk premium: ERP ≡ E [r ]−EQ [r ] t t c,t+1 t c,t+1 (cid:16) (cid:17) = κ E [w ]−EQ [w ] +E [∆c ]−EQ [∆c ]. (32) 1 t t+1 t t+1 t t+1 t t+1 It is clear from equation (32) that we need to compute both E [∆c ] − EQ [∆c ] and t t+1 t t+1 E [w ]−EQ [w ]. It can be shown that: t t+1 t t+1 (cid:18) (cid:19) 1 1 E [∆c ]−EQ [∆c ] = γσ2 V + V . t t+1 t t+1 c 1+γσ u,t 1−γσ d,t c c 34",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 66,
    "chunk_index": 68,
    "word_count": 288,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "− EQ [∆c ] and t t+1 t t+1 E [w ]−EQ [w ]. It can be shown that: t t+1 t t+1 (cid:18) (cid:19) 1 1 E [∆c ]−EQ [∆c ] = γσ2 V + V . t t+1 t t+1 c 1+γσ u,t 1−γσ d,t c c 34",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "4.3 Reaction to announcements and events",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 66,
    "chunk_index": 69,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.3 Reaction to announcements and events (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(cid:16) (cid:17) (cid:16) (cid:17) E [w ]−EQ [w ] = A E [V ]−EQ [V ] +A E [V ]−EQ [V ] t t+1 t t+1 1 t u,t t u,t 2 t d,t t d,t (cid:16) (cid:17) (cid:16) (cid:17) +A E [q ]−EQ [q ] +A E [q ]−EQ [q ] . 3 t u,t t u,t 4 t d,t t d,t To compute E [w ]−EQ [w ], we need the premia for each risk factor (V ,V ,q and q ). t t+1 t t+1 u,t d,t u,t d,t Straightforward algebra yields: E [V ]−EQ [V ] = (1−θ)κ A q , t u,t t u,t 1 1 u,t E [V ]−EQ [V ] = (1−θ)κ A q , t d,t t d,t 1 2 d,t E [q ]−EQ [q ] = (1−θ)κ A ϕ2q , t u,t t u,t 1 3 u u,t E [q ]−EQ [q ] = (1−θ)κ A ϕ2q . t d,t t d,t 1 4 d d,t Thus, it easily follows that the equity premium in our model is: ERP ≡ γσ c 2 V + γσ c 2 V +(1−θ)κ (cid:0) A2+A2ϕ2(cid:1) q +(1−θ)κ (cid:0) A2+A2ϕ2(cid:1) q . (33) t 1+γσ u,t 1−γσ d,t 1 1 3 u u,t 1 2 4 d d,t c c This expression for equity premium clearly shows that our model implies unequal loadings for upside and downside volatility factors. The slope coefficients for volatility-of-volatility factors are also – in general – unequal. We require that σ < 1 to maintain finite factor loadings. c γ Weproceedandderivetheclosedformexpressionsforupsideanddownsidevarianceriskpremia. From equation (31) we know that σ2 ≡ Var [r ] r,t t c,t+1 (cid:104) (cid:104) √ √ (cid:105)(cid:105) = Var σ (ε −ε )+κ (A zu +ϕ A z1 ) q +(A zd +ϕ A z2 ) q t c u,t+1 d,t+1 1 1 t+1 u 3 t+1 u,t 2 t+1 d 4 t+1 d,t = σ2V +σ2V +κ2(cid:0) A2+A2ϕ2(cid:1) q +κ2(cid:0) A2+A2ϕ2(cid:1) q , c u,t c d,t 1 1 3 u u,t 1 2 4 d d,t 35",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 66,
    "chunk_index": 70,
    "word_count": 342,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "q +(A zd +ϕ A z2 ) q t c u,t+1 d,t+1 1 1 t+1 u 3 t+1 u,t 2 t+1 d 4 t+1 d,t = σ2V +σ2V +κ2(cid:0) A2+A2ϕ2(cid:1) q +κ2(cid:0) A2+A2ϕ2(cid:1) q , c u,t c d,t 1 1 3 u u,t 1 2 4 d d,t 35",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 66,
    "chunk_index": 71,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "where upside and downside variances are defined as: (cid:0) σu (cid:1)2 = σ2V +κ2(cid:0) A2+A2ϕ2(cid:1) q , (34) r,t c u,t 1 1 3 u u,t (cid:16) σd (cid:17)2 = σ2V +κ2(cid:0) A2+A2ϕ2(cid:1) q . (35) r,t c d,t 1 2 4 d d,t Using the definition of variance risk premium, we compute the upside variance risk premium as: (cid:104) (cid:105) (cid:104) (cid:105) VRPU ≡ EQ (cid:0) σu (cid:1)2 −E (cid:0) σu (cid:1)2 , t t r,t+1 t r,t+1 = (θ−1) (cid:0) σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2(cid:1) q . (36) c 1 1 1 1 3 u 3 u u,t Similarly, we derive the following expression for the downside variance risk premium: (cid:20) (cid:21) (cid:20) (cid:21) VRPD ≡ EQ (cid:16) σd (cid:17)2 −E (cid:16) σd (cid:17)2 t t r,t+1 t r,t+1 = (θ−1) (cid:0) σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2(cid:1) q . (37) c 1 2 1 2 4 d 4 d d,t Empirical evidences, presented in Section 4.4, imply VRPU < 0 and VRPD > 0, hence it t t follows that σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2 > 0, (38) c 1 1 1 1 3 u 3 u σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2 < 0. (39) c 1 2 1 2 4 d 4 d Since A < 0, A < 0 is a sufficient condition for σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2 < 0. Moreover, 4 2 c 1 2 1 2 4 d 4 d (cid:20) (cid:21) f −σc(1−γ) A < 0 ⇔ µ < . In particular, µ ≤ 0 ⇒ A < 0 ⇒ VRPd > 0. Since A < 0, A > 0 2 2 γ−1 2 2 t 3 1 is a necessary condition for σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2 > 0. It is easily shown that c 1 1 1 1 3 u 3 u σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2 > 0 ⇔ AL < A < AU c 1 1 1 1 3 u 3 u 1 1 1 with (cid:113) (cid:113) −σ2κ + σ4κ2−4 (cid:0) κ3A ϕ2 (cid:1)2 A2ϕ2 −σ2κ − σ4κ2−4 (cid:0) κ3A ϕ2 (cid:1)2 A2ϕ2 AL = c 1 c 1 1 3 u 3 u , AU = c 1 c 1 1 3 u 3 u . 1 2κ3A ϕ2 1 2κ3A ϕ2 1 3 u 1 3 u 36",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 66,
    "chunk_index": 72,
    "word_count": 390,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "(cid:0) κ3A ϕ2 (cid:1)2 A2ϕ2 −σ2κ − σ4κ2−4 (cid:0) κ3A ϕ2 (cid:1)2 A2ϕ2 AL = c 1 c 1 1 3 u 3 u , AU = c 1 c 1 1 3 u 3 u . 1 2κ3A ϕ2 1 2κ3A ϕ2 1 3 u 1 3 u 36",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 66,
    "chunk_index": 73,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Both AU and AL are positive. In addition, it is easy to see that 1 1 (cid:20) (cid:21) f σ (1−γ) +(1−γ)µ c 1 AL < A < AU ⇔ AL < − < AU, 1 1 1 1 θ(κ β −1) 1 1 u AL < A < AU ⇔ µL < µ < µU, 1 1 1 1 1 1 with (cid:20) (cid:21) f σ (1−γ) +θ(κ β −1)AL c 1 u 1 µL = > 0, 1 γ −1 (cid:20) (cid:21) f σ (1−γ) +θ(κ β −1)AU c 1 u 1 µU = > 0, 1 γ −1 which implies µ > 0. 1 Consequently, confirming our earlier intuition, we find that for upside variance risk-premium to be negative, expected consumption growth must increases with the upside variance. Similarly, a non-positive relation between expected consumption growth and downside variance is sufficient to induce a positive downside variance risk-premium. Next, we derive the closed form expression for the skewness risk premium. Following Feunou, Jahan-Parvar, and T´edongap (2013, 2014), we define the skewness as sk = (cid:0) σu (cid:1)2 − (cid:16) σd (cid:17)2 . r,t r,t r,t As a result, we calculate the skewness risk premium as SRP ≡ VRPu−VRPd t t t (cid:20) (cid:20) (cid:21) (cid:20) (cid:21)(cid:21) = (cid:104) EQ (cid:104) (cid:0) σu (cid:1)2 (cid:105) −E (cid:104) (cid:0) σu (cid:1)2 (cid:105)(cid:105) − EQ (cid:16) σd (cid:17)2 −E (cid:16) σd (cid:17)2 , t r,t+1 t r,t+1 t r,t+1 t r,t+1 = (θ−1) (cid:2)(cid:0) σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2(cid:1) q − (cid:0) σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2(cid:1) q (cid:3) .(40) c 1 1 1 1 3 u 3 u u,t c 1 2 1 2 4 d 4 d d,t Based on our theoretical findings so far, it is easy to see that given θ < 0 and conditions (38) 37",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 66,
    "chunk_index": 74,
    "word_count": 303,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "σ2κ A +κ3(cid:0) A2+A2ϕ2(cid:1) A ϕ2(cid:1) q (cid:3) .(40) c 1 1 1 1 3 u 3 u u,t c 1 2 1 2 4 d 4 d d,t Based on our theoretical findings so far, it is easy to see that given θ < 0 and conditions (38) 37",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 66,
    "chunk_index": 75,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "and (39) – which we just verified – skewness risk premium is negative-valued, in compliance with our empirical findings in Section 4 and in Figure 7. Finally, since equation (33) implies that the equity risk-premium load positively on both q and q , and because VRPU < 0 is negatively u,t d,t t proportional to q and VRPD > 0 is positively proportional to q , the equity risk-premium u,t t d,t load positively on the downside variance risk-premium and negatively on the upside variance risk- premium, in compliance with our empirical findings in Section 4 and in Table 9. At this point, we have fully characterized the equity risk premium, upside and downside variance risk premia, the skewness risk premium, and by extension, risky asset returns. In a nutshell, we show that first, our empirical findings are naturally aligned with a simple consumption-based asset pricing model. Second, the assumptions needed to support our empirical resultsaremild–werequiredistinctandtime-varyingupsideanddownsideshockstotheconsump- tion growth process, a predictable component in conditional consumption growth proportional to these up and down shocks variances, and an affine loading on risk factors. These are commonly maintainedassumptionsinthevarianceriskpremiumliterature. Giventheseassumptions, weshow that the upside variance risk premium is smaller in absolute term than the downside variance risk premium, that both upside and downside variance risk premia have opposite signs, and that the skewness risk premium is a negative-valued quantity. 6 Conclusion Inthisstudy,wehavedecomposedthecelebratedvarianceriskpremiumofBollerslev,Tauchen,and Zhou (2009) – arguably one of the most successful short-term predictors of excess equity returns – to show that its prediction power stems from the downside variance risk premium embedded in this measure. Market participants seem more concerned with market downturns and demand a premium for bearing that risk. By contrast, they seem to like upward uncertainty in the market. As a result, the downside variance risk premium – the difference between option-implied, risk- neutral expectations of market downside volatility and historical, realized downside variances – demonstrates significant prediction power (that is at least as powerful as the variance risk premium and often stronger) for excess returns. We also show that the difference between upside and downside variance risk premia – our 38",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 66,
    "chunk_index": 76,
    "word_count": 351,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "risk- neutral expectations of market downside volatility and historical, realized downside variances – demonstrates significant prediction power (that is at least as powerful as the variance risk premium and often stronger) for excess returns. We also show that the difference between upside and downside variance risk premia – our 38 proposed measure of the skewness risk premium – is both a priced factor in equity markets and a powerful predictor of excess returns. The skewness risk premium performs well for intermediate prediction steps beyond the reach of short-run predictor such as downside variance risk or variance risk premia and long-term predictors such as price-dividend or price-earning ratios alike. The skewnessriskpremiumconstructedfromone-month’sworthofdatapredictsexcessreturnsbetween 8 months to a year ahead. The same measure constructed from a quarter’s worth of data, predicts monthly excess returns between 4 months to one year ahead. Our findings demonstrate remarkable robustness to the inclusion of common pricing variables. Downside variance risk and skewness risk premia have similar or better out-of-sample forecast ability in comparison with common pricing factors. Finally, we show that our results are compatible with a simple equilibrium consumption-based asset pricing model. We develop a model where consumption growth features separate upside and downside time-varying shock processes, with feedback from volatilities to future growth. We show that under mild requirements about consumption growth, upside, and downside volatility processes, we can characterize the equity premium, upside and downside variance risk premia, and the skewness risk premium that support the main stylized facts obtained from our empirical investigation. In particular, we observe unequal weights for upside and downside variances in the equity premium, and opposite signs for upside and downside variance risk premia. 39",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 66,
    "chunk_index": 77,
    "word_count": 275,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "equity premium, upside and downside variance risk premia, and the skewness risk premium that support the main stylized facts obtained from our empirical investigation. In particular, we observe unequal weights for upside and downside variances in the equity premium, and opposite signs for upside and downside variance risk premia. 39",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "Similarly:",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 66,
    "chunk_index": 78,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Similarly: (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Amaya, D., P. Christoffersen, K. Jacobs, and A. Vasquez. 2013. Does realized skewness predict the cross-section of equity returns? Working Paper, UQAM, Rotman School of Management - University of Toronto, C.T. Bauer College of Business - University of Houston, and ITAM School of Business . Amengual, D., and D. Xiu. 2014. Resoution of policy uncertainty and sudden declines in volatility. Working Paper, CEMFI and Chicago Booth . Andersen, T. G., T. Bollerslev, F. X. Diebold, and H. Ebens. 2001a. The distribution of realized stock return volatility. Journal of Financial Economics 61:43–76. Andersen, T. G., T. Bollerslev, F. X. Diebold, and P. Labys. 2001b. The distribution of realized exchange rate volatility. Journal of the American Statistical Association 96:42–55. ———. 2003. Modeling and forecasting realized volatility. Econometrica 71:579–625. Andersen, T. G., and O. Bondarenko. 2007. Volatility as an asset class, chap. Construction and Interpretation of Model-Free Implied Volatility, 141–81. London, U.K.: Risk Books. Andersen, T. G., O. Bondarenko, and M. T. Gonzalez-Perez. 2014. Exploring return dynamics via corridor implied volatility. Working Paper . Ang, A., andG.Bekaert.2007. Stockreturnpredictability: Isitthere? Review of Financial Studies 20:651–707. Bakshi, G., N. Kapadia, and D. Madan. 2003. Stock return characteristics, skew laws and the differential pricing of individual equity options. Review of Financial Studies 16:101–43. Bandi, F. M., and R. Ren`o. 2014. Price and volatility co-jumps. Journal of Financial Economics, forthcoming . Bansal, R., and A. Yaron. 2004. Risks for the long run: A potential resolution of asset pricing puzzles. Journal of Finance 59:1481–1509. Barndorff-Nielsen, O. E., S. Kinnebrock, and N. Shephard. 2010. Volatility and time series econo- metrics: Essays in honor of robert f. engle, chap.Measuringdownsiderisk: realisedsemivariance, 117–36. Oxford University Press. Bekaert, G., E. Engstrom, and A. Ermolov. 2014. Bad environments, good environments: A non- gaussian asymmetric volatility model. Journal of Econometrics, forthcoming . Bollerslev, T., G. Tauchen, and H. Zhou. 2009. Expected stock returns and variance risk premia. Review of Financial Studies 22:4463–92. Bollerslev, T., and V. Todorov. 2011a. Estimation of jump tails. Econometrica 79:1727–83. ———. 2011b. Tails, fears and risk premia. Journal of Finance 66:2165–211. Boyer, M. M., E. Jacquier, and S. van Norden. 2012. Are underwriting cycles real and forecastable? The Journal of Risk and Insurance 79:995–1015. Campbell, J. Y., and R. J. Shiller. 1988. The dividend-price ratio and expectations of future dividends and discount factors. Review of Financial Studies 1:195–228. 40",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 66,
    "chunk_index": 79,
    "word_count": 388,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Finance 66:2165–211. Boyer, M. M., E. Jacquier, and S. van Norden. 2012. Are underwriting cycles real and forecastable? The Journal of Risk and Insurance 79:995–1015. Campbell, J. Y., and R. J. Shiller. 1988. The dividend-price ratio and expectations of future dividends and discount factors. Review of Financial Studies 1:195–228. 40",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 66,
    "chunk_index": 80,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Carr, P., and D. Madan. 1998. Volatility, chap. Towards a Theory of Volatility Trading, 417–27. Risk Publications. ———. 1999. Option valuation using the fast fourier transform. Journal of Computational Finance 2:61–73. ———. 2001. Quantitative analysis of financial markets, vol. 2, chap. Determining Volatility Sur- faces and Option Values from an Implied Volatility Smile, 163–91. World Scientific Press. Chang, B., P. Christoffersen, and K. Jacobs. 2013. Market skewness risk and the cross-section of stock returns. Journal of Financial Economics 107:46–68. Cochrane, J. H. 1991. Production-based asset pricing and the link between stock returns and economic fluctuations. Journal of Finance 46:209–37. Colacito, R., E. Ghysels, and J. Meng. 2014. Skewness in expected macro fundamentals and the predictability of equity returns: Evidence and theory. Working Paper, Kenan Flagler Business School, UNC Chapel Hill . Corsi,F.2009. Asimpleapproximatelong-memorymodelofrealizedvolatility. JournalofFinancial Econometrics 7:174–96. Diebold, F. X., and R. S. Mariano. 1995. Comapring predictive accuracy. Journal of Business and Economic Statistics 13:253–63. Dionne, G., J. Li, and C. Okou. 2014. An extension of the consumption-based CAPM model. Working Paper, HEC Montr´eal, Lingnan University, and UQAM . Drechsler, I., and A. Yaron. 2011. Whats Vol got to do with it? Review of Financial Studies 24:1–45. Eeckhoudt, L., and H. Schlesinger. 2008. Changes in risk and the demand for saving. Journal of Monetary Economics 55:1329 – 1336. Epstein, L. G., and S. E. Zin. 1989. Substitution, risk aversion, and the temporal behavior of consumption and asset returns: A theoretical framework. Econometrica 57:937–69. Fama, E. F., and K. R. French. 1988. Dividend yields and expected stock returns. Journal of Financial Economics 22:3–25. ———. 1989. Business conditions and expected returns on stocks and bonds. Journal of Financial Economics 25:23–49. Feunou,B.,J.-S.Fontaine,A.Taamouti,andR.T´edongap.2014. Riskpremium,variancepremium, and the maturity structure of uncertainty. Review of Finance 18:219–69. Feunou, B., M. R. Jahan-Parvar, and R. T´edongap. 2013. Modeling Market Downside Volatility. Review of Finance 17:443–81. ———. 2014. Which parametric model for conditional skewness? European Journal of Finance, forthcoming . Ghysels, E., A. Plazzi, and R. Valkanov. 2011. Conditional Skewness of Stock Market Returns in Developed and Emerging Markets and its Economic Fundamentals. Working Paper, Kenan- Flagler Business School-UNC, and Rady School of Business-UCSD . 41",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 66,
    "chunk_index": 81,
    "word_count": 356,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "———. 2014. Which parametric model for conditional skewness? European Journal of Finance, forthcoming . Ghysels, E., A. Plazzi, and R. Valkanov. 2011. Conditional Skewness of Stock Market Returns in Developed and Emerging Markets and its Economic Fundamentals. Working Paper, Kenan- Flagler Business School-UNC, and Rady School of Business-UCSD . 41",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 66,
    "chunk_index": 82,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Gilchrist, S., R. Schoenle, J. W. Sim, and E. Zakrajˇsek. 2014. Inflation dynamics during the financial crisis. Working Paper, Federal Reserve Board and Boston University . Goyal, A., and I. Welch. 2008. A comprehensive look at the empirical performance of equity premium prediction. Review of Financial Studies 21:1455–508. Groeneveld, R., andG.Meeden.1984. Measuringskewnessandkurtosis. The Statistician 33:391–9. Gul, F. 1991. A Teory of Disappointment Aversion. Econometrica 59:667–86. Hansen, P. R., and A. Lunde. 2006. Realized variance and market microstructure noise. Journal of Business and Economic Statistics 24:127–61. Harvey, C. R., and A. Siddique. 1999. Autoregressive Conditional Skewness. Journal of Financial and Quantitative Analysis 34:465–88. ———. 2000. Conditional Skewness in Asset Pricing Tests. Journal of Finance 55:1263–95. Hodrick, R. J. 1992. Dividend yields and expected stock returns: Alternative procedures for inference and measurement. Review of Financial Studies 5:357–386. Inoue,A.,andL.Kilian.2004. In-sampleorout-of-sampletestsofpredictability: Whichoneshouldf we use? Econometric Reviews 23:371–402. Jacquier, E., and C. Okou. 2014. Disentangling continuous volatility from jumps in long-run risk- return relationships. Journal of Financial Econometrics 12:544–83. Kelly, B.T., andH.Jiang.2014. Tailriskandassetprices. Review of Financial Studies 27:2841–71. Kelly,B.T.,andS.Pruitt.2013. Marketexpectationsinthecrosssectionofpresentvalues. Journal of Finance 68:1721–56. Kim, T.-H., and H. White. 2004. On More Robust Estimation of Skewness and Kurtosis. Finance Research Letters 1:56–73. Klibanoff,P.,M.Marinacci,andS.Mukerji.2009. Recursivesmoothambiguitypreferences. Journal of Economic Theory 144:930–76. Kozhan, R., A. Neuberger, and P. Schneider. 2014. The skew risk premium in the equity index market. Review of Financial Studies 26:2174–203. Kreps, D. M., and E. L. Porteus. 1978. Temporal Resolution of Uncertainty and Dynamic Choice Theory. Econometrica 46:185–200. Lettau, M., and S. Ludvigson. 2001. Consumption, aggregate wealth, and expected stock returns. Journal of Finance 56:815–50. Ludvigson, S. C., and S. Ng. 2009. Macro factors in bond risk premia. Review of Financial Studies 22:5027–67. Miao, J., B. Wei, and H. Zhou. 2012. Ambiguity aversion and variance premium. Working Paper, Federal Reserve Board and Boston University . Nakamura, E., J. Steinsson, R. Barro, and J. Ursu´a. 2013. Crises and recoveries in an empirical model of consumption disasters. American Economic Journal: Macroeconomics 5:35–74. 42",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 66,
    "chunk_index": 83,
    "word_count": 327,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Studies 22:5027–67. Miao, J., B. Wei, and H. Zhou. 2012. Ambiguity aversion and variance premium. Working Paper, Federal Reserve Board and Boston University . Nakamura, E., J. Steinsson, R. Barro, and J. Ursu´a. 2013. Crises and recoveries in an empirical model of consumption disasters. American Economic Journal: Macroeconomics 5:35–74. 42 Neuberger, A. 2012. Realized skewness. Review of Financial Studies 25:3423–55. Segal, G., I. Shaliastovich, and A. Yaron. 2015. Good and bad uncertainty: Macroeconomic and financial market implications. Journal of Financial Economics, forthcoming . Weil, P. 1989. The equity premium puzzle and the risk-free rate puzzle. Journal of Monetary Economics 24:401–21. West, K. D. 1996. Asymptotic inference about predictive ability. Econometrica 64:1067–84. 43 Table 1: Summary Statistics Mean (%) Median (%) Std. Dev. (%) Skewness Kurtosis AR(1) Panel A: Excess Returns Equity 1.9771 14.5157 20.9463 -0.1531 10.5559 -0.0819 Equity (1996-2007) 3.0724 12.5824 17.6474 -0.1379 5.9656 -0.0165 Panel B: Risk-Neutral Variance 19.3544 18.7174 6.6110 1.5650 7.6100 0.9897 Downside Variance 16.9766 16.2104 5.8727 1.6746 8.0637 0.9880 Upside Variance 9.2570 9.1825 3.1295 1.1479 6.0030 0.9885 Skewness -7.7196 -7.0090 3.0039 -2.0380 9.6242 0.9679 Panel C: Realized Variance 19.2776 18.1475 8.7583 2.0683 8.7517 0.9998 Downside Variance 13.5841 12.7362 6.2639 2.0297 8.6130 0.9998 Upside Variance 13.6748 12.9029 6.1295 2.1022 8.8680 0.9998 Skewness 0.0907 0.1186 0.4124 -0.3292 2.7632 0.9694 Panel D: Risk Premium Variance 0.0768 0.8349 4.7214 -1.3578 7.5797 0.9802 Downside Variance 3.3925 3.3805 3.5259 -0.0114 5.9518 0.9684 Upside Variance -4.4178 -3.3486 3.7281 -2.4339 10.6756 0.9909 Skewness -7.8103 -6.9824 2.9213 -2.1850 10.3067 0.9668 Thistablereportsthesummarystatisticsforthequantitiesinvestigatedinthisstudy. Mean,median,andstandarddeviation valuesareannualizedandinpercentages. Wereportexcesskurtosisvalues. AR(1)representsthevaluesforthefirstautocor- relationcoefficient. ThefullsampleisSeptember1996toDecember2010. Wealsoconsiderasub-sampleendinginDecember 2007. 44",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 66,
    "chunk_index": 84,
    "word_count": 255,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "0.0907 0.1186 0.4124 -0.3292 2.7632 0.9694 Panel D: Risk Premium Variance 0.0768 0.8349 4.7214 -1.3578 7.5797 0.9802 Downside Variance 3.3925 3.3805 3.5259 -0.0114 5.9518 0.9684 Upside Variance -4.4178 -3.3486 3.7281 -2.4339 10.6756 0.9909 Skewness -7.8103 -6.9824 2.9213 -2.1850 10.3067 0.9668 Thistablereportsthesummarystatisticsforthequantitiesinvestigatedinthisstudy. Mean,median,andstandarddeviation valuesareannualizedandinpercentages. Wereportexcesskurtosisvalues. AR(1)representsthevaluesforthefirstautocor- relationcoefficient. ThefullsampleisSeptember1996toDecember2010. Wealsoconsiderasub-sampleendinginDecember 2007. 44 Table 2: S&P 500 Index Option Data OTM Put OTM Call 79.0 < S/S 99.0 < S/S < 79.0 10.1 < S/S < 99.0 30.1 < S/S < 10.1 50.1 < S/S < 30.1 50.1 > S/S llA Panel A: By Moneyness Number of contracts 223,579 57,188 71,879 57,522 26,154 100,121 536,443 Average price 15.08 39.44 39.67 38.47 21.97 15.50 23.90 Average implied volatility 25.68 17.05 15.88 15.58 14.30 16.31 20.06 03 < MTD 06 < MTD < 03 09 < MTD < 06 021 < MTD < 09 051 < MTD < 021 051 > MTD llA Panel B: By Maturity Number of contracts 115,392 140,080 83,937 36,163 22,302 138,569 536,443 Average price 10.45 14.90 20.17 24.88 26.20 45.82 23.90 Average implied volatility 19.40 20.20 20.06 21.11 20.48 20.13 20.06 51 < XIV 02 < XIV < 51 52 < XIV < 02 03 < XIV < 52 53 < XIV < 03 53 > XIV llA Panel C: By VIX Level Number of contracts 74,048 115,970 164,832 88,146 37,008 56,439 536,443 Average price 17.90 20.70 24.89 26.84 26.80 28.93 23.90 Average implied volatility 11.63 15.92 19.42 22.20 25.31 34.72 20.06 This table sorts S&P 500 index option data by moneyness, maturity, and VIX level. Out-of-the-money (OTM) call and put optionsfromOptionMetricsfromSeptember3,1996toDecember30,2010areused. Themoneynessismeasuredbytheratio of the strike price (S) to underlying asset price (S). DTM is the time to maturity in number of calendar days. The average priceandtheaverageimpliedvolatilityareexpressedindollarsandpercentages,respectively. 45",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 66,
    "chunk_index": 85,
    "word_count": 288,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "22.20 25.31 34.72 20.06 This table sorts S&P 500 index option data by moneyness, maturity, and VIX level. Out-of-the-money (OTM) call and put optionsfromOptionMetricsfromSeptember3,1996toDecember30,2010areused. Themoneynessismeasuredbytheratio of the strike price (S) to underlying asset price (S). DTM is the time to maturity in number of calendar days. The average priceandtheaverageimpliedvolatilityareexpressedindollarsandpercentages,respectively. 45 selbairaV cimonoceorcaM dna laicnaniF dna stnenopmoC muimerP ksiR ecnairaV neewteb pihsnoitaleR :3 elbaT muimerPksiRecnairaVedisnwoD muimerPksiRecnairaV 2R tatS-t elbairaV 2R tatS-t elbairaV 25.42 76.7 etavirPlatoT,slloryaPmrafnoN 49.14 44.11 etavirPlatoT,slloryaPmrafnoN 07.12 80.7 slairetaMsdooGelbaruD,IPI 60.83 55.01 edarTelaselohW,slloryaPmrafnoN 62.12 99.6 edarTelaselohW,slloryaPmrafnoN 97.33 16.9 slairetaMsdooGelbaruD,IPI 04.02 18.6 xednIlatoT,xednInoitcudorPlairtsudnI 96.13 61.9 seitilitU&edarT,noitatropsnarT,slloryaPmrafnoN 74.91 26.6 seilppuSlairtsudninoNdnastcudorPlaniF,IPI 64.03 09.8 secivreS,slloryaPmrafnoN 52.91 75.6 )CIS(gnirutcafunaM,IPI 54.72 72.8 )CIS(gnirutcafunaM,IPI 14.81 93.6 seitilitU&edarT,noitatropsnarT,slloryaPmrafnoN 80.72 02.8 seilppuSlairtsudninoNdnastcudorPlaniF,IPI 77.71 52.6 secivreS,slloryaPmrafnoN 98.62 61.8 edarTliateR,slloryaPmrafnoN 48.51 48.5 edarTliateR,slloryaPmrafnoN 29.52 69.7 xednIlatoT,xednInoitcudorPlairtsudnI 73.51 37.5 stcudorPlaniF,IPI 51.52 08.7 noitcurtsnoC,slloryaPmrafnoN muimerPksiRssenwekS muimerPksiRecnairaVedispU 2R tatS-t elbairaV 2R tatS-t elbairaV 32.61 29.5- stnenopmoC&seilppuS,slairetaMetaidemretnI,IPP 28.25 42.41 etavirPlatoT,slloryaPmrafnoN 90.51 76.5- gniggoLdnagniniM,slloryaPmrafnoN 58.94 14.31 edarTelaselohW,slloryaPmrafnoN 42.31 62.5- noitcurtsnoC,slloryaPmrafnoN 28.93 49.01 seitilitU&edarT,noitatropsnarT,slloryaPmrafnoN 16.21 11.5- edarTelaselohW,slloryaPmrafnoN 16.83 76.01 slairetaMsdooGelbaruD,IPI 93.21 60.5- yrusaerTraeY-1 65.83 66.01 secivreS,slloryaPmrafnoN 30.21 89.4- smetIllA,IPC 13.73 83.01 noitcurtsnoC,slloryaPmrafnoN 49.11 59.4- eraClacideMsseLsmetIllA,IPC 33.33 15.9 edarTliateR,slloryaPmrafnoN 08.11 29.4- lliByrusaerThtnoM-6 05.82 94.8 )CIS(gnirutcafunaM,IPI 36.11 88.4- etavirPlatoT,slloryaPmrafnoN 36.72 13.8 seilppuSlairtsudninoNdnastcudorPlaniF,IPI 63.11 28.4- dooFsseLsmetIllA,IPC 81.62 10.8 rotceSlaicnaniF,slloryaPmrafnoN ehT .aimerp ksir ssenweks dna ecnairav rof rewop yrotanalpxe dna noitalerroc suoenaropmetnoc hgih etartsnomed taht selbairav cimonoceorcam net eht stroper elbat sihT ,muimerpksirecnairavehtrehtiesielbairavtnednepedehterehwsisylananoissergerraenil ,etairavinuagnimrofrepmorfs2Rdetsujdafoezisehtnodesabdetroserastluser elbairavlaicnanfidnacimonoceorcam421ehtfoenosielbairavtnednepedniehtdna,muimerpksirssenweksro,muimerpksirecnairavedisnwod,muimerpksirecnairavedispu .detropererasretemarapepolsehtrofcitsitats-ts’tnedutSdnas2RdetsujdahtoB .)4102(.lateuonueFybdeidutsseires 46",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48-49",
    "total_pages": 66,
    "chunk_index": 86,
    "word_count": 227,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48-49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "eraClacideMsseLsmetIllA,IPC 33.33 15.9 edarTliateR,slloryaPmrafnoN 08.11 29.4- lliByrusaerThtnoM-6 05.82 94.8 )CIS(gnirutcafunaM,IPI 36.11 88.4- etavirPlatoT,slloryaPmrafnoN 36.72 13.8 seilppuSlairtsudninoNdnastcudorPlaniF,IPI 63.11 28.4- dooFsseLsmetIllA,IPC 81.62 10.8 rotceSlaicnaniF,slloryaPmrafnoN ehT .aimerp ksir ssenweks dna ecnairav rof rewop yrotanalpxe dna noitalerroc suoenaropmetnoc hgih etartsnomed taht selbairav cimonoceorcam net eht stroper elbat sihT ,muimerpksirecnairavehtrehtiesielbairavtnednepedehterehwsisylananoissergerraenil ,etairavinuagnimrofrepmorfs2Rdetsujdafoezisehtnodesabdetroserastluser elbairavlaicnanfidnacimonoceorcam421ehtfoenosielbairavtnednepedniehtdna,muimerpksirssenweksro,muimerpksirecnairavedisnwod,muimerpksirecnairavedispu .detropererasretemarapepolsehtrofcitsitats-ts’tnedutSdnas2RdetsujdahtoB .)4102(.lateuonueFybdeidutsseires 46 setaD htooB–segnahC ytilitaloV htiw detaicossA yllaitnetoP sweN yciloP :4 elbaT sweN nruteR∆ ecnairaV∆ etaD degnahcnusetartseretnievaelotnoisiceds’CMOFdnayksniweL .sMhtiwpihsnoitaler”gnorw“otstimdanotnilCtnediserP 310.0 )563.0-(373.0- 89/81/80 .opeRhtiwmetsysgniknabehtotyenomsddadeF 530.0 )466.0-(227.0- 89/10/90 .gnimochtrofebthgimtucetaratahttnemetatss’napsneerGnamriahCdeF 120.0 )554.0-(625.0- 89/80/90 .CYNnihtworgcimonocerofyciloplabolgdetanidroocadetacovdanotnilCtnediserP 581.0- 89/41/90 .etaneS.S.U,tegduBehtnoeettimmoCehterofebynomitsetnapsneerGnamriahCdeF 720.0 )082.0-(443.0- 89/32/90 .keewsuoiverptucetardeFretfadoomhsillubdnasgninraedetcepxe-naht-rettebdereviledsknabSUgib3 700.0- 352.0- 89/02/01 .gnortssniamerhtworgcimonoceSUtahtswohsesaelerkooBegieBdeF 800.0 )672.0-(662.0- 99/11/80 .sraey03tsapehtnietartnemyolpmenutsewolehtswohstropertnemyolpmenU 130.0 005.0- 00/70/10 tiderCgninethgiTmorfevreseRlaredeFehtpeeKothguonEemaTsniameRnoitaflnIfoesaeleR 730.0 662.0- 00/61/30 ecalPnieraymonocEfoslatnemadnuFtahttnemetatSsremmuS.HecnerwaLyraterceSyrusaerT 230.0 )692.0-(373.0- 00/71/40 keeWtsetaLni000,7ybporDmialCsselboJdnaetutitsnIotaCtahceepSetonyeKseviGnapsneerGsdeF 810.0 142.0- 00/91/01 tuCetaRgniteeM-retnI,esirpruSafotnemecnuonnAs’deF 250.0 )971.0-(282.0- 10/30/10 ycnerruCstigniulaveRnipetSetaidemretnInAekaTotanihCnollaCwonSnhoJ 10.0 )303.0-(572.0- 50/71/50 caMeidderFdnaeaMeinnaFfomsicitirCpuspetSnapsneerG.AnamriahCdeF 792.0- 50/91/50 segnaRlacirotsiHnihtiwsnoitatcepxEnoitaflnInohceepSseknanreB.BnamriahCdeF 710.0 )526.0-(945.0- 60/51/60 stnioPsisaB52ybetaRsdnuFlaredeFehtroftegraTstIesiaRottnemetatSCMOF 610.0 )523.0-(592.0- 60/92/60 dloHgnikaTsecirPgnisiRtsniagAdrauGtsuMdeFehttahtdenraWeknanreB.BnamriahCdeF 272.0- 60/91/70 lleWgnikroWdemeeSstekraMtahtlenaPesuoHadloTeknanreB.BnamriahCdeF 693.0- 70/82/20 neeSrevEs’eHsAgnortSsAsawymonocElabolGehtdiaSoykoTninosluaPyrneH 712.0- 70/60/30 etaDsuoiverPehtdnuobeRtekraMdetareneGtnemecnuonnACMOF 172.0- 70/72/60 eknanreBdnanosluaPhtiwgniteeMretfaliomruTehthtiwlaeDotdeFehtdiasddoDrotaneS 881.0- 70/12/80 stnioPsisaB05ybetaRsdnuFlaredeFehtroftegraTstirewoLotdediceDCMOF 420.0 )353.0-(514.0- 70/81/90 tnioPegatnecrePafosretrauQ-eerhTybetaRsdnuFdeFehttuCdeF 612.0- 80/81/30 stnioPsisaB05ybetaRsdnuFlaredeFehtroftegraTstirewoLotdediceDCMOF 840.0- )403.0-(984.0- 80/41/01 sevitatneserpeRfoesuoH.S.U,tegduBehtnoynomitseTeknanreB.BnamriahCdeF 330.0 )314.0-(624.0- 80/02/01 tekraMehtybdetcepxEsigniteeMCMOFyaD-owTehtgniwolloFetaRehttuCotdeF 570.0 )032.0-(313.0- 80/82/01 sisirClaicnaniFnohceepSs’hsuBtnediserP 260.0 )042.0-(823.0- 80/31/11 yrasseceNdemeeDnosluaPsmargorPnotnepSebotsdnuFPRATtahtderalceDhsuBtnediserP 442.0- 80/91/21 ssergnoC.S.UfonoisseStnioJottnediserPehtsahceepStsriFs’amabOtnediserP 162.0- 90/42/20 nalPnaoLycnegremEdetnedecerpnUnAdelievnUsrekaMyciloPnaeporuE 300.0 )106.0-(746.0- 01/01/50 secroFlaretalinUybdemaTaybiLnisnoitautiSdnanwoDdelooCsrotcaeRraelcuNesenapaJ 772.0- 11/12/30 etaRtegraTwoLyllanoitpecxEnArofnoitaruDAgnitatSylticilpxEtnemetatSCMOF 640.0 )073.0-(334.0- 11/90/80 sisirCtbeDkeerGehtxiFotlaeDdnoBaedaMsredaeLnoinUnaeporuE 430.0 )502.0-(542.0- 11/72/01 eussI”ffilClacsiF“ehtnostnemmoCgnigaruocnEs’llennoCcMrotaneSdnaamabOtnediserP 520.0 )724.0-(234.0- 31/20/10 swohsdnocesehT .tneveehtfoetadehtsinmuloctsrfiehT .elpmasnispordytilitalovtsegralehtotdaelyamtahtstneveehtnmuloctsalehtnistneserp)4102(uiXdnalaugnemAmorfelbatsihT .syadgnidnopserrocehtnoxedniehtfosnruterehtsinmulocdrihtehtsaerehw,ecnairavtopsdetamitsenisegnahc 47",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49-50",
    "total_pages": 66,
    "chunk_index": 87,
    "word_count": 195,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49-50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "70/81/90 tnioPegatnecrePafosretrauQ-eerhTybetaRsdnuFdeFehttuCdeF 612.0- 80/81/30 stnioPsisaB05ybetaRsdnuFlaredeFehtroftegraTstirewoLotdediceDCMOF 840.0- )403.0-(984.0- 80/41/01 sevitatneserpeRfoesuoH.S.U,tegduBehtnoynomitseTeknanreB.BnamriahCdeF 330.0 )314.0-(624.0- 80/02/01 tekraMehtybdetcepxEsigniteeMCMOFyaD-owTehtgniwolloFetaRehttuCotdeF 570.0 )032.0-(313.0- 80/82/01 sisirClaicnaniFnohceepSs’hsuBtnediserP 260.0 )042.0-(823.0- 80/31/11 yrasseceNdemeeDnosluaPsmargorPnotnepSebotsdnuFPRATtahtderalceDhsuBtnediserP 442.0- 80/91/21 ssergnoC.S.UfonoisseStnioJottnediserPehtsahceepStsriFs’amabOtnediserP 162.0- 90/42/20 nalPnaoLycnegremEdetnedecerpnUnAdelievnUsrekaMyciloPnaeporuE 300.0 )106.0-(746.0- 01/01/50 secroFlaretalinUybdemaTaybiLnisnoitautiSdnanwoDdelooCsrotcaeRraelcuNesenapaJ 772.0- 11/12/30 etaRtegraTwoLyllanoitpecxEnArofnoitaruDAgnitatSylticilpxEtnemetatSCMOF 640.0 )073.0-(334.0- 11/90/80 sisirCtbeDkeerGehtxiFotlaeDdnoBaedaMsredaeLnoinUnaeporuE 430.0 )502.0-(542.0- 11/72/01 eussI”ffilClacsiF“ehtnostnemmoCgnigaruocnEs’llennoCcMrotaneSdnaamabOtnediserP 520.0 )724.0-(234.0- 31/20/10 swohsdnocesehT .tneveehtfoetadehtsinmuloctsrfiehT .elpmasnispordytilitalovtsegralehtotdaelyamtahtstneveehtnmuloctsalehtnistneserp)4102(uiXdnalaugnemAmorfelbatsihT .syadgnidnopserrocehtnoxedniehtfosnruterehtsinmulocdrihtehtsaerehw,ecnairavtopsdetamitsenisegnahc 47 stnemecnuonnA cimonoceorcaM dna laicnaniF ot aimerP ksiR ssenwekS dna ecnairaV fo noitcaeR :5 elbaT PRS DPRV UPRV PRV leveL egnahC leveL egnahC leveL egnahC leveL egnahC r∆ raV∆ etaD htooB 4321.0 3700.0- 8811.0 2310.0- 5400.0- 9500.0- 4690.0 6410.0- 310.0 373.0- 8991/81/80 0061.0 4000.0- 6661.0 0120.0- 6600.0 6020.0- 2341.0 2920.0- 530.0 227.0- 8991/10/90 1261.0 9510.0- 8941.0 8430.0- 3210.0- 9810.0- 0911.0 4040.0- 120.0 625.0- 8991/80/90 8751.0 7100.0 7331.0 8800.0- 1420.0- 5010.0- 0890.0 1310.0- 720.0 443.0- 8991/32/90 8231.0 3400.0 5780.0 0010.0- 3540.0- 3410.0- 4440.0 0610.0- 700.0- 352.0- 8991/02/01 8301.0 1000.0- 5180.0 4210.0- 3220.0- 3210.0- 0450.0 9610.0- 800.0 662.0- 9991/11/80 0770.0 0030.0- 9240.0 8230.0- 1430.0- 8200.0- 7310.0 5030.0- 130.0 5.0- 0002/70/10 7170.0 2100.0- 4610.0 0310.0- 3550.0- 8110.0- 9020.0- 4710.0- 730.0 662.0- 0002/61/30 3590.0 3000.0 6240.0 2310.0- 7250.0- 4310.0- 3200.0 3810.0- 230.0 373.0- 0002/71/40 2570.0 6700.0- 0430.0 4610.0- 2140.0- 8800.0- 7200.0 0910.0- 810.0 142.0- 0002/91/01 0090.0 1310.0 5820.0 0110.0- 6160.0- 2420.0- 7310.0- 9220.0- 250.0 282.0- 1002/30/10 5750.0 6300.0- 2730.0 9500.0- 2020.0- 3200.0- 8710.0 3600.0- 10.0 572.0- 5002/71/50 3860.0 8600.0- 3240.0 9020.0- 0620.0- 1410.0- 1020.0 1520.0- 710.0 945.0- 6002/51/60 7060.0 1200.0- 5720.0 1210.0- 2330.0- 0010.0- 5300.0 4510.0- 610.0 592.0- 6002/92/60 1070.0 2510.0- 4430.0 2520.0- 7530.0- 0010.0- 9500.0 2720.0- 420.0 514.0- 7002/81/90 1731.0 8310.0 1460.0 2300.0 0370.0- 6010.0- 4500.0 0400.0- 840.0- 984.0- 8002/41/01 1361.0 8720.0- 8860.0 8550.0- 3490.0- 0820.0- 2100.0- 8260.0- 330.0 624.0- 8002/02/01 4122.0 1900.0- 7811.0 2040.0- 7201.0- 1130.0- 0830.0 8150.0- 570.0 313.0- 8002/82/01 6522.0 9600.0- 6890.0 2230.0- 0721.0- 3520.0- 1700.0 2140.0- 260.0 823.0- 8002/31/11 3721.0 2010.0- 8501.0 8840.0- 5120.0- 6830.0- 4670.0 1360.0- 300.0 746.0- 0102/01/50 0411.0 9310.0- 7990.0 4050.0- 3410.0- 5630.0- 4570.0 8260.0- 640.0 334.0- 1102/90/80 8601.0 9100.0 5110.0 5610.0- 3590.0- 4810.0- 7440.0- 0420.0- 430.0 542.0- 1102/72/01 ksir ssenweks dna ,)DPRV( muimerp ksir ecnairav edisnwod ,)UPRV( muimerp ksir ecnairav edispu ,)PRV( muimerp ksir ecnairav eht fo noitcaer eht stroper elbat sihT ehtno)r∆(snruter005P&Sdna)raV∆(ytilitalovlanoitidnocnisegnahcstroperelbatehT .4elbaTnidetnemucodswenlaicnanfidnacimonoceorcamehtot)PRS(muimerp lavirraehtnoenilcedasefiingismuimerpksirafoegnahcehtningisevitagenA .etadtneveehtnoPRSdna DPRV,UPRV,PRVfosleveldnasegnahcsallewsa,yadtneve .etisoppoehtseilpmingisevitisopA .tnemecnuonnalaicnanfirocimonoceorcamralucitrapafo 48",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 66,
    "chunk_index": 88,
    "word_count": 354,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "3410.0- 5630.0- 4570.0 8260.0- 640.0 334.0- 1102/90/80 8601.0 9100.0 5110.0 5610.0- 3590.0- 4810.0- 7440.0- 0420.0- 430.0 542.0- 1102/72/01 ksir ssenweks dna ,)DPRV( muimerp ksir ecnairav edisnwod ,)UPRV( muimerp ksir ecnairav edispu ,)PRV( muimerp ksir ecnairav eht fo noitcaer eht stroper elbat sihT ehtno)r∆(snruter005P&Sdna)raV∆(ytilitalovlanoitidnocnisegnahcstroperelbatehT .4elbaTnidetnemucodswenlaicnanfidnacimonoceorcamehtot)PRS(muimerp lavirraehtnoenilcedasefiingismuimerpksirafoegnahcehtningisevitagenA .etadtneveehtnoPRSdna DPRV,UPRV,PRVfosleveldnasegnahcsallewsa,yadtneve .etisoppoehtseilpmingisevitisopA .tnemecnuonnalaicnanfirocimonoceorcamralucitrapafo 48",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 66,
    "chunk_index": 89,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Table 6: Predictive Content of Premium Measure h 1 3 6 12 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 k Panel A: Variance Risk Premium 1 2.43 2.61 2.51 2.83 1.02 0.02 0.68 -0.30 2 2.84 3.76 3.42 5.58 1.50 0.68 1.04 0.05 3 4.11 8.13 3.58 6.18 1.78 1.19 1.56 0.78 6 2.78 3.65 2.24 2.22 1.57 0.82 2.09 1.87 9 1.98 1.65 1.94 1.57 1.47 0.66 1.98 1.64 12 1.96 1.64 1.43 0.61 1.53 0.77 1.73 1.14 k Panel B: Downside Variance Risk Premium 1 2.57 2.99 2.68 3.30 1.27 0.34 0.95 -0.06 2 3.22 4.92 4.08 7.95 2.07 1.78 1.54 0.74 3 4.76 10.72 4.46 9.50 2.61 3.12 2.32 2.37 6 3.72 6.75 3.42 5.70 2.84 3.85 3.21 4.98 9 2.96 4.27 3.14 4.86 2.82 3.86 2.99 4.35 12 3.04 4.60 2.65 3.39 2.81 3.86 2.80 3.84 k Panel C: Upside Variance Risk Premium 1 2.08 1.79 1.91 1.44 0.44 -0.44 -0.04 -0.55 2 2.15 1.96 2.15 1.96 0.39 -0.47 -0.18 -0.54 3 3.05 4.41 2.07 1.79 0.26 -0.52 -0.27 -0.52 6 1.57 0.82 0.61 -0.36 -0.40 -0.48 -0.27 -0.53 9 0.83 -0.18 0.36 -0.50 -0.52 -0.42 -0.14 -0.57 12 0.74 -0.27 -0.05 -0.59 -0.33 -0.52 -0.41 -0.49 k Panel D: Skewness Risk Premium 1 -0.10 -0.55 0.41 -0.46 0.96 -0.04 1.25 0.30 2 0.61 -0.35 1.67 0.98 1.98 1.59 2.16 1.98 3 1.03 0.04 2.24 2.18 2.81 3.70 3.29 5.17 6 2.27 2.30 3.33 5.38 4.05 8.00 4.45 9.59 9 2.57 3.13 3.39 5.70 4.20 8.73 3.98 10.59 12 2.83 3.95 3.43 5.93 3.88 7.60 4.07 8.34 This table reports predictive regression results for prediction horizons (k) between 1 and 12 months ahead, and aggregation levels(h)between1and12months,basedonapredictiveregressionmodeloftheformr t→t+k =β0+β1xt(h)+ε t→t+k . Inthis regressionmodel,r t→t+k isthecumulativeexcessreturnsbetweentandt+k,xt(h)istheproposedvarianceorskewnessrisk premiacomponentthattakesthevaluesfromvariancerisk,upsidevariancerisk,downsidevariancerisk,orskewnessriskpremia measures,andε isazero-meanerrorterm. ThereportedStudent’st-statisticsforslopeparametersareconstructedfrom t→t+k heteroscedasticityandserialcorrelationconsistentstandarderrorsthatexplicitlytakeaccountoftheoverlapintheregressions, followingHodrick(1992). R¯2 representsadjustedR2s. 49",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 66,
    "chunk_index": 90,
    "word_count": 299,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "4.20 8.73 3.98 10.59 12 2.83 3.95 3.43 5.93 3.88 7.60 4.07 8.34 This table reports predictive regression results for prediction horizons (k) between 1 and 12 months ahead, and aggregation levels(h)between1and12months,basedonapredictiveregressionmodeloftheformr t→t+k =β0+β1xt(h)+ε t→t+k . Inthis regressionmodel,r t→t+k isthecumulativeexcessreturnsbetweentandt+k,xt(h)istheproposedvarianceorskewnessrisk premiacomponentthattakesthevaluesfromvariancerisk,upsidevariancerisk,downsidevariancerisk,orskewnessriskpremia measures,andε isazero-meanerrorterm. ThereportedStudent’st-statisticsforslopeparametersareconstructedfrom t→t+k heteroscedasticityandserialcorrelationconsistentstandarderrorsthatexplicitlytakeaccountoftheoverlapintheregressions, followingHodrick(1992). R¯2 representsadjustedR2s. 49",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 66,
    "chunk_index": 91,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Table 7: Predictive Content of Risk-Neutral Measure h 1 3 6 12 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 k Panel A: Risk-Neutral Variance 1 0.28 -0.51 0.50 -0.41 0.69 -0.29 0.75 -0.24 2 1.14 0.17 1.24 0.30 1.35 0.44 1.39 0.51 3 1.30 0.38 1.52 0.72 1.83 1.28 2.13 1.92 6 2.10 1.88 2.33 2.43 2.76 3.57 3.21 4.95 9 2.32 2.44 2.55 3.05 2.95 4.22 3.15 4.85 12 2.21 2.20 2.45 2.82 2.89 4.11 3.30 5.45 k Panel B: Risk-Neutral Downside Variance 1 0.27 -0.51 0.57 -0.37 0.77 -0.23 0.87 -0.14 2 1.22 0.27 1.39 0.51 1.49 0.66 1.54 0.74 3 1.42 0.56 1.70 1.04 2.03 1.70 2.35 2.44 6 2.23 2.17 2.52 2.91 2.97 4.21 3.42 5.67 9 2.43 2.71 2.68 3.42 3.10 4.70 3.26 5.22 12 2.32 2.48 2.55 3.09 2.99 4.42 3.42 5.84 k Panel C: Risk-Neutral Upside Variance 1 0.29 -0.50 0.27 -0.51 0.36 -0.48 0.20 -0.53 2 0.93 -0.07 0.76 -0.23 0.78 -0.21 0.60 -0.35 3 0.99 -0.02 0.94 -0.06 1.04 0.05 1.00 0.00 6 1.74 1.12 1.72 1.09 1.92 1.48 2.05 1.77 9 2.01 1.71 2.09 1.89 2.31 2.42 2.38 2.59 12 1.90 1.49 2.09 1.92 2.45 2.83 2.57 3.17 k Panel D: Risk-Neutral Skewness 1 0.22 -0.52 0.87 -0.14 1.10 0.11 1.27 0.34 2 1.51 0.70 2.02 1.67 2.06 1.76 2.08 1.79 3 1.93 1.48 2.47 2.74 2.85 3.80 3.13 4.65 6 2.70 3.42 3.28 5.21 3.80 7.02 4.11 8.18 9 2.76 3.64 3.17 4.92 3.64 6.54 3.56 6.26 12 2.67 3.44 2.88 4.07 3.27 5.35 3.66 6.73 Thistablereportspredictiveregressionresultsforrisk-neutralvarianceandskewnessmeasures. Thepredictiveregressionmodel, predictionhorizons,aggregationlevels,andnotationarethesameasintheresultsreportedinTable6. Thedifferenceisinthe definition of xt(h): instead of risk premia, we use risk-neutral measures for variance, upside variance, downside variance, and skewness. 50",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 66,
    "chunk_index": 92,
    "word_count": 282,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "2.70 3.42 3.28 5.21 3.80 7.02 4.11 8.18 9 2.76 3.64 3.17 4.92 3.64 6.54 3.56 6.26 12 2.67 3.44 2.88 4.07 3.27 5.35 3.66 6.73 Thistablereportspredictiveregressionresultsforrisk-neutralvarianceandskewnessmeasures. Thepredictiveregressionmodel, predictionhorizons,aggregationlevels,andnotationarethesameasintheresultsreportedinTable6. Thedifferenceisinthe definition of xt(h): instead of risk premia, we use risk-neutral measures for variance, upside variance, downside variance, and skewness. 50",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 66,
    "chunk_index": 93,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Table 8: Predictive Content of Realized (Physical) Measure h 1 3 6 12 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 k Panel A: Realized Variance 1 -1.10 0.12 -0.99 -0.01 -0.10 -0.55 0.09 -0.55 2 -0.67 -0.30 -0.86 -0.15 0.18 -0.54 0.40 -0.47 3 -1.18 0.22 -0.75 -0.25 0.36 -0.48 0.62 -0.34 6 0.01 -0.57 0.48 -0.44 1.13 0.15 1.07 0.09 9 0.55 -0.40 0.78 -0.22 1.33 0.44 1.12 0.15 12 0.49 -0.45 0.98 -0.02 1.27 0.35 1.40 0.56 k Panel B: Realized Downside Variance 1 -1.05 0.06 -0.90 -0.10 -0.08 -0.55 0.09 -0.55 2 -0.53 -0.40 -0.76 -0.23 0.21 -0.53 0.39 -0.47 3 -1.04 0.05 -0.68 -0.30 0.39 -0.48 0.59 -0.36 6 0.05 -0.57 0.48 -0.44 1.08 0.10 0.99 -0.01 9 0.54 -0.41 0.75 -0.25 1.21 0.27 1.01 0.01 12 0.44 -0.48 0.89 -0.12 1.14 0.18 1.30 0.40 k Panel C: Realized Upside Variance 1 -1.15 0.18 -1.09 0.10 -0.13 -0.54 0.10 -0.55 2 -0.82 -0.18 -0.95 -0.05 0.14 -0.54 0.41 -0.46 3 -1.33 0.43 -0.82 -0.18 0.34 -0.49 0.66 -0.32 6 -0.05 -0.57 0.48 -0.44 1.17 0.21 1.16 0.19 9 0.39 -0.41 0.81 -0.19 1.44 0.61 1.23 0.29 12 0.54 -0.42 1.08 0.09 1.39 0.54 1.51 0.74 k Panel D: Realized Skewness 1 0.44 -0.45 1.58 0.81 0.63 -0.33 -0.06 -0.55 2 1.51 0.70 1.67 0.99 0.96 -0.05 -0.26 -0.52 3 1.45 0.61 1.19 0.23 0.71 -0.28 -0.89 -0.12 6 0.54 -0.40 0.11 -0.56 -1.01 0.01 -2.64 3.25 9 0.07 -0.58 -0.54 -0.41 -3.01 4.41 -3.67 6.67 12 -0.55 -0.41 -1.82 1.33 -3.37 5.70 -3.36 5.67 This table reports predictive regression results for realized variance and skewness measures. The predictive regression model, prediction horizons, aggregation levels, and notation are the same as in the results reported in Table 6. The difference is in the definition of xt(h): instead of risk premia, we use realized (historical) measures for variance, upside variance, downside variance,andskewness. 51",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 66,
    "chunk_index": 94,
    "word_count": 316,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "realized variance and skewness measures. The predictive regression model, prediction horizons, aggregation levels, and notation are the same as in the results reported in Table 6. The difference is in the definition of xt(h): instead of risk premia, we use realized (historical) measures for variance, upside variance, downside variance,andskewness. 51",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 66,
    "chunk_index": 95,
    "word_count": 50,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "Table 9: Joint Regression Results h 1 3 6 12 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 t-Stat R¯2 k Up Down Up Down Up Down Up Down Panel A: Risk Premium 1 -0.01 1.49 2.45 -0.12 1.86 2.77 -0.58 1.32 -0.03 -0.85 1.27 -0.21 2 -0.78 2.49 4.72 -1.28 3.66 8.28 -1.38 2.46 2.26 -1.54 2.17 1.49 3 -1.28 3.79 11.04 -1.81 4.32 10.63 -2.06 3.33 4.84 -2.34 3.31 4.77 6 -2.46 4.19 9.36 -3.00 4.56 9.80 -3.31 4.39 8.98 -3.14 4.54 9.54 9 -2.75 3.99 7.76 -3.10 4.45 9.36 -3.46 4.49 9.50 -2.74 4.09 7.83 12 -3.06 4.29 9.06 -3.18 4.18 8.30 -3.13 4.24 8.61 -2.97 4.10 8.06 Panel B: Risk-Neutral Measures 1 0.08 -0.01 -1.06 -1.13 1.24 -0.22 -1.30 1.46 0.15 -1.48 1.70 0.51 2 -1.00 1.27 0.27 -2.42 2.69 3.10 -2.27 2.61 2.90 -2.00 2.45 2.35 3 -1.59 1.89 1.39 -2.92 3.26 5.01 -3.22 3.68 6.55 -2.87 3.59 6.21 6 -1.64 2.14 3.09 -2.93 3.47 6.89 -3.25 3.99 9.12 -2.61 3.79 8.66 9 -1.32 1.88 3.12 -2.02 2.62 5.09 -2.25 3.05 6.88 -1.42 2.62 5.78 12 -1.35 1.89 2.94 -1.49 2.07 3.77 -1.39 2.18 4.93 -1.28 2.55 6.20 Panel C: Realized (Physical) Measures 1 -0.63 0.42 -0.28 -1.82 1.72 1.17 -0.69 0.68 -0.84 0.11 -0.10 -1.10 2 -1.62 1.50 0.51 -1.92 1.83 1.24 -0.93 0.95 -0.60 0.48 -0.46 -0.90 3 -1.68 1.46 1.05 -1.41 1.34 0.25 -0.62 0.64 -0.82 1.27 -1.24 -0.02 6 -0.54 0.54 -0.97 -0.01 0.06 -1.01 1.39 -1.31 0.61 3.54 -3.49 6.14 9 0.01 0.08 -0.99 0.72 -0.64 -0.54 3.61 -3.52 6.77 4.82 -4.76 11.39 12 0.63 -0.55 -0.83 2.07 -1.98 1.77 3.99 -3.91 8.24 4.66 -4.59 11.22 This table reports predictive regression results when multiple variance components (risk premia, risk-neutral, and realized measures) are included in the regression model. The prediction horizons, aggregation levels, and notation are the same as in theresultsreportedinTable6. Thedifferenceisintheregressionmodel. Bothupsideanddownsidevariancecomponentsare in the model: r t→t+k =β0+β1x1,t(h)+β2x2,t(h)+ε t→t+k . x1,t(h) pertains to upside measures and x2,t(h) represents the downsidemeasuresusedintheanalysis. 52",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 66,
    "chunk_index": 96,
    "word_count": 330,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "when multiple variance components (risk premia, risk-neutral, and realized measures) are included in the regression model. The prediction horizons, aggregation levels, and notation are the same as in theresultsreportedinTable6. Thedifferenceisintheregressionmodel. Bothupsideanddownsidevariancecomponentsare in the model: r t→t+k =β0+β1x1,t(h)+β2x2,t(h)+ε t→t+k . x1,t(h) pertains to upside measures and x2,t(h) represents the downsidemeasuresusedintheanalysis. 52 0102 .ceD ot 6991 .peS ,snoissergeR evitciderP elpmiS launna-imeS :01 elbaT 3900.0- 5010.0- 0120.0 0000.0- 4000.0 4150.0 1680.0 6570.0 2100.0 2310.0- 6200.0- 5000.0 tpecretnI )3090.2-( )9611.3-( )7263.6( )7600.0-( )3921.0( )4790.2( )8791.3( )6709.2( )0327.0( )4030.3-( )2361.1-( )5991.0( 9710.0- prvu t )7193.0-( 5311.0 prvd t )0095.2( 8381.0- prs t )7006.3-( 6150.0 prv t )7394.1( 9140.0- ) d/ p(gol t t )0368.2-( 8740.0- ) d/ p(gol t 1−t )0551.3-( 4830.0- ) e/ p(gol t t )7840.2-( 1817.0 smt t )3324.0( 5576.1 sfd t )5883.0( 2508.0- lfni t )7317.6-( 2741.0 sipk t )0710.4( 3021.0 sopk t )8975.2( 0413.3 8204.8 7080.12 2715.0- 0005.0- 9009.1 2741.5 3971.4 6047.0 1167.6 9343.3 7515.0- )%(2R .jdA ot 6991 rebmetpeS morf rotciderp deggal )htnom-1( doirep-eno hcae no 6/j+ e tr1= 6 j (cid:80) = 6/6+t→ e tr nruter ssecxe evitalumuc )delacs( yllaunna-imes eht fo snoisserger evitciderp stneserp elbat sihT .0102rebmeceD 53",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 55,
    "page_range": "p.55-56",
    "total_pages": 66,
    "chunk_index": 97,
    "word_count": 191,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.55-56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "t )8975.2( 0413.3 8204.8 7080.12 2715.0- 0005.0- 9009.1 2741.5 3971.4 6047.0 1167.6 9343.3 7515.0- )%(2R .jdA ot 6991 rebmetpeS morf rotciderp deggal )htnom-1( doirep-eno hcae no 6/j+ e tr1= 6 j (cid:80) = 6/6+t→ e tr nruter ssecxe evitalumuc )delacs( yllaunna-imes eht fo snoisserger evitciderp stneserp elbat sihT .0102rebmeceD 53 0102 .ceD ot 6991 .peS ,snoissergeR evitciderP elpitluM launna-imeS :11 elbaT 1310.0- 7310.0- 1710.0 4800.0- 5400.0- 2850.0 1590.0 7870.0 3310.0- 8210.0- 8210.0- tpecretnI )0958.2-( )5268.3-( )9899.4( )2577.1-( )3553.1-( )6024.2( )4416.3( )3590.3( )9849.2-( )5739.2-( )5739.2-( 5451.0- prvu t )3217.2-( 9211.0 8401.0 9821.0 9531.0 8711.0 9031.0 2931.0 2721.0 1234.0 5550.0 0012.0 prvd t )8226.2( )8194.2( )9943.3( )2719.2( )8366.2( )0899.2( )0552.3( )8869.2( )5064.3( )9451.1( )9267.3( 5451.0- prs t )3217.2-( 0462.0- prv t )7717.2-( 2640.0- ) d/ p(gol t t )2112.3-( 7550.0- ) d/ p(gol t 1−t )7727.3-( 1740.0- ) e/ p(gol t t )3145.2-( 0092.1 smt t )1867.0( 6432.6 sfd t )4683.1( 2728.0- lfni t )7790.7-( 5241.0 sipk t )9349.3( 7911.0 sopk t )8216.2( 2066.6 5222.11 1117.52 3488.3 6101.3 2754.6 0093.01 2735.8 4669.6 5059.6 5059.6 )%(2R .jdA enodnaprvdmuimerpksirecnairavedisnwoddeggal)htnom-1(doirep-enono6/j+ e tr1= 6 j (cid:80)=6/6+t→ e trnruterssecxeevitalumuc)delacs(yllaunna-imesehtfosnoissergerevitciderpstneserpelbatsihT .0102rebmeceDot6991rebmetpeSmorfnrutnirotciderpevitanretla 54",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 56,
    "page_range": "p.56-57",
    "total_pages": 66,
    "chunk_index": 98,
    "word_count": 184,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.56-57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "1740.0- ) e/ p(gol t t )3145.2-( 0092.1 smt t )1867.0( 6432.6 sfd t )4683.1( 2728.0- lfni t )7790.7-( 5241.0 sipk t )9349.3( 7911.0 sopk t )8216.2( 2066.6 5222.11 1117.52 3488.3 6101.3 2754.6 0093.01 2735.8 4669.6 5059.6 5059.6 )%(2R .jdA enodnaprvdmuimerpksirecnairavedisnwoddeggal)htnom-1(doirep-enono6/j+ e tr1= 6 j (cid:80)=6/6+t→ e trnruterssecxeevitalumuc)delacs(yllaunna-imesehtfosnoissergerevitciderpstneserpelbatsihT .0102rebmeceDot6991rebmetpeSmorfnrutnirotciderpevitanretla 54 7002 .ceD ot 6991 .peS ,snoissergeR evitciderP elpmiS launna-imeS :21 elbaT 7400.0- 9500.0- 2500.0 6020.0 5300.0 3190.0 4612.0 6102.0 4100.0 4210.0- 0700.0- 9210.0 tpecretnI )2023.1-( )0332.2-( )8060.1( )4484.3( )8655.1( )1589.3( )3210.7( )5116.6( )4970.1( )0746.2-( )5105.3-( )8831.5( 9762.0 prvu t )8555.4( 4872.0 prvd t )3686.6( 6512.0- prs t )6715.3-( 0032.0 prv t )6015.6( 2901.0- ) d/ p(gol t t )5805.6-( 6711.0- ) d/ p(gol t 1−t )6019.6-( 2660.0- ) e/ p(gol t t )4748.3-( 0991.0- smt t )5921.0-( 6386.52- sfd t )8110.3-( 5370.0- lfni t )9204.0-( 7121.0 sipk t )2870.4( 0490.0 sopk t )9764.2( 4697.3 0808.01 6356.0- 2888.5 0867.0- 6566.9 0306.62 1872.42 2092.42 5201.8 9603.52 2082.31 )%(2R .jdA ot 6991 rebmetpeS morf rotciderp deggal )htnom-1( doirep-eno hcae no 6/j+ e tr1= 6 j (cid:80) = 6/6+t→ e tr nruter ssecxe evitalumuc )delacs( yllaunna-imes eht fo snoisserger evitciderp stneserp elbat sihT .7002rebmeceD 55",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 66,
    "chunk_index": 99,
    "word_count": 191,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "t )9764.2( 4697.3 0808.01 6356.0- 2888.5 0867.0- 6566.9 0306.62 1872.42 2092.42 5201.8 9603.52 2082.31 )%(2R .jdA ot 6991 rebmetpeS morf rotciderp deggal )htnom-1( doirep-eno hcae no 6/j+ e tr1= 6 j (cid:80) = 6/6+t→ e tr nruter ssecxe evitalumuc )delacs( yllaunna-imes eht fo snoisserger evitciderp stneserp elbat sihT .7002rebmeceD 55 7002 .ceD ot 6991 .peS ,snoissergeR evitciderP elpitluM launna-imeS :31 elbaT 2610.0- 5510.0- 2410.0- 3300.0- 7800.0- 3501.0 4591.0 6371.0 9400.0- 5400.0- 5400.0- tpecretnI )5917.4-( )3548.5-( )9318.2-( )6984.0-( )8862.3-( )5507.5( )3185.7( )8516.6( )2940.1-( )9900.1-( )9900.1-( 4540.0 prvu t )0026.0( 7482.0 6172.0 0892.0 9662.0 3582.0 6513.0 9262.0 4352.0 5602.0 8003.0 4552.0 prvd t )7670.7( )1399.6( )8488.6( )3387.5( )5457.6( )8274.8( )0856.7( )6960.7( )7214.1( )1254.5( )1175.4( 4540.0 prs t )0026.0( 2360.0 prv t )3315.0( 0990.0- ) d/ p(gol t t )4798.6-( 3111.0- ) d/ p(gol t 1−t )2968.7-( 5580.0- ) e/ p(gol t t )0311.6-( 6013.1 smt t )2779.0( 4619.4- sfd t )8385.0-( 1452.0 lfni t )3555.1( 8411.0 sipk t )6605.4( 0501.0 sopk t )2832.3( 5064.03 5790.53 8521.62 3029.42 5082.52 6338.14 7393.94 3432.54 6478.42 0649.42 0649.42 )%(2R .jdA enodnaprvdmuimerpksirecnairavedisnwoddeggal)htnom-1(doirep-enono6/j+ e tr1= 6 j (cid:80)=6/6+t→ e trnruterssecxeevitalumuc)delacs(yllaunna-imesehtfosnoissergerevitciderpstneserpelbatsihT .7002rebmeceDot6991rebmetpeSmorfnrutnirotciderpevitanretla 56",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 58,
    "page_range": "p.58-59",
    "total_pages": 66,
    "chunk_index": 100,
    "word_count": 184,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.58-59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "5580.0- ) e/ p(gol t t )0311.6-( 6013.1 smt t )2779.0( 4619.4- sfd t )8385.0-( 1452.0 lfni t )3555.1( 8411.0 sipk t )6605.4( 0501.0 sopk t )2832.3( 5064.03 5790.53 8521.62 3029.42 5082.52 6338.14 7393.94 3432.54 6478.42 0649.42 0649.42 )%(2R .jdA enodnaprvdmuimerpksirecnairavedisnwoddeggal)htnom-1(doirep-enono6/j+ e tr1= 6 j (cid:80)=6/6+t→ e trnruterssecxeevitalumuc)delacs(yllaunna-imesehtfosnoissergerevitciderpstneserpelbatsihT .7002rebmeceDot6991rebmetpeSmorfnrutnirotciderpevitanretla 56 Table 14: Out-of-Sample Analysis dvrp vs. x srp vs. x t t Adj. R2(%) for IS Adj. R2(%) for OOS DM p−value DM p−value Panel A: One Month dvrp 4.6723 0.6347 -0.0426 0.5170 t srp 3.4862 -0.6055 0.0426 0.4830 t vrp 3.7175 -0.1087 -0.0271 0.5108 -0.0374 0.5149 t log(p /d ) 6.3871 -1.1465 -0.3716 0.6449 -0.4769 0.6833 t t log(p /d ) 6.7059 -1.1123 -0.2414 0.5954 -0.3453 0.6351 t−1 t log(p /e ) 4.2430 -0.9384 0.2572 0.3985 0.2930 0.3848 t t kpos -1.0697 2.0261 1.3282 0.0921 1.7998 0.0359 t Panel B: Three Months dvrp 24.6956 5.5674 0.0895 0.4644 t srp 21.3847 -0.8775 -0.0895 0.5356 t vrp 19.8333 4.6494 0.3654 0.3574 0.2742 0.3919 t log(p /d ) 16.8502 -1.0456 0.5398 0.2947 0.6162 0.2689 t t log(p /d ) 18.4235 -0.5345 0.5425 0.2937 0.6304 0.2642 t−1 t log(p /e ) 11.2493 0.2510 0.9778 0.1641 1.0725 0.1417 t t kpos -0.6580 0.6473 1.7537 0.0397 1.8782 0.0302 t Panel C: Six Months dvrp 35.4498 0.1580 -1.2144 0.8877 t srp 20.0010 2.3028 1.2144 0.1123 t vrp 31.7578 2.7778 -0.4553 0.6756 -1.0558 0.8545 t log(p /d ) 28.2580 0.4752 0.3393 0.3672 -1.2086 0.8866 t t log(p /d ) 32.1452 1.2361 0.2877 0.3868 -1.2333 0.8913 t−1 t log(p /e ) 17.2860 1.0359 0.8114 0.2086 -0.6382 0.7383 t t kpos 2.9373 12.1162 1.7801 0.0375 1.2382 0.1078 t This table presents the out-of-sample performance of predictors to forecast monthly (re in the top panel), quarterly t→t+1 (re /3 in the middle panel) and semi-annually (re /6 in the bottom panel) scaled cumulative excess returns, with t→t+3 t→t+6 observationsspanningSeptember1996toDecember2010. ThefirsttwocolumnspresenttheadjustedR2 (%)forthein-sample (IS)andout-of-sample(OOS)observations,thatisthefirstandlasthalffractionsofthedata. Thecolumnsheaded“dvrpvs.xt” test the null hypothesis that “an alternative predictor (xt) does not yield a better forecast than the downside variance risk premium(dvrp)”. Thecolumnsheaded“srpvs.xt”testthenullhypothesisthat“analternativepredictor(xt)doesnotyielda betterforecastthantheskewnessriskpremium(srp)”. Thereportedteststatisticsandp-valuesarecomputedfromtheDiebold andMariano(1995)modelcomparisonprocedure. NotethattheBonferroniadjustmentisrequiredwhenmultiplep-valuesare produced,toavoidoverstatingtheevidenceagainstthenull. Thus,tomaintainanoverallsignificancelevelof5%(resp. 10%), one should adjust each individual test size to 0.0083=5%/6 (resp. 0.0167=10%/6) since 6 tests are performed for a given horizon. 57",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 59,
    "page_range": "p.59",
    "total_pages": 66,
    "chunk_index": 101,
    "word_count": 363,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.59)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "test the null hypothesis that “an alternative predictor (xt) does not yield a better forecast than the downside variance risk premium(dvrp)”. Thecolumnsheaded“srpvs.xt”testthenullhypothesisthat“analternativepredictor(xt)doesnotyielda betterforecastthantheskewnessriskpremium(srp)”. Thereportedteststatisticsandp-valuesarecomputedfromtheDiebold andMariano(1995)modelcomparisonprocedure. NotethattheBonferroniadjustmentisrequiredwhenmultiplep-valuesare produced,toavoidoverstatingtheevidenceagainstthenull. Thus,tomaintainanoverallsignificancelevelof5%(resp. 10%), one should adjust each individual test size to 0.0083=5%/6 (resp. 0.0167=10%/6) since 6 tests are performed for a given horizon. 57 Figure 1: S&P 500 Put and Call Contracts per Day 600 All 500 Call Put 400 300 200 100 0 1996 1998 2000 2002 2004 2006 2008 2010 This graph show the number of outstanding put and call contracts written on the S&P 500 index per day for the 1996-2010 period. Inaddition,itplotsthesumofputandcallcontractnumbers. Source: OptionMetricsIvyDBaccessedviaWRDS. 58 Figure 2: The Term-Structure of Risk Neutral Variance 19.5 19 18.5 18 17.5 17 16.5 16 15.5 1 2 3 6 9 12 18 24 Maturity )%( naideM Risk−Neutral Variance 17.5 17 16.5 16 15.5 15 14.5 14 13.5 1 2 3 6 9 12 18 24 Maturity )%( naideM Risk−Neutral Downside Variance −4 −5 −6 −7 −8 −9 −10 1 2 3 6 9 12 18 24 Maturity )%( naideM Risk−Neutral Skewness 9.5 9 8.5 8 1 2 3 6 9 12 18 24 Maturity )%( naideM Risk−Neutral Upside Variance 59 Figure 3: The Term-Structure of Realized Variance 19.5 19 18.5 18 17.5 17 16.5 16 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Variance 14.5 14 13.5 13 12.5 12 11.5 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Downside Variance 0.16 0.14 0.12 0.1 0.08 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Skewness 14.5 14 13.5 13 12.5 12 11.5 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Upside Variance 60",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 60,
    "page_range": "p.60-62",
    "total_pages": 66,
    "chunk_index": 102,
    "word_count": 286,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.60-62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "9 12 18 24 Maturity )%( naideM Realized Downside Variance 0.16 0.14 0.12 0.1 0.08 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Skewness 14.5 14 13.5 13 12.5 12 11.5 1 2 3 6 9 12 18 24 Maturity )%( naideM Realized Upside Variance 60 Figure 4: Student’s t-Statistics for Predictive Regressions 5.5 5 4.5 4 3.5 3 2.5 2 1.5 1 0.5 0 1 2 3 4 5 6 7 8 9 10 11 12 k scitsitatS t−tnedutS Variance Risk Premium 5.5 1−month 5 2−months 4.5 3−months 4 3.5 3 2.5 2 1.5 1 0.5 0 1 2 3 4 5 6 7 8 9 10 11 12 k scitsitatS t−tnedutS Downside Variance Risk Premium 1−month 2−months 3−months Upside Variance Risk Premium 5.5 5 4.5 4 3.5 3 2.5 2 1.5 1 0.5 0 1 2 3 4 5 6 7 8 9 10 11 12 k scitsitatS t−tnedutS Skewness Risk Premium 5.5 5 1−month 2−months 4.5 3−months 4 3.5 3 2.5 2 1.5 1 0.5 0 1 2 3 4 5 6 7 8 9 10 11 12 scitsitatS−t−tnedutS 6−months 9−months 12−months k Thesefiguresplotthet-statisticsforslopeparametersofpredictiveregressions–Equation(12)–constructedfollowingHodrick (1992) from heteroscedasticity and serial correlation consistent standard errors that explicitly take account of the overlap in the regressions. The predictors here are variance risk, upside variance risk, downside variance risk, and skewness risk premia. In these figures, k is the prediction horizon, ranging between 1 and 12 months ahead. To simplify the figures, only three aggregationlevels–h–areshown. 61",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 63,
    "page_range": "p.63-64",
    "total_pages": 66,
    "chunk_index": 103,
    "word_count": 249,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.63-64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "errors that explicitly take account of the overlap in the regressions. The predictors here are variance risk, upside variance risk, downside variance risk, and skewness risk premia. In these figures, k is the prediction horizon, ranging between 1 and 12 months ahead. To simplify the figures, only three aggregationlevels–h–areshown. 61 Figure 5: Adjusted R2 for Predictive Regressions 14 12 10 8 6 4 2 0 1 2 3 4 5 6 7 8 9 10 11 12 k 2R detsujdA Variance Risk Premium 14 12 1−month 2−months 3−months 10 8 6 4 2 0 1 2 3 4 5 6 7 8 9 10 11 12 k 2R detsujdA Downside Variance Risk Premium 1−month 2−months 3−months 14 12 10 8 6 4 2 0 1 2 3 4 5 6 7 8 9 10 11 12 k 2R detsujdA Upside Variance Risk Premium 14 12 1−month 2−months 3−months 10 8 6 4 2 0 1 2 3 4 5 6 7 8 9 10 11 12 k 2R detsujdA Skewness Risk Premium 6−months 9−months 12−months These figures plot the adjusted R2s of predictive regressions – Equation (12). The predictors here are variance risk, upside variancerisk, downsidevariancerisk, andskewnessriskpremia. Inthesefigures, k isthepredictionhorizon, rangingbetween 1and12monthsahead. Tosimplifythefigures,onlythreeaggregationlevels–h–areshown. 62",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 64,
    "page_range": "p.64-65",
    "total_pages": 66,
    "chunk_index": 104,
    "word_count": 204,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.64-65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "1 2 3 4 5 6 7 8 9 10 11 12 k 2R detsujdA Skewness Risk Premium 6−months 9−months 12−months These figures plot the adjusted R2s of predictive regressions – Equation (12). The predictors here are variance risk, upside variancerisk, downsidevariancerisk, andskewnessriskpremia. Inthesefigures, k isthepredictionhorizon, rangingbetween 1and12monthsahead. Tosimplifythefigures,onlythreeaggregationlevels–h–areshown. 62 Figure 6: Comparison of Adjusted R2s for Risk-Neutral and Physical Variance Measures Risk−Neutral Variance 9 8 7 6 5 4 3 2 1 0 −11 2 3 4 5 6 7 8 9 10 11 12 k % Realized Variance 9 8 6−months 9 1 − 2− m m on o t n h t s hs 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 11 12 k % 6−months 9−months 12−months Risk−Neutral Downside Variance 9 8 7 6 5 4 3 2 1 0 −11 2 3 4 5 6 7 8 9 10 11 12 k % Realized Downside Variance 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 11 12 % k 9 8 7 6 5 4 3 2 1 0 −11 2 3 4 5 6 7 8 9 10 11 12 k % Risk−Neutral Upside Variance 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9 10 11 12 k % Realized Upside Variance 9 8 7 6 5 4 3 2 1 01 2 3 4 5 6 7 8 9 10 11 12 k % Risk−Neutral Skewness 9 8 7 6 5 4 3 2 1 0 −11 2 3 4 5 6 7 8 9 10 11 12 k % Realized Skewness ThesefiguresplottheadjustedR2sforpredictiveregressions–Equation(12). Thepredictorsherearerisk-neutralandrealized variance,upsidevariance,downsidevariance,andskewness. Inthesefigures,kisthepredictionhorizon,rangingbetween1and 12monthsahead. Tosimplifythefigures,onlythreeaggregationlevels–h–areshown. 63",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 65,
    "page_range": "p.65",
    "total_pages": 66,
    "chunk_index": 105,
    "word_count": 298,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.65)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  },
  {
    "text": "1 01 2 3 4 5 6 7 8 9 10 11 12 k % Risk−Neutral Skewness 9 8 7 6 5 4 3 2 1 0 −11 2 3 4 5 6 7 8 9 10 11 12 k % Realized Skewness ThesefiguresplottheadjustedR2sforpredictiveregressions–Equation(12). Thepredictorsherearerisk-neutralandrealized variance,upsidevariance,downsidevariance,andskewness. Inthesefigures,kisthepredictionhorizon,rangingbetween1and 12monthsahead. Tosimplifythefigures,onlythreeaggregationlevels–h–areshown. 63 Figure 7: Time-Series for Variance and Skewness Risk Premia Thesefiguresplotthepathsofannualizedmonthlyvalues(×103)forthevarianceriskpremium,upsidevarianceriskpremium, downside variance risk premium, and skewness risk premium, extracted from U.S. financial markets data for September 1996 toDecember2011. TheshadedareasrepresentNBERrecessions. 64",
    "title": "Downside Variance Risk Premium",
    "source_type": "pdf",
    "document_id": "e1122a6f35d2",
    "source_file": "Downside Variance Risk Premium_Federal Reserve Board Study.pdf",
    "section": "References",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 66,
    "chunk_index": 106,
    "word_count": 80,
    "author": "Bruno Feunou; Cedric Okou",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20150402103451-04'00'",
    "duration": null
  }
]