[
  {
    "text": "Tony Cooper1 Double-Digit Numerics This version April 20132 Abstract For many decades the only way to invest in volatility has been through trading options, futures, or variance swaps. But in recent years a number of volatility-related exchange traded Funds (ETFs) and Exchange Traded Notes (ETNs) have been launched which make volatility trading accessible to the retail investor and fund managers without the need to access futures markets. Our objective is to devise a trading strategy using them. We document where volatility returns come from, clearing up some misconception in the process. Then we illustrate five different strategies that will appeal to different investors. Four of the strategies are simple to describe and implement. All of the strategies have had extraordinary returns with high Sharpe Ratios and low correlation to the S&P500, in some cases negative correlation. The returns seems to be too good to be true – like picking up $100 bills in front of a steamroller – so we have a detailed discussion on the risks and the nature of the steamroller. We illustrate how these strategies can be incorporated into existing portfolios to reduce portfolio risk especially in times of crisis. They have positive exposure to the markets during good times and negative exposure during bad times. Unfortunately they do not always provide absolute returns and while reducing net portfolio drawdowns they can themselves have significant drawdowns. Still, we suggest that a traditional 60% equities, 40% bonds portfolio should be adjusted to 55% equities, 35% bonds, and 10% volatility. JEL classification: C32; C53; G11; G12; G13 Keywords: Volatility trading; Futures pricing; Volatility Risk Premium; Roll yield; Momentum 1. Introduction In order to create a long term volatility trading strategy for inclusion into an investment portfolio we seek to use three intriguing and enticing stylized facts about stock market volatility: 1) Stock market volatility, unlike returns, is predictable 2) Changes in volatility are negatively correlated with changes in market prices 3) Investors are prepared to pay us a premium (the Volatility Risk Premium) for us to take volatility risk off their hands In other words, we want to consider investing in volatility as an asset class. 1 email: tonyc@ddnum.com 2 This paper differs from the NAAIM Wagner Award version in being augmented with some charts and text that we did not have room for in the NAAIM version. 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==22225555332277",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 0,
    "word_count": 395,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "words, we want to consider investing in volatility as an asset class. 1 email: tonyc@ddnum.com 2 This paper differs from the NAAIM Wagner Award version in being augmented with some charts and text that we did not have room for in the NAAIM version. 1 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==22225555332277",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 34,
    "chunk_index": 1,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "The structure of this paper is as follows: We discuss the lure of volatility and demonstrate this by simulating a mean-reversion trading strategy on the VIX which produces 215% annualized returns. Then we hint at the profitability of an Exchange Traded Note (ETN) with ticker XIV. But before we can feel safe trading it we must explain where the returns come from. It is the volatility risk premium (VRP) which provides our returns. We provide convincing evidence that the VRP exists in the options market. But the volatility ETNs that we are interested in result from trading the VIX futures markets so we must test to see if the VRP exists there also. But the futures market has a complication – there is a concept called roll yield that people mistake for the VRP and treat as a free lunch. It is important to clear up the misconception because we can earn more return by chasing the VRP rather than roll yield. The VRP is not a free lunch because earning the premium requires taking on volatility risk. Then we introduce the four Exchange Traded Notes that make up our volatility trading toolbox. We explain the dynamics of one of these notes – the XIV. We show how its changes relate to the VIX changes with the important point that even though there is a regression formula between the two the XIV does not have the mean-reversion predictability of the VIX. This is because the futures market has the predictability already built into the prices. For the purpose of studying risk closely we divide the history of our ETNs into five risk regimes, one of which includes the Global Financial Crisis (GFC). It is interesting that these volatility regime changes actually predated the GFC by a few months and may have been a harbinger of the crisis to come. Then we develop four different methods in order of increasing complexity for trading our ETNs (and hint at a fifth). The different methods are suited to different investors and also provide a consistency of returns that gives us some extra confidence that volatility trading works. The simplest strategy is buy and hold and the most complicated uses just a moving average of historical volatility. All strategies can be calculated in a simple spreadsheet. The investing strategies are very easy to apply and the discussions of the mechanics of the futures markets belies their simplicity. It is possible to trade them without understanding the futures markets at all. We devote significant attention to the risks of the strategies, particularly the risk of being run over by the steamroller. The risks are the usual market risks (such as liquidity) plus the following volatility-specific risks: (i) volatility drag, (ii) timing synchronization risk, (iii) VRP-roll yield convergence risk, (iv) regime change risk, and (v) steamroller risk. We conclude with the finding that being run over by the steamroller isn’t so bad after all. Due to the low (and often negative) correlation of the strategies with the S&P500 we look at how the strategies can be used to boost returns and lower volatility in existing portfolios. We give examples of how combining volatility strategies with stocks (AAPL) or with the S&P500 or with bonds reduces the maximum drawdown and improves the Sharpe Ratio of each. We reduce the AAPL maximum drawdown of 55% to only 36%. Even a small allocation of 10% of a bond portfolio to volatility can boost the Sharpe Ratio from 1 to 2.2 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==22225555332277",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 34,
    "chunk_index": 2,
    "word_count": 587,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "bonds reduces the maximum drawdown and improves the Sharpe Ratio of each. We reduce the AAPL maximum drawdown of 55% to only 36%. Even a small allocation of 10% of a bond portfolio to volatility can boost the Sharpe Ratio from 1 to 2.2 2 EEleleccttrroonnicic ccooppyy aavvaailialabblele aatt:: hhttttpps::////ssssrrnn..ccoomm//aabbssttrraacctt==22225555332277",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 3,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "We conclude with a summary and suggestions for which types of investor the strategies will appeal to. The methodology (and the ETNs) are in their infancy and we offer suggestions for future research. Finally, a 6-page technical appendix is provided as a reference for some of the dynamic concepts in the paper. This is primarily an expository paper which explains concepts that are quite simple. So we omit formal technicalities such as bootstrap, robustness, statistical, and stress tests and leave out mathematics apart from some interesting notes that we confine to a technical appendix. The investing strategies are very easy to apply and the discussions of the mechanics of the futures markets belies their simplicity. 2. The Lure and Intrigue of Volatility The VIX is the Chicago Board Options Exchange Market Volatility Index, CBOE (2009). It is an index that is, in some sense, a measure of the market’s expectation of the average volatility over the next 30 days. It is not a measure of the current volatility in the market although, as we shall see, it is related. Since market volatility (from fact 1) is quite predictable the VIX is quite predictable. It tends to be mean reverting which means that extreme values are more likely to be followed by less extreme values. As proof of the predictability a simple mean-reversion trading strategy based on moving average crossovers3 produces the results shown in the equity curve in Figure 1 (left). The annualized return for the strategy has been 215% since 1990. Figure 1 VIX Short Term Mean Reversion Trading Equity Curve −0.2 100,000,000,000 10,000,000,000 −0.3 1,000,000,000 100,000,000 −0.4 10,000,000 −0.5 1,000,000 100,000 −0.6 10,000 1000 −0.7 100 −0.8 10 1 −0.9 199019921994199619982000200220042006200820102012 1990 1995 2000 2005 2010 3 noitalerroC Dynamic Correlation between S&P500 changes and VIX changes The return is considerable but since the VIX is not tradable the return is not realizable. Related to the VIX is the VXV, the CBOE S&P 500 3-Month Volatility Index. This is, in some sense, a measure of the market’s expectation of the average volatility over the next three months (rather than one month for the VIX). The ratio VXV / VIX is more important to us than the VXV itself. Besides the predictability of the VIX the second lure is that changes in the VIX are negatively correlated with changes in the S&P500. This means that, were it possible, a long position in the VIX, provided it generated positive returns, would provide useful portfolio diversification. Figure 1 (right) shows the 3 Go long when the VIX crosses below the 11 day simple moving average, else go short. In this paper all implementations of the moving average use the median as the average since this generally works better than using the mean Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 34,
    "chunk_index": 4,
    "word_count": 465,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "1 (right) shows the 3 Go long when the VIX crosses below the 11 day simple moving average, else go short. In this paper all implementations of the moving average use the median as the average since this generally works better than using the mean Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 5,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "changing correlation between VIX changes and S&P500 changes calculated using the Dynamic Conditional Correlation (DCC) method (Engle, 2009) which avoids the lag that arises from using rolling windows. Not only is the correlation negative, it seems to be more negative during recent crises. That could be useful. As a further lure we reproduce the chart from Yahoo! in Figure 2. It shows an exchange traded note XIV which tracks inverse volatility compared to the VIX. We note that while the VIX ends up roughly where it started and XIV inversely tracks VIX changes XIV ends up 40% higher than it started. We ask why? And can this be exploited for good returns? 40% gain over six months is indeed a lure. Figure 2 3. The Volatility Risk Premium In order to earn higher returns than the risk-free rate investors must (by definition) take on some risks. The extra returns that taking on these risk provide are call risk premia. The most famous, perhaps, is the equity risk premium which is the excess return that the stock market provides over a risk-free rate. Ilmanen (2011) has a chapter on each of twelve different risk premia. Presumably a well diversified portfolio would be exposed to each of the twelve as they are not 100% correlated with each other. It should be noted that exploiting risk premia is not the same as exploiting market inefficiencies. We will see later that the market incorrectly prices volatility. But this is not an inefficiency, it is simply a premium for risk. The premium that we seek to exploit is the Volatility Risk Premium (VRP) which is the premium that an investor in some asset pays to reduce exposure to the volatility of the future returns of that asset. In other words, the price hedgers are prepared to pay to speculators to offload price risk. In our case the asset is the S&P500 index. The VRP is reflected in S&P500 options by options being overpriced. Sellers of these options (who are essentially “selling volatility”) receive the VRP through these higher prices. Now the VIX is a measure of the “implied” volatility of these options therefore the VIX is too high compared to where it should be if it were an unbiased predictor of future S&P500 volatility. In a nutshell the VIX overpredicts the S&P500 volatility and this overprediction represents the VRP. 4 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 34,
    "chunk_index": 6,
    "word_count": 400,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "of the “implied” volatility of these options therefore the VIX is too high compared to where it should be if it were an unbiased predictor of future S&P500 volatility. In a nutshell the VIX overpredicts the S&P500 volatility and this overprediction represents the VRP. 4 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 7,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "This is easily seen in Figure 3 (left). The red line is the VIX which is a predictor of the mean volatility over the next 30 calendar days. The blue line is the mean realized volatility that resulted on the 30 days subsequent to the VIX reading. It is evident that the VIX overestimates the realized volatility. Figure 3 VIX (red) and Subsequent S&P500 30−day Mean Realized Volatility (blue) 90 1 VIX 80 30d RV 0.8 70 0.6 60 0.4 50 0.2 40 0 30 −0.2 20 −0.4 10 −0.6 0 −0.8 1990 1995 2000 2005 2010 1990 1995 2000 2005 2010 5 ytilitaloV desilaeR gol tneuqesbuS sunim XIV gol Estimate of Volatility Risk Premium The difference between the red and blue lines is an estimate of the VRP. We use differences of the log of the volatility in Figure 3 (right). (Use of logs reduces spikes in the numbers.) It is evident that the VRP is mostly positive but sometimes negative. We note that in periods of high volatility the predictions underestimate the VIX and so the volatility risk premium is negative. At those times we will need to reverse our positions in order to collect the premium. Ilmanen (2011) explains that collecting the VRP is quite lucrative but looks more lucrative than it really is because of the “peso problem.” Rather than the peso term we prefer the term “picking up $100 bills in front of a steamroller.” The problem is that returns look good in any period that does not have a visiting steamroller in it. The good returns should really be moderated for the probability of the steamroller. But in our case we were fortunate to have a steamroller arrive in the form of the Global Financial Crisis (GFC) during our backtesting period. 4. VIX Futures Market We cannot trade the VIX directly but there is an active and liquid futures market for it and this is accessible to retail investors in the form of Exchange Traded Products (ETPs). To understand these ETPs it helps to understand the futures market somewhat. VIX futures can be regarded in some sense (ignoring the VRP, various cash flows, dividends and cost of money effects) as a form of prediction or “bet” on where the VIX will close on the day they expire and are settled. The VIX futures price reflects the market participants’ best collective guess as to what the VIX index will be at settlement. The bets can be long or short. For example, if you buy a long contract4 today at price $16 and the VIX is $18 at settlement then you gain $2. If your bet was short then you would lose $2. For every long bet 4 Note that CBOE Mini-VIX Futures trade at VIX times $100. We assume the value of $1 here for simplicity Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 34,
    "chunk_index": 8,
    "word_count": 476,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "and the VIX is $18 at settlement then you gain $2. If your bet was short then you would lose $2. For every long bet 4 Note that CBOE Mini-VIX Futures trade at VIX times $100. We assume the value of $1 here for simplicity Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 9,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "there is a short bet (a zero sum game) which is why the contract price represents the best collective guess. Figure 4 (left) shows the spot VIX (at Days = 0) and eight VIX futures predictions (contracts) as they were priced at the close on 21 March 2012. This chart is called the term structure. The first red dot on the left shows the actual VIX closed at about 15. The remaining red dots show the eight futures contract prices at various days till settlement5. Contracts are spaced a month apart. Figure 4 VIX Futures Contango as at 21−Mar−2012 26 24 22 20 18 16 14 0 50 100 150 200 250 Days till settlement 6 ecirP VIX Futures Backwardation as at 03−Oct−2008 46 44 42 40 38 36 34 32 30 28 26 0 50 100 150 200 250 Days till settlement ecirP It is evident that market participants predicted the VIX to rise over the next 250 days. When the term structure is rising it is called contango. When it is falling it is called backwardation. The right hand chart shows a state of backwardation on 3 October 2008. Since the ETPs that we will use as our trading vehicles are based on the VIX futures we ask the question: Are there inefficiencies (incorrect pricing) or is there a VRP in the VIX futures term structure? We ignore the possibility that there are inefficiencies in the term structure pricing because trying to outguess the market is a difficult proposition. But a VRP is an easier target because getting paid to take some volatility risk is not an inefficiency. Just because there is a VRP in the options market (the VIX overestimates realized volatility) does not mean that the futures market has the same overestimation and therefore a VRP. But it turns out that it does. If we take the two nearest VIX futures and weight them so that the weighted mean of their settlement days is 30 days we get the futures market’s estimates of the VIX 30 days hence. Figure 5 (left) shows the VIX as predicted by the VIX futures weighted mean (dark green) versus actual realized VIX 30 days subsequent to the predictions. It can be seen that the green line is reasonably consistently above the red line so the VIX futures do overpredict the VIX. Yes, there is a VRP in the VIX futures market. Let us call the VRP in the options market the VRPO and the VRP in the futures market the VRPF. When we refer to the VRP generically we will still call it the VRP. 5 The blue curve is an exponential least squares fit to the points and the horizontal blue line is the resulting fitted asymptote. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 34,
    "chunk_index": 10,
    "word_count": 463,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "the VRP in the futures market the VRPF. When we refer to the VRP generically we will still call it the VRP. 5 The blue curve is an exponential least squares fit to the points and the horizontal blue line is the resulting fitted asymptote. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 11,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Also refer to the 30 day weighted average price of the VIX futures by the term VIX1 (for one month). Similarly 2, 3, … month weighted averages are called VIX2, VIX3, … Figure 5 VIX 30 day Predictions from Weighted Futures (dark green) and Actual 30 day VIX (red) 90 0.6 80 0.4 70 0.2 60 0 50 −0.2 40 −0.4 30 −0.6 20 −0.8 10 −1 0 −1.2 2004 2006 2008 2010 2012 2004 2006 2008 2010 2012 7 XIV yad−03 tneuqesbuS sunim erutuF yad−03 XIV gol Estimate of Volatility Risk Premium in VIX Futures Interestingly, the correlation between the VRPO and VRPF is 0.56. Should we expect the correlation to be higher or even 100%? The VIX already has a risk premium built into it, the VRPO. The VRPF is an additional premium on top of that one. There is no reason to expect that the additional futures premium is correlated with the options premium. But is it, which means that an estimate of one contains information relevant to predicting the other. The VRPF pays off in a simple manner. Suppose we buy a long VIX futures contract priced at $18 and that on settlement date the VIX is at $16. That means the VRPF was $2. Our bet of $18 was high so we lost $2 on the contract. We pay out $2 to the person who bet short. The short seller of volatility collected the VRPF. So on average, since the VRPF tends to be positive, long players in the VIX futures market tend to pay out to short players in the market. The same thing happens in the options markets where option buyers pay out to option sellers on average. Or the commodities market where hedgers pay out to speculators. Or the housing insurance market where house owners pay a premium to insurance companies. In all these examples a premium is paid to another party to take on some risk. This is a fair exchange and is the key to making money using volatility as an asset class. There is a complication in the futures market that we must talk about because many people confuse it with the risk premium. It is the roll yield. 5. Roll Yield There is a widespread belief that profits from the VIX futures markets come from the roll yield. This is not true because (i) if it were true then the roll yield would be a free lunch (ii) the profits actually come from the risk premium Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 34,
    "chunk_index": 12,
    "word_count": 423,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "There is a widespread belief that profits from the VIX futures markets come from the roll yield. This is not true because (i) if it were true then the roll yield would be a free lunch (ii) the profits actually come from the risk premium Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 13,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "This is explained in detail using numerical examples by Gorton & Rouwenhorst (2004). So how does the roll yield work? As the settlement day for the nearest VIX futures arrives the futures price and the spot VIX (i.e. the quoted VIX) must converge to each other to avoid a risk-free arbitrage opportunity. This is because on settlement day our best prediction of the VIX must be the spot VIX itself. So the question is: does the spot VIX converge to the contract price or does the contract price converge to the spot VIX. Aye, there’s the rub6. Because, in a nutshell, if the former, then no profits are made, and if the latter then full profits are made. The roll yield is the difference between the spot VIX and the futures price. It is called a yield because it may pay or cost a small amount every day as the futures price and the spot VIX converge on each other. For example if the spot VIX is $14 and the futures price is $18 and an investor has a short contract then every day as settlement approaches the price of the contract drops a little – e.g. $17.80, $17.65, … so the short investor gains a few cents each day. But remember that the roll yield, per se, is not a free lunch. The reason that the futures price is $18 is because the VIX is predicted to rise to that price. So the price may stay at $18 while the VIX rises to meet it – e.g. $14.26, $14.37, … In that case even though the roll yield still exists it does not pay off because the futures price stays at $18 without moving. What is likely to happen is something between the two extremes. The spot price and futures prices both converge on each other. For example, the VIX could rise to $16 by settlement date and so the futures price will drop to $16, providing a profit to the short seller of $2. The full roll yield of $4 was not realized and in fact the $2 profit came from the difference between the final VIX value and the initial futures purchase price, this difference being the volatility risk premium. We emphasize this point that it is the VRP, not the roll yield, that provides the profit. If there were no VRP then there would be no profit. However, the roll yield and the VRP are correlated because the measure of roll yield ($4 in this case) includes the VRP ($2) . The larger the VRP the larger the roll yield. This correlation leads to successful investing strategies that seek roll yield. But even better strategies result from seeking the VRP. This is useful because roll yield is measurable whereas VRP is not – it has to be predicted because it is not known exactly until settlement date. An important point to note is that the roll yield is positive when the term structure is in contango and negative when in backwardation. 6 Hamlet (Act III, Scene I). This is the key point of the paper. Shakespeare’s word rub is quite appropriate here. Note: there is a technicality in that VIX futures at expiration settle to the VRO VIX settlement value, not the spot VIX but for this paper we regard them as the same. 8 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 34,
    "chunk_index": 14,
    "word_count": 564,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "key point of the paper. Shakespeare’s word rub is quite appropriate here. Note: there is a technicality in that VIX futures at expiration settle to the VRO VIX settlement value, not the spot VIX but for this paper we regard them as the same. 8 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 15,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "The returns from roll yield can be considerable. In the backwardation chart above we could buy the future at value just below $36 and after about 20 days (if the spot VIX did not move) it could be worth about $45 producing a return of about 25% in 20 days. The average roll yield since 2004 has been 5% per month, according to J.P. Morgan (2012 ETF handbook), although it rises to 8% during periods of low market volatility. 6. Exchange Traded Products for Investing in VIX Futures We will focus in this study on four ETNs which provide us with a complete volatility investing toolbox for harvesting the VRP from VIX futures. The ETNs have only existed since 30 November 2010 but using historical CBOE VIX futures prices we have projected the prices back to 2004. The ETNs are: Ticker Inception Date Leverage Term Name XIV 30 Nov 2010 -1 short VelocityShares Daily Inverse VIX Short-Term VXX 30 Jan 2009 +1 short iPath S&P 500 VIX Short Term Futures ZIV 30 Nov 2010 -1 medium VelocityShares Daily Inverse VIX Medium-Term VXZ 20 Feb 2009 +1 medium iPath S&P 500 VIX Medium Term Futures The leverage and term will be explained later. These are not the only exchange traded products offering the features that we require. There are others including ETFs7 (rather than ETNs) but these ETNs offer the longest trading history and the best liquidity. Other volatility ETNs such as XVIX are created using trading rules that we can replicate ourselves using the four ETNs in our toolbox. So we see no reason, yet, to include any more. Our four ETNs are virtually identical to each other in their structure – the only differences are the leverage and the term length – so we will describe the workings of just one, XIV, which turns out to be our main investment vehicle. For precise details of how the ETNs work the prospectuses should be consulted. They are based on futures indexes documented in Standard and Poors (2011). XIV and VXX are inverses of each other. So, ignoring fees, when one goes up 5% the other goes down 5%. This means that we can switch between the two to effect short and long futures positions. Similarly ZIV and VXZ are paired. XIV and VXX invest in short term (1,2 month) futures positions and ZIV and VXZ in medium term (4,5,6,7 months) futures positions. We now explain XIV in detail. 7. XIV Dynamics XIV invests in short VIX futures contracts. This means that it goes up when the VIX futures go down. Usually this means that it goes up when the VIX itself goes down. This can be seen in Figure 2. A chart of XIV daily returns versus VIX daily returns is shown in Figure 6 left. We accentuate recent history since the inception of XIV on 30-Nov-2010 by plotting these points in red. 7 For example the ProShares ETFs SVXY and VIXY offer the same exposure as XIV and VXX but in ETF form 9 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 34,
    "chunk_index": 16,
    "word_count": 510,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "is shown in Figure 6 left. We accentuate recent history since the inception of XIV on 30-Nov-2010 by plotting these points in red. 7 For example the ProShares ETFs SVXY and VIXY offer the same exposure as XIV and VXX but in ETF form 9 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 17,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 6 XIV vs VIX beta = −0.441, alpha = 0.0027, correlation = −0.861 0.4 0.3 0.2 0.1 0 −0.1 −0.2 −0.3 −0.4 −0.4 −0.3 −0.2 −0.1 0 0.1 0.2 0.3 0.4 VIX Daily Returns 10 snruteR yliaD VIX 6 4 2 0 −2 −4 −6 −8 −10 −12 1 2 3 4 5 Lag % noitalerrocotuA Autocorrelations of VIX and XIV with 95% confidence intervals VIX XIV Since it is correlated to the VIX and the VIX is predictable we ask if XIV is predictable. The answer is largely, no. We tested hundreds of mean reversion moving average trading rules but were unable to find any that generated a profit from XIV. This is to be expected and is an important point. VIX futures are predictions of the VIX and any VIX predictability is already built into the futures prices. Predicting XIV is not the same as predicting the VIX – it is the same as predicting the predictions of the VIX. So by using futures we have missed any gains we might have expected from the predictability of volatility (point (1) in the introduction). This is illustrated in Figure 6 right where we plot the autocorrelation of VIX and XIV for lags 1 to 5. The VIX is negatively autocorrelated for the first three lags which means that VIX changes can be predicted 3 days hence. But XIV has no significant autocorrelation (the blue horizontal lines indicate 95% confidence bounds). A minor complication with XIV is that it shorts two futures contracts with different settlement dates. It chooses the two nearest settlement dates and shorts a weighted combination of the two contracts such that the weighted duration of the two is 30 calendar days. This means that every day it must reweight and so it must dispose of a bit of the near contract and acquire a bit of the further contract. So effectively XIV becomes a constant maturity contract with a fixed duration of 30 days. We could ignore this technicality but it affects the roll yield calculation. Instead of the roll yield being the difference in price between the spot VIX and the nearest contract it becomes the difference between the two nearest futures prices, price1 and price2. We can calculate the daily roll yield as the difference between the two nearest contract prices divided by 30. XIV daily roll yield = (price2 – price1) / 30 An interesting exercise is to ask now that we can calculate the roll yield is: if we could have collected all the potential roll yield how much could we have got? We can’t answer this question exactly because although we can calculate the roll yield at the end of each day it is a moving quantity and may not reflect the actual yield obtained during that or the next day. So we call it the expected roll yield. But assuming that it is stable enough to be predictive then the daily expected roll yield is shown in Figure 7 (left) and the potential cumulative roll is in Figure 7 (right). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 34,
    "chunk_index": 18,
    "word_count": 516,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "that or the next day. So we call it the expected roll yield. But assuming that it is stable enough to be predictive then the daily expected roll yield is shown in Figure 7 (left) and the potential cumulative roll is in Figure 7 (right). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 19,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 7 1.5 1 0.5 0 −0.5 −1 −1.5 −2 −2.5 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 11 yad rep % dleiY Expected Roll Yields for XIV Regime 1 Regime 2 3 Regime 4 Regime 5 1000 100 10 1 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 )elacs gol( evruC ytiuqE Cumulative Expected Roll Yields for XIV Regime 1 Regime 2 3 Regime 4 Regime 5 Since the roll yields can be as high as 0.5% or 1% per day the roll yields can accumulate to considerable returns. It should be noted that the roll yields are tiny compared to the day to day volatility of XIV which results from its correlation to the day to day volatility of the VIX. XIV can easily move 10% in a day. More on this below. Also explanation of the regimes 1 to 5. Besides the fact that we can only collect the VRP there are other reasons why we cannot reap the full roll yield. We discuss these in the risk section below. 8. More XIV Dynamics VIX futures trading started in 2004 but with low liquidity and missing months. Nevertheless we used historical prices provided by the CBOE and interpolated missing months to create a hypothetical back history of XIV and the other ETNs had they existed in 2004. Reliable pricing history did not start until the beginning of 2006 but we are sure that our figures for 2004 and 2005 are sound enough to be useful. The last date for our data is 15 February 2013. We plot the ETNs in Figure 8 (using log prices in the right hand chart). Figure 8 Short ETNs backfilled to 2004 Long ETNs backfilled to 2004 50 9 Regime 1 Regime 2 3 Regime 4 Regime 5 Regime 1 Regime 2 3 Regime 4 Regime 5 45 8 40 XIV VXX 35 ZIV VXZ 7 30 25 6 20 5 15 10 4 5 0 3 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 34,
    "chunk_index": 20,
    "word_count": 355,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "3 Regime 4 Regime 5 45 8 40 XIV VXX 35 ZIV VXZ 7 30 25 6 20 5 15 10 4 5 0 3 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 21,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "We divided the 2004 to 2013 period into five different risk regimes which we picked out by eye. Regime 1 is pre-GFC. Regime 2 roughly coincides with the GFC starting with a big drop in XIV on 22 February 2007. This actually pre-dates the start of the GFC and may have been a harbinger of things to come. XIV then performs badly through regimes 2 and 3 until 20 November 2008 when it recovers. Again this predates the end of the GFC and may have been a harbinger. We sectioned off part of the GFC and called it regime 3 – this regime turns out to be specially profitable and could be regarded as an outlier when evaluating trading strategies. More on this later. The post GFC region is divided into two regimes – in regime 5 hedging strategies failed from 8 October 2010 onwards. Why this happened is a mystery to us and so we note regime 5 for being more risky than regime 4. The vertical dotted purple colored line shows the inception date of XIV. From that date onwards we use the actual XIV daily close prices (source yahoo.com). We note the following observations: (i) XIV and VXX have higher returns and volatility than ZIV and VXZ. This is because the roll yield and VRP is smaller for futures further away from the settlement date and because those futures are less exposed to volatility in the VIX. (ii) VXX has a massive loss of value over the nine year period but its inverse XIV does not have a corresponding massive gain in value. This is because the inverse returns are measured on a daily basis but when daily returns are compounded over 9 years the volatility of the returns detracts from the compounded returns. This detraction is called volatility drag and occurs with leveraged ETFs. For a discussion of this see, for example, Avellaneda and Zhang (2010). (iii) The “steamroller” effect is visible for XIV. It had a 25% fall in one day at the start of regime 2. Its maximum drawdown to the end of regime 3 was 93%. (iv) As noted above, the GFC regimes precede the GFC S&P500 bear market by about six months. (v) Measurements show that for long intervals of time XIV returns have a Sharpe Ratio (SR) between 2 and 3. For example, regime 1 has SR = 2.63, and there are other periods longer than a year where SR > 2. A goal is to be able to time these periods. Some summary statistics for the four ETNs are in the table below. Alpha and Beta refer to the beta with respect to the VIX and also with respect to the S&P500. Ticker CAGR Annualized Maximum VIX Alpha VIX Beta S&P 500 S&P500 Volatility Drawdown Alpha Beta XIV 31.4% 56.5% 92.6% 97.5% -0.441 37.8% 2.060 VXX -47.0% 56.4% 99.6% -51.5% 0.440 -30.4% -2.058 ZIV 4.2% 29.8% 79.6% 21.4% -0.200 2.7% 1.018 VXZ -13.1% 30.1% 81.5% -19.1% 0.214 -3.3% -1.071 9. Trading Strategies Firstly we look to see if the raw series of XIV prices can be traded. Although the price series looks as though it is somewhat mean-reverting we exclude mean-reversion tests because the reversion occurs over the period of a decade and seems to be more related to one-off events such as the global financial crisis rather than an intrinsic property of XIV. In any case, we were unable to find a profitable mean- reversion trading rule based on moving average crossovers that came close to matching trend-following rules. 12 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 34,
    "chunk_index": 22,
    "word_count": 596,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "more related to one-off events such as the global financial crisis rather than an intrinsic property of XIV. In any case, we were unable to find a profitable mean- reversion trading rule based on moving average crossovers that came close to matching trend-following rules. 12 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 23,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "The XIV price series is either a random walk without drift (in which case it cannot be traded), a random walk with drift (in which case buy-and-hold is the optimal strategy), or not a random walk (in which case it may be possible to devise a profitable trading rule). We tried various random walk statistical tests consisting of variations, with and without drift, of the variance ratio test, the Augmented Dickey-Fuller test, and the Phillips-Perron test. None of these tests could reject a random walk. Therefore the safest approach is to assume that XIV is a random walk and that technical analysis may not work for trading – excess returns may be illusory. It is a grim fact of backtesting that every time we optimize a trading parameter by looking at past data, even though that parameter value may be optimal going forward, future returns will generally not be as high as past returns even if market conditions stay the same. That is because when we do the optimization we invariably get some market noise into the return calculation for the optimization. Going forward, the noise will be different and so will no longer contribute to the returns. This is called regression to the mean. Francis Galton demonstrated it clearly when he showed that if you take the tallest fathers in a group (the “optimal” fathers) their sons will not be as tall as the fathers even though those sons will still be the tallest sons on average. For a complete discussion see the chapter “Fool’s Gold” in Aronson (2007). So every time we optimize a parameter in a trading rule we put a Grim Reaper icon in the margin to indicate that we expect some reversion to zero in mean returns to follow. We can ameliorate regression to the mean by choosing a “typical” rather than optimal value for the parameter. For example, in the momentum case below we will choose 83 rather than the optimal value of 88. But we still expect some regression to the mean anyway. We now examine five different trading strategies that use just our four ETNs in the toolbox. The strategies are listed in order of increasing complexity. 9.1 Strategy 1 – Buy and Hold There are several reason why we might consider a buy and hold strategy for XIV: (i) The annualized buy and hold return was 31.4% per annum. This is remarkably high given that XIV had massive drawdowns during the GFC and the Euro crisis of 2011. (ii) We expect that the GFC was a once-in-a-lifetime event and that a 92.6% drawdown is unlikely to be repeated soon. So we feel reasonably confident that the return going forward will be even higher than 31.4%. Two reasons for not considering buy and hold are (i) even without a GFC the drawdowns can frequently reach 50% (ii) the strategies described below are much better. It is interesting to see what a backwards-looking buy and hold portfolio optimization of the four ETNs looks like: 13 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 34,
    "chunk_index": 24,
    "word_count": 507,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "not considering buy and hold are (i) even without a GFC the drawdowns can frequently reach 50% (ii) the strategies described below are much better. It is interesting to see what a backwards-looking buy and hold portfolio optimization of the four ETNs looks like: 13 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 25,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 9 50 40 30 20 10 0 −10 −20 −30 −40 −50 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 14 % nruteR yliaD naeM dezilaunnA Mean−Variance Efficient Frontier for XIV,VXX,ZIV,VXZ, 2004 to 2013 AAPL XIV AMZN MIDD PNRA ZIV AGG S&P500 VXZ VXX We put in as reference points but excluded from the optimization the S&P500 index, the ETF AGG which tracks the Barclays Capital Aggregate Bond Index and the stellar performers Apple (AAPL), Amazon.com (AMZN), Panera Bread (PNRA) and Middleby Corp. (MIDD). It can been seen why we only need these four ETNs in our toolbox. Combining them allowed us (in the period 2004 to 2013 to achieve any level of risk from below-bond risk of about 3% to returns as high as Apple at about 45%. (Note that these returns are mean annualized daily arithmetic returns, not mean annualized compound returns.) 9.2 Strategy 2 – Momentum Momentum (a form of trend following) has been a widely studied phenomenon in the literature and has been found in many asset classes. Asness, Moskowitz & Pedersen (2009) claim to have found it “everywhere.” However, there has been little study of momentum in volatility as an asset class. It might be expected that there is momentum in volatility markets as well because of the persistence of volatility. The roll yield and VRP charts above show that there also seems to be persistence in these factors as well. Zooming in on the relevant charts we see that sign persistence frequently lasts for one, three, six months and even longer. So we might see momentum for look-back periods of a few months. To test this we constructed a portfolio based on the four ETNs in our toolbox using the momentum rule: (i) hold the single ETN that has the best return as measured over the last k days (ii) if all measured k-day returns are zero stay out of the market We ignore trading frictions and do the rebalancing every day as this is a theoretical exercise. In practise we would need to look at those costs before choosing an optimum value of k and rebalancing period. We also assume that when out of the market returns are zero. In practise the investments would be in cash but we don’t want include that variable in our results. Marshall, Nguyen, and Visaltanachoti, (2013) find that moving average timing rules may offer meaningful return gains over momentum. We found that to be the case here but small changes in the parameters produced wild changes in the results so the method failed the robustness test and we have low confidence in the method going forward. Momentum seems more reliable. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 34,
    "chunk_index": 26,
    "word_count": 454,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "return gains over momentum. We found that to be the case here but small changes in the parameters produced wild changes in the results so the method failed the robustness test and we have low confidence in the method going forward. Momentum seems more reliable. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 27,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 10 shows mean variance charts for momentum for various values of k. The right hand chart is a zoomed-in version of the left. The lower charts show correlation of the returns with S&P500 returns. We are pleased to see that the correlations are negative. Figure 10 80 60 AAPL XIV 40 AMZN MIDD PNRA 20 ZIV AGG S&P500 0 VXZ −20 −40 VXX −60 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 15 % nruteR yliaD naeM dezilaunnA Mean−Variance chart for Momentum Portfolios 76 88 75 83 85 74 87 73 82 72 71 81 84 7 5 76 70 69 74 87 6 7 68 89 69 70 79 28 30 68 29 92 73 67 80 66 66 91 93 94 50.5 51 51.5 52 52.5 Risk (Annualized Daily Standard Deviation %) % nruteR yliaD naeM dezilaunnA Mean−Variance chart for Momentum Portfolios 0 −0.05 −0.1 −0.15 −0.2 −0.25 10 20 30 40 50 60 70 80 Annualized Mean Daily Return % noitalerroC Correlation with S&P 500 for Momentum Portfolios 2004 to 2013 97 −0.105 93 −0.11 26 −0.115 32 56 92 39 −0.12 30 36 31 29 − − − 0 0 . . 0 1 1 . 3 2 1 5 5 3 45 46 40 6 5 3 9 64 6 6 5 7 5 6 2 3 2 3 1 5 3 5 2 7 7 8 3 8 9 0 7 1 6 9 6 1 8 0 73 7 0 7 7 7 6 8 4 7 9 9 8 5 8 1 4 82 88 −0.14 47 57 37 60 7 9 68 8 6 76 8 7 85 54 28 −0.145 67 83 50 −0.15 48 52 43 58 41 42 −0.155 51 50 55 60 65 70 75 Annualized Mean Daily Return % noitalerroC Correlation with S&P 500 for Momentum Portfolios 2004 to 2013 It seems that a period for the momentum measure somewhere in the 80’s is optimal. We like the value 83 (shaded solid in the charts) as a good compromise between return and negative correlation. So we use the 83-day momentum rule as our representative for Strategy 2-momentum. 9.3 Strategy 3 – Contango-Backwardation Roll Yield The main aim of this strategy is to seek to maximize the roll yield by investing in XIV when the VIX term structure is in contango and in VXX when the term structure is in backwardation. This strategy is extremely simple and there are no parameters to tune (so no visit from the Grim Reaper) or calculations to make. One simply invests in XIV if VXV >= VIX and in VXX if VXV < VIX. Prices for VXV and VIX are easy to find (use the symbols ^VXV and ^VIX on finance.yahoo.com). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 34,
    "chunk_index": 28,
    "word_count": 471,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "tune (so no visit from the Grim Reaper) or calculations to make. One simply invests in XIV if VXV >= VIX and in VXX if VXV < VIX. Prices for VXV and VIX are easy to find (use the symbols ^VXV and ^VIX on finance.yahoo.com). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 29,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "In Figure 4 above it is easy to determine that the term structure is in contango or backwardation (CoB). But quite often during certain regimes it is difficult due to the term structure being flat or “wavy.” So it can be difficult to determine CoB. We used a number of different measures to determine CoB. These are ratios of various constant maturity parts of the term structure to other parts: Vratio – the ratio VXV / VIX ERY – the Expected Roll Yield – the slope of the term structure between the two nearest contracts T1ratio = VIX1 / VIX T2ratio = VIX2 / VIX T5ratio = VIX5 / VIX T51ratio = VIX5 / VIX1 T52ratio = VIX5 / VIX2 T21ratio = VIX2 / VIX1 Figure 11 100 50 AAPL XIV AMZN MIDD PNRA AGG S&P500 ZIV 0 VXZ −50 VXX 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 16 % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for Contango / Backwardation Strategies 85 T1ratio VRP Strategies 80 Vratio 75 T2ratio 70 65 T5rat i o ERY 60 55 T52ratio 50 T21ratio 45 T51ratio 56.2 56.25 56.3 56.35 56.4 56.45 56.5 56.55 56.6 56.65 Risk (Annualized Daily Standard Deviation %) % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for Contango / Backwardation Strategies The results are in Figure 11. Ratios using the mid-term parts of the VIX term structure (ratios with 5 in the name) seem not as good as nearer ones (with 1 or 2 in the name). We thought that ERY would be a good performer because it measures the roll yield but it is outperformed by ratios with VIX in the denominator. Perhaps this is because these ratios contain an element of VRPF prediction in addition to roll yield. The one we like the best is Vratio. Although not as good as T1ratio the difference may not be statistically significant (bootstrap tests for significance are outside the scope of this expository paper) but more importantly Vratio is much easier to calculate. Prices for VXV and VIX are readily obtainable whereas T1ratio requires futures prices to be obtained and then an interpolation between them to be calculated. A bonus from Vratio is that if we smooth it by applying a 10 day moving average to it to reduce the number of trades we get a slightly better performance. We call this the Vratio10 rule. We discuss below the reason why this may work. So Vratio is our representative indicator for strategy 3 (although in practice we would use Vratio10). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 34,
    "chunk_index": 30,
    "word_count": 429,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "to it to reduce the number of trades we get a slightly better performance. We call this the Vratio10 rule. We discuss below the reason why this may work. So Vratio is our representative indicator for strategy 3 (although in practice we would use Vratio10). Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "Easy Volatility Investing",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 31,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Easy Volatility Investing (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "An advantage of the CoB strategy is that we can measure the degree of CoB quite precisely using the Vratio. But with the VRP we can barely define it, let alone estimate it. The VRP is a measure of excess pricing in the market over and above what should be there. But how do we come up with a value for “should?” Should we use a GARCH model? Should we use historical volatility (and if so, over what period – 10 or 21 or n days)? And should we predict S&P500 volatility or the level of the VIX? And then given a prediction should we compare it to zero to decide whether to go long or short or should we compare it to a threshold? The latter seems more reasonable since any estimator we use is bound to have a bias and maybe traders themselves have a bias. But this threshold introduces an extra tuning parameter that invites the Grim Reaper. We tried nine different measures of the VRP. They are named: HVOL21, HVOL10, HVOL10S – the current VIX minus the historical volatility calculated over the last 21, 10, and 10 business days respectively with the last one having a smoothing 5 day moving average applied. EGARCH, EGARCH1, EGARCH2, EGARCH5 – these are respectively the VIX, VIX1, VIX2, and VIX5 minus the EGARCH(1, 1) estimates of the mean volatility over the next month. VRPO21, VRPF21 – these are the actual VRPO and VRPF realized VRPs as measured 21 business days ago. We tried these nine with and without fitting an optimized threshold (e.g. use XIV if VRP > threshold else use VXX). That gave us 18 VRPs to try out. In Figure 12 the dark circles are the VRPs with optimized thresholds and the labels have a T suffix. Naturally, the use of a threshold improved the performance of these estimators but invites a visit from the Grim Reaper. Figure 12 120 100 80 60 AAPL XIV 40 MID D AMZN 20 PNRA AGG S&P500 ZIV 0 VXZ −20 −40 VXX −60 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 17 % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for VRP Strategies 110 HVOL10ST Zero Threshold Nonzero Threshold HVOL10S EGARCH2T 100 HVOL10T HVOL21T 90 VRPO21T EGARCH5T HVOL10 EGARCH1T HVOL21 80 VRPF21T VRPO21 EGARCH1 EGAR CEHGTARCH5 EGARCH2 70 EGARCH 60 50 VRPF21 40 56.15 56.2 56.25 56.3 56.35 56.4 56.45 Risk (Annualized Daily Standard Deviation %) % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for VRP Strategies Zero Threshold Nonzero Threshold In the first chart all the VRP strategies have about the same volatility because they switch between XIV and VXX both of which have about the same volatility. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 34,
    "chunk_index": 32,
    "word_count": 456,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Standard Deviation %) % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for VRP Strategies Zero Threshold Nonzero Threshold In the first chart all the VRP strategies have about the same volatility because they switch between XIV and VXX both of which have about the same volatility. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 33,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Which one is the best one to use? HVOL10 and HVOL21 are about in the middle so seem reasonably robust and historical volatilities are much easier to calculate than EGARCH estimates. Maybe traders use historical volatility when they price VIX futures so it is more predictive of the amount of VRP traders are pricing in. So we use HVOL. But as a bonus when we smoothed HVOL10 by applying a 5 day moving average (to avoid trading whipsaws) to get HVOL10S we got a better performer. Not only that but as an extra bonus this strategy works well with a zero threshold. That appeals as being more elegant and removes one optimization parameter. So as a representative of Strategy 4-VRP we use HVOL10S – the 10 day historical volatility smoothed by applying a 5 day moving average. 9.5 Strategy 5 – Hedging (including Roll Yield Arbitrage) This hedging strategy is aimed at ETN providers as it is too complicated for most retail investors and is outside the scope of this paper. But we are obliged to mention it because it shows a significant regime risk. Two beta-neutral strategies (called roll yield arbitrage) have been implemented by ETN providers – tickers XVIX and XVZ. Two variations have been promoted in the literature – CVIX and CVZ. We implemented these four strategies and found that they failed dismally in Regime 5. This is a significant regime risk and must be discussed. We overcame this risk with a dynamic hedging strategy called BLVDLM. Its description makes for an interesting read as it is useful to see what the constraint of beta-neutrality or near beta-neutrality achieves. Full details of all five strategies are in the technical appendix. 9.6 Other Strategies As will be explained below, volatility of the VIX will count as a drag on the returns of these strategies. So by incorporating volatility into trading rules we can improve their performance. The best measure to use for this is the standard deviation of the log of the VIX (stdlVIX) over the last 21 days. This incorporates both the volatility of the daily changes in the VIX and the magnitude of the VIX in one measure (since it turns out that the rules are also harmed by increasing magnitude of the VIX). For example, instead of a rule go long XIV when Vratio > 1 if we use the rule go long XIV when Vratio > 1 and stdlVIX < 0.14 we can boost the returns of Strategy3-Roll Yield almost to that of Strategy 4-VRP on back tested returns. A similar rule change does not boost Strategy 4-VRP much at all. So we suspect that VIX volatility is the missing ingredient that makes roll yield strategies less effective than VRP strategies. This is the subject of ongoing research. 10. Risks 18 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 34,
    "chunk_index": 34,
    "word_count": 472,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "back tested returns. A similar rule change does not boost Strategy 4-VRP much at all. So we suspect that VIX volatility is the missing ingredient that makes roll yield strategies less effective than VRP strategies. This is the subject of ongoing research. 10. Risks 18 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 35,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "The strategies we have discussed have produced massive returns. In this section we consider two aspects of risk: (i) the risk of not getting these returns in the future and (ii) the benefits of incorporating these returns into an existing portfolio. One reason that these returns may not persist is that the VRP itself may not persist. We think this unlikely given that there will always be people willing to pay a premium to have someone else take on their risk. A second reason is that the size of the VRP may decrease. This seems likely once people understand the VRP better, feel safer with it, and more investors seek to harvest it. A third reason may be due to the mechanics of the futures markets and ETNs and also regulatory matters. Alexander and Korovilas (2012b) discuss the “curse” of ETNs. They provide a technical discussion of risks such as front-running of ETNs, issuer moral hazard risks, credit risks, and liquidity risks. A big concern is that amplitude and frequency of volatility cycles have increased markedly since the introduction of VIX futures ETNs which imposes further risks. Those three market risks are risks in the market looking into the future. As well as those there are risks that we observe from looking into the past. There are five risks that we see: (i) volatility drag (ii) timing synchronisation risk (especially volatility cycles) (iii) VRP-roll yield risk (iv) regime change risk (including crises) (v) (sudden) drawdown risk (steamroller risk) The XIV prospectus documents these risks in a non-technical manner: The ETNs are only suitable for a very short investment horizon. The relationship between the level of the VIX Index and the underlying futures on the VIX Index will begin to break down as the length of an investor’s holding period increases, even within the course of a single Index Business Day…The long term expected value of your ETNs is zero. If you hold your ETNs as a long term investment, it is likely that you will lose all or a substantial portion of your investment. XIV has been designed as a daily trading vehicle. Nevertheless, by understanding the risks of holding for longer than a day we can time some of them away. We now consider those risks in detail. 10.1 Volatility Drag It is an inconvenient mathematical fact that when we compound daily returns the compounded return is reduced the more volatility there is in the daily returns (Avellaneda and Zhang 2010). We call this reduction in return volatility drag because the higher the volatility the less the compounded return. Consider the following demonstration that occurred during 2012. Volatility drag is always present but in this instance it stands out because the mean daily change in both VIX and XIV during the period was approximately zero. 19 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 34,
    "chunk_index": 36,
    "word_count": 472,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "higher the volatility the less the compounded return. Consider the following demonstration that occurred during 2012. Volatility drag is always present but in this instance it stands out because the mean daily change in both VIX and XIV during the period was approximately zero. 19 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 37,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 13 VIX (green) and XIV (orange) during 25 Mar 2012 to 15 Aug 2012 28 0.9 VIX 26 XIV 0.8 24 0.7 22 0.6 20 0.5 18 0.4 16 0.3 14 0.2 12 0.1 10 0 8 −0.1 01 Mar 01 Apr 01 May 01 Jun 01 Jul 01 Aug 01 Sep 01 Mar 01 Apr 01 May 01 Jun 01 Jul 01 Aug 01 Sep 20 yad rep % dleiY Expected Roll Yields for XIV during 25 Mar 2012 to 15 Aug 2012 The left chart in Figure 13 shows the VIX and XIV during the period. The VIX had zero mean return during the period so contributed roughly zero to the XIV return. That means that all of XIV’s return came from the roll yield. The right chart shows that the roll yield was significant during the period and the roll yield was never negative. We would expect that XIV would gain considerably during the period since the roll yield was about 0.4% per day. Yet XIV went nowhere. The reason is that the volatility drag cancelled out the roll yield. The calculations that show that this is what happened are a bit technical and are not necessary for an understanding of the concept so have been relegated to the Technical Appendix. We can estimate the volatility drag because it is based on the volatility of the VIX and the beta of XIV with respect to the VIX. Figure 14 shows the daily volatility drag that we calculated for XIV. We see that for much of the time volatility drag is costing us return loss at a rate of about 10 to 20% per annum, occasionally rising to more than 80% per annum. Of concern is that Alexander and Korovilas (2012b) report that the amplitude of volatility cycles is increasing with time which means that volatility drag is increasing also. Figure 14 120 100 80 60 40 20 0 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 % yliaD dezilaunnA XIV Volatility Drag (Annualized Daily %) Regime 1 Regime 2 3 Regime 4 Regime 5 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 34,
    "chunk_index": 38,
    "word_count": 355,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "which means that volatility drag is increasing also. Figure 14 120 100 80 60 40 20 0 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 % yliaD dezilaunnA XIV Volatility Drag (Annualized Daily %) Regime 1 Regime 2 3 Regime 4 Regime 5 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "9.4 Strategy 4 – Volatility Risk Premium",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 39,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "9.4 Strategy 4 – Volatility Risk Premium (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "When the VIX futures term structure flicks frequently between contango and backwardation the following synchronization scenario can happen: suppose one day we have contango and so are invested in XIV. The VIX jumps and the structure goes into backwardation. XIV drops because the VIX has risen (remember that XIV has a negative beta to the VIX). Because we are now in backwardation we switch into VXX. Then the VIX drops back to its original value and the term structure returns to contango. Because VXX is long VIX we lost money on that drop. If we had stayed in XIV the two VIX moves would have cancelled out but because of the switch we ended up losing on both moves. Since the VIX can move quite a few percent in a short time these synchronization losses can be quite large. The TSR is a cyclic risk in the sense that it only occurs when the term structure cycles between contango and backwardation. Alexander and Korovilas (2012b) fear that the amplitude and frequency of volatility cycles is getting worse so TSR risk may be getting worse also. It appears, however, that we can reduce TSR by applying a moving average to our contango indicator which smoothes out the whipsaws. A good period for the average appears to be about 10 days. 10.3 VRP-Roll Yield Risk (VRP-RYR) As mentioned above, it is the VRP that provides our returns, not the roll yield. The VRP-RYR is the risk we may incur when we pursue roll yield instead of the VRP. Although the two are correlated this correlation can disappear – especially in times of VIX volatility where the VIX frequently reverts to its mean (and thereby denying us the roll yield – there’s the rub). This risk is easily measured since it manifests itself as a tendency for the VIX to rise when the term structure is in contango (and we are short the VIX) and to fall when in backwardation (when we are long the VIX). This causes a drag on our returns. We can measure this drag by pretending to trade the VIX using our CoB trading rule and plotting the equity curve. The equity curve gives accumulated drag – it measures the equity that accumulated to the Grim Reaper. We plot this accumulated drag for both the Vratio and VRP strategies in Figure 15. When the drag curve is rising, as it is with the Vratio roll yield strategy the drag is working against us. But for the VRP strategy (lower blue line) the drag is negative and actually works in our favor. This accentuates our claim that it is not roll yield that produces the returns from the ETNs, but the VRP. It is interesting to note that the VRP-RYR drag has been largely zero for the Vratio strategy during regimes 4 and 5. We wonder why. 21 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 34,
    "chunk_index": 40,
    "word_count": 483,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "accentuates our claim that it is not roll yield that produces the returns from the ETNs, but the VRP. It is interesting to note that the VRP-RYR drag has been largely zero for the Vratio strategy during regimes 4 and 5. We wonder why. 21 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 41,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Figure 15 Accumulated VRP−Roll Yield drag 8 Regime 1 Regime 2 3 Regime 4 Regime 5 6 4 2 0 −2 −4 −6 Vratio Strategy VRP Strategy −8 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 10.4 Regime Change Risk Mean-variance diagrams show returns and the volatility of those returns but they do not show the clustering of those returns that give rise to bull and bear regimes. It is time now to look at some equity curves. Figure 16 (left) shows the equity curves for the four beta-neutral strategies of section 9.5. Figure 16 Equity curves of four Roll−Arbitrage Strategies 7 Regime 1 Regime 2 3 Regime 4 Regime 5 6 1000 5 4 XVZ 100 XVIX CVZ 3 CVIX 10 2 1 1 0 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 22 ytiuqE Equity Curves for Strategies 1 to 5 Regime 1 Regime 2 3 Regime 4 Regime 5 1−Buy and Hold 2−Momentum 3−Roll Yield 4−VRP 5−Hedged Now we see the reason for introducing Regimes 3 and 5. All four beta-neutral strategies had a moderately good run till an atypical (and probably one-off) jump during regime 3. Then they continued without drawdowns till the end of 2010 when, suddenly, they started failing. Three of them declined over the next two years and all of them have declined over the last year. These failures will be a special disappointment to the issuers of XVZ (inception August 2011 – the same time as the Eurozone crisis) and XVIX (inception December 2010) because, after stellar prospects, they have declined since inception. Remember that the strategies hedge VIX moves by taking opposing positions in short-term and mid- term futures. The arbitrage comes from the fact that the short-term futures provide more roll yield than the mid-term futures so there is still some net roll yield (i.e. alpha) left over after the hedging. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 34,
    "chunk_index": 42,
    "word_count": 330,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "VIX moves by taking opposing positions in short-term and mid- term futures. The arbitrage comes from the fact that the short-term futures provide more roll yield than the mid-term futures so there is still some net roll yield (i.e. alpha) left over after the hedging. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 43,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "But during Regime 5 the mid-term roll yield was too high (there was more contango in them than usual) and so the net roll yield was negative. This lead to the decline of the strategies. Why the extra roll yield since 2010? We don’t know. Perhaps it is due to effects of increased volume in the futures markets and the introduction of the new ETNs which occurred mostly around that time. Whatever the reason, it is a new regime. Extra roll yield, of course, means extra profitability from the mid-term futures. This is particularly evident for ZIV (see Figure 8) that has produced returns almost as high as XIV over the period but with much less volatility. During Regimes 4 and 5 ZIV had Sharpe Ratios of 0.27 and 1.48 while XIV had 1.62 and 1.04. So a notable jump for ZIV during Regime 5. Figure 16 (right) shows the equity curves for strategies 1 to 5. Now we see another regime risk – during Regime 2 all strategies faltered. The reason is due to a combination of Volatility Drag, Timing Synchronization Risk, and VRP-Roll Yield Risk plus increasing times when VRP and Roll Yield are in opposing directions. The TSR is particularly relevant since this regime had more contango / backwardation cycles than any other regime. So the roll yield strategy is vulnerable during this regime. One may ask if Regime 2 was too turbulent to be investing in volatility strategies. This was a time that the S&P500 experienced a 57% drawdown so the fact that Strategies 2, 4, and 5 managed to break even indicates relative outperformance. Strategy 3-RollYield, alas, had a 68% drawdown so performed worse than the S&P500. Contango / backwardation just didn’t work during Regime 2. A useful note is that negative correlation of these strategies with the S&P500 comes from using VXX and VXZ. These ETNs were used mostly during Regime 2 which is why the strategies mostly did better than the S&P500. So apart from Strategy 3 we were in the desirable situation of being positively exposed to the equities market when times were good and negatively when times were bad. This makes for useful portfolio diversification. Another useful note is that placing a ruler on the above chart shows that, apart from the GFC regimes, the slopes are remarkably equal for each regime. This suggests to us that the VRP provides an underlying intrinsic rate of return that has not changed over the last nine years. If this is true then it gives us high confidence in the returns of the strategies being mean-reverting so that drawdowns are likely to recover. Indeed, one wonders if the spectacular rise during Regime 3 is a form of mean-reversion for the lack of return during Regime 2. 10.5 (Sudden) Drawdown Risk As we edit this paragraph on 25 February 2013 XIV has suffered a 13.99% drawdown from the previous close8. Any volatility strategy that was long XIV would have suffered this loss. So it is reasonable to ask – have we just been run over by a steamroller? There have been 11 times since 2004 when our backfilled XIV has had a drawdown of more than 13.99% so this event occurs more than once a year on average. Our strategies 2,3,4,and 5 have had this drawdown 3, 7, 6, and zero times respectively. We argue that these events are not “steamroller” events because: 8 It has actually been worse than that because the opening price was $23.04 so the close of $19.18 is a 16.75% drawdown for the day. 23 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 34,
    "chunk_index": 44,
    "word_count": 600,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "drawdown 3, 7, 6, and zero times respectively. We argue that these events are not “steamroller” events because: 8 It has actually been worse than that because the opening price was $23.04 so the close of $19.18 is a 16.75% drawdown for the day. 23 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 45,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "(i) they have occurred often enough that they have been quantified (“once a year”) and do not take us by surprise (in insurance no one has their house burn down every a year) (ii) due to the mean-reverting nature of the VIX we will get at least some of these losses back when the VIX reverts back to its old level and some of these gains will come quickly Regarding point (ii) we note that the opposite of a 13.99% loss is a 16.27% gain9 and this has happened 5, 3, 4, 3, and 0 times for the five strategies respectively. A large spike in a mean-reverting asset is not as dangerous as a spike in a trending asset. What about drawdown risk that is not sudden such as the 92.6%, 43.2%, 68.7%, 54.7%, and 25.4% maximum drawdowns for strategies 1 to 5 respectively? They occurred over a time close to (and somewhat earlier than) the GFC when the S&P500 declined by 56.8% (ignoring dividends). So in that context for strategies 2 to 5 the drawdowns are not steamroller events. Even strategy 1 (buy and hold) was not seriously affected by its 92.6% drawdown. Some investors would say that a 92.6% drawdown requires a 1251% gain to get back even and that because 1251 is so much larger than 92.6 the gain will take a considerable effort to achieve. But this is fallacious thinking and is only true if prices grow arithmetically. In fact, prices grow geometrically so a 1251% gain is just as likely and requires as much time to achieve as a 92.6% loss (in fact more likely and less time if prices generally trend upwards). For these reasons plus the fact that it is impossible for XIV to decline to zero plus the low likelihood of another GFC in our current “lifetime” we consider that steamroller risk does not exist or that this particular steamroller has “spongy rollers” that run over us leaving us shaken and gasping but not permanently harmed. 11. Portfolio Diversification Given that our volatility strategies have low correlations with the S&P500 we ask how well they can be integrated into an equity portfolio and what is the right proportion to use. We also look at integration with a bond portfolio. It turns out that during the period studied the S&P500 performance was so bad that the optimal allocation to any of the volatility strategies is 100%. Why this is so can be seen in the next chart which shows the mean-variance efficient frontier for the three assets AGG, S&P500, and Strategy 4-VRP, along with some equities for comparison. 9 13.99 percent loss is (19.18-22.30)/22.30 and the 16.27 percent gain is (22.30-19.18)/19.18 24 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 34,
    "chunk_index": 46,
    "word_count": 454,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "this is so can be seen in the next chart which shows the mean-variance efficient frontier for the three assets AGG, S&P500, and Strategy 4-VRP, along with some equities for comparison. 9 13.99 percent loss is (19.18-22.30)/22.30 and the 16.27 percent gain is (22.30-19.18)/19.18 24 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 47,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "120 100 80 60 40 20 0 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 25 % nruteR yliaD naeM dezilaunnA Mean−Variance Efficient Frontier for 4−VRP,S&P500,AGG, 2004 to 2013 4−VRP AAPL AMZN MIDD PNRA AAGGGG SS&&PP550000 That is not very instructive so we shall also consider the stellar performer Apple combined with strategy 4-VRP. (We only consider strategy 4-VRP here, the other strategies 2, 3, and 5 produce similar results so we omit them). For the bond portfolio we combine 4-VRP with the AGG ETF. The correlations between the four entities are 4-VRP AAPL S&P500 AGG 4-VRP 1.00 0.20 0.30 -0.14 AAPL 0.20 1.00 0.56 -0.09 S&P500 0.30 0.56 1.00 -0.13 AGG -0.14 -0.09 -0.13 1.00 Figure 17 charts show for the three assets how the Sharpe Ratio and maximum drawdown vary as the proportion of 4-VRP varies from 0 to 100%. Figure 17 2.2 2 1.8 1.6 1.4 1.2 1 0.8 0.6 0.4 0.2 0 20 40 60 80 100 Proportion of 4−VRP % oitaR eprahS Sharpe Ratio of assets hedged with 4−VRP 0.7 0.6 0.5 0.4 0.3 0.2 AAPL 0.1 S&P500 AGG 0 0 20 40 60 80 100 Proportion of 4−VRP % nwodwarD mumixaM Maximum Drawdown of assets hedged with 4−VRP AAPL S&P500 AGG For the bond portfolio it looks like the optimal proportion of 4-VRP is about 10%. In particular it should be noted that just a 10% allocation to 4-VRP dramatically increases the Sharpe Ratio from 1 to 2.2. The improvement in the maximum drawdown is minor, however. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 34,
    "chunk_index": 48,
    "word_count": 263,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "the bond portfolio it looks like the optimal proportion of 4-VRP is about 10%. In particular it should be noted that just a 10% allocation to 4-VRP dramatically increases the Sharpe Ratio from 1 to 2.2. The improvement in the maximum drawdown is minor, however. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 49,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "For the S&P500 the Sharpe Ratio is optimized at 100% 4-VRP. The maximum drawdown is optimal at about 35% 4-VRP. AAPL is optimized at higher proportions. The correlation-diversification effect of 4-VRP is evident. By adding 4-VRP with a maximum drawdown of 55% to AAPL with a maximum drawdown of 61% we get a combination with a maximum drawdown of only 36%. The next chart shows the daily returns of strategy 4-VRP versus those of the S&P500. We can see that it is the times when we are invested in VXX that give us the negative correlation. 25 20 15 10 5 0 −5 −10 −15 −20 −25 −10 −5 0 5 10 S&P500 Daily Return % 26 % nruteR yliaD 4 ygetartS Strategy 4−VRP Daily Return vs S&P500 Daily Return VXX Positions XIV Positions Of course, these results are largely one-time only due to the special case of the GFC giving us plenty of exposure to VXX. Going forward we would expect that the hedging effects would lessen. But it is useful to know that the hedging kicks in during times of crisis. 12. Topics for Future Research There is a limit to what can be achieved using Strategies 1, 2, 3 and not a lot of potential for improvement. For example, the roll yield can be predicted a little better and contango / backwardation predicted a little better but not by much. We are already using state of the art techniques for fitting dynamic linear models so there isn’t much room for improvement in the dynamic hedging strategies either. In contrast, there is great potential in developing predictive models for the VRP and this is where our research is focused. Modern regression methods such as Support Vector Regression combined with Time Series Cross-Validation (or block bootstrap) to produce models that predict well rather than fit well (so there is no danger of overfitting) are showing good potential with the possibility of getting Sharpe Ratios as high as 2 to 3. We might have thought that VRPF would have been better for futures volatility trading strategies but it has turned out that VRPO is better. The relationship between the two is worthy of further research. Combining the two may produce a better VRP than either one alone. Even so, the strategies from the predictive models still have most of the weight in XIV and so are subject to high drawdowns. Preventing drawdowns is a research area that is more difficult to get results Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 34,
    "chunk_index": 50,
    "word_count": 418,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "may produce a better VRP than either one alone. Even so, the strategies from the predictive models still have most of the weight in XIV and so are subject to high drawdowns. Preventing drawdowns is a research area that is more difficult to get results Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 51,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "in (predicting the machinations of European politicians is more of an art than a science). This is especially so given that we have restricted ourselves to exchange traded products so cannot dabble in options and futures. 13. Summary and Conclusion A summary table for our five strategies is below. The two figures for the number of trades using strategy 3-Roll Yield are 17.2 for the Vratio strategy but this drops to 3.3 when we use the 10 day moving average version (Vratio10). CAGR is the compound annual growth rate. Mean is the mean daily return10 (annualized by multiplying by 252). STD is the daily standard deviation annualized by multiplying by sqrt(252). MDD is the maximum drawdown when measured daily. The Sharpe Ratio uses zero as the risk-free rate. Name CAGR % Mean % STD % Sharpe MDD % S&P500 No. Trades Ratio correlation p.a. 1-Buy and Hold 31.4 43.7 56.5 0.77 92.6 0.78 0.1 2-Momentum 84.6 74.5 51.2 1.46 43.2 -0.15 26.1 3-Roll Yield 87.9 79.2 56.5 1.40 68.7 0.11 17.2 (3.3) 4-VRP 140.7 103.9 56.2 1.85 54.7 0.30 8.0 5-Hedged 43.2 39.1 25.2 1.55 25.4 0.01 Daily There is a strategy for a variety of investors: 1-Buy and Hold: We included this strategy to give some confidence that even though drawdowns may be severe, in the long term they shouldn’t be fatal. We don’t expect investors to actually use this strategy. But we do note that if XIV is plotted every 4 years from 2004 the result is a straight line from $2 to $12. One cure for drawdown is to not look at your returns too often! 2-Momentum: This is purely technical trading based on price. Technical analysts may like to use this method because they might feel that they can improve on the method. We have had reports that the True Strength Indicator performs very well on XIV. 3-Roll Yield: Conservative fundamental traders will like this method because it is based on the fundamental contango / backwardation state of the market and the number of annual trades is low. 4-VRP: Aggressive fundamental traders will like this method because it is based on the fundamental Volatility Risk Premium. Aggression is required because the number of trades is high and because the VRP is difficult to measure and can only be estimated. 5-Hedged: This will appeal mostly to ETF providers who can afford to rebalance every day and have the software to calculate the Dynamic Linear Model because it achieves a Sharpe Ratio as good as the other strategies but with lower drawdowns and zero correlation with the S&P500 – all good selling features. Strategies 3 and 4 are repeated here: 10 Astute observers will notice that in most cases the CAGR exceeds the Mean which is unusual and is a result of the non- Gaussian nature of the returns 27 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 34,
    "chunk_index": 52,
    "word_count": 477,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "with the S&P500 – all good selling features. Strategies 3 and 4 are repeated here: 10 Astute observers will notice that in most cases the CAGR exceeds the Mean which is unusual and is a result of the non- Gaussian nature of the returns 27 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 53,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "3-Roll Yield: if the 10 day moving average of VXV/VIX > 1 go long XIV else go long VXX 4-VRP: if the 5 day moving average of (VIX - 10 day historical volatility) > 0 go long XIV else go long VXX Note that although these two strategies are subject to the Grim Reaper the amount of optimization we used was minor and the returns are quite robust to differences in the parameters so we don’t expect much regression towards zero. Regarding the conservative versus aggressive fundamental trading we have had a position in XIV since late 2011. The Vratio10 rule gave a buy signal on 10 October and has not given an exit signal since then. The investment has gone up 3.69 fold – that is a return of 269% in about 16 months with one trade. We did not have the Strategy 4-VRP rule at that time. But had we started using it on that date the investment would have increased 4.99 fold – a return of 399% using 12 trades. We consider this to be a more aggressive strategy. For portfolio diversification it seems that instead of a 60% equities, 40% bonds portfolio we would be better to have something like 55% equities, 35% bonds, and 10% volatility. This boosts portfolio performance, reduces its risks, and diminishes possible drawdowns from the volatility component. More aggressive equity investors may wish to increase the volatility proportion even higher. 14. References Alexander, Carol and Korovilas, Dimitris, (2012a), Understanding ETNs on VIX Futures. Available at SSRN: http://ssrn.com/abstract=2043061 Alexander, Carol and Korovilas, Dimitris, (2012b), Volatility Exchange-Traded Notes: Curse or Cure? Available at SSRN: http://ssrn.com/abstract=2062854 Aronson, David R. (2007). Evidence-based technical analysis: applying the scientific method and statistical inference to trading signals (Vol. 274). John Wiley and Sons, New Jersey. Asness, C., Moskowitz, T., & Pedersen, L. (2009). Value and momentum everywhere. In AFA 2010 Atlanta Meetings Paper. Avellaneda, M., & Zhang, S. (2010). Path-dependence of leveraged ETF returns. SIAM Journal on Financial Mathematics, 1(1), 586-603. CBOE, (2009). VIX White Paper, www.cboe.com/micro/vix/vixwhite.pdf, VXV index www.cboe.com/micro/vxv/ Campagnoli, P., Petrone, S., & Petris, G. (2009). Dynamic Linear Models with R. Springer-Verlag New York. 28 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 34,
    "chunk_index": 54,
    "word_count": 364,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Paper. Avellaneda, M., & Zhang, S. (2010). Path-dependence of leveraged ETF returns. SIAM Journal on Financial Mathematics, 1(1), 586-603. CBOE, (2009). VIX White Paper, www.cboe.com/micro/vix/vixwhite.pdf, VXV index www.cboe.com/micro/vxv/ Campagnoli, P., Petrone, S., & Petris, G. (2009). Dynamic Linear Models with R. Springer-Verlag New York. 28 Electronic copy available at: https://ssrn.com/abstract=2255327 Engle, Robert, (2009). Anticipating Correlations: a New Paradigm for Risk Management. Princeton University Press. Gorton, G., & Rouwenhorst, K. G. (2004). Facts and fantasies about commodity futures (No. w10595). National Bureau of Economic Research. Ilmanen, Antti, (2011) Expected Returns: An Investor's Guide to Harvesting Market Rewards. Vol. 535. Wiley. Marshall, Ben R., Nguyen, Nhut H. and Visaltanachoti, Nuttawat, (2013), Time-Series Momentum versus Moving Average Trading Rules. Available at SSRN: http://ssrn.com/abstract=2225551 Standard and Poors, (2011), S&P 500 VIX Futures Indices Methodology available from www.standardandpoors.com 29 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 29,
    "page_range": "p.29-30",
    "total_pages": 34,
    "chunk_index": 55,
    "word_count": 139,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.29-30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "An Investor's Guide to Harvesting Market Rewards. Vol. 535. Wiley. Marshall, Ben R., Nguyen, Nhut H. and Visaltanachoti, Nuttawat, (2013), Time-Series Momentum versus Moving Average Trading Rules. Available at SSRN: http://ssrn.com/abstract=2225551 Standard and Poors, (2011), S&P 500 VIX Futures Indices Methodology available from www.standardandpoors.com 29 Electronic copy available at: https://ssrn.com/abstract=2255327 A. Technical Appendix – Dynamic Linear Models It is outside the scope of this paper to explain Dynamic Conditional Correlation (DCC) and Dynamic Linear Models and we refer readers to the references Engle (2009) and Campagnoli, Petrone & Petris (2009) for details and to the open source statistical software R (http://www.r-project.org) for implementation. A.1 Strategy 5 – Dynamic Hedging Since our four ETNs have different betas with respect to the VIX or S&P500 we can combine them to produce beta-neutral strategies i.e. portfolios with net beta zero. This may let us harvest the alpha with reduced volatility and may give us a greatly improved Sharpe Ratio. This strategy is called Roll Yield Arbitrage by some practitioners but we prefer to see it as hedging some of the volatility. For example, if we use weights 0.327 and 0.673 for XIV and VXZ then from the table above we get portfolio beta = 0.327*(-0.441) + 0.673*(0.214) = 0.000 portfolio alpha = 0.327*(97.5) + 0.673*(-19.1) = 19.0% So we still get some alpha whilst canceling out the beta. That’s why it is called arbitrage. We can go further than that, however. The above weighting is for the XIV VXZ pair. We can do the same for the VXX ZIV pair and use strategy 3 to switch between each pair. That way we get beta neutral versions of those two strategies. Alexander and Korovilas (2012a, 2012b) called these strategies CVIX and CVZ. Other variations are the UBS Daily Long-Short VIX ETN with ticker XVIX which is an ETN that follows a similar hedging strategy as does the iPath S&P500 Dynamic VIX ETN with ticker XVZ. We replicated CVIX, CVZ, XVIX, and XVZ using our four ETNs in our toolbox. Further, we created one more hedged strategy as follows: instead of assuming a fixed alpha and beta in the regression of XIV returns versus VIX returns we assumed that alpha and beta are time varying. We can estimate the alpha and beta values using a Dynamic Linear Model (DLM) (see, for example, Campagnoli, Petrone, & Petris 2009). The concept is similar to rolling regressions but avoids the lags that using a window length for those regressions produces. Once we had dynamic betas we created dynamic weights to create a beta-neutral pair XIV – VXZ and VXX – ZIV. Then we used the dynamic alphas to see which pair had the most positive alpha to switch between the pairs. It turns out that setting the net beta of the strategy to zero is far from optimal. By allowing the net beta to reach a limit outside of zero we can increase the returns and Sharpe Ratio of the strategy. So using the DLM alphas and betas we adopt the strategy: choose weights to maximize the net alpha subject to the constraint that -limit <= net beta <= limit 30 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 34,
    "chunk_index": 56,
    "word_count": 528,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "limit outside of zero we can increase the returns and Sharpe Ratio of the strategy. So using the DLM alphas and betas we adopt the strategy: choose weights to maximize the net alpha subject to the constraint that -limit <= net beta <= limit 30 Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 57,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "In Figure 18 this strategy produces the Sienna-colored curve as the limit is varied from 0 to 1. We chose the point on the curve with the highest Sharpe Ratio as our representative for Strategy 5 and call it BLVDLM. Figure 18 80 60 AAPL XIV 40 BLVDLM AMZN MIDD 20 CVZ PNRA XVZ AG G X VCIXVIX S&P500 ZIV 0 VXZ −20 −40 VXX −60 0 10 20 30 40 50 60 Risk (Annualized Daily Standard Deviation %) 31 % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for Beta Neutral Strategies 70 60 50 40 BLVDLM 30 20 CVZ XVZ 10 CVIX XVIX 0 5 10 15 20 25 30 35 40 45 50 55 Risk (Annualized Daily Standard Deviation %) % nruteR yliaD naeM dezilaunnA Mean−Variance Plot for Beta Neutral Strategies The performance of the strategies is: Name CAGR % Mean % STD % Sharpe MDD % S&P500 Ratio correlation XVZ 13.5 15.3 23.2 0.66 33.7 -0.69 XVIX 8.0 8.2 9.2 0.88 25.2 -0.06 CVZ 20.3 20.9 21.9 0.95 25.0 -0.55 CVIX 9.8 10.0 10.9 0.91 22.5 -0.41 BLVDLM 43.2 39.1 25.2 1.55 25.4 0.01 A.2 Dynamic Conditional Correlation We could work out the correlation between two variables over the last k days and use that as an estimate of the correlation for today. This is fine for correlations that are static but if the correlation is dynamic then there is a lag of k/2 days in the calculation. DCC removes this lag by using a linear model that posits a correlation for one day then models deltas in that value on a daily basis. This is similar to the methodology used in GARCH models for volatility and in fact DCC software can use GARCH fits in intermediate steps. So DCC models look like this: R =(1- a- b )+Rae e b +' R t t- 1 -t 1 - t 1 where R is a long run mean correlation,R is yesterday’s correlation, e e ' is an update from today’s t- 1 t- 1 -t 1 market returns, and the a and b are weights that we get from the fitted model. A.3 Dynamic Regression Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 34,
    "chunk_index": 58,
    "word_count": 362,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "1 where R is a long run mean correlation,R is yesterday’s correlation, e e ' is an update from today’s t- 1 t- 1 -t 1 market returns, and the a and b are weights that we get from the fitted model. A.3 Dynamic Regression Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 59,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Everyone is familiar with the static linear regression y =a +b x where the subscript t indicates that x t t and y values are collected over time. The a and b values are static values. In a dynamic regression the a and b values are allowed to change with time. So we get the model y =a +b x t t t t In a time series of several thousand values there are several thousand a and b values to fit. That is impossible and so we must assume that the a and b values from one day are similar to the a and b values for the next day. In other words we impose the constraint that the sequence of a and b are t t smooth sequences. For this paper we assumed that the sequences are random walks and so the fitting procedure seeks to fit the volatility of those random walks. That means only two parameters had to be fitted – the volatility of each sequence. Software that fits this model often uses the Kalman Filter. The results are shown in Figure 19 for the regression of the returns of XIV and ZIV against the returns of VIX. The beta comes from the exposure of XIV and ZIV through the futures term structure to the movement of the VIX and the alpha comes from the VRP. Figure 19 200 150 100 50 0 −50 −100 −150 −200 −250 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 32 .a.p % ahpla XIV and ZIV Dynamic Regression Alphas 0.2 Regime 1 Regime 2 3 Regime 4 Regime 5 0.1 0 −0.1 −0.2 −0.3 −0.4 −0.5 XIV −0.6 ZIV −0.7 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 ateb XIV and ZIV Dynamic Regression Betas Regime 1 Regime 2 3 Regime 4 Regime 5 XIV ZIV The alpha chart is the most interesting. It clearly shows the negative alphas of the GFC and the Euro crisis of 2011. It also shows the dramatic rise of ZIV alpha during regime 5. It appears that in 2013 the ZIV alpha has exceed that of XIV for the first time ever (considering positive alpha only). A.4 Volatility Drag We show here a chart of the VIX and XIV over a selected period in 2012 where both series ended up where they started. So VIX effects will be minor during this period and most of our return will come from alpha and not beta. Figure 20 shows that the roll yield was considerable during the period – averaging about 0.4% per day. Since the VIX went nowhere then all the roll yield was manifested as VRP and we collected it all. Yet Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 34,
    "chunk_index": 60,
    "word_count": 458,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "will come from alpha and not beta. Figure 20 shows that the roll yield was considerable during the period – averaging about 0.4% per day. Since the VIX went nowhere then all the roll yield was manifested as VRP and we collected it all. Yet Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 61,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "the return of XIV was zero over the period. All the roll yield was cancelled out by volatility drag. Let’s explain how. Figure 20 VIX (green) and XIV (orange) during 25 Mar 2012 to 15 Aug 2012 28 0.9 VIX 26 XIV 0.8 24 0.7 22 0.6 20 0.5 18 0.4 16 0.3 14 0.2 12 0.1 10 0 8 −0.1 01 Mar 01 Apr 01 May 01 Jun 01 Jul 01 Aug 01 Sep 01 Mar 01 Apr 01 May 01 Jun 01 Jul 01 Aug 01 Sep 33 yad rep % dleiY Expected Roll Yields for XIV during 25 Mar 2012 to 15 Aug 2012 Assume, for simplicity, that alphas and betas are static and so letting x be the daily return of the VIX and y the daily return of XIV we have the relationship y =a +b x where a is the VRP. Let us have a look t t at the returns of XIV for varying values of a and b for the period 25 March 2012 to 15 August 2012. Figure 21 shows increasing returns as increasing levels of red (“heat”). Figure 21 Beta % ahplA yliaD XIV compound returns as a function of Alpha and Beta 1000 0.04 800 0.03 600 0.02 400 0.01 200 0 0 −0.01 −200 −0.02 −400 −0.03 −600 −0.04 −800 −0.05 −1000 −2 −1.5 −1 −0.5 0 0.5 1 1.5 2 The magenta lines show the actual alpha (89.76%) and beta (-0.625) during the period. So we see that there actually was positive alpha during the period and the annualized rate was quite high. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 34,
    "chunk_index": 62,
    "word_count": 271,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "−800 −0.05 −1000 −2 −1.5 −1 −0.5 0 0.5 1 1.5 2 The magenta lines show the actual alpha (89.76%) and beta (-0.625) during the period. So we see that there actually was positive alpha during the period and the annualized rate was quite high. Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 63,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "Now the technical bit: the compound returns of XIV as a function of the alpha and beta are not a simple linear function. It is curved (approximately quadratic) which can be seen in the curved shape of the color transitions. High absolute values of beta have lower returns (i.e. bluer colors). This is the effect of volatility drag – the higher the leverage (beta) the more the drag11. Avellaneda & Zhang (2010) show that the shape is approximately quadratic because it is a function of b 2. The black curve shows the line of zero compound return. Because it curves upwards with increasing beta it shows that we need more alpha to get a positive return as beta increases. Unfortunately the black curve almost passes through our actual XIV alpha and beta values. So even though our alpha is positive our actual compounded return is close to zero. As Hamlet would say: Aye, there’s another rub. We can explain why XIV doesn’t surge inversely as VXX plummets. If m is the mean daily return of VXX and s its daily standard deviation then the compounded daily return of VXX is m - s1 2 and the 2 compounded daily return of the inverse XIV is - m- s1 2. In both cases the volatility drag - 1s 2 is 2 2 negative. The volatility drag is a function of the volatilitys squared which is why we get the quadratic s 2 shape above. (Note that XIV and VXX have the same ). A.5 Maximum Drawdown Lies Finally, just for fun we illustrate the equity curve for a buy and hold position in XIV as measured every four years. 14 12 10 8 6 4 2 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 34 ecirP XIV from 30 March 2004 to 30 March 2012 Drawdown? What drawdown? 11 This also occurs in leveraged ETFs which do not perform as one might expect – see Avellaneda & Zhang (2010) Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 34,
    "chunk_index": 64,
    "word_count": 335,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  },
  {
    "text": "2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 34 ecirP XIV from 30 March 2004 to 30 March 2012 Drawdown? What drawdown? 11 This also occurs in leveraged ETFs which do not perform as one might expect – see Avellaneda & Zhang (2010) Electronic copy available at: https://ssrn.com/abstract=2255327",
    "title": "Easy Volatility Investing - SSRN version",
    "source_type": "pdf",
    "document_id": "4c7ea06b99df",
    "source_file": "Easy Volatility Investing_Cooper 2013.pdf",
    "section": "10.2 Timing Synchronisation Risk (TSR)",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 34,
    "chunk_index": 65,
    "word_count": 50,
    "author": "Tony Cooper",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "10.2 Timing Synchronisation Risk (TSR) (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20130423192628+12'00'",
    "duration": null
  }
]