[
  {
    "text": "Economic Forces and the Stock Market Author(s): Nai-Fu Chen, Richard Roll and Stephen A. Ross Reviewed work(s): Source: The Journal of Business, Vol. 59, No. 3 (Jul., 1986), pp. 383-403 Published by: The University of Chicago Press Stable URL: http://www.jstor.org/stable/2352710 . Accessed: 04/12/2012 03:43 Your use of the JSTOR archive indicates your acceptance of the Terms & Conditions of Use, available at . http://www.jstor.org/page/info/about/policies/terms.jsp . JSTOR is a not-for-profit service that helps scholars, researchers, and students discover, use, and build upon a wide range of content in a trusted digital archive. We use information technology and tools to increase productivity and facilitate new forms of scholarship. For more information about JSTOR, please contact support@jstor.org. . The University of Chicago Press is collaborating with JSTOR to digitize, preserve and extend access to The Journal of Business. http://www.jstor.org This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 22,
    "chunk_index": 0,
    "word_count": 160,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "JSTOR, please contact support@jstor.org. . The University of Chicago Press is collaborating with JSTOR to digitize, preserve and extend access to The Journal of Business. http://www.jstor.org This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions Nai-Fu Chen University of Chicago Richard Roll University of California, Los Angeles Stephen A. Ross Yale University Economic Forces and the Stock Market* I. Introduction This paper tests whether innovationsi n Asset prices are commonlyb elieved to react sen- macroeconomic vari- sitively to economic news. Daily experience ables are risks that are seems to support the view that individuala sset rewardedi n the stock market. Financial prices are influenced by a wide variety of theory suggests that unanticipatede vents and that some events have the following macro- a more pervasive effect on asset prices than do economic variables others. Consistentw ith the ability of investors to should systematically diversify, modern financial theory has focused affect stock market returns:t he spread on pervasive, or \"systematic,\" influencesa s the between long and short likely source of investment risk.' The general interest rates, expected conclusion of theory is that an additionalc ompo- and unexpected infla- nent of long-runr eturn is requireda nd obtained tion, industrialp roduc- whenever a particulara sset is influencedb y sys- tion, and the spread between high- and low- tematic economic news and that no extra reward grade bonds. We find can be earned by (needlessly) bearing diversifi- that these sources of able risk. rsk are significantly priced. Furthermore, * The authorsa re gratefult o their respective universities, neither the market to the Centerf or Researchi n SecurityP rices, to the National portfolio nor aggregate Science Foundationf or researchs upport,a nd to CeajerC han consumptiona re priced for computationala ssistance. The comments of Bradford Cornell,E ugeneF ama, PierreH illion, RichardS weeney, and separately.W e also ArthurW argaw ere most helpful, as were the comments of find that oil price risk participantsi n workshops at ClaremontG raduateS chool, is not separatelyr e- StanfordU niversity, the University of Toronto, the Univer- wardedi n the stock sity of California,I rvine, the Universityo f Alberta,t he Uni- market. versity of Chicago,a nd unknownr eferees. The Universityo f British Columbiap rovided a stimulatingr esearch environ- ment where part of the first revision was writtend uringA u- gust 1984. 1. For example, the APT (Ross 1976)a nd the models of Merton( 1973)a nd Cox, Ingersoll,a nd Ross (1985)a re consis- tent with this view. (Journal of Business, 1986,v ol. 59, no. 3) ? 1986b y The Universityo f Chicago.A ll rightsr eserved. 0021-9398/8615903-0001$01.50 383 This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 22,
    "chunk_index": 1,
    "word_count": 462,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "re consis- tent with this view. (Journal of Business, 1986,v ol. 59, no. 3) ? 1986b y The Universityo f Chicago.A ll rightsr eserved. 0021-9398/8615903-0001$01.50 383 This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 22,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "384 Journal of Business The theory has been silent, however, about which events are likely to influence all assets. A rather embarrassingg ap exists between the theoreticallye xclusive importanceo f systematic \"state variables\"a nd our complete ignorance of their identity. The comovements of asset prices suggest the presence of underlyinge xogenous influences,b ut we have not yet determinedw hich economic variables, if any, are respon- sible. Our paper is an explorationo f this identificationt errain. In Section II, we employ a simple theoretical guide to help choose likely candi- dates for pervasive state variables. In Section III we introducet he data and explain the techniques used to measure unanticipatedm ovements in the proposed state variables. Section IV investigates whether expo- sure to systematic state variables explains expected returns. As specific alternatives to the pricing influence of the state variables identified by our simple theoretical model, Section IV considers the value- and the equally weighted market indices, an index of real con- sumption, and an index of oil prices. Each of these is found to be unimportantf or pricing when compared with the identifiede conomic state variables. Section V brieflys ummarizeso ur findingsa nd suggests some directions for future research. II. Theory No satisfactoryt heory would argue that the relationb etween financial marketsa nd the macroeconomyi s entirely in one direction. However, stock prices are usually considered as responding to external forces (even though they may have a feedback on the other variables). It is apparentt hat all economic variables are endogenous in some ultimate sense. Only naturalf orces, such as supernovas, earthquakes,a nd the like, are truly exogenous to the world economy, but to base an asset- pricing model on these systematic physical factors is well beyond our currenta bilities. Our present goal is merely to model equity returnsa s functions of macro variables and nonequity asset returns. Hence this paper will take the stock marketa s endogenous, relative to other mar- kets. By the diversification argument that is implicit in capital market theory, only general economic state variablesw ill influencet he pricing of large stock market aggregates.A ny systematic variables that affect the economy's pricing operatoro r that influenced ividends would also influence stock market returns. Additionally, any variables that are necessary to complete the descriptiono f the state of naturew ill also be part of the description of the systematic risk factors. An example of such a variable would be one that has no direct influence on current cash flows but that does describe the changingi nvestmento pportunity set. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 22,
    "chunk_index": 3,
    "word_count": 445,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "example of such a variable would be one that has no direct influence on current cash flows but that does describe the changingi nvestmento pportunity set. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 22,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 385 Stock prices can be written as expected discounted dividends: - E(c) where c is the dividend stream and k is the discount rate. This implies that actual returns in any period are given by dp + c d[E(c)] A + c (2) p p E(c) k P It follows (trivially)t hat the systematicf orces that influencer eturnsa re those that change discount factors, k, and expected cash flows, E(c).2 The discount rate is an average of rates over time, and it changes with both the level of rates and the term-structures preads across dif- ferent maturities. Unanticipated changes in the riskless interest rate will thereforei nfluencep ricing,a nd, throught heiri nfluenceo n the time value of future cash flows, they will influence returns. The discount rate also depends on the risk premium;h ence, unanticipatedc hanges in the premiumw ill influencer eturns. On the demands ide, changes in the indirect marginalu tility of real wealth, perhaps as measured by real consumption changes, will influence pricing, and such effects should also show up as unanticipatedc hanges in risk premia. Expected cash flows change because of both real and nominal forces. Changesi n the expected rate of inflationw ould influencen omi- nal expected cash flows as well as the nominalr ate of interest. To the extent that pricing is done in real terms, unanticipatedp rice-level changes will have a systematic effect, and to the extent that relative prices change along with generali nflation,t here can also be a change in asset valuation associated with changes in the average inflationr ate. Finally, changes in the expected level of real productionw ould affect the currentr eal value of cash flows. Insofar as the risk-premiumm ea- sure does not capturei ndustrialp roductionu ncertainty,i nnovationsi n the rate of productive activity should have an influence on stock re- turns throught heir impact on cash flows. III. Constructingt he EconomicF actors Having proposed a set of relevant variables,w e must now specify their measurementa nd obtain time series of unanticipatedm ovements. We could proceed by identifying and estimating a vector autoregressive model in an attempt to use its residuals as the unanticipatedi nnova- 2. Since we are only concernedw ith intuition,w e are ignoringt he second-ordert erms from the stochastic calculus in derivinge q. (2). Also notice that the expectationi s taken with respect to the martingalep ricingm easure( see Cox et al. 1985)a nd not with respect to the ordinaryp robabilityd istribution. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 22,
    "chunk_index": 5,
    "word_count": 436,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "that the expectationi s taken with respect to the martingalep ricingm easure( see Cox et al. 1985)a nd not with respect to the ordinaryp robabilityd istribution. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 22,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "386 Journal of Business tions in the economic factors. It is, however, more interesting and (perhaps)r obust out of sample to employ theory to find single equa- tions that can be estimated directly. In particular,s ince monthlyr ates of return are nearly serially uncorrelated, they can be employed as innovations without alteration. The general impact of a failure ade- quately to filter out the expected movement in an independentv ariable is to introducea n errors-in-variableps roblem.T his has to be tradedo ff against the errori ntroducedb y misspecificationo f the estimatede qua- tion for determiningt he expected movement. A somewhat subtler version of the same problema rises with proce- dures such as vector autoregression.A ny such statisticallyb ased time- series approachw ill find lagged stock marketr eturnsh aving a signifi- cant predictivec ontent for macroeconomicv ariables.I n the analysis of pricing, then, we will indirectlyb e using lagged stock marketv ariables to explain the expected returns on portfolios of stocks. Whatever econometrica dvantagess uch an approachm ighto ffer, it is antithetical to the spirit of this investigation, which is to explore the pricing in- fluence of exogenous macroeconomic variables. For this reason, as much as for any other, we have chosen to follow the simplerr oute in constructingt he time series we use.3 Throughoutt his paper we adopt the convention that time subscripts apply to the end of the time period. The standardp eriod is 1 month. Thus, E( It - 1) denotes the expectation operatora t the end of month t - 1 conditionalo n the informations et availablea t the end of month t - 1, and X(t) denotes the value of variableX in month t, or the growth that prevailed from the end of t - 1 to the end of t. A. Industrial Production The basic series is the growth rate in U.S. industrialp roduction.I t was obtainedf rom the Survey of CurrentB usiness. If IP(t) denotes the rate of industrialp roductioni n month t, then the monthly growth rate is MPMt) = loge IPMt) - loge IP(t - 1), (3) and the yearly growth rate is YP(t) = loge IP(t) - loge IP(t - 12) (4) (see table 1 for a summaryo f variables). Because IP(t) actually is the flow of industrialp roduction during month t, MP(t) measures the change in industrialp roductionl agged by at least a partial month. To make this variablec ontemporaneousw ith other series, subsequents tatisticalw ork will lead it by 1 month. Except for an annual seasonal, it is noisy enough to be treated as an in- novation. 3. In addition, the pricing tests reported below used portfolios that have induced autocorrelationsin their returnsa risingf rom the nontradinge ffect. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 22,
    "chunk_index": 7,
    "word_count": 473,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "treated as an in- novation. 3. In addition, the pricing tests reported below used portfolios that have induced autocorrelationsin their returnsa risingf rom the nontradinge ffect. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 22,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 387 TABLE 1 Glossary and Definitions of Variables Symbol Variable Definitiono r Source Basic Series I Inflation Log relativeo f U.S. Consumer Price Index TB Treasury-bilrl ate End-of-periodr eturno n 1-month bills LGB Long-termg overnmentb onds Returno n long-termg overnment bonds (1958-78: Ibbotsona nd Sinquefield[ 1982];1 979-83: CRSP) IP Industrialp roduction Industrialp roductiond uring month (Survey of Current Busi- ness) Baa Low-gradeb onds Returno n bonds rated Baa and under( 1953-77: Ibbotson [1979],c onstructedf or 1978- 83) EWNY Equallyw eighted equities Returno n equally weightedp ort- folio of NYSE-listed stocks (CRSP) VWNY Value-weightede quities Returno n a value-weightedp ort- folio of NYSE-listed stocks (CRSP) CG Consumption Growthr ate in real per capita consumption( Hansena nd Sin- gleton [1982]; Survey of Cur- rent Business) OG Oil prices Log relative of ProducerP rice Index/CrudeP etroleums eries (Bureauo f Labor Statistics) Derived Series MP(t) Monthlyg rowth, industrial loge[IP(t)/IP(t- 1)] production YP(t) Annualg rowth, industrialp ro- loge[IP(t)/IP(t- 12)] duction E[I(t)] Expected inflation Fama and Gibbons( 1984) UI(t) Unexpected inflation I(t) - E[I(t)lt - 1] RHO(t) Real interest (ex post) TB(t - 1) - I(t) DEI(t) Changei n expected inflation E[I(t + 1)It] - E[I(t)It - 1] URP(t) Risk premium Baa(t) - LGB(t) UTS(t) Term structure LGB(t) - TB(t - 1) The monthly series of yearly growth rates, YP(t), was examined because the equity marketi s related to changes in industriala ctivity in the long run. Since stock marketp rices involve the valuationo f cash flows over long periods in the future, monthlys tock returnsm ay not be highly related to contemporaneousm onthly changes in rates of indus- trial production,a lthoughs uch changes might capturet he information pertinent for pricing. This month's change in stock prices probably reflects changes in industrialp roductiona nticipatedm any months into This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 22,
    "chunk_index": 9,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "lthoughs uch changes might capturet he information pertinent for pricing. This month's change in stock prices probably reflects changes in industrialp roductiona nticipatedm any months into This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 22,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "388 Journal of Business the future. Therefore, subsequent statistical work will lead this vari- able by 1 year, similar to the variable used in Fama (1981). Because of the overlap in the series, YP(t) is highly autocorrelated. A procedurew as developed for forecastinge xpected YP(t) and a series of unanticipatedc hanges in YP(t), and changes in the expectationi tself were examined for their influence on pricing. The resulting series of- fered no discerniblea dvantageo ver the raw productions eries, and, as a consequence, they have been droppedf rom the analysis.4 B. Inflation Unanticipatedi nflationi s defined as {JI(t) = I(t) -E[I(t)lt - 1], (5) where I(t) is the realizedm onthlyf irstd ifferencei n the logarithmo f the Consumer Price Index for period t. The series of expected inflation, E[I(t)lt - 1] for the period 1953-78, is obtainedf rom Fama and Gib- bons (1984). If RHO(t) denotes the ex post real rate of interest applica- ble in period t and TB(t - 1) denotes the Treasury-billr ate known at the end of period t - 1 and applyingt o period t, then Fisher's equation asserts that TB(t - 1) = E[RHO(t)lt - 1] + E[I(t)lt - 1]. (6) Hence, TB(t - 1) - I(t) measures the ex post real return on Treasury bills in the period. From a time-series analysis of this variable, Fama and Gibbons( 1984)c onstructeda time series for E[RHO(t)lt - 1]. Our expected inflation variable is defined by subtractingt heir time series for the expected real rate from the TB(t - 1) series. Another inflationv ariable that is unanticipateda nd that might have an influence separablef rom UI is DEI(t) = E[I(t + 1)It] - E[I(t)lt - 1], (7) the change in expected inflation.W e subscriptt his variablew ith t since it is (in principle)u nknown at the end of month t - 1. While, strictly speaking, DEI(t) need not have mean zero, under the additionala s- sumptiont hat expected inflationf ollows a martingalet his variablem ay be treateda s an innovation, and it may contain informationn ot present in the U1 variable. This would occur whenever inflationf orecasts are influenced by economic factors other than past forecasting errors. (Notice that the UI series and the DEI series will contain the informa- tion in a series of innovations in the nominali nterest rate, TB.)5 4. Results that includet hese series are availablei n an earlierd rafto f the paper,w hich is availablef rom the authorso n request. 5. As an aside, the resultingu nanticipatedin flationv ariable,U I(t), is perfectlyn ega- tively correlatedw ith the unanticipatedc hange in the real rate. This follows from the observationt hat the Fisher equation( 6) holds for realizedr ates as well as for expecta- tions. The UI(t) series also has a simplec orrelationo f .98 with the unanticipatedin flation series in Fama (1981). This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 22,
    "chunk_index": 11,
    "word_count": 494,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "realizedr ates as well as for expecta- tions. The UI(t) series also has a simplec orrelationo f .98 with the unanticipatedin flation series in Fama (1981). This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 22,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 389 C. Risk Premia To capture the effect on returns of unanticipatedc hanges in risk pre- mia, we will employ another variabled rawnf rom the money markets. The variable, UPR, is defined as UPR(t) = \"Baa and under\" bond portfolio return (t) - LGB(t), (8) where LGB(t) is the return on a portfolio of long-term government bonds obtained from Ibbotson and Sinquefield (1982) for the period 1953-78. From 1979t hrough 1983, LGB(t) was obtainedf rom the Cen- ter for Research in Securities Prices (CRSP) data file. Again, UPR is not formallya n innovation, but, as the differencesi n two returns eries, it is sufficientlyu ncorrelatedt hat we can treat it as unanticipated,a nd we will use it as a member of the set of economic factors. The low-grade bond return series is for nonconvertible corporate bonds, and it was obtainedf rom R. G. Ibbotson and Companyf or the period prior to 1977. A detailed descriptiono f the sample is contained in Ibbotson (1979).T he low-grades eries was extended through1 983b y choosing 10 bonds whose ratingso n January1 966w ere below Baa. By 1978 these bonds still were rated below Baa, but their maturityw as shorter than that of the long-termg overnment bond series. These 10 bonds were then combined with three that were left over from the Ibbotson series at the end of 1978 to create a low-gradeb ond portfolio of 13 bonds in all. The returns on this portfolio were then used to extend the UPR series beyond 1977 and through 1983. Two further difficultiesw ith the series are that the ratingsh ave experiencedc onsid- erable inflations ince the mid-1950sa nd that the low-grades eries con- tains bonds that are unrated. The UPR variablew ould have mean zero in a risk-neutrawl orld, and it is natural to think of it as a direct measure of the degree of risk aversion impliciti n pricing( at least insofara s the ratinga gencies main- tain constant standardsf or their classifications). We hoped that UPR would reflect much of the unanticipatedm ovementi n the degree of risk aversion and in the level of risk implicit in the market's pricing of stocks.6 D. The Term Structure To capturet he influenceo f the shape of the term structure,w e employ another interest rate variable, UTS(t) = LGB(t) - TB(t - 1). (9) 6. It could be arguedt hat UPR capturesa leverage effect, with highly levered firms being associated with lower ratings. Furthermore,U PR is also similart o a measureo f equity returnss ince a substantialp ortiono f the value of low-gradeb onds comes fromt he same sort of call option (behinds ecured debt) as for ordinarys tock. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 22,
    "chunk_index": 13,
    "word_count": 473,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "returnss ince a substantialp ortiono f the value of low-gradeb onds comes fromt he same sort of call option (behinds ecured debt) as for ordinarys tock. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 22,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "390 Journal of Business Again, under the appropriatef orm of risk neutrality, E[UTS(t)lt - 1] = 0, (10) and this variable can be thought of as measuring the unanticipated returno n long bonds. The assumptiono f risk neutralityi s used only to isolate the pure term-structuree ffects; the variable UPR is used to capture the effect of changes in risk aversion. E. Market Indices The majort hrust of our effort is to examine the relation between non- equity economic variablesa nd stock returns. However, because of the smoothinga nd averagingc haracteristicso f most macroeconomict ime series, in short holding periods, such as a single month, these series cannot be expected to capture all the informationa vailablet o the mar- ket in the same period. Stock prices, on the other hand, respond very quickly to public information.T he effect of this is to guaranteet hat marketr eturnsw ill be, at best, weakly related and very noisy relative to innovations in macroeconomicf actors. This should bias our results in favor of finding a stronger linkage between the time-series returnso n marketi ndices and other portfolios of stock returnst han between these portfolio returns and innovations in the macro variables. To examine the relative pricingi nfluenceo f the traditionalm arket indices we used the following variables: EWNY(t) = return on the equally weighted NYSE index; VWNY(t) = return on the value-weightedN YSE index. These variabless hould reflect both the real informationi n the indus- trial production series and the nominal influence of the inflationv ari- ables. F. Consumption In additiont o the macro variablesd iscussed above, we also examineda time series of percentagec hanges in real consumption,C G. The series is in real per capita terms and includes service flows. It was con- structed by dividing the CITIBASE series of seasonally adjustedr eal consumption( excludingd urables)b y the Bureau of Census's monthly population estimates. The CG series extends from January 1959 to December 1983, and it is an extension of a series obtainedf rom Lars Hansen for the period through 1979. A detailed descriptiono f its con- struction can be found in Hansen and Singleton (1983). G. Oil Prices It is often argued that oil prices must be included in any list of the systematic factors that influence stock marketr eturnsa nd pricing. To test this proposition and to examine another alternativet o the macro variables discussed above, we formed the OG series of realized This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 22,
    "chunk_index": 15,
    "word_count": 426,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "marketr eturnsa nd pricing. To test this proposition and to examine another alternativet o the macro variables discussed above, we formed the OG series of realized This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 22,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 391 monthly first differences in the logarithmo f the ProducerP rice Index/ CrudeP etroleums eries (obtainedf rom the Bureauo f Labor Statistics, U.S. Departmento f Labor, DRI series no. 3884). The glossary in table 1 summarizest he variables. H. Statistical Characteristics of the Macro Variables Table 2 displays the correlation matrix for the state variables. The correlationm atrices of table 2 are computed for several differentp e- TABLE 2 Correlation Matrices for Economic Variables Symbol EWNY VWNY MP DEI UT UPR UTS A. January 1953-November 1983 VWNY .916 MP .103 .020 DEI -.163 -.119 .063 UT -.163 -.112 -.067 .378 UPR .105 .042 .216 .266 .018 UTS .227 .248 - .159 -.394 - .103 - .752 YP .270 .270 .139 - .003 - .005 .113 .099 B. January 1953-December 1972 VWNY .930 MP .147 .081 DEI -.130 -.122 .020 UT -.081 -.021 -.203 .388 UPR .265 .214 .213 .068 - .072 UTS .110 .108 -.059 -.210 -.041 -.688 YP .260 .238 .128 - .013 -.032 .128 .063 C. January 1973-December 1977 VWNY .883 MP .022 -.118 DEI -.314 -.263 .004 UT -.377 -.352 -.004 .505 UPR .341 .231 .227 .032 -.289 UTS .217 .313 - .350 -.280 .026 -.554 YP .335 .361 .107 - .124 - .334 .221 .174 D. January 1978-November 1983 VWNY .937 MP .092 -.010 DEI - .143 -.073 .169 UT -.055 -.024 .168 .375 UPR - .275 - .319 .248 .458 .259 UTS .424 .431 - .277 - .512 - .239 - .890 YP .269 .261 .193 .053 .247 .018 .115 NOTE.-VWNY = returno n the value-weightedN YSE index; EWNY = returno n the equally weighted NYSE index; MP = monthly growth rate in-i ndustrialp roduction;D EI = change in expected inflation;U I = unanticipatedin flation;U PR = unanticipatedc hangei n the risk premium (Baa and underr eturn - long-termg overnmentb ond return);U TS = unanticipatedc hange in the term structure( long-termg overnmentb ond return - Treasury-bilrl ate); and YP = yearly growth rate in industrialp roduction. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 22,
    "chunk_index": 17,
    "word_count": 361,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "ond return);U TS = unanticipatedc hange in the term structure( long-termg overnmentb ond return - Treasury-bilrl ate); and YP = yearly growth rate in industrialp roduction. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions 392 Journal of Business e g? ?N t NomMmxm mt C) O CC W) '\" t I \\ N M t A 0 e= 0 n 0Okbmf \\N ) o ' m IC W .= 'I (7 NI C) Nt l oo o ^ QCk rA 7N en 00 'I en 'I C) emn . Ill . . . . . . . 04 1.1= <o o oN- = W? . . CZ I I o ooNo Nt oor oo 08~~~ . . . . . . . . . . ...C...=. Q 2~~~~~~~~~~04 n~~~~0 O m 00 bo , t -\" 00 nc Z~~~~. . ... ... . . . . . . . a E o b, t^xm o ~ ;Y~~~ Qt ~ W O0 OI O ON ON Oz OU, Y~~~~'C(- I \" CNW o- .=p C >~Q~~~~~ r 00 M AN O N ^Wt ) N .? 3 . . 0 00 0.0 . . . .: ~~~~~t ._ 00t Nt 00 ( o== ~ ~~~~~ X O =o >o = = Wo ~~.. . . . . . . . . - -E4s e~~~M M Nt 'I 0\\ N M CN ;2 o~~~ . . . . . . . . .. ...o..t..o CL - ooNtot?.d> g Q~~~~r NT NT tt--D D O M v Xo This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 22,
    "chunk_index": 18,
    "word_count": 295,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "CN ;2 o~~~ . . . . . . . . .. ...o..t..o CL - ooNtot?.d> g Q~~~~r NT NT tt--D D O M v Xo This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 22,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 393 riods; part A covers the entire 371-months ample period from January 1953 through November 1983, and the remainingp arts cover three subperiods,w ith breaks at December 1977a nd January1 973. We have broken the sample at this time because it is often argued that the oil price jump in 1973 presaged a structurals hift in the macro variables. (The work of Litterman and Weiss [1983] supports this view, but, although we have performed no formal tests, the correlation matrix does not appear to differ markedlya cross the subperiods.) With the exception of the market indices, the strongest correlation is between UPR and UTS. This is to be expected since they both use the long-termb ond series, LGB(t). The resultingc ollinearityt ends to weaken the individuali mpact of these variables. Substitutinga n Aaa corporate bond series for treasuries in the definition of UPR did, in fact, improve the significanceo f both UPR and UTS, but the improve- ment was not sufficientlyi mportantt o make a qualitatived ifferencei n our findings. The production series, YP and MP, are correlatedw ith each other and with each of the other variablese xcept DE1 and UI, which are also stronglyc orrelated.T hese latter two series are correlatedb ecause they both contain the EI(t) series, and the negative correlation between DE1 and UTS occurs for a similarr eason. A numbero f other correla- tions are not negligible, but the variables are far from perfectly cor- related, and no one variable can be substitutedf or any other. Table 3 displays the autocorrelationsf or the state variables com- puted over the entire sample period, January 1953-November 1983. There are no surprisesh ere; as expected, YP is highly autocorrelated. The variables generally display mild autocorrelations, and many of them have seasonals at the 12-monthl ag. The MP series, in particular, has a peak in its lag at 12 months (repeateda t 24 months), warningt hat this variablei s highly seasonal. As noted above, the autocorrelationi n the state variablesi mplies the existence of an errors-in-variableps rob- lem that will bias estimates of the loadingso f the stock returnso n these variables and will bias downwarde stimates of statistical significance. IV. The Economic State Variables and Asset Pricing A. Basic Results Using the state variables7d efined above implies that individuals tock returnsf ollow a factor model of the form 7. We did the followinge xperimentt o findo ut if asset prices do, in fact, react to news associated with our proposed economic state variables. We first extracted the most importants tock factors (common covariations)d uring the period 1953-72, using the Chen (1983) algorithm. Five factors were chosen on the basis of previous empirical studies (see Roll and Ross 1980;B rowna nd Weinstein1 983).T he factorsc an be thought of as portfoliosc onstructedt o capturet he commonm ovementsi n stock marketr eturns. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 22,
    "chunk_index": 20,
    "word_count": 502,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Roll and Ross 1980;B rowna nd Weinstein1 983).T he factorsc an be thought of as portfoliosc onstructedt o capturet he commonm ovementsi n stock marketr eturns. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 22,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "394 Journal of Business R = a + bMpMP + bDEIDEI + bu1UI (12) + bUPRUPR + bUTSUTS + e, where the betas are the loadingso n the state variables,a is the constant term, and e is an idiosyncratic error term. To ascertain whether the identifiede conomic state variablesa re relatedt o the underlyingf actors that explain pricing in the stock market, a version of the Fama- MacBeth (1973) technique was employed. The procedure was as fol- lows. (a) A sample of assets was chosen. (b) The assets' exposure to the economic state variablesw as estimated by regressingt heir returns on the unanticipated changes in the economic variables over some estimation period (we used the previous 5 years). (c) The resulting estimates of exposure (betas) were used as the independentv ariablesi n 12 cross-sectional regressions, one regression for each of the next 12 months, with asset returnsf or the month being the dependentv ariable. Each coefficientf rom a cross-sectionalr egressionp rovides an estimate of the sum of the risk premium,i f any, associated with the state vari- able and the unanticipated movement in the state variable for that month. (d) Steps b and c were then repeated for each year in the sample, yielding for each macro variable a time series of estimates of its associated risk premium.T he time-series means of these estimates were then tested by a t-test for significantd ifference from zero. To control the errors-in-variableps roblemt hat arises from the use at step c of the beta estimates obtainedi n step b and to reduce the noise in individuala sset returns,t he securitiesw ere groupedi nto portfolios.A n effort was made to construct the portfolios so as to spread their ex- pected returnso ver a wide rangei n an effort to improvet he discrimina- tory power of the cross-sectional regression tests. To accomplish this spreadingw e formed portfolios on the basis of firm size. Firm size is known to be stronglyr elated to averager eturn( see Banz 1981),a nd we hoped that it would provide the desired dispersionw ithout biasing the tests of the economic variables. (It has been facetiously noted that size may be the best theory we now have of expected returns. Unfortu- nately, this is less of a theory than an empiricalo bservation.)8 The time series of those five factors were then each regressedo n the state variables.A n economic variable is significantly related to stock movements if and only if it is significantlyr elatedt o at least one of the five commons tock factors. The nullh ypothesis for each variable is the restriction across the equations that the five regression coefficientsf or that variable( one to each of the factor regressions)a rej ointly zero. The null hypothesis was rejectedf or the productiong rowth, the term structure,a nd the risk premiumv ariables.T he supportf or the inflationv ariables,h owever, was weak. Whena marketi ndex was included in the list of state variables, the significanceo f the other variables remained unchanged, except for the production variable, which became insignificantlyr elated to the time series of the factors. 8. A numbero f alternativee xperimentsw ere run in which securities were grouped into portfoliosa ccordingt o (a) their betas on a marketi ndex, (b) the standardd eviation of their returnsi n a market-moderl egression( i.e., their residualv ariability),a nd (c) the This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 22,
    "chunk_index": 22,
    "word_count": 579,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "o (a) their betas on a marketi ndex, (b) the standardd eviation of their returnsi n a market-moderl egression( i.e., their residualv ariability),a nd (c) the This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 22,
    "chunk_index": 23,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 395 Table 4 reports the results of these tests on 20 equally weighted portfolios, grouped accordingt o the total marketv alues of their con- stituent securities at the beginning of each test period. Each part of table 4 is brokeni nto four subperiodsb eginningw ith January1 958,t he first month preceded by the requisite 60 months of data used to esti- mate exposures. Part A of table 4 examines the state variables, YP, MP, DEI, UI, UPR, and UTS. Over the entire sample period MP, UI, and UPR are significant, while UTS is marginallys o. The inflation- related variables, DEI and UI, were highly significanti n the 1968-77 period and insignificantb oth earlier and later. The yearly production series, YP, was not significanti n any subperiod, and, as can be seen from partB , deletingi t had no substantivee ffect on the remainings tate variables.A lthought he coefficients have the same signs as in the over- all period, they are generally smaller in absolute magnitudea nd less significanti n the last subperiod, 1978-84.9 While we have not developed a theoreticalf oundationf or the signs of the state variables, it is worth noting that their signs are, at least, plausible.T he positive sign on MP reflects the value of insuringa gainst real systematic production risks. Similarly, UPR has a positive risk premiums ince individualsw ould want to hedge against unanticipated increases in the aggregater isk premiumo ccasioned by an increase in uncertainty.S ince changes in inflationh ave the generale ffect of shift- ing wealth amongi nvestors, there is no stronga priorip resumptiont hat would sign the risk premiaf or UI or DEI, but the negative signs on the premiaf or these variablesp robablym ean that stock marketa ssets are generallyp erceived to be hedges againstt he adverse influenceo n other assets that are, presumably, relatively more fixed in nominal terms. As for UTS, the negative risk premiumi ndicates that stocks whose returnsa re inversely related to increases in long rates oyer short rates are, ceteris paribus, more valuable. One interpretationo f this result is that UTS measures a change in the long-term real rate of interest (remembert hat inflation effects are included in the other variables). After long-termr eal rates decrease, there is subsequentlya lower real return on any form of capital. Investors who want protection against this possibility will place a relatively higher value on assets whose price increases when long-termr eal rates decline, and such assets will carry a negative risk premium. Thus, stocks whose returns are cor- level of the stock price. These effortsw ere not successful. The firstt wo of these grouping techniques failed completely to spread portfolio returnso ut of sample and had to be discarded.G roupingb y the level of the stock price did spreadr eturns,a lthoughn ot as well as did size, but the state variablesw ere then individuallyo nly marginallys ignificant, and the marketi ndices were of no significance.T he sensitivityo f the resultst o different groupingt echniquesi s an importanta rea for research. 9. This subperiodh ad only aboutt wo-thirdsa s manyo bservationsa s did the firstt wo subperiods. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 22,
    "chunk_index": 24,
    "word_count": 547,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "o different groupingt echniquesi s an importanta rea for research. 9. This subperiodh ad only aboutt wo-thirdsa s manyo bservationsa s did the firstt wo subperiods. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 22,
    "chunk_index": 25,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "396 Journal of Business TABLE 4 Economic Variables and Pricing (Percent per Month x 10), Multivariate Approach A Years YP MP DEI UI UPR UTS Constant 1958-84 4.341 13.984 -.111 -.672 7.941 -5.87 4.112 (.538) (3.727) (-1.499) (-2.052) (2.807) (-1.844) (1.334) 1958-67 .417 15.760 .014 - .133 5.584 .535 4.868 (.032) (2.270) (.191) (- .259) (1.923) (.240) (1.156) 1968-77 1.819 15.645 -.264 - 1.420 14.352 - 14.329 -2.544 (.145) (2.504) (-3.397) (-3.470) (3.161) (-2.672) (- .464) 1978-84 13.549 8.937 - .070 - .373 2.150 -2.941 12.541 (.774) (1.602) ( - .289) (- .442) (.279) (- .327) (1.911) B MP DEI UI UPR UTS Constant 1958-84 13.589 - .125 - .629 7.205 - 5.211 4.124 (3.561) (-1.640) (- 1.979) (2.590) (-1.690) (1.361) 1958-67 13.155 .006 - .191 5.560 - .008 4.989 (1.897) (.092) (-.382) (1.935) (-.004) (1.271) 1968-77 16.966 -.245 - 1.353 12.717 -13.142 - 1.889 (2.638) (-3.215) (-3.320) (2.852) (-2.554) (- .334) 1978-84 9.383 -.140 -.221 1.679 - 1.312 11.477 (1.588) (- .552) (- .274) (.221) (- .149) (1.747) C EWNY MP DEI UL UPR UTS Constant 1958-84 5.021 14.009 - .128 - .848 8.130 -5.017 6.409 (1.218) (3.774) (- 1.666) (-2.541) (2.855) (-1.576) (1.848) 1958-67 6.575 14.936 - .005 - .279 5.747 - .146 7.349 (1.199) (2.336) (- .060) (- .558) (2.070) (- .067) (1.591) 1968-77 2.334 17.593 -.248 - 1.501 12.512 -9.904 3.542 (.283) (2.715) (-3.039) (-3.366) (2.758) (-2.015) (.558) 1978-84 6.638 7.563 - .132 - .729 5.273 - 4.993 9.164 (.906) (1.253) (-.529) (-.847) (.663) (-.520) (1.245) D VWNY MP DEI UL UPR UTS Constant 1958-84 -2.403 11.756 -.123 -.795 8.274 -5.905 10.713 (-.633) (3.054) (- 1.600) (-2.376) (2.972) (-1.879) (2.755) 1958-67 1.359 12.394 .005 -.209 5.204 -.086 9.527 (.277) (1.789) (.064) (-.415) (1.815) (-.040) (1.984) 1968-77 -5.269 13.466 -.255 -1.421 12.897 -11.708 8.582 (- .717) (2.038) (- 3.237) (-3.106) (2.955) (- 2.299) (1.167) 1978-84 - 3.683 8.402 - .116 - .739 6.056 -5.928 15.452 (-.491) (1.432) (-.458) (-.869) (.782) (-.644) (1.867) NOTE.-VWNY = returno n the value-weightedN YSE index; EWNY = returno n the equally weighted NYSE index; MP = monthly growth rate in industrialp roduction;D EI = change in expected inflation;U I = unanticipatedin flation;U PR = unanticipatedc hangei n the risk premium (Baa and underr eturn - long-termg overnmentb ond return);U TS = unanticipatedc hangei n the term structure( long-termg overnmentb ond return - Treasury-bilrl ate);a nd YP = yearly growth rate in industrialp roduction.t -statisticsa re in parentheses. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 22,
    "chunk_index": 26,
    "word_count": 429,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "unanticipatedc hangei n the term structure( long-termg overnmentb ond return - Treasury-bilrl ate);a nd YP = yearly growth rate in industrialp roduction.t -statisticsa re in parentheses. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 22,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 397 related with long-term bond returns, abstractingf rom unanticipated changes in inflationo r in expected inflationa nd holdinga ll other char- acteristics equal, will be more valuable than stocks that are uncor- related or negatively correlatedw ith long-termb ond returns. To test the pricing influence on the market indices, EWNY and VWNY were added to the set of state variables (actually, they were substituted for YP). It would not be inconsistent with asset-pricing theory to discover, for example, that the betas on the marketp ortfolio were sufficient to capture the pricing impact of the macroeconomic state variables, and it would certainlyr ationalizep ast efforts that have focused on examiningt he efficiency of a marketi ndex. In some sense, then, an importantt est of the independente xplanatoryi nfluenceo f the macroeconomicv ariables on pricing is to see how they fare in direct competitionw ith a market index. Parts C and D of table 4 report the results of such tests. Using the EWNY as a substitute for YP and includingM P, DEI, UI, UPR, and UTS, we findi n part C that the marketi ndex fails to have a statistically significante ffect on pricing in any subperiod. On the other hand, the originalm acroeconomicv ariables have about the same significancea s they did in part B. Nor are these results affected by the choice of marketi ndex; part D of table 4 reports similarr esults when using the VWNY. By contrastw ith the tests reportedi n table 4, table 5 reportso n tests that purposelyh ave been designed to enhance the impact of the market indices. The tests discussed above were \"fair\" in the sense that the time-series regressions that measured the betas and the subsequent cross-sectional regressions that estimated their pricing influence gave each variablea n a priorie qual opportunityt o be significant;t hat is, the design treated the variablesi n a symmetricf ashion. The tests reported in table 5 are asymmetrici n that they are weighted a priorit o favor the marketi ndices. The tests in table 4 can be interpretedf rom the perspective of the arbitragep ricingt heory. They are tests of whether the set of economic variablesc an be usefully augmentedb y the inclusiono f a marketi ndex. In this sense they are tests of whether the market contains missing priced factors or, alternatively,w hether the factors fail to have pricing significancea s against the market. The tests in table 5 are best inter- preted as tests whose null hypothesis is the CAPM, or, rather more simply, the efficiency of the index. If the index is efficient, then the factors should not improve on its pricing ability. Of course, all these interpretationsa re subject to the caveat that the factors may only help to improve the estimate of the \"true\" market portfolio either by ac- countingf or missing assets or throught heir correlationsw ith measure- ment errors in the marketb eta estimates. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 22,
    "chunk_index": 28,
    "word_count": 515,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "estimate of the \"true\" market portfolio either by ac- countingf or missing assets or throught heir correlationsw ith measure- ment errors in the marketb eta estimates. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 22,
    "chunk_index": 29,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "398 Journal of Business TABLE 5 Economic Variables and Pricing Years VWNY MP DEI UI UPR UTS Constant A 1958-84 14.527 ... ... ... ... ... -5.831 (2.356) (-.961) 1958-67 5.005 ... ... ... ... ... 6.853 (.673) (.928) 1968-77 17.987 ... ... ... ... ... - 15.034 (1.460) (-1.254) 1978-84 23.187 ... ... ... ... ... - 10.802 (1.935) (-.907) B 1958-84 -9.989 12.185 - .145 - .912 9.812 - 5.448 10.714 (-2.014) (3.153) (-1.817) (-2.590) (3.355) (-1.609) (2.755) 1958-67 -5.714 13.024 .004 - .193 6.104 - .593 9.527 (-1.008) (1.852) (.057) (-.369) (1.994) (-.260) (1.983) 1968-77 - 17.396 14.467 -.291 -1.614 14.367 -9.227 8.584 (- 1.824) (2.214) (- 3.388) (-3.297) (3.128) (-1.775) (1.167) 1978-84 - 5.515 7.725 - .150 - .935 8.602 -6.986 15.454 (-.513) (1.303) (-.574) (-1.051) (1.064) (-.681) (1.867) C 1958-84 11.507 10.487 - .190 - .738 8.126 -7.073 -3.781 (1.189) (2.761) (-2.459) (- 2.215) (2.869) (-2.194) (- .402) 1958-67 22.311 9.597 .001 -.163 3.186 .697 - 11.734 (1.950) (1.494) (.012) (- .341) (1.474) (.337) (- 1.015) 1968-77 11.689 13.381 -.293 - 1.422 13.007 -12.981 -9.488 (.622) (1.947) (- 3.590) (-2.814) (2.697) (-2.214) (- .526) 1978-84 -4.188 7.624 -.316 -.584 8.211 -9.735 15.732 (-.207) (1.286) (- 1.246) (-.716) (1.039) (-1.123) (.803) NOTE.-VWNY = returno n the value-weightedN YSE index; EWNY = returno n the equally weighted NYSE index; MP = monthly growth rate in industrialp roduction;D EI = change in expected inflation;U I = unanticipatedin flation;U PR = unanticipatedc hangei n the risk premium (Baaa ndu nderr eturn- long-termg overnmentb ondr eturn);a ndU TS = unanticipatedch angei n the term structure( long-termg overnmentb ond return - Treasury-bilrl ate). t-statisticsa re in parenthe- ses. Part A of table 5 reports the results of a simple test of the pricing influence of the ordinaryC APM betas computed from the VWNY in- dex in the absence of the state variables. The VWNY-index betas are significant and positively related to average returns over the entire period, althought hey are significanto nly in the last subperiod.P art B of table 5 reports a more demandingt est of the pricingi nfluenceo f the index. These results differ from part D of table 4 because the cross sections were run with the simple betas for the VWNY index (instead of betas from a multivariatet ime-series regression). The betas for the state variables came from multivariate time-series regressions with only those variablesi ncluded( they are the same as those used in partB of table 4). The VWNY betas are significanto ver the entire period but This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 22,
    "chunk_index": 30,
    "word_count": 445,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "only those variablesi ncluded( they are the same as those used in partB of table 4). The VWNY betas are significanto ver the entire period but This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 22,
    "chunk_index": 31,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 399 appear with a negative sign, and a comparisonw ith part B of table 4 reveals that neither the coefficients nor the significanceo f the factor betas is altered substantiallyb y the inclusion of the marketi ndex. (The results for the EWNY were essentially the same.) Part C of table 5 reportso n a finalt est in which, instead of estimating the index betas for the VWNY in the same fashion as for the other variables, the estimates were obtained from a single multiple regres- sion that was run over the testing period from 1958t o 1983.T he result- ing market-indexb eta estimates were then used in each of the cross- sectional tests along with the betas for the other variables. The betas for the other variablesw ere estimated as before, from time-seriesm ul- tiple regressions. (The betas for variables other than the marketi ndex came from part D of table 4.) It was thought that using the index-beta estimates from the testing period would lessen the ability of the other variables to show up as significant in pricing merely through their correlationw ith measuremente rrors in the index betas. Once again, the marketi ndex was insignificanto verall, and the other variablesw ere unalteredb y its inclusion. The results for the EWNY were similara nd are not reported. The insignificancef or pricing of the stock market indices contrasts sharplyw ith their significancei n time series. In the time-seriesr egres- sions, EWNY and VWNY were by far the most statisticallys ignificant variables. For example, the average t-statistics for EWNY rangedb e- tween 11.7 and 29.9 over the 20 portfolios. The largest t-statistic for any other variablew as only 3.4 when the indices were not included( for UPR and the smallest portfolio), and this fell to 2.5 when the VWNY was included, and most were considerably smaller. Although stock market indices \"explain\" much of the intertemporalm ovements in other stock portfolios, their estimated exposures (their betas) do not explain cross-sectional differencesi n average returnsa fter the betas of the economic state variablesh ave been included.T his suggests that the \"explanatoryp ower\" of the marketi ndices may have less to do with economics and more to do with the statistical observation that large, positively weighted portfolios of randomv ariables are correlated. B. Consumption and Asset Pricing Because of the current interest in consumption-baseda sset pricing models, we also examinedt he influenceo f the real consumptions eries. In a one-good intertemporala sset-pricingm odel, assets will be priced accordingt o their covariances with aggregate( marginalu tility of) con- sumption( see Lucas 1978;B reeden 1980;o r Cox et al. 1985).T here is nothing in this analysis that requires that consumptionr epresentsa ny particular state variable, and, in fact, the model is consistent with multistated escriptions of the economy. As a consequence, consump- tion-basedt heories predict that, when factors that represents tate vari- This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 22,
    "chunk_index": 32,
    "word_count": 506,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "in fact, the model is consistent with multistated escriptions of the economy. As a consequence, consump- tion-basedt heories predict that, when factors that represents tate vari- This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 22,
    "chunk_index": 33,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "400 Journal of Business ables are included along with consumption, they will be rejected as having an influence on pricing. Put formally, the consumptionb eta theories argue that E - r= b*k, (13) where E - r is the vector of excess returns, k is a risk-premium measure, and bc is the vector of consumptionb etas. The intuition of the theory is that individualsw ill adjust their intertemporalc onsump- tion streams so as to hedge against changes in the opportunitys et. In equilibrium, assets that move with consumption, that is, assets for which bc > 0, will be less valuable than will those that can insure against adverse movements in consumption,t hat is, those for which bc < 0. It follows from risk aversion that the risk-premiumm easure, k, should be positive. The alternativeh ypothesis that we will examine states that E - r= b*k + b*, (14) where b is a vector of betas on the economic state variables used above, and q is the vector of associated risk premia. The null hy- pothesis of the consumption beta models would be that k is positive and that q is zero. Of course, it can always be argued that the other variablesp ick up changes in the relative pricingo f differentc onsump- tion goods or correct errors in the measuremento f real consumption. Alternatively, although our updatingp rocedure is an attempt to deal with intertemporalc hanges in the beta coefficients, it could also be argued that the factors could be correlated with such changes (see Cornell [1981]f or a discussion of this possibility). Table 6 reports the results of these tests using the CG series of real per capita consumption growth described in SectiondI. Because of data collection timing, the CG series, like the monthly production series, MP, may actually measure consumptionc hanges with a lag. To deal with this problem, we led the CG series forwardb y 1 month. The results with the contemporaneousC G series are uniformlyl ess favor- able for its pricing influence and are not reported. TABLE 6 Pricing with Consumption Years CG MP DEI UI UPR UTS Constant 1964-84 .68 1-4.964 -.166 -.846 8.813 -6.921 2.289 (.108) (3.800) (- 1.741) (-2.250) (2.584) (- 1.790) (.628) 1964-77 -.485 18.150 .166 -.946 11.442 -9.191 -1.910 (- .659) (3.535) (-2.419) (-2.494) (3.288) (-2.412) (- .442) 1978-84 1.173 8.592 - .166 - .645 3.556 - 2.382 10.687 (.998) (1.476) (-.659) (-.770) (.474) (-.272) (1.609) NOTE.-t-statistics are in parentheses. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 22,
    "chunk_index": 34,
    "word_count": 433,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "(3.288) (-2.412) (- .442) 1978-84 1.173 8.592 - .166 - .645 3.556 - 2.382 10.687 (.998) (1.476) (-.659) (-.770) (.474) (-.272) (1.609) NOTE.-t-statistics are in parentheses. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 22,
    "chunk_index": 35,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 401 TABLE 7 Pricing with Oil Price Changes Years OG MP DEI UI UPR UTS Constant 1958-84 2.930 12.728 - .095 - .391 11.844 - 8.726 4.300 (.996) (1.406) (-1.193) (-1.123) (4.294) (-2.770) (1.340) 1958-67 4.955 14.409 .078 .119 8.002 -1.022 2.663 (1.978) (.921) (1.102) (.204) (2.604) (- .421) (.556) 1968-77 1.038 4.056 -.223 -1.269 16.170 - 16.055 -1.344 (.251) (.296) (-2.737) (-2.975) (3.839) (-3.154) (-.243) 1978-84 2.738 22.718 - .159 .134 11.152 -9.264 14.702 (.303) (1.228) (- .598) (.156) (1.465) (- 1.024) (2.240) NOTE.-CG = growthr atei n real per capitac onsumption;O G = growthr atei n oil prices;V WNY = returno n the value-weightedN YSE index;E WNY = returno n the equallyw eightedN YSE index; MP = monthlyg rowth rate in industrialp roduction;D EI = change in expected inflation;U I = unanticipatedin flation;U PR = unanticipatedc hangei n the risk premium( Baa and underr eturn - long-termg overnmentb ond return);a nd UTS = unanticipatedc hange in the term structure( long- term governmentb ond return - Treasury-bilrl ate). t-statisticsa re in parentheses. Since the CG series begins in 1959,t he tests were conductedo nly for the period beginningi n 1964, 5 years later. In these tests the consump- tion betas and the factor betas are estimated simultaneouslya nd then the risk premia are measuredf rom the cross-sectional tests. Over the entire period and in no subperioda re the consumptionb etas significant for pricing. Furthermore,t heir signs are negative, and a comparison with the results of part B of table 4 shows that the coefficients and the significanceo f the state variables are unalteredb y the presence of the CG betas. To summarizet he results of this subsection, the rate of change in consumptiond oes not seem to be significantlyr elated to asset pricing. The estimated risk premiumi s insignificanta nd has the wrong sign. C. Oil and Asset Pricing Oil prices are often mentioned as being an importante conomic factor even thought here is no a priorir eason to believe that innovationsi n oil prices should have the same degree of influencea s, for example, inter- est rate variableso r industrialp roduction.T o examine the independent influenceo f oil prices on asset pricing, we used the methods described above to test the impact of the OG series of petroleump rice changes. Table 7 reports on these tests. As with the consumptiont ests, the OG series was led by 1 month to enhance its influence. The oil betas were insignificantf or pricing in the overall period and in two of the subperiods.A s a comparisonw ith part B of table 4 shows, inclusion of oil growth did reduce the significanceo f industrialp roduction, but it increased the significanceo f the risk-premiumv ariable( UPR) and the term-structure variable (UTS). The risk associated with oil price changes was not priced in the stock marketd uringt he critical 1968-77 subperiod, when the OPEC cartel became important( or in the later subperiods). This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 22,
    "chunk_index": 36,
    "word_count": 518,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "oil price changes was not priced in the stock marketd uringt he critical 1968-77 subperiod, when the OPEC cartel became important( or in the later subperiods). This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 22,
    "chunk_index": 37,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "402 Journal of Business V. Conclusion This paperh as explored a set of economic state variablesa s systematic influenceso n stock marketr eturnsa nd has examinedt heir influenceo n asset pricing. From the perspective of efficient-markett heory and ra- tional expectations intertemporala sset-pricingt heory (see Cox et al. 1985), asset prices should depend on their exposures to the state vari- ables that describe the economy. (This conclusion is consistent with the asset-pricing theories of Merton [1973], Cox et al. [1985], or the APT [Ross 1976].) In Part II of this paper we used simple arguments to choose a set of economic state variables that, a priori, were candidates as sources of systematic asset risk. Several of these economic variables were found to be significanti n explaininge xpected stock returns,m ost notably, industrialp roduction, changes in the risk premium,t wists in the yield curve, and, somewhat more weakly, measures of unanti- cipated inflationa nd changes in expected inflationd uringp eriods when these variables were highly volatile. We do not claim, of course, that we have exhaustively characterizedt he set of influentialm acro vari- ables, but the set that was chosen performedw ell against several other potentialp ricingv ariables. Perhapst he most strikingr esult is that even though a stock market index, such as the value-weightedN ew York Stock Exchange index, explains a significantp ortion of the time-series variabilityo f stock returns, it has an insignificanti nfluence on pricing (i.e., on expected returns)w hen compareda gainst the economic state variables. We also examined the influence on pricing of exposure to innovations in real per capita consumption. These results are quite disappointingt o consumption-based asset-pricing theories; the con- sumptionv ariablew as never significant.F inally, we examined the im- pact of an index of oil price changes on asset pricing and found no overall effect. Our conclusion is that stock returnsa re exposed to systematic eco- nomic news, that they are priced in accordance with their exposures, and that the news can be measured as innovations in state variables whose identificationc an be accomplishedt hroughs imple and intuitive financialt heory. References Banz, Rolf W. 1981. The relationshipb etween returns and marketv alues of common stocks. Journal of Financial Economics 9:3-18. Breeden, Douglas. 1979.A n intertemporaal sset pricingm odel with stochasticc onsump- tion and investment opportunities.J ournal of Financial Economics 7:256-96. Brown, S., and Weinstein,M . 1983.A new approacht o testinga sset pricingm odels:T he bilinearp aradigm.J ournal of Finance 38:711-43. Chen, Nai-Fu. 1983. Some empiricalt ests of the theory of arbitragep ricing.J ournal of Finance 38:1393-1414. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 22,
    "chunk_index": 38,
    "word_count": 446,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "sset pricingm odels:T he bilinearp aradigm.J ournal of Finance 38:711-43. Chen, Nai-Fu. 1983. Some empiricalt ests of the theory of arbitragep ricing.J ournal of Finance 38:1393-1414. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 22,
    "chunk_index": 39,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "Economic Forces and the Stock Market 403 Cornell,B radford.1 981.T he consumptionb ased asset pricingm odel:A note on potential tests and applications.J ournal of Financial Economics 9:103-8. Cox, John; Ingersoll, Jonathan;a nd Ross, Stephen A. 1985. An intertemporagl eneral equilibriumm odel of asset prices. Econometrica 53:363-84. Fama, Eugene. 1981. Stock returns,r eal activity, inflationa nd money. American Eco- nomic Review 71:545-65. Fama,E ugene, and Gibbons,M ichael. 1984.A comparisono f inflationf orecasts.J ournal of Monetary Economics 13:327-48. Fama, Eugene, and MacBeth, James D. 1973. Risk, return,a nd equilibriumE: mpirical tests. Journal of Political Economy 38:607-36. Hansen, Lars, and Singleton,K enneth. 1983.S tochasticc onsumption,r isk aversion,a nd the temporalb ehavioro f asset returns.J ournal of Political Economy 91:249-65. Ibbotson, Roger. 1979.T he corporateb ond market:S tructurea nd returns.U npublished manuscript.C hicago:U niversity of Chicago. Ibbotson, Roger, and Sinquefield,R ex. 1982. Stocks, Bonds, Bills and Inflation: The Past and the Future. Charlottesville,V a.: FinancialA nalysts ResearchF oundation. LittermanR, obert,a nd Weiss, Laurence. 1983.M oney, real interestr ates, ando utput:A reinterpretationof postwarU .S. data. NBER WorkingP apern o. 1077.C hicago:U ni- versity of Chicago. Lucas, Robert E., Jr. 1978. Asset prices in an exchange economy. Econometrica 46:1429-45. Merton, Robert C. 1973. An intertemporalc apital asset pricing model. Econometrica 41:867-87. Roll, R., and Ross, S. 1980. An empiricali nvestigationo f the arbitragep ricingt heory. Journal of Finance 35: 1073-1103. Ross, Stephen A. 1976. The arbitraget heory of capital asset pricing.J ournal of Eco- nomic Theory 13:341-60. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 22,
    "chunk_index": 40,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  },
  {
    "text": "the arbitragep ricingt heory. Journal of Finance 35: 1073-1103. Ross, Stephen A. 1976. The arbitraget heory of capital asset pricing.J ournal of Eco- nomic Theory 13:341-60. This content downloaded by the authorized user from 192.168.82.218 on Tue, 4 Dec 2012 03:43:28 AM All use subject to JSTOR Terms and Conditions",
    "title": "Economic Forces and the Stock Market",
    "source_type": "pdf",
    "document_id": "b93593a0088e",
    "source_file": "Economic_Forces_and_the_Stock_Market_Aut.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 22,
    "chunk_index": 41,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20071204115658-05'00'",
    "duration": null
  }
]