[
  {
    "text": "and the Cross-Section of Option Returns Aurelio Vasquez ITAM - Instituto Tecnol(cid:243)gico Aut(cid:243)nomo de MØxico (cid:3) First Draft: October 14, 2011 This Draft: November 23, 2015 Abstract The slope of the implied volatility term structure is positively related to future option returns. We rank (cid:133)rms based on the slope of the volatility term structure and analyze the returns for straddle portfolios. Straddle portfolios with high slopes of the volatility term structure outperform straddle portfolios with low slopes by an econom- ically and statistically signi(cid:133)cant amount. The results are robust to di⁄erent empirical setups and are not explained by traditional factors, higher-order option factors, or jump risk. JEL Classi(cid:133)cation: C21, G12, G13, G14. Keywords: Equity Options; Volatility Term Structure; Volatility Overreaction; Pre- dictability; Cross-Section. ThisworkispartofmydissertationatMcGillUniversity. IamgratefulforhelpfulcommentsfromDiego (cid:3) Amaya, HiteshDoshi, RedouaneElkamhi, AlexHorenstein, LarsStentoft, RichardRoll, andespeciallyfrom my PhD supervisors Peter Christo⁄ersen and Kris Jacobs. I also want to thank seminar participants at FMA New York, EAFIT Medellin, EFA Boston, EFMA Amsterdam, ITAM, IMEF Mexico, Laval Univer- sity, McGill University, MFA New Orleans, NFA Vancouver, TEC of Monterrey, Texas A&M, and UQAM for helpful comments. I thank IFM2 and Asociaci(cid:243)n Mexicana de Cultura A.C for (cid:133)nancial support. Corre- spondence to: Aurelio Vasquez, Faculty of Management, ITAM, Rio Hondo 1, Alvaro Obregon, Mexico DF; Tel: (52) 55 5628 4000 x.6518; E-mail: aurelio.vasquez@itam.mx. 1 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 53,
    "chunk_index": 0,
    "word_count": 223,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Monterrey, Texas A&M, and UQAM for helpful comments. I thank IFM2 and Asociaci(cid:243)n Mexicana de Cultura A.C for (cid:133)nancial support. Corre- spondence to: Aurelio Vasquez, Faculty of Management, ITAM, Rio Hondo 1, Alvaro Obregon, Mexico DF; Tel: (52) 55 5628 4000 x.6518; E-mail: aurelio.vasquez@itam.mx. 1 Electronic copy available at: https://ssrn.com/abstract=1944298 1 Introduction We investigate if the shape of the term structure of implied volatility is related to the cross- section of future one-week option returns. Every week, we sort stocks by the slope of the volatility term structure, group them in deciles, and examine the average future straddle returns. We (cid:133)nd a strong positive relation between the slope of the volatility term structure and future straddle returns. The straddle, a trading strategy that bets on the direction of volatility, has an average weekly return of 2:9% for the decile with the lowest slope of the (cid:0) volatility term structure and a return of 2:2% for the decile with the highest slope. The long-short strategy generates a weekly return of 5:1% with a t-statistic of 19:9. These (cid:133)ndings hold across di⁄erent time periods, alternative horizons, moneyness levels, weighting schemes, and alternative de(cid:133)nitions of the slope of the volatility term structure. Fama-MacBeth (1973) regressions of the type proposed by Brennan, Chordia, and Subrah- manyam (1998), and double sorts on (cid:133)rm characteristics further con(cid:133)rm our (cid:133)ndings. The coe¢ cients of the slope of the volatility term structure and the long-short straddle returns are positive and signi(cid:133)cant when we control by (cid:133)rm characteristics such as (cid:133)rm size, book- to-market, risk neutral moments, and jump risk. We compute the alphas of the long-short straddle strategy using the Carhart (1997) model as well as the coskewness and cokurtosis factor models proposed by Vanden (2006) that include higher order moments of the market return and the market option return. The alphas from the Carhart (1997), coskewness and cokurtosis models are large and signi(cid:133)cant, and are very close to the raw returns. We perform an extensive analysis on the relation between the slope of the volatility term structure and several measures of volatility minus current implied volatility, IV . These 1M measurescanbedividedintothreegroups: measuresofthevolatilityriskpremium, measures of volatility under- and over-reaction, and option anomaly measures. The volatility risk premiumiscomputedasthedi⁄erencebetweenrealizedvolatilitycomputedfrom(cid:133)ve-minute 2 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 53,
    "chunk_index": 1,
    "word_count": 375,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "perform an extensive analysis on the relation between the slope of the volatility term structure and several measures of volatility minus current implied volatility, IV . These 1M measurescanbedividedintothreegroups: measuresofthevolatilityriskpremium, measures of volatility under- and over-reaction, and option anomaly measures. The volatility risk premiumiscomputedasthedi⁄erencebetweenrealizedvolatilitycomputedfrom(cid:133)ve-minute 2 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 53,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "returns and IV following Bollerslev, Tauchen, and Zhou (2009). We include realized 1M volatilitysinceCorsi(2009)andBusch,Christensen,andNielsen(2011)showthatitisagood predictor of future volatility. Volatility under- and over-reaction is measured with implied volatility lagged by one month, three months, and six months, and the average implied volatility (minus IV ). We include these measures since Stein (1989) and Poteshman 1M (2001)reportthatinvestorsover-react(under-react)tocurrentvolatilitychanges. Theoption anomaly measures are historical volatility and idiosyncratic volatility. Goyal and Saretto (2009) (cid:133)nd that straddle returns are positively related to the di⁄erence between historical and implied volatility, and Cao and Han (2013) (cid:133)nd that delta-hedged call returns are negatively related to idiosyncratic volatility. We study the behavior of these volatility measures across decile portfolios ranked by the slope of the volatility term structure. All measures of volatility misreaction (minus IV ), 1M the volatility risk premium, and the option anomaly measures monotonically increase from portfolio 1 to portfolio 10. Moreover, most of the volatility measures report a negative value for portfolio 1 (lowest slope of term structure) and a positive value for portfolio 10 (highest slope of the volatility term structure). An examination of the correlation among these variables shows that the slope of the volatility term structure is highly correlated with measures of volatility over-reaction ranging from 51% to 58%. The correlation with the volatility risk premiumis much lower, at only 18%. The slope of the volatility termstructure reports a correlation of 42% with HV IV ; the option anomaly documented by Goyal 1M (cid:0) and Saretto (2009). Next, we explore the relation between these volatility measures and future straddle re- turns. Bivariate Fama and MacBeth (1973) regressions between the slope of the volatility term structure and each one of these volatility measures con(cid:133)rms the positive and signi(cid:133)cant relation between the slope of the term structure and future straddle returns. The slope of the volatility term structure is measuring something that is not captured by these other volatility variables. 3 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 53,
    "chunk_index": 3,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "structure and each one of these volatility measures con(cid:133)rms the positive and signi(cid:133)cant relation between the slope of the term structure and future straddle returns. The slope of the volatility term structure is measuring something that is not captured by these other volatility variables. 3 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 53,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "The large straddle returns potentially represent a compensation for jump risk given that the straddle position is not gamma-neutral (Cremers, Halling, and Weinbaum (2015)). Sev- eral measures of jump risk are proposed in the literature. Bakshi and Kapadia (2003) show that risk-neutral skewness and risk-neutral kurtosis proxy for jump risk. Xing, Zhang and Zhao (2010) proxy risk neutral skewness with the slope of the volatility smile. Yan (2011) measures jump risk with the spread between at-the-money put and call volatilities which may be caused by market imperfections, short sale constraints, or the trading activity of informed traders as documented by Cremers and Weinbaum (2010). Bollerslev and Todorov (2011) propose two measures of risk-neutral jump, one for the right tail and one for the left tail of the distribution. After controlling for jump risk, the Fama-MacBeth coe¢ cients of the slope of the volatility term structure, and the long-short straddle returns in the double sortings remain positive and signi(cid:133)cant. This paper contributes to the (cid:133)nance literature in two ways. Our paper is one of the (cid:133)rst to document that the slope of the term structure of implied volatilities has a positive relation with subsequent option returns in the cross-section. Contemporaneous work by Jones and Wang (2012) reports similar (cid:133)ndings. However, there are three main di⁄erences between our paper and Jones and Wang (2012). First, in our paper we explore the sources of predictability. We perform an extensive analysis on the relation among the slope of the volatility term structure, the volatility risk premium, measures of volatility over-reaction, and measures of option anomalies. Second, in our paper we study the impact of transaction costs on straddle returns. Third, we analyze straddle returns for di⁄erent horizons: one week, two weeks, three weeks and one month. Previously, the shape of the volatility term structure has been used to test the expec- tations hypothesis, and the overreaction of long-term volatilities. Notable research in this area includes papers by Stein (1989), Diz and Finucane (1993), Heynen, Kemna, and Vorst (1994), CampaandChang(1995), Poteshman(2001), Mixon(2007), andBakshi, Panayotov, and Skoulakis (2011). However, our paper is among the (cid:133)rst to use the shape of the term 4 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 53,
    "chunk_index": 5,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "of long-term volatilities. Notable research in this area includes papers by Stein (1989), Diz and Finucane (1993), Heynen, Kemna, and Vorst (1994), CampaandChang(1995), Poteshman(2001), Mixon(2007), andBakshi, Panayotov, and Skoulakis (2011). However, our paper is among the (cid:133)rst to use the shape of the term 4 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 53,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "structure to identify mispriced options. A second contribution relates to the forecasting of future realized volatility minus current implied volatility. Since the slope of the volatility term structure is positively related with option returns, we test if it forecasts future realized volatility minus short-term implied volatility. Cao, Yu, and Zhong (2010) and Busch, Christensen, and Nielsen (2011) show that short-term implied volatility, historical volatility and realized volatility are all good predictors of future volatility.1 We document that the slope of the volatility term structure also contributes to the prediction of future realized volatility minus short-term volatility. Empirical option research has focused primarily on index options.2 This paper explores the cross-section of equity options. In the literature on the cross-section of equity options, Cao and Han (2013) (cid:133)nd that delta-hedged option returns are negatively related to total and idiosyncratic volatility. Jones and Shemesh (2010) document the options weekend e⁄ect, option returns are lower on weekends than on weekdays, and Choy (2015) reports a negative relation between option returns and retail trading proportions. Bali and Murray (2013) create skewness-assets using options and the underlying stock and (cid:133)nd a negative relation between the skewness-asset returns and their risk-neutral skewness. The most closely related paper, in addition to Jones and Wang (2012), is Goyal and Saretto (2009) who show that option returns are positively related to the di⁄erence between individual historical realized volatility and at-the-money (ATM) implied volatility. The implied volatility term structure is used in the option pricing literature. Christof- fersen, Jacobs, Ornthanalai, and Wang (2008) and Christo⁄ersen, Heston, and Jacobs (2009) show that an option pricing model that properly (cid:133)ts the volatility term structure has a su- perior out-of-sample performance compared to classical option pricing models such as the Heston model. This result suggests that the volatility term structure might contain crucial 1See Poon and Granger (2003) for a review on volatility forecasting. 2Coval and Shumway (2001) study index option returns and (cid:133)nd that zero cost at-the-money straddle positions on the S&P 500 produce average losses of approximately 3% per week. Other studies of index option returns are Bakshi and Kapadia (2003), Jones (2006), Bondarenko (2014), Saretto and Santa-Clara (2009), Bollen and Whaley (2004), Shleifer and Vishny (1997), Jackwerth (2000), Buraschi and Jackwerth (2001), and Liu and Longsta⁄(2004). 5 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 53,
    "chunk_index": 7,
    "word_count": 382,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "average losses of approximately 3% per week. Other studies of index option returns are Bakshi and Kapadia (2003), Jones (2006), Bondarenko (2014), Saretto and Santa-Clara (2009), Bollen and Whaley (2004), Shleifer and Vishny (1997), Jackwerth (2000), Buraschi and Jackwerth (2001), and Liu and Longsta⁄(2004). 5 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 53,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "information on future option prices. Our paper documents a positive relation between the slope of the volatility term structure and future option returns. The remainder of this paper is organized as follows. Section two describes the option data. Section three describes the option portfolio formation and its characteristics. The straddle returns using di⁄erent setups are presented in section four, and section (cid:133)ve contains a series of robustness checks. Section six concludes the paper. 2 Data In this section, we describe the data and explain the (cid:133)lters that are applied. We use the cross-section of options from the OptionMetrics Ivy database. The Option- Metrics Ivy database is a comprehensive source of high quality historical price and volatility data for the US equity and index options markets. We use data for all US equity options and their underlying prices for the period starting on January 4, 1996 through January 30, 2012. Each observation contains information on the closing bid and ask quotes for American options, open interest, daily trading volume, implied volatilities, and Greeks. Given that individual equity option are American-style, implied volatilities and Greeks are computed using a modi(cid:133)ed Cox, Ross, and Rubinstein (1979) binomial model.3 OptionMetrics also provides stock prices, dividends, and risk-free rates. A complete historyof splitsisalsoavailableforeachsecurity. Therisk-freeratesarelinearlyinterpolated to match the maturity of the option. If the (cid:133)rst risk-free rate maturity is greater than the option maturity, no extrapolation is performed and the (cid:133)rst available risk-free rate is used. Next, we apply standard (cid:133)lters for individual options as in Goyal and Saretto (2009). We eliminate the prices that violate arbitrage bounds.4 That is, we eliminate call option 3OptionMetrics uses a proprietary option pricing algorithm based on the Cox, Ross, and Rubinstein (1979) model to extract implied volatilities and Greeks. This model can accommodate underlying securities with either discrete dividend payments or a continuous dividend yield. Regardless of the methodology to handle dividends, the impact on calculated option implied volatilities is small. 4DuarteandJones(2007)pointoutthatoptionsthatviolatearbitrageboundsmightstillbevalidoptions. The inclusion of options that violate arbitrage bounds does not change the conclusions. These results are 6 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 53,
    "chunk_index": 9,
    "word_count": 345,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "securities with either discrete dividend payments or a continuous dividend yield. Regardless of the methodology to handle dividends, the impact on calculated option implied volatilities is small. 4DuarteandJones(2007)pointoutthatoptionsthatviolatearbitrageboundsmightstillbevalidoptions. The inclusion of options that violate arbitrage bounds does not change the conclusions. These results are 6 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 53,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "prices that fall outside of the interval (S Ke (cid:28)r De (cid:28)r;S), and put option prices that (cid:0) (cid:0) (cid:0) (cid:0) fall outside of the interval ( S +Ke (cid:28)r +De (cid:28)r;S); where S is the price of the underlying (cid:0) (cid:0) (cid:0) stock, K is the strike of the option, r is the risk-free rate, D is the dollar dividend, and (cid:28) is the time to expiration. An observation is eliminated if the ask is lower than the bid, the bid (ask) is equal to zero, or the spread is lower than the minimum tick size. The minimum tick size is $0:05 for options trading below $3 and $0:10 for other options. Whenever the bid and ask prices are both equal to the previous day(cid:146)s quotes, the observation is also eliminated. We (cid:133)lter options with zero volume or zero open-interest to ensure that the option prices are valid. Options with underlying stock prices lower than $5 are removed from the sample. Finally, the moneyness of the options must be between 0:95 and 1:05, and volatilities should lie between 3% and 200%.5 Eachweek,wecomputetheslopeofthevolatilitytermstructureforeachstock. Theslope of the volatility term structure is de(cid:133)ned as the di⁄erence between the long-term and the short-term volatility. The short-term volatility, IV ; is de(cid:133)ned as the average of the short(cid:150) 1M term ATM put and call implied volatilities. The long-term volatility, IV ; is the average LT volatility of the ATM put and call options that have the longest time-to-maturity available and the same strike as that of the short-term options. The longest time to expiration is between 50 and 360 days. Hence, the maturity of the long-term options is di⁄erent across stocks and, for any given stock, can change across time.6;7 discussed in the Robustness Section and reported in Table IA.5 in the Internet Appendix. 5Theconclusionsholdwhenthevolatilityrangeis3%to100%,andwhenthemoneynesslevelisunbounded or between 0.975 and 1.025. These results are discussed in the Robustness Section and reported in Table IA.5 in the Internet Appendix. 6Note that option returns are computed only for short-term options. Long-term options are only used to extract long-term volatility to compute the slope of the volatility term structure. 7The results hold when we (cid:133)x the long-term maturity to 3-months, 6-months, and 9-months. These results are discussed in the Robustness Section and reported in Table IA.5 in the Internet Appendix. 7 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 53,
    "chunk_index": 11,
    "word_count": 388,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "to extract long-term volatility to compute the slope of the volatility term structure. 7The results hold when we (cid:133)x the long-term maturity to 3-months, 6-months, and 9-months. These results are discussed in the Robustness Section and reported in Table IA.5 in the Internet Appendix. 7 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 53,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "3 Portfolio Formation and Trading Strategy In this section, we explain how portfolios are constructed and provide a summary of di⁄erent characteristics across portfolios. 3.1 Portfolio Formation Each week, we form ten portfolios based on the slope of the volatility term structure, IV LT (cid:0) IV .8 We extract the ATM put and call options that are on average 5 weeks away from 1M maturity. We form straddle portfolios based on the slope of the volatility term structure and hold these portfolios for one week. One week later, we get the market price of the option to compute the straddle return. If no price is available, we interpolate the missing implied volatilityfromtheOptionMetricsVolatilitySurfaceandcomputethetheoretical optionprice with the Cox, Ross, and Rubinstein (1979) model. If the implied volatility is not available, the option price is set to the intrinsic value of the option. The options maturity ranges from 25 to 46 days. The strike price is as close as possible to the closing price. We compute the straddle returns over one week.9 Then, we form decile portfolios based on the slope of the volatility term structure. Since decile portfolios are formed based on the options availability, stocks drop in and out of the sample from week to week. On average, there are 486 stocks per week and our sample contains more than 400 thousand (cid:133)rm-week observations. 8Alternative de(cid:133)nitions of the slope of the volatility term structure using variance, the square root of volatility, volatility cubed, the cubed root of volatility, or the logarithm of volatility do not change the results. Table IA.1 in the Internet Appendix reports the results for each de(cid:133)nition. 9A long straddle return is de(cid:133)ned as rstraddle = pT+cT rf ; where c and p are the average of the bid t;T pt+ct (cid:0) t;T t t and ask prices of a call and a put option, on trading day t, and rf is the future value of one dollar from t;T time t to T, which is one week. 8 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 53,
    "chunk_index": 13,
    "word_count": 336,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "the average of the bid t;T pt+ct (cid:0) t;T t t and ask prices of a call and a put option, on trading day t, and rf is the future value of one dollar from t;T time t to T, which is one week. 8 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "Equity Volatility Term Structures",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 53,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Equity Volatility Term Structures (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "ity Term Structure PanelAofTable1reportsthetime-seriesaveragesfordi⁄erent(cid:133)rmcharacteristicsfortheten portfolios ranked by the slope of the volatility term structure. The characteristics included are divided into three groups: measures of volatility, (cid:133)rm and option characteristics, and risk neutral measures. [ Insert Table 1 here ] The variables related to the slope of the volatility term structure are IV ; IV , and 1M LT IV IV . We report volatility measures related to future volatility, the volatility risk LT 1M (cid:0) premium, investor misreaction to volatility changes, and option anomalies. Future volatility, FV, de(cid:133)ned as the standard deviation of the daily stock return over one week. The volatility risk premium (VRP) is de(cid:133)ned as the RV IV as proposed by Bollerslev, Tauchen, 1M 1M (cid:0) and Zhou (2009). Realized volatility is computed with 5-minute returns over one month (RV ).10 We also include the 1-day (RV ) and 1-week (RV ) realized volatility measures. 1M 1d 1w We include a set of variables that control for investor misreaction to volatility changes. Poteshman (2001) and Stein (1989) document that investors can underreact or overreact to changes in volatility. Hence, investors might be buying (selling) options that are overpriced (underpriced) and that will generate negative (positive) future returns. To account for high volatility periods and investor misreactions, we include measures of previous volatility minus short-term implied volatility, IV . The measures of previous volatility are the one-month 1M (IVt 1), 3-month (IVt 3), and 6-month (IVt 6) lagged implied volatility as well as the 1M(cid:0) 1M(cid:0) 1M(cid:0) maximum (IVmax) and the average implied volatility (IVavg) over the previous 6-months. 1M 1M Finally two variables account for option anomalies: HV IV ; and IdioVol IV . Goyal 1M 1M (cid:0) (cid:0) and Saretto (2009) (cid:133)nd that straddle and delta-hedged call returns have a positive relation 10Note that FV is measured with daily returns over the next 5 trading days, while RV is measured 1M with (cid:133)ve minute intraday returns over the previous 22 trading days. 9 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 53,
    "chunk_index": 15,
    "word_count": 332,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "and Saretto (2009) (cid:133)nd that straddle and delta-hedged call returns have a positive relation 10Note that FV is measured with daily returns over the next 5 trading days, while RV is measured 1M with (cid:133)ve minute intraday returns over the previous 22 trading days. 9 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 53,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "withthedi⁄erencebetweenhistoricalandimpliedvolatility,HV IV . CaoandHan(2013) 1M (cid:0) report that delta-hedged call returns decrease with the level of idiosyncratic volatility. These volatility measures are discussed in more detail in Appendix A. Firm and option characteristics are the options size (in $ thousands), de(cid:133)ned as the open interest for calls and puts multiplied by their price, the average put-call spread of at- the-moneyimpliedvolatility, thebid-to-midspreadofat-the-moneyimpliedvolatility, option Greeks, (cid:133)rmsize, and book-to-market. Finally, the risk neutral measures are the risk-neutral volatility, skewness and kurtosis extracted from one-month options using the methodology proposed by Bakshi, Kapadia, and Madan (2003), and the risk-neutral jump proposed by Yan (2011). Panel A of Table 1 reports the results for decile portfolios sorted by the slope of the volatility term structure. All volatility measures minus IV increase from portfolio 1 to 1M portfolio 10. The average maturity of long-term options is 7 months. From portfolio 1 to portfolio 10, the bid-to-mid-spread of IV increases, the gamma increases, and the delta 1M andthebook-to-marketremainatthesamelevel. Similartoportfolio10, portfolio1contains stocks with higher put-call spread of IV , lower vega, lower size, and higher risk neutral 1M jump. Panel B of Table 1 reports the correlations of the volatility variables minus IV . The 1M correlation structure con(cid:133)rms the results from Panel A for the volatility measures: most of thecorrelationsarepositive. Inparticular, theslopeofthevolatilitytermstructurereportsa positivecorrelationwithallthevolatilitymeasures(minusIV )butfuturevolatility. There 1M is a low correlation between the slope of the volatility term structure and the volatility risk premium (VRP) of 17:6%. There is a high correlation between the slope of the volatility term structure and measures of option anomalies and volatility overreaction. In summary, Table 1 shows that the slope of the volatility term structure appears to be related to several measures of volatility (minus IV ). We now attempt to establish a 1M cross-sectional relation between the slope of the volatility term structure and future option 10 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 53,
    "chunk_index": 17,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "summary, Table 1 shows that the slope of the volatility term structure appears to be related to several measures of volatility (minus IV ). We now attempt to establish a 1M cross-sectional relation between the slope of the volatility term structure and future option 10 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 53,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "returns. 4 Slope of the Volatility Term Structure and the Cross- Section of Option Returns In this section, we (cid:133)rst analyze the relation between the slope of the volatility term struc- ture and the one-week straddle returns. We report the raw straddle returns as well as the Carhart (1997), coskewness and cokurtosis risk adjusted alphas for the long-short strad- dle portfolio. Second, we use double sorts and the modi(cid:133)ed two-stage Fama and MacBeth (1973)cross-sectionalregressionsproposedbyBrennan, Chordia, andSubrahmanyam(1998) to understand the relation between the slope of the volatility term structure, other volatility measures minus IV , higher moments, and jump risk. Third, we explore the source of 1M predictability of the slope of the volatility term structure. Then, we assess the impact of return holding horizon and transaction costs on straddle returns. Finally, we discuss possible explanations of our empirical (cid:133)nding. 4.1 Sorting Straddle Returns by the Slope of the Volatility Term Structure [ Insert Table 2 here ] Each week, we rank stocks by the slope of their volatility term structure and form ten optionportfolios. PanelAonTable2reportsequallyweightedportfolioreturnsforstraddles. Straddle returns increase from portfolio 1 to portfolio 10. In particular, the straddle returns are negative for portfolios 1 to 8 and are positive for portfolios 9 and 10. The long-short straddle strategy (portfolio 10 minus portfolio 1) yields a 5:1% weekly average return with a t-statistic of 19:9. Both portfolios contribute to the long-short portfolio return since the straddle returns are 2:9% and 2:2% for portfolios 1 and 10, respectively. (cid:0) 11 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 53,
    "chunk_index": 19,
    "word_count": 253,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "10. The long-short straddle strategy (portfolio 10 minus portfolio 1) yields a 5:1% weekly average return with a t-statistic of 19:9. Both portfolios contribute to the long-short portfolio return since the straddle returns are 2:9% and 2:2% for portfolios 1 and 10, respectively. (cid:0) 11 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 53,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "[ Insert Figure 1 here ] Figure 1 displays the time series of the long-short straddle returns. About 78% of the weekly straddle returns are positive. The maximum long-short straddle return is 49% and the minimum is 29%. Over the sample period, most of the positive returns are below 20%. (cid:0) [ Insert Figure 2 here ] Figure 2 displays the qq-plot of the long-short straddle returns. The distribution of straddle returns is positively skewed and fat-tailed. Skewness of the distribution is 0:6 and kurtosis is 3:8 as reported in Panel A of Table 2. Thelong-shortstraddlereturnsarenon-normal, con(cid:133)rmingthe(cid:133)ndingsofBroadie, Cher- nov, and Johannes (2009). Hence, the conventional t-statistic of 19:9 should be interpreted with care. We report the 95% bootstrap con(cid:133)dence intervals for the mean of the long-short straddle returns. To construct the bootstrapped con(cid:133)dence interval, we draw with replace- ment from the original 837 weekly long-short straddle returns. For each of the 50;000 boot- strap samples that contains 837 sampled values, we calculate the bootstrap sample mean. From the 50;000 bootstrapped sample means, we extract the 2:5% and 97:5% percentiles to form the 95% bootstrap con(cid:133)dence interval. The 95% bootstrap con(cid:133)dence interval is [0:046; 0:055] which con(cid:133)rms that the long-short straddle return is positive and signi(cid:133)cantly di⁄erent from zero. We also include in Panel B of Table 2 the bootstrapped critical values for the t-statistic of the long-short straddle returns. First, we subtract the average long-short return of 5:1% to the time-series of long-short straddle returns. From the total sample of 837 demeaned returns,wedrawwithreplacement50;000samples. Foreachofthe50;000bootstrapsamples that contains 837 demeaned returns, we calculate the bootstrap t-statistic. From the 50;000 bootstrapped t-statistics, we compute the critical values for the t-statistic. The critical value at the 1% level in a two-sided test is 2:300 which con(cid:133)rms that the long-short straddle return of 5:1% is signi(cid:133)cant at the 1% level. 12 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 53,
    "chunk_index": 21,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "the bootstrap t-statistic. From the 50;000 bootstrapped t-statistics, we compute the critical values for the t-statistic. The critical value at the 1% level in a two-sided test is 2:300 which con(cid:133)rms that the long-short straddle return of 5:1% is signi(cid:133)cant at the 1% level. 12 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 53,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "In conclusion, we (cid:133)nd a clear positive and highly signi(cid:133)cant relation between the slope of the volatility term structure and the cross section of straddle returns. Bootstrapped con(cid:133)dence interval and critical values con(cid:133)rm this relation. 4.2 Alphas of Portfolios from Coskewness and Cokurtosis Pricing Models We now regress the long-short straddle returns, portfolio 10 minus portfolio 1, on various linear pricing models. The linear pricing models are the Fama and French (1993) model, the Carhart (1997) model, and the coskewness and cokurtosis models developed by Vanden (2006). The coskewness model incorporates not only the market return and the square of the market return but also the option return, the square of the option return, and the product of the market and the option returns. Similarly, the cokurtosis model includes the cubes of the market return and the option return, as well as the product between the market return and the option return squared, and the product between the market return squared and the option return. The general version of the model is de(cid:133)ned as r = (cid:11) +(cid:12) (R R )+(cid:12) SMB +(cid:12) HML +(cid:12) UMD + (1) P;t P 1 m;t f;t 2 t 3 t 4 t (cid:0) (cid:12) (R R )+(cid:12) (R2 R )+(cid:12) (R2 R )+(cid:12) (R R R ) (2) 5 o;t (cid:0) f;t 6 m;t (cid:0) f;t 7 o;t (cid:0) f;t 8 o;t m;t (cid:0) f;t (cid:12) (R3 R )+(cid:12) (R3 R )+(cid:12) (R2 R R )+(cid:12) (R R2 R )(;3) 9 o;t (cid:0) f;t 10 m;t (cid:0) f;t 11 o;t m;t (cid:0) f;t 12 o;t m;t (cid:0) f;t where R is the market return, R is the market option return, R is the risk-free rate, m;t o;t f;t and SMB , HML , and UMD are the Fama-French and momentum factors at time t. This t t t equation embeds three factor models: the Fama-French-Carhart model (the (cid:133)rst line of the equation), the coskewness model (the market return on part of the (cid:133)rst line, and the second line), and the cokurtosis model (the market return on part of the (cid:133)rst line, and the second 13 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 53,
    "chunk_index": 23,
    "word_count": 357,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "three factor models: the Fama-French-Carhart model (the (cid:133)rst line of the equation), the coskewness model (the market return on part of the (cid:133)rst line, and the second line), and the cokurtosis model (the market return on part of the (cid:133)rst line, and the second 13 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 53,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "and third lines). For the market option return, we use the straddle return of the S&P 500.11 PanelCofTable2containstheresultsofthemodelregressionsforthelong-shortstraddle returns. The (cid:133)rst column presents the results of the Carhart (1997) model. The alpha is 5:6% with a t-statistic of 21:53. The coe¢ cient of the market factor R is negative and m signi(cid:133)cant. Hence, the long-short straddle portfolio provides a hedge against the market. The second and third columns present the results for the coskewness and cokurtosis factors. The alpha for the long-short straddle return is positive and signi(cid:133)cant for both models. The coe¢ cient of the S&P 500 straddle return, R R , is positive and signi(cid:133)cant o f (cid:0) for both models. The market factor reports a negative and signi(cid:133)cant coe¢ cient. In the fourth column, we regress the long-short straddle returns against all factors. The alpha is 5:4% with a signi(cid:133)cant t-statistic of 15:71. The market factor is negative and has the highest absolute t-statistic of 4:86. Given that the distribution of the long-short straddle portfolio is non-normal and that the standard errors inherit this non-normality, we compute the 95% con(cid:133)dence interval for the alpha using bootstrap. The bootstrap procedure implemented for the raw returns is extended to the regression model. Our original sample contains 837 weekly observations for the long-short straddle return, the market return, the market option return, the risk-free rate, and the Fama-French and momentum factors, where each observation is denoted by z = [r ;R ;R ;R ;SMB ;HML ;UMD ]: The observations z ;z ;::;z are resam- t P;t m;t o;t f;t t t t 1 2 837 pled with replacement b times, where b = 50;000. Each bootstrap sample, z ;z ;::;z , 1(cid:3)b 2(cid:3)b 8(cid:3)37b produces a set of bootstrap regression coe¢ cients b = [(cid:11) ;(cid:12) ]. From the 50;000 boot- (cid:3)b (cid:3)pb (cid:3)ib strapped alphas, (cid:11) , we extract the 2:5% and 97:5% percentiles to form the 95% bootstrap (cid:3)pb con(cid:133)dence interval.12 The 95% bootstrap con(cid:133)dence interval in all regressions con(cid:133)rms that 11Using other option strategies for the S&P 500 option return such as naked call, naked put, delta-hedged call or delta-hedged put, does not change the results. 12Bootstrapping the residuals does not change the conclusion. In this case, we estimate the regression with the original sample, r ;r ;::;r , to obtain 837 residuals \" ;\" ;::;\" and 837 observations P;1 P;2 P;837 1 2 837 r ;r ;::;r , where \" = r r : The residuals are bootstrapped b = 50;000 times to obtain \" = P;1 P;2 P;837 t P;t (cid:0) P;t (cid:3)b [\" ;\" ;::;\" ]. Then, we compute the bootstrapped straddle returns r =[r ;r ;::;r ], where (cid:3)1b (cid:3)2b (cid:3)837b P(cid:3);b P(cid:3);1b P(cid:3);2b P(cid:3);837b r =r +\" : The bootstrapped r are regressed on the (cid:133)xed [R ;R ;R ;SMB ;HML ;UMD ] bP(cid:3);tbb P;t b (cid:3)tb bP(cid:3);tb m;t o;t f;t t t t to get bootstrap regression coe¢ cients b = [(cid:11) ;(cid:12) ]: From the 50;000 bootstrapped alphas, we form the (cid:3)b (cid:3)p (cid:3)ib b 14 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 53,
    "chunk_index": 25,
    "word_count": 511,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "on the (cid:133)xed [R ;R ;R ;SMB ;HML ;UMD ] bP(cid:3);tbb P;t b (cid:3)tb bP(cid:3);tb m;t o;t f;t t t t to get bootstrap regression coe¢ cients b = [(cid:11) ;(cid:12) ]: From the 50;000 bootstrapped alphas, we form the (cid:3)b (cid:3)p (cid:3)ib b 14 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 53,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "the alpha is positive and signi(cid:133)cantly di⁄erent from zero. We conclude that the Carhart, coskewness and cokurtosis factor models that include the market return and the market option return do not explain the long-short straddle returns. The alphas for all models are of similar magnitude as the raw returns of the long-short straddleportfolioreportedinPanel Aof Table2. Themost important factors arethemarket and the S&P 500 straddle returns that report signi(cid:133)cant coe¢ cients in all regressions. 4.3 Volatility Measures, Higher Moments, Jump Risk, and the Slope of the Volatility Term Structure We now use the modi(cid:133)ed Fama and MacBeth (1973) regressions proposed by Brennan, Chordia, and Subrahmanyam (1998) and two-way sorts to con(cid:133)rm that the slope of the volatility term structure is positively related with straddle returns in the cross section. Weestimatethemodi(cid:133)edtwo-stageFamaandMacBeth(1973)regressions. Anadvantage of the standard Fama and MacBeth (1973) regression is that it does not impose breakpoints for portfolio formation but allows for an evaluation of the interaction among variables and the slope of the volatility term structure. The modi(cid:133)ed regression proposed by Brennan, Chordia, andSubrahmanyam(1998)correctsfortheerrorinvariablesproblemandisde(cid:133)ned as r (cid:12) F = (cid:13) +(cid:13) Z +\" (4) i;t (cid:0) i t 0;t 00;t i;t (cid:0) 1 i;t b where r is the straddle return in excess of the risk free rate for each security i at time i;t t, F are the Fama-French-Carhart, coskewness and cokurtosis factors, and Z are the t i;t 1 (cid:0) characteristics for each stock i at time t 1. The (cid:12) are estimated in the (cid:133)rst stage for each i (cid:0) stock i using the entire sample. In the second stage, for each week t, a regression is run with b the option return and the factors on the left hand side and the slope of the volatility term 95% bootstrap con(cid:133)dence interval. 15 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 53,
    "chunk_index": 27,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "i (cid:0) stock i using the entire sample. In the second stage, for each week t, a regression is run with b the option return and the factors on the left hand side and the slope of the volatility term 95% bootstrap con(cid:133)dence interval. 15 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 53,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "structure along with other variables on the right hand side. From stage two, we obtain a time series of t coe¢ cients that are averaged in the third stage to obtain an estimator for each coe¢ cient. We evaluate the coe¢ cient(cid:146)s signi(cid:133)cance using the Newey-West t-statistic with 3 lags.13 [ Insert Table 3 here ] We control for volatility risk premium (RV IV ), investor misreaction to volatility 1M 1M (cid:0) changes (IVavg IV and IVmax IV ), option anomalies (HV IV ), risk neutral 1M (cid:0) 1M 1M (cid:0) 1M (cid:0) 1M moments (Volatility, skewness, and kurtosis), and risk neutral jump (as in Yan (2011)). We only use the most relevant control variables given that the results remain unchanged for the other ones. The results for the remaining control variables are reported in the Internet Appendix.14 Table 3 reports the regression results of the risk adjusted straddle returns on the slope of the volatility term structure and selected control variables. The (cid:133)rst column presents the result of the regression of the straddle return on the slope of the volatility term structure. The coe¢ cient associated with the slope of the volatility term structure is 0:217 with a Newey-West t-statistic of 15:56, con(cid:133)rming the positive and signi(cid:133)cant relation between the slope of the volatility term structure and future straddle returns. In column two to (cid:133)ve, we add HV, RV , IVavg, and IVmax (minus IV ), and the coe¢ cient of the slope 1M 1M 1M 1M of the volatility term structure remains unchanged. Adding the risk neutral moments and risk neutral jump in column six con(cid:133)rms the results. The most important (cid:133)nding is that the slope of the volatility term structure outperforms each individual measure of volatility (minus IV1M) in explaining future straddle returns. 13Our results remain qualitatively the same when the number of lags in the Newey-West estimator takes alternative values from 0 to 15. 14To control for the volatility risk premium, we also use realized volatility over 1-day and 1-week. To control for volatility misreaction we also use the 1-month, 3-month, and 6-month lagged volatility. We also include idiosyncratic volatility since Cao and Han (2013) (cid:133)nd that it is related to delta-hedged call returns. Tables IA.2 and IA.3 in the Internet Appendix contain the results for the modi(cid:133)ed Fama and MacBeth (1973) regressions and the two-way sorts, respectively. 16 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 53,
    "chunk_index": 29,
    "word_count": 398,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "volatility. We also include idiosyncratic volatility since Cao and Han (2013) (cid:133)nd that it is related to delta-hedged call returns. Tables IA.2 and IA.3 in the Internet Appendix contain the results for the modi(cid:133)ed Fama and MacBeth (1973) regressions and the two-way sorts, respectively. 16 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 53,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "We report the 95% con(cid:133)dence interval for the coe¢ cient of the slope of the volatility term structure using bootstrap. The bootstrap procedure implemented for the regression model is extended to the modi(cid:133)ed Fama-MacBeth regression. Our original sample contains observations, z = [r (cid:12) F ;Z ], for individual stock i over week t. The observations i;t i;t i t i;t 1 (cid:0) (cid:0) [z ;::;z ;z ;::;z ;::;z ;::;z ] are resampled with replacement b times within 1;1 n1;1 1;2 n1;2 b1;837 n837;837 each week t, where b = 50;000 and t = 837. We assume that each weekt contains n t stocks. For each bootstrap sample, [z ;::;z ;z ;::;z ;::;z ;::;z ], we run 1(cid:3);1b n(cid:3) 1;1b 1(cid:3);2b n(cid:3) 2;2b 1(cid:3);837b n(cid:3) 837;837b the modi(cid:133)ed Fama-MacBeth regression to produce a set of bootstrap regression coe¢ cients (cid:13) . From the 50;000 bootstrapped coe¢ cients, we extract the 2:5% and 97:5% percentiles (cid:3)0;b to form the 95% bootstrap con(cid:133)dence interval. We (cid:133)nd that the 95% bootstrap con(cid:133)dence interval for the coe¢ cient of the slope of the volatility termstructure is positive and di⁄erent from zero for all regressions. [ Insert Table 4 here ] To ensure that the slope of the volatility term structure is related with straddle returns, we implement the double sorting methodology. With the two-way sorts, we can examine whether the cross-sectional variation in returns holds across di⁄erent levels of the control variables. In the (cid:133)rst stage, we rank the stocks by the (cid:133)rm characteristic and form (cid:133)ve portfolios. Portfolio 1 (5) has stocks with low (high) values of the characteristic. In the second stage, we sort the stocks into (cid:133)ve portfolios using the slope of the volatility term structure within each (cid:133)rm characteristic portfolio. Then, we compute the average option return for each level of the slope of the volatility term structure and also report the long- short option return. Table 4 reports quintile straddle returns, the long-short option returns, its95%bootstrapcon(cid:133)denceinterval,andthet-statisticsforeachcharacteristic. Allthelong- short straddle returns are positive and signi(cid:133)cant. The 95% bootstrap con(cid:133)dence intervals con(cid:133)rm this conclusion. The long-short straddle returns are between 2:2% and 3:51%; while the t-statistics are between 12:48 and 21:48. 17 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 53,
    "chunk_index": 31,
    "word_count": 366,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 4 reports quintile straddle returns, the long-short option returns, its95%bootstrapcon(cid:133)denceinterval,andthet-statisticsforeachcharacteristic. Allthelong- short straddle returns are positive and signi(cid:133)cant. The 95% bootstrap con(cid:133)dence intervals con(cid:133)rm this conclusion. The long-short straddle returns are between 2:2% and 3:51%; while the t-statistics are between 12:48 and 21:48. 17 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 53,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Using modi(cid:133)ed Fama-MacBeth regressions and two-way sorts, we conclude that the slope of the volatility term structure predicts straddle returns over and above the volatility risk premium, investor misreaction to volatility changes, option anomalies, risk neutral moments, and risk neutral jump. We now explore the source of this predictability. 4.4 Exploring the Source of Predictability In the previous section, we document that the slope of the volatility term structure is related withfuturestraddlereturns. Inaddition,we(cid:133)ndthatothervolatilitymeasures(minusIV ) 1M are also related with straddle returns. In this section, we explore the source of predictability of straddle returns. The straddle is a trading strategy to buy or sell volatility. Positive (negative) straddle returns are generated when the volatility over one week (FV), de(cid:133)ned as the standard deviation of the underlying stock return, is greater (lower) than the implied volatility over the same period of time. Since the options are (on average) 5 weeks away from maturity, the implied volatility of the option (IV ) contains information of the future volatility over 1M the following week and the remaining 4 weeks. We explore whether implied volatility (IV ) and future volatility (FV) are related with 1M straddle returns with an in-sample exercise. We form ten straddle portfolios based on the di⁄erence between future volatility (FV) and short-term implied volatility, FV IV , and 1M (cid:0) examine contemporaneous straddle returns. Sorting by FV IV produces a long-short 1M (cid:0) weekly straddle return of 21:4% with a t-statistic of 60:36 as reported on Table IA.1 in the Internet Appendix. This result shows that straddle returns are closely related with the spread between future realized volatility and short-term implied volatility, FV IV . 1M (cid:0) We now explore whether the slope of the volatility term structure and other volatility measures can predict future realized volatility minus current implied volatility, FV IV . 1M (cid:0) Following the analysis of Cao, Yu, and Zhong (2010), we perform time-series regressions of the di⁄erence between future realized volatility minus implied volatility on several volatility 18 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 53,
    "chunk_index": 33,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "and other volatility measures can predict future realized volatility minus current implied volatility, FV IV . 1M (cid:0) Following the analysis of Cao, Yu, and Zhong (2010), we perform time-series regressions of the di⁄erence between future realized volatility minus implied volatility on several volatility 18 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 53,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "measures minus IV . Each week, we perform the following regression: 1M FV IV = B +B (IV IV )+B (Volatility Measures IV )+\" : i;t (cid:0) 1Mi;t 0;t 1;t LTi;t (cid:0) 1Mi;t k;t k;t (cid:0) 1Mi;t i;t We run the two stage Fama and MacBeth (1973) regression. In the (cid:133)rst stage, we run the regression for every week. In the second stage, we obtain the average for each regressor. To account for autocorrelation and heteroscedasticity, we evaluate the signi(cid:133)cance of the regressor with the Newey-West t-statistic with 3 lags. [ Insert Table 5 here ] In addition to the slope of the volatility term structure, we include volatility measures related to option anomalies, the volatility risk premium, and volatility overreaction. For the volatility risk premium, we include the one-day, one-week and one-month realized volatility measures since Corsi (2009) and Busch, Christensen, and Nielsen (2011) show that they are good predictors of future volatility. InTable5,weonlyreportthemostrelevantvolatilitymeasures: IV IV ,HV IV , LT 1M 1M (cid:0) (cid:0) RV IV ,IVt 6 IV ;IVavg IV ,andIVmax IV . Theresultsremainunchanged 1M (cid:0) 1M 1M(cid:0) (cid:0) 1M 1M (cid:0) 1M 1M (cid:0) 1M for the other volatility measures (RV , RV , IVt 1, IVt 3, and IdioVol) and are therefore 1d 1w 1M(cid:0) 1M(cid:0) reported in Table IA.4 of the Internet Appendix. Table 5 summarizes the results for seven regressions. We report the average coe¢ cients, their t-statistics, and the percentage of times that the coe¢ cients are signi(cid:133)cant. In the (cid:133)rst univariate regression the coe¢ cient of the slope of the volatility term structure is 0:217 with aNewey-Westt-statisticof7:79. Inaddition, thiscoe¢ cientisstatisticallysigni(cid:133)cant42% of the time. In columns 2 to 6, we run bivariate regressions between the slope of the volatility term structure and one alternative volatility factor at a time. The coe¢ cient associated with the slope of the volatility term structure ranges from 0:092 to 0:259, and the Newey- West t-statistic is above 3:25 for all regressions. The coe¢ cient of most volatility measures (HV IV , RV IV , and IVt 6 IV ) is also positive and signi(cid:133)cant. Finally, the (cid:0) 1M 1M (cid:0) 1M 1M(cid:0) (cid:0) 1M 19 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 53,
    "chunk_index": 35,
    "word_count": 363,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "and the Newey- West t-statistic is above 3:25 for all regressions. The coe¢ cient of most volatility measures (HV IV , RV IV , and IVt 6 IV ) is also positive and signi(cid:133)cant. Finally, the (cid:0) 1M 1M (cid:0) 1M 1M(cid:0) (cid:0) 1M 19 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 53,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "multivariate regression in column 7 con(cid:133)rms the positive relation between the slope of the volatility term structure and future volatility. We conclude that the slope of the volatility term structure is related with future straddle returns because of its ability to predict future volatility (minus IV ). However, the slope 1M of the volatility term structure is not a perfect predictor of future volatility (minus IV ). 1M Most of the other volatility measures also explain future realized volatility. 4.5 Alternative Forecast Horizons Thus far the empirical analysis has been based on one-week straddle returns. In this section we study two-week, three-week, and one-month holding periods. Two-week option returns are constructed like the one-week returns. Three-week and one-month options returns are constructed with options that are three weeks and one month away from expiration and are held until maturity. One-month options are available on the second trading day (usually a Tuesday) after the expiration of the previous one-month options, which occurs on the Saturday following the third Friday of the month. [ Insert Table 6 here ] Table6containstheresultsforthetwo-week,three-week,andone-monthstraddlereturns. We report the average straddle returns of decile portfolios, the long-short return, their t- statistic, standard deviation, skewness and kurtosis. For all holding horizons, the long-short straddle return is positive and signi(cid:133)cant. Given that the long-short returns are highly non- normal, we compute 95% bootstrap con(cid:133)dence intervals similar to the one in Panel A of Table 2. The 95% bootstrap con(cid:133)dence intervals con(cid:133)rm that the two-week, three-week, and one-month long-short returns are positive and signi(cid:133)cant. Thestrongpositiverelationbetweentheslopeofthevolatilitytermstructureandstraddle returns documented in Table 2 is con(cid:133)rmed for the two-week, three-week, and one-month return horizons. 20 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 53,
    "chunk_index": 37,
    "word_count": 275,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "similar to the one in Panel A of Table 2. The 95% bootstrap con(cid:133)dence intervals con(cid:133)rm that the two-week, three-week, and one-month long-short returns are positive and signi(cid:133)cant. Thestrongpositiverelationbetweentheslopeofthevolatilitytermstructureandstraddle returns documented in Table 2 is con(cid:133)rmed for the two-week, three-week, and one-month return horizons. 20 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil-",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 53,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "3.2 Characteristics of Portfolios Sorted by the Slope of the Volatil- (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "The results presented so far do not include trading frictions. We investigate the impact on the long-short straddle returns of two types of trading frictions: bid-ask spreads and margin requirements. In Panel A of Table 1, we report an average bid-to-mid percent spread for option prices of 5:8% and 7:1% for portfolios 1 and 10. Hence, the bid-ask spreads will eliminate the one-week long-short straddle return of 5:1%. For this reason we assess the impact of transaction costs on the one-month straddle returns. The long-short one-month straddle return of 16:5% and the fact that options are held until maturity might mitigate the impact of the bid-ask spread. When the one-month option expire, the payo⁄for the option is based only on the stock price and the strike price. If the option expires in-the-money, the stock incurs transaction costs.15 Financial research has reported that the e⁄ective-to-quoted spread ratio is lower than 50% (De Fontnouvelle, Fisher, and Harris (2003) and Mayhew (2002)), but in some cases it can be as large as 100% (Battalio, Hatch, and Jennings (2004)). Recent work by Muravyev andPearson(2014)showsthataverageinvestorsandalgorithmictradersexecutetheirtrades at an e⁄ective-to-quoted spread ratio of 50% and 12:5% based on daily closing quotes. An e⁄ective-to-quoted spread ratio of 50% (12:5%) is equivalent to paying half (one-eighth) the bid-ask quoted spread when executing the option trading strategy. [ Insert Table 7 here ] Panel A of Table 7 reports the long-short one-month straddle returns for e⁄ective-to- quoted spread ratios of 25%, 50%, 75%; and 100% across quartiles portfolios formed on bid-ask spread. Quartile 1 (Q1) contains straddles with the smallest quoted bid-ask spread andquartile4(Q4)containsstraddleswiththehighestquotedbid-askspread. The(cid:133)rstthree quartile portfolios (Q1, Q2 and Q3) report a positive and signi(cid:133)cant return for all e⁄ective- to-quoted spread ratios (Q2 is not signi(cid:133)cant when the ratio is 100%). For example, the 15For stocks, bid and ask quotes are obtained from the CRSP database. 21 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 53,
    "chunk_index": 39,
    "word_count": 313,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "andquartile4(Q4)containsstraddleswiththehighestquotedbid-askspread. The(cid:133)rstthree quartile portfolios (Q1, Q2 and Q3) report a positive and signi(cid:133)cant return for all e⁄ective- to-quoted spread ratios (Q2 is not signi(cid:133)cant when the ratio is 100%). For example, the 15For stocks, bid and ask quotes are obtained from the CRSP database. 21 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 53,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "portfolio with the lowest bid-ask spread (Q1) reports a long-short straddle return of 16:7% with a t-statistic of 4:88 when the e⁄ective-to-quoted spread ratio is 25%. The combined portfolio of Q1 and Q2, or Q1, Q2 and Q3 also reports positive and signi(cid:133)cant returns for all ratios. The long-short straddle return for Q1, Q2 and Q3 is 6:8% with a t-statistic of 3:72 when the e⁄ective-to-quoted spread ratio is 100%. The results are similar for the portfolio that trades Q1 and Q2 simultaneously. The portfolio with the highest bid-ask spreads, Q4, reports a signi(cid:133)cant return of 8:7% with a t-statistic of 2:98 when the transaction can be executed at an e⁄ective-to-quoted spread ratio of 25%. However, for a ratio of 50% the long-short return is positive but not signi(cid:133)cant, and turns negative for ratios of 75% and 100%. Finally, the long-short straddle return for the entire sample is positive and signi(cid:133)cant when the e⁄ective-to-quoted spread ratio is lower or equal to 75%. When the ratio is 75%, the long-short straddle return is 6:5% with a t-statistic of 3:91, compared with a return of 16:5% when trading at mid prices. We now turn to the second type of trading friction: margin requirements. Saretto and Santa-Clara (2009) document that margin requirements can be very high when shorting options. Given that the long-short trading strategy involves a short position on straddles for portfolio 1, an investor must open and maintain a margin account. The initial margin requirement is the amount needed to open a position. Afterwards and until the position is closed, a maintenance margin is computed on a daily basis to maintain the position open. When the maintenance margin is greater than the initial margin requirement, the exchange issues a margin call and the investor has to increase the margin or close out the position. We compute the margin haircut ratio for Portfolio 1 as proposed by Saretto and Santa- Clara (2009). The margin haircut ratio is the amount of required margin that exceeds the price at which the straddle was written. The haircut ratio is equal to (M V )=V , where t 0 0 (cid:0) M is the margin at the end of each day t, and V is equal to the proceeds received at the t 0 beginning of the trade for the straddle. To compute the margin requirements, we follow the CBOE Margin Manual methodology. Speci(cid:133)cally, for a straddle, the margin requirement at 22 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 53,
    "chunk_index": 41,
    "word_count": 411,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "end of each day t, and V is equal to the proceeds received at the t 0 beginning of the trade for the straddle. To compute the margin requirements, we follow the CBOE Margin Manual methodology. Speci(cid:133)cally, for a straddle, the margin requirement at 22 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 53,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "time t is equal to the maximum of the call or put margin plus the option proceeds of the other side. The call and put margins are de(cid:133)ned as Call Margin: M = max(c +(cid:11)S max(K S ;0);c +(cid:12)S ) and t t t t t t (cid:0) (cid:0) Put Margin: M = max(p +(cid:11)S max(S K;0);p +(cid:12)K), t t t t t (cid:0) (cid:0) where c and p are the call and put option prices at time t, S is the underlying stock price t t t at time t, K is the strike price of the options, and (cid:11) = 20% and (cid:12) = 10% as speci(cid:133)ed in the CBOE Margin Manual. Panel B of Table 7 reports descriptive statistics for the haircut ratio and the percentage of wealth that must be used for margin requirements given the haircut ratio. On average, an investor must deposit $1:54 in the margin account (in addition to the proceeds from the straddle sale) for every dollar received from writing straddles. The maximum historical haircut ratio for portfolio 1 is $4:41 and the minimum is 23 cents. The inverse of the haircut ratio gives the percentage of wealth to be allocated to the margin account. An investor must allocate on average 35% of his wealth, and up to a maximum of 77%; when shorting portfolio 1. This analysis applies to individual investors since we used CBOE rules. Saretto and Santa-Clara (2009) show that the margin cost to write straddles is about three times lower for institutional investors than for individual investor. Since large (cid:133)rms can dedicate enough cash for margin, the implementation of the long-short strategy should possible. We conclude that in most cases the long-short one-month straddle returns are positive and signi(cid:133)cant after transaction costs. To pro(cid:133)t from the long-short straddle strategy, an investor should trade the options in the lowest 75 percentile bid-ask spreads paying special attentiontoexecute the trades withinthe quotedbid-askspread. Additionally, anindividual investor must allocate on average 35% of his wealth to maintain the margin account of the short side of the portfolio. 23 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 53,
    "chunk_index": 43,
    "word_count": 350,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "strategy, an investor should trade the options in the lowest 75 percentile bid-ask spreads paying special attentiontoexecute the trades withinthe quotedbid-askspread. Additionally, anindividual investor must allocate on average 35% of his wealth to maintain the margin account of the short side of the portfolio. 23 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.6 Transaction Costs",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 53,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.6 Transaction Costs (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "We now explore potential explanations of our results. We provide evidence that links our results with risk-based and behavioral explanations. The large straddle return di⁄erential across decile portfolios might be compensating in- vestors for some risk. In the (cid:133)rst test, we compute standard risk measures for each decile portfolio. If straddle returns are explained by risk, higher levels of risk should translate into higher returns. Table IA.6 in the Internet Appendix reports, for each decile portfolio, the value-at-risk and the expected shortfall at the 5 percent level using historical weekly straddle returns. We (cid:133)nd that portfolio 1, the one with the lowest return, is riskier than portfolio 10, the one with the highest return using both risk measures. However, the volatility, skewness, and kurtosis across portfolios provide a di⁄erent picture. As reported in Panel A of Table 2, portfolio 1 has the lowest volatility, skewness, and kurtosis across all portfolios, and portfo- lio 10 has the highest volatility. Therefore, value-at-risk and expected shortfall are mainly driven by the average return of the portfolio. Given that transaction costs reduce the returns of all portfolios, higher moments become more important to assess their risk. We conclude that there is mixed evidence that standard risk measures explain our results. A second risk-based explanation is that the slope of the volatility term structure is measuring the volatility risk premium. We de(cid:133)ne the ex-post volatility risk premium as FV IV following Carr and Wu (2008). According to Panel B of Table 1, the correlation 1M (cid:0) between the slope of the volatility term structure and the ex-post volatility risk premium is 3:0%, and the correlation with the ex-ante volatility risk premium, RV IV , is 17:6%. 1M 1M (cid:0) (cid:0) These correlations indicate a weak relation between the slope of the volatility term structure and the volatility risk premium. However, the two measures are good predictors of the long-short straddle returns. An in-sample exercise where we sort by FV IV produces a long-short weekly straddle return 1M (cid:0) of21:4% withat-statisticof60:36 (seePanelBofTableIA.1intheInternetAppendix). The correlation between these long-short straddle returns and the ones sorted by the volatility 24 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 53,
    "chunk_index": 45,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "two measures are good predictors of the long-short straddle returns. An in-sample exercise where we sort by FV IV produces a long-short weekly straddle return 1M (cid:0) of21:4% withat-statisticof60:36 (seePanelBofTableIA.1intheInternetAppendix). The correlation between these long-short straddle returns and the ones sorted by the volatility 24 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 53,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "risk premium is 92%. This large correlation and the fact that the slope of the volatility term structure is a good predictor of the ex-post volatility risk premium (see Table 5) indicate that both measures might be measuring something similar. Overall, we (cid:133)nd mixed evidence that the slope of the volatility term structure is measuring the volatility risk premium. Finally, we provide a behavioral based explanation: volatility over-reaction. Poteshman (2001) and Stein (1989) document that investors can under- or over-react to changes in short-term volatility. Investor under- and over-reaction to current events is supported by models of investor sentiment such as the ones proposed by Barberis, Shleifer, and Vishny (1998) and Daniel, Hirshleifer, and Subrahmanyam (1998), and by demand pressures of the type studied by Garleanu, Pedersen, and Poteshman (2009). We examine several measures of volatility over-reaction following Cao and Han (2013): IVt 1 IV ; IVt 3 IV , IVt 6 IV , and IVavg IV . Given that volatility is 1M(cid:0) (cid:0) 1M 1M(cid:0) (cid:0) 1M 1M(cid:0) (cid:0) 1M 1M (cid:0) 1M mean reverting, a measure such as IVavg IV captures deviations of current implied 1M (cid:0) 1M volatility from its historical average. A positive (negative) value of IVavg IV means 1M (cid:0) 1M that current volatility has under-reacted (over-reacted) compared to its historical average and such options are potentially underpriced (overpriced). According to Panel A of Table 1, the magnitude of the slope of the volatility term structure and the measures of volatil- ity overreaction is very similar across portfolios ranked by the slope of the volatility term structure. For example, the slope of the volatility term structure is 13:4%, 1:7%, and (cid:0) (cid:0) 5:6% for portfolios 1, 5 and 10, while IVavg IV is 6:9%, 0:1%, and 4:3% for the same 1M (cid:0) 1M (cid:0) (cid:0) portfolios. The correlation matrix on Panel B of Table 1 reports a high correlation (ranging from 51:4% to 57:8%) between the slope of the volatility term structure and the measures of volatility misreaction. The correlation among the four measures of volatility over-reaction is between 34:8% and 80:9%. This evidence tentatively supports an under- and over-reaction explanation of our results. 25 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 53,
    "chunk_index": 47,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "from 51:4% to 57:8%) between the slope of the volatility term structure and the measures of volatility misreaction. The correlation among the four measures of volatility over-reaction is between 34:8% and 80:9%. This evidence tentatively supports an under- and over-reaction explanation of our results. 25 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 53,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "5 Robustness Analysis Inthissection, wechecktherobustnessoftherelationbetweentheslopeofthevolatilityterm structure and straddle returns. First, we check that the results are robust to di⁄erent (cid:133)rm characteristicssuchasoptionilliquidity,size,book-to-market,historicalhighermoments,and option greeks. Second, we investigate the robustness of the results for di⁄erent subgroups of the data, and for di⁄erent de(cid:133)nitions of the (cid:133)lters and input variables. Since the results presented do not change the conclusions of the paper, we describe them in this section and report the tables in the Internet Appendix. 5.1 Controlling for Alternative Measures of Jump Risk In Section 4.3, we showed that the positive relation between the slope of the volatility term structure and future straddle returns is robust to jump risk as de(cid:133)ned by Yan (2011). We now investigate the robustness of our results to three additional measures of jump risk. The (cid:133)rst proxy for jump risk is the slope of the volatility smile, OptionSkew, de(cid:133)ned as the di⁄erence between out-of-the-money and at-the-money volatilities by Xing, Zhang and Zhao (2010). The other two proxies are the model-free left tail (RNJump Left) and right tail (RNJump Right) risk-neutral jump measures derived by Bollerslev and Todorov (2011). Table IA.2 in the Internet Appendix reports the modi(cid:133)ed Fama and MacBeth (1973) re- gression proposed by Brennan, Chordia, and Subrahmanyam (1998) with the three measures of jump risk. The coe¢ cient of the slope of the volatility term structure remains positive and signi(cid:133)cant. Table IA.3 in the Internet Appendix reports two-way sorts for the jump risk measures and the slope of the volatility term structure. The conclusions are con(cid:133)rmed. 5.2 Controlling for Stock Characteristics Table IA.2 in the Internet Appendix reports the results of the modi(cid:133)ed Fama and MacBeth (1973) regressions proposed by Brennan, Chordia, and Subrahmanyam (1998) of straddle 26 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 53,
    "chunk_index": 49,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "measures and the slope of the volatility term structure. The conclusions are con(cid:133)rmed. 5.2 Controlling for Stock Characteristics Table IA.2 in the Internet Appendix reports the results of the modi(cid:133)ed Fama and MacBeth (1973) regressions proposed by Brennan, Chordia, and Subrahmanyam (1998) of straddle 26 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 53,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "returns on (cid:133)rm characteristics. In addition to the slope of the term structure, the regression includes the option volume (in dollars and in contracts), option open interest, option bid-to- mid spread, size of the (cid:133)rm, book-to-market, and historical volatility, skewness and kurtosis. The coe¢ cient of the slope of the volatility term structure is positive and signi(cid:133)cant for all regressions. The slope of the volatility term structure e⁄ect is not explained by option liquidity or historical moments. Table IA.3 in the Internet Appendix reports the long-short straddle returns and the t-statistics for each (cid:133)rm characteristic using the two-way sort methodology. All of the long- short straddle returns are positive and signi(cid:133)cant. We conclude that the slope of the volatility term structure is not a proxy for option illiquidity or (cid:133)rm characteristics such as size, book to market, or historical moments. 5.3 Moneyness In our study, the moneyness level for call and put options is between 0:95 and 1:05. Table IA.5 in the Internet Appendix shows that when the moneyness bounds are changed to 0:975 and 1:025; the long-short straddle return remains positive and signi(cid:133)cant. In this case, the number of stocks decreases from 486 to 309. If the moneyness is not bounded, the number of stocks per week increases from 486 to 680; and the magnitude of the straddle returns and the t-statistics remains very similar to those reported in the primary analysis. 5.4 Sub-samples We divide the sample into two sub-periods: 1996 to 2003 and 2004 to 2012. The long-short straddle return decreases from the (cid:133)rst to the second period as reported in Table IA.5 in the Internet Appendix. The decrease in option returns from the (cid:133)rst to the second sub-period is compensated by a decrease in trading costs as reported by De Fontnouvelle, Fisher, and Harris (2003), Battalio, Hatch, and Jennings (2004), and Hansch and Hatheway (2001). Next, we ensure that the triple witching Friday is not driving the results. The triple 27 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 53,
    "chunk_index": 51,
    "word_count": 330,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "second sub-period is compensated by a decrease in trading costs as reported by De Fontnouvelle, Fisher, and Harris (2003), Battalio, Hatch, and Jennings (2004), and Hansch and Hatheway (2001). Next, we ensure that the triple witching Friday is not driving the results. The triple 27 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 53,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "witching Friday refers to the third Friday of every March, June, September, and December when three di⁄erent types of securities expire on the same day: stock index futures, stock index options and stock options. Since the market is particularly active in these months, we divide the sample into two groups: options that expire on the triple witching-Friday and options that expire in any other month. Table IA.5 in the Internet Appendix shows that results are robust for the two groups. We also control for the January e⁄ect that causes stock prices to increase during that month. Option returns in the month of January are compared to those for the rest of the year. The results are not driven by the January e⁄ect. In conclusion, the relation between the slope of the volatility term structure and the long-short straddle return holds for di⁄erent sub-samples. 5.5 Arbitrage Bounds Options that violate arbitrage bounds are excluded from the analysis. Duarte and Jones (2007) note that options that violate arbitrage bounds might be valid options that, at some point in time, have their prices below intrinsic value making it impossible to solve for an implied volatility. To account for this bias and to include as many options as possible, we relax the (cid:133)lters. First, all options with a positive volume are included even if they do not have an implied volatility. Since some options do not have volatility, we now extract all of the implied volatilities from the standardized OptionMetrics Volatility Surface database. IV and IV are de(cid:133)ned as the average implied volatility of the call and put options with 1M LT 30 and 365 days to expiration, and an absolute delta of 0:5. All the other (cid:133)lters are applied: positive bid-ask spread, volatility between 3% and 200%, moneyness between 0:95 and 1:05, and underlying price above $5. Theresultsarerobusttotheinclusionofoptionsthatviolatearbitrageboundsasreported in Table IA.5 in the Internet Appendix. Options that violate arbitrage bounds only account for 0:6% of the sample data. 28 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 53,
    "chunk_index": 53,
    "word_count": 331,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "the other (cid:133)lters are applied: positive bid-ask spread, volatility between 3% and 200%, moneyness between 0:95 and 1:05, and underlying price above $5. Theresultsarerobusttotheinclusionofoptionsthatviolatearbitrageboundsasreported in Table IA.5 in the Internet Appendix. Options that violate arbitrage bounds only account for 0:6% of the sample data. 28 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "4.7 Possible Explanations",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 53,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "4.7 Possible Explanations (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Dubinsky and Johannes (2005) report that earnings announcements enhance the uncertainty of a company, de(cid:133)ned as the implied volatility. Volatility increases before earnings are announced and decreases after the announcement. To con(cid:133)rm that the returns occur in periods other than the earnings announcement periods, we exclude all (cid:133)rms that have an earnings announcement date that falls within the week that the options are included in the analysis. As reported on Table IA.5 in the Internet Appendix, the long-short straddle returns are positive and signi(cid:133)cant, and the magnitude is larger for (cid:133)rms with earnings announcements than for (cid:133)rms not making an announcement. Therefore, the long-short straddle returns are robust to earnings announcements. 5.7 Controlling for Weighting Schemes In the primary analysis, the portfolios are equally weighted. We now explore the robustness of the results for two di⁄erent weighting schemes. First, we study value-weighted portfolios which are based on the option dollar volume for each stock. Second, straddles portfolios are weighted by the minimum dollar value of the volume or the open interest between the put and the call. With the new weighting schemes, the long-short straddle returns are signi(cid:133)cant and of the same magnitude as the original returns. As shown in Table IA.5 in the Internet Appendix, the results are robust to the weighting methodology. 5.8 Alternative De(cid:133)nitions for the Slope of the Volatility Term Structure In the main analysis, the slope of the volatility term structure is de(cid:133)ned as the di⁄erence be- tween the long-term implied volatility minus the one-month implied volatility. The maturity of the long-term implied volatility can arbitrarily range from 2 to 12 months depending on the availability of long-term options. We now study the robustness of the results to di⁄erent 29 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "5.6 Earnings Announcements",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 53,
    "chunk_index": 55,
    "word_count": 290,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.6 Earnings Announcements (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "di⁄erence be- tween the long-term implied volatility minus the one-month implied volatility. The maturity of the long-term implied volatility can arbitrarily range from 2 to 12 months depending on the availability of long-term options. We now study the robustness of the results to di⁄erent 29 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "5.6 Earnings Announcements",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 53,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.6 Earnings Announcements (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "de(cid:133)nitions of the slope of the volatility term structure where the long-term maturity is (cid:133)xed at 3-months, 6-months and 9-months. As shown in Table IA.5 in the Internet Appendix, the long-short straddle returns for the 3-month, 6-month and 9-month de(cid:133)nitions of the slope of the volatility term structure are positive and signi(cid:133)cant. We conclude that the de(cid:133)nition of the slope of the volatility term structure does not change the results. 6 Conclusions This paper documents a positive relation between the slope of the implied volatility term structure and straddle returns in the cross section. The slope of the volatility term structure isde(cid:133)nedasthedi⁄erencebetweenimpliedvolatilitiesoflong-andshort-datedat-the-money options. Every week, we rank stocks according to the slope of the volatility term structure and study subsequent one week straddle returns. We (cid:133)nd that as the slope of the volatility term structure increases, so does the one-week future straddle return. The straddle portfolio with the highest slope of the volatility term structure outperforms the portfolio with the lowest slope by a signi(cid:133)cant 5:1% per week. Thelargeabnormalreturnsholdfordi⁄erenttimeperiods,alternativehorizons,weighting schemes, and for options that violate arbitrage bounds. Fama-MacBeth regressions of the type proposed by Brennan, Chordia, and Subrahmanyam (1998) and double sorts con(cid:133)rm the predictive power of the slope of the volatility term structure. The abnormal straddle returns are not explained by the Fama-French-Carhart factors, option factors, jump risk, or (cid:133)rm characteristics. Transaction costs, namely bid-ask spreads, reduce the straddle monthly pro(cid:133)ts. However, positive and signi(cid:133)cant returns can be generated when trading within the bid-ask spread options in the lowest 75 percentile of the quoted bid-ask spread. 30 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "5.6 Earnings Announcements",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 53,
    "chunk_index": 57,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.6 Earnings Announcements (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Fama-French-Carhart factors, option factors, jump risk, or (cid:133)rm characteristics. Transaction costs, namely bid-ask spreads, reduce the straddle monthly pro(cid:133)ts. However, positive and signi(cid:133)cant returns can be generated when trading within the bid-ask spread options in the lowest 75 percentile of the quoted bid-ask spread. 30 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "5.6 Earnings Announcements",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 53,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "5.6 Earnings Announcements (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Bakshi, G., Kapadia, N., 2003. Delta-Hedged Gains and the Negative Market Volatility Risk Premium, Review of Financial Studies 16, 527-566. Bakshi, G., Kapadia, N., Madan, D., 2003. Stock Return Characteristics, Skew Laws, and the Di⁄erential Pricing of Individual Equity Options, Review of Financial Studies 16, 101-143. Bakshi, G., Panayotov, G., Skoulakis, G., 2011. Improving the Predictability of Real Eco- nomic Activity and Asset Returns with Forward Variances Inferred from Option Portfo- lios, Journal of Financial Economics 100, 475-495. Bali, T., Murray, S., 2013. Does Risk-Neutral Skewness Predict the Cross-Section of Equity OptionPortfolioReturns?, JournalofFinancialandQuantitativeAnalysis48, 1145-1171. Barberis, N., Shleifer, A., Vishny, R., 1998. A Model of Investor Sentiment, Journal of Financial Economics 49, 307-343. Battalio, R., Hatch, B., Jennings, R., 2004. Toward a National Market System for US Exchange-Listed Equity Options, Journal of Finance 59, 933-962. Black, F., Scholes, M., 1972. The Valuation of Option Contracts and a Test of Market E¢ ciency, Journal of Finance 27, 399-417. Bollen, N., Whaley, R. E., 2004. Does Net Buying Pressure A⁄ect the Shape of Implied Volatility Functions?, Journal of Finance 59, 711-753. Bollerslev, T., Tauchen, G., Zhou, H., 2009. Expected Stock Returns and Variance Risk Premia, Review of Financial Studies 22, 4463-4492. Bollerslev, T., Todorov, V., 2011. Tails, Fears, and Risk Premia. Journal of Finance 66, 2165(cid:150)2211. Bondarenko, O., 2014. Why are Put Options So Expensive?, Quarterly Journal of Finance 4, 1-50. Brennan, M., Chordia, T., Subrahmanyam, A., 1998. Alternative Factor Speci(cid:133)cations, Se- curity Characteristics, and the Cross-Section of Expected Returns, Journal of Financial Economics 49, 345(cid:150)373. Broadie, M., Chernov, M., Johannes, M., 2009. Understanding Index Option Returns, Re- view of Financial Studies 22, 4493-4529. Busch, T., Christensen, B.J., Nielsen, M., 2011.TheRoleofImpliedVolatilityinForecasting Future Realized Volatility and Jumps in Foreign Exchange, Stock, and Bond Markets, Journal of Econometrics 160, 48-57. Buraschi, A., Jackwerth, J., 2001. The Price of a Smile: Hedging and Spanning in Option Markets, Review of Financial Studies 14, 495-527. 31 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 53,
    "chunk_index": 59,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Christensen, B.J., Nielsen, M., 2011.TheRoleofImpliedVolatilityinForecasting Future Realized Volatility and Jumps in Foreign Exchange, Stock, and Bond Markets, Journal of Econometrics 160, 48-57. Buraschi, A., Jackwerth, J., 2001. The Price of a Smile: Hedging and Spanning in Option Markets, Review of Financial Studies 14, 495-527. 31 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 53,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Campa, J. M., Chang, K., 1995. Testing the Expectations Hypothesis on the Term Structure of Volatilities in Foreign Exchange Options, Journal of Finance 50, 529-547. Cao, C., Yu, F., Zhong, K., 2010. The Information Content of Option-Implied Volatility for Credit Default Swap Valuation, Journal of Financial Markets 13, 321-343. Cao, J., Han, B., 2013. Cross-section of Stock Option Returns and Stock Volatility Risk Premium, Journal of Financial Economics 108, 231-249. Carr, P., Wu, L., 2008. Variance Risk Premiums, Review of Financial Studies 22, 1311-41. Carhart, M., 1997. On Persistence in Mutual Fund Performance, Journal of Finance 52, 57-82. Choy, S. K., 2015. Retail Clientele and Option Returns, Journal of Banking and Finance 51, 26-42. Christo⁄ersen, P., Heston, S., Jacobs, K., 2009. The Shape and Term Structure of the Index Option Smirk: Why Multifactor Stochastic Volatility Models Work so Well, Management Science 55, 1914-1932. Christo⁄ersen, P., Jacobs, K., Ornthanalai, C., Wang, Y., 2008. Option Valuation with Long-Run and Short-Run Volatility Components, Journal of Financial Economics 90, 272-297. Corsi, F., 2009. A Simple Approximate Long-Memory Model of Realized Volatility, Journal of Financial Econometrics 7, 174-196. Coval, J.D., Shumway, T., 2001.ExpectedOptionReturns, JournalofFinance56, 983(cid:150)1009. Cox, J., Ross, S., Rubinstein, M., 1979. Option Pricing: A Simpli(cid:133)ed Approach, Journal of Financial Economics 7, 87(cid:150)106. Cremers, M., Halling, M., Weinbaum, D., 2015. Aggregate Jump and Volatility Risk in the Cross-Section of Stock Returns, Journal of Finance 70, 577-614. Cremers, M., Weinbaum, D., 2010. Deviations from Put-Call Parity and Stock Return Pre- dictability, Journal of Financial and Quantitative Analysis 45, 335-367. Daniel, K., Hirshleifer, D., Subrahmanyam, A., 1998. Investor Psychology and Security Market Under- and Overreactions, Journal of Finance 53, 1839(cid:150)1885. De Fontnouvelle, P., Fisher, R., Harris, J., 2003.The Behavior of Bid(cid:150)Ask Spreads and Volume in Options Markets During the Competition for Listings in 1999, Journal of Finance 58, 2437(cid:150)2463. Diz, F., Finucane, T.J., 1993.DotheOptionsMarketsReallyOverreact?, JournalofFutures Markets 13, 299-312. 32 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 53,
    "chunk_index": 61,
    "word_count": 317,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Overreactions, Journal of Finance 53, 1839(cid:150)1885. De Fontnouvelle, P., Fisher, R., Harris, J., 2003.The Behavior of Bid(cid:150)Ask Spreads and Volume in Options Markets During the Competition for Listings in 1999, Journal of Finance 58, 2437(cid:150)2463. Diz, F., Finucane, T.J., 1993.DotheOptionsMarketsReallyOverreact?, JournalofFutures Markets 13, 299-312. 32 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 53,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Duarte, J., Jones, C.S., 2007. The Price of Market Volatility Risk, Unpublished working paper. Rice University and University of Southern California. Dubinsky, A., Johannes, M., 2005. Earnings Announcements and Equity Options, Unpub- lished working paper. Columbia University, New York. Fama, E., French, K., 1993. Common Risk Factors in the Returns on Stocks and Bonds, Journal of Financial Economics 33, 3-56. Fama, E., MacBeth, J.D., 1973. Risk, Return, and Equilibrium: Empirical Tests, Journal of Political Economy 81, 607-636. Garleanu, N., Pedersen, L. H., Poteshman, A. M., 2009. Demand-Based Option Pricing, Review of Financial Studies 22, 4259-4299. Goyal, A., Saretto, A., 2009. Cross-Section of Option Returns and Volatility, Journal of Financial Economics 94, 310-326. Hansch, O., Hatheway, F., 2001. Measuring Execution Quality in the Listed Option Market, Unpublished working paper. University Park, Pennsylvania. Heynen, R., Kemna, A., Vorst, T., 1994. Analysis of the Term Structure of Implied Volatil- ities, Journal of Financial and Quantitative Analysis 29, 31-56. Jackwerth, J., 2000. Recovering Risk Aversion from Option Prices and Realized Returns, Review of Financial Studies 13, 433-451. Jones, C., 2006. A Nonlinear Factor Analysis of S&P 500 Index Option Returns, Journal of Finance 61, 2325(cid:150)2363. Jones, C., Shemesh, J., 2010. The Weekend E⁄ect in Equity Option Returns, Unpublished working paper. University of Southern California. Jones, C., Wang, T., 2012. The Term Structure of Equity Option Implied Volatility, Unpub- lished working paper. University of Southern California. Liu, J., Longsta⁄, F. A., 2004. Losing Money on Arbitrage: Optimal Dynamic Portfolio Choice in Markets with Arbitrage Opportunities, Review of Financial Studies 17, 611- 641. Mayhew, S., 2002. Competition, Market Structure, and Bid-Ask Spreads in Stock Option Markets. Journal of Finance 57, 931(cid:150)958. Muravyev, D., Pearson, N. D., 2014. Negative Externality of Algorithmic Trading: Evidence from the Option Market, Unpublished working paper. Boston College. Mixon, S., 2007. The Implied Volatility Term Structure of Stock Index Options, Journal of Empirical Finance 14, 333-354. 33 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 53,
    "chunk_index": 63,
    "word_count": 320,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Journal of Finance 57, 931(cid:150)958. Muravyev, D., Pearson, N. D., 2014. Negative Externality of Algorithmic Trading: Evidence from the Option Market, Unpublished working paper. Boston College. Mixon, S., 2007. The Implied Volatility Term Structure of Stock Index Options, Journal of Empirical Finance 14, 333-354. 33 Electronic copy available at: https://ssrn.com/abstract=1944298 Ponti⁄, J., 2006.CostlyArbitrageandtheMythofIdiosyncraticRisk, JournalofAccounting and Economics 42, 35-52. Poon, S.H., Granger, C.W.J., 2003. Forecasting Volatility in Financial Markets: A Review, Journal of Economic Literature 41, 478(cid:150)539. Poteshman, A. M., 2001. Underreaction, Overreaction, and Increasing Misreaction to Infor- mation in the Options Market, Journal of Finance 56, 851-876. Saretto, A., Santa-Clara, P., 2009. Option Strategies: Good Deals and Margin Calls, Journal of Financial Markets 12, 391-417. Shleifer, A., Vishny, R.W., 1997. The Limits of Arbitrage, Journal of Finance 52, 35-55. Stein, J., 1989. Overreactions in the Options Market, Journal of Finance 44, 1011-1023. Vanden, J.M., 2006. Option Coskewness and Capital Asset Pricing, Review of Financial Studies 19, 1279-1320. Xing, Y., Zhang, X., Zhao, R., 2010, What Does Individual Option Volatility Smirks Tell Us about Future Equity Returns?, Journal of Financial and Quantitative Analysis 45, 641-662. Yan, S., 2011. Jump Risk, Stock Returns, and Slope of Implied Volatility Smile, Journal of Financial Economics 99, 216-233. 34 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 34,
    "page_range": "p.34-35",
    "total_pages": 53,
    "chunk_index": 64,
    "word_count": 209,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.34-35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Zhang, X., Zhao, R., 2010, What Does Individual Option Volatility Smirks Tell Us about Future Equity Returns?, Journal of Financial and Quantitative Analysis 45, 641-662. Yan, S., 2011. Jump Risk, Stock Returns, and Slope of Implied Volatility Smile, Journal of Financial Economics 99, 216-233. 34 Electronic copy available at: https://ssrn.com/abstract=1944298 Appendix A: Volatility measures As is standard, all volatility measures are annualized. Short-term implied volatility, IV ; is de(cid:133)ned as the average of the one-month ATM 1M (cid:15) put and call implied volatilities. Long-term implied volatility, IV ; is the average volatility of the ATM put and call LT (cid:15) options that have the longest time-to-maturity. Lagged implied volatility, IVt i; is de(cid:133)ned as the average of the one-month ATM put (cid:15) 1M(cid:0) and call implied volatilities i months ago. We estimate implied volatility for di⁄erent lags: 1 month, 3 months, and 6 months. Average implied volatility, IVavg, is de(cid:133)ned as the average of daily observations of (cid:15) 1M IV over the last six months. 1M Maximum implied volatility, IVmax, is de(cid:133)ned as the maximum short-term volatility (cid:15) 1M IV over the last six months. 1M Historical volatility for stock i on day t is de(cid:133)ned as (cid:15) 1=2 252 N HV = (r (cid:22) )2 ; (5) i;t (cid:18) N s=0 i;t (cid:0) s (cid:0) i (cid:19) P where N is the number of trading days, r is the daily log-return of stock i on day i;t s (cid:0) t s, (cid:22) is the mean for stock i; and (cid:22) is the mean of stock i. We estimate historical i i (cid:0) volatility using 12 months of daily returns. Future volatility for stock i on day t is de(cid:133)ned as (cid:15) 1=2 252 T FV = (r (cid:22) )2 ; (6) i;t T i;t+s (cid:0) i (cid:18) s=1 (cid:19) P where T is the number of trading days until the option expiration, r is the daily i;t+s log-return of stock i on day t+s, and (cid:22) is the mean of stock i. We estimate future i volatility over 1 week (T = 5). Realized volatility for stock i on day t is de(cid:133)ned as (cid:15) 252 N 1 I 1=2 RV = (cid:0) r2 ; (7) i;t (cid:18) N i=0 j=1 t (cid:0) i; I j (cid:19) X X where r2 is the jth intraday return on day t i and I is the number of return t i;j (cid:0) (cid:0) I observations in a trading day. We use (cid:133)ve-minute returns so that in 6.5 trading hours wehaveI = 78;andweestimaterealizedvolatilityover1day(N = 1), 1week(N = 5), and 1 month (N = 22). 35 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 53,
    "chunk_index": 65,
    "word_count": 438,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "day t i and I is the number of return t i;j (cid:0) (cid:0) I observations in a trading day. We use (cid:133)ve-minute returns so that in 6.5 trading hours wehaveI = 78;andweestimaterealizedvolatilityover1day(N = 1), 1week(N = 5), and 1 month (N = 22). 35 Electronic copy available at: https://ssrn.com/abstract=1944298 Idiosyncratic volatility is de(cid:133)ned as (cid:15) idvol = (252 var(\" ))1=2; (8) i;t i;t (cid:3) where \" is the error term of the three-factor Fama and French (1993) regression. The i;t regression is estimated with daily returns over the previous 22 trading days. 36 Electronic copy available at: https://ssrn.com/abstract=1944298 Figure 1: Time Series of Straddle Returns Straddle returns are generated as in Table 2. The (cid:133)gures below display the returns of the long- shortportfoliode(cid:133)nedasthedi⁄erencebetweendecile10(highestslopeofvolatilitytermstructure) and decile 1 (lowest slope of volatility term structure) straddle portfolios. The sample period for OptionMetrics stocks is January 1996 to January 2012. 40 ) k e e w r 20 e p % ( s 0 n r u t e R w 20 a R 1996 2000 2004 2008 2012 Time 37 Electronic copy available at: https://ssrn.com/abstract=1944298 Figure 2: QQ-plot of Straddle Returns Straddle returns are generated as in Table 2. The (cid:133)gures below display the qq-plots of the straddle returns of the long-short portfolios de(cid:133)ned as the di⁄erence between decile 10 (highest slope of volatility term structure) and decile 1 (lowest slope of volatility term structure) portfolios. The sample period for OptionMetrics stocks is January 1996 to January 2012. 0.5 0.4 0.3 s e e l d l i 0.2 d t n a a 0.1 r t u S Q 0 0.1 0.2 0.3 3 2 1 0 1 2 3 Standard Normal Quantiles 38 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 36,
    "page_range": "p.36-38",
    "total_pages": 53,
    "chunk_index": 66,
    "word_count": 288,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.36-38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "OptionMetrics stocks is January 1996 to January 2012. 0.5 0.4 0.3 s e e l d l i 0.2 d t n a a 0.1 r t u S Q 0 0.1 0.2 0.3 3 2 1 0 1 2 3 Standard Normal Quantiles 38 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 53,
    "chunk_index": 67,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 1 Characteristics of Portfolios Sorted by the Slope of the Volatility Term Structure Panel A reports the characteristics of ten portfolios sorted by the slope of the volatility term structure (Slope VTS de(cid:133)ned as IV IV ), for stocks in the OptionMetrics database for the period January LT 1M (cid:0) 1996 to January 2012. Average characteristics of the portfolios are reported for IV (the one-month 1M implied volatility de(cid:133)ned as the average of the ATM call and ATM put implied volatilities), IV (the LT long-term implied volatility de(cid:133)ned as the average of the ATM call and ATM put implied volatilities of the options with the more distant time-to-maturity), volatility measures minus IV (Volatility measures 1M are future volatility (FV) over the following week, the one-year historical volatility of daily returns (HV), realized volatility computed with 5-minute returns over 1 day (RV ), 1 week (RV ) and 1 month (RV ), 1d 1w 1M implied volatility lagged by one month (IVt 1), 3 months (IVt 3), and 6 months (IVt 6), the average 1M(cid:0) 1M(cid:0) 1M(cid:0) (IVavg) and maximum (IVmax) implied volatilities over the previous 6-months, and idiosyncratic volatility 1M 1M (idioVol)), $ Size Options (Open interest of the ATM call and put multiplied by their respective mid price, in $ thousands), the put-call spread of IV ; the bid to mid spread of IV , Delta Call, Delta 1M 1M Put, Gamma, Vega, Size (market capitalization in $ billions), BE/ME (book-to-market ratio), risk-neutral volatility (RNvol), skewness (RNskew) and kurtosis (RNkurt) as de(cid:133)ned in Bakshi, Kapadia, and Madan (2003), andrisk-neutraljump(RNjump)asinYan(2011). PanelBreportsthecorrelationsofthevolatility variables minus IV . See Appendix A for volatility measures de(cid:133)nitions. 1M Panel A: Portfolio Characteristics Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 Volatility Measures Slope VTS -0.134 -0.063 -0.041 -0.027 -0.017 -0.008 0.000 0.009 0.020 0.056 IV 0.740 0.578 0.512 0.466 0.429 0.402 0.383 0.377 0.385 0.461 1M IV 0.606 0.516 0.471 0.439 0.413 0.394 0.384 0.385 0.405 0.517 LT FV-IV -0.076 -0.051 -0.042 -0.040 -0.038 -0.037 -0.035 -0.036 -0.038 -0.050 1M HV-IV -0.084 -0.014 0.002 0.012 0.017 0.023 0.029 0.039 0.054 0.095 1M RV -IV -0.059 -0.038 -0.035 -0.032 -0.032 -0.031 -0.027 -0.026 -0.018 -0.004 1d 1M RV -IV -0.059 -0.030 -0.027 -0.024 -0.025 -0.023 -0.018 -0.017 -0.008 0.011 1w 1M VRP(=RV -IV ) -0.078 -0.034 -0.027 -0.021 -0.021 -0.018 -0.011 -0.007 0.004 0.031 1M 1M t 1 IV 1(cid:0)M -IV 1M -0.110 -0.043 -0.024 -0.012 -0.003 0.004 0.012 0.020 0.032 0.064 t 3 IV 1(cid:0)M -IV 1M -0.123 -0.044 -0.023 -0.009 0.001 0.008 0.016 0.024 0.037 0.072 t 6 IV 1(cid:0)M -IV 1M -0.138 -0.051 -0.027 -0.013 -0.002 0.008 0.016 0.026 0.039 0.072 avg IV -IV -0.069 -0.025 -0.013 -0.006 -0.001 0.004 0.008 0.013 0.021 0.043 1M 1M IVmax-IV 0.072 0.063 0.060 0.060 0.060 0.060 0.063 0.068 0.080 0.128 1M 1M IdioVol-IV -0.195 -0.152 -0.136 -0.123 -0.114 -0.107 -0.100 -0.095 -0.091 -0.094 1M Option and Firm Characteristics $ Size Options 876 800 933 977 957 964 960 1046 1115 952 Put-Call Spread IV 0.016 0.009 0.007 0.007 0.007 0.007 0.007 0.007 0.008 0.013 1M Bid to Mid Spread IV 0.058 0.057 0.057 0.057 0.057 0.057 0.058 0.059 0.061 0.071 1M Delta call 0.558 0.551 0.548 0.546 0.542 0.538 0.534 0.528 0.525 0.530 Delta put -0.443 -0.451 -0.455 -0.458 -0.462 -0.468 -0.472 -0.478 -0.481 -0.475 Gamma 0.173 0.177 0.179 0.183 0.186 0.187 0.196 0.199 0.210 0.245 Vega 8.64 10.57 12.00 13.23 14.31 15.43 15.86 17.29 17.6 13.61 Size 5.56 9.58 12.79 16.21 19.51 21.67 23.92 25.46 23.02 13.16 BE/ME 0.842 0.918 0.866 0.846 0.825 0.853 0.831 0.744 0.743 0.727 Risk Neutral Measures RNVol 0.683 0.582 0.526 0.485 0.451 0.425 0.406 0.399 0.407 0.481 RNSkew -0.383 -0.436 -0.482 -0.522 -0.558 -0.596 -0.623 -0.646 -0.664 -0.597 RNKurt 3.637 3.814 3.984 4.128 4.262 4.396 4.476 4.593 4.696 4.614 RNJump 0.017 0.009 0.008 0.007 0.007 0.007 0.007 0.008 0.009 0.014 39 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 53,
    "chunk_index": 68,
    "word_count": 650,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "RNVol 0.683 0.582 0.526 0.485 0.451 0.425 0.406 0.399 0.407 0.481 RNSkew -0.383 -0.436 -0.482 -0.522 -0.558 -0.596 -0.623 -0.646 -0.664 -0.597 RNKurt 3.637 3.814 3.984 4.128 4.262 4.396 4.476 4.593 4.696 4.614 RNJump 0.017 0.009 0.008 0.007 0.007 0.007 0.007 0.008 0.009 0.014 39 Electronic copy available at: https://ssrn.com/abstract=1944298 Table 1 (Continued) Panel B: Correlation Matrix Slope VTS FV-IV -3.0 FV-IV 1M 1M HV-IV 42.4 -3.5 HV IV 1M 1M (cid:0) RV -IV 2.0 13.3 1.3 RV -IV 1d 1M 1d 1M RV -IV 4.3 14.1 3.3 68.1 RV -IV 1w 1M 1w 1M VRP (=RV -IV ) 17.6 7.5 14.6 51.3 77.1 VRP (=RV -IV ) 1M 1M 1M 1M t 1 t 1 IV 1(cid:0)M -IV 1M 55.8 -5.4 43.0 -0.8 1.6 26.1 IV 1(cid:0)M -IV 1M t 3 t 3 IV 1(cid:0)M -IV 1M 53.4 -6.4 60.4 -1.8 -2.9 7.0 49.1 IV 1(cid:0)M -IV 1M t 6 t 6 IV 1(cid:0)M -IV 1M 51.4 -5.9 69.3 -1.2 -2.5 4.7 37.4 62.9 IV 1(cid:0)M -IV 1M avg avg IV -IV 57.8 -4.7 40.5 -0.9 8.1 37.3 80.9 44.3 34.8 IV -IV 1M 1M 1M 1M IVmax-IV 9.0 -1.8 13.9 1.3 12.7 31.1 44.7 3.6 -4.8 59.9 IVmax-IV 1M 1M 1M 1M IdioVol-IV 25.8 0.1 20.8 18.6 29.2 39.8 26.4 15.5 16.7 32.2 19.2 IdioVol-IV 1M 1M 40 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 40,
    "page_range": "p.40-41",
    "total_pages": 53,
    "chunk_index": 69,
    "word_count": 225,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.40-41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "40.5 -0.9 8.1 37.3 80.9 44.3 34.8 IV -IV 1M 1M 1M 1M IVmax-IV 9.0 -1.8 13.9 1.3 12.7 31.1 44.7 3.6 -4.8 59.9 IVmax-IV 1M 1M 1M 1M IdioVol-IV 25.8 0.1 20.8 18.6 29.2 39.8 26.4 15.5 16.7 32.2 19.2 IdioVol-IV 1M 1M 40 Electronic copy available at: https://ssrn.com/abstract=1944298 Table 2 The Slope of the Volatility Term Structure and the Cross-Section of Straddle Returns PortfoliosareconstructedasinTable1. PanelAreportstheweeklyequal-weightedstraddlereturns of decile portfolios along with the t-statistics (t-stat), standard deviation (StDev), skewness and kurtosis values. The last column displays the di⁄erence between decile portfolio 10 (highest slope of volatility term structure) and decile 1 (lowest slope of volatility term structure). We report the 95% bootstrap con(cid:133)dence interval for the long-short (P10 P1) straddle return. In Panel (cid:0) B, we sample the long-short (P10 P1) straddle returns 50,000 times to generate the reported (cid:133)nite sample critical value for the t-(cid:0)statistic. Panel C presents coe¢ cients and t-statistics from the following regression: r = (cid:11) +(cid:12) (R R )+(cid:12) SMB+(cid:12) HML+(cid:12) UMD+ straddle P 1 m f 2 3 4 (cid:0) (cid:12) (R R )+(cid:12) (R2 R )+(cid:12) (R2 R )+(cid:12) (R R R ) 5 o f 6 m f 7 o f 8 o m f (cid:0) (cid:0) (cid:0) (cid:0) (cid:12) (R3 R )+(cid:12) (R3 R )+(cid:12) (R2R R )+(cid:12) (R R2 R )+\" 9 o f 10 m f 11 o m f 12 o m f (cid:0) (cid:0) (cid:0) (cid:0) where R is the return of the market, R is the straddle return of the S&P 500, R is the risk- m o f free rate, and SMB, HML, and UMD are the Fama-French and momentum factors, r is the straddle straddle return of the long-short portfolio. The (cid:133)rst row gives the coe¢ cients of the regression and the second row gives the t-statistics (in parentheses). We report the 95% bootstrap con(cid:133)dence interval for the alpha ((cid:11) ). Adjusted R2 is reported at the bottom of the table. The sample period P for OptionMetrics stocks is January 1996 to January 2012. Panel A: Straddle Returns Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Mean -0.029 -0.015 -0.010 -0.010 -0.008 -0.005 -0.003 -0.001 0.006 0.022 0.051 t-stat (-11.2) (-6.06) (-4.12) (-3.78) (-3.24) (-1.76) (-1.03) (-0.45) (2.02) (7.35) (19.9) Mean - 95% Bootstrap CI [0.046, 0.055] StDev 0.074 0.074 0.073 0.073 0.074 0.077 0.078 0.081 0.085 0.086 0.073 Skewness 0.7 0.8 0.6 0.5 1.0 1.5 0.8 1.2 1.4 1.3 0.6 Kurtosis 4.1 5.8 4.1 3.8 10.1 12.2 7.3 7.9 12.0 9.4 3.8 Panel B: Bootstrapped Critical Values for the t-statistic Percentile (%) Bootstrapped t-statistic 1 -2.367 2.5 -1.997 5 -1.673 10 -1.308 90 1.265 95 1.631 97.5 1.937 99 2.300 41 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 53,
    "chunk_index": 70,
    "word_count": 457,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "1.2 1.4 1.3 0.6 Kurtosis 4.1 5.8 4.1 3.8 10.1 12.2 7.3 7.9 12.0 9.4 3.8 Panel B: Bootstrapped Critical Values for the t-statistic Percentile (%) Bootstrapped t-statistic 1 -2.367 2.5 -1.997 5 -1.673 10 -1.308 90 1.265 95 1.631 97.5 1.937 99 2.300 41 Electronic copy available at: https://ssrn.com/abstract=1944298 Table 2 (Continued) Panel C: Risk-Adjusted Returns (1) (2) (3) (4) Alpha 0.056 0.054 0.053 0.054 (21.53) (18.77) (15.46) (15.71) Alpha - 95% Bootstrap CI [0.050, 0.061] [0.046, 0.061] [0.044, 0.061] [0.044, 0.062] R - R -0.069 -0.079 -0.052 -0.058 m f (-7.93) (-7.91) (-4.57) (-4.86) SMB -0.038 -0.017 (-2.38) (-1.08) HML -0.022 -0.018 (-1.60) (-1.31) UMD -0.009 -0.019 (-1.00) (-2.12) R R 0.082 0.069 0.063 o f (cid:0) (3.70) (2.65) (2.42) R2 R 0.03 -0.03 -0.02 m(cid:0) f (2.41) (-1.21) (-0.83) R2 R 0.008 0.202 0.183 o(cid:0) f (0.25) (1.76) (1.59) R R R -0.028 -0.087 -0.100 m o (cid:0) f (-0.71) (-1.18) (-1.36) R3 R -0.195 -0.185 o(cid:0) f (-2.35) (-2.23) R3 R -0.01 -0.02 m(cid:0) f (-0.59) (-0.84) R R2 R -0.081 -0.080 m o(cid:0) f (-0.76) (-0.75) R2 R R 0.193 0.207 m o (cid:0) f (2.68) (2.83) Adj. R2 0.077 0.118 0.143 0.147 42 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 53,
    "chunk_index": 71,
    "word_count": 204,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "(-1.36) R3 R -0.195 -0.185 o(cid:0) f (-2.35) (-2.23) R3 R -0.01 -0.02 m(cid:0) f (-0.59) (-0.84) R R2 R -0.081 -0.080 m o(cid:0) f (-0.76) (-0.75) R2 R R 0.193 0.207 m o (cid:0) f (2.68) (2.83) Adj. R2 0.077 0.118 0.143 0.147 42 Electronic copy available at: https://ssrn.com/abstract=1944298 Table 3 Modi(cid:133)ed Fama-MacBeth Cross-Sectional Regressions This table reports the results from the modi(cid:133)ed Fama-MacBeth weekly cross-sectional regressions proposed by Brennan, Chordia, and Subrahmanyam (1998) as in r (cid:12) F = (cid:13) +(cid:13) Z +\" i;t i t 0;t 00;t i;t 1 i;t (cid:0) (cid:0) where r is the straddle return in excess of the risk free rate for each security i at time t, F are the i;t t b Fama-French-Carhart, coskewness and cokurtosis factors, and Z are thecharacteristics foreach i;t 1 (cid:0) stock i at time t 1. The (cid:12) are estimated in the (cid:133)rst stage for each stock i using the entire sample. i (cid:0) The characteristics are the slope of the volatility term structure, volatility measures minus IV 1M (Volatility measures are tbhe long-term implied volatility (IV LT ), the one-year historical volatility of daily returns (HV), realized volatility computed with 5-minute returns over 1 month (RV ), 1M the average (IV avg ) and maximum (IVmax) implied volatilities over the previous 6-months), risk- 1M 1M neutral volatility, skewness and kurtosis (Bakshi, Kapadia, and Madan (2003)), and risk-neutral jump (Yan (2011)). The (cid:133)rst row gives the coe¢ cients of the regression and the second row gives the Newey-West t-statistics (in parentheses). We report the 95% bootstrap con(cid:133)dence interval for the coe¢ cient of the slope of the volatility term structure. Adjusted R2 is reported at the bottom of the table. The sample period for OptionMetrics stocks is January 1996 to January 2012. (1) (2) (3) (4) (5) (6) Intercept 0.007 0.006 0.007 0.006 0.007 0.000 (3.91) (3.20) (3.80) (3.38) (3.61) (-0.01) Slope VTS 0.217 0.192 0.202 0.184 0.221 0.222 (15.56) (12.64) (14.62) (11.37) (15.27) (15.84) 95% Bootstrap CI [0.198, 0.241] [0.168, 0.217] [0.182, 0.227] [0.159, 0.213] [0.202, 0.246] [0.200, 0.249] HV-IV 0.029 1M (4.06) VRP (=RV -IV ) 0.032 1M 1M (4.27) avg IV -IV 0.065 1M 1M (4.14) IVmax-IV -0.015 1M 1M (-1.58) RNVol 0.002 (0.40) RNSkew 0.003 (1.29) RNKurt 0.0016 (2.53) RNJump -0.0163 (-0.98) Adj. R2 0.0067 0.0099 0.0095 0.0099 0.0096 0.016 43 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 53,
    "chunk_index": 72,
    "word_count": 394,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "HV-IV 0.029 1M (4.06) VRP (=RV -IV ) 0.032 1M 1M (4.27) avg IV -IV 0.065 1M 1M (4.14) IVmax-IV -0.015 1M 1M (-1.58) RNVol 0.002 (0.40) RNSkew 0.003 (1.29) RNKurt 0.0016 (2.53) RNJump -0.0163 (-0.98) Adj. R2 0.0067 0.0099 0.0095 0.0099 0.0096 0.016 43 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 53,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 4 Double Sorting on Firm Characteristics and the Slope of the Volatility Term Structure Each week, (cid:133)rms are (cid:133)rst sorted into quintiles based on volatility measures (minus IV ), and 1M then, within each quintile, (cid:133)rms are sorted into quintiles by the slope of the volatility term struc- ture, de(cid:133)ned as IV IV . The slope-of-the volatility term structure portfolios are averaged LT 1M (cid:0) over each of the (cid:133)ve characteristic portfolios to form P1 to P5 . P1 (P5 ) averages the avg avg avg avg portfolios with the lowest (highest) slope of the volatility term structure for each quintile char- acteristic portfolio. The characteristics included are volatility measures minus IV (Volatility 1M measures are the one-year historical volatility of daily returns (HV), realized volatility computed with 5-minute returns over 1 month (RV ), the average (IV avg ) and maximum (IVmax) implied 1M 1M 1M volatilities over the previous 6-months), risk-neutral volatility, skewness and kurtosis (Bakshi, Ka- padia, and Madan (2003)), and risk-neutral jump (Yan (2011)). This table reports the average straddle return for portfolios P1 to P5 , the di⁄erence between P1 and P5 , the 95% avg avg avg avg bootstrap con(cid:133)dence interval for P5 P1 , and the t-statistics (in parentheses). The sample avg avg (cid:0) period for OptionMetrics stocks is January 1996 to January 2012. 95% Bootstrap CI Control P1 P2 P3 P4 P5 P5 P1 for P5 P1 avg avg avg avg avg avg avg avg avg (cid:0) (cid:0) HV-IV -0.016 -0.010 -0.005 -0.002 0.006 0.022 [0.019, 0.025] 1M (-6.47) (-4.29) (-2.10) (-0.76) (2.36) (12.48) VRP (=RV -IV ) -0.020 -0.010 -0.006 -0.002 0.011 0.031 [0.028, 0.035] 1M 1M (-8.26) (-4.14) (-2.49) (-0.83) (4.19) (17.45) avg IV -IV -0.017 -0.009 -0.005 -0.002 0.006 0.023 [0.020, 0.027] 1M 1M (-7.17) (-3.56) (-2.02) (-0.71) (2.25) (14.22) IVmax-IV -0.021 -0.011 -0.005 0.000 0.010 0.031 [0.028, 0.035] 1M 1M (-8.90) (-4.58) (-2.02) (0.16) (3.61) (16.90) RNVol -0.024 -0.011 -0.006 -0.001 0.014 0.038 [0.034, 0.041] (-10.28) (-4.42) (-2.19) (-0.45) (5.05) (21.48) RNSkew -0.022 -0.011 -0.006 -0.001 0.013 0.0349 [0.031, 0.039] (-9.21) (-4.63) (-2.41) (-0.38) (4.71) (18.40) RNKurt -0.022 -0.011 -0.006 -0.002 0.013 0.0350 [0.031, 0.039] (-9.37) (-4.56) (-2.23) (-0.62) (4.67) (18.40) RNJump -0.022 -0.011 -0.006 -0.002 0.013 0.0351 [0.031, 0.039] (-9.13) (-4.43) (-2.53) (-0.58) (4.74) (17.80) 44 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 53,
    "chunk_index": 74,
    "word_count": 385,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "-0.022 -0.011 -0.006 -0.001 0.013 0.0349 [0.031, 0.039] (-9.21) (-4.63) (-2.41) (-0.38) (4.71) (18.40) RNKurt -0.022 -0.011 -0.006 -0.002 0.013 0.0350 [0.031, 0.039] (-9.37) (-4.56) (-2.23) (-0.62) (4.67) (18.40) RNJump -0.022 -0.011 -0.006 -0.002 0.013 0.0351 [0.031, 0.039] (-9.13) (-4.43) (-2.53) (-0.58) (4.74) (17.80) 44 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 53,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 5 Forecasting Realized Volatility This tables reports the average coe¢ cients and Newey-West t-statistics from the two pass Fama- MacBeth (1973) regressions. Each week, future realized volatility minus IV is regressed on 1M various volatility measures minus IV as in FV IV = B + B (IV IV ) + 1M i;t 1M 0;t 1;t LT 1M (cid:0) i;t i;t (cid:0) i;t B (Volatility Measures IV )+\" : In the second step, the estimator for each coe¢ cient k;t 1M i;t (cid:0) i;t is the average of the time series coe¢ cients. Future realized volatility (FV ) is the standard i;t deviation of the underlying daily stock return over one week. Volatility measures are the long- term implied volatility (IV ), the one-year historical volatility of daily returns (HV), realized LT volatility computed with 5-minute returns over 1 month (RV ), implied volatility lagged by 6 1M months (IVt 6), and the maximum (IVmax) and average (IV avg ) implied volatilities over the 1M(cid:0) 1M 1M previous 6-months. We report adjusted R2 and Newey-West t-statistics with 3 lags in parentheses. Additionally, this table reports the percentage of regressors with t-statistics over 1:96 for each estimator. The sample period for OptionMetrics stocks is January 1996 to January 2012. (1) (2) (3) (4) (5) (6) (7) Intercept -0.043 -0.045 -0.035 -0.044 -0.042 -0.035 -0.025 (-9.87) (-10.29) (-9.46) (-10.83) (-10.43) (-9.03) (-7.94) IV -IV 0.217 0.142 0.092 0.198 0.248 0.259 0.077 LT 1M (7.79) (4.62) (3.25) (7.26) (7.97) (9.03) (2.79) HV-IV 0.086 0.094 1M (7.22) (7.07) VRP (=RV -IV ) 0.196 0.193 1M 1M (13.7) (15.5) t 6 IV 1(cid:0)M -IV 1M 0.027 -0.033 (2.39) (-2.89) avg IV -IV -0.027 0.123 1M 1M (-1.08) (3.37) IVmax-IV -0.138 -0.255 1M 1M (-9.53) (-13.5) Adj. R2 2% 3% 4% 3% 3% 3% 7% Pct. of t>1.96 (IV LT -IV 1M ) 42% 33% 28% 35% 36% 44% 20% Pct. of t>1.96 (HV-IV 1M ) 25% 19% Pct. of t>1.96 (RV 1M -IV 1M ) 42% 40% t 6 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 20% 11% avg Pct. of t>1.96 (IV 1M -IV 1M ) 16% 23% Pct. of t>1.96 (IVm 1M ax-IV 1M ) 7% 6% 45 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 53,
    "chunk_index": 76,
    "word_count": 371,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "19% Pct. of t>1.96 (RV 1M -IV 1M ) 42% 40% t 6 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 20% 11% avg Pct. of t>1.96 (IV 1M -IV 1M ) 16% 23% Pct. of t>1.96 (IVm 1M ax-IV 1M ) 7% 6% 45 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 53,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 6 Straddle Returns for Di⁄erent Horizons Portfolios are constructed as in Table 1. This table reports equal-weighted straddle returns for di⁄erenthorizons. Westudy2-week, 3-week, andone-monthholdingperiods. Wereportt-statistics (t-stat), standard deviation (StDev), skewness and kurtosis values of the decile portfolio returns. Long-short returns are computed as the di⁄erence between decile portfolio 10 (highest slope of volatility term structure) and decile 1 (lowest slope of volatility term structure). We report the 95% bootstrap con(cid:133)dence interval for the long-short portfolio straddle return. The sample period for OptionMetrics stocks is January 1996 to January 2012. Panel A: Two-Week Horizon Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Mean -0.050 -0.025 -0.020 -0.019 -0.012 -0.013 -0.008 -0.005 0.003 0.030 0.079 t-stat (-8.45) (-4.02) (-3.52) (-3.39) (-2.05) (-1.99) (-1.27) (-0.79) (0.48) (4.41) (13.20) Mean - 95% Bootstrap CI [0.067, 0.091] StDev 0.120 0.126 0.118 0.115 0.122 0.131 0.131 0.139 0.138 0.138 0.122 Skewness 1.1 1.1 0.9 1.2 0.9 2.0 1.6 2.1 1.6 1.6 0.3 Kurtosis 3.4 3.4 2.3 5.2 2.7 10.4 5.8 11.0 6.1 6.3 5.1 Panel B: Three-Week Horizon Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Mean -0.046 -0.013 -0.024 -0.013 -0.033 -0.014 -0.007 0.009 0.048 0.090 0.136 t-stat (-2.76) (-0.62) (-1.30) (-0.67) (-1.80) (-0.74) (-0.33) (0.42) (2.09) (3.66) (6.16) Mean - 95% Bootstrap CI [0.092, 0.179] StDev 0.234 0.286 0.259 0.268 0.257 0.274 0.288 0.294 0.320 0.344 0.310 Skewness 2.5 2.1 1.9 1.6 1.8 2.2 2.4 2.0 2.0 1.7 0.2 Kurtosis 13.1 7.6 6.1 3.9 5.8 9.0 9.5 5.7 6.0 4.5 4.9 Panel C: One-Month Horizon Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Mean -0.092 -0.036 -0.044 -0.035 -0.028 -0.025 -0.033 -0.006 0.016 0.073 0.165 t-stat (-5.96) (-2.02) (-2.58) (-1.85) (-1.44) (-1.31) (-1.64) (-0.30) (0.73) (3.50) (10.02) Mean - 95% Bootstrap CI [0.135, 0.201] StDev 0.213 0.249 0.237 0.260 0.267 0.264 0.276 0.288 0.302 0.291 0.228 Skewness 1.1 1.7 2.0 2.4 2.2 2.4 1.9 2.6 2.1 1.9 1.2 Kurtosis 3.3 6.1 8.9 10.7 9.3 10.0 6.5 11.8 8.1 6.9 5.4 46 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 53,
    "chunk_index": 78,
    "word_count": 345,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "(10.02) Mean - 95% Bootstrap CI [0.135, 0.201] StDev 0.213 0.249 0.237 0.260 0.267 0.264 0.276 0.288 0.302 0.291 0.228 Skewness 1.1 1.7 2.0 2.4 2.2 2.4 1.9 2.6 2.1 1.9 1.2 Kurtosis 3.3 6.1 8.9 10.7 9.3 10.0 6.5 11.8 8.1 6.9 5.4 46 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 53,
    "chunk_index": 79,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table 7 Straddle Returns with Transactions Costs Each month, (cid:133)rms are (cid:133)rst sorted into quartiles based on their bid-ask spread, and then, within eachquartile,(cid:133)rmsaresortedintodecilesbasedontheslopeofthevolatilitytermstructure,de(cid:133)ned as IV IV . Panel A reports the long-short straddle return and t-statistic for each quartile LT 1M (cid:0) or group of quartiles computed with bid and ask quotes executed at an e⁄ective-to-quoted spread ratio of 25%, 50%, 75%, and 100%. Once a month, options are bought and held until maturity. The long position buys at the ask price and the short position sells at the bid price. At maturity, the terminal payo⁄ depends on the strike price. Panel B reports the margin haircut of shorting portfolio 1, and the percentage of wealth used for margin requirements. The margin haircut is de(cid:133)ned as the ratio (M V )=V , where M is the straddle margin at the end of each day t, and V t 0 0 t 0 (cid:0) is equal to the sum of the price of the call and the put when the position is opened. The percentage of wealth used for margin requirements is the inverse of the margin haircut. The sample period for OptionMetrics stocks is January 1996 to January 2012. Panel A: Long-Short Straddle Returns and Bid-Ask Spreads E⁄ective-to-Quoted Spread Ratio Bid/Ask Spread Quartiles 25% 50% 75% 100% Q1 0.167 0.154 0.141 0.128 (4.88) (4.51) (4.14) (3.76) Q2 0.108 0.086 0.064 0.043 (4.09) (3.29) (2.47) (1.65) Q3 0.140 0.109 0.078 0.046 (5.99) (4.69) (3.37) (2.00) Q4 0.087 0.026 -0.036 -0.102 (2.98) (0.89) (-1.25) (-3.48) Q1 and Q2 0.136 0.118 0.101 0.084 (5.97) (5.23) (4.48) (3.72) Q1, Q2 and Q3 0.135 0.113 0.091 0.068 (7.24) (6.08) (4.92) (3.72) All Sample 0.132 0.098 0.065 0.031 (7.77) (5.87) (3.91) (1.88) Panel B: Margin Haircut P1 Haircut % of Wealth used for Margin Requirement Mean 1.54 35% Median 1.47 32% StDev 0.61 Minimum 0.23 Maximum 4.41 77% 47 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 53,
    "chunk_index": 80,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "0.135 0.113 0.091 0.068 (7.24) (6.08) (4.92) (3.72) All Sample 0.132 0.098 0.065 0.031 (7.77) (5.87) (3.91) (1.88) Panel B: Margin Haircut P1 Haircut % of Wealth used for Margin Requirement Mean 1.54 35% Median 1.47 32% StDev 0.61 Minimum 0.23 Maximum 4.41 77% 47 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 53,
    "chunk_index": 81,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Internet Appendix for Equity Volatility Term Structures and the Cross-Section of Option Returns Table IA.1 Straddle Returns for Alternative De(cid:133)nitions of the Slope of the Volatility Term Structure and Future Volatility Thistablereportsweeklyequal-weightedstraddlereturnsalongwiththet-statistics(t-stat)ofdecile portfolios for di⁄erent de(cid:133)nitions of the slope of the volatility term structure and future volatility. PanelAreportsonalternativede(cid:133)nitionsoftheslopeofthevolatilitytermstructure(IV IV ) LT 1M (cid:0) use variance, the square-root of volatility, volatility cubed, the cubed root of volatility, and the logarithm of each volatility measure. Panel B reports straddle returns when sorting on future volatility, FV, minus short-term implied volatility, IV . The last column displays the di⁄erence 1M between decile portfolio 10 and decile 1. The sample period for OptionMetrics stocks is January 1996 to January 2012. Panel A: Alternative De(cid:133)nitions of the Slope of the Volatility Term Structure Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Variance -0.026 -0.014 -0.011 -0.010 -0.009 -0.006 -0.002 -0.001 0.007 0.020 0.046 (-10.23) (-5.59) (-4.14) (-4.02) (-3.65) (-2.19) (-0.82) (-0.22) (2.26) (6.57) (18.20) Sqr Root -0.030 -0.015 -0.011 -0.008 -0.009 -0.004 -0.003 -0.001 0.006 0.021 0.051 (-12.10) (-5.87) (-4.21) (-3.31) (-3.41) (-1.55) (-0.93) (-0.37) (2.03) (7.10) (20.43) Cubed -0.026 -0.013 -0.011 -0.010 -0.010 -0.005 -0.003 -0.001 0.008 0.018 0.043 (-9.71) (-5.07) (-4.36) (-3.77) (-3.93) (-2.05) (-1.24) (-0.19) (2.75) (5.86) (17.08) Cubed Root -0.027 -0.016 -0.009 -0.011 -0.008 -0.006 -0.001 -0.001 0.006 0.020 0.047 (-10.41) (-6.31) (-3.60) (-4.30) (-3.28) (-2.16) (-0.51) (-0.28) (2.05) (6.77) (18.59) Log -0.031 -0.014 -0.011 -0.008 -0.007 -0.004 -0.003 0.000 0.005 0.020 0.051 (-12.89) (-5.60) (-4.33) (-3.17) (-2.84) (-1.74) (-1.00) (-0.01) (1.87) (6.66) (20.58) Panel B: Sorting by Future Volatility minus IV 1M Deciles P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Mean -0.067 -0.047 -0.039 -0.032 -0.025 -0.017 -0.009 0.006 0.032 0.147 0.214 t-stat (-28.20) (-20.12) (-15.63) (-13.39) (-9.84) (-6.52) (-3.32) (2.16) (10.85) (38.69) (60.36) StDev 0.069 0.068 0.071 0.069 0.073 0.075 0.078 0.080 0.086 0.110 0.103 Skewness 0.7 0.7 1.4 0.7 1.1 0.8 0.8 0.9 0.9 0.6 0.7 Kurtosis 7.3 9.0 19.8 7.3 10.4 7.4 5.3 5.2 3.8 1.1 0.9 48 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 53,
    "chunk_index": 82,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "(-13.39) (-9.84) (-6.52) (-3.32) (2.16) (10.85) (38.69) (60.36) StDev 0.069 0.068 0.071 0.069 0.073 0.075 0.078 0.080 0.086 0.110 0.103 Skewness 0.7 0.7 1.4 0.7 1.1 0.8 0.8 0.9 0.9 0.6 0.7 Kurtosis 7.3 9.0 19.8 7.3 10.4 7.4 5.3 5.2 3.8 1.1 0.9 48 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 53,
    "chunk_index": 83,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table IA.2 Controlling for Volatility Measures, and Firm Characteristics This table reports the results from the modi(cid:133)ed Fama-MacBeth cross-sectional regressions proposed by Brennan, Chordia, and Subrahmanyam (1998) as in ri;t (cid:0) (cid:12) i Ft = (cid:13) 0;t +(cid:13) 00;t Zi;t (cid:0) 1+\"i;t; where ri;t is the straddle return in excess of the risk free rate for each security iat time t, Ft are the Fama-French-Carhart, coskewness and cokurtosis factors, and Zi;t 1 are the b (cid:0) characteristicsforeachstockiattimet 1. The(cid:12) areestimatedinthe(cid:133)rststageforeachstockiusingtheentiresample. The (cid:0) i characteristics are volatility measures minus IV1M (Volatility measures are the long-term implied volatility (IVLT), realized b volatility computed with 5-minute returns over 1 day (RV1d), and 1 week (RV1w), implied volatility lagged by one month (IV 1 t M(cid:0) 1),3months(IV 1 t M(cid:0) 3),and6months(IV 1 t M(cid:0) 6),andidiosyncraticvolatility(idioVol)),optionskew(Xing,ZhangandZhao (2010)), the right-tail and left-tail risk neutral jumps (Bollerslev and Todorov (2011)), option dollar volume ($Vol), option volume contracts (Vol), option open interest (OI), bid-to-mid option spread (BM), size (market capitalization in $ billions), book-to-market ratio (BE/ME), historical volatility (HV), skewness (HSkew) and kurtosis (HKurt). The (cid:133)rst row gives the coe¢ cientsoftheregressionandthesecondrowgivestheNewey-Westt-statistics(inparentheses). AdjustedR2 isreportedat the bottom ofthe table. The sample period for OptionMetrics stocks is January 1996 to January 2012. (1) (2) (3) (4) (5) (6) (7) (8) (9) Intercept 0.001 0.0001 -0.001 -0.001 -0.001 -0.002 -0.004 0.013 0.004 (0.57) (0.14) (-0.38) (-0.48) (-0.27) (-0.74) (-1.89) (2.65) (1.47) Slope VTS 0.209 0.215 0.210 0.165 0.189 0.230 0.202 0.211 0.225 (14.90) (15.25) (13.18) (11.30) (12.81) (16.45) (13.72) (15.85) (16.22) RV -IV 0.032 1d 1M (7.85) RV -IV 0.026 1w 1M (4.49) t 1 IV 1(cid:0)M -IV 1M 0.016 (1.69) t 3 IV 1(cid:0)M -IV 1M 0.059 (7.29) t 6 IV 1(cid:0)M -IV 1M 0.034 (4.98) IdioVol-IV -0.012 1M (-2.39) OptionSkew 0.143 (9.52) RNJump Right 0.059 (4.22) RNJump Left -0.082 (-5.09) Ln($Vol) -0.005 (-3.00) Ln(Vol) 0.006 (3.21) Ln(OI) -0.003 (-4.50) Ln(BM) 0.076 (3.35) Ln(size) -0.0001 (-2.38) BE/ME -0.001 (-0.67) HV -0.010 (-1.99) HSkew 0.0005 (0.95) HKurt -0.0001 (-1.08) Adj. R2 0.0077 0.0078 0.0076 0.0082 0.0085 0.0074 0.0138 0.016 0.0143 49 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 53,
    "chunk_index": 84,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "0.059 (4.22) RNJump Left -0.082 (-5.09) Ln($Vol) -0.005 (-3.00) Ln(Vol) 0.006 (3.21) Ln(OI) -0.003 (-4.50) Ln(BM) 0.076 (3.35) Ln(size) -0.0001 (-2.38) BE/ME -0.001 (-0.67) HV -0.010 (-1.99) HSkew 0.0005 (0.95) HKurt -0.0001 (-1.08) Adj. R2 0.0077 0.0078 0.0076 0.0082 0.0085 0.0074 0.0138 0.016 0.0143 49 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 53,
    "chunk_index": 85,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table IA.3 Double Sorting on Firm Characteristics and the Slope of the Volatility Term Structure Each week, (cid:133)rms are (cid:133)rst sorted into quintiles based on volatility measures (minus IV ), and then, within 1M each quintile, (cid:133)rms are sorted into quintiles by the slope of the volatility term structure, de(cid:133)ned as IV LT (cid:0) IV . The slope of the volatility term structure portfolios are averaged over each of the (cid:133)ve characteristic 1M portfoliostoformP1 toP5 . P1 (P5 )averagestheportfolioswiththelowest(highest)slopeofthe avg avg avg avg volatility term structure for each quintile characteristic portfolio. The characteristics included are volatility measuresminusIV (Volatilitymeasuresarerealizedvolatilitycomputedwith5-minutereturnsover1day 1M (RV ),and1week(RV ),impliedvolatilitylaggedbyonemonth(IVt 1),3months(IVt 3),and6months 1d 1w 1M(cid:0) 1M(cid:0) (IVt 6), and idiosyncratic volatility (idioVol)), option skew (Xing, Zhang and Zhao (2010)), the right-tail 1M(cid:0) andleft-tailriskneutraljumps(BollerslevandTodorov(2011)),optiondollarvolume($Vol),optionvolume contracts(Vol),optionopeninterest(OI),bid-to-midoptionspread(BM),marketcapitalizationin$billions (Size),book-to-marketratio(BE/ME),historicalvolatility(HV),skewness(HSkew)andkurtosis(HKurt). This table reports the average straddle return for portfolios P1 to P5 , the di⁄erence between P1 avg avg avg and P5 , and the t-statistics (in parentheses). The sample period for OptionMetrics stocks is January avg 1996 to January 2012. Control P1 P2 P3 P4 P5 P5 P1 avg avg avg avg avg avg avg (cid:0) RV -IV -0.021 -0.010 -0.006 -0.002 0.013 0.034 1d 1M (-8.75) (-4.30) (-2.54) (-0.87) (4.63) (17.64) RV -IV -0.021 -0.011 -0.006 -0.003 0.013 0.034 1w 1M (-8.69) (-4.50) (-2.21) (-1.05) (4.74) (18.19) t 1 IV 1(cid:0)M -IV 1M -0.018 -0.008 -0.006 -0.001 0.008 0.026 (-7.60) (-3.51) (-2.55) (-0.55) (2.95) (16.55) t 3 IV 1(cid:0)M -IV 1M -0.017 -0.009 -0.006 -0.002 0.008 0.025 (-6.93) (-3.86) (-2.64) (-0.87) (2.93) (14.77) t 6 IV 1(cid:0)M -IV 1M -0.017 -0.011 -0.006 -0.002 0.009 0.026 (-7.27) (-4.78) (-2.28) (-0.76) (3.42) (15.41) IdioVol-IV -0.021 -0.010 -0.006 -0.002 0.013 0.034 1M (-8.83) (-4.39) (-2.62) (-0.72) (4.66) (19.31) OptionSkew -0.022 -0.010 -0.007 -0.001 0.013 0.035 (-9.43) (-4.16) (-2.73) (-0.42) (4.66) (17.84) RNJump Right -0.023 -0.010 -0.005 -0.001 0.013 0.036 (-9.74) (-4.08) (-2.19) (-0.50) (4.63) (19.90) RNJump Left -0.023 -0.010 -0.005 -0.001 0.013 0.036 (-9.88) (-4.03) (-2.07) (-0.58) (4.66) (20.25) $Vol -0.022 -0.009 -0.006 -0.002 0.013 0.035 (-9.34) (-3.86) (-2.60) (-0.66) (4.51) (17.21) Vol -0.021 -0.011 -0.006 -0.002 0.013 0.035 (-8.95) (-4.40) (-2.51) (-0.77) (4.76) (17.50) OI -0.022 -0.011 -0.006 -0.002 0.014 0.036 (-9.29) (-4.46) (-2.38) (-0.77) (4.90) (17.74) BM -0.022 -0.010 -0.006 -0.002 0.012 0.034 (-9.29) (-3.95) (-2.27) (-0.56) (4.27) (17.35) Size -0.023 -0.010 -0.006 0.000 0.014 0.037 (-9.94) (-4.22) (-2.52) (-0.15) (4.86) (18.80) BE/ME -0.023 -0.010 -0.007 -0.002 0.015 0.038 (-9.80) (-4.32) (-2.66) (-0.57) (5.25) (19.10) HV -0.024 -0.011 -0.005 0.000 0.013 0.037 (-10.58) (-4.60) (-1.97) (0.01) (4.73) (20.16) HSkew -0.022 -0.011 -0.006 -0.002 0.013 0.035 (-9.19) (-4.54) (-2.46) (-0.60) (4.74) (18.04) HKurt -0.022 -0.010 -0.006 -0.002 0.013 0.035 (-9.08) (-4.30) (-2.35) (-0.82) (4.71) (17.78) 50 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 53,
    "chunk_index": 86,
    "word_count": 448,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "(-4.32) (-2.66) (-0.57) (5.25) (19.10) HV -0.024 -0.011 -0.005 0.000 0.013 0.037 (-10.58) (-4.60) (-1.97) (0.01) (4.73) (20.16) HSkew -0.022 -0.011 -0.006 -0.002 0.013 0.035 (-9.19) (-4.54) (-2.46) (-0.60) (4.74) (18.04) HKurt -0.022 -0.010 -0.006 -0.002 0.013 0.035 (-9.08) (-4.30) (-2.35) (-0.82) (4.71) (17.78) 50 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 53,
    "chunk_index": 87,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table IA.4 Forecasting Realized Volatility This tables reports the average coe¢ cients and Newey-West t-statistics from the two pass Fama-MacBeth (1973) regressions. Each week, future realized volatility minus IV is regressed on various volatility mea- 1M suresminusIV asinFV IV =B +B (IV IV )+B (VolatilityMeasures IV )+ 1M i;t (cid:0) 1Mi;t 0;t 1;t LTi;t(cid:0) 1Mi;t k;t (cid:0) 1Mi;t \" :Inthesecondstep, theestimatorforeachcoe¢ cientistheaverageofthetimeseriescoe¢ cients. Future i;t realized volatility (FV ) is the standard deviation of the underlying daily stock return over the following i;t week. Volatility measures are the long-term implied volatility (IV ), realized volatility computed with LT 5-minute returns over 1 day (RV ) and 1 week (RV ), implied volatility lagged by 1 month (IVt 1) and 3 1d 1w 1M(cid:0) months (IVt 3), and idiosyncratic volatility (IdioVol). We report adjusted R2 and Newey-West t-statistics 1M(cid:0) with 3 lags in parentheses. Additionally, this table reports the percentage of regressors with t-statistics over 1:96 for each estimator. The sample period for OptionMetrics stocks is January 1996 to January 2012. (1) (2) (3) (4) (5) Intercept -0.035 -0.035 -0.043 -0.044 -0.038 (-9.70) (-10.3) (-10.9) (-11.0) (-9.68) IV -IV 0.164 0.133 0.231 0.195 0.198 LT 1M (6.29) (5.02) (7.80) (7.50) (7.70) RV -IV 0.147 1d 1M (21.05) RV -IV 0.190 1w 1M (17.63) t 1 IV 1(cid:0)M -IV 1M -0.001 (-0.07) t 3 IV 1(cid:0)M -IV 1M 0.029 (2.43) IdioVol-IV 0.048 1M (6.45) Adj. R2 4% 4% 3% 3% 3% Pct. of t>1.96 (IV LT -IV 1M ) 36% 32% 37% 34% 39% Pct. of t>1.96 (RV 1d -IV 1M ) 51% Pct. of t>1.96 (RV 1w -IV 1M ) 51% t 1 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 18% t 3 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 20% Pct. of t>1.96 (IdioVol-IV 1M ) 27% 51 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 51,
    "page_range": "p.51",
    "total_pages": 53,
    "chunk_index": 88,
    "word_count": 305,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.51)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "(RV 1d -IV 1M ) 51% Pct. of t>1.96 (RV 1w -IV 1M ) 51% t 1 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 18% t 3 Pct. of t>1.96 (IV 1(cid:0)M -IV 1M ) 20% Pct. of t>1.96 (IdioVol-IV 1M ) 27% 51 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 53,
    "chunk_index": 89,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "Table IA.5 Long-Short Straddle Returns for Di⁄erent Sub-Samples This table reports equal-weighted straddle returns along with the t-statistics (t-stat) of decile portfoliosfordi⁄erentsub-samples. Thelastcolumndisplaysthedi⁄erencebetweendecileportfolio 10(highestslopeofvolatilitytermstructure)anddecile1(lowestslopeofvolatilitytermstructure). Moneyness is de(cid:133)ned as the option strike over the stock price. The triple witching Friday (TWF) referstothethirdFridayofeveryMarch,June,September,andDecemberwhenthreedi⁄erentkinds ofsecuritiesexpireonthesameday: stockindexfutures,stockindexoptions,andstockoptions. The January group includes only straddle returns for that month. The arbitrage-bounds group includes stocks that violate arbitrage bounds as suggested by Duarte and Jones (2007). The earnings announcement (EA) group includes stocks that made the announcement during the life of the options. Twoweightingschemesarereported: optiondollarvolumeandoptiondollaropeninterest. Finally, we form decile portfolio based on three de(cid:133)nitions for the slope of the volatility term structure with a standardized maturity for the long-term volatility: IV IV ,IV IV , 3M 1M 6M 1M (cid:0) (cid:0) and IV IV . The sample period for OptionMetrics stocks is January 1996 to January 2012. 9M 1M (cid:0) P1 P2 P3 P4 P5 P6 P7 P8 P9 P10 P10-P1 Baseline Portfolio -0.029 -0.015 -0.010 -0.010 -0.008 -0.005 -0.003 -0.001 0.006 0.022 0.051 (-11.18) (-6.06) (-4.12) (-3.78) (-3.24) (-1.76) (-1.03) (-0.45) (2.02) (7.35) (19.93) Moneyness: 0.975 - 1.025 -0.030 -0.016 -0.013 -0.013 -0.007 -0.007 -0.003 -0.001 0.005 0.020 0.050 (-10.49) (-5.82) (-4.66) (-4.64) (-2.58) (-2.34) (-1.10) (-0.46) (1.67) (6.20) (17.00) Unbounded Moneyness -0.031 -0.014 -0.009 -0.010 -0.007 -0.004 -0.003 0.000 0.008 0.019 0.050 (-12.99) (-6.02) (-3.93) (-4.16) (-2.78) (-1.68) (-1.06) (0.02) (2.71) (6.95) (19.95) Period 1996-2003 -0.027 -0.009 -0.003 -0.003 0.000 0.005 0.007 0.010 0.018 0.036 0.063 (-6.83) (-2.33) (-0.95) (-0.91) (-0.04) (1.35) (1.85) (2.60) (4.46) (8.38) (15.31) Period 2004-2012 -0.031 -0.022 -0.017 -0.016 -0.016 -0.014 -0.013 -0.012 -0.006 0.008 0.039 (-9.18) (-6.41) (-4.95) (-4.50) (-4.52) (-3.95) (-3.35) (-3.01) (-1.48) (1.96) (13.30) TWF Months -0.044 -0.030 -0.023 -0.025 -0.018 -0.021 -0.017 -0.014 -0.009 0.007 0.049 (-9.23) (-5.95) (-4.69) (-5.45) (-3.75) (-4.11) (-3.14) (-2.51) (-1.50) (1.15) (11.13) Non TWF Months -0.028 -0.013 -0.009 -0.005 -0.007 -0.002 -0.001 -0.001 0.007 0.022 0.048 (-7.99) (-4.05) (-2.88) (-1.58) (-2.24) (-0.69) (-0.40) (-0.33) (1.75) (5.63) (14.54) January -0.037 -0.012 -0.020 -0.013 -0.009 -0.008 -0.005 -0.009 0.001 0.017 0.054 (-4.36) (-1.41) (-2.61) (-1.45) (-1.11) (-0.94) (-0.57) (-0.99) (0.10) (1.55) (5.66) Non-January -0.028 -0.016 -0.010 -0.009 -0.008 -0.004 -0.003 -0.001 0.006 0.022 0.050 (-10.37) (-5.90) (-3.55) (-3.51) (-3.06) (-1.57) (-0.90) (-0.19) (2.09) (7.23) (19.12) Arbitrage Bounds -0.032 -0.017 -0.016 -0.012 -0.009 -0.007 -0.005 -0.005 0.002 0.018 0.050 (-8.62) (-5.01) (-4.10) (-3.29) (-2.47) (-1.82) (-1.33) (-0.96) (0.69) (4.54) (13.38) EA Months -0.036 -0.005 -0.012 0.024 0.013 0.023 0.026 0.022 0.042 0.045 0.077 (-4.12) (-0.62) (-1.69) (2.77) (1.63) (3.32) (3.57) (3.13) (5.61) (5.88) (6.85) Non EA Months -0.032 -0.017 -0.015 -0.014 -0.010 -0.007 -0.005 -0.004 0.006 0.020 0.052 (-12.68) (-6.67) (-5.82) (-5.26) (-3.96) (-2.70) (-1.94) (-1.47) (1.84) (6.55) (20.77) $ Volume Weighted -0.032 -0.024 -0.018 -0.012 -0.007 -0.008 -0.008 -0.005 -0.005 0.011 0.044 (-7.06) (-6.06) (-4.42) (-2.95) (-1.77) (-2.07) (-1.89) (-1.19) (-1.25) (2.82) (7.98) $ Open Interest Weighted -0.034 -0.022 -0.016 -0.015 -0.013 -0.007 -0.005 -0.005 -0.004 0.009 0.043 (-10.08) (-6.55) (-4.77) (-4.14) (-4.14) (-2.15) (-1.32) (-1.48) (-1.23) (2.44) (10.46) Slope VTS = IV -IV -0.028 -0.011 -0.011 -0.013 -0.009 -0.007 -0.004 0.003 0.009 0.022 0.050 3M 1M (-9.53) (-3.83) (-3.77) (-4.66) (-3.40) (-2.53) (-1.20) (1.09) (2.90) (6.64) (15.13) Slope VTS = IV -IV -0.029 -0.016 -0.012 -0.009 -0.008 -0.007 -0.004 0.000 0.006 0.021 0.049 6M 1M (-11.39) (-6.11) (-4.39) (-3.56) (-2.83) (-2.52) (-1.32) (0.11) (2.11) (7.04) (20.50) Slope VTS = IV -IV -0.030 -0.016 -0.010 -0.010 -0.009 -0.005 -0.004 -0.001 0.004 0.019 0.050 9M 1M (-11.22) (-6.03) (-3.85) (-3.86) (-3.27) (-1.67) (-1.23) (-0.39) (1.43) (6.31) (18.11) 52 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 53,
    "chunk_index": 90,
    "word_count": 588,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  },
  {
    "text": "0.021 0.049 6M 1M (-11.39) (-6.11) (-4.39) (-3.56) (-2.83) (-2.52) (-1.32) (0.11) (2.11) (7.04) (20.50) Slope VTS = IV -IV -0.030 -0.016 -0.010 -0.010 -0.009 -0.005 -0.004 -0.001 0.004 0.019 0.050 9M 1M (-11.22) (-6.03) (-3.85) (-3.86) (-3.27) (-1.67) (-1.23) (-0.39) (1.43) (6.31) (18.11) 52 Electronic copy available at: https://ssrn.com/abstract=1944298 Table IA.6 Portfolio Risk Measures This table reports two risk measures, the one-week 5% value-at-risk and the 5% expected shortfall computed with historical simulation for each decile portfolio of straddles sorted by the slope of the volatility term structure. The sample period for OptionMetrics stocks is January 1996 to January 2012. Portfolio Risk Measures 1 2 3 4 5 6 7 8 9 10 Value at Risk - 5% 0.131 0.119 0.116 0.116 0.107 0.101 0.109 0.102 0.099 0.084 Expected Shortfall - 5% 0.176 0.162 0.160 0.167 0.161 0.159 0.170 0.164 0.168 0.150 53 Electronic copy available at: https://ssrn.com/abstract=1944298",
    "title": "Equity Volatility Term Structures and the Cross - Section of Option Returns",
    "source_type": "pdf",
    "document_id": "75b502e5e248",
    "source_file": "Equity Volatility Term Structures and the Cross-Section of Option Returns.pdf",
    "section": "References",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 53,
    "chunk_index": 91,
    "word_count": 149,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20151123155401-06'00'",
    "duration": null
  }
]