[
  {
    "text": "W CAMPBELL R. HARVEY e provide some new tools whether there is anything we can learn in is a professor at Duke to evaluate trading strate- finance from other scientific fields. Although University in Durham, gies. When it is known that the advent of machine learning is relatively NC, and a fellow at many strategies and com- new to investment management, similar the National Bureau binations of strategies have been tried, we situations involving a large number of tests of Economic Research in Cambridge, MA. need to adjust our evaluation method for have been around for many years in other sci- cam.harvey@duke.edu these multiple tests. Sharpe ratios and other ences. It makes sense that there may be some statistics will be overstated. Our methods insights outside of finance that are relevant YAN LIU are simple to implement and allow for the to finance. is an assistant professor at real-time evaluation of candidate trading Our first example is the widely heralded Texas A&M University in College Station, TX. strategies. discovery of the Higgs Boson in 2012. The y-liu@mays.tamu.edu Consider the following trading strategy particle was first theorized in 1964—the same detailed in Exhibit 1.1 Although there is a year as William Sharpe’s paper on the capital minor drawdown in the first year, the strategy asset pricing model (CAPM) was published.2 is consistently profitable through 2014. Indeed, The first tests of the CAPM were published the drawdowns throughout the history are eight years later3 and Sharpe was awarded a minimal. The strategy even does well during Nobel Prize in 1990. For Peter Higgs, it was the financial crisis. Overall, this strategy a much longer road. It took years to complete appears very attractive and many investment the Large Hadron Collider (LHC) at a cost managers would pursue this strategy. of about $5 billion.4 The Higgs Boson was Our research (see Harvey and Liu declared “discovered” on July 4, 2012, and [2014a] and Harvey et al. [2014]) offers some Nobel Prizes were awarded in 2013.5 tools to evaluate strategies such as the one So why is this relevant for finance? It presented in Exhibit 1. It turns out that simply has to do with the testing method. Scientists looking at average profitability, consistency, knew that the particle was rare and that it and size of drawdowns is not sufficient to decays very quickly. The idea of the LHC give a strategy a passing grade. is to have beams of particles collide. Theo- retically, you would expect to see the Higgs Boson in one in ten billion collisions within TESTING IN OTHER FIELDS the LHC.6 The Boson quickly decays and OF SCIENCE key is measuring the decay signature. Over Before presenting our method, it is a quadrillion collisions were conducted and important to take a step back and determine a massive amount of data was collected. The 108 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 11,
    "chunk_index": 0,
    "word_count": 517,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "amount of data was collected. The 108 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 11,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "E X H I B I T 1 A Candidate Trading Strategy Source: AHL Research. problem is that each of the so-called decay signatures a single gene but the interactions among several genes. can also be produced by normal events from known Counting all the possibilities, the total number of tests processes. can easily exceed a million. Given this large number of To declare a discovery, scientists agreed to what tests, a tougher standard must be applied. With the con- appeared to be a very tough standard. The observed ventional thresholds, a large percentage of studies that occurrences of the candidate particle (Higgs Boson) had document significant associations are not replicable.7 to be five standard deviations different from a world To give an example, a recent study in Nature claims where there was no new particle. Five standard devia- to find two genetic linkages for Parkinson’s disease.8 tions is generally considered a tough standard. Yet in About a half a million genetic sequences are tested for the finance, we routinely accept discoveries where the t-sta- potential association with the disease. Given this large tistic exceeds two—not five. Indeed, there is a hedge number of tests, tens of thousands of genetic sequences fund called Two Sigma. will appear to affect the disease under conventional stan- Particle physics is not alone in having a tougher dards. We need a tougher standard to lower the possi- hurdle to clear. Consider the research done in bioge- bility of false discoveries. Indeed, the identified gene loci netics. In genetic association studies, researchers try to from the tests have t-statistics that exceed 5.3. link a certain disease to human genes and they do this by There are many more examples such as the search testing the causal effect between the disease and a gene. for exoplanets. However, there is a common theme in Given that there are more than 20,000 human genes that these examples. A higher threshold is required because are expressive, multiple testing is a real issue. To make it the number of tests is large. For the Higgs Boson, there even more challenging, a disease is often not caused by were potentially trillions of tests. For research in bioge- SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 109 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 11,
    "chunk_index": 2,
    "word_count": 412,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "For research in bioge- SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 109 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 11,
    "chunk_index": 3,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "netics, there are millions of combinations. With multiple However, we are making a fundamental mistake tests, there is a chance of a fluke finding. with the statistical analysis. The statement about the false discovery percentage is conditional on an independent test. This means there is a single test. That is unlikely to REVALUATING THE CANDIDATE STRATEGY be the case in our trading strategy and it was certainly Let’s return to the candidate trading strategy not the case with the research conducted at the LHC, detailed in Exhibit 1. This strategy has a Sharpe ratio of where there were trillions of tests. With multiple tests, 0.92. There is a simple formula to translate the Sharpe we need to adjust our hurdles for establishing statistical ratio into a t-statistic:9 significance. This is the reason why the researchers at LHC used a five-sigma rule. This is the reason why T-statistic = SharpeRatio × Numberof years biomedical researchers routinely look for four-sigma events. In this case, the t-statistic is 2.91. This means that Multiple testing is also salient in finance—yet little the observed profitability is about three standard devia- has been done to adjust the way that we conduct our tests. tions from the null hypothesis of zero profitability. A Exhibit 2 completes the trading strategy example.10 three-sigma event (assuming a normal distribution) hap- Each of the trading strategies in Exhibit 2 was ran- pens only 1% of the time. This means that the chance domly generated at the daily frequency. We assumed an that our trading strategy is a false discovery is less than annual volatility of 15% (about the same as the S&P 500) 1%. and a mean return of zero. The candidate trading strategy E X H I B I T 2 200 Randomly Generated Trading Strategies Source: AHL Research. 110 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 11,
    "chunk_index": 4,
    "word_count": 343,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "Generated Trading Strategies Source: AHL Research. 110 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 11,
    "chunk_index": 5,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "highlighted in Exhibit 1 is the best strategy in Exhibit 2 There are many obvious applications. One that is (dark red curve). immediate is in the evaluation of fund managers. With To be clear, all of the strategies in Exhibit 2 more than 10,000 managers, you expect some to ran- are based on random numbers—not actual returns. domly outperform year after year.11 Indeed, if managers Although the candidate trading strategy in Exhibit 1 were randomly choosing strategies, you would expect seemed very attractive, it was simply a fluke. Yet the at least 300 of them to have five consecutive years of usual tools of statistical analysis would have declared this outperformance. strategy “significant.” The techniques we will offer in Our research offers some guidance on handling this article will declare the candidate strategy, with the these multiple-testing problems. Sharpe ratio of 0.92, insignificant. It is crucial to correct for multiple testing. Con- TWO VIEWS OF MULTIPLE TESTING sider a simple example that has some similarities to this example. Suppose we are interested in predicting Y. We There are two main approaches to the multiple- propose a candidate variable X. We run a regression and testing problem in statistics. They are known as the get a t-statistic of 2.0. Assuming that no one else had family-wise error rate (FWER) and the false discovery tried to predict Y before, this qualifies as an independent rate (FDR). The distinction between the two is very test and X would be declared significant at the 5% level. intuitive. Now let’s change the problem. Suppose we still want In the family-wise error rate, it is unacceptable to to predict Y. However, now we have 20 different X make a single false discovery. This is a very severe rule variables, X, X ,…,X . Suppose one of these variables but completely appropriate for certain situations. With 1 2 20 achieves a t-statistic of 2.0. Is it really a true predictor? the FWER, one false discovery is unacceptable in 100 Probably not. By random chance, when you try so many tests and equally as unacceptable in 1,000,000 tests. In variables, one might work. contrast, the false discovery rate views unacceptable in Here is another classic example of multiple tests. terms of a proportion. For example, if one false discovery Suppose you receive a promotional email from an invest- were unacceptable for 100 tests, then 10 are unaccept- ment manager promoting a stock. The email asks you to able for 1,000 tests. The FDR is much less severe than judge the record of recommendations in real time. Only the FWER. a single stock is recommended and the recommendation Which is the more appropriate method? It depends is either long or short. You get an email every week for on the application. For instance, the Mars One founda- 10 weeks. Each week the manager is correct. The track tion is planning a one-way manned trip to Mars in 2024 record is amazing because the probability of such an and has plans for many additional landings.12 It is unac- occurrence is very small (0.510 = 0.000976). Conven- ceptable to have any critical part fail during the mission. tional statistics would say there is a very small chance A critical failure is an example of a false discovery (we (0.00976% this is a false discovery, that is, the manager thought the part was good but it was not—just as we is no good). You hire the manager. thought the investment manager was good but she was Later you find out the strategy. The manager ran- not). domly picks a stock and initially sends out 100,000 emails The best-known FWER test is called the Bonfer- with 50% saying long and 50% saying short. If the stock roni test. It is also the simplest test to implement. Suppose goes up in value, the next week’s mailing list is trimmed we start with a two-sigma rule for a single (independent) to 50,000 (only sending to the long recommendations). test. This would imply a t-ratio of 2.0. The interpreta- Every week the list is reduced by 50%. By the end of the tion is that the chance of the single false discovery is only tenth week, 97 people would have received this amazing 5% (remember a single false discovery is unacceptable). track record of 10 correct picks in a row. Equivalently, we can say that we have 95% confidence If these 97 people had realized how the promo- that we are not making a false discovery. tion was organized, then getting 10 in a row would be Now consider increasing the number of tests to 10. expected. Indeed, you get the 97 people by multiplying The Bonferroni method adjusts for the multiple tests. 100,000 × 0.510. There is no skill here. It is random. Given the chance that one test could randomly show up as significant, the Bonferroni requires the confidence SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 111 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 11,
    "chunk_index": 6,
    "word_count": 861,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "Bonferroni requires the confidence SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 111 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 11,
    "chunk_index": 7,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "level to increase. Instead of 5%, you take the 5% and the hurdle). Given the first test has a p-value of 0.001, divide by the number of tests, that is, 5%/10 = 0.5%. it passes the test. Notice the hurdle for the first test is Again equivalently, you need to be 99.5% confident identical to the Bonferroni. However, in contrast to the with 10 tests that you are not making a single false dis- Bonferroni, which has a single threshold for all tests, the covery. In terms of the t-statistic, the Bonferroni requires other tests will have a different hurdle under Holm; for a statistic of at least 2.8 for 10 tests. For 1,000 tests, the example, the second test would be 0.05/(10 + 1 − 2) = statistic must exceed 4.1. 0.0055. However, there are three issues with the Bonfer- Starting from the first test, we sequentially com- roni test. First, there is the general issue about the FWER pare the p-values with their hurdles. When we first come error rate versus FDR. Evaluating a trading strategy is across the test such that its p-value fails to meet the not a mission to Mars. Being wrong could cost you your hurdle, we reject this test and all others with higher job and money will be lost—but it is unlikely a matter of p-values. life and death. However, reasonable people may disagree The Holm test captures the information in the with this view. distribution of the test statistics. The Holm test is less The second issue is related to correlation among stringent than the Bonferroni because the hurdles are the tests. There is a big difference between trying 10 relaxed after the first test. However, the Holm still fits variables that are all highly correlated and 10 variables into the category of the FWER. Next, we explore the that are completely uncorrelated. Indeed, at the extreme, other approach. if the 10 tests were perfectly correlated, this is equivalent As mentioned earlier, the false discovery rate to a single, independent test. approach allows an expected proportional error rate The third issue is that the Bonferroni test omits (see Benjamini and Hochberg [1995] and Benjamini important information. Since the work of Holm [1979], and Yekutieli [2001]). As such, it is less stringent than it has been known that there is information in the indi- both the Bonferroni and the Holm test. It is also easy vidual collection of test statistics and it can be used to to implement. Again, we sort the tests. The BHY for- sharpen the test.13 The Bonferroni test ignores all of this mula is information and derives a hurdle rate from the original level of significance divided by the total number of p = k×α tests. k M ×c( ) Let’s first tackle the last issue. Holm [1979] pro- vides a way to deal with the information in the test where c(M) is a simple function that is increasing in M statistics. Again, suppose we have 10 tests. We know and equals 2.93 when M = 10.14 In contrast to the Holm that the hurdle for the Bonferroni method would be test, we start from the last test (least significant) and 0.005 or 0.5%. evaluate the BHY formula. The Holm method begins by sorting the tests For the last test, k = M = 10, the BHY hurdle is from the lowest p-value (most significant) to the highest 0.05/c(10) = 0.05/2.93 = 0.0171. For the second last test, (least significant). Let’s call the first k = 1 and the last k = M − 1 = 9, the BHY hurdle is 9 × 0.05/10 × 2.93 = k = 10. Starting from the first test, the Holm function 0.0154. Notice that these hurdles are larger and thus is evaluated. more lenient that the Bonferroni implied hurdle (that is, 0.0050). α p = Starting from the last test, we sequentially com- k M +1−k pare the p-values with their thresholds. When we first come across the test such that its p-value falls below its where α is the level of significance (0.05) in our case threshold, we declare this test significant and all tests and M is the total number of tests. that have a lower p-value. Suppose the most significant test in our example Similar to the Holm test, BHY also relies on the has a p-value of 0.001. Calculating the Holm function, distribution of test statistics. However, in contrast to we get 0.05/(10 + 1 − 1) = 0.005. The Holm function the Holm test that begins with the most significant gives the hurdle (observed p-value must be lower than test, the BHY approach starts with the least significant 112 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 11,
    "chunk_index": 8,
    "word_count": 826,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "approach starts with the least significant 112 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 11,
    "chunk_index": 9,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "test.15 There are usually more discoveries with BHY. Our view is the following. Making the mistake of The reason is that BHY allows for an expected propor- using the single test criteria for multiple tests induces a tion of false discoveries, which is less demanding than very large number of false discoveries (large amount of the absolute occurrence of false discoveries under the Type I error). When we increase the hurdle, we greatly FWER approaches. We believe the BHY approach is the reduce the Type I error at minimal cost to the Type II most appropriate for evaluating trading strategies. (missing discoveries). Exhibit 3 illustrates this point. The first panel denotes the mistake of using single test methods. There are two distributions. The first is FALSE DISCOVERIES AND MISSED the distribution of strategies that don’t work. It has an DISCOVERIES average return of zero. The second is the distribution So far, we have discussed false discoveries, which of truly profitable strategies, which has a mean return are trading strategies that appear to be profitable—but greater than zero. Notice that there is a large amount they are not. Multiple testing adjusts the hurdle for sig- of Type I error (false discoveries). The second panel nificance because some tests will appear significant by shows what happens when we increase the threshold. chance. The downside of doing this is that some truly Notice the number of false discoveries is dramatically significant strategies might be overlooked because they reduced. However, the increase in missed discoveries did not pass the more stringent hurdle. is minimal. This is the classic tension between Type I errors and Type II errors. The Type I error is the false discovery HAIRCUTTING SHARPE RATIOS (investing in an unprofitable trading strategy). The Type II error is missing a truly profitable trading strategy. Harvey and Liu [2014a] provide a method for Inevitably there is a tradeoff between these two errors. adjusting Sharpe ratios to take into account multiple In addition, in a multiple testing setting it is not obvious testing. Sharpe ratios based on historical back tests are how to jointly optimize these two types of errors. often inflated because of multiple testing. Researchers E X H I B I T 3 False Trading Strategies, True Trading Strategies SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 113 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 11,
    "chunk_index": 10,
    "word_count": 422,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "Strategies, True Trading Strategies SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 113 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 11,
    "chunk_index": 11,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "E X H I B I T 3 (continued) explore many strategies and often choose to present the (or 95% confidence that the identified strategy is not one with the largest Sharpe ratio. But the Sharpe ratio false): for this strategy no longer represents its true expected profitability. With a large number of tests, it is very p-value of test < threshold likely that the selected strategy will appear to be highly Bonferroni divides the threshold (0.05) by the profitable just by chance. To take this into account, we number of tests, our case 200: need to haircut the reported Sharpe ratio. In addition, the haircut needs to be larger if there are more tests p-value of test < 0.05/200. tried. Take the candidate strategy in Exhibit 1 as an Equivalently, we could multiply the p-value of the example. It has a Sharpe ratio of 0.92 and a corre- individual test by 200 and check each test to identify sponding t-statistic of 2.91. The p-value is 0.4%; hence, which ones are less than 0.05, i.e. if there were only one test, the strategy would look (p-value of test) × 200 < 0.05 very attractive because there is only a 0.4% chance it is a fluke. However, with 200 tests tried, the story is In our case, the original p-value is 0.004 and when completely different. Using the Bonferroni multiple- multiply by 200 the adjusted p-value is 0.80 and the testing method, we need to adjust the p-value cutoff to corresponding t-statistic is 0.25. This high p-value is sig- 0.05/200 = 0.00025. Hence, we would need to observe nificantly greater than the threshold, 0.05. Our method a t-statistic of at least 3.66 to declare the strategy a true asks how large the Sharpe ratio should be in order to discovery with 95% confidence. The observed t-statistic, generate a t-statistic of 0.25. The answer is 0.08. There- 2.92 is well below 3.66—hence, we would pass on this fore, knowing that 200 tests have been tried and under strategy. Bonferroni’s test, we successfully declare the candidate There is an equivalent way of looking at the Bon- strategy with the original Sharpe ratio of 0.92 as insig- ferroni test. To declare a strategy true, its p-value must nificant—the Sharpe ratio that adjusts for multiple tests be less than some predetermined threshold such as 5% 114 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 11,
    "chunk_index": 12,
    "word_count": 434,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "some predetermined threshold such as 5% 114 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 11,
    "chunk_index": 13,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "is only 0.08. The corresponding haircut is large, 91% IN-SAMPLE AND OUT-OF-SAMPLE (= (0.92 – 0.08)/0.92). Until now, we evaluate trading strategies from an Turning to the other two approaches, the Holm in-sample (IS) testing perspective, that is, we use all the test makes the same adjustment as Bonferroni since the information in the history of returns to make a judg- t-statistic for the candidate strategy is the smallest among ment. Alternatively, one can divide the history into two the 200 strategies. Not surprisingly, BHY also strongly subsamples—one in-sample period and the other out- rejects the candidate strategy. of-sample (OOS) period—and use OOS observations to The fact that each of the multiple-testing methods evaluate decisions made based on the IS period. rejects the candidate strategy is a good outcome because There are a number of immediate issues. First, we know all of these 200 strategies are just random num- often the OOS period is not really out-of-sample because bers. A proper test also depends on the correlation among the researcher knows what has happened in that period. test statistics, as we discussed previously. This is not an Second, in dicing up the data, we run into the possibility issue in the 200 strategies because we did not impose any that, with fewer observations in the in-sample period, correlation structure on the random variables. Harvey we might not have enough power to identify true strate- and Liu [2014b] explicitly take the correlation among gies. That is, some profitable trading strategies do not tests into account and provide multiple-testing-adjusted make it to the OOS stage. Finally, with few observa- Sharpe ratios using a variety of methods. tions in the OOS period, some true strategies from the IS period may not pass the test in the OOS period and AN EXAMPLE WITH STANDARD be mistakenly discarded. AND POOR’S CAPITAL IQ Indeed, for the three strategies in the Capital IQ data, if we use the recent five years as the OOS To see how our method works on a real data set of period for the OOS approach, the OOS Sharpe ratios strategy returns, we use the S&P Capital IQ database. It are 0.64, −0.30, and 0.18, respectively. We see that the includes detailed information on the time-series of 484 third strategy has a small Sharpe ratio and is insignifi- strategies for the U.S. equity market. Additionally, these cant (p-value = 0.53) for this five-year OOS period, strategies are catalogued into eight groups based on the although it is borderline significant for the full sample types of risks to which they are exposed. We choose the (p-value = 0.11), even after multiple-testing adjustment. most profitable strategy from each of the three catego- The problem is that with only 60 monthly observations ries: price momentum, analyst expectations, and capital in the OOS period, a true strategy will have a good efficiency. These trading strategies are before costs and, chance to fail the OOS test. as such, the Sharpe ratios will be overstated. Recent research by López de Prado and his coau- The top performers in the three categories gen- thors pursues the out-of-sample route and develops a erate Sharpe ratios of 0.83, 0.37, and 0.67, respectively. concept called the probability of backtest overfitting The corresponding t-statistics are 3.93, 1.14, and 3.17 (PBO) to gauge the extent of backtest overfitting (see and their p-values (under independent testing) are Bailey et al. [2013a, b] and López de Prado [2013]). 0.00008, 0.2543, and 0.0015.16 We use the BHY meth- In particular, the PBO measures how likely it is for a od—our recommended method—to adjust the three superior strategy that is fit IS to underperform in the p-values based on the p-values for the 484 strategies OOS period. It succinctly captures the degree of backtest (we assume the total number of tried strategies is 484, overfitting from a probabilistic perspective and should that is, there are no missing tests). The three BHY- be useful in a variety of situations. adjusted p-values are 0.0134, 0.9995, and 0.1093 and To see the differences between the IS and OOS their associated t-statistics are 2.47, 0.00 and 1.60. The approach, we again take the 200 strategy returns in adjusted Sharpe ratios are 0.52, 0.00 and 0.34, respec- Exhibit 2 as an example. One way to do OOS testing tively. Therefore, by applying the BHY method, we is to divide the entire sample in half and evaluate the haircut the Sharpe ratios of the three top performers by 37% (=(0.83 – 0.52)/0.83), 100% (=(0.42 – 0)/0.42), performances of these 200 strategies based on the first and 49% (=(0.67 – 0.34)/0.67).17 half of the sample (IS), that is, the first five years. The evaluation is then put into further scrutiny based on the SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 115 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 11,
    "chunk_index": 14,
    "word_count": 834,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "scrutiny based on the SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 115 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 11,
    "chunk_index": 15,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "second half of the sample (OOS). The idea is that strate- that half the financial products (promising outperfor- gies that appear to be significant for the in-sample period mance) that companies are selling to clients are false. but are actually not true will likely to perform poorly To be clear, we are not accusing asset managers of for the out-of-sample period. Our IS sample approach, knowingly selling false products. We are pointing out on the other hand, uses all ten years’ information and that the statistical tools being employed to evaluate these makes the decision at the end of the sample. Using the trading strategies are inappropriate. This critique also method developed by López de Prado and his coauthors, applies to much of the academic empirical literature in we can calculate PBO to be 0.45.18 Therefore, there is finance—including many papers by one of the authors high chance (that is, a probability of 0.45) for the IS best of this article (Harvey). performer to have a below-median performance in the It is also clear that investment managers want to OOS. This is consistent with our result that based on promote products that are most likely to outperform in the entire sample, the best performer is insignificant if the future. That is, there is a strong incentive to get the we take multiple testing into account. However, unlike testing right. No one wants to disappoint a client and no the PBO approach that evaluates a particular strategy one wants to lose a bonus—or a job. Employing the statis- selection procedure, our method determines a haircut tical tools of multiple testing in the evaluation of trading Sharpe ratio for each of the strategies. strategies reduces the number of false discoveries. In principle, we believe there are merits in both the PBO as well as the multiple-testing approaches. A LIMITATIONS AND CONCLUSIONS successful merger of these approaches could potentially yield more powerful tools to help asset managers suc- Our work has two important limitations. First, for cessfully evaluate trading strategies. a number of applications the Sharpe ratio is not appro- priate because the distribution of the strategy returns is not normal. For example, two trading strategies might TRADING STRATEGIES AND FINANCIAL have identical Sharpe ratios but one of them might be PRODUCTS preferred because it has less severe downside risk. The multiple-testing problem greatly confounds Second, our work focuses on individual strate- the identification of truly profitable trading strategies gies. In actual practice, the investment manager needs and the same problems apply to a variety of sciences. to examine how the proposed strategy interacts with the Indeed, there is an influential paper in medicine by current collection of strategies. For example, a strategy Ioannidis [2005] called “Why Most Published Research with a lower Sharpe ratio might be preferred because Findings Are False.” Harvey et al. [2014] look at 315 dif- the strategy is relatively uncorrelated with current strate- ferent financial factors and conclude that most are likely gies. The denominator in the Sharpe ratio is simply the false after you apply the insights from multiple testing. strategy volatility and does not measure the contribution In medicine, the first researcher to publish a new of the strategy to the portfolio volatility. The strategy finding is subject to what they call the winner’s curse. portfolio problem, that is, adding a new strategy to a Given the multiple tests, subsequent papers are likely portfolio of existing strategies is the topic of Harvey to find a lesser effect or no effect (which would mean and Liu [2014c]. the research paper would have to be retracted). Similar In summary, the message of our research is simple. effects are evident in finance where Schwert [2003] Researchers in finance, whether practitioners or aca- and McLean and Pontiff [2014] find that the impact of demics, need to realize that they will find seemingly famous finance anomalies is greatly diminished out-of- successful trading strategies by chance. We can no longer sample—or never existed in the first place. use the traditional tools of statistical analysis that assume So where does this leave us? First, there is no reason that no one has looked at the data before and there is only to think that there is any difference between physical a single strategy tried. A multiple-testing framework sciences and finance. Most of the empirical research offers help in reducing the number of false strategies in finance, whether published in academic journals or adapted by firms. Two sigma is no longer an appropriate put into production as an active trading strategy by an benchmark for evaluating trading strategies. investment manager, is likely false. Second, this implies 116 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 11,
    "chunk_index": 16,
    "word_count": 816,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "is likely false. Second, this implies 116 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 11,
    "chunk_index": 17,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "ENDNOTES 47%, 100%, and 90%. These haircuts are larger than under the BHY approach. 1AHL Research [2014]. 18See AHL Research [2014]. The 0.45 is based on 16 2Sharpe [1964] for the CAPM. Higgs [1964] for the partitions of the data. Higgs Boson. 3See Black et al. [1972] and Fama and MacBeth REFERENCES [1973]. 4A 2009 brochure put the cost of the machine at about AHL Research. “Strategy Selection.” AHL internal research $4 billion and this does not include all other costs. See http:// paper, London, 2014. cds.cern.ch/record/1165534/files/CERN-Brochure-2009- 003-Eng.pdf retrieved July 10, 2014. ATLAS collaboration. “Observation of a New Particle in 5CMS [2012] and ATLAS [2012]. the Search for the Standard Model Higgs Boson with the 6See Baglio and Djouadi [2011]. ATLAS Detector at the LHC.” Physics Letters B, Vol. 716, 7See Hardy [2002]. No. 1 (2012), pp. 1-29. 8See Simon-Sanchez et al. [2009]. 9When returns are realized at higher frequencies, Sharpe Bailey, D., J. Borwein, M. López de Prado, and Q.J. Zhu. ratios and the corresponding t-statistics can be calculated in a “Pseudo-Mathematics and Financial Charlatanism: The straightforward way. Assuming that there are N return realiza- Effects of Backtest Overfitting on Out-of-Sample.” Working tions in a year and the mean and standard deviation of returns paper, Lawrence Berkeley National Laboratory, 2013a. at the higher frequency is μ and σ, the annualized Sharpe ratio can be calculated as (μ×N)/(σ× N) = (μ/σ) × N . The ——. “The Probability of Backtest Overfitting.” Working corresponding t-statistic is (μ/σ) × N×Numberof Years. paper, Lawrence Berkeley National Laboratory, 2013b. For example, for monthly returns, the annualized Sharpe ratio and the corresponding t-statistic are (μ×σ)× 12and Barras, L., O. Scaillet, and R. Wermers. “False Discoveries (μ/σ)× 12×Numberof years, respectively, where μ and σ in Mutual Fund Performance: Measuring Luck in Estimated are the monthly mean and standard deviation for returns. Alphas.” Journal of Finance, No. 65 (2010), pp. 179-216. Similarly, assuming μ and σ are the daily mean and standard deviation for returns and there are 252 trading days in a year, Baglio, J., and A. Djouadi. “Higgs Production at the IHC.” the annualized Sharpe ratio and the corresponding t-statistics Journal of High Energy Physics, Vol. 1103, No. 3 (2011), p. 55. are (μ/σ) × 252 and (μ/σ) × 252×Numberofyears. 10AHL Research [2014]. Benjamini, Y., and Y. Hochberg. “Controlling the False Dis- 11See Barras et al. [2010]. covery Rate: A Practical and Powerful Approach to Multiple 12See http://www.mars-one.com/mission/roadmap Testing.” Journal of the Royal Statistical Society, Series B 57 retrieved July 10, 2014. (1995), pp. 289-300. 13See Schweder and Spjotvoll [1982]. 14More specifically, c(M) = 1 + 1 + 1 + … + 1 = ∑M 1 2 3 M i=1 i Benjamini, Y., and D. Yekutieli. “The Control of the False and approximately equals log(M) when M is large. Discovery Rate in Multiple Testing Under Dependency.” 15For the p-value thresholds, whether or not BHY is Annals of Statistics, No. 29 (2001), pp. 1165-1188. more lenient than Holm depends on the specific distribution of p-values, especially when the number of tests M is small. Black, F., M.C. Jensen, and M. Scholes. “The Capital Asset When M is large, BHY implied hurdles are usually much Pricing Model: Some Empirical Tests.” In Studies in the Theory larger than Holm. of Capital Markets, edited by M. Jensen, pp. 79-121. New 16We have 269 monthly observations for the strategies York: Praeger, 1972. in the price momentum and capital efficiency groups and 113 monthly observations for the strategies in the analyst CMS collaboration. “Observation of a New Boson at a Mass expectations group. Therefore, the t-statistics are calculated of 125 GeV with the CMS Experiment at the LHC.” Physics as 0.83× (269/12) = 3.93, 0.37× (113/12) = 1.14 and 0.67 × Letters B, Vol. 716, No. 1 (2012), pp. 30-61. (269/12) = 3.17. 17Applying the Bonferroni test, the three p-values are Fama, E.F., and J.D. MacBeth. “Risk, Return, and Equilib- adjusted to be 0.0387, 1.0 and 0.7260. The corresponding rium: Empirical Tests.” Journal of Political Economy, No. 81 adjusted Sharpe ratios are 0.44, 0, 0.07 and the haircuts are (1973), pp. 607-636. SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 117 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 11,
    "chunk_index": 18,
    "word_count": 727,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "are (1973), pp. 607-636. SPECIAL 40TH ANNIVERSARY ISSUE THE JOURNAL OF PORTFOLIO MANAGEMENT 117 .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 11,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "López de Prado, M. “What to Look for in a Backtest.” Working paper, Lawrence Berkeley National Laboratory, 2013. McLean, R.D., and J. Pontiff. “Does Academic Research Destroy Stock Return Predictability?” Working paper, Uni- versity of Alberta, 2014. Ioannidis, J.P. “Why Most Published Research Findings Are False.” PLoS Medicine, No. 2, e124 (2005), pp. 694-701. Hardy, J. “The Real Problem in Association Studies.” Amer- ican Journal of Medical Genetics, Vol. 114, No. 2 (2002), p. 253. Harvey, C.R., and Y. Liu. “Backtesting.” Working paper, Duke University, 2014a. Available at http://papers.ssrn.com/ abstract=2345489. ——. “Multiple Testing in Economics.” Working paper, Duke University, 2014b. Available at http://papers.ssrn.com/ abstract=2358214. ——. “Incremental Factors.” Working paper, Duke Univer- sity, 2014c. Harvey, C.R., Y. Liu, and H. Zhu. “… and the Cross-section of Expected Returns.” Working paper, Duke University, 2014. Available at http://papers.ssrn.com/abstract=2249314. Higgs, P. “Broken Symmetries and the Masses of Gauge Bosons.” Physical Review Letters, Vol. 13, No. 16 (1964), pp. 508-509. Schweder, T., and E. Spjotvoll. “Plots of P-values to Eval- uate Many Tests Simultaneously.” Biometrika No. 69 (1982), pp. 439-502. Schwert, G.W. “Anomalies and Market Efficiency.” In The Handbook of the Economics of Finance, edited by G. Constan- tinides, M. Harris, and R.M. Stulz, 1 (2003), pp. 937-972. Simon-Sanchez, J., C. Schulte, and T. Gasser, “Genome- wide Association Study Reveals Genetic Risk Under- lying Parkinson’s Disease.” Nature Genetics, No. 41 (2009), pp. 1308-1312. To order reprints of this article, please contact Dewey Palmieri at dpalmieri@iijournals.com or 212-224-3675. 118 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 11,
    "chunk_index": 20,
    "word_count": 286,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  },
  {
    "text": "Dewey Palmieri at dpalmieri@iijournals.com or 212-224-3675. 118 EVALUATING TRADING STRATEGIES SPECIAL 40TH ANNIVERSARY ISSUE .41/03/90 no ztaK yrraH yb moc.slanruojii.www morf dedaolnwoD .811-801:5.04.4102 tnemeganaM oiloftroP fo lanruoJ ehT .noissimrep rehsilbuP tuohtiw yllacinortcele tsop ot ro resu dezirohtuanu na ot drawrof ,elcitra siht fo seipoc dezirohtuanu ekam ot lagelli si tI",
    "title": "Evaluating Trading Strategies",
    "source_type": "pdf",
    "document_id": "5e1323d93d9d",
    "source_file": "Evaluating Trading Strategies.pdf",
    "section": "CAMPBELL R. HARVEY AND YAN LIU",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 11,
    "chunk_index": 21,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "CAMPBELL R. HARVEY AND YAN LIU (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20140930211714Z",
    "duration": null
  }
]