[
  {
    "text": "Fee the People: Retail Investor Behavior ∗ and Trading Commission Fees Omri Even-Tov Kimberlyn George Haas School of Business Haas School of Business University of California, Berkeley University of California, Berkeley Shimon Kogan Eric So Reichman University Sloan School of Management & The Wharton School Massachusetts Institute of Technology May 2023 Abstract We show trading commission fees have wide-ranging effects on retail investor behavior. Using a triple-difference research design around the removal of trading fees, we show retail investors responded by trading approximately 30% more, placing smaller orders, and increasing portfolio turnover. Fee removal also encouraged investors to reallocate their portfolios and diversify. Despite trading more frequently, investors’ gross return performance did not significantly change, but investors earned significantly higher returns net of fees incurred in the pre-period. Finally, we show fee removal alters the composition of retail investors, disproportionately encouraging participation from inexperienced investors with lesser deposits and technological sophistication. JEL Classifications: G10, G11, G18, G24, G32 Keywords: Retail investors, trading activity, behavioral finance ∗Direct correspondence to Omri Even-Tov omri_eventov@haas.berkeley.edu. We thank eToro for gener- ously sharing data. We thank Brad Barber, Terrance Odean, David Kim, Piia Korri and S.P. Kothari as well as seminar participants at Emory University, Stanford University, Reichman University and University of Chicago (Booth) for helpful comments and suggestions. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 68,
    "chunk_index": 0,
    "word_count": 219,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Even-Tov omri_eventov@haas.berkeley.edu. We thank eToro for gener- ously sharing data. We thank Brad Barber, Terrance Odean, David Kim, Piia Korri and S.P. Kothari as well as seminar participants at Emory University, Stanford University, Reichman University and University of Chicago (Booth) for helpful comments and suggestions. Electronic copy available at: https://ssrn.com/abstract=4226044 1 “One could imagine the SEC wanting to rewrite the rules to add frictions to retail trading... to make it harder to offer commission-free retail trading. If the retail trading experience got a bit worse, there might be a bit less retail trading, and deep down that might be what the SEC wants.” (Matt Levine, Bloomberg, June 7, 2022) 1. Introduction Trading commission fees for retail stock trades have never been lower. Over the past decade, retail trading platforms worldwide have progressively adopted a new business model featuringzerocommissionfeesonvariousinvestmentactions,includingcommonstocktrades. This business model is perceived by some as transforming the financial market landscape, enabling a more extensive range of individuals to participate in stock markets, and with greater intensities, without being encumbered by prohibitive costs. In parallel, retail investor trading activity has surged in recent years. In response, regu- latory scrutiny has intensified, with a particular focus on the fact that retail investors now comprise approximately 20% of all trading volume in U.S. stock and options markets (e.g., Bryzgalova et al. (2022); de Silva et al. (2022)). In line with the opening quote, an ongoing regulatory debate revolves around the implications of retail growth for the efficiency of price discovery, retail investors’ welfare, and whether to impose speed bumps to curb the perceived excess in retail trading activity (e.g., Ernst and Spatt (2022)). However,itisunclearhowandtowhatextentthereductionsincommissionfeesinfluenced retail investors’ behavior. This is because the industry’s shift toward zero commission fees coincided with a variety of correlated factors such as the proliferation of handheld devices, the rising popularity of online trade forums (e.g., WallStreetBets), the growth of trading apps (e.g., Robinhood), and stay-at-home orders during the COVID pandemic. Our study is motivated by the following questions: First, how sensitive are investors’ trading activity and portfolio holdings to changes in commission fees? Second, how do com- mission fees influence the composition of retail investors participating in the stock market? Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 68,
    "chunk_index": 1,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "orders during the COVID pandemic. Our study is motivated by the following questions: First, how sensitive are investors’ trading activity and portfolio holdings to changes in commission fees? Second, how do com- mission fees influence the composition of retail investors participating in the stock market? Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 68,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "2 Finally, how do changes in fees affect the net investment returns of the modern generation of retail investors? This question incorporates not only the direct impact of the fees themselves, but also the indirect effect where fees first shape the trading decisions of retail investors. As an overview, we provide novel evidence that trading commission fees indeed have wide ranging causal effects on various aspects of retail investor behavior encompassing trading activity, diversification, portfolio composition, and the demography of retail investors. The absence of prior evidence on the link between commission fees and retail investor outcomes likely stems from the inherent challenges in establishing causality in most research settings due to the potential for confounding trends. Our study aims to fill this gap. To isolate the specific influence of commission fees, we use a novel triple-difference research design around the staggered removal of fees for retail investors on eToro, an international multi-asset online retail brokerage platform. Our main sample consists of user-level transaction data spanning a 13-month window from 2018-2019 surrounding the staggered removal of fees on eToro. During a 4-week period spanning April to May of 2019, eToro removed fees for trading equities in select countries. Moreover, the fee removal only applied to non-leveraged equity trades (i.e., standard equity trades)butnottoleveragedlongorshortsaleequitytrades. Thecombinationofthesefactors allowsustoconductarobusttriple-differenceresearchdesigntoassessthespecificroleplayed by trading fees. The first differencing involves comparing individual users’ trading behavior before andafter thefee removal. Thesecond differencingentails comparing usersin countries where fees were removed with those in countries where fees remained unchanged during our sample window. The final differencing compares changes in users’ behavior concerning non- leveraged trades, which were subject to the fee removal, against leveraged and short sale trades, for which fees were unchanged. Combined with user- and month-level fixed effects, our triple-difference research design allows us to mitigate numerous potential confounds that could otherwise hinder our ability Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 68,
    "chunk_index": 3,
    "word_count": 310,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "non- leveraged trades, which were subject to the fee removal, against leveraged and short sale trades, for which fees were unchanged. Combined with user- and month-level fixed effects, our triple-difference research design allows us to mitigate numerous potential confounds that could otherwise hinder our ability Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 68,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "3 to establish a causal relationship between the changes in fees and retail investors’ trading behavior. For example, alternative explanations based on media campaigns or changes in the platform that occurred concurrently with the fee removal would struggle to explain differences in trading for affected versus unaffected investments as well as in affected versus unaffected countries. In the pre-period, eToro structured its fees using a fixed percentage of 80 basis points (bps) per dollar invested, which amounted to over 10% in fees per year for the average eToro customer in our sample. Fees were displayed in dollar terms directly beneath the buttons to confirm a given order, suggesting that investors were likely accustomed to viewing fees beforeplacinganorder. Followingthefeeremoval, userswerepresentedwithhighlightedtext indicating that their order was “Commission Free” before placing the order. Consequently, we expect that fee removal likely had a substantial impact on customers’ perceptions of the payoffs from investing. We begin our analysis by estimating the sensitivity of retail investors’ trading demand to changes in fees. Economically, retail investors increased average monthly portfolio turnover and trade frequency by over 30 percent. This increase occurs immediately following the fee removal but not before. Moreover, the uptick in trading is driven by users in countries where fees were removed (“treated countries”) and exclusively for non-leveraged equity trades, while we observe no effect among users in non-treated countries, among leveraged trades, or among short equity trades. Further, placebo tests and examination of the parallel trends assumption cast significant doubt on reverse causality concerns. For example, the precise timing and concentration of changesinretailbehaviormitigatesconcernthatourresultsreflecteToroselectivelyremoving fees in anticipation of forecasted spikes in retail demand. Collectively, these results suggest that the increase in trading activity is directly attributable to the fee removal, rather than secular trends in retail trader participation or improvements to the eToro platform. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 68,
    "chunk_index": 5,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "timing and concentration of changesinretailbehaviormitigatesconcernthatourresultsreflecteToroselectivelyremoving fees in anticipation of forecasted spikes in retail demand. Collectively, these results suggest that the increase in trading activity is directly attributable to the fee removal, rather than secular trends in retail trader participation or improvements to the eToro platform. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 68,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "4 Investors’ portfolio turnover increased following fee removal despite an approximate 7% decrease in average trade size. This decrease is economically modest relative to the uptick in trade frequency but may be somewhat surprising since eToro did not charge a fixed fee for each trade, which would naturally penalize a larger quantity of small trades. Instead, eToro structured its fees in the pre-period using a fixed percentage irrespective of the number of times that a user traded. We consider a series of potential explanations for the decrease in trade size, including those that assume full- and partial-optimality on behalf of eToro customers. Our findings align most closely with users being responsive to the removal of fees, but not fully compre- hending their structure in the pre-period. For example, using demographic information, we show that the reduction in trade size is concentrated among inexperienced investors with smaller account sizes and lower technological sophistication, who we expect are more likely to confuse fixed and variable rates (e.g., Feldman et al. (2016)). In contrast, we find limited evidence that reduced trade sizes were driven by fully rational motives such as concerns over worse execution quality (i.e., higher price impact) for large trades following fee removal. One probable contributing factor for why eToro customers might have plausibly misunderstood commission fees is that many competitor retail platforms charged a fixed fee per trade, un- like eToro’s per dollar fee structure (Kothari et al. (2021)). Additionally, eToro displayed their fees in dollar terms before trade submission rather than as a percentage of the amounts traded, making it more difficult to understand how fees were structured. A key set of findings in our study is that fee removal also prompted changes in the com- position of eToro customers’ portfolios across multiple dimensions. First, eToro customers decreased their leverage-risk by increasing the proportion of their portfolio held in non- levered positions relative to leveraged or short positions, consistent with customers shifting their portfolios toward lower fee assets and strategies. Second, investors responded to fee removal by holding more diversified portfolios containing a greater number of unique stocks and industries, which in turn reduced the average return correlation among the positions in Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 68,
    "chunk_index": 7,
    "word_count": 368,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "positions, consistent with customers shifting their portfolios toward lower fee assets and strategies. Second, investors responded to fee removal by holding more diversified portfolios containing a greater number of unique stocks and industries, which in turn reduced the average return correlation among the positions in Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 68,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "5 their portfolio. Due in part to low pre-period diversification, fee removal spurred meaningful changes in diversification. For example, industry diversification increased by approximately 14% following the fee removal. These results are most consistent with capital-constrained investors trading smaller amounts across a broader range of securities in response to the perception that fee removal disproportionately decreased costs of trading smaller positions. Whileourtriple-differenceresearchdesignfocusesontheintensivemarginofinvestors, we also document changes in the extensive margin of eToro investors following the fee removal. We find that the removal led to a significant surge in new eToro customers, consistent with the fee removal being employed to attract and retain investors. A striking result is that we observe a sharp increase among young investors, suggesting that fee removal induces individuals to invest in the stock market at a younger age. We also see an uptick in users who report no prior experience investing, users with smaller amounts of money, and users with lesser technological sophistication. Thus, our findings suggest that trading commission fees affect the composition and average sophistication of market participants by altering the extensive margin of retail investors. Ourfinaltestsexaminetheimplicationsofthefeeremovaloninvestorperformance. These tests are motivated by the seminal findings in Barber and Odean (2000), which demonstrate that excessive trading is detrimental to retail investor wealth. Barber and Odean (2000) showthatretailinvestors’grossinvestmentreturnsfailedtooutperformmarketindexreturns despiteretailinvestorsassuminggreaterrisk, andthatinvestorssignificantlyunderperformed on a net basis after accounting for transaction costs. Our tests and use of more recent data are particularly important in light of more recent evidence of modern retail investors being distinct from earlier generations of investors and more prone to excessive, attention-based trading(e.g.,Barberetal.(2022a)). Ourstudyextendsthesefindingsbyexamininginvestors’ gross performance and performance net of fees after accounting for how the fees first impact investor behavior (i.e., what to trade and how often to trade them). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 68,
    "chunk_index": 9,
    "word_count": 291,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "modern retail investors being distinct from earlier generations of investors and more prone to excessive, attention-based trading(e.g.,Barberetal.(2022a)). Ourstudyextendsthesefindingsbyexamininginvestors’ gross performance and performance net of fees after accounting for how the fees first impact investor behavior (i.e., what to trade and how often to trade them). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 68,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "6 We study the relationship between fee removal and investor performance in two stages: first, we examine users’ gross performance without accounting for commission fees, and sec- ond, we examine net performance after accounting for commission fees. Employing portfolio- level tests following Seasholes and Wu (2007) and user-level tests based on portfolio holdings, we find no significant difference in the ability of users’ trades to predict returns or users’ gross performance following fee removal, in terms of both raw returns and alphas. By using fee removal as a shock to retail trading intensity, an important implication of our findings is that trading more frequently does not inherently make retail investors worse off on average in terms of investment returns. Upon examining net performance after accounting for commission fees in the pre-period, we find that users in treated countries actually fare better after the removal of fees. Econom- ically, users’ performance improves by around 11% on an annualized basis, which is almost entirely driven by investment losses due to fees in the pre-period. These findings suggest that fee removal benefited eToro users in terms of their net returns, especially considering our evidence that these users likely reduced their risk exposure through lower leverage and increased diversification. The central contribution of our paper is three-fold. First, we show that retail investors earn higher returns on a net basis after accounting for fees incurred in the pre-period. This improvement in net performance is consistent with arguments that the combination of zero commission fees and payment for order flow (PFOF) benefits retail investors by reducing total trading costs. These findings also mitigate concerns that fee removal led to the gami- fication of investing and harmed retail investors by encouraging more ill-advised, gambling- or attention-based trading. In line with our findings of improved net returns, we find no evidence that fee removal prompted investors to trade smaller stocks, lottery-like stocks, or glamour stocks. Thus, our paper provides cleanly identified evidence against concerns that the modern generation of retail investors lose money due to poor stock-picking ability and/or attention-based herding (e.g., Odean (1999), Barber et al. (2022a)). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 68,
    "chunk_index": 11,
    "word_count": 356,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "removal prompted investors to trade smaller stocks, lottery-like stocks, or glamour stocks. Thus, our paper provides cleanly identified evidence against concerns that the modern generation of retail investors lose money due to poor stock-picking ability and/or attention-based herding (e.g., Odean (1999), Barber et al. (2022a)). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 68,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "7 Second, our novel research design allows us to narrow in on the specific role of trading commissions as a speed bump for retail activity in financial markets. Consequently, our find- ings speak to the ongoing regulatory debates regarding retail investors and retail brokerages. As of this writing, the SEC is considering rules that would combat the PFOF revenue model that underpins most retail platforms (Ernst and Spatt (2022)). If revenue from PFOF is no longer available, retail brokers will likely need to revert to charging commission trading fees to sustain operations. Our evidence suggests that such a move would discourage retail participation and diversification in financial markets. Finally, our results also suggest that commission-free trading affects the extensive margin by attracting less experienced investors with smaller amounts of capital. The increased participation of individual investors likely influences market liquidity and the economy’s risk-bearing capacity, which in turn could potentially impact firms’ costs of capital. Several caveats are merited. First, while we find that eToro users’ trades are highly correlated with NASDAQ retail order flow, eToro differs from other popular retail brokerage platforms in several ways, including the fact that eToro users are geographically disperse across several countries with different market infrastructures and regulations. Additionally, our tests are, by design, limited to a specific time period before the onset of the pandemic. Therefore, it is unclear whether our findings are generalizable to other brokerages or during periods of market turmoil, and they do not speak to potential long-term consequences of removing trading fees. Second, our analyses focus on participation rates, diversification, and return performance, but do not account for other factors related to investor utility such as the amount of free-time consumed while investing (e.g., D’Acunto et al. (2019)). Finally, our findings do not speak to the impact of retail investors on market outcomes such as volatility and price discovery, which are likely of first-order importance to regulators. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 68,
    "chunk_index": 13,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "investor utility such as the amount of free-time consumed while investing (e.g., D’Acunto et al. (2019)). Finally, our findings do not speak to the impact of retail investors on market outcomes such as volatility and price discovery, which are likely of first-order importance to regulators. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 68,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "8 2. Data, Sample Construction, and Descriptive Statistics The data for our study includes information on trades and daily positions from January 2015 to December 2019 for over 160,000 investors who use eToro for equity trading. To make the sample tractable, eToro furnished us with account-level data for all customer accounts that funded their accounts and executed at least one trade using their copy trader service since account inception.1 We restrict our sample to users who trade equities and reside in the six regions where eToro provided information regarding fee removal event dates — UK, Europe, Australia, Asia, Arab, and South and Central America. Users in these regions account for approximately 89% of the over 160,000 unique equity investors in the eToro dataset. As discussed later in this section, we confirm that our eToro data is consistent with measures of total retail volume from other data providers, indicating that our inferences are not likely confined to our sample. Panel A of Appendix A outlines the dates when eToro removed trading fees for non- leveraged equity transactions, sorted by region and country. When analyzing the effects of fee removal on trade behavior and portfolio performance, we exclude the one month period from April 11 to May 10, 2019. This is due to eToro’s staggered approach to fee removal during this period, where different countries experienced fee removal on different dates.2 We construct a time-balanced sample and limit it to six months before (the “pre- period”)andsixmonthsafter(the“post-period”)thefeeremovaleventmonthfortworeasons. First, extending our sample period would coincide with the COVID era, characterized by 1The copy trader service allows users to copy the trades of other eToro users. This selection process purposefully excludes users who registered for an account but never actually traded. To alleviate concerns about generalizability, we also show in Table A1 of the Online Appendix that active and less active users of the copy trader service exhibit similar portfolio turnover levels and look economically similar in key user demographics, such as investment experience and sophistication. 2In Table A2 of the Online Appendix, we run our main triple-difference analyses separately for Group 1 countries (where eToro removed fees on April 15, 2019) and Group 2 countries (where eToro removed fees on May 6, 2019), using the same non-treated countries as a control for each group. Our results are largely consistent across both groups. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 68,
    "chunk_index": 15,
    "word_count": 393,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "analyses separately for Group 1 countries (where eToro removed fees on April 15, 2019) and Group 2 countries (where eToro removed fees on May 6, 2019), using the same non-treated countries as a control for each group. Our results are largely consistent across both groups. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 68,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "9 a significant increase in retail trading behavior for reasons likely unrelated to fee removal (de Silva et al. (2022)). Second, countries in our control group also experienced fee removal in 2020, which would disqualify them as control samples. Consequently, our sample period begins on October 9, 2018, and concludes on November 6, 2019. A limitation of this design, which focuses on a relatively short time period around the fee removal, is that it prevents us from examining the longer-term implications of fee removal.3 Users trading any asset class on the eToro platform have the ability to execute non- leveraged, leveraged, or short-sale trades. Since fee removal only pertains to non-leveraged equity positions, we utilize leveraged and short equity trades as a control group. This approach allows us to study variations in trading behavior for the same individual at the same point in time.4 To construct our sample for each type of equity trade, we stipulate that users must have held a position in the corresponding trade type during the pre-period. Panel B of Appendix A provides information on the sub-samples for each trade type. The non-leveraged trade type sample consists of 14,602 users, with 65.9% residing in treated countries; the leveraged trade type sample consists of 38,935 users, with 74.5% residing in treated countries; and the short trade type sample consists of 16,501 users, with 73.8% residing in treated countries. Upon signing up for an eToro account, users are required to complete a Know Your Cus- tomer (KYC) survey. This collects self-reported demographic information, such as gender, income, and age, in addition to information about each user’s level of investing expertise. Starting with the descriptive statistics in Table 1, we leverage demographic data to charac- terize eToro customers and examine how the effects of fee removal vary across different users. We focus specifically on user Age, I(No Experience), an indicator equal to one if the user 3AsreportedinAppendixA,eTorofirstremovedfeesinEuropeandtheUKbeforeextendingthischange to other countries, commencing with its largest customer markets in Europe and the UK and intentionally rolling out fee removal gradually. 4LeveragedandshortequitytradesareconductedviaCFDs,whicheffectivelyserveascontractsdelivering return swaps on the underlying asset. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 68,
    "chunk_index": 17,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "We focus specifically on user Age, I(No Experience), an indicator equal to one if the user 3AsreportedinAppendixA,eTorofirstremovedfeesinEuropeandtheUKbeforeextendingthischange to other countries, commencing with its largest customer markets in Europe and the UK and intentionally rolling out fee removal gradually. 4LeveragedandshortequitytradesareconductedviaCFDs,whicheffectivelyserveascontractsdelivering return swaps on the underlying asset. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 68,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "10 reported no previous trading experience upon account creation, and I(Income <= $50,000), an indicator equal to one if the user reports an annual income of $50,000 or less.5 Addi- tionally, we measure a user’s level of technological sophistication based on their reported occupation. We set I(Low Technological Sophistication) equal to one for users who report an occupation in a non-STEM and non-finance related industry. All variables are defined in Appendix B. Table 1 presents descriptive statistics for users across our three trade type samples: non-leveraged (Panel A), leveraged (Panel B) and short (Panel C). Additionally, for our difference-in-difference-in-difference (triple difference) design, we focus on users who hold both non-leveraged and leveraged (short) positions in the pre-period. We then compute each outcome variable as the difference between the non-leveraged and leveraged (or short) outcome variable. Panels D and E present descriptive statistics for the non-leveraged minus leveraged and non-leveraged minus short samples, respectively. We provide these descriptive statistics on our trade behavior and portfolio performance variables for the pre-fee removal period (October 9, 2018, to April 10, 2019) to aid in the interpretation of the economic magnitude of the effects of fee removal effects discussed in Section 3. Focusing on the non- leveraged sample in Panel A, the mean Monthly Number of Trades (Monthly Turnover) is 4.144 (0.389), with the median for both being 0. Since the same eToro user can trade non-leveraged, leveraged, and short trades, our user characteristics remain consistent across the different panels. Specifically, our typical eToro user is about 37 years old. Approximately half of all users have no previous trading experience when they register for an account, and around 65% report an annual income of less than $50K. 5OnelimitationoftheeToroKYCdataisthatusersselecttheirincomerangefromasetofoptionsrather thanreportingtheirexactannualincome. GiventhateToroalteredtheseoptionsmultipletimesthroughout our sample period, it’s not possible to estimate user income consistently. However, we can consistentely identifyuserswithanannualincomebelow$50,000,andusethiscut-offtodiscernvariationsinincome. Our findings remain similar when we scale users’ income by their home country’s GDP. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 68,
    "chunk_index": 19,
    "word_count": 321,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "account, and around 65% report an annual income of less than $50K. 5OnelimitationoftheeToroKYCdataisthatusersselecttheirincomerangefromasetofoptionsrather thanreportingtheirexactannualincome. GiventhateToroalteredtheseoptionsmultipletimesthroughout our sample period, it’s not possible to estimate user income consistently. However, we can consistentely identifyuserswithanannualincomebelow$50,000,andusethiscut-offtodiscernvariationsinincome. Our findings remain similar when we scale users’ income by their home country’s GDP. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 68,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "11 A potential concern regarding any study of a specific sub-population is the generaliz- ability of the results to other groups. Considering the size of the US market and potential heterogenity among customers across platforms, it is natural to question whether our find- ings can inform us about the causal effect of zero fees on US retail investors. While a direct answer would require account-level data from US discount brokers who underwent a similar change, which we cannot access, an indirect response can be obtained by comparing the trading behavior of eToro investors to that of US retail investors. In short, we find a strong correlation between these two groups both in terms of time series and cross section. To address this, we obtain the “Retail Trading Activity Tracker” from NASDAQ, which covers roughly 45% of US retail order flow. The data provides day-stock measures of “activ- ity”, the ratio of dollars traded by retail investors in a given ticker divided by total dollars traded by retail investors across all tickers, and “sentiment”, measuring the retail net flows (buy minus sell) over the most recent ten trading days. We aggregate the individual trading behavior of eToro investors to produce corresponding stock-day measures. Following this, we run panel regressions with either date, firm, or date and firm fixed effects for each of these measures with double-clustered standard errors. The results, reported in Appendix C, are consistent and robust. The relationship between US retail investors and eToro investors, as measured by these non-directional and directional measures, is highly significant, with R2s for activity being 65% and for sentiment being 10%. Indeed, the relationship is sufficiently strong to be discerned visually. In Appendix D, we see similar evidence of external valid- ity when plotting the NASDAQ activity level (in blue) relative to eToro (in red) for three prominent stocks among retail investors: AAPL, NTFX, and TSLA. 3. Identification Our main tests gauge whether and to what extent the removal of trading fees affects retail investor behavior and performance. We leverage eToro’s decision to remove trading Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 68,
    "chunk_index": 21,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "relative to eToro (in red) for three prominent stocks among retail investors: AAPL, NTFX, and TSLA. 3. Identification Our main tests gauge whether and to what extent the removal of trading fees affects retail investor behavior and performance. We leverage eToro’s decision to remove trading Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 68,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "12 fees only on non-leveraged equity trades and onlyfor users residing in specific countries. This allows us to employ both a difference-in-difference and triple difference research design. We compare the following three differences, while controlling for user-level effects: user behavior before versus after fee removal, users residing in countries where fees were removal versus those in countries where fees were not removed, and non-leveraged equity transactions versus leveraged equity trades and short sale equity trades. Our main tests consist of panel regressions of the following form: Outcome = α ·Post ×Treat +γ +ψ +ϵ , (1) i,m 1 m i i m i,m where the i and m subscripts index the user and month, respectively. Outcome denotes i,m various measures of retail investor behavior, including trading intensity, diversification, hold- ings, and performance. The use of user-level data allows for a high-level of control. We include individual fixed-effects (γ ), thereby controlling for individual-level heterogeneity. i Additionally, the ability to track the same individuals both before and after the fee removal helps control for composition effects. We also include month fixed-effects (ψ ) to absorb m market-wide changes. Last, in all specifications, we two-way cluster our standard errors by user and by month to account for both the cross-sectional and time-series dependence of variables.6 Our main point of interest when estimating Eq. (1) is the interaction term between the post-fee-removal indicator variable, Post, and Treat, an indicator equal to one for users in treated countries. This interaction term captures the change in the outcome variable following fee removal specifically for users in countries where the fee was removed. When estimating Eq. (1), the main effects for Post and Treat are absorbed by firm- and month- 6Table A3 in the Online Appendix provides evidence that our main inferences are robust to clustering at the country, country-month, and region-month levels. We do not cluster solely by region due to the small number of clusters. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 68,
    "chunk_index": 23,
    "word_count": 326,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "and Treat are absorbed by firm- and month- 6Table A3 in the Online Appendix provides evidence that our main inferences are robust to clustering at the country, country-month, and region-month levels. We do not cluster solely by region due to the small number of clusters. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 68,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "13 fixed effects, respectively, due to perfect multicollinearity. Our first research design restricts the sample to non-leveraged transactions. Within this subsample, we compare the effect of the fee removal on users’ non-leveraged equity trading behavior in treated countries with that in non-treated countries. This design utilizes users in non-treated countries as a control. A potential concern is that our results might be driven by confounding events unique to either treated or non-treated countries but not both. To address this concern, our main tests also limit our sample to leveraged trades and short-sale trades and repeat our analysis. In these two subsamples, we do not expect to find an effect on users in treated countries relative to those in non-treated countries because eToro did not remove fees for either leveraged or short trades. Therefore, if there is a confounding effect, our results should still be observable for these two subsamples. Furthermore, to alleviate concerns that the type of users who trade non-leveraged trades might differ from those who trade leveraged- or short-trades, we restrict our sample to users who trade either both non-leveraged and leveraged trades or both non-leveraged and short- trades. We simultaneously employ all three levels of differences to ensure that our results are attributable to the fee removal (Gruber (2006), Rauh (1994), Butler and Cornaggia (2011), Kim (2018)). Specifically, in this analysis we compare the difference in retail investors’ trading behavior between non-leveraged and leveraged equity trades for investors in treated countries with the differences in retail investors’ trading behavior between non-leveraged and leveraged equity trades for investors in non-treated countries. We then repeat this analysis using short-sale equity trades instead of leveraged equity trades. If the fee removal affects investors’ trading behavior, we should observe a stronger effect on non-leveraged equity trades of retail investors in treated countries compared to other trades. Finally, it is important to note that while our analysis is designed to estimate the average treatment effect, we conduct it at the user level. Thus, any changes in the composition of investors in the post-fee-removal period cannot account for our results. This also enables Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 68,
    "chunk_index": 25,
    "word_count": 355,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Finally, it is important to note that while our analysis is designed to estimate the average treatment effect, we conduct it at the user level. Thus, any changes in the composition of investors in the post-fee-removal period cannot account for our results. This also enables Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 68,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "14 more precise identification since individual investors’ behavior exhibits a large degree of heterogeneity (e.g., Giglio et al. (2021)). To account for this, we consistently include user fixed-effects throughout our analysis. Despite our robust research design, we cannot entirely dismiss the potential existence of a confounding effect that might solely impact users in treated countries and only non- leveraged trades, excluding users in non-treated countries and leveraged- or short trades, around the fee removal event. Although the likelihood of observing such a confounding effect is remarkably low, we provide time series plots to illustrate that our observed effects are predominantly concentrated at the time of the fee removal (Panel A of Figures 1, 2, 3, and 4). Combining these results with placebo tests discussed more below, these results further support our assertion that it is the fee removal, rather than another event, that is driving our results. Overall, our identification strategy proficiently establishes the causal effects of the regulation while minimizing the possibility of confounding factors driving our results. 4. Results 4.1. Trading Intensity and Size Webeginouranalysisbyfirstestimatingthesensitivityofretailinvestors’tradingdemand to changes in fees. In Panel A of Table 2, we measure eToro customers’ portfolio turnover, denoted Monthly Turnover, as the total buy and sell volume in a given month, scaled by the average monthly amount invested in the user’s portfolio. In column (1), we first limit the sample to non-leveraged equity transactions and compare changes in the portfolio turnover of users in treated countries to those in non-treated countries. Asshownincolumn(1),thecoefficientforPost×Treatissignificantlypositive,indicating the monthly turnover of non-leveraged trades increased following fee removal in treated countries. In economic terms, the portfolio turnover of non-leveraged trades increased by Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 68,
    "chunk_index": 27,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "non-leveraged equity transactions and compare changes in the portfolio turnover of users in treated countries to those in non-treated countries. Asshownincolumn(1),thecoefficientforPost×Treatissignificantlypositive,indicating the monthly turnover of non-leveraged trades increased following fee removal in treated countries. In economic terms, the portfolio turnover of non-leveraged trades increased by Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 68,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "15 0.126 per month relative to a baseline of 0.389, reflecting a 32% increase. A potential concern with the results in column (1) is that our control group of retail investors in non-treated countries might be affected by unrelated changes. For example, changes in market conditions could differently impact investors in treated and non-treated countries. To mitigate this concern, we re-run Eq. (1) for the sample of leveraged equity trades and short sale trades in columns (2) and (3), respectively. For these two types of trades, we do not anticipate any differential impact on treated users since the fee removal only applied to non-leveraged equity transactions. As expected, we observe no significant changes in portfolio turnover for leveraged and short trades in these two columns. This mitigates concerns that our column (1) results might be driven by a secular increase in retail investor trading unrelated to fee removal. Finally, in columns (4) and (5) of Panel A, we intentionally limit our sample to users who, in the pre-period, held both non-leveraged and either leveraged or short positions, respectively. This allows us to employ a triple-difference regression, comparing changes in the portfolio turnover of non-leveraged trades relative to either leveraged trade turnover or short trade turnover for users in treated countries versus those in non-treated countries. We continue to find our coefficient of interest is significantly positive in each of these columns. In column (4), when focusing on the difference between non-leveraged and leveraged trades, the estimated effect is a 36% increase in turnover, which aligns closly with the economic magnitude implied in our column (1) specification. To better understand the factors contributing to the rise of users’ monthly portfolio turnover, we decompose turnover into its two components: number of trades and average trade size (as a proportion of total portfolio value). In Panel B of Table 2, we again estimate Eq. (1) for Monthly Number of Trades, which is defined as the total number of trades a user executes in a given month. Panel B of Table 2 shows that users’ average number of trades mirrors the trend observed in portfolio turnover. Specifically, in column (1), we find that the Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 68,
    "chunk_index": 29,
    "word_count": 365,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "of Trades, which is defined as the total number of trades a user executes in a given month. Panel B of Table 2 shows that users’ average number of trades mirrors the trend observed in portfolio turnover. Specifically, in column (1), we find that the Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 68,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "16 monthly number of non-leveraged trades increased by 1.502 per month relative to a baseline of 4.144, reflecting a 36% increase. Echoing our findings in Panel A, we do not observe a similar effect for leveraged and short trades (columns (2) and (3) of Panel B, respectively). Finally, columns (4) and (5) reinforce our results from column (1) using our triple-difference design. Panel C of Table 2 reports the results of studying changes in Monthly Average Trade Size, defined as the monthly average trade size scaled by total portfolio value. As shown in column (1), we find a statistically significant, yet economically modest, decrease in the monthly average trade size of non-leveraged trades for users in treated countries relative to those in non-treated countries. Specifically, we find a reduction of −0.021 relative to a baseline of 0.292, representing a 7% reduction (compared to an over 30% increase in portfolio turnover and number of trades shown in Panels A and B). In column (2) of Panel C, we also find some evidence that users from treated countries, in the leveraged sample, reduce their average trade size in the post-period compared to users in non-treated countries. However, in column (4), when we focus on users who execute both non-leveraged and leveraged trades, the significantly negative coefficient implies that the reduction in trade size for non-leveraged trades is greater than the reduction in trade size for leveraged trades for these users. Column (5) yields a similar conclusion among users who conduct both non-leveraged and short trades. The reduction in average trade size shown in Panel C of Table 2 might initially seem surprising because eToro did not charge a fixed fee per trade, which would inherently dis- courage numerous small trades. Instead, during the pre-perod, eToro’s fee structure was a fixed percentage – 80 bps per dollar invested – irrespective of the number of times that a user traded. We consider a variety of potential explanations for this decrease in trade size, considering both those that assume full rationality and those that assume partial-rationality on the part of eToro’s customers. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 68,
    "chunk_index": 31,
    "word_count": 352,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "per dollar invested – irrespective of the number of times that a user traded. We consider a variety of potential explanations for this decrease in trade size, considering both those that assume full rationality and those that assume partial-rationality on the part of eToro’s customers. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 68,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "17 For example, the reduction in trade size could be driven by users believing that the fee removal disproportionately decreased the cost of smaller trades. A likely contributing factor is the fee structure of many competing retail platforms, which charged a fixed fee per trade, as opposed to eToro’s fee-per-dollar structure (Kothari et al. (2021)). Moreover, eToro consolidateditsfeesintoasinglelineitemonmonthlystatementsandonlyreportedthedollar valueoffeescharged, complicatingthetaskofdeterminingwhethertradingfeesconstituteda fixed cost, variable cost, or a combination of both. Our hypothesis, which suggests investors might have misunderstood the fee structure, is consistent with prior literature finding that taxpayers often misinterpret variable and fixed rates (Feldman et al. (2016)). To explore this hypothesis, we utilize subsamples of users, classified by characteristics that signal a higher or lower degree of sophistication. Utilizing eToro’s user demographic (KYC) survey data along with the users’ pre-period trading behavior, we next divide our sample of users who trade non-leveraged equities into various sub-samples to examine which groups of users were more likely to alter their trad- ing behavior in response to the fee removal. Specifically, we rerun our main tests after splitting users into groups based on the same user characteristics shown in Table 1: their pre-fee removal trading frequency, years of trading experience at the time of fee removal, age, technological sophistication, account size, and annual income. In Panel A of Table 3, we begin our analysis by partitioning our sample into users whose trading frequency is either below or above the median average monthly number of trades before the fee removal. We find that while the increase in monthly turnover and the number of trades is significant for both subsamples (columns (1)-(4)), it is significantly more pronounced among users who traded more frequently in the pre-period, indicating these users being more sensitive to changes in fee removal. In contrast, in columns (5) and (6), we do not find a significant difference in the trade size response based on the pre-period trading intensity. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 68,
    "chunk_index": 33,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "among users who traded more frequently in the pre-period, indicating these users being more sensitive to changes in fee removal. In contrast, in columns (5) and (6), we do not find a significant difference in the trade size response based on the pre-period trading intensity. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 68,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "18 Panels B through F of Table 3 present our main tests after partitioning our sample based on various measures that we believe indicate investor sophistication. A consistent pattern emerges across these panels: users with less trading experience, who are younger, less technologically sophisticated, and have lower account size and income, are more likely to modify both their trading intensity and average trade size after the removal of fees. These results from the sub-sample analyses are consistent with users’ misunderstanding of the fee structure in the pre-period, as less sophisticated users are more likely to misunderstand the difference between fixed and variable commission fees.7 The reduction in trade size highlighted in Panel C of Table 2 is also potentially consis- tent with eToro users rationally reducing trade size due to concerns over poorer execution quality for larger trades. However, in Table A4 of the Online Appendix, we find no evidence that execution quality significantly varies with trade size or that the relationship between trade size and execution quality changed after fee removal. Additionally, we find that users decrease trade size for both liquid and illiquid stocks. While we cannot entirely dismiss the possibility that eToro customers perceived a disproportionate worsening of price impact for non-leveragedtradescomparedtoleveragedandshortsaletrades, thisfully-rationalexplana- tion becomes less convincing given our evidence that the reduction in trade size concentrates among inexperienced investors, who are less likely to be familiar with intricacies of trade execution quality. Anotherpossibleexplanationforthereducedtradesizecouldbethatinvestorsincurfixed costs when learning about a particular stock and that fee removal incentivized investors to undertake these fixed costs by reducing the overall cost of investing. However, in Table A5 of the Online Appendix, we find that our trade size results remain qualitatively the same 7Animportantcaveatwheninterpretingthesesubsampleanalysesisthatretailinvestors’tradingbehavior has also been linked to overconfidence (Barber and Odean (2001)), and it would have been interesting to divide our sample based on gender as a proxy for overconfidence. Unfortunately, the vast majority of the users in our sample are male (over 92%), which limits our statistical power in measuring the effect of fee removal on female users. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 68,
    "chunk_index": 35,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "would have been interesting to divide our sample based on gender as a proxy for overconfidence. Unfortunately, the vast majority of the users in our sample are male (over 92%), which limits our statistical power in measuring the effect of fee removal on female users. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 68,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "19 after dividing our sample into equities with above and below median market capitalization. To the extent that it is more costly to learn about small stocks compared to large ones, the consistency of our results across these two subsamples suggests that our findings are not likely driven by fixed costs associated with information gathering. Instead, the collective evidence from this section are most consistent with the premise that users reacted to the removal of fees, but did not fully comprehend their structure in the pre-period. OurfindingsthusfarareconsistentwitheTorocustomersbeinghighlysensitivetochanges in commission fees. One may be concerned that our results could be influenced by eToro users who have multiple brokerage accounts, and who may shift their trading activity from other accounts that still charge commission fees in the post-period to their eToro account. However, in Table A6 of the Online Appendix, we find no significant change in deposit activity by users in treated countries in the post-period relative to those in non-treated countries, suggesting that users are not diverting funds from other accounts into their eToro accounts. Moreover, our sub-sample analyses in Table 3 show that users with limited prior trading experience and lower income are the most likely to modify their trading behavior in responsetothefeeremoval. Theseusersarealsotheleastlikelytopossessmultiplebrokerage accounts. 4.2. Portfolio Composition We next examine how the removal of fees influenced the composition of users’ portfolios, both in terms of the types of trades eToro customers execute and the characteristics of the equities they include in their portfolios. An important feature of our eToro setting is that it effectively disincentivized leveraged longs and short sales by making non-leveraged trading less expensive in a relative sense. As such, we expect an increased fraction of non- leveragedpositionsinportfoliosofusersintreatedcountries,comparedtoshortandleveraged positions, following the fee removal. Table4PanelAshowsthatinvestorsindeedrespondedtothefeechangebyincreasingthe Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 68,
    "chunk_index": 37,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "their portfolios. An important feature of our eToro setting is that it effectively disincentivized leveraged longs and short sales by making non-leveraged trading less expensive in a relative sense. As such, we expect an increased fraction of non- leveragedpositionsinportfoliosofusersintreatedcountries,comparedtoshortandleveraged positions, following the fee removal. Table4PanelAshowsthatinvestorsindeedrespondedtothefeechangebyincreasingthe Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 68,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "20 fraction of their portfolio in non-leveraged positions. The dependent variable in columns (1) and (2) is the Fraction of Portfolio Value, which is the proportion of total equity portfolio value held as non-leveraged positions. The dependent variable in columns (3) and (4) is the Fraction of Positions, which is the proportion of total equity positions held as non- leveraged positions. In columns (1) and (3), we restrict our analysis to our non-leveraged sample, including users who held at least one non-leveraged equity position in the six months preceding fee removal. In columns (2) and (4), we restrict our analysis to a broader sample of equity traders who held at least one non-leveraged, leveraged, or short equity position in the six months leading up to fee removal. Across all columns of Panel A, we find a significant and relatively similar increase in the total equity portfolio value or the total equity positions held as non-leveraged positions by users in treated countries relative to those in non-treated countries. For example, in column (1), we find an increase in the fraction of portfolio value in non-leverage positions of 3.0% relative to a baseline of 74.1%, representing an increase of 4 percent. Collectively, these results are consistent with users shifting toward lower-fee assets in response to the removal of trading commissions. In Panels B through E of Table 4, we focus on the types of positions held by users in our non-leveraged sample and examine the characteristics of stocks included in their non-leveraged portfolios. Given the popular press allegations of fee removal leading to the gamification of investing, we examine whether eToro customers responded to the fee removal by increasing their holdings in smaller, more speculative stocks, often referred to as ‘lottery- like’stocks. Toexaminethecharacteristicsofstocksinusers’portfolios, wemeasurePortfolio Average Size as the weighted average log-adjusted market value of equity for all stocks in a user’s portfolio within a given month, Portfolio Average Book-to-Market as the weighted average book-to-market of all stocks in a users’ portfolio within a given month, Portfolio Average Momentum calculated as the weighted average momentum, using the preceding 12- month return, of all stocks in a user’s portfolio within a given month, and Portfolio Average Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 68,
    "chunk_index": 39,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "as the weighted average book-to-market of all stocks in a users’ portfolio within a given month, Portfolio Average Momentum calculated as the weighted average momentum, using the preceding 12- month return, of all stocks in a user’s portfolio within a given month, and Portfolio Average Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 68,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "21 MAX as the weighted average of the maximum daily return in the previous month for all stocks in a user’s portfolio, following Bali et al. (2011). Our analyses in Panels B and C of Table 4 show that users in treated countries do not appear to meaningfully change the average size or book-to-market ratio of stocks in their portfolio. In column (1) and column (2) of Panel D, We do see some evidence that eToro customers decrease their reliance on trend-following return momentum strategies to make investment decisions. However, further evidence in columns (3) and (4) suggests that this change is not specific to non-leveraged trades and is therefore less likely to be driven by the fee removal. In Panel E, we find no change in the average MAX, the maximum prior month daily return, of stocks in portfolios of users in treated countries.8 While other aspects of retailinvestors’tradingexperience, suchasin-appdisplayfeatures, havebeenshowntocause attention-driven trading (e.g., Barber et al. (2022a)), our results suggest that the removal of commission fees is an unlikely first-order driver of the rise in attention-driven trading among retail investors. 4.3. Portfolio Concentration and Diversification In this section, we provide evidence that investors responded to the fee reduction by decreasing the concentration of their portfolio in a particular stock or industry. Panels A, B, and C of Table 5 report the results for three different measures of portfolio concentration: the number of unique securities held by a user during a given month, denoted Number of Assets; the total number of Fama-French 48 industries represented in a user’s portfolio in a given month, denoted Monthly Number of Industries; and the average monthly pairwise correlation between the daily returns of all assets held in a users’ portfolio each month, denoted Monthly Average Pairwise Correlation. In columns (1), (3), and (4), we compute trade type specific measures for each trade type 8Similarly, in Table A7 of the Online Appendix, we find no significant changes in the skewness of stocks included in portfolios of users in treated countries in the post-period. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 68,
    "chunk_index": 41,
    "word_count": 344,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "In columns (1), (3), and (4), we compute trade type specific measures for each trade type 8Similarly, in Table A7 of the Online Appendix, we find no significant changes in the skewness of stocks included in portfolios of users in treated countries in the post-period. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 68,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "22 sample. For example, in Panel A column (1), Monthly Number of Assets is measured as the total number of securities specifically held in non-leveraged positions for the non-leveraged sample. In column (2) of each panel, to validate that changes in the concentration of users’ non-leveraged positions had a meaningful effect on these users’ entire equity portfolio, we compute the outcome variable of interest for the non-leveraged sample using all equity posi- tions (non-leveraged, leveraged, and short). Columns (5) and (6) report the triple difference analysis, withtheoutcomevariablebeingthedifferencebetweennon-leveragedandleveraged outcome (column (5)) or the non-leveraged and short outcome (column (6)) for users who hold positions in both trade types. The picture emerging across all three panels is clear: in the post-period, users in treated countries hold substantially more diversified portfolios compared to users in non-treated countries, as well as compared to users in treated countries who trade leveraged or short-sale equities that are not subject to the fee removal. Due in part to low pre-period diversification, the fee removal spurred significant changes in diversification. For example, we find that the average number of unique stocks held in non-leveraged positions over a month increases by 0.715 (column 1 Panel A) from 3.9 (over 18% increase). Additionally, the number of industries represented in the portfolio increased by 0.342 (column 1 Panel B) from 2.40 (over 14% increase). Column (2) of Panels A and B confirms that this increase in diversification of non-leveraged positions also increases overall portfolio diversification. In column (1) of Panel C, we find a significant decrease in the average pairwise correlation across non-leveraged assets in portfolios of users in treated countries relative to the portfolios of users in non-treated countries. However, in column (2) of Panel C, we do not find a significant decrease in the average correlation across all assets in treated users’ portfolios, which seems to be attributed to the lack of the change in the leveraged portion of users’ portfolios. As expected, columns (3) and (4) across all panels do not exhibit significant changes in these measures for leveraged and short positions. The triple-difference analysis in columns (5) and (6) of all panels corroborate these findings, implying that trading fees Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 68,
    "chunk_index": 43,
    "word_count": 367,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "leveraged portion of users’ portfolios. As expected, columns (3) and (4) across all panels do not exhibit significant changes in these measures for leveraged and short positions. The triple-difference analysis in columns (5) and (6) of all panels corroborate these findings, implying that trading fees Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 68,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "23 can deter retail investor diversification.9,10 Similar to our analysis of trade intensity and trade size, we next examine which types of users are most likely to adjust their portfolio diversification in response to fee removal. Table 6 presents the results of this analysis, using the same sub-sample distinctions as in Table 3. In Panel A, where we partition our sample to users with trading frequency either below or above the median average monthly number of trades prior to fee removal, we find that high trading frequency users are significantly more likely to increase the number of assets and industries in their portfolio and to hold less correlated assets, compared to low trading frequency users. In Panels B-F, when we use different proxies for users’ sophistication, we find that less sophisticated users tend to increase their portfolio diversification and hold less correlated assets to a greater extent than more sophisticated users. These findings continue to align with the argument that users, particularly less sophisticated ones, misunderstood the fee structure in the pre-fee removal period. Specifically, the results are consistent with capital- constrained investors trading smaller amounts across a wider range of securities in response to perceptions that fee removal disproportionately subsidized smaller positions. 4.4. Fee Removal and New Users While our main research design focuses on the behavior of existing investors (intensive margin), we also document shifts in the entrance of new eToro investors (extensive margin) following the fee removal. Given the age, wealth, and financial sophistication of these new users, it is likely that they are new to investing and not just to eToro. We do so by examining 9Our results hold when users who do not hold more than one asset at any point in the pre-period are excluded. 10Asanadditionalmeasureofthelevelofcorrelationbetweenthereturnsofassetsinauser’sportfolio,we computetheweighted-averagemonthlycorrelationbetweenthedailyreturnsofeachassetinauser’sportfolio and the daily returns of the user’s value-weighted portfolio. In Table A8 of the Online Appendix, we find a significant decrease in this measure for users from treated countires compared to those from non-treated usersincolumns(1),(2),and(6),butwedonotfindanysignificantchangeintheleveragedtriple-difference specification in column (5). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 68,
    "chunk_index": 45,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "the pre-period are excluded. 10Asanadditionalmeasureofthelevelofcorrelationbetweenthereturnsofassetsinauser’sportfolio,we computetheweighted-averagemonthlycorrelationbetweenthedailyreturnsofeachassetinauser’sportfolio and the daily returns of the user’s value-weighted portfolio. In Table A8 of the Online Appendix, we find a significant decrease in this measure for users from treated countires compared to those from non-treated usersincolumns(1),(2),and(6),butwedonotfindanysignificantchangeintheleveragedtriple-difference specification in column (5). Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 68,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "24 thecharacteristicsofuserswhojoineToroimmediatelyfollowingtheremovaloftradingfees.11 Specifically, we construct our pre-fee removal (post-fee removal) new user sample from users who open an account within the three months before (after) the fee removal event month and who execute at least one non-leveraged equity trade before our sample period ends on November 6, 2019.12 This yields a sample of 2,239 users who joined within the three months preceding fee removal, with 1,263 (56.4%) of these users coming from treated countries, and a sample of 4,589 users joining in the three months post fee removal, with 3,438 (74.9%) of these users coming from treated countries. In Table 7 we explore the characteristics of the new users that join eToro following the fee removal. First, we find that the number of users joining eToro grew by 18% in non-treated countries from months [-3, -1] to months [+1, +3] relative to the fee removal event month 976 new users to 1,151 new users). By contrast, the number of users joining eToro in treated countries grew by 172% over the same period (1,263 new users to 3,438 new users). This difference is consistent with fee removal being effective in promoting a surge in new users. Panel A examines the Monthly Number of Trades in months [+4, +6] following the fee removal event month. In Panel A column (5), we find that new users from both treated and non-treated countries, who joined eToro in the three months after the fee removal event month, tend to trade more frequently than those who joined in the three months prior to the fee removal event month. However, the difference in trade intensity of new users from the pre- and post-period is not significantly different when comparing between treated and non-treated countries (Panel A column (6)). Thus, in terms of trade intensity, new users appear similarly affected by fee removal to existing ones. Focusing on users’ trading experience in Panel B in Table 7, we find that the percentage 11An important caveat is that we are unable to observe eToro customers who close their accounts, so our tests focus on newly added accounts around the fee removal period. 12WelimitoursampletothreemonthspostfeeremovaltocaptureuserswholikelyjoinedeToroinresponse tothecancellationoffees. InTableA9oftheOnlineAppendix,weshowthatourresultsremainqualitatively similar when we expand our pre- and post-period sample to six months. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 68,
    "chunk_index": 47,
    "word_count": 373,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "percentage 11An important caveat is that we are unable to observe eToro customers who close their accounts, so our tests focus on newly added accounts around the fee removal period. 12WelimitoursampletothreemonthspostfeeremovaltocaptureuserswholikelyjoinedeToroinresponse tothecancellationoffees. InTableA9oftheOnlineAppendix,weshowthatourresultsremainqualitatively similar when we expand our pre- and post-period sample to six months. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 68,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "25 of users who report having no prior trading experience before joining eToro is significantly higher among users in treated countries in the post-period relative to the pre-period. In contrast, in non-treated countries, there is a significant decrease in the percentage of users reporting no trading experience between the pre- and post-periods. Column (6) reports the univariate difference-in-difference analysis. Here, we find that after the fee removal, the percentage of new users in treated countries who reported having no years of trading experience increased by 6.9% in the post-period relative to the percentage of new users in non-treated countries who reported having no years of trading experience in the same period. This suggests that removal of fees attracts less experienced users. Panels C-F provide further supporting evidence that the removal of fees attracted less sophisticated users to join eToro. Panel C shows that after the fee removal, the average age of new users in treated countries in the post-period fell by nearly two years compared to new users in non-treated countries. Panel D shows that the percentage of users with low technological sophistication increased by 4.6% for users in treated countries in the post- period relative to users in non-treated countries in the same period. Panels E and F show thattheaverageaccountsizedecreasedby$878.76andthatthepercentageofusersintreated countries who reported an annual income of less than $50,000 increased by 10.8% relative to new users in non-treated countries in the post-period. Overall, our findings suggest that the removal of trading fees led to a significant surge in eToro user registration, indicating that the removal of fees can be an effective strategy to attract and retain investors. Importantly, this strategy seems to appeal to users who are less sophisticated, younger, and have more modest financial means. These results are consistent with popular press narratives about the increased participation of less sophisticated investors in financial markets. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 68,
    "chunk_index": 49,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "effective strategy to attract and retain investors. Importantly, this strategy seems to appeal to users who are less sophisticated, younger, and have more modest financial means. These results are consistent with popular press narratives about the increased participation of less sophisticated investors in financial markets. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 68,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "26 4.5. Parallel Trends, Placebo Test, and Alternative Sample Window Our main difference-in-differences research design relies on the parallel trends assumption (Bertrand et al. (2004), Gow et al. (2016), Cuny et al. (2020)). This assumption underlies the belief that, in the absence of fee removal during our study period, changes in trading behavior would have followed parallel trends. To support this assumption, we plot time- series data of four trading behavior outcome variables for users in both the treated countries and the non-treated countries. The data are presented in Panels A, B, and C in Figures 1 through 4. Specifically, Figure 1 illustrates time series plots for the average monthly number of non-leveraged trades (Panel A), leveraged trades (Panel B), and short trades (Panel C). Figure 2 presents time series plots for the Monthly Average Trade Size. Figure 3 presents time series plots for the Monthly Number of Assets, while Figure 4 presents time series plots for the Monthly Number of Industries. Each of these figures (1 through 4) and their panels (A, B, and C) show that users in both treated and non-treated countries appear to follow parallel trends in the period before the fee removal. In each figure, we observe that the behaviors of affected and unaffected users begin to diverge only after the fee removal. Moreover, this pattern is observable only for non-leveraged trades, which were subject to the fee removal. Overall, these figures show no evidence that the parallel trends assumption is violated and thus strengthen our central conclusionthattheremovaloffeesindeedplaysasignificantroleinalteringtradingbehavior. We perform two additional tests to further explore the parallel trends assumption. In the first test, we follow prior studies and examine the parallel trends assumption using period indicator variables (Angrist and Pischke (2009) and Lechner (2011)). Specifically, we substi- tute the Post×Treat indicator with separate indicators for each month within our sample, each interacted with the Treat indicator. The fee removal event month is removed from the regression, aligning with our previous analyses. Additionally, the indicator for the month immediately preceding the fee removal event month is removed, serving as our benchmark. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 68,
    "chunk_index": 51,
    "word_count": 351,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "each month within our sample, each interacted with the Treat indicator. The fee removal event month is removed from the regression, aligning with our previous analyses. Additionally, the indicator for the month immediately preceding the fee removal event month is removed, serving as our benchmark. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 68,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "27 All dependent variables are computed for non-leveraged trades. The results of this analysis are presented in Panel D of Figures 1 through 4. All four figures show no evidence that the parallel trends assumption is invalid. Specifically, the estimated treatment effects are close to zero and statistically indistinguishable from the benchmark period. Subsequently, consistent with the notion that the fee removal impacts users’ trading behavior, we observe that during the post period, users in treated countries exhibit a gradually increasing level of both trade intensity and portfolio diversification, along with a reduction in trade size. Inarelatedtest, wefollowpriorstudiesandemployaplacebotest(AmoreandBennedsen (2013), DerrienandKecskes(2013), Almeidaetal.(2017), andBaiketal.(2022))toexamine the validity of our selection of the period after the fee removal months as our post-period. Specifically, we re-run our panel regressions for each of our main dependent variables, but this time we redefine our Post indicator as equal to one in the six months after a pseudo-fee removal event month, which we set from April 11, 2018 to May 10, 2018, exactly one year before the actual fee removal event month. We focus on the sample period from October 9, 2017 to November 6, 2018 and apply the same sample construction procedure as our initial analysis. Table A10 of the Online Appendix shows little to no evidence of significant changes inouroutcomesofinterestwhenusingalaggedevent-window. Overall, thisanalysissupports our conclusion that it is unlikely for pre-existing trading behavior patterns to explain our results. To provide additional evidence that our results can be attributed to the fee removal event rather than external factors, we shorten our sample window to include only two months prior to and two months after the fee removal event month. In Tables A11-A13 of the Online Appendix, we examine the effects of fee removal on trade intensity and size, portfolio diversification, and portfolio performance within this shortened sample window, spanning from February 11, 2019 to July 10, 2019. Overall, our analysis of the shortened sample window yields similar inferences to those drawn from our more expansive sample window. This suggests that users alter their trading intensity, trade size, and portfolio diversification Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 68,
    "chunk_index": 53,
    "word_count": 347,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "shortened sample window, spanning from February 11, 2019 to July 10, 2019. Overall, our analysis of the shortened sample window yields similar inferences to those drawn from our more expansive sample window. This suggests that users alter their trading intensity, trade size, and portfolio diversification Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 68,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "28 immediately following the fee removal event, further reinforcing our original findings. 5. Fee Removal and Investor Trading Performance We conclude the paper by examining the implications of the fee removal on investor gross returns and net-of-fees return performance. These tests are motivated by the seminal findings of Barber and Odean (2000), which show that despite assuming greater risk, retail investors’ gross investment returns failed to outperform market index returns. Furthermore, when accounting for transaction costs, investors’ net performance significantly underper- formed. Our study expands on these findings by examining investors’ gross performance and performance net-of-fees, taking into consideration how the presence and subsequent removal of these fees have influenced investor behavior. We begin by examining the aggregate gross performance of the non-leveraged positions of eToro users in both treated and non-treated countries using transactions-based calendar time portfolios approach, following Seasholes and Zhu (2010) and Barber et al. (2022b). This method tests whether purchases (sales) of stocks by users in treated countries predict future positive (negative) returns to a greater extent than those by users in non-treated countries. We first construct Buy and Sell portfolios for both treated and non-treated users in both the pre- and post-fee removal period. The Buy (Sell) portfolio purchases a quantity of shares equal to $1/P , where P is the price of stock i at the close of trading day t, for each it it purchase (sale) made by users in stock i on date t.13 Shares are then held in the portfolio for a specified holding period, denoted by H. The return of portfolio p on day t+1 is calculated as follows: N (cid:88) R = w R , (2) p,t+1 it i,t+1 i=1 13Toavoidthedailyrebalancingimplicitinanequal-weightedstrategy,whichcanleadtopositivelybiased returns (Barber et al. (2022b)), we invest $1/P for each user purchase (sale) in the Buy (Sell) portfolio. it Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 68,
    "chunk_index": 55,
    "word_count": 306,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "H. The return of portfolio p on day t+1 is calculated as follows: N (cid:88) R = w R , (2) p,t+1 it i,t+1 i=1 13Toavoidthedailyrebalancingimplicitinanequal-weightedstrategy,whichcanleadtopositivelybiased returns (Barber et al. (2022b)), we invest $1/P for each user purchase (sale) in the Buy (Sell) portfolio. it Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 68,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "29 S P it it w = (3) it (cid:80) S P it it where R is the stock return, w is the weight assigned to each position, and S is the i,t+1 it it total number of shares purchased for stock i on day t and the preceding H-1 days. We repeat this process for positions sold. The amalgamation of these portfolios allows us to test whether the intensity of purchases (or sales) over the past H days predicts next day returns. We construct Buy and Sell portfolios with holding periods of H ∈ 5, 25, and 50 days to evaluate whether eToro customers’ net purchases predict shorter- and/or longer-term returns.14 We then create a Buys − Sells long-short portfolio that is long in the Buy portfolio and short in the Sell portfolio for all days in our sample window. This process is executed separately for treated and non-treated users. Our main portfolio of interest, designed to compare the ability of treated versus non-treated users’ trades to predict returns, is constructed to be long in the treated user Buys − Sells portfolio and short in the non- treated user Buys−Sells portfolio. We compute daily abnormal returns for this portfolio as the intercept of the regression of the portfolio excess return on the Fama-French five factors, plus a momentum factor. Table 8 presents the results of this analysis. Columns (1), (4), and (7) examine daily portfolios from the pre-fee removal period, whereas columns (2), (5), and (8) investigate the post-fee removal period. Across all holding periods in Table 8, we find no evidence of significant abnormal returns for our portfolio of interest. These findings suggests that, both pre- and post- fee removal, the purchases and sales of users in treated countries neither significantly outperform nor underperform those of users in non-treated countries. Columns (3), (6), and (9) of Table 8 allow for the intercept and coefficients to vary pre- and post-fee removal. Thus, a key takeaway is that we observe no evidence of a difference in abnormal returns between the periods before and after the fee removal. This is consistent 14The average holding period of non-leveraged positions in our sample period is 48 days. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 68,
    "chunk_index": 57,
    "word_count": 369,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "and post-fee removal. Thus, a key takeaway is that we observe no evidence of a difference in abnormal returns between the periods before and after the fee removal. This is consistent 14The average holding period of non-leveraged positions in our sample period is 48 days. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 68,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "30 with users demonstrating no deterioration in stock-picking skills in the post-fee removal period. Moreover, in Table A14 of the Online Appendix, we find no significant abnormal returns for either the treated or non-treated Buys − Sells portfolios in both the pre- and post-fee removal periods. These findings remain robust against alternative holding periods or factor models.15 We next aim to quantify how performance, net of commission fees, changed following the fee removal. To do this, we adjust the returns of our portfolio of interest in Table 8 by the commission fees that would have been paid on such a portfolio with a turnover rate corresponding to its holding period. We find that a portfolio that is long in the treated users’ Buys−Sells portfolio and short in the non-treated users’ Buy−Sells portfolio, net of fees, generates significant positive abnormal returns in the post-fee removal period. This is entirely driven by the fee savings experienced by treated users during the post-fee removal period. As such, the magnitude of the abnormal return naturally increases with increased turnover(i.e., shorterholdingperiod). Nevertheless, wedonottabulatetheseresultsbecause this approach seems poorly suited to estimate the average improvement in net performance experienced by users in treated countries compared to users in non-treated countries. While the Buys − Sells portfolio approach from Seasholes and Wu (2007) in Table 8 offers insight into the performance of users’ trades by testing whether buys predict positive returns and sells predict negative returns, it does not approximate the average portfolio of a user in the treated and non-treated samples. Instead, the Buys−Sells portfolios can be interpreted either as the returns to an investor mimicking the trades of users in our sample, or as the inverse of the returns earned by an institution trading against the users in our sample, for example, when fulfilling their orders. In an effort to more accurately approximate changes in the net performance of an average 15Ourmainportfolioofinterestforeachofthesub-samplesusedinTables3and6doesnotshowsignificant abnormal returns within any sub-sample. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 68,
    "chunk_index": 59,
    "word_count": 326,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "or as the inverse of the returns earned by an institution trading against the users in our sample, for example, when fulfilling their orders. In an effort to more accurately approximate changes in the net performance of an average 15Ourmainportfolioofinterestforeachofthesub-samplesusedinTables3and6doesnotshowsignificant abnormal returns within any sub-sample. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 68,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "31 user’sportfolioinoursample, weconductandtabulatetestsusinguser-monthlevelmeasures of portfolio performance. The tests in Table 9 allow us to examine variation in the average return experienced by eToro users, as opposed to focusing on the most frequently bought and sold positions. Moreover, these tests allow us to better calibrate the effects of commission fees paid in the pre-period and net changes in portfolio turnover in the pre- versus post- periods. It is important to note that these tests suffer from several econometric limitations. For example, Seasholes and Wu (2007) highlights that holdings-based tests are likely to overstate differences in returns because individuals’ portfolio returns are cross-sectionally correlated and are sensitive to small portfolios with limited holdings. In Table 9, we measure the portfolio performance, denoted as Average Return, as the monthlyaveragedailyvalue-weightedrawreturnofauser’sportfolio. Wedefinetheportfolio Average Alpha as the monthly average daily value-weighted alpha of a user’s portfolio. We computethealphaofeachsecurityinauser’sportfolioasthedifferencebetweenthesecurity’s realized return and expected return. We compute expected returns using the Fama-French four factor loadings estimated from the prior 12 months of daily returns. In Panel A of Table 9, we examine the effect of fee removal on users’ performance before adjusting for commission fees paid. In line with the results documented in Table 8, we find no change in the gross portfolio performance between the pre- and post-periods for users in treated countries relative to users in non-treated countries, despite the potentially inflated t-statistics. This finding is also consistent with the evidence documented in Table 4 Panel B, indicating that users do not shift the composition of their portfolio toward smaller, more lottery-like securities. A key takeaway from the collective results in Tables 8 and 9 is that increased trading activity due to fee removal does not noticeably impact retail investors’ gross investment performance, implying that retail investors are not necessarily worse off when trading more frequently. In Panel B of Table 9, we re-examine investor performance, this time adjusting returns Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 68,
    "chunk_index": 61,
    "word_count": 319,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "is that increased trading activity due to fee removal does not noticeably impact retail investors’ gross investment performance, implying that retail investors are not necessarily worse off when trading more frequently. In Panel B of Table 9, we re-examine investor performance, this time adjusting returns Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 68,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "32 and alphas for commission fees paid. We find a significant improvement in after-fee monthly returns in the post-period for users in treated countries. The magnitude of 4bps per day in Panel B column (1) is economically meaningful and translates into an annualized return difference of about 11%, which is almost entirely driven by investment losses due to fees in the pre-period. TofurtherconnectourfindingstothoseinBarberandOdean(2000), Figure5replicatesa key figure (Figure 1) in their study. This figure plots the annualized gross and net returns by quintiles of the pre-fee removal average turnover for our non-leveraged sample. To compute the annualized gross returns and annualized net returns, we first sort users into quintiles by their average Monthly Turnover in the pre-fee removal period. Subsequently, we create daily time series of the average user-level daily portfolio gross and fee-adjusted returns for each quintile. We then compute an average daily return and average daily fee-adjusted return across the pre-fee removal period for each quintile and annualize these average daily returns. Contrary to the findings of Barber and Odean (2000), which indicate minimal variation in gross performance across turnover quintiles, Figure 5 shows an increasing trend in gross performance withtrading frequencyinour sample. Ourdata alsoshowsthat turnover forthe highest quintile is far larger than in Barber and Odean (2000), which is consistent with evi- denceinBarberetal.(2022a)thatmorerecentgenerationsofretailinvestorsdisplaydifferent trading behaviors compared to those from the 1990s. As expected, Figure 5 also exhibits a dramatic decrease in portfolio returns, net of fees, across turnover quintiles. Traders in the lowest turnover quintile earn an average annualized fee-adjusted return of 11.6 percent. In stark contrast, traders in the highest turnover quintile experience considerable losses, which translates to an average annualized fee-adjusted return of −21.2 percent. As in Barber and Odean (2000), the analyses in Figure 5 sort investors based on their trading frequency. However, these tests are not specifically designed to establish a causal relationship between trading intensity and retail investor performance. For example, some Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 68,
    "chunk_index": 63,
    "word_count": 324,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "fee-adjusted return of −21.2 percent. As in Barber and Odean (2000), the analyses in Figure 5 sort investors based on their trading frequency. However, these tests are not specifically designed to establish a causal relationship between trading intensity and retail investor performance. For example, some Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 68,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "33 traders may increase their trading activity after noticing higher returns from their previous trades. Conservely, some may feel compelled to liquidate their positions, thereby increasing turnover, as a result of poor performance. In both scenarios, trading is endogenous to user performance. A key innovation of our study is that we use fee removal as an exogenous shock on retail investor trade demand. We show that users who increase their trading activity in response to the fee removal outperform or underperform compared to unaffected users. Our use of fee removal as an instrumental variable raises concerns regarding the “only-through” condition for identification not holding true in our setting. For example, the removal of fees could influ- ence expected returns via channels beyond increased trading. We cannot completely dismiss this concern, hence our results should be interpreted with caution. Nonetheless, conventional finance theory posits that expected returns are primarily dictated by risk exposures. We find no evidence in Tables 4 and 8 to suggest that users significantly modify their exposure to standard proxies for expected return (e.g., portfolio bias towards smaller, glamour stocks). This concern is further allayed by the use of alphas in Table 9, which account for standard risk exposures, lending credence to the notion that trading intensity alone is unlikely to be the sole determinant of retail investor performance. 6. Conclusion We study the implications of removing commission fees on trading activity among retail investors,leveragingtheselectiveremovalofthesefeesoneToro,anonlinebrokerageplatform predominantly used by retail investors. Our results suggest that commission fees act as a barrier to participation, trading activity, and diversification for retail investors. These insights contribute to the ongoing regulatory debates concerning retail investors and retail brokerages. By using demographic information, we show that the removal of fees disproportionately Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 68,
    "chunk_index": 65,
    "word_count": 292,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Our results suggest that commission fees act as a barrier to participation, trading activity, and diversification for retail investors. These insights contribute to the ongoing regulatory debates concerning retail investors and retail brokerages. By using demographic information, we show that the removal of fees disproportionately Electronic copy available at: https://ssrn.com/abstract=4226044 34 affectedinexperiencedinvestorswithsmallerdepositamountsandlesstechnologicalsophisti- cation. This impacted both the number of participating investors (the extensive margin) and the level of trading activity among existing investors (the intensive margin). Importantly, we do not observe any significant change in retail investors’ gross investment performance or holdings of small, lottery-like stocks following the removal of fees. This suggests that increased trading frequency does not necessarily lead to worse outcomes for retail investors. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 68,
    "chunk_index": 66,
    "word_count": 122,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "investors (the intensive margin). Importantly, we do not observe any significant change in retail investors’ gross investment performance or holdings of small, lottery-like stocks following the removal of fees. This suggests that increased trading frequency does not necessarily lead to worse outcomes for retail investors. Electronic copy available at: https://ssrn.com/abstract=4226044 35 References Almeida, Heitor, Igor Cunha, Miguel A. Ferreira, and Felipe Restrepo (2017), “The Real Effects of Financial Shocks: Evidence from Exogenous Changes in Analyst Coverage.” Journal of Finance, 72, 249–290. Amore, Mario D. and Morten Bennedsen (2013), “The value of local political connections in a low-corruption environment.” Journal of Financial Economics, 110, 387–402. Angrist, Joshua D. and Jorn-Steffen Pischke (2009), Mostly Harmless Econometrics: An Empiricist’s Companion, chapter Instrumental Variables in Action: Sometimes You Get What You Need. Princeton University Press. Baik, Bok, Omri Even-Tov, Russell Han, and David Park (2022), “The real effects of conflict minerals disclosures.” Working Paper. Bali, Turan G., Nusret Cakici, and Robert F. Whitelaw (2011), “Maxing out: Stocks as lotteries and the cross-section of expected returns.” Journal of Financial Economics, 99, 427–446. Barber, BradM,XingHuang, TerranceOdean, andChristopherSchwarz(2022a), “Attention induced trading and returns: Evidence from robinhood users.” Journal of Finance. Barber, Brad M., Shengle Lin, and Terrance Odean (2022b), “Resolving a paradox: Retail trades positively predict returns but are not profitable.” Working Paper. Barber, Brad M and Terrance Odean (2000), “Trading is hazardous to your wealth: The common stock investment performance of individual investors.” The journal of Finance, 55, 773–806. Barber, Brad M. and Terrance Odean (2001), “Boys will be boys: Gender, overconfidence, and common stock investment.” Quarterly Journal of Economics, 116, 261–292. Bertrand, Marianne, Esther Duflo, and Sendhil Mullainathan (2004), “How Much Should We Trust Difference-in-Difference Estimates?” The Quarterly Journal and Economics, 119, 249–275. Bryzgalova, Svetlana, Anna Pavlova, and Taisiya Sikorskaya (2022), “Retail trading in op- tions and the rise of the big three wholesalers.” Available at SSRN. Butler, Alexander and Jess Cornaggia (2011), “Does access to external finance improve pro- ductivity? evidence from a natural experiment.” Journal of Financial Economics, 99, 184–203. Cuny, Christine, Omri Even-Tov, and Edward M. Watts (2020), “From Implicit to Explicit: The Impact of Disclosure Requirements on Hidden Transaction Costs.” Journal of Ac- counting Research, 59, 215–242. de Silva, Tim, Kevin Smith, and Eric C So (2022), “Losing is optional: Retail option trading and earnings announcement volatility.” Available at SSRN 4050165. Derrien, Francois and Ambrus Kecskes (2013), “The Real Effects of Financial Shocks: Evi- dence from Exogenous Changes in Analyst Coverage.” Journal of Finance, 68, 1407–1440. D’Acunto, Francesco, Nagpurnanand Prabhala, and Alberto G Rossi (2019), “The promises and pitfalls of robo-advising.” The Review of Financial Studies, 32, 1983–2020. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 68,
    "chunk_index": 67,
    "word_count": 442,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "and Ambrus Kecskes (2013), “The Real Effects of Financial Shocks: Evi- dence from Exogenous Changes in Analyst Coverage.” Journal of Finance, 68, 1407–1440. D’Acunto, Francesco, Nagpurnanand Prabhala, and Alberto G Rossi (2019), “The promises and pitfalls of robo-advising.” The Review of Financial Studies, 32, 1983–2020. Electronic copy available at: https://ssrn.com/abstract=4226044 36 Ernst, Thomas and Chester S Spatt (2022), “Payment for order flow and asset choice.” Technical report, National Bureau of Economic Research. Feldman, Naomi E, Peter Katuščák, and Laura Kawano (2016), “Taxpayer confusion: Evi- dence from the child tax credit.” American Economic Review, 106, 807–35. Giglio, Stefano, Matteo Maggiori, Johannes Stroebel, and Stephen Utkus (2021), “Five facts about beliefs and portfolios.” American Economic Review, 111, 1481–1522. Gow, Ian D., David F. Larcker, and Peter C. Reiss (2016), “Causal Inference in Accounting Research.” Journal of Accounting Research, 54, 477–523. Gruber, Jonathon (2006), “Own company stock in defined contribution pension plans: A takeover defense?” Journal of Financial Economics, 81, 379–410. Kim, Jaewoo (2018), “Asymmetrictimely lossrecognition, adverse shockstoexternalcapital, and underinvestment: Evidence from the collapse of the junk bond market.” Journal of Accounting and Economics, 65, 148–168. Kothari, SP, Travis L Johnson, and Eric C So (2021), “Commission savings and execution quality for retail trades.” Available at SSRN. Lechner,Michael(2011),“TheEstimationofCausalEffectsbyDifference-in-DifferenceMeth- ods.” Foundations and Trends in Econometrics, 4, 165–224. Odean, Terrance (1999), “Do investors trade too much?” American economic review, 89, 1279–1298. Rauh, Joshua (1994), “The incidence of mandated maternity benefits.” American Economic Review, 84, 622–641. Seasholes, Mark S and Guojun Wu (2007), “Predictable behavior, profits, and attention.” Journal of Empirical Finance, 14, 590–610. Seasholes, Mark S. and Ning Zhu (2010), “Individual investors and local bias.” Journal of Finance, 65, 1987–2010. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 68,
    "chunk_index": 68,
    "word_count": 280,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "incidence of mandated maternity benefits.” American Economic Review, 84, 622–641. Seasholes, Mark S and Guojun Wu (2007), “Predictable behavior, profits, and attention.” Journal of Empirical Finance, 14, 590–610. Seasholes, Mark S. and Ning Zhu (2010), “Individual investors and local bias.” Journal of Finance, 65, 1987–2010. Electronic copy available at: https://ssrn.com/abstract=4226044 37 Appendix A Treated Countries and Sample Breakdown by Trade Type Panel A reports the eToro trading fee removal event date by region and country. We code a country as treated if the date of fee removal falls between April 11, 2019 and May 10, 2019. Only countries with over 1,000 users are listed. Panel B provides the total number of users as well as the number of investors in treated countries by trade type. Panel A: Treated and Non-Treated Countries Region Region’s countries Treated Fee Removal Event Date Europe Group 1: France, Norway, Belgium, Sweden, Treated 4/15/2019 Hungary, Slovenia, Slovakia Group 2: Germany, Italy, Netherlands, Treated 5/6/2019 Switzerland, Ireland, Austria, Denmark, Romania, Poland, Czech Republic UK Group 2: UK Treated 5/6/2019 Australia Australia, New Zealand Non-Treated Post 1/1/2020 Asia China, Singapore, Taiwan, Malaysia, Philip- Non-Treated Post 1/1/2020 pines, India, Hong Kong, Indonesia, Thai- land, Vietnam Arabic Egypt, Morocco, Jordan, Tunisia, Saudi Non-Treated Post 1/1/2020 Arabia, United Arab Emirates South and Cen- Argentina, Chile, Colombia, Mexico, Brazil Non-Treated Post 1/1/2020 tral America Panel B: Sample Breakdown by Trade Type Trade Type Number of Users Number of Users in % of Users in Treated Treated Countries Countries Non-Leveraged Equity 14,602 9,629 65.9% Leveraged Equity 38,935 29,020 74.5% Short Equity 16,501 12,184 73.8% Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 68,
    "chunk_index": 69,
    "word_count": 266,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Brazil Non-Treated Post 1/1/2020 tral America Panel B: Sample Breakdown by Trade Type Trade Type Number of Users Number of Users in % of Users in Treated Treated Countries Countries Non-Leveraged Equity 14,602 9,629 65.9% Leveraged Equity 38,935 29,020 74.5% Short Equity 16,501 12,184 73.8% Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 68,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "38 Appendix B Key Variable Definitions Variable Description Post An indicator variable equal to one for months after the fee removal event month (April 11, 2019 to May 10, 2019) and zero in months prior to the fee removal event month Treat An indicator variable equal to one if a user resides in a treated country where eToro removed commission fees between April 11, 2019 and May 10, 2019 and zero if a user resides in a non- treated country Monthly Turnover Total trade volume (buy and sell) in a given month scaled by the user’s monthly average portfolio value Monthly Number of Trades Total number of trades (buy and sell) executed by a user in a given month Monthly Average Trade Size Average trade size scaled by portfolio value of all trades exe- cuted by a user in a given month Non-Leveraged Fraction of Portfo- The fraction of the total dollar amount invested in equities in lio Value a given month that is invested as a non-leveraged position Non-Leveraged Fraction of Posi- The fraction of the total equity positions open in a given tions month that are opened as non-leveraged positions Portfolio Average Size The average log-adjusted market value of equity of all stocks in a user’s portfolio in a given month, weighted by the amount invested in each stock Portfolio Average Book-to-Market The average book-to-market of all stocks in a user’s portfolio in a given month, weighted by the amount invested in each stock Portfolio Average Momentum The average momentum, computed using the prior 12-month return, of all stocks in a user’s portfolio in a given month, weighted by the amount invested in each stock Portfolio Average MAX The average MAX, computed as the maximum daily return over the prior month, of all stocks in a user’s portfolio in a given month, weighted by the amount invested in each stock Monthly Number of Assets The unique number of stocks held by a user in a given month Monthly Number of Industries The unique number of Fama French 48 industries in a user’s portfolio in a given month Monthly Average Pairwise Correla- The average of the pairwise correlations between the daily tion returns of all assets in a user’s portfolio in a given month Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 68,
    "chunk_index": 71,
    "word_count": 380,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Number of Industries The unique number of Fama French 48 industries in a user’s portfolio in a given month Monthly Average Pairwise Correla- The average of the pairwise correlations between the daily tion returns of all assets in a user’s portfolio in a given month Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 68,
    "chunk_index": 72,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "39 Variable Description Average Return The monthly average daily value-weighted return of a user’s portfolio Average Fee-Adjusted Return The monthly average daily value-weighted return of a user’s portfolio, adjusted for commission fees paid Average Alpha The monthly average daily value-weighted alpha of a user’s portfolio; The alpha of each security is computed as the dif- ference between the security’s daily return and the security’s expected return, where the expected return is computed using Fama-French four factor loadings from the prior 12 months of returns Average Fee-Adjusted Alpha The monthly average daily value-weighted alpha of a user’s portfolio, adjusted for commission fees paid I(No Experience) An indicator variable equal to one if a user reports having zero prior years of trading experience when opening their ac- count, and zero otherwise Years Experience The number of years of trading experience a user has at the time of the fee removal, computed as the number of years of trading experience reported when opening an account plus the number of years the account is active before the fee removal event month Age User age I(Low Technological Sophistication) An indicator variable equal to one for users with low techno- logical sophistication; we label users as having low technologi- cal sophistication if they report an occupation in a non-STEM or non-Finance related industry Account Size The user-level average total amount invested in equity posi- tions in a given month I(Income Below $50,000) An indicator equal to one if a user reports annual income be- low $50,000, and zero otherwise Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 68,
    "chunk_index": 73,
    "word_count": 258,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "an occupation in a non-STEM or non-Finance related industry Account Size The user-level average total amount invested in equity posi- tions in a given month I(Income Below $50,000) An indicator equal to one if a user reports annual income be- low $50,000, and zero otherwise Electronic copy available at: https://ssrn.com/abstract=4226044 40 Appendix C Retail Order Flow Across Platforms This table presents panel regressions of Activity (unsigned retail order flow) and Sentiment (net signed order flow) as reported by NASDAQ ‘Retail Trading Activity Tracker” on the same measure computed for eToro. These measures are calculated for each stock/date in our sample. In columns 1-3, the variable of interest is Activity and in columns 4-6 the variable of interest is Sentiment. Each of the columns uses a different set of fixed ef- fects: Firm fixed effects, Date fixed effects, and Firm and Date fixed effects. In all cases standard errors are clustered by firm and date. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. (1) (2) (3) (4) (5) (6) Activity Activity Activity Sentiment Sentiment Sentiment Firm FE Date FE Firm and Date FE Firm FE Date FE Firm and Date FE Activity 0.077*** 0.158*** 0.077*** (8.49) (11.67) (8.50) Sentiment 0.008*** 0.008*** 0.007*** (13.19) (12.19) (12.17) Observations 1,125,736 1,125,736 1,125,736 697,016 697,016 697,016 R-squared 0.65 0.35 0.65 0.07 0.03 0.10 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 41,
    "page_range": "p.41-42",
    "total_pages": 68,
    "chunk_index": 74,
    "word_count": 235,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.41-42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Sentiment Firm FE Date FE Firm and Date FE Firm FE Date FE Firm and Date FE Activity 0.077*** 0.158*** 0.077*** (8.49) (11.67) (8.50) Sentiment 0.008*** 0.008*** 0.007*** (13.19) (12.19) (12.17) Observations 1,125,736 1,125,736 1,125,736 697,016 697,016 697,016 R-squared 0.65 0.35 0.65 0.07 0.03 0.10 Electronic copy available at: https://ssrn.com/abstract=4226044 41 Appendix D Daily activity measure: NASDAQ vs. eToro This figure presents time series plots for the “activity” level, which measures the daily retail trading in a given stock relative to all stocks that day, on NASDAQ (in blue) and eToro (in red). We plot the relation during our sample period for TSLA, NTFX, and AAPL. QADSAN-ytivitcA 2. 51. 1. 50. 0 8. 6. 4. 2. 0 oroTe-ytivitcA AAPL 01jan2016 01jan2017 01jan2018 01jan2019 01jan2020 01jan2021 Date QADSAN-ytivitcA 51. 1. 50. 0 5. 4. 3. 2. 1. 0 oroTe-ytivitcA NFLX 01jan2016 01jan2017 01jan2018 01jan2019 01jan2020 01jan2021 Date QADSAN-ytivitcA 2. 51. 1. 50. 0 8. 6. 4. 2. 0 oroTe-ytivitcA TSLA 01jan2016 01jan2017 01jan2018 01jan2019 01jan2020 01jan2021 Date Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 42,
    "page_range": "p.42-43",
    "total_pages": 68,
    "chunk_index": 75,
    "word_count": 171,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.42-43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "01jan2018 01jan2019 01jan2020 01jan2021 Date QADSAN-ytivitcA 51. 1. 50. 0 5. 4. 3. 2. 1. 0 oroTe-ytivitcA NFLX 01jan2016 01jan2017 01jan2018 01jan2019 01jan2020 01jan2021 Date QADSAN-ytivitcA 2. 51. 1. 50. 0 8. 6. 4. 2. 0 oroTe-ytivitcA TSLA 01jan2016 01jan2017 01jan2018 01jan2019 01jan2020 01jan2021 Date Electronic copy available at: https://ssrn.com/abstract=4226044 42 Figure 1 Monthly Number of Trades This figure presents time series plots for the average monthly number of non-leveraged trades (Panel A), leveraged trades (Panel B), and short trades (Panel C) for both treated and non-treated countries from October 9, 2018 to November 6, 2019. The dotted horizontal lines indicate the fee removal event month. Panel D presents evidence of parallel trends between users in treated and non-treated countries. To con- struct Panel D, we conduct a single regression that incorporates indicators for every month in the sample period (October 9, 2018 to November 6, 2019) interacted with the Treat indicator. We exclude the month prior to the fee removal, which serves as the benchmark period. The coefficient estimates (plotted along the x-axis) of each monthly interaction term, along with their corresponding two-tailed 90% confidence in- tervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 43,
    "page_range": "p.43-44",
    "total_pages": 68,
    "chunk_index": 76,
    "word_count": 195,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.43-44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "6, 2019) interacted with the Treat indicator. We exclude the month prior to the fee removal, which serves as the benchmark period. The coefficient estimates (plotted along the x-axis) of each monthly interaction term, along with their corresponding two-tailed 90% confidence in- tervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044 43 Figure 2 Monthly Average Trade Size This figure presents time series plots for the monthly average trade size of non-leveraged trades (Panel A), leveraged trades (Panel B), and short trades (Panel C) for treated and non-treated countries from October 9, 2018 to November 6, 2019. The horizontal dotted lines indicate the fee removal event month. Panel D presents evidence of parallel trends between treated and non-treated users. To construct Panel D, we include, in one regression, indicators for every month in the sample period (October 9, 2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly interaction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 68,
    "chunk_index": 77,
    "word_count": 186,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "9, 2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly interaction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044 44 Figure 3 Monthly Number of Assets Held This figure presents time series plots for the average monthly number of assets held in non-leveraged posi- tions (Panel A), leveraged positions (Panel B), and short positions (Panel C) for treated and non-treated countries from October 9, 2018 to November 6, 2019. The horizontal dotted lines indicate the fee removal event month. Panel D presents evidence of parallel trends between treated and non-treated users. To con- struct Panel D, we include, in one regression, indicators for every month in the sample period (October 9, 2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly in- teraction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 68,
    "chunk_index": 78,
    "word_count": 192,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly in- teraction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044 45 Figure 4 Monthly Number of Industries This figure presents time series plots for the average monthly number of industries held in non-leveraged positions (Panel A), leveraged positions (Panel B), and short positions (Panel C) for treated and non- treated countries from October 9, 2018 to November 6, 2019. The horizontal dotted lines indicate the fee removal event month. Panel D presents evidence of parallel trends between treated and non-treated users. To construct Panel D, we include, in one regression, indicators for every month in the sample period (Oc- tober 9, 2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly interaction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 46,
    "page_range": "p.46-47",
    "total_pages": 68,
    "chunk_index": 79,
    "word_count": 190,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.46-47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "9, 2018 to November 6, 2019) except for the month prior to the fee removal, which serves as the benchmark period, interacted with the Treat indicator. The coefficient estimates (on the x-axis) for each monthly interaction term and corresponding two-tailed 90% confidence intervals are plotted. Electronic copy available at: https://ssrn.com/abstract=4226044 46 Figure 5 Monthly Turnover and Annualized Returns This figure presents the annualized gross portfolio returns, annualized net portfolio returns, and monthly turnover by turnover quintile in the pre-fee removal for our sample, which includes users with at least one non-leveraged position during this period. To compute the annualized gross returns andnet returns, we first sort users into quintiles based on their average Monthly Turnover in the pre-fee removal period. We then form daily time series for the average user-level daily portfolio return and average user-level daily fee- adjusted portfolio return for each quintile. Subsequently, we compute an average daily return and average daily fee-adjusted return for each quintile over the pre-fee removal period for each quintile and then annu- alize the average daily returns. The black bar represents the average Monthly Turnover for each quintile in the pre-fee removal period. The dark gray (light gray) bar denotes the average annualized gross (net) portfolio return during the pre-fee removal period. 0.2 2 0.1 1 0.0 0 −0.1 −1 −0.2 −2 1 2 3 4 5 Quintiles Based on Monthly Turnover nruteR launnA Monthly Turnover Turnover Gross Return Net Return Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 47,
    "page_range": "p.47-48",
    "total_pages": 68,
    "chunk_index": 80,
    "word_count": 244,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.47-48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "(light gray) bar denotes the average annualized gross (net) portfolio return during the pre-fee removal period. 0.2 2 0.1 1 0.0 0 −0.1 −1 −0.2 −2 1 2 3 4 5 Quintiles Based on Monthly Turnover nruteR launnA Monthly Turnover Turnover Gross Return Net Return Electronic copy available at: https://ssrn.com/abstract=4226044 47 Table 1 Descriptive Statistics This table provides descriptive statistics for the variables used in our analysis for each trade type sam- ple. Panel A presents statistics for the non-leveraged sample, Panel B for the leveraged sample, and Panel C for the short sample. Panel D (E) reports statistics for users who are in both the non-leveraged and leveraged (short) samples. The variables in Panel D (E) are calculated as the difference between the non- leveraged outcome and the leveraged outcome (short outcome). All variables are defined in Appendix B. Panel A: Non-Leveraged Sample Statistics Variable N Mean SD p25 Median p75 Monthly Turnover 69,858 0.389 1.243 0 0 0.276 Monthly Number of Trades 69,858 4.144 18.967 0 0 2 Monthly Average Trade Size 31,059 0.292 0.306 0.064 0.172 0.418 Fraction of Portfolio Value 61,050 0.741 0.359 0.500 1 1 Fraction of Positions 61,050 0.721 0.369 0.429 1 1 Portfolio Average Size 54,544 24.886 1.767 23.920 25.076 26.193 Portfolio Average Book-to-Market 51,158 0.807 2.617 0.135 0.268 0.503 Portfolio Average Momentum 51,776 −0.008 0.256 −0.160 −0.019 0.111 Portfolio Average MAX 54,544 0.053 0.032 0.033 0.049 0.069 Monthly Number of Assets 69,858 3.886 8.251 0 1 4 Monthly Number of Industries 69,858 2.396 3.215 1 1 3 Monthly Average Pairwise Correlation 48,896 0.606 0.349 0.303 0.595 1 Average Return 54,807 0.001 0.025 −0.002 0.001 0.003 Average Alpha 54,776 0.00003 0.025 −0.002 −0.00005 0.002 Average Fee-Adjusted Return 54,807 −0.0002 0.025 −0.003 0.0004 0.003 Average Fee-Adjusted Alpha 54,776 −0.001 0.025 −0.003 −0.0005 0.001 I(No Experience) 14,602 0.495 0.500 0 0 1 Years Experience 14,602 2.625 2.170 1.178 2.053 3.764 Age 14,602 37.349 10.395 30 35 43 I(Low Technological Sophistication) 14,602 0.513 0.500 0 1 1 Account Size 14,602 3,393.26011,872.910236.028 874.126 2,889.598 I(Income Below $50,000) 14,602 0.633 0.482 0 1 1 Panel B: Leveraged Sample Statistics Variable N Mean SD p25 Median p75 Monthly Turnover 188,492 1.208 3.591 0 0.045 0.994 Monthly Number of Trades 188,492 8.268 29.321 0 1 6 Monthly Average Trade Size 102,684 0.409 0.342 0.131 0.314 0.607 Monthly Number of Assets 188,492 2.480 5.118 0 1 3 Monthly Number of Industries 188,492 1.656 2.506 0 1 2 Monthly Average Pairwise Correlation 108,964 0.616 0.360 0.300 0.637 1 I(No Experience) 38,935 0.543 0.498 0 1 1 Years Experience 38,935 2.328 1.908 1.184 1.690 3.060 Age 38,935 37.833 10.649 30 36 44 I(Low Technological Sophistication) 38,935 0.549 0.498 0 1 1 Account Size 38,935 1,426.2217,840.386 31.863 162.634 770.255 I(Income Below $50,000) 38,935 0.650 0.477 0 1 1 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 68,
    "chunk_index": 81,
    "word_count": 469,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "0.543 0.498 0 1 1 Years Experience 38,935 2.328 1.908 1.184 1.690 3.060 Age 38,935 37.833 10.649 30 36 44 I(Low Technological Sophistication) 38,935 0.549 0.498 0 1 1 Account Size 38,935 1,426.2217,840.386 31.863 162.634 770.255 I(Income Below $50,000) 38,935 0.650 0.477 0 1 1 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 68,
    "chunk_index": 82,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "48 Panel C: Short Sample Statistics Variable N Mean SD p25 Median p75 Monthly Turnover 68,981 0.900 3.017 0 0 0.653 Monthly Number of Trades 68,981 4.997 16.172 0 0 4 Monthly Average Trade Size 34,352 0.415 0.331 0.140 0.324 0.631 Monthly Number of Assets 68,981 1.373 3.164 0 1 1 Monthly Number of Industries 68,981 1.063 1.851 0 0 1 Monthly Average Pairwise Correlation 33,092 0.679 0.384 0.325 1 1 I(No Experience) 16,501 0.511 0.500 0 1 1 Years Experience 16,501 2.296 1.891 1.063 1.693 3.134 Age 16,501 37.279 10.415 30 36 43 I(Low Technological Sophistication) 16,501 0.561 0.496 0 1 1 Account Size 16,501 1,424.3465,033.246 41.768 197.431 890.001 I(Income Below $50,000) 16,501 0.673 0.469 0 1 1 Panel D: Non-Leveraged Minus Leveraged Sample Statistics Variable N Mean SD p25 Median p75 Monthly Turnover 41,421 −0.485 3.590 −0.216 0 0.081 Monthly Number of Trades 41,421 −5.000 42.526 −4 0 1 Monthly Average Trade Size 14,285 0.073 0.219 −0.004 0.027 0.124 Monthly Number of Assets 41,421 0.967 10.027 −1 0 3 Monthly Number of Industries 41,421 0.497 4.172 −1 0 2 Monthly Average Pairwise Correlation 28,743 0.211 0.502 −0.059 0.163 0.584 Panel E: Non-Leveraged Minus Short Sample Statistics Variable N Mean SD p25 Median p75 Monthly Turnover 20,911 0.061 2.665 −0.004 0 0.316 Monthly Number of Trades 20,911 2.554 32.174 −1 0 3 Monthly Average Trade Size 6,504 0.044 0.219 −0.016 0.015 0.100 Monthly Number of Assets 20,911 3.184 9.488 0 1 4 Monthly Number of Industries 20,911 1.621 3.965 0 1 3 Monthly Average Pairwise Correlation 14,244 0.250 0.542 −0.001 0.253 0.670 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 68,
    "chunk_index": 83,
    "word_count": 268,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "2.554 32.174 −1 0 3 Monthly Average Trade Size 6,504 0.044 0.219 −0.016 0.015 0.100 Monthly Number of Assets 20,911 3.184 9.488 0 1 4 Monthly Number of Industries 20,911 1.621 3.965 0 1 3 Monthly Average Pairwise Correlation 14,244 0.250 0.542 −0.001 0.253 0.670 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 68,
    "chunk_index": 84,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "49 Table 2 Monthly Turnover, Monthly Number of Trades, and Monthly Average Trade Size This table reports the regression results of the differential changes in investor trading behavior for various types of trades pre- and post-fee removal event month based on whether the investor resides in a treated country or not. The sample period spans from October 9, 2018 to November 6, 2019. In Panel A, the de- pendent variable is Monthly Turnover. In Panel B, the dependent variable is Monthly Number of Trades, while in Panel C, it is Monthly Average Trade Size. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. In Column 4 (5) across all panels, we limit our sample to users who trade both non-leveraged trades and leveraged trades (or short trades) and cal- culate the dependent variable as the difference between the two outcome variables for each user. Treated countries are defined in Appendix A. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Monthly Turnover Dependent Variable: Monthly Turnover Non- Non- Non- Leveraged Leveraged Leveraged Short Trades Leveraged Trades Minus Trades Minus Short Leveraged (1) (2) (3) (4) (5) Post×Treat 0.126∗∗∗ 0.067 0.063 0.177∗∗ 0.119∗ (6.353) (1.487) (1.127) (3.009) (1.896) User FE Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Users 14,602 38,935 16,501 8,966 4,601 Observations 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.310 0.261 0.189 0.254 0.240 Panel B: Monthly Number of Trades Dependent Variable: Monthly Number of Trades Non- Non- Non- Leveraged Leveraged Leveraged Short Trades Leveraged Trades Minus Trades Minus Short Leveraged (1) (2) (3) (4) (5) Post×Treat 1.502∗∗∗ −0.007 0.358 3.363∗∗∗ 2.286∗∗ (4.971) (−0.024) (1.487) (4.740) (2.508) User FE Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Users 14,602 38,935 16,501 8,966 4,601 Observations 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.563 0.464 0.324 0.480 0.533 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 68,
    "chunk_index": 85,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "(5) Post×Treat 1.502∗∗∗ −0.007 0.358 3.363∗∗∗ 2.286∗∗ (4.971) (−0.024) (1.487) (4.740) (2.508) User FE Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Users 14,602 38,935 16,501 8,966 4,601 Observations 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.563 0.464 0.324 0.480 0.533 Electronic copy available at: https://ssrn.com/abstract=4226044 50 Panel C: Monthly Average Trade Size Dependent Variable: Monthly Average Trade Size Non- Non- Non- Leveraged Leveraged Leveraged Short Trades Leveraged Trades Minus Trades Minus Short Leveraged (1) (2) (3) (4) (5) Post×Treat −0.021∗∗∗ −0.170∗∗∗ −0.010 −0.039∗∗∗ −0.057∗∗∗ (−3.566) (−3.763) (−1.129) (−5.700) (−5.824) User FE Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Users 13,632 38,700 16,480 7,856 3,959 Observations 58,466 167,617 51,408 22,451 9,851 Adjusted R2 0.645 0.515 0.532 0.388 0.363 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 68,
    "chunk_index": 86,
    "word_count": 132,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "(5) Post×Treat −0.021∗∗∗ −0.170∗∗∗ −0.010 −0.039∗∗∗ −0.057∗∗∗ (−3.566) (−3.763) (−1.129) (−5.700) (−5.824) User FE Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Users 13,632 38,700 16,480 7,856 3,959 Observations 58,466 167,617 51,408 22,451 9,851 Adjusted R2 0.645 0.515 0.532 0.388 0.363 Electronic copy available at: https://ssrn.com/abstract=4226044 51 Table 3 Cross-Sectional Analysis of the Effect of Fee Removal on Trading Behavior This table examines the effects of fee removal on three measures of investor behavior: Monthly Turnover, Monthly Number of Trades, and Monthly Average Trade Size, specifically for non-leveraged trades. The analysis covers various cross-sectional cuts over a sample period from October 9, 2018 to November 6, 2019. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. Panel A columns 1, 3, and 5 (columns 2, 4, and 6) report the results for users with above (below) the median average monthly number of trades pre-fee removal. Panels B, C, D, E and F present similar analyses based on trading experience, age, technological sophistication, account size, and income, respectively. Treated countries are defined in Appendix A. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Cut on Median Trading Frequency Monthly Turnover Monthly Number of Trades Monthly Average Trade Size High Trading Low Trading High Trading Low Trading High Trading Low Trading Frequency Frequency Frequency Frequency Frequency Frequency (1) (2) (3) (4) (5) (6) Post×Treat 0.224∗∗∗ 0.025∗∗ 2.968∗∗∗ 0.263∗∗ −0.019∗∗ −0.027∗ (5.349) (2.485) (4.345) (3.003) (−3.036) (−2.082) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 6,808 7,794 6,808 7,794 6,808 6,824 Observations 70,702 86,768 70,702 86,768 41,060 17,406 Adjusted R2 0.297 0.158 0.555 0.318 0.573 0.635 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 70.463 42.471 0.567 p-value <0.001∗∗∗ <0.001∗∗∗ 0.451 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 52,
    "page_range": "p.52",
    "total_pages": 68,
    "chunk_index": 87,
    "word_count": 350,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 6,808 7,794 6,808 7,794 6,808 6,824 Observations 70,702 86,768 70,702 86,768 41,060 17,406 Adjusted R2 0.297 0.158 0.555 0.318 0.573 0.635 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 70.463 42.471 0.567 p-value <0.001∗∗∗ <0.001∗∗∗ 0.451 Electronic copy available at: https://ssrn.com/abstract=4226044 52 Panel B: Cut on Median Trading Experience Monthly Turnover Monthly Number of Trades Monthly Average Trade Size Low Experience High Experience Low Experience High Experience Low Experience High Experience (1) (2) (3) (4) (5) (6) Post×Treat 0.169∗∗∗ 0.031 2.211∗∗∗ 0.680 −0.048∗∗∗ −0.010 (5.298) (1.726) (6.530) (1.506) (−5.260) (−1.378) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,225 7,377 7,225 7,377 6,800 6,832 Observations 75,799 81,671 75,799 81,671 26,876 31,590 Adjusted R2 0.278 0.366 0.408 0.615 0.603 0.674 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 40.084 16.543 29.963 p-value <0.001∗∗∗ <0.001∗∗∗ <0.001∗∗∗ Panel C: Cut on Median Age Monthly Turnover Monthly Number of Trades Monthly Average Trade Size Low Age High Age Low Age High Age Low Age High Age (1) (2) (3) (4) (5) (6) Post×Treat 0.144∗∗∗ 0.078∗∗∗ 1.408∗∗∗ 1.368∗∗ −0.027∗∗∗ −0.025∗∗∗ (5.807) (3.332) (5.764) (2.662) (−3.571) (−3.204) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,333 7,269 7,333 7,269 6,952 6,680 Observations 78,374 79,096 78,374 79,096 29,121 29,345 Adjusted R2 0.273 0.339 0.419 0.589 0.625 0.665 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 9.032 0.011 0.079 p-value 0.003∗∗∗ 0.918 0.779 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 53,
    "page_range": "p.53",
    "total_pages": 68,
    "chunk_index": 88,
    "word_count": 261,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.53)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 7,333 7,269 7,333 7,269 6,952 6,680 Observations 78,374 79,096 78,374 79,096 29,121 29,345 Adjusted R2 0.273 0.339 0.419 0.589 0.625 0.665 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 9.032 0.011 0.079 p-value 0.003∗∗∗ 0.918 0.779 Electronic copy available at: https://ssrn.com/abstract=4226044 53 Panel D: Cut on Technological Sophistication Monthly Turnover Monthly Number of Trades Monthly Average Trade Size Low Tech High Tech Low Tech High Tech Low Tech High Tech Sophistication Sophistication Sophistication Sophistication Sophistication Sophistication (1) (2) (3) (4) (5) (6) Post×Treat 0.170∗∗∗ 0.078∗∗∗ 2.163∗∗∗ 0.820∗∗ −0.039∗∗∗ −0.003 (6.563) (3.147) (4.124) (2.367) (−4.512) (−0.501) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,484 7,118 7,484 7,118 7,036 6,596 Observations 79,778 77,692 79,778 77,692 29,800 28,666 Adjusted R2 0.313 0.305 0.593 0.474 0.642 0.648 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 18.194 13.075 26.019 p-value <0.001∗∗∗ <0.001∗∗∗ <0.001∗∗∗ Panel E: Cut on Median Account Size Monthly Turnover Monthly Number of Trades Monthly Average Trade Size High Account High Account High Account Low Account Size Low Account Size Low Account Size Size Size Size (1) (2) (3) (4) (5) (6) Post:Treat 0.178∗∗∗ 0.040 1.200∗∗∗ 1.673∗∗∗ −0.062∗∗∗ −0.018∗∗∗ (5.680) (1.629) (5.627) (3.215) (−4.322) (−3.206) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,301 7,301 7,301 7,301 6,804 6,828 Observations 75,622 81,848 75,622 81,848 21,476 36,990 Adjusted R2 0.303 0.321 0.370 0.579 0.545 0.564 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 40.08 1.632 26.432 p-value <0.001∗∗∗ 0.201 <0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 54,
    "page_range": "p.54",
    "total_pages": 68,
    "chunk_index": 89,
    "word_count": 273,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 7,301 7,301 7,301 7,301 6,804 6,828 Observations 75,622 81,848 75,622 81,848 21,476 36,990 Adjusted R2 0.303 0.321 0.370 0.579 0.545 0.564 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 40.08 1.632 26.432 p-value <0.001∗∗∗ 0.201 <0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044 54 Panel F: Cut on User Income Monthly Turnover Monthly Number of Trades Monthly Average Trade Size Below $50,000 Above $50,000 Below $50,000 Above $50,000 Below $50,000 Above $50,000 Income Income Income Income Income Income (1) (2) (3) (4) (5) (6) Post×Treat 0.161∗∗∗ 0.060∗ 1.457∗∗∗ 1.555∗∗ −0.025∗∗∗ −0.015 (7.131) (1.885) (5.214) (2.514) (−3.557) (−1.663) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 9,248 5,354 9,248 5,354 8,709 4,923 Observations 99,128 58,342 99,128 58,342 37,628 20,838 Adjusted R2 0.323 0.274 0.514 0.598 0.636 0.661 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 21.718 0.053 1.893 p-value <0.001∗∗∗ 0.818 0.169 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 55,
    "page_range": "p.55-56",
    "total_pages": 68,
    "chunk_index": 90,
    "word_count": 164,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.55-56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 9,248 5,354 9,248 5,354 8,709 4,923 Observations 99,128 58,342 99,128 58,342 37,628 20,838 Adjusted R2 0.323 0.274 0.514 0.598 0.636 0.661 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 21.718 0.053 1.893 p-value <0.001∗∗∗ 0.818 0.169 Electronic copy available at: https://ssrn.com/abstract=4226044 55 Table 4 Portfolio Composition Characteristics This table reports the regression results of the differential changes in investors’ portfolio composition pre- and post-fee removal event month based on whether the user resides in a treated country or not. The sam- ple period spans from October 9, 2018 to November 6, 2019. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. Panel A examines Fraction of Portfolio Value, the fraction of total equity portfolio value held as non-leveraged positions, and Fraction of Positions, the fraction of total equity positions held as non-leveraged. In columns (1) and (3), we limit our sample to users who hold at least one non-leveraged equity position in the six months preceding fee removal. In columns (2) and (4), we limit our sample to users who hold at least one non-leveraged, lever- aged or short equity position within the same time frame. Panels B, C, D, and E focus on Portfolio Aver- age Size, Portfolio Average Book-to-Market, Portfolio Average Momentum, and Portfolio Average MAX, respectively. In these panels, column (1) examines the portfolio characteristics of non-leveraged equity positions for users in the non-leveraged sample. Column (2) examines the portfolio characteristics of all equity positions for users in the non-leveraged sample. Column (3) (column (4)) examines the difference in portfolio characteristics between non-leveraged positions and leveraged positions (short positions) for users who hold both non-leveraged and leveraged (short) positions in the pre-period. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Fraction of Portfolio Value and Positions Held as Non-Leveraged Fraction of Portfolio Value Fraction of Positions Non-Leveraged All Equity Non-Leveraged All Equity Sample Sample Sample Sample (1) (2) (3) (4) Post×Treat 0.030∗∗∗ 0.030∗∗∗ 0.037∗∗∗ 0.033∗∗∗ (5.899) (6.262) (6.666) (6.559) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 14,602 45,622 14,602 45,622 Observations 120,324 279,080 120,324 279,080 Adjusted R2 0.711 0.837 0.712 0.835 Panel B: Portfolio Average Size Portfolio Average Size Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Minus Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat −0.029 −0.031 0.024 −0.073 (−1.358) (−1.481) (0.468) (−0.592) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 14,109 14,439 8,177 3,892 Observations 104,033 118,031 33,577 10,818 Adjusted R2 0.797 0.760 0.499 0.420 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 68,
    "chunk_index": 91,
    "word_count": 476,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat −0.029 −0.031 0.024 −0.073 (−1.358) (−1.481) (0.468) (−0.592) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 14,109 14,439 8,177 3,892 Observations 104,033 118,031 33,577 10,818 Adjusted R2 0.797 0.760 0.499 0.420 Electronic copy available at: https://ssrn.com/abstract=4226044 56 Panel C: Portfolio Average Book-to-Market Portfolio Average Book-to-Market Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Minus Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat −0.034 0.002 −0.058 −0.219 (−1.118) (0.064) (−0.990) (−1.368) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 13,448 14,113 7,634 3,572 Observations 98,109 113,098 30,489 9,550 Adjusted R2 0.786 0.703 0.608 0.403 Panel D: Portfolio Average Momentum Portfolio Average Momentum Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Minus Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat −0.026∗∗∗ −0.029∗∗∗ 0.010 −0.007 (−3.218) (−3.653) (0.841) (−0.254) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 13,840 14,332 7,898 3,723 Observations 100,391 115,247 31,872 10,052 Adjusted R2 0.570 0.518 0.368 0.361 Panel E: Portfolio Average MAX Portfolio Average MAX Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Minus Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat 0.0003 0.0005 −0.0004 −0.002 (0.372) (0.776) (−0.434) (−0.701) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 14,109 14,439 8,177 3,892 Observations 104,033 118,031 33,577 10,818 Adjusted R2 0.476 0.461 0.190 0.088 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 57,
    "page_range": "p.57-58",
    "total_pages": 68,
    "chunk_index": 92,
    "word_count": 236,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.57-58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Leveraged Minus Short Trades (1) (2) (3) (4) Post×Treat 0.0003 0.0005 −0.0004 −0.002 (0.372) (0.776) (−0.434) (−0.701) User FE Yes Yes Yes Yes Month FE Yes Yes Yes Yes Users 14,109 14,439 8,177 3,892 Observations 104,033 118,031 33,577 10,818 Adjusted R2 0.476 0.461 0.190 0.088 Electronic copy available at: https://ssrn.com/abstract=4226044 57 Table 5 Monthly Number of Assets Held, Industries Held, and Average Pairwise Correlation This table reports the regression results of the differential changes in investor trading behavior across various trade types pre- and post-fee removal event month based on whether the investor resides in a treated country or not. The sample period spans from October 9, 2018 to November 6, 2019. In Panel A, the dependent variable is Monthly Number of Assets. In Panel B, the dependent variable is Monthly Number of Industries, and in Panel C, it is Monthly Average Pairwise Correlation. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. In Column 2 of all Panels, we compute the dependent variable of interest using all equity positions for the non-leveraged user sample. In Column 5 (6) of all Panels, we limit our sample to users who trade both non-leveraged and leveraged trades (or short trades). We compute the dependent variable as the difference between the two outcome variables for each user. Treated countries are defined in Appendix A. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Monthly Number of Assets Dependent Variable: Monthly Number of Assets Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Leveraged Trades Short Trades Trades Minus Leveraged Minus Short Trades (1) (2) (3) (4) (5) (6) Post×Treat 0.715∗∗∗ 0.469∗∗∗ −0.003 0.052 1.277∗∗∗ 0.859∗∗∗ (5.580) (3.307) (−0.067) (1.219) (6.221) (3.669) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 14,602 14,602 38,935 16,501 8,966 4,601 Observations 157,470 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.740 0.706 0.514 0.415 0.629 0.641 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 58,
    "page_range": "p.58",
    "total_pages": 68,
    "chunk_index": 93,
    "word_count": 369,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.58)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "0.859∗∗∗ (5.580) (3.307) (−0.067) (1.219) (6.221) (3.669) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 14,602 14,602 38,935 16,501 8,966 4,601 Observations 157,470 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.740 0.706 0.514 0.415 0.629 0.641 Electronic copy available at: https://ssrn.com/abstract=4226044 58 Panel B: Monthly Number of Industries Dependent Variable: Monthly Number of Industries Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Leveraged Trades Short Trades Trades Minus Leveraged Minus Short Trades (1) (2) (3) (4) (5) (6) Post×Treat 0.342∗∗∗ 0.213∗∗∗ 0.006 0.033 0.589∗∗∗ 0.379∗∗∗ (6.711) (4.110) (0.210) (1.167) (7.385) (3.599) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 14,602 14,602 38,935 16,501 8,966 4,601 Observations 157,470 157,470 422,102 167,987 95,217 48,517 Adjusted R2 0.748 0.707 0.533 0.417 0.645 0.646 Panel C: Monthly Average Pairwise Correlation Dependent Variable: Monthly Average Pairwise Correlation Non-Leveraged Non-Leveraged Non-Leveraged Non-Leveraged Sample, All Leveraged Trades Short Trades Trades Minus Leveraged Minus Short Trades (1) (2) (3) (4) (5) (6) Post×Treat −0.028∗∗ −0.011 0.003 0.013 −0.057∗∗∗ −0.064∗∗∗ (−2.661) (−1.130) (0.353) (1.173) (−3.417) (−3.599) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 13,209 13,557 37,852 16,004 8,255 4,334 Observations 93,046 107,017 181,021 49,644 55,175 27,253 Adjusted R2 0.554 0.502 0.361 0.247 0.300 0.253 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 59,
    "page_range": "p.59-60",
    "total_pages": 68,
    "chunk_index": 94,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.59-60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "−0.064∗∗∗ (−2.661) (−1.130) (0.353) (1.173) (−3.417) (−3.599) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 13,209 13,557 37,852 16,004 8,255 4,334 Observations 93,046 107,017 181,021 49,644 55,175 27,253 Adjusted R2 0.554 0.502 0.361 0.247 0.300 0.253 Electronic copy available at: https://ssrn.com/abstract=4226044 59 Table 6 Cross-Sectional Analysis of the Effect of Fee Removal on Portfolio Diversification This table examines the effects of fee removal on three measures of portfolio diversification, Monthly Number of Assets, Monthly Number of Indus- tries, and Monthly Average Pairwise Correlation, all for non-leveraged trades, for various cross-sectional cuts. The sample period spans from Octo- ber 9, 2018 to November 6, 2019. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. Panel A columns 1, 3, and 5 (columns 2, 4, and 6) report the results for users with above (below) the median average monthly number of trades pre-fee removal. Panels B, C, D, E and F present similar analyses based on factors such as trading experience, age, technological sophistica- tion, account size, and income, respectively. Treated countries are defined in Appendix A. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * de- note statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Cut on Median Trading Frequency Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation High Trading Low Trading High Trading Low Trading High Trading Low Trading Frequency Frequency Frequency Frequency Frequency Frequency (1) (2) (3) (4) (5) (6) Post×Treat 1.365∗∗∗ 0.183∗∗ 0.606∗∗∗ 0.111∗∗∗ −0.037∗∗ −0.014 (5.312) (2.928) (6.734) (3.408) (−2.768) (−1.313) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 6,808 7,794 6,808 7,794 6,627 6,582 Observations 70,702 86,768 70,702 86,768 49,540 43,506 Adjusted R2 0.717 0.737 0.712 0.744 0.425 0.566 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 106.018 144.397 10.443 p-value <0.001∗∗∗ <0.001∗∗∗ 0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 60,
    "page_range": "p.60",
    "total_pages": 68,
    "chunk_index": 95,
    "word_count": 359,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.60)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 6,808 7,794 6,808 7,794 6,627 6,582 Observations 70,702 86,768 70,702 86,768 49,540 43,506 Adjusted R2 0.717 0.737 0.712 0.744 0.425 0.566 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 106.018 144.397 10.443 p-value <0.001∗∗∗ <0.001∗∗∗ 0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044 60 Panel B: Cut on Median Trading Experience Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation Low Experience High Experience Low Experience High Experience Low Experience High Experience (1) (2) (3) (4) (5) (6) Post×Treat 0.854∗∗∗ 0.526∗∗ 0.440∗∗∗ 0.223∗∗∗ −0.057∗∗∗ 0.0001 (6.599) (2.751) (7.155) (3.464) (−3.761) (0.0006) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,225 7,377 7,225 7,377 6,618 6,591 Observations 75,799 81,671 75,799 81,529 43,416 49,630 Adjusted R2 0.630 0.765 0.660 0.781 0.523 0.580 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 9.743 31.942 61.636 p-value 0.002∗∗∗ <0.001∗∗∗ <0.001∗∗∗ Panel C: Cut on Median Age Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation Low Age High Age Low Age High Age Low Age High Age (1) (2) (3) (4) (5) (6) Post×Treat 0.705∗∗∗ 0.669∗∗∗ 0.326∗∗∗ 0.335∗∗∗ −0.036∗∗ −0.017 (4.522) (3.823) (5.150) (5.230) (−2.750) (−1.569) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,333 7,269 7,333 7,269 6,770 6,439 Observations 78,374 79,096 78,374 79,096 46,691 46,355 Adjusted R2 0.699 0.762 0.740 0.754 0.541 0.568 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 0.112 0.060 6.913 p-value 0.737 0.807 0.009∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 61,
    "page_range": "p.61",
    "total_pages": 68,
    "chunk_index": 96,
    "word_count": 265,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.61)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 7,333 7,269 7,333 7,269 6,770 6,439 Observations 78,374 79,096 78,374 79,096 46,691 46,355 Adjusted R2 0.699 0.762 0.740 0.754 0.541 0.568 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 0.112 0.060 6.913 p-value 0.737 0.807 0.009∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044 61 Panel D: Cut on Technological Sophistication Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation Low Tech High Tech Low Tech High Tech Low Tech High Tech Sophistication Sophistication Sophistication Sophistication Sophistication Sophistication (1) (2) (3) (4) (5) (6) Post×Treat 0.789∗∗∗ 0.631∗∗∗ 0.415∗∗∗ 0.262∗∗∗ −0.046∗∗∗ −0.010 (4.635) (3.925) (6.629) (4.134) (−3.397) (−0.929) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,484 7,118 7,484 7,118 6,790 6,419 Observations 79,778 77,692 79,778 77,692 46,053 46,993 Adjusted R2 0.746 0.732 0.736 0.760 0.535 0.574 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 2.306 16.268 24.776 p-value 0.129 <0.001∗∗∗ <0.001∗∗∗ Panel E: Cut on Median Account Size Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation High Account High Account High Account Low Account Size Low Account Size Low Account Size Size Size Size (1) (2) (3) (4) (5) (6) Post×Treat 0.491∗∗∗ 0.862∗∗∗ 0.307∗∗∗ 0.353∗∗∗ −0.050∗∗ −0.022∗ (4.777) (4.131) (5.246) (4.788) (−2.824) (−2.090) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 7,301 7,301 7,301 7,301 6,488 6,721 Observations 75,622 81,848 75,622 81,848 34,121 58,925 Adjusted R2 0.508 0.750 0.555 0.766 0.508 0.556 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 12.765 1.462 11.768 p-value <0.001∗∗∗ 0.227 0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 62,
    "page_range": "p.62",
    "total_pages": 68,
    "chunk_index": 97,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.62)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 7,301 7,301 7,301 7,301 6,488 6,721 Observations 75,622 81,848 75,622 81,848 34,121 58,925 Adjusted R2 0.508 0.750 0.555 0.766 0.508 0.556 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 12.765 1.462 11.768 p-value <0.001∗∗∗ 0.227 0.001∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044 62 Panel F: Cut on User Income Monthly Number of Assets Monthly Number of Industries Monthly Average Pairwise Correlation Below $50,000 Above $50,000 Below $50,000 Above $50,000 Below $50,000 Above $50,000 Income Income Income Income Income Income (1) (2) (3) (4) (5) (6) Post×Treat 0.798∗∗∗ 0.566∗∗ 0.387∗∗∗ 0.263∗∗∗ −0.035∗∗ −0.015 (5.640) (2.807) (6.418) (3.968) (−2.767) (−1.406) User FE Yes Yes Yes Yes Yes Yes Month FE Yes Yes Yes Yes Yes Yes Users 9,248 5,354 9,248 5,354 8,448 4,761 Observations 99,128 58,342 99,128 58,342 58,617 34,429 Adjusted R2 0.716 0.764 0.738 0.764 0.535 0.586 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 4.211 9.869 7.182 p-value 0.040∗∗ 0.002∗∗∗ 0.007∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 63,
    "page_range": "p.63-64",
    "total_pages": 68,
    "chunk_index": 98,
    "word_count": 166,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.63-64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "Yes Yes Yes Yes Yes Yes Users 9,248 5,354 9,248 5,354 8,448 4,761 Observations 99,128 58,342 99,128 58,342 58,617 34,429 Adjusted R2 0.716 0.764 0.738 0.764 0.535 0.586 Post×Treat(1) = Post×Treat(2) Post×Treat(3) = Post×Treat(4) Post×Treat(5) = Post×Treat(6) Chi-Squared 4.211 9.869 7.182 p-value 0.040∗∗ 0.002∗∗∗ 0.007∗∗∗ Electronic copy available at: https://ssrn.com/abstract=4226044 63 Table 7 Characteristics of New Users in the Pre- versus Post-Fee Removal This table compares the characteristics of users who joined eToro in the three months preceding and fol- lowing the fee removal event month in both non-treated and treated countries. In Panel A, the variable of interest is the average Monthly Number of Trades in months [+4, +6] following the fee removal event month. Panel B examines I(No Experience), an indicator equal to one if a user reports having no prior trading experience. Panel C analyzes Age. Panel D investigates I(Low Technological Sophistication), an indicator equal to one if a user reports a non-STEM or non-Finance related occupation. Panel E exam- ines the average Account Size in months [+4, +6] following the fee removal event month. Finally, Panel F analyzes (Income Below $50,000), an indicator equal to one for users reporting an annual income be- low $50,000. Treated countries are defined in Appendix A. All variables are defined in Appendix B. T- statistics for differences in means are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Monthly Number of Trades Months [+4, +6] Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 1.770 1,151 3.578 1.808∗∗∗ (2.940) Treated 1,263 2.686 3,438 3.813 1.127∗∗ −0.682 (2.555) (−0.916) Panel B: I(No Experience) Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 0.795 1,151 0.756 -0.040∗∗ (−2.165) Treated 1,263 0.792 3,438 0.822 0.030∗∗ 0.069∗∗∗ (2.320) (3.178) Panel C: Age Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 33.010 1,151 33.542 0.532 (1.380) Treated 1,263 35.625 3,438 34.401 −1.223∗∗∗ −1.755∗∗∗ (−3.443) (−3.144) Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 64,
    "page_range": "p.64",
    "total_pages": 68,
    "chunk_index": 99,
    "word_count": 373,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.64)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "0.030∗∗ 0.069∗∗∗ (2.320) (3.178) Panel C: Age Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 33.010 1,151 33.542 0.532 (1.380) Treated 1,263 35.625 3,438 34.401 −1.223∗∗∗ −1.755∗∗∗ (−3.443) (−3.144) Electronic copy available at: https://ssrn.com/abstract=4226044 64 Panel D: I(Low Technological Sophistication) Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 0.633 1,151 0.566 −0.067∗∗∗ (−9.074) Treated 1,263 0.651 3,438 0.630 −0.021 0.046∗ (−1.320) (1.744) Panel E: Account Size Months [+4, +6] Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 1,301.68 1,151 1,749.42 447.74∗∗ (2.224) Treated 1,263 1,906.58 3,438 1,475.56 −431.02∗∗ -878.76∗∗∗ (−2.389) (−3.079) Panel F: I(Income Below $50,000) Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 0.715 1,151 0.526 -0.189∗∗∗ (−9.074) Treated 1,263 0.778 3,438 0.696 −0.081∗∗∗ 0.108∗∗∗ (−5.503) (4.304) Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 65,
    "page_range": "p.65-66",
    "total_pages": 68,
    "chunk_index": 100,
    "word_count": 187,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.65-66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "(−2.389) (−3.079) Panel F: I(Income Below $50,000) Users Joining Months Users Joining Months [-3, -1] [+1, +3] N Mean N Mean Difference Diff-in-Diff (1) (2) (3) (4) (5) (6) Non-Treated 976 0.715 1,151 0.526 -0.189∗∗∗ (−9.074) Treated 1,263 0.778 3,438 0.696 −0.081∗∗∗ 0.108∗∗∗ (−5.503) (4.304) Electronic copy available at: https://ssrn.com/abstract=4226044 65 Table 8 Transaction-Based Calendar Time Returns This table presents daily abnormal returns for transaction-based calendar time portfolios, following the method established in Seasholes and Wu (2007). The portfolios are structured as long-short portfolios that are long in the treated users’ Buys − Sells portfolio and short in the control users’ Buys−Sells portfolio. Buy (Sell) portfolios are assembled for users in both treated and non-treated countries in aggregate by investing $1 in a stock for each purchase (sale) made by a user in that stock on a given date. This position is held for a 5-day (columns (1)-(3)), 25-day (columns (4)-(6)), or 50-day (columns (7)-(9)) period. Portfolio excess returns are regressed on the Fama-French five factor model, along with a momentum factor.Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. Treated countries are defined in Appendix A. All variables are defined in Appendix B. T-statistics are reported in parentheses. ***, **, and * denote statistical signifi- cance at the 1%, 5%, and 10% levels, respectively. 5 Day Holding Period 25 Day Holding Period 50 Day Holding Period Pre-Fee Post-Fee Full Pre-Fee Post-Fee Full Pre-Fee Post-Fee Full Removal Removal Sample Removal Removal Sample Removal Removal Sample (1) (2) (3) (4) (5) (6) (7) (8) (9) Alpha −0.005 0.006 −0.005 −0.005 −0.006 −0.005 −0.006 −0.005 −0.006 (−0.303) (0.324) (−0.280) (−0.442) (−0.589) (−0.444) (−0.600) (−0.545) (−0.617) Post×Alpha 0.011 −0.001 0.001 (0.444) (−0.096) (0.067) R −R 0.013 0.005 0.013 0.002 0.007 0.002 0.002 0.006 0.002 m f (0.738) (0.201) (0.682) (0.197) (0.491) (0.198) (0.196) (0.534) (0.202) Post×[R −R ] −0.008 0.004 0.004 m f (−0.271) (0.249) (0.270) SMB −0.015 −0.010 −0.015 −0.028 −0.024 −0.028 −0.027 −0.014 −0.027 (−0.417) (−0.205) (−0.385) (−1.263) (−0.941) (−1.269) (−1.325) (−0.612) (−1.361) Post×SMB 0.005 0.004 0.013 (0.083) (0.110) (0.429) HML 0.037 0.076 0.037 −0.003 0.049∗ −0.003 −0.003 0.048∗ −0.003 (0.926) (1.439) (0.855) (−0.124) (1.756) (−0.125) (−0.142) (1.920) (−0.146) Post×HML 0.039 0.052 0.051 (0.587) (1.391) (1.493) RMW −0.025 0.114∗ −0.025 −0.044 0.057 −0.044 −0.063∗∗ 0.061∗ −0.063∗∗ (−0.555) (1.658) (−0.513) (−1.567) (1.555) (−1.574) (−2.389) (1.898) (−2.453) Post×RMW 0.139∗ 0.101∗∗ 0.124∗∗∗ (1.720) (2.187) (2.959) CMA −0.053 −0.128 −0.053 0.011 0.028 0.011 0.030 0.028 0.030 (−0.816) (−1.538) (−0.754) (0.264) (0.635) (0.265) (0.783) (0.714) (0.804) Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 66,
    "page_range": "p.66",
    "total_pages": 68,
    "chunk_index": 101,
    "word_count": 429,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.66)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "RMW −0.025 0.114∗ −0.025 −0.044 0.057 −0.044 −0.063∗∗ 0.061∗ −0.063∗∗ (−0.555) (1.658) (−0.513) (−1.567) (1.555) (−1.574) (−2.389) (1.898) (−2.453) Post×RMW 0.139∗ 0.101∗∗ 0.124∗∗∗ (1.720) (2.187) (2.959) CMA −0.053 −0.128 −0.053 0.011 0.028 0.011 0.030 0.028 0.030 (−0.816) (−1.538) (−0.754) (0.264) (0.635) (0.265) (0.783) (0.714) (0.804) Electronic copy available at: https://ssrn.com/abstract=4226044 66 Post×CMA −0.075 0.017 −0.001 (−0.712) (0.289) (−0.027) MOM −0.056 0.028 −0.056 −0.051∗∗ 0.025 −0.051∗∗ −0.052∗∗∗ 0.023 −0.052∗∗∗ (−1.617) (0.725) (−1.493) (−2.401) (1.228) (−2.411) (−2.640) (1.262) (−2.710) Post×MOM 0.084 0.077∗∗ 0.076∗∗∗ (1.612) (2.580) (2.797) Observations 126 125 251 126 125 251 126 125 251 Adjusted R2 0.033 0.008 0.016 0.050 0.058 0.050 0.104 0.077 0.088 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 67,
    "page_range": "p.67-68",
    "total_pages": 68,
    "chunk_index": 102,
    "word_count": 110,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.67-68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "0.028 −0.056 −0.051∗∗ 0.025 −0.051∗∗ −0.052∗∗∗ 0.023 −0.052∗∗∗ (−1.617) (0.725) (−1.493) (−2.401) (1.228) (−2.411) (−2.640) (1.262) (−2.710) Post×MOM 0.084 0.077∗∗ 0.076∗∗∗ (1.612) (2.580) (2.797) Observations 126 125 251 126 125 251 126 125 251 Adjusted R2 0.033 0.008 0.016 0.050 0.058 0.050 0.104 0.077 0.088 Electronic copy available at: https://ssrn.com/abstract=4226044 67 Table 9 Portfolio Performance This table reports the regression results of the changes in investor portfolio performance pre- and post-fee removal event month based on whether the investor resides in a treated country or not. The sample pe- riod spans from October 9, 2018 to November 6, 2019. Panel A examines users’ portfolio Average Return and Average Alpha, before adjusting for fees. Conversely, Panel B examines users’ portfolio Average Fee- Adjusted Return and Average Fee-Adjusted Alpha. Post is an indicator variable equal to one for months after May 10, 2019 and zero for months prior to April 11, 2019. Treated countries are defined in Appendix A. All variables are defined in Appendix B. We also include user and month fixed effects. Standard errors are two-way clustered by user and month. T-statistics are reported in parentheses. ***, **, and * denote statistical significance at the 1%, 5%, and 10% levels, respectively. Panel A: Average Portfolio Return and Alpha Average Return Average Alpha (1) (2) Post×Treat −0.0001 −0.0002 (−0.567) (−1.489) User FE Yes Yes Month FE Yes Yes Users 14,118 14,118 Observations 104,494 104,400 Adjusted R2 0.348 0.345 Panel B: Average Fee-Adjusted Portfolio Return and Alpha Average Fee-Adjusted Return Average Fee-Adjusted Alpha (1) (2) Post×Treat 0.0004∗∗ 0.0003∗ (2.576) (1.848) User FE Yes Yes Month FE Yes Yes Users 14,118 14,118 Observations 104,494 104,400 Adjusted R2 0.348 0.346 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 68,
    "page_range": "p.68",
    "total_pages": 68,
    "chunk_index": 103,
    "word_count": 281,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.68)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  },
  {
    "text": "104,494 104,400 Adjusted R2 0.348 0.345 Panel B: Average Fee-Adjusted Portfolio Return and Alpha Average Fee-Adjusted Return Average Fee-Adjusted Alpha (1) (2) Post×Treat 0.0004∗∗ 0.0003∗ (2.576) (1.848) User FE Yes Yes Month FE Yes Yes Users 14,118 14,118 Observations 104,494 104,400 Adjusted R2 0.348 0.346 Electronic copy available at: https://ssrn.com/abstract=4226044",
    "title": "Fee the People Retail Investor Behavior and Trading Commission Fees",
    "source_type": "pdf",
    "document_id": "5ff4a48cd5bb",
    "source_file": "Fee the People Retail Investor Behavior and Trading Commission Fees.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 68,
    "chunk_index": 104,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230604142657Z",
    "duration": null
  }
]