[
  {
    "text": "set containing the disaggregated wealth of all households in Sweden. Between 1999and2002,weobservelittleaggregaterebalancinginthefinancialportfolio ofparticipants.Thesepatternsconcealstronghousehold-levelevidenceofactive rebalancing,whichonaverageoffsetsaboutone-halfofidiosyncraticpassivevari- ationsintheriskyassetshare.Wealthy,educatedinvestorswithbetterdiversified portfoliostendtorebalancemoreactively.Wefindsomeevidencethathouseholds rebalancetowardagreaterriskyshareastheybecomericher.Wealsostudythe decisions to trade individual assets. Households are more likely to fully sell di- rectly held stocks if those stocks have performed well, and more likely to exit directstockholdingiftheirstockportfolioshaveperformedwell;buttheserela- tionships are much weaker for mutual funds, a pattern that is consistent with previousresearchonthedispositioneffectamongdirectstockholdersandperfor- mance sensitivity among mutual fund investors. When households continue to holdindividualassets,however,theyrebalancebothstocksandmutualfundsto offsetaboutone-sixthofthepassivevariationsinindividualassetshares.House- holds rebalance primarily by adjusting purchases of risky assets if their risky portfolioshaveperformedpoorly,andbyadjustingbothfundpurchasesandfull salesofstocksiftheirriskyportfolioshaveperformedwell.Finally,thetendency forhouseholdstofullysellwinningstocksisweakerforwealthyinvestorswith diversifiedportfoliosofindividualstocks. I. INTRODUCTION What drives time series variations in the asset allocation of individual investors? How do households adjust their risk ∗WethankStatisticsSwedenforprovidingthedata.Wereceivedhelpfulcom- mentsfromMarkusBrunnermeier,Rene´ Garcia,DavidMcCarthy,StefanNagel, PaoloZaffaroni,threeanonymousreferees,andseminarparticipantsatBergen, BostonUniversity,theFederalReserveBankofMinneapolis,theFinancialSer- vices Authority of the UK, Harvard University, Imperial College, MIT, Oxford University,PompeuFabra,SIFR,theStockholmSchoolofEconomics,theSwedish FinancialSupervisoryAuthority,Universite´LibredeBruxelles,theUniversityof Helsinki,theUniversityofVenice,theWhartonSchool,the2007BrazilianFinance SocietymeetinginSaoPaulo,the2007SummerFinanceConferenceinGerzensee, theFall2007NBERAssetPricingMeeting,andthe2008AFAmeetingsinNew Orleans.TheprojectbenefitedfromexcellentresearchassistancebyDanielSunes- son.ThismaterialisbaseduponworksupportedbytheAgenceNationaledela Recherche under a Chaire d’Excellence to Calvet, BFI under a Research Grant to Sodini, the HEC Foundation, the National Science Foundation under Grant 0214061toCampbell,theRiksbank,andtheWallanderandHedeliusFoundation. calvet@hec.fr,johncampbell@harvard.edu,Paolo.Sodini@hhs.se. (cid:2)C 2009bythePresidentandFellowsofHarvardCollegeandtheMassachusettsInstituteof Technology. TheQuarterlyJournalofEconomics,February2009 301",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "Thispaperinvestigatesthedynamicsofindividualportfoliosinauniquedata",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 0,
    "word_count": 160,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Thispaperinvestigatesthedynamicsofindividualportfoliosinauniquedata (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "PaoloZaffaroni,threeanonymousreferees,andseminarparticipantsatBergen, BostonUniversity,theFederalReserveBankofMinneapolis,theFinancialSer- vices Authority of the UK, Harvard University, Imperial College, MIT, Oxford University,PompeuFabra,SIFR,theStockholmSchoolofEconomics,theSwedish FinancialSupervisoryAuthority,Universite´LibredeBruxelles,theUniversityof Helsinki,theUniversityofVenice,theWhartonSchool,the2007BrazilianFinance SocietymeetinginSaoPaulo,the2007SummerFinanceConferenceinGerzensee, theFall2007NBERAssetPricingMeeting,andthe2008AFAmeetingsinNew Orleans.TheprojectbenefitedfromexcellentresearchassistancebyDanielSunes- son.ThismaterialisbaseduponworksupportedbytheAgenceNationaledela Recherche under a Chaire d’Excellence to Calvet, BFI under a Research Grant to Sodini, the HEC Foundation, the National Science Foundation under Grant 0214061toCampbell,theRiksbank,andtheWallanderandHedeliusFoundation. calvet@hec.fr,johncampbell@harvard.edu,Paolo.Sodini@hhs.se. (cid:2)C 2009bythePresidentandFellowsofHarvardCollegeandtheMassachusettsInstituteof Technology. TheQuarterlyJournalofEconomics,February2009 301 exposure in response to the portfolio returns that they experi- ence? Are household portfolios characterized by inertia or high turnover? Financial theory suggests a wide range of motives for activetradingandrebalancingatthehouseholdlevel.Realizedre- turnsonfinancialassetsinducemechanicalvariationsinportfolio allocation,towhichaninvestorispassivelyexposed.Aninvestor might fight passive changes by actively rebalancing her portfolio when asset returns are expected to be time-invariant. Changes in perceived investment opportunities, on the other hand, might leadtheinvestortoadoptaflightstrategythatwouldamplifythe declineintheshareoftheworst-performingassets.Furthermore, trading decisions may reflect not only asset allocation objectives, but also a disposition to hold losing and sell winning securities (ShefrinandStatman1985;Odean1998). Equilibriumconsiderationssuggestthataggregateflowsfrom the household sector provide limited and potentially misleading information onindividual rebalancing. Consider, for instance,an economyinwhichhouseholdsownallfinancialassets.Iftheaggre- gate value of risky securities falls, the average share of risky as- setsinhouseholdportfoliosmustnecessarilyfallaswell.Thus,the average individual investor cannot fight aggregate variations in equity returns. When households have heterogeneous portfolios, however,therecanstillbesubstantialrebalancingattheindivid- uallevel.Forinstance,itisanopenquestionwhetherhouseholds withhigherpassivelossestendtobuyorsellriskyassets. The empirical investigation of household rebalancing there- fore requires high-quality and comprehensive micro data. Traditional data sets do not meet these requirements and have unsurprisingly led to conflicting answers on household behavior. Surveys, which have been widely used in the household finance literature,onlyreporttheallocationofhouseholdfinancialwealth into broad asset classes (e.g., Bilias, Georgarakos, and Haliassos [2008]).Theypermittheanalysisofchangesintheshareofrisky assetsinthefinancialportfolio,butnotthecomputationofactive andpassivechanges.Thus,surveyscannottelluswhetherhouse- holdsattempttooffsetpassivevariationsintheirriskyshare. Account data sets, such as 401k and brokerage accounts, present a partial view of financial wealth and do not permit the computation of the risky share. Research based on discount bro- kerage accounts finds evidence of intense trading activity (e.g., Odean[1999];BarberandOdean[2000]),whereassubstantialin- ertiaisobservedin401kaccounts(e.g.,MadrianandShea[2001];",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "302 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 2,
    "page_range": "p.2",
    "total_pages": 48,
    "chunk_index": 1,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "302 QUARTERLYJOURNALOFECONOMICS (p.2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Bilias, Georgarakos, and Haliassos [2008]).Theypermittheanalysisofchangesintheshareofrisky assetsinthefinancialportfolio,butnotthecomputationofactive andpassivechanges.Thus,surveyscannottelluswhetherhouse- holdsattempttooffsetpassivevariationsintheirriskyshare. Account data sets, such as 401k and brokerage accounts, present a partial view of financial wealth and do not permit the computation of the risky share. Research based on discount bro- kerage accounts finds evidence of intense trading activity (e.g., Odean[1999];BarberandOdean[2000]),whereassubstantialin- ertiaisobservedin401kaccounts(e.g.,MadrianandShea[2001];",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "302 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 2,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "302 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Choi et al. [2002, 2004]; Agnew, Balduzzi, and Sunden [2003]; Ameriks and Zeldes [2004]). These seemingly contradictory re- sults may result from selection bias in account data sets. For ex- ample,householdsmaychooseadiscountbrokerpreciselybecause theyare(over)confidentintheirabilitytoprocessinformationand intendtoengageinhigh-frequencytrading.Andhouseholdsmay trade less actively in retirement accounts than in other accounts thattheycontrol. The Swedish data set used in Calvet, Campbell, and Sodini (2007,henceforth“CCS2007”)allowsustoovercometheseissues. We assembled data supplied by Statistics Sweden into a panel coveringfouryears(1999–2002)andtheentirecountry(about4.8 million households). The information available on each resident is systematically compiled by financial institutions and corpora- tions and includes demographic characteristics, wealth portfolio, and income. Our administrative data set is therefore more re- liable than self-reported data sets, such as surveys. The wealth information is highly disaggregated and provides the worldwide assetsownedbytheresidentattheendofataxyear.Allfinancial assets held outside retirement accounts are reported, including bank accounts, mutual funds, and stocks. However, the database reports neither the exact date of a sale nor information on asset purchases. InCCS2007, wefound thathousehold portfoliosofriskyas- sets have important idiosyncratic exposure, accounting for just over half the variance of return for the median household. Un- derdiversification causes only modest welfare losses for most of the population ex ante; however, the realized returns on house- holdportfoliosareheterogeneousexpost.Inthispaperweexploit thiscross-sectionalvariationtoanalyzethedeterminantsofport- folio rebalancing. The Swedish data set is well suited for such an investigation because we can compute the risky share of ev- eryhouseholdanddecomposeitschangesintopassiveandactive components. Our main results are the following. First, we study the dy- namics of the risky asset share among participating households. Theequal-weightedshareofhouseholdfinancialwealthinvested in risky assets fell from 57% in 1999 to 45% in 2002, a decline thatimpliesveryweakactiverebalancingbytheSwedishhouse- hold sector as a whole in response to the equity bear market of theearly2000s.Instrikingcontrasttothisaggregateresult,indi- vidualhouseholdsactivelyrebalancedtheirportfoliosinresponse",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 303",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 48,
    "chunk_index": 3,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 303 (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "main results are the following. First, we study the dy- namics of the risky asset share among participating households. Theequal-weightedshareofhouseholdfinancialwealthinvested in risky assets fell from 57% in 1999 to 45% in 2002, a decline thatimpliesveryweakactiverebalancingbytheSwedishhouse- hold sector as a whole in response to the equity bear market of theearly2000s.Instrikingcontrasttothisaggregateresult,indi- vidualhouseholdsactivelyrebalancedtheirportfoliosinresponse",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 303",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 303 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "to their own returns. Household-level regressions show that on average,activerebalancingcompensatesforaboutone-halfofid- iosyncraticpassivevariationsintheriskyshare. We estimate a partial adjustment model for the risky share, with heterogeneous adjustment speeds, and find that financially sophisticatedhouseholdsholdingwell-diversifiedportfoliosadjust more rapidly toward their target risky share. We also find some evidence that the target risky share increases when households become richer, consistent with theories of declining relative risk aversion, portfolio insurance, or habit formation (Brennan and Schwartz1988;Constantinides1990;Dybvig1995;Campbelland Cochrane1999;Carroll2000,2002). Second, we study patterns of entry to and exit from risky financialmarkets.Theoverallstockmarketparticipationratein- creased slightly between 1999 and 2002. At the microeconomic level, household demographics influence entry and exit as one would expect: financially sophisticated households, with greater income, wealth, and education, are more likely to enter and less likely to exit. We are able to go beyond this familiar result to see how portfolio characteristics influence exit decisions. Wefind thathouseholdswithinitiallymoreaggressiveinvestmentstrate- gies are generally less likely to exit, although poorly diversified households and those with extremely high initial risky shares are slightly more likely to exit. If we consider mutual funds and directlyheldstocksasseparateassetclasses,wefindthathouse- holds are slightly more likely to exit mutual fund holding when their mutual funds have performed badly, but much more likely toexitdirectstockholdingwhentheirstockshaveperformedwell. Third, we explore decisions to adjust positions in individual stocks and mutual funds. We begin by examining decisions to fully sell positions. We find that the absolute value of the return on a stock or fund has a positive effect on the probability that a household will sell it. This effect is much stronger for stocks with positive returns (winners) than for stocks with negative re- turns (losers), but the asymmetry is much weaker for mutual funds. We allow portfolio and household characteristics to influ- ence the strength of these return effects, and find that wealthy investors with diversified portfolios of individual stocks have a weaker propensity to dispose of winning stocks and a stronger propensitytodisposeoflosers. We also estimate a rebalancing model for positions that are not fully sold. We find that the passive change in the share of a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "304 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 48,
    "chunk_index": 5,
    "word_count": 333,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "304 QUARTERLYJOURNALOFECONOMICS (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "return effects, and find that wealthy investors with diversified portfolios of individual stocks have a weaker propensity to dispose of winning stocks and a stronger propensitytodisposeoflosers. We also estimate a rebalancing model for positions that are not fully sold. We find that the passive change in the share of a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "304 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "304 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "stockormutualfundintheriskyportfoliodoesexplaintheactive change,buttheeffectisweakerthanwefoundwhenwetreatedall riskyassetsasahomogeneousassetclass.Insteadofarebalancing coefficient of one-half, we obtain coefficients of about one-sixth, which are only slightly greater for stocks than for mutual funds. Thusthedifferenceinhouseholddecisionmakingwithrespectto stocks and mutual funds shows up primarily in full sales rather thaninpartialrebalancingdecisions. Finally,weinvestigatetherelationbetweenasset-leveltrad- ingdecisionsandportfoliorebalancing.Householdsprimarilyre- balance by using a small number of trading strategies. When a householdisunlucky,inthesensethatitsriskyportfolioperforms worsethanaverage,rebalancingismostlydrivenbyadjustments in purchases of risky assets. Conversely, when the household is lucky,inthesensethatitsriskyportfolioperformsbetterthanav- erage,thehouseholdrebalancesprimarilybyadjustingfullsales ofstocksandpurchasesofmutualfunds. Bothourentryandexitresultsandourresultsonasset-level trading decisions are consistent with two branches of the litera- ture. The disposition effect, that investors hold losing stocks and sell winning stocks, has been documented using account data on directstockholdingsbyOdean(1998)andmanyothers;Grinblatt and Han (2005), Frazzini (2006), and Goetzmann and Massa (2008)presentevidencethatthisbehaviormaycontributetomo- mentuminstockreturns.Theliteratureonmutualfundflows,on theotherhand,findsevidenceofperformancechasingbyindivid- ual investors (Ippolito 1992; Gruber 1996; Chevalier and Ellison 1997; Sirri and Tufano 1998; Frazzini and Lamont 2008; Ivkovic and Weisbenner 2007). We find similar patterns using different data and a different approach for classifying stocks and funds as losers or winners. Dhar and Zhu (2006) have recently found that households with higher self-reported income are less prone to the disposition effect in stock trading; our results are broadly consistent with this, although we find that wealth and portfolio diversification are more relevant than income in predicting the strengthofthedispositioneffect. The organization of the paper is as follows. In Section II we present some basic facts about the evolution of risk taking among Swedish households in the period 1999–2002. In Section III, we assess the magnitude of active rebalancing by decompos- inghousehold-levelportfoliovariationsintotheirpassiveandac- tivecomponents.InSectionIV,weestimateapartialadjustment",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 305",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 48,
    "chunk_index": 7,
    "word_count": 240,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 305 (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "relevant than income in predicting the strengthofthedispositioneffect. The organization of the paper is as follows. In Section II we present some basic facts about the evolution of risk taking among Swedish households in the period 1999–2002. In Section III, we assess the magnitude of active rebalancing by decompos- inghousehold-levelportfoliovariationsintotheirpassiveandac- tivecomponents.InSectionIV,weestimateapartialadjustment modelofportfolioriskanduseittoaskwhichtypesofhouseholds adjusttheirportfoliosmorerapidly.Thissectionalsoaskswhether increasesinfinancialwealthincreasehouseholds’desiredriskex- posure.SectionVexploresentryandexitdecisionsandasset-level rebalancinginrelationtothedispositioneffect.InSectionVI,we linkhouseholds’asset-leveldecisionstotheirrebalancing strate- gies.SectionVIIconcludes.AnAppendixavailableonlinepresents detailsofdataconstructionandestimationmethodology. II. HOWHASRISKTAKINGCHANGEDOVERTIME? II.A. DataDescriptionandDefinitions Swedish households pay taxes on both income and wealth. For this reason, the national Statistics Central Bureau (SCB), alsoknownasStatisticsSweden,hasaparliamentarymandateto collecthighlydetailedinformationonthefinancesofeveryhouse- hold in the country. We compiled the data supplied by SCB into a panel covering four years (1999–2002) and the entire popula- tion of Sweden (about 4.8 million households). The information available on each resident can be grouped into three main cat- egories: demographic characteristics, income, and disaggregated wealth. Demographic information includes age, gender, marital sta- tus,nationality,birthplace,education,andplaceofresidence.The household head is defined as the individual with the highest in- come.Theeducationvariableincludeshigh-schoolandpost-high- schooldummiesforthehouseholdhead. Income is reported by individual source. For capital income, the database reports the income (interest, dividends) that has been earned on each bank account or each security. For labor income, the database reports gross labor income and business sector. The panel’s distinguishing feature is that it contains highly disaggregatedwealthinformation.Weobservetheworldwideas- setsownedbyeachresidentonDecember31ofeachyear,includ- ing bank accounts, mutual funds, and stocks. The information is provided for each individual account or each security referenced by its International Security Identification Number (ISIN). The database also records contributions made during the year to pri- vatepensionsavings,aswellasdebtoutstandingatyearendand interestpaidduringtheyear.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "306 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 48,
    "chunk_index": 8,
    "word_count": 242,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "306 QUARTERLYJOURNALOFECONOMICS (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "The panel’s distinguishing feature is that it contains highly disaggregatedwealthinformation.Weobservetheworldwideas- setsownedbyeachresidentonDecember31ofeachyear,includ- ing bank accounts, mutual funds, and stocks. The information is provided for each individual account or each security referenced by its International Security Identification Number (ISIN). The database also records contributions made during the year to pri- vatepensionsavings,aswellasdebtoutstandingatyearendand interestpaidduringtheyear. We will refer to the following asset classes throughout the paper.Cashconsistsofbankaccountbalancesandmoneymarket funds.Stocksrefertodirectholdingsonly.Riskymutualfundsare classifiedaseitherbondfundsorequityfunds.Thelattercategory is broadly defined to include any fund that invests a fraction of itsassetsinstocks;thatis,balancedfundsarecountedasequity funds.1 Riskyassetsincludestocksandriskymutualfunds. FollowingCCS2007,wemeasureahousehold’stotalfinancial wealthasthesumofitsholdingsintheseassetclasses,excluding fromconsiderationilliquidassetssuchasrealestateorconsumer durables,definedcontributionretirementaccounts,capitalinsur- ance products that combine return guarantees with risky asset holdings, and directly held bonds. Also, our measure of wealth is gross wealth and does not subtract mortgage or other household debt. CCS 2007 summarizes the relative magnitudes of all these componentsofSwedishhouseholdbalancesheets. Aparticipantisahouseholdwhosefinancialwealthincludes riskyassets.InTableI,PanelA,wereportsummarystatisticson theassetsheldbyparticipatinghouseholds.Tofacilitateinterna- tional comparisons, we convert all financial quantities into U.S. dollars. Specifically, the Swedish krona traded at $0.1127 at the end of 2002, and this fixed conversion factor is used throughout thepaper.Theaggregatevalueofriskyholdingsdeclinedbyabout one-halfduringthebearmarket.Between1999and2002,house- holdstockholdingsfellfrom$62to$30billion,andfundholdings from $53 to $29 billion. Cash, on the other hand, increased from $49to$57billionoverthesameperiod. Inthesamepanelwealsoreportaggregatestatisticsonstock and fund holdings compiled by the SCB and by the Swedish mu- tual fund association, Fondbolagens Fo¨rening (FF).2 The official statistics are incomplete because the SCB does not specifically reporttheaggregatecashholdingsofparticipantsandtheFFse- ries only start in 2000. The aggregate estimates obtained with our data set closely match available official statistics. In the Ap- pendix, we also match official aggregate statistics on flows into stocks and mutual funds quite closely. The aggregate flow into an asset class is generally quite modest and never exceeds a few 1. The managers of balanced funds periodically rebalance their holdings of cashandriskyassetstomaintainastableriskyshare.Wedonottrytomeasure thisformofrebalancing,buttreatbalancedfundslikeanyothermutualfunds, assumingthattheyhavestableriskcharacteristics. 2. Thesestatisticscanbedownloadedatwww.scb.seandwww.fondbolagen.se.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 307",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 48,
    "chunk_index": 9,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 307 (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "the Ap- pendix, we also match official aggregate statistics on flows into stocks and mutual funds quite closely. The aggregate flow into an asset class is generally quite modest and never exceeds a few 1. The managers of balanced funds periodically rebalance their holdings of cashandriskyassetstomaintainastableriskyshare.Wedonottrytomeasure thisformofrebalancing,buttreatbalancedfundslikeanyothermutualfunds, assumingthattheyhavestableriskcharacteristics. 2. Thesestatisticscanbedownloadedatwww.scb.seandwww.fondbolagen.se.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 307",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 307 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "2002 1002 0002 9991 laicfifO orciM laicfifO orciM laicfifO orciM laicfifO orciM scitsitats atad scitsitats atad scitsitats atad scitsitats atad )srallodnoillib(stnapicitrapfosgnidlohetagerggA.A 2.23 8.92 1.74 3.54 6.45 6.45 3.46 7.16 skcotS 5.92 4.92 4.54 0.44 7.25 4.05 4.35 sdnuflautumyksiR 2.52 8.42 9.04 7.93 8.84 6.64 5.94 sdnufytiuqE 3.4 5.4 5.4 3.4 9.3 8.3 9.3 sdnufdnoB 7.65 3.45 5.74 7.84 hsaC 9.511 7.341 5.251 9.361 htlaewlaicnanfilatoT erahsyksiregarevadnanoitapicitraP.B :gnidlohsdlohesuohfonoitcarF %9.46 %0.66 %4.66 %6.16 stessayksiR %5.83 %3.73 %2.73 %0.03 skcotslaudividnI %4.65 %2.85 %7.85 %6.45 sdnuflautumyksiR %9.92 %5.92 %5.92 %0.32 sdnufyksirdnaskcotslaudividnihtoB %2.54 %3.25 %6.65 %5.65 )dethgiew-lauqe(erahsyksiregarevA %7.45 %1.66 %7.37 %9.47 )dethgiew-htlaew(erahsyksiregarevA snrutertessA.C %1.4 %1.4 %9.3 %1.3 etartseretnI %6.84− %8.62− %0.81− %2.97 xedninedewSICSM %1.23− %1.11− %3.4− AN )dethgiew-lauqe(xednidelooP %2.23− %6.11− %1.6− AN )dethgiew-eulav(xednidelooP %9.73− %3.11− %1.7− %2.72 )ronorkhsidewSni(xednidlrowICSM %4.22− %7.02− %5.81− %0.91 )srallod.S.Uni(xednidlroWICSM AlenaP.)ClenaP(snrutertessadna,)BlenaP(erahsyksirehtdnasetarnoitapicitrap,)AlenaP(stnapicitrapfosgnidlohetagerggafoscitsitatsyrammusstroperelbatehT.setoN detupmoceraBlenaPnisetarnoitapicitrapehT.elbaliavaerayehtnehw)sdnuf(gninero¨FsnegalobdnoFdna)skcots(nedewSscitsitatSybdetroperscitsitatslaicfifoehtsedulcniosla fotesbusehtnodesabera)ClenaP(xednideloopdna)BlenaP(erahsyksiregarevaehtsaerehw,txetehttuohguorhtderedisnocsdlohesuoh000,001foelpmasbusmodnarehtno .elpmasbusmodnarehtniraeyhcaefodneehttastnapicitrap",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "SCITSITATSYRAMMUS",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 48,
    "chunk_index": 11,
    "word_count": 131,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SCITSITATSYRAMMUS (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "%9.92 %5.92 %5.92 %0.32 sdnufyksirdnaskcotslaudividnihtoB %2.54 %3.25 %6.65 %5.65 )dethgiew-lauqe(erahsyksiregarevA %7.45 %1.66 %7.37 %9.47 )dethgiew-htlaew(erahsyksiregarevA snrutertessA.C %1.4 %1.4 %9.3 %1.3 etartseretnI %6.84− %8.62− %0.81− %2.97 xedninedewSICSM %1.23− %1.11− %3.4− AN )dethgiew-lauqe(xednidelooP %2.23− %6.11− %1.6− AN )dethgiew-eulav(xednidelooP %9.73− %3.11− %1.7− %2.72 )ronorkhsidewSni(xednidlrowICSM %4.22− %7.02− %5.81− %0.91 )srallod.S.Uni(xednidlroWICSM AlenaP.)ClenaP(snrutertessadna,)BlenaP(erahsyksirehtdnasetarnoitapicitrap,)AlenaP(stnapicitrapfosgnidlohetagerggafoscitsitatsyrammusstroperelbatehT.setoN detupmoceraBlenaPnisetarnoitapicitrapehT.elbaliavaerayehtnehw)sdnuf(gninero¨FsnegalobdnoFdna)skcots(nedewSscitsitatSybdetroperscitsitatslaicfifoehtsedulcniosla fotesbusehtnodesabera)ClenaP(xednideloopdna)BlenaP(erahsyksiregarevaehtsaerehw,txetehttuohguorhtderedisnocsdlohesuoh000,001foelpmasbusmodnarehtno .elpmasbusmodnarehtniraeyhcaefodneehttastnapicitrap",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "percentage points of the total household wealth invested in the class. Thus, the strong reduction in aggregate risky holdings re- portedinTableI,PanelA,primarilyresultsfrompricemovements andnotfromlargeoutflowsfromthehouseholdsector. Following CCS 2007, we define the following variables for each household h. The complete portfolio contains all the stocks, mutual funds, and cash owned by the household. The risky port- folio contains stocks and mutual funds but excludes cash. The risky share w h,t at date t is the weight of the risky portfolio in the complete portfolio. Because the risky share is model-free, we use it extensively throughout the paper. The household’s risky portfolio is also characterized by its standard deviation σ h,t and by its systematicexposure β h,t and Sharpe ratio S h,t relative to a global equity benchmark, the MSCI World Index. The definition andestimationofthesequantitiesarediscussedintheAppendix. The results presented in this paper are based on households that exist throughout the 1999–2002 period. We impose no con- straintontheparticipationstatusofthesehouseholds,butrequire that they satisfy the following financial requirements at the end ofeachyear.First,disposableincomemustbestrictlypositiveand thethree-yearrollingaveragemustbeatleast1,000Swedishkro- nor($113).Second,financialwealthmustbenosmallerthan3,000 kronor($339).Forcomputationalconvenience,wehaveselecteda randompanelof100,000householdsfromthefilteredpopulation. Unlessstatedotherwise,alltheresultsinthepaperarebasedon this fixed subsample, and unreported work confirms the strong robustness of the reported estimates to the choice of alternative subsamples. II.B. Cross-SectionalDynamicsofParticipationandRiskTaking Household participation in risky asset markets increased from62%to65%between1999and2002,asisreportedinTableI, Panel B. The inflow is equal to 20% of nonparticipating house- holds, or about 8% of the entire population. The outflow is 7% of participants, or about 4% of the entire household population. These patterns are consistent with the “participation turnover” documented for U.S. data (Hurst, Luoh, and Stafford 1998; Vissing-Jorgensen2002).InSectionV,wewillfurtherinvestigate themicroeconomicandportfoliodeterminantsofentryandexit. Instudyingrebalancinginthenexttwosections,wefocusin each year on the large group of households that maintain par- ticipation in risky asset markets throughout the year. Between",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 48,
    "chunk_index": 13,
    "word_count": 270,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309 (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "of participants, or about 4% of the entire household population. These patterns are consistent with the “participation turnover” documented for U.S. data (Hurst, Luoh, and Stafford 1998; Vissing-Jorgensen2002).InSectionV,wewillfurtherinvestigate themicroeconomicandportfoliodeterminantsofentryandexit. Instudyingrebalancinginthenexttwosections,wefocusin each year on the large group of households that maintain par- ticipation in risky asset markets throughout the year. Between",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 309 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "1999 and 2002, the equal-weighted average risky share w h,t of thesehouseholdsfellfrom57%to45%(TableI,PanelB).Asillus- tratedinFigureIA,thislowermeanreflectsadownwardshiftin thecross-sectionaldistributionofw h,t ,whichismostpronounced inthetails. Thedownwardshiftintheriskysharetranslatesintoadown- ward shift in complete portfolio risk. We illustrate in Figure IB how the standard deviation of the complete portfolio, w h,t σ h,t , varies with the risky share, w h,t . The relation is almost linear and has similar slopes in all years. Consistent with this finding, weverifyintheAppendixthatthestandarddeviationoftherisky portfolio, σ h,t , has a stable cross-sectional distribution over time andisalmostaflatfunctionoftheriskyshare.3 These results imply that Swedish households adjust their overallriskexposureprimarilybyscalingupordowntheirrisky portfolios, passively or actively, rather by altering their composi- tion.Thisjustifiesouremphasisonmodelingw h,t inthenexttwo sections. III. PASSIVEANDACTIVEREBALANCINGOFTHERISKYSHARE III.A. DecompositionoftheRiskyShare Thechangeinahousehold’sriskyshareispartlydetermined by the household’s active trades and partly by the returns on its risky securities. For instance, the risky share tends to fall me- chanically in a severe bear market. For this reason, we now de- compose the change in the risky share between year t and year t+1, w h,t+1 −w h,t , into a passive change driven by the returns on risky assets and an active change resulting from household rebalancing decisions. This decomposition is empirically mean- ingfulbecauseofthecomprehensiveindividualassetinformation availableinourdataset. The passive risky return 1+r h,t+1 is the proportional change invalueofahousehold’sriskyportfolioifthehouseholddoesnot trade risky assets during the year. It is easily computed from the initial risky portfolio and asset returns. Let w∗ denote h,j,t the share of asset j (1≤ j ≤ J) in the risky portfolio. If the in- vestor does not trade between date t and date t+1, the risky 3. Ofcourse,thestabilityofaverageσ h,tacrossriskysharebinsdoesnotimply thatallhouseholdsownthesameriskyportfolio.WewillindeedshowinSection IIIthatthereissubstantialheterogeneityinindividualportfolioreturns.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "310 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 48,
    "chunk_index": 15,
    "word_count": 252,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "310 QUARTERLYJOURNALOFECONOMICS (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "year. It is easily computed from the initial risky portfolio and asset returns. Let w∗ denote h,j,t the share of asset j (1≤ j ≤ J) in the risky portfolio. If the in- vestor does not trade between date t and date t+1, the risky 3. Ofcourse,thestabilityofaverageσ h,tacrossriskysharebinsdoesnotimply thatallhouseholdsownthesameriskyportfolio.WewillindeedshowinSection IIIthatthereissubstantialheterogeneityinindividualportfolioreturns.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "310 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "310 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "311 A.Cross-Sectional DistributionofRisky Share B.StandardDeviationof Complete Portfolio 8-i 30 1999 7- 2000 2001 25- 2002 P o 6 cn o P C c 20- C CD L 5 O O CD t 4 > 15- C CD L ~o CD O 3- \"O c CD 10- O O 2- \"D C CD CD <0 5- ^ 1 Hi 0 0 5 15 25 35 45 55 65 75 85 95 5 15 25 35 45 55 65 75 85 95 Risky share(%) Risky share(%) FIGUREI PortfolioCharacteristicsofParticipants Notes.PanelAillustratesthecross-sectionaldistributionoftheriskysharew h,tattheendofyears1999to2002.PanelBreportsthe relationbetweenthestandarddeviationofthecompleteportfoliow h,t σ h,tandtheriskysharew h,t.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 48,
    "chunk_index": 17,
    "word_count": 93,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "c CD 10- O O 2- \"D C CD CD <0 5- ^ 1 Hi 0 0 5 15 25 35 45 55 65 75 85 95 5 15 25 35 45 55 65 75 85 95 Risky share(%) Risky share(%) FIGUREI PortfolioCharacteristicsofParticipants Notes.PanelAillustratesthecross-sectionaldistributionoftheriskysharew h,tattheendofyears1999to2002.PanelBreportsthe relationbetweenthestandarddeviationofthecompleteportfoliow h,t σ h,tandtheriskysharew h,t. portfolio va(cid:1)lue at t+1 is its value at t times its gross return 1+r h,t+1 = J j=1 w h ∗ ,j,t (1+r j,t+1 ). We compute returns r j,t+1 ex- cluding dividends, as is appropriate if households consume divi- dendsratherthanreinvestingthem,butweverifyintheAppendix that our empirical results are essentially unchanged when divi- dendsareincludedinreturns. The passive risky share is the risky share at the end of the yearifthehouseholddoesnottraderiskyassetsduringtheyear. It is a function of the initial risky share and the passive risky return, w h p ,t+1 =ωp(w h,t ;r h,t+1 ), where w(1+r) ωp(w;r)≡ . w(1+r)+(1−w)(1+r ) f The passive change is the change in the risky share during theyearifthehouseholdtradesnoriskyassetsduringtheyear: P h,t+1 =w h p ,t+1 −w h,t . Itisequaltozeroiftheinvestorisinitiallyinvestedexclusivelyin cash(w h,t =0)orexclusivelyinriskyassets(w h,t =1).Thepassive changeisahump-shapedfunctionoftheinitialshareifr >r ,as f investorspresumablyexpect,butaU-shapedfunctionoftheinitial shareifr <r ,asinourdatafromthebearmarketof2000–2002. f The active change in the risky share, A h,t+1 =w h,t+1 −w h p ,t+1 , isthemovementintheriskysharethatdoesnotresultmechani- callyfromrealizedreturnsandthusreflectsportfoliorebalancing. The total change in the risky share can be written as the sum of theactiveandpassivechanges: w h,t+1 −w h,t = P h,t+1 + A h,t+1 . Wewillalsousetheanalogousdecompositioninlogs, ln(w h,t+1 )−ln(w h,t )= p h,t+1 +a h,t+1 , where p h,t+1 =ln(w h p ,t+1 )−ln(w h,t ) and a h,t+1 =ln(w h,t+1 )−ln(w h p ,t+1 ) respectivelydenotethepassiveandactivechangesinlogs. These decompositions treat changes in riskless asset hold- ings, caused by saving, dissaving, or dividends received on risky assets,asactiverebalancing.Analternativeapproachwouldbeto",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "312 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 48,
    "chunk_index": 18,
    "word_count": 276,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "312 QUARTERLYJOURNALOFECONOMICS (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "ln(w h,t+1 )−ln(w h,t )= p h,t+1 +a h,t+1 , where p h,t+1 =ln(w h p ,t+1 )−ln(w h,t ) and a h,t+1 =ln(w h,t+1 )−ln(w h p ,t+1 ) respectivelydenotethepassiveandactivechangesinlogs. These decompositions treat changes in riskless asset hold- ings, caused by saving, dissaving, or dividends received on risky assets,asactiverebalancing.Analternativeapproachwouldbeto",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "312 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 19,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "312 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "calculatethepassiveriskysharethatwouldresultfromhousehold savingordissaving,assumedtotakeplacethroughaccumulation or decumulation of riskless assets, in the absence of any trades inriskyassets.Thisalternativedecompositionisattractivetothe extentthathouseholdsbuildupandrundowntheirrisklessbal- ancesforliquidityreasonsthatareunrelatedtotheirinvestment policies.Wedonotpursuethisalternativedecompositionfurther here,butinourstructuralmodelofactiverebalancingwedoallow for a white noise error that may capture high-frequency savings effects. III.B. RebalancingRegressions Changes in a household’s risky share tend to be strongly af- fected by the initial level of the risky share. One reason for this ispurelymechanical:thetotalchangew h,t+1 −w h,t isboundedbe- tween−w h,t and1−w h,t inthepresenceofshortsalesandleverage constraints.Inaddition,theremaybebehavioralreasons,includ- ingsluggishrebalancingandhigh-frequencyvariationinriskless balances,thattheriskysharemaybesubjecttotransitoryshocks andgradualreversiontoalong-termmean. The scatterplots in Figure II show the passive, active, and total changes in levels between 2001 and 2002 versus the initial riskyshareforasubsampleof10,000households.InPanelA,the passivechangeisaU-shapedfunctionoftheinitialshare,asone expects in a bear market. Panel B reveals that the active change isclosetozeroforasizeablegroupofhouseholds,whotradevery little or not at all during the year. This observation is consistent withtheinertiadocumentedonotherdatasets.Thereis,however, considerableheterogeneity,andsubstantiallypositiveornegative values of the active change are observed for many households. Moreover, the active change appears to decrease with the initial share,whichsuggeststhattheriskysharetendstoreverttoward itscross-sectionalmean.InPanelC,thetotalchangeiscontained inthebanddefinedby−w h,t and1−w h,t .TheU-shapedinfluence ofpassivechangeisapparent,consistentwiththeinertiaofsome households. Overall, the scatterplots reveal substantial hetero- geneity and strong dependence with respect to the initial risky sharew h,t . The effects of passive change and initial portfolio weight on active change are clearly visible when we group households into bins according to their initial portfolio weight and plot the",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 313",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 48,
    "chunk_index": 20,
    "word_count": 197,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 313 (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "households. Overall, the scatterplots reveal substantial hetero- geneity and strong dependence with respect to the initial risky sharew h,t . The effects of passive change and initial portfolio weight on active change are clearly visible when we group households into bins according to their initial portfolio weight and plot the A.PassiveChange B.ActiveChange 0.5 0.5 0.4 0.4 0.3 0.3 0.2 0.2 III iiSl 0.1 0.1 ; S;& 0 0 - -0 0. . 1 2 - - 0 0. . 2 1 feMW X* if 7 ® ?? -0.3 -0.3 -0.4 -0.4 -0.5 -0.5 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 ' 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1 C.TotalChange 0.5 0.4 0.3 0.2 . 0.1 I 0 -0.1 -0.2 -0.3 -0.4 -0.5 0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 l FIGUREII ScatterplotsofRiskyShare Notes.Thescatterplotsillustratethepassivechange(PanelA),activechange (PanelB),andtotalchange(PanelC)versustheinitialriskyshareforarandom sample of 10,000 households. All changes are computed in levels between 2001 and2002andareexpressedinnaturalunits. equal-weighted average within each bin of the total change, the passive change and the active change. Figure III shows the re- sultsfortheentireperiod2000–2002(PanelA)andforeachyear separately (Panels B–D). Because of the bear market during our sample period, the passive change is a U-shaped function of the initialexposurew h,t .Activerebalancingishump-shapedandover- alldecreasingwiththeinitialshare,whichisconsistentwithboth meanreversionintheriskyshareandatendencytooffsetpassive changes. In Table II, we investigate the household-level relation be- tween active and passive changes by estimating a rebalancing regression.Wecompareresultsinlevelsandinlogs,butwritethe rebalancingregressionhereinlogs, (1) a h,t+1 =γ 0,t+1 +γ 1 p h,t+1 +γ 2 (lnw h,t −lnw h,t )+u h,t+1 , wherelnw h,t denotestheequal-weightedaverageofthelogrisky share. The regressor (lnw h,t −lnw h,t ) is included to capture the dependence of the active change on the initial risky share that",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "314 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 48,
    "chunk_index": 21,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "314 QUARTERLYJOURNALOFECONOMICS (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "estimating a rebalancing regression.Wecompareresultsinlevelsandinlogs,butwritethe rebalancingregressionhereinlogs, (1) a h,t+1 =γ 0,t+1 +γ 1 p h,t+1 +γ 2 (lnw h,t −lnw h,t )+u h,t+1 , wherelnw h,t denotestheequal-weightedaverageofthelogrisky share. The regressor (lnw h,t −lnw h,t ) is included to capture the dependence of the active change on the initial risky share that",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "314 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "314 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "A.EntirePeriod(1999to2002) B. 1999to2000 1 2 0 0 - - - — (cid:127) o *r — — - P A To c a t t s i a v s l e i c v h c e h a c a n h n g a g e n e ge 1 10 5 - - (cid:127) o - —P A To c a t t s i a v s l e i c v h c e h a c a n h n g a g e n e ge 5 0 0 -5 -10- -10 -20 -15 Riskyshareatendof1999(%) Riskyshareatendof1999(%) C.2000to2001 D.2001to2002 15 15 -(cid:127)—Totalchange Totalchange 10- -o A—P Ac a t s iv s e iv c e h c a h n a g n e ge 10- P Ac a t s iv s e iv c e h c a h n a g n e ge 5- 5- 0 0 -5- -5- -10- -10- -15- -15 Riskyshareatendof2000(%) Riskyshareatendof2001(%) FIGUREIII RiskyShareDecomposition Notes. The figure illustrates the equal-weighted average of the total change, activechange,andpassivechangeinbinsoftheinitialriskyshare.Thechanges arereportedinpercentagesandcomputedinlevelsovertheentireperiod(Panel A)andovereachyearofthesample(PanelsB–D). was illustrated in Figure II. We estimate (1) by OLS, both for pooled data, with year fixed effects, and for each separate cross section.Weincludeintheregressiononlyhouseholdsthatpartici- patebothinyeartandinyeart+1.Thisallowsustodisentangle inframarginalrebalancingfromentryandexitdecisions. Afullypassivehousehold wouldbecharacterized byzerore- gression coefficients: γ 0,t+1 =γ 1 =γ 2 =0. The estimates of γ 1 are infactcloseto−0.5inthepooledregressions,andrangebetween −0.8 and −0.4 in yearly cross sections. Thus we find that house- holds offset about one-half of the passive change through active rebalancing. We obtain negative estimates of γ , implying that 2 households with a large initial risky share have reduced their riskexposuremoreaggressivelythanotherinvestors. TounderstandtheparameterestimatesinTableIIwenowex- amine a few numerical examples. Consider a household invested in the value-weighted average household portfolio, with an ini- tial share equal to the average equal-weighted share at the end of 2001: w h,t =52.3%. In 2002, the average household portfolio",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 315",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 48,
    "chunk_index": 23,
    "word_count": 312,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 315 (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "a large initial risky share have reduced their riskexposuremoreaggressivelythanotherinvestors. TounderstandtheparameterestimatesinTableIIwenowex- amine a few numerical examples. Consider a household invested in the value-weighted average household portfolio, with an ini- tial share equal to the average equal-weighted share at the end of 2001: w h,t =52.3%. In 2002, the average household portfolio",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 315",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 315 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "2002 1002 0002 sraeyllA tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE slevelnI.A 05.53− 344.0− 07.82− 806.0− 09.72− 046.0− 01.35− 405.0− egnahcevissaP 07.87− 981.0− 04.28− 671.0− 01.88− 491.0− 00.441− 681.0− )denaemed(erahsyksirlaitinI 02.81− 220.0− 01.43− 030.0− 04.33 620.0 tpecretnI 04.04 820.0 ymmud9991 01.83− 720.0− ymmud0002 07.62− 720.0− ymmud1002 023,36 911,46 143,06 087,781 snoitavresboforebmuN 01.0 01.0 21.0 21.0 2RdetsujdA sgolnI.B 04.03− 324.0− 03.42− 435.0− 08.53− 547.0− 04.54− 244.0− sgolniegnahcevissaP 04.65− 161.0− 09.26− 251.0− 00.321− 572.0− 00.731− 991.0− )denaemed(erahsyksirlaitinigoL 00.51− 660.0− 05.22− 760.0− 05.73 890.0 tpecretnI 08.24 211.0 ymmud9991 07.22− 060.0− ymmud0002 03.02− 170.0− ymmud1002 023,36 911,46 143,06 087,781 snoitavresboforebmuN 01.0 90.0 42.0 41.0 2RdetsujdA edulcnisnoissergertraeY.)BlenaP(sgolnidna)AlenaP(slevelnihtob,egnahcevissapehtnoegnahcevitcaehtfosnoissergerylraeydnadeloopehtstroperelbatsihT.setoN ylraeyehtnidesustniopatadehtllanodesaberasnoissergerdelooP.traeyfodneehttadna1−traeyfodneehttahtobstekramtessayksirnietapicitraptahtsdlohesuoh .sraeyevitucesnocowtnietapicitraptahtsdlohesuohno,sitaht,snoisserger",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "EGNAHCEVISSAPNOEGNAHCEVITCAFONOISSERGER",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 48,
    "chunk_index": 25,
    "word_count": 105,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "EGNAHCEVISSAPNOEGNAHCEVITCAFONOISSERGER (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "21.0 2RdetsujdA sgolnI.B 04.03− 324.0− 03.42− 435.0− 08.53− 547.0− 04.54− 244.0− sgolniegnahcevissaP 04.65− 161.0− 09.26− 251.0− 00.321− 572.0− 00.731− 991.0− )denaemed(erahsyksirlaitinigoL 00.51− 660.0− 05.22− 760.0− 05.73 890.0 tpecretnI 08.24 211.0 ymmud9991 07.22− 060.0− ymmud0002 03.02− 170.0− ymmud1002 023,36 911,46 143,06 087,781 snoitavresboforebmuN 01.0 90.0 42.0 41.0 2RdetsujdA edulcnisnoissergertraeY.)BlenaP(sgolnidna)AlenaP(slevelnihtob,egnahcevissapehtnoegnahcevitcaehtfosnoissergerylraeydnadeloopehtstroperelbatsihT.setoN ylraeyehtnidesustniopatadehtllanodesaberasnoissergerdelooP.traeyfodneehttadna1−traeyfodneehttahtobstekramtessayksirnietapicitraptahtsdlohesuoh .sraeyevitucesnocowtnietapicitraptahtsdlohesuohno,sitaht,snoisserger yields −32.1%, and the household’s corresponding passive share is41.7%.WeinferfromthepooledregressionreportedinTableII, PanelA,thatthepredictedactivechangeequals2.4%. Now consider an unlucky household with the same initial sharebutwitharealizedriskyreturnof−55.1%.Amongallpar- ticipants,thehouseholdisinthe5thpercentileoftheriskyreturn distribution.Thecorrespondingpassivechangeis−20.0%andthe predictedactivechangethenequals7.1%.Alternatively,consider aluckyhouseholdwiththesameinitialsharebutarealizedrisky return in the 95th percentile (r h,t =−7.3%). The active change is then −1.4%. Agents with returns below the cross-sectional aver- age buy risky assets from agents with higher returns. An agent withanaverageshareandanaveragereturn,ontheotherhand, makesfewertrades.Theintuitionthatextremeagentstrademore thanaverageagentsisfamiliarinequilibriummodels.4 Therebalancingregressionalsopredictstheeffectoftheini- tial share. For instance, a household that has an initial share in the5thpercentile (w h,t =3.9%) andowns thevalue-weighted av- erage household portfolio will select an active change of 6.2%. Similarly, a household with an initial share in the 95th per- centile (w h,t =95.5%) with an average portfolio will select an ac- tive change of −10.8%. Thus, the initial share and the realized return both have substantial quantitative effects on the active change. IntheonlineAppendix,weverifytherobustnessoftherebal- ancingregressionbyclassifyinghouseholdsintoinitialriskyshare bins and regressing the active change onto the passive change withineachbin.Theestimateoftheslopecoefficientγ isstrongly 1 and significantly negative in each risky share bin, so households withhigh and low involvement in risky financial markets all ap- peartoberebalancingactively. Therebalancingcoefficientisunusuallylargeandnegativein the lowest risky share bin, particularly when we run the regres- sion in levels. This likely results in part from a boundary effect. During the bear market, most households with low initial expo- sure (w h,t ≈0) incur small passive losses in levels, which bring them closer to the short sales constraint w h,t+1 ≥0. Such house- holds may substantially increase their risky shares, which will beassociatedwithstronglypositiveactivechanges.Verynegative 4. See Calvet, Gonzalez-Eiras, and Sodini (2004) for an example based on idiosyncraticnontradablerisk.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 317",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 48,
    "chunk_index": 26,
    "word_count": 300,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 317 (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "low initial expo- sure (w h,t ≈0) incur small passive losses in levels, which bring them closer to the short sales constraint w h,t+1 ≥0. Such house- holds may substantially increase their risky shares, which will beassociatedwithstronglypositiveactivechanges.Verynegative 4. See Calvet, Gonzalez-Eiras, and Sodini (2004) for an example based on idiosyncraticnontradablerisk.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 317",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 27,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 317 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "activechanges,ontheotherhand,areinfeasibleinlevels(butare stillinprinciplefeasibleinlogs).Thelevelsregressioninthelow- estriskysharebinisthereforedrivenbyobservationswithsmall negative passive and large positive active changes, resulting in a very negative slope coefficient γ . The coefficient in the lowest 1 riskysharebinissomewhatlessanomalouswhenwerunthere- gressioninlogs,whichencouragesustousealogspecificationin oursubsequentanalysis. III.C. RobustnessChecks Churning. One might worry that households do not delib- erately rebalance the risky share, but instead randomly buy and sellriskyassets—thatis,churntheirportfolios.Portfolioturnover causes measurement error in the passive share, so churning bi- asestheregressioncoefficientoftheactivechangeonthepassive change toward −1. In this case, our results tell us that there is activetrading,butarenotinformativeaboutdeliberaterebalanc- ing. A simple robustness check consists of confining attention to householdsthatdonotpurchasenewriskyassetsduringtheyear. In other words, we exclude any household that has strictly posi- tiveholdingsinperiodt+1ofariskysecuritythatitdidnotown atallinperiodt.IntheAppendix,wereportthatthecorrespond- ing rebalancing propensity is about −0.3, which is weaker than the estimates in Table II but still substantial.5 These estimates are conservative because they exclude households that purchase newassetsaspartofanactiverebalancingstrategy.Thisanalysis suggeststhatchurningalonecannotexplainthestronglynegative estimates of the passive change coefficient reported in our rebal- ancingregressions. Automatic Investment Plans. Automatic investment plans are another source of apparent rebalancing. Consider a house- hold that invests a fixed monetary amount in a basket of risky assets every year and makes no other trades. The active change isthenadecreasingfunctionoftheriskyportfolio’sperformance, whilethepassivechangeincreaseswithperformance.Automatic investmentschemescanthereforegenerateanegativecorrelation betweenactiveandpassivechanges. 5. The Appendix also estimates the adjustment model of the next section forhouseholdsthatpurchasenonewassets.Theestimatedadjustmentspeedis actuallyslightlyhigherforthesehouseholds.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "318 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 48,
    "chunk_index": 28,
    "word_count": 196,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "318 QUARTERLYJOURNALOFECONOMICS (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "are another source of apparent rebalancing. Consider a house- hold that invests a fixed monetary amount in a basket of risky assets every year and makes no other trades. The active change isthenadecreasingfunctionoftheriskyportfolio’sperformance, whilethepassivechangeincreaseswithperformance.Automatic investmentschemescanthereforegenerateanegativecorrelation betweenactiveandpassivechanges. 5. The Appendix also estimates the adjustment model of the next section forhouseholdsthatpurchasenonewassets.Theestimatedadjustmentspeedis actuallyslightlyhigherforthesehouseholds. Automatic investment plans typically imply the purchase of thesameassetseveryyear.Wehavealreadyfound,inourrobust- ness check for churning, that households that purchase no new assetshaveaweakerrebalancingpropensity,suggestingthatau- tomaticinvestmentplanscannotbedrivingourresults.Further,a householdthatonlytradesautomaticallywillneitherbuynorsell assetsandwillthereforeownthesamesetofassetsattheendof yearst andt+1.WeshowintheAppendixthatsuchhouseholds also have rebalancing propensities that are slightly lower than thosereportedinTableII.Itisthusveryunlikelythatautomatic investmentsaccountforourresults. We complement this analysis with a regression on a sim- ulated data set of automatic savers. The automatic investment is assumed to be an exogenous percentage s of initial financial wealth. We set s equal to the average ratio in each year of sav- ingstofinancialwealthforhouseholdspurchasingnonewassets during the year. In the Appendix, we regress the implied active changeonthepassivechangeandobtainonlymodestrebalancing propensities.Resultsaresimilarwhenwesetsequaltoaconstant 3%,closetothetime-seriesaverage oftheyearlys ratiosusedin ourmainapproach. CashBalances. Randomfluctuationsincashbalancesarean- otherconcern.Inthenextsectionwedevelopapartialadjustment modelthatallowshigh-frequencyshockstoaffectthetargetrisky share. In the Appendix, we instead use a bootstrap simulation toinvestigatethisissue.Specifically,weassumethathouseholds do not rebalance or trade risky assets during the year and that their cash balances cb h,t follow the process cb h,t+1 = R h cb ,t+1 cb h,t . The shocks Rcb are i.i.d. across households and sampled from h,t+1 the empirical cross-sectional distribution of the growth rates of cash balances. The simulation generates only modest rebalanc- ing propensities, which shows that random fluctuations in cash balancescannotexplaintherebalancingresultsofthissection. IV. ANADJUSTMENTMODELOFTHERISKYSHARE IV.A. Specification TheregressionsofSectionIIIhaveshownthatrebalancingis influencedbyboththeinitialshareandthepassivechange.This motivates us to specify a model in which households sluggishly",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 319",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 48,
    "chunk_index": 29,
    "word_count": 247,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 319 (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "i.i.d. across households and sampled from h,t+1 the empirical cross-sectional distribution of the growth rates of cash balances. The simulation generates only modest rebalanc- ing propensities, which shows that random fluctuations in cash balancescannotexplaintherebalancingresultsofthissection. IV. ANADJUSTMENTMODELOFTHERISKYSHARE IV.A. Specification TheregressionsofSectionIIIhaveshownthatrebalancingis influencedbyboththeinitialshareandthepassivechange.This motivates us to specify a model in which households sluggishly",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "320 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "320 QUARTERLYJOURNALOFECONOMICS (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "adjust their portfolios toward a desired risky share wd . Our h,t+1 approachisbasedonthreemainassumptions. First, the natural log of the observed risky share w h,t+1 is a weighted average of the log desired share wd and the log h,t+1 passivesharewp : h,t+1 (cid:2) (cid:3) (cid:2) (cid:3) (2) ln(w h,t+1 )=φ h ln w h d ,t+1 +(1−φ h )ln w h p ,t+1 +ε h,t+1 . The error ε h,t+1 is assumed to be i.i.d., resulting from measure- ment error, high-frequency variations in riskless balances, and any other idiosyncratic factors influencing portfolio composition. Thecoefficientφ controlsthehousehold’sspeedofadjustment.It h cantakeanyrealvalue,butvaluesbetweenzeroandoneareeco- nomically most sensible. If φ =1, the household adjusts instan- h taneously, and the observed share is equal to the desired share plus an error: ln(w h,t+1 )=ln(w h d ,t+1 )+ε h,t+1 . A sluggish house- hold (φ <1), on the other hand, is also sensitive to the passive h share. Second,thespeedofadjustmentcoefficientφ isalinearfunc- h tionofobservablecharacteristics, (3) φ h =ϕ 0 +ϕ(cid:7) x h,t , where the vector x h,t is independent of the errors ε h,t and ε h,t+1 . This specification captures the empirical relation between speed of adjustment and measures of financial sophistication such as wealthandeducation. Third, the level of the log desired risky share can vary in an arbitrary manner across households, but the change in the log desiredriskyshareisrelatedtohouseholdcharacteristicsby (cid:2) (cid:3) (4) (cid:8)ln w h d ,t+1 =δ 0,t+1 +δ t (cid:7) +1 x h,t . This equation has a convenient interpretation when households have constant relative risk aversion γ and returns on the risky h asset are i.i.d. The desired risky share of household h is then w h d ,t+1 = S h,t+1 /(γ h σ h,t+1 ), and changes in the log of the desired risky share, (cid:8)ln(w h d ,t+1 )=(cid:8)ln(S h,t+1 /σ h,t+1 ), are driven only by perceived variations in investment opportunities and not by risk aversion.Equation(4)canthenbeviewedasexpressingchanges in perceived investment opportunities as a time-specific function of an intercept and household characteristics. This convenient property does not hold in levels, which supports our choice of a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "320 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 48,
    "chunk_index": 31,
    "word_count": 341,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "320 QUARTERLYJOURNALOFECONOMICS (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "h d ,t+1 )=(cid:8)ln(S h,t+1 /σ h,t+1 ), are driven only by perceived variations in investment opportunities and not by risk aversion.Equation(4)canthenbeviewedasexpressingchanges in perceived investment opportunities as a time-specific function of an intercept and household characteristics. This convenient property does not hold in levels, which supports our choice of a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "320 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "320 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "log specification. In practice, many other factors can, of course, alter the desired risky share, including changes in real estate holdings, human capital, background risk, or wealth if the agent hasdecreasingrelativeriskaversion. IV.B. Estimation Wenowturntotheestimationoftheadjustmentmodel.Inour specification,ahousehold’stargetshareln(wd )isnotobserved, h,t+1 butitschange(cid:8)ln(wd )isaparametricfunctionofcharacteris- h,t+1 tics(4).Thefirststepisthereforetodifferencetheportfolioshare (2): (cid:2) (cid:3) (cid:2) (cid:3) (cid:8)ln w h,t+1 =φ h (cid:8)ln w h d ,t+1 +(1−φ h )(cid:8)ln(w h p ,t+1 )+ε h,t+1 −ε h,t . We then substitute out φ and (cid:8)ln(wd ), using (3) and (4), and h h,t+1 obtainthereduced-formspecification (cid:2) (cid:3) (cid:2) (cid:3) (cid:8)ln(w h,t+1 )=a t+1 +b 0 (cid:8)ln w h p ,t+1 +b (cid:7) x h,t (cid:8)ln w h p ,t+1 (5) +c t (cid:7) +1 x h,t +x h (cid:7) ,t D t+1 x h,t +ε h,t+1 −ε h,t . The reduced-form coefficients relate as follows to the structural parameters of the adjustment model: a t+1 =ϕ 0 δ 0,t+1 , b 0 =1−ϕ 0 , b=−ϕ,c t+1 =δ t+1 ϕ 0 +δ 0,t+1 ϕ,and D t+1 =ϕδ t (cid:7) +1 . The error term of the reduced-form specification (5), ε h,t+1 − ε h,t , follows a first-order moving average process. A high real- ization of ε h,t feeds into a high share w h,t and a high passive share w h p ,t+1 , which implies that the error ε h,t+1 −ε h,t and the regressor (cid:8)ln(w h p ,t+1 )=lnωp(w h,t ;r h,t+1 )−ln(w h p ,t ) are negatively correlated.Becauseofthisproblem,(5)cannotbeconsistentlyesti- matedbyordinaryleastsquares(OLS).Wehandlethisbyfinding asetofinstrumentsthatarecorrelatedwiththeexplanatoryvari- ables in (5) but uncorrelated with the error term. The period- (t+1)zero-rebalancingpassivechange, (cid:2) (cid:3) (cid:2) (cid:3) lnωp w h p ,t ;r h,t+1 −ln w h p ,t , isthepassivechangethatwouldbeobservedatt+1ifthehouse- hold did not rebalance at t. Because rebalancing is limited, this variableshouldbepositivelycorrelatedwiththeactualchangein the passive share. At the same time, if the return r h,t+1 is inde- pendent of the errors, the period-(t+1) zero-rebalancing passive changeisuncorrelatedwithε h,t andcanthereforebeusedinaset ofinstruments.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 321",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 48,
    "chunk_index": 33,
    "word_count": 311,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 321 (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "h p ,t ;r h,t+1 −ln w h p ,t , isthepassivechangethatwouldbeobservedatt+1ifthehouse- hold did not rebalance at t. Because rebalancing is limited, this variableshouldbepositivelycorrelatedwiththeactualchangein the passive share. At the same time, if the return r h,t+1 is inde- pendent of the errors, the period-(t+1) zero-rebalancing passive changeisuncorrelatedwithε h,t andcanthereforebeusedinaset ofinstruments.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 321",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 321 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Estimate t-stat Estimate t-stat Reduced-formparameters Changeinlogpassiveshare −0.121 −44.20 0.363 39.30 Intercept2001 −0.111 −42.00 −0.139 −46.30 Intercept2002 −0.246 −92.10 −0.119 −31.50 Structuralparameters Adjustmentspeedϕ 0 1.121 410.00 0.637 68.90 Targetchangeδ 0,2001 −0.099 −41.50 −0.219 −35.60 Targetchangeδ 0,2002 −0.219 −95.60 −0.186 −39.90 Numberofobservations 120,067 120,067 AdjustedR2 0.08 Notes.ThistablereportstheIVandOLSestimatesoftheadjustmentmodelwithoutcharacteristics.The estimationisbasedonhouseholdsthatparticipateinriskyassetmarketsattheendoftwoconsecutiveyears. InTableIIIweestimatetheadjustmentmodelforthespecial case where all households have the same adjustment speed and targetchange,whichcorrespondstotherestrictionϕ =δ =0.The OLS regression of the total log change in the risky share on the passivelogchangeandatimefixedeffect, (cid:2) (cid:3) (cid:8)ln(w h,t+1 )=a t+1 +b 0 (cid:8)ln w h p ,t+1 +u h,t+1 , gives an estimate for b of −0.12. This estimate is negatively bi- 0 ased, because the regressor (cid:8)ln(w h p ,t+1 ) and the residual u h,t+1 are negatively correlated. When we correct the bias by running an instrumental variables (IV) estimation with an intercept, the log of the initial passive share, and the zero-rebalancing passive change as instruments, we obtain a considerably higher b esti- 0 mateof0.36.Thedifferenceiseconomicallymeaningful.TheOLS estimate implies an adjustment speed ϕ =1−b that is larger 0 0 thanunity,whereastheIVestimateimpliesanadjustmentspeed ϕ =0.64, which is broadly consistent with the rebalancing re- 0 gressionsinSectionIII. The next step is to estimate the adjustment model, allow- ingobservablehouseholdcharacteristicstoaffecttheadjustment speed and the change in the desired log risky share. The set of characteristics includes demographic, financial, and portfolio characteristics. The first category includes age, household size, and dummies for households that have high-school education,",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "OLS IV",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 48,
    "chunk_index": 35,
    "word_count": 229,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "OLS IV (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "rebalancing re- 0 gressionsinSectionIII. The next step is to estimate the adjustment model, allow- ingobservablehouseholdcharacteristicstoaffecttheadjustment speed and the change in the desired log risky share. The set of characteristics includes demographic, financial, and portfolio characteristics. The first category includes age, household size, and dummies for households that have high-school education,",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "post-high-schooleducation,ormissingeducationdata(mostcom- monamongolderandimmigranthouseholds)orareimmigrants. Thesecondcategoryincludesdisposableincome,contributionsto privatepensionplansasafractionofathree-yearaverageofdis- posableincome,logfinancialwealth,logrealestatewealth,logof totaldebtliabilities,anddummiesforhouseholdsthatareretired, unemployed, self-employed (“entrepreneurs”), and students. The thirdcategory,whichisuniquetoourdataset,includesthestan- dard deviation of the risky portfolio and the Sharpe ratio of the riskyportfolio. The inclusion of financial wealth F as a household charac- ht teristic creates a new difficulty. Financial wealth depends on the randomcashbalanceobservedattheendofyeart,andistherefore correlated withthe measurement error ε h,t . A natural solution is to use as an instrument passive financial wealth F h,t−1 (1+r h c ,t ), where 1+r h c ,t ≡w h,t−1 (1+r h,t )+(1−w h,t−1 )(1+r f ) denotes the gross passive return on the complete portfolio. This leads us to define the following set of instruments: (1) an intercept; (2) the period-t log passive share; (3) the period-(t+1) zero-rebalancing passivechange;(4)theperiod-tpassivefinancialwealth;(5)avec- tor of characteristics uncorrelated with the measurement error; and (6) the log passive share, zero-rebalancing passive change, passive financial wealth, and characteristics interacted with the vectorofcharacteristics. Tosimplifytheestimationofthefullmodel(5),giventhatwe haveashortpanelwithonlytwoyearsofdataafterdifferencing, weestimatethereducedformassumingconstantcoefficientsover timeonthehouseholdcharacteristics:c t+1 =c,and D t+1 = D.The structuralrestrictionsofthemodelthenimplythatthetimefixed effectsa t+1 arealsoconstant,asarethestructuralcoefficients in theequationforthechangeinthedesiredriskyshare,(4):δ 0,t+1 = δ 0 and δ t+1 =δ. We do not impose constant time fixed effects but findthemtobealmostidenticalin2001and2002. IV estimates of this model are reported in the first set of columns of Table IV. Each characteristic is standardized to have zero cross-sectional mean. We also normalize to unity the cross- sectional standard deviation of each continuous characteristic, so the reported regression coefficient reveals the effect of a one- standard-deviationchangeinthecharacteristic.Tokeepthetable atamanageablesize,weonlyreportthestructuralvectorsϕ and δ of the full regression. The median value of the speed param- eter is 0.73 and the average log target change is −0.18 in 2002.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 48,
    "chunk_index": 37,
    "word_count": 259,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323 (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "to unity the cross- sectional standard deviation of each continuous characteristic, so the reported regression coefficient reveals the effect of a one- standard-deviationchangeinthecharacteristic.Tokeepthetable atamanageablesize,weonlyreportthestructuralvectorsϕ and δ of the full regression. The median value of the speed param- eter is 0.73 and the average log target change is −0.18 in 2002.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 323 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "egnahctegraT deepS egnahctegraT deepS tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE setamitseretemaraP.A stpecretnI 06.86 147.0 08.96 817.0 0 ϕdeepstnemtsujdA 12.6− 121.0− 03.8− 451.0− 1002.0 δegnahctegraT 69.6− 631.0− 95.8− 951.0− 2002.0 δegnahctegraT scitsiretcarahcoiloftroP 52.5− 952.0− 92.2 080.0 88.8− 973.0− 92.2 570.0 oiloftropyksirfonoitaiveddradnatS 57.5− 015.0− 32.9 312.1 81.6− 835.0− 32.9 741.1 oiloftropyksirfooitareprahS scitsiretcarahclaicnaniF 72.1− 420.0− 63.1 700.0 76.0 210.0 81.2 010.0 emocnielbasopsiD 59.1− 210.0− 36.1− 010.0− 43.1− 800.0− 16.1− 900.0− emocni/aimerpnoisnepetavirP 06.01 390.0 21.4 250.0 07.01 250.0 73.3 040.0 htlaewlaicnanfigoL 67.5 772.0 htlaewlaicnanfigolniegnahC 31.8− 521.0− 69.0 900.0 73.6− 180.0− 38.0 700.0 htlaewetatselaergoL 99.3 140.0 06.2 230.0 83.2 320.0 46.2 130.0 ytilibaillatotgoL 73.0 710.0 92.2− 780.0− 34.0 910.0 61.2− 870.0− ymmudderiteR 21.1 850.0 72.2− 660.0− 00.1 150.0 00.2− 550.0− ymmudtnemyolpmenU 32.0− 500.0− 19.1− 770.0− 40.0 100.0 18.1− 960.0− ymmudruenerpertnE 24.0 550.0 18.0− 540.0− 06.0 770.0 69.0− 150.0− ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "SCITSIRETCARAHCHTIWLEDOMTNEMTSUJDA",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 48,
    "chunk_index": 39,
    "word_count": 136,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SCITSIRETCARAHCHTIWLEDOMTNEMTSUJDA (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "73.6− 180.0− 38.0 700.0 htlaewetatselaergoL 99.3 140.0 06.2 230.0 83.2 320.0 46.2 130.0 ytilibaillatotgoL 73.0 710.0 92.2− 780.0− 34.0 910.0 61.2− 870.0− ymmudderiteR 21.1 850.0 72.2− 660.0− 00.1 150.0 00.2− 550.0− ymmudtnemyolpmenU 32.0− 500.0− 19.1− 770.0− 40.0 100.0 18.1− 960.0− ymmudruenerpertnE 24.0 550.0 18.0− 540.0− 06.0 770.0 69.0− 150.0− ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 325",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 325 (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "egnahctegraT deepS egnahctegraT deepS tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE scitsiretcarahccihpargomeD 99.3− 200.0− 12.2 200.0 94.4− 200.0− 57.1 100.0 egA 77.2− 310.0− 07.2− 710.0− 95.3− 710.0− 73.2− 410.0− ezisdlohesuoH 69.0− 900.0− 86.3 880.0 92.0− 300.0− 08.3 680.0 ymmudloohcs-hgiH 39.0− 800.0− 66.2 740.0 62.0− 200.0− 84.2 240.0 ymmudloohcs-hgih-tsoP 78.1 511.0 71.2 701.0 48.1 111.0 89.1 390.0 atadnoitacudeelbaliavanurofymmuD 73.2− 420.0− 80.0 200.0 41.2− 120.0− 20.0 000.0 ymmudnoitargimmI )1002(noitubirtsidlanoitces-ssorC.B 863.0− 835.0 682.0− 235.0 elitnecrepht5 032.0− 976.0 622.0− 266.0 elitnecrepht52 541.0− 357.0 871.0− 927.0 elitnecrepht05 520.0− 818.0 290.0− 787.0 elitnecrepht57 791.0 209.0 640.0 268.0 elitnecrepht59 lenaP(1002niegnahctegratdnaretemarapdeepsehtfonoitubirtsidlanoitces-ssorcdeilpmiehtdna)AlenaP(ledomtnemtsujdaehtfosetamitseehtstroperelbatsihT.setoN elbasopsiD.elbaliavasiymmudnoitargimmiehthcihwrofdnasraeyevitucesnocowtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.)B htlaewlaicnanfiniegnahcehtnahtrehtoscitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.sraeyeerhtsuoiverpehtrevodegarevasiemocni .stinularutannierascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevahotdezilamronera",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": ")DEUNITNOC(",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 48,
    "chunk_index": 41,
    "word_count": 97,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")DEUNITNOC( (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "240.0 ymmudloohcs-hgih-tsoP 78.1 511.0 71.2 701.0 48.1 111.0 89.1 390.0 atadnoitacudeelbaliavanurofymmuD 73.2− 420.0− 80.0 200.0 41.2− 120.0− 20.0 000.0 ymmudnoitargimmI )1002(noitubirtsidlanoitces-ssorC.B 863.0− 835.0 682.0− 235.0 elitnecrepht5 032.0− 976.0 622.0− 266.0 elitnecrepht52 541.0− 357.0 871.0− 927.0 elitnecrepht05 520.0− 818.0 290.0− 787.0 elitnecrepht57 791.0 209.0 640.0 268.0 elitnecrepht59 lenaP(1002niegnahctegratdnaretemarapdeepsehtfonoitubirtsidlanoitces-ssorcdeilpmiehtdna)AlenaP(ledomtnemtsujdaehtfosetamitseehtstroperelbatsihT.setoN elbasopsiD.elbaliavasiymmudnoitargimmiehthcihwrofdnasraeyevitucesnocowtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.)B htlaewlaicnanfiniegnahcehtnahtrehtoscitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.sraeyeerhtsuoiverpehtrevodegarevasiemocni .stinularutannierascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevahotdezilamronera",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "326 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "326 QUARTERLYJOURNALOFECONOMICS (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Section III and imply a modest revision in the target share. The estimatesofϕ andδarerobusttotheinclusionorexclusionofthe nonlinearinteractedterm x h (cid:7) ,t Dx h,t . The most striking result in Table IV is that the speed of ad- justment tends to increase with variables associated with finan- cial sophistication, such as education, disposable income, debt, and financial and real estate wealth. In addition, households with well-diversified portfolios (high Sharpe ratios) have higher adjustment speeds. Entrepreneurial activity, retirement, unem- ployment, and household size, on the other hand, reduce the ad- justmentspeed. Changes in the target risky share are less consistently re- lated to household characteristics. Households with greater fi- nancialwealthreducetheirtargetless.Realestatewealth,onthe otherhand,worksintheoppositedirection,perhapsbecausethe booming Swedish real estate market reduced the attractiveness ofstockstoreal-estate-orientedinvestorsin2001and2002.Well- diversifiedandaggressivehouseholds,withhigherSharperatios and riskier portfolios, reduce their target share more; but so do larger, older, and immigrant households, which normally invest cautiously(CCS2007). The estimates in Table IV can be used to compute the pre- dicted speed parameter and target change of every household. The cross-sectional distribution of the speed φ has a median h value of 0.73, a 5th percentile of 0.53, and a 95th percentile of 0.86, numbers that seem quite reasonable. Similarly, the target change(cid:8)ln(wd )hasa5thpercentileof−29%,amedianvalue h,t+1 of −18%, and a 95th percentile of 5%, which again seem quite reasonableinaseverebearmarket. IntheAppendix,wereporttheaveragecharacteristicvalues forhouseholdsatdifferentpercentilesofthepredictedadjustment speedandtargetchangedistributions.Theaveragehouseholdat the 5th percentile of adjustment speed has disposable income of about$20,700andwealthof$10,500,47%ofwhichisinvestedin risky assets with a Sharpe ratio of 0.22. Of these slowly adjust- inghouseholds,35%haveahighschooleducation,and6%havea college education. Atthe95th percentile of adjustment speed,by contrast,theaveragehouseholdhasdisposableincomeof$42,800 and wealth of $56,200, 70% of which is invested in risky assets with a Sharpe ratio of 0.31. Of these rapidly adjusting house- holds, 95% have a high school education, and 71% have a college",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "Thesenumbersareconsistentwiththerebalancingregressionsin",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 48,
    "chunk_index": 43,
    "word_count": 277,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Thesenumbersareconsistentwiththerebalancingregressionsin (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "of 0.22. Of these slowly adjust- inghouseholds,35%haveahighschooleducation,and6%havea college education. Atthe95th percentile of adjustment speed,by contrast,theaveragehouseholdhasdisposableincomeof$42,800 and wealth of $56,200, 70% of which is invested in risky assets with a Sharpe ratio of 0.31. Of these rapidly adjusting house- holds, 95% have a high school education, and 71% have a college",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "Thesenumbersareconsistentwiththerebalancingregressionsin",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Thesenumbersareconsistentwiththerebalancingregressionsin (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "education. In short, rapidly adjusting households appear to be morefinanciallysophisticatedthanslowlyadjustinghouseholds. The Appendix also reports results when we estimate the ad- justmentmodelseparatelyfortheyears2001and2002,allowing both adjustment speeds and target changes to vary across years. TheresultsarequalitativelysimilartothosereportedinTableIV, although adjustment speeds appear to be higher in 2001 than in 2002,andsomeoftheindividualcharacteristicshavecoefficients thatareunstableovertime. IV.C. ImpactofWealthChangesonRiskTaking In the first set of columns of Table IV, we have used slowly evolving demographic and financial variables as household char- acteristics that may influence portfolio adjustment. We now ex- plore the possibility that portfolio decisions are also affected by high-frequency variation in financial wealth. Several branches of financial theory suggest that an increase in financial wealth mightincreasethepropensitytotakerisk. Inthepresenceofbor- rowing constraints, individuals become less risk-averse as they become richer and thus less likely to face a binding constraint in the future. Even in the absence of such frictions, investors withdecreasingrelativeriskaversiontendtoholdahigherrisky share as their wealth goes up. Carroll (2000, 2002) builds such a utility function and documents a positive empirical relation between household wealth and the risky share. Models of port- folio insurance (Brennan and Schwartz 1988) and habit forma- tion(Constantinides1990;Dybvig1995;CampbellandCochrane 1999)alsoimplyapositiverelationbetweenwealthandtherisky share, because richer agents are more willing to take risk as their wealth moves further above the minimum level required bytheportfolioinsurancepolicyorthepresentvalueofthefuture habit. In the second set of columns of Table IV, we reestimate the adjustment model using the contemporaneous change in log fi- nancialwealthasanadditionalhouseholdcharacteristicthatcan affectthechangeinthetarget.Weaddoneinstrumenttothepre- vious set, the zero-rebalancing return on the complete portfolio, that is, the return that each household would earn at t+1 if it did not rebalance at t. We find that an increase in log financial wealth leads to a higher target risky share, while the impact of othercharacteristicsislargelyunchanged.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 327",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 48,
    "chunk_index": 45,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 327 (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "nancialwealthasanadditionalhouseholdcharacteristicthatcan affectthechangeinthetarget.Weaddoneinstrumenttothepre- vious set, the zero-rebalancing return on the complete portfolio, that is, the return that each household would earn at t+1 if it did not rebalance at t. We find that an increase in log financial wealth leads to a higher target risky share, while the impact of othercharacteristicsislargelyunchanged.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 327",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 327 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "In the Appendix, we show that results are similar when we estimate the model separately for the years 2001 and 2002, al- though the effect of the change in log financial wealth on the targetriskyshareisstrongerin2002.TheAppendixalsoreports similar results when we allow the change in log financial wealth toaffecttheadjustmentspeedaswellasthedesiredriskyshare. Wefindlittlevariationinthechangeinlogfinancialwealthacross rapidlyadjustingandslowlyadjustinghouseholds,butlargevari- ation across households with high and low predicted changes in thetargetriskyshare.Householdsatthe5thpercentileofthetar- get change experience average financial wealth declines of 44%, whereas households at the 95th percentile of the target change experienceaveragefinancialwealthincreasesof31%. Inarecentstudy,BrunnermeierandNagel(2008)assessthe empiricalrelationbetweenwealthandtheriskyshareusingU.S. data from the Panel Study of Income Dynamics (PSID). They regress the change in the risky share (in levels) on the change in financial wealth (in logs) and control variables and obtain a smallandslightlynegativewealthcoefficient.Theyattributethis resulttoinertia.Whenahouseholdsavesintheformofcashdur- ing the year and only partially rebalances its financial portfolio, itsriskysharetendstofallmechanically. In the Appendix, we estimate the Brunnermeier–Nagel re- gressiononourSwedishdataset.TheOLSestimateoftheregres- sioncoefficientisslightlynegative,consistentwithBrunnermeier andNagel’sfinding;butitbecomespositivewhenweestimatethe regressionbyinstrumentalvariables.Similarly,wefindapositive relation between the change in the risky share and the lagged change in financial wealth. These results are robust to separate estimation of the regression in the years 2001 and 2002. Thus, controlling for endogeneity problems and household inertia, the Swedish data do show some evidence for a positive link between wealthchangesandrisktaking. IV.D. ConnectionwithRebalancingRegressions Theadjustmentmodelofthissectionisintimatelyrelatedto the rebalancing regressions we estimated in Section III. When the adjustment speed and target changes are the same for all households,theadjustmentmodelimplies (cid:2) (cid:3) (6) a h,t+1 =φδ 0,t+1 −φp h,t+1 −φ lnw h,t −lnw h d ,t +ε h,t+1 ,",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "328 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 48,
    "chunk_index": 47,
    "word_count": 235,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "328 QUARTERLYJOURNALOFECONOMICS (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "evidence for a positive link between wealthchangesandrisktaking. IV.D. ConnectionwithRebalancingRegressions Theadjustmentmodelofthissectionisintimatelyrelatedto the rebalancing regressions we estimated in Section III. When the adjustment speed and target changes are the same for all households,theadjustmentmodelimplies (cid:2) (cid:3) (6) a h,t+1 =φδ 0,t+1 −φp h,t+1 −φ lnw h,t −lnw h d ,t +ε h,t+1 ,",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 48,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "which is analogous but not exactly identical to the rebalancing regression(1).Thesimilaritysuggeststhattheadjustmentspeed shouldbeclosetotheregressioncoefficientsreportedinTableII, Panel B; this is indeed the case in our empirical results because themedianspeedφ andthelinearregressioncoefficient−γ are h 1 both about one-half. The distance to the target, lnw h,t −lnw h d ,t , representstheonlydifferencebetween(1)and(6).Wecanthere- fore view (1) as a reduced-form specification in which all house- holdshavethesamespeedofadjustmentandthedistancetothe target, lnw h,t −lnw h d ,t , is proxied by a rescaled distance to the cross-sectionalmean,λ(lnw h,t −lnw h,t ). We show in the Appendix that the adjustment model with heterogeneous agents leads to additional terms in the rebalanc- ing regressions. Section IV thus improves on the specification in Section III by (1) providing more precise micro foundations; (2) correctly estimating the structural parameters even though the target is unobserved; and (3) allowing for heterogeneity in the adjustmentspeedandthetargetchange. In the Appendix, we investigate the role of household char- acteristicsintherebalancingregression(1).Thereductioninthe risky share is in all years less pronounced for households with higherfinancialwealthordebt.Thesehouseholdsweremorewill- ing to maintain their proportional investments in risky assets than were other Swedish households. We interact demographic variableswithpassivechangesandfindthatwealthierandmore sophisticated households tend to have more negative regression coefficientsofactivechangesonpassivechanges;thatis,theyre- balance more actively. These findings confirm the results of the adjustmentmodel.Theyarelimited,however,inthattheydonot allow us to disentangle household inertia from changes in the targetriskyshare,astheadjustmentmodelcando. V. ASSET-CLASSPARTICIPATION,ASSET-LEVELREBALANCING, ANDTHEDISPOSITIONEFFECT We now study household decisions to participate in asset classes (risky assets, mutual funds, and direct stockholding) and to rebalance positions in individual assets. We relate these deci- sions to the disposition effect, the tendency to realize gains and hold on to losses, where gains and losses are measured relative totheasset’spurchaseprice.Thedispositioneffectwasidentified",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 48,
    "chunk_index": 49,
    "word_count": 262,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329 (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "now study household decisions to participate in asset classes (risky assets, mutual funds, and direct stockholding) and to rebalance positions in individual assets. We relate these deci- sions to the disposition effect, the tendency to realize gains and hold on to losses, where gains and losses are measured relative totheasset’spurchaseprice.Thedispositioneffectwasidentified",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 329 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "byShefrinandStatman(1985)andhasbeenwidelydocumented (e.g.,Odean[1998]). The Swedish data set unfortunately does not provide the datesorpricesofindividualassettrades.Forthisreason,weuse an asset’s return during the year as an alternative measure of performance.Thisimpliesthatweareassessingtherobustnessof thedispositioneffecttothisalternativebenchmark.TheSwedish datasethasanimportantcompensatingadvantage:wecanrelate thedispositioneffecttodemographicandfinancialcharacteristics ofhouseholds,aswellasthecharacteristicsoftheportfoliosthey hold.ThisallowsustoextendtherecentfindingofDharandZhu (2006) that households with higher self-reported income are less pronetothedispositioneffect. V.A. EntryandExitattheRiskyPortfolioandAssetClassLevels We begin by investigating the probability that a household entersorexitsriskyassetmarkets.InTableV,werunpooledpro- bitregressionsoftheform y h,t =(cid:11)(x h (cid:7) ,t γ +γ 0,t ),where y h,t denotes participationstatus,x h,t isthevectorofcharacteristics,andγ 0,t is a time-dependent intercept. The time interval is annual, and we pooldatafrom2000,2001,and2002.Tofacilitatecomparison,we report in the last three rows the rates of entry to and exit from riskyassetmarketsineachyear. In the first set of three columns, we analyze the probability that a nonparticipant in year t holds risky assets in year t+1. Thefirsttwocolumnsreportcoefficientsandt-statistics,whereas the third column assesses the economic magnitude of the coeffi- cient estimates by reporting the impact on the entry probability of increasing a nondummy regressor by one standard deviation, or setting a dummy variable equal to one. This impact depends onthebaserateofentry;wereportitfortheyear2001,inwhich theoverallentryratewas5.7%,muchlowerthantheratein2000 andslightlyhigherthantheratein2002. The probability of entry increases with standard measures of financial sophistication such as education, financial and real estate wealth, and the private pension savings rate. Conversely, the exit probability decreases with variables associated with in- vestor sophistication, as shown in the middle three columns of TableV. The entry and exit regressions are thus remarkably symmetricandconsistentwithearlierresearchoncross-sectional data. Household characteristics that predict participation in a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "330 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 48,
    "chunk_index": 51,
    "word_count": 226,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "330 QUARTERLYJOURNALOFECONOMICS (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "education, financial and real estate wealth, and the private pension savings rate. Conversely, the exit probability decreases with variables associated with in- vestor sophistication, as shown in the middle three columns of TableV. The entry and exit regressions are thus remarkably symmetricandconsistentwithearlierresearchoncross-sectional data. Household characteristics that predict participation in a",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 331",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 48,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 331 (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "tixE yrtnE egnahC tats-t etamitsE egnahC tats-t etamitsE egnahC tats-t etamitsE scitsiretcarahcoiloftroP %18.0− 07.42− 175.0− erahsyksirlaitinI %02.0− 02.5− 872.0− oiloftropyksirfonoitaiveddradnatS %90.0 28.1 660.0 %59>erahsyksirrofymmuD %61.0− 46.4− 164.0− oiloftropyksirfooitareprahS %61.0 72.6 674.0 oiloftropyksirfoniaG %73.0 04.6 693.0 oiloftropyksirfossoL scitsiretcarahclaicnaniF %80.0 40.3 410.0 %90.0 33.3 510.0 %88.0 07.31 390.0 emocnielbasopsiD %63.0− 17.5− 860.0− %24.0− 83.6− 770.0− %62.0 68.5 920.0 emocni/aimerpnoisnepetavirP %12.1− 00.63− 192.0− %74.1− 06.64− 653.0− %33.2 04.92 122.0 htlaewlaicnanfigoL %83.0− 04.11− 470.0− %83.0− 07.01− 960.0− %00.1 07.51 401.0 htlaewetatselaergoL %90.0− 20.2− 710.0− %51.0− 90.3− 620.0− %66.0 84.8 170.0 ytilibaillatotgoL %80.0 45.0 410.0 %11.0 47.0 910.0 %00.0 10.0− 000.0 ymmudtnemeriteR %25.0 23.4 780.0 %06.0 07.4 390.0 %33.0− 13.2− 930.0− ymmudtnemyolpmenU %43.0− 28.1− 660.0− %81.0− 68.0− 130.0− %33.0 00.1 630.0 ymmudruenerpertnE %12.1 61.5 181.0 %21.1 27.4 461.0 %10.1− 63.4− 031.0− ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "SEITILIBABORPTIXEDNAYRTNE",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 48,
    "chunk_index": 53,
    "word_count": 127,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "SEITILIBABORPTIXEDNAYRTNE (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "%90.0− 20.2− 710.0− %51.0− 90.3− 620.0− %66.0 84.8 170.0 ytilibaillatotgoL %80.0 45.0 410.0 %11.0 47.0 910.0 %00.0 10.0− 000.0 ymmudtnemeriteR %25.0 23.4 780.0 %06.0 07.4 390.0 %33.0− 13.2− 930.0− ymmudtnemyolpmenU %43.0− 28.1− 660.0− %81.0− 68.0− 130.0− %33.0 00.1 630.0 ymmudruenerpertnE %12.1 61.5 181.0 %21.1 27.4 461.0 %10.1− 63.4− 031.0− ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "332 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 48,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "332 QUARTERLYJOURNALOFECONOMICS (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "tixE yrtnE egnahC tats-t etamitsE egnahC tats-t etamitsE egnahC tats-t etamitsE scitsiretcarahccihpargomeD %64.0 99.6 500.0 %25.0 35.7 500.0 %81.2− 05.82− 810.0− egA %80.0− 40.2− 210.0− %21.0 47.2 510.0 %15.0− 42.9− 450.0− ezisdlohesuoH %62.0− 09.2− 940.0− %23.0− 74.3− 850.0− %11.1 72.7 511.0 ymmudloohcshgiH %62.0− 71.3− 050.0− %43.0− 10.4− 260.0− %63.1 09.8 831.0 ymmudloohcshgih-tsoP %10.0 60.0 200.0 %00.0 20.0− 100.0− %27.0− 21.3− 090.0− atadnoitacudeelbaliavanurofymmuD %33.1 04.11 791.0 %34.1 08.11 102.0 %67.0− 30.6− 590.0− ymmudnoitargimmI %9.1 %9.1 %8.51 0002nitixe/yrtnefoetaR %4.3 %4.3 %7.5 1002nitixe/yrtnefoetaR %9.3 %9.3 %4.4 2002nitixe/yrtnefoetaR ,oiloftropdnastceffedexfiylraeyedulcniselbairavyrotanalpxE.stekramtessayksirmorftixednaotyrtnes’dlohesuohafonoissergertiborpdeloopehtstroperelbatehT.setoN lanigramdna,citsitats-t,tneicfifeocraenilehttroperew,noissergerhcaeroF.sraeyeerhtsuoiverpehtrevodegarevasiemocnielbasopsiD.scitsiretcarahccihpargomeddna,laicnanfi hcaeninoitaiveddradnatstinuevahotdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.elbairavgnitciderphcaefotceffe ymmudnonagnisaercnifo)slevelni(elbairavtnednepedehtnotcapmiehtgnitupmocybdessessasitceffelanigramehT.stinularutannierascitsiretcarahcoiloftroP.noitcesssorc .elbaliavanusiymmudnoitargimmiehthcihwrofsdlohesuohedulcxeeW.1002raeyni,enootlauqeelbairavymmudagnittesro,noitaiveddradnatsenoybrosserger",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": ")DEUNITNOC(",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 48,
    "chunk_index": 55,
    "word_count": 89,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")DEUNITNOC( (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "72.7 511.0 ymmudloohcshgiH %62.0− 71.3− 050.0− %43.0− 10.4− 260.0− %63.1 09.8 831.0 ymmudloohcshgih-tsoP %10.0 60.0 200.0 %00.0 20.0− 100.0− %27.0− 21.3− 090.0− atadnoitacudeelbaliavanurofymmuD %33.1 04.11 791.0 %34.1 08.11 102.0 %67.0− 30.6− 590.0− ymmudnoitargimmI %9.1 %9.1 %8.51 0002nitixe/yrtnefoetaR %4.3 %4.3 %7.5 1002nitixe/yrtnefoetaR %9.3 %9.3 %4.4 2002nitixe/yrtnefoetaR ,oiloftropdnastceffedexfiylraeyedulcniselbairavyrotanalpxE.stekramtessayksirmorftixednaotyrtnes’dlohesuohafonoissergertiborpdeloopehtstroperelbatehT.setoN lanigramdna,citsitats-t,tneicfifeocraenilehttroperew,noissergerhcaeroF.sraeyeerhtsuoiverpehtrevodegarevasiemocnielbasopsiD.scitsiretcarahccihpargomeddna,laicnanfi hcaeninoitaiveddradnatstinuevahotdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.elbairavgnitciderphcaefotceffe ymmudnonagnisaercnifo)slevelni(elbairavtnednepedehtnotcapmiehtgnitupmocybdessessasitceffelanigramehT.stinularutannierascitsiretcarahcoiloftroP.noitcesssorc .elbaliavanusiymmudnoitargimmiehthcihwrofsdlohesuohedulcxeeW.1002raeyni,enootlauqeelbairavymmudagnittesro,noitaiveddradnatsenoybrosserger crosssection (e.g., Guiso, Haliassos, and Jappelli [2002]; CCS [2007])alsohelptoexplainentryandexitinthepanel. In the last three columns of Table V, we investigate how the exit probability is affected by portfolio characteristics. The exit probability decreases with the initial risky share and the stan- darddeviationoftheriskyportfolio.Moreaggressiveagentshave higher risk tolerance and are less likely to give up the benefits of financial risk taking entirely. A complementary explanation is thathouseholdssluggishlyadjusttheirportfolios,asinSectionIV; more aggressive investors are then more reluctant to dispose of alltheirriskyassets.Theexitprobability,however,increaseswith extremerisktaking,asmeasuredbyadummyequaltounityifthe risky share exceeds 95%. Extreme risk takers presumably have limitedunderstandingoffinancialriskandmaybepronetopanic sellinginabearmarket. A household is also more likely to exit if it is undiversified (lowSharperatioS h,t ).Finally,weconsidertheperformanceofthe risky portfolio during the year and distinguish between positive returns (winning portfolios) and negative returns (losing portfo- lios). Large absolute returns tend to increase the probability of exit, and the effect is slightly more pronounced for winners than forlosers. We next investigate the separate roles of direct stock and mutualfundholdings.ItisusefultodecomposetheoverallSharpe ratiointoitsstockandfundcomponents.LetD h,t denotetheshare of direct stockholdings in the risky portfolio, S D,h,t and S F,h,t the Sharperatiosofthestockandfundportfolios,andσ D,h,t andσ F,h,t theirstandard deviations. The Sharpe ratio of the riskyportfolio satisfies S h,t =C D,h,t +C F,h,t , where the components of the Sharpe ratio attributable to each assetclassaregivenby C D,h,t = S D,h,t D h, σ t σ D,h,t, h,t C F,h,t = S F,h,t (1−D σ h,t )σ F,h,t. h,t The contribution of an asset class to the overall Sharpe ratio is largeifthehouseholdholdsadiversifiedportfolioofassetsinthe class,whichrepresentsalargefractionofitsriskexposure.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 333",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 48,
    "chunk_index": 56,
    "word_count": 285,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 333 (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "F,h,t , where the components of the Sharpe ratio attributable to each assetclassaregivenby C D,h,t = S D,h,t D h, σ t σ D,h,t, h,t C F,h,t = S F,h,t (1−D σ h,t )σ F,h,t. h,t The contribution of an asset class to the overall Sharpe ratio is largeifthehouseholdholdsadiversifiedportfolioofassetsinthe class,whichrepresentsalargefractionofitsriskexposure.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 333",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 57,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 333 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "In Table VI, we investigate exit decisions by asset class for asubsetofhouseholdsthatinitiallyownbothstocksandmutual funds. As in the previous tables, we include financial and demo- graphicvariablesandtheriskyportfolio’sstandarddeviation.We also consider the contributions of stocks and funds to the overall Sharpe ratio and the performance during the year of the house- hold’s stocks and funds. These variables are used to explain the probabilitythataparticipatinghouseholddisposesofallitsrisky assets(firstthreecolumns),allitsdirectlyheldstocks(nextthree columns),orallitsmutualfunds(lastthreecolumns). MostofthepatternsinTableVIareconsistentwiththoseal- readyshowninTableV.ThestrikingnewresultinTableVIisthat the exit probability from risky asset markets increases strongly with the performance of winning stock portfolios. Winning stock portfolioperformancehasanevengreaterimpactontheprobabil- ityofexitingdirectstockholding,asshowninthesecondcolumnof thetable.Thesefindingsareconsistentwiththedispositioneffect on direct stockholdings: the owner of a winning stock portfolio is more likely to sell it and leave financial markets. There is little evidenceinthetableofacomparabledispositioneffectformutual funds. The owner of a winning mutual fund portfolio is slightly more likely to liquidate it, but the effect is small and statisti- callyinsignificant;losseshavealargereffectonthemutualfund sales probability, consistent with the literature on performance sensitivity of mutual fund holdings (Ippolito 1992; Gruber 1996; Chevalier and Ellison 1997; Sirri and Tufano 1998; Frazzini and Lamont2008;IvkovicandWeisbenner2007). V.B. DynamicsofIndividualAssetShares Wenowinvestigatehowahouseholdadjustsduringyeart+1 theassetpositionsthatitholdsattheendofyeart.Becauseexit decisions have been addressed in Section V.A, we consider only households that own risky assets in both years. Also, we confine attention to assets that are held at the end of year t and do not attempttomodelhouseholddecisionstopurchasenewassets. Ahouseholdowningastockattheendof2000had,bytheend of 2001, partially sold it with probability 27%, fully sold it with probability 16%, held on to it with probability 22%, and bought additional units of the same stock with probability 35%. Partial salesandpartialpurchasesarethusmorefrequentthanfullsales orcontinuedholdings.AsreportedintheAppendix,thisproperty holdsinallyearsandisevenmorepronouncedformutualfunds:",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "334 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 48,
    "chunk_index": 58,
    "word_count": 237,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "334 QUARTERLYJOURNALOFECONOMICS (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "that are held at the end of year t and do not attempttomodelhouseholddecisionstopurchasenewassets. Ahouseholdowningastockattheendof2000had,bytheend of 2001, partially sold it with probability 27%, fully sold it with probability 16%, held on to it with probability 22%, and bought additional units of the same stock with probability 35%. Partial salesandpartialpurchasesarethusmorefrequentthanfullsales orcontinuedholdings.AsreportedintheAppendix,thisproperty holdsinallyearsandisevenmorepronouncedformutualfunds:",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 335",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 48,
    "chunk_index": 59,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 335 (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "sdnuflautuM skcotS stessayksiR egnahC tats-t etamitsE egnahC tats-t etamitsE egnahC tats-t etamitsE scitsiretcarahcoiloftroP %84.0− 02.01− 863.0− %52.0− 07.4− 871.0− %80.0− 11.4− 292.0− erahsyksirlaitinI %52.0 38.4 283.0 %62.0 26.4 373.0 %20.0 51.1 071.0 oiloftropyksirfonoitaiveddradnatS %21.0− 32.1− 972.0− %71.1− 04.31− 203.3− %01.0− 88.2− 672.1− oitareprahSfotnenopmockcotS %58.0− 35.9− 457.1− %34.0− 80.4− 267.0− %21.0− 24.3− 091.1− oitareprahSfotnenopmocdnuF %70.0− 02.1− 601.0− %65.0 02.31 496.0 %40.0 75.2 862.0 oiloftropkcotsfoniaG %50.0− 48.0− 640.0− %20.0 92.0 510.0 %20.0 08.0 080.0 oiloftropkcotsfossoL %70.0 76.1 444.0 %50.0− 58.0− 833.0− %00.0 62.0 751.0 oiloftropdnuflautumfoniaG %02.0 42.2 362.0 %70.0− 76.0− 190.0− %70.0 48.1 634.0 oiloftropdnuflautumfossoL scitsiretcarahclaicnaniF %80.0 48.0− 640.0− %70.0 26.1 210.0 %20.0 87.1 410.0 emocnielbasopsiD %93.0− 76.1 444.0 %91.0− 53.2− 330.0− %31.0− 95.3− 631.0− emocni/aimerpnoisnepetavirP %57.0− 42.2 362.0 %89.0− 08.71− 802.0− %51.0− 87.7− 961.0− htlaewlaicnanfigoL %42.0− 03.2 410.0 %81.0− 62.3− 330.0− %60.0− 13.3− 060.0− htlaewetatselaergoL %40.0− 60.5− 670.0− %01.0 03.1 710.0 %30.0− 10.1− 620.0− ytilibaillatotgoL %61.0 06.41− 751.0− %58.0 82.3 031.0 %50.0 65.0 340.0 ymmudtnemeriteR %77.0 16.4− 440.0− %20.0 70.0 300.0 %92.0 50.3 691.0 ymmudtnemyolpmenU %10.0− 16.0− 800.0− %55.0− 50.2− 501.0− %40.0− 33.0− 330.0− ymmudruenerpertnE %77.1 77.0 820.0 %84.0 51.1 770.0 %22.0 33.1 551.0 ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "YTILIBABORPTIXENOSGNIDLOHDNUFLAUTUMDNAKCOTSFOTCAPMI",
    "page_number": 35,
    "page_range": "p.35",
    "total_pages": 48,
    "chunk_index": 60,
    "word_count": 184,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "YTILIBABORPTIXENOSGNIDLOHDNUFLAUTUMDNAKCOTSFOTCAPMI (p.35)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "%40.0− 60.5− 670.0− %01.0 03.1 710.0 %30.0− 10.1− 620.0− ytilibaillatotgoL %61.0 06.41− 751.0− %58.0 82.3 031.0 %50.0 65.0 340.0 ymmudtnemeriteR %77.0 16.4− 440.0− %20.0 70.0 300.0 %92.0 50.3 691.0 ymmudtnemyolpmenU %10.0− 16.0− 800.0− %55.0− 50.2− 501.0− %40.0− 33.0− 330.0− ymmudruenerpertnE %77.1 77.0 820.0 %84.0 51.1 770.0 %22.0 33.1 551.0 ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "336 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 48,
    "chunk_index": 61,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "336 QUARTERLYJOURNALOFECONOMICS (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "sdnuflautuM skcotS stessayksiR egnahC tats-t etamitsE egnahC tats-t etamitsE egnahC tats-t etamitsE scitsiretcarahccihpargomeD %72.0 93.3 221.0 %32.0− 95.2− 300.0− %40.0 79.0 200.0 egA %34.0− 60.0− 300.0− %13.0 27.4 040.0 %40.0 85.1 720.0 ezisdlohesuoH %91.0− 69.3 942.0 %30.0 81.0 500.0 %10.0− 22.0− 210.0− ymmudloohcshgiH %62.0− 78.2 300.0 %30.0 32.0 500.0 %20.0 03.0 410.0 ymmudloohcshgih-tsoP %22.0− 72.7− 660.0− %59.0 42.3 341.0 %61.0 25.1 221.0 atadnoitacudeelbaliavanurofymmuD %19.0 13.1− 630.0− %27.0 37.3 211.0 %12.0 67.2 941.0 ymmudnoitargimmI %2.2 %9.2 %3.0 0002nitixefoetaR %0.3 %2.3 %5.0 1002nitixefoetaR %3.3 %6.2 %6.0 2002nitixefoetaR stilladna,)snmuloceerhtfoteselddim(skcotsstilla,)snmuloceerhtfotestsrfi(stessayksirstillasllesdlohesuohatahtnoissergertiborpdeloopastroperelbatehT.setoN ehttroperewnoissergerhcaeroF.sraeyeerhtsuoiverpehtrevoemocnielbasopsidtuoegarevadna,stceffedexfiylraeyedulcnieW.)snmuloceerhtfotestsal(sdnuflautumyksir otdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.elbairavgnitciderphcaefotceffelanigramdna,citsitats-t,tneicfifeocraenil elbairavtnednepedehtnotcapmiehtgnitupmocybdessessasitceffelanigramehT.stinularutannierascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevah sdlohesuohfotesehtnodesaberasnoissergerehT.1002raeyni,enootlauqeelbairavymmudagnittesro,noitaiveddradnatsenoybrossergerymmudnonagnisaercnifo)slevelni( .elbaliavanusiymmudnoitargimmiehthcihwrofsdlohesuohedulcxeeW.sdnufdnaskcotshtobdlohtaht",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": ")DEUNITNOC(",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 48,
    "chunk_index": 62,
    "word_count": 91,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")DEUNITNOC( (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "210.0− ymmudloohcshgiH %62.0− 78.2 300.0 %30.0 32.0 500.0 %20.0 03.0 410.0 ymmudloohcshgih-tsoP %22.0− 72.7− 660.0− %59.0 42.3 341.0 %61.0 25.1 221.0 atadnoitacudeelbaliavanurofymmuD %19.0 13.1− 630.0− %27.0 37.3 211.0 %12.0 67.2 941.0 ymmudnoitargimmI %2.2 %9.2 %3.0 0002nitixefoetaR %0.3 %2.3 %5.0 1002nitixefoetaR %3.3 %6.2 %6.0 2002nitixefoetaR stilladna,)snmuloceerhtfoteselddim(skcotsstilla,)snmuloceerhtfotestsrfi(stessayksirstillasllesdlohesuohatahtnoissergertiborpdeloopastroperelbatehT.setoN ehttroperewnoissergerhcaeroF.sraeyeerhtsuoiverpehtrevoemocnielbasopsidtuoegarevadna,stceffedexfiylraeyedulcnieW.)snmuloceerhtfotestsal(sdnuflautumyksir otdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahcllA.elbairavgnitciderphcaefotceffelanigramdna,citsitats-t,tneicfifeocraenil elbairavtnednepedehtnotcapmiehtgnitupmocybdessessasitceffelanigramehT.stinularutannierascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevah sdlohesuohfotesehtnodesaberasnoissergerehT.1002raeyni,enootlauqeelbairavymmudagnittesro,noitaiveddradnatsenoybrossergerymmudnonagnisaercnifo)slevelni( .elbaliavanusiymmudnoitargimmiehthcihwrofsdlohesuohedulcxeeW.sdnufdnaskcotshtobdlohtaht the probability of a fund’s full sale is less than 10% whereas the probability of a partial purchase is about 60%. The high proba- bility of partial purchases for funds is attributable in part to the dividend reinvestment plans offered by most investment compa- nies.Eventhoughfullsalesarearelativelylimitedphenomenon, we begin by studying them separately given their importance in thedispositioneffectliterature. Full Sales. In Table VII, we analyze the probability that a household owning a risky asset j at date t has fully disposed of it by the end of year t+1. The regression distinguishes between stocksandfunds,andbetweenassetswithpositivereturns(win- ners) and negative returns (losers) during the year. We include householddemographicandfinancialcharacteristics,andportfo- lio characteristics, both directly and interacted with the return on the asset during the year.6 The table reports the coefficients onthecharacteristicsinteractedwithreturnbutomitsthedirect coefficients;thefullregressionisreportedintheAppendix. The probability of fully selling an asset increases with the absolute value of its performance during the year. Households are more likely to fully sell extreme losers or extreme winners thanstocksandfundsthathaveclosetozeroreturns.Forstocks, this effect is much more pronounced for winners than for losers, which seems consistent with a disposition effect on direct stock- holdings.Forfunds,performancealsoimpactstheprobabilityofa fullsale,butthereissubstantiallylessasymmetrybetweenlosers andwinners.Thetendencytoselllosingfundsisconsistentwith theliteratureonperformancesensitivity.Forwinningfunds,how- ever,householdbehaviorisbothdrivenbythetendencytoholdon towinners,forinstancebecausetheyarerunbyskilledmanagers, butalsoatendencytosellwinningassetsinordertorebalancethe riskyportfolio.Theconnectionbetweenassettradesandportfolio rebalancingwillbefurtherinvestigatedinSectionVI. Financialandportfoliocharacteristicshaveasubstantialim- pactontheprobabilityofafullsaleofstock.Wealthierhouseholds with riskier overall portfolios and better diversified stock portfo- liosarelesslikelytosellawinningstockbutmorelikelytosella losingstock.Theseeffectsreducetheasymmetrybetweenwinners and losers and therefore weaken the disposition effect on direct 6. InTableVII,weassignavalueofzerotothecharacteristicofanassetclass ifthehouseholdhasnoinvestmentsinthisclass.Asimilarconventionisusedin theremainderofthesection.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 337",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 48,
    "chunk_index": 63,
    "word_count": 263,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 337 (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "winners than for losers, which seems consistent with a disposition effect on direct stock- holdings.Forfunds,performancealsoimpactstheprobabilityofa fullsale,butthereissubstantiallylessasymmetrybetweenlosers andwinners.Thetendencytoselllosingfundsisconsistentwith theliteratureonperformancesensitivity.Forwinningfunds,how- ever,householdbehaviorisbothdrivenbythetendencytoholdon towinners,forinstancebecausetheyarerunbyskilledmanagers, butalsoatendencytosellwinningassetsinordertorebalancethe riskyportfolio.Theconnectionbetweenassettradesandportfolio rebalancingwillbefurtherinvestigatedinSectionVI. Financialandportfoliocharacteristicshaveasubstantialim- pactontheprobabilityofafullsaleofstock.Wealthierhouseholds with riskier overall portfolios and better diversified stock portfo- liosarelesslikelytosellawinningstockbutmorelikelytosella losingstock.Theseeffectsreducetheasymmetrybetweenwinners and losers and therefore weaken the disposition effect on direct 6. InTableVII,weassignavalueofzerotothecharacteristicofanassetclass ifthehouseholdhasnoinvestmentsinthisclass.Asimilarconventionisusedin theremainderofthesection.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 337",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 64,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 337 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "sdnuF skcotS sresoL srenniW sresoL srenniW tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE 07.31 463.0 78.8 953.0 00.7 211.0 08.64 829.0 j tessafossol/niaG ssol/niaghtiwdetcaretniscitsiretcarahcoiloftroP 77.1− 061.0− 89.1− 023.0− 48.0− 350.0− 21.4− 493.0− erahsyksirlaitinI 94.2 746.0 31.0 160.0 88.1 142.0 31.4− 656.0− oiloftropyksirfonoitaiveddradnatS 28.1− 182.1− 14.1− 307.1− 82.4 686.1 04.3− 096.1− oitareprahSfotnenopmockcotS 76.0 783.0 64.1− 694.1− 23.2 248.0 87.0 953.0 oitareprahSfotnenopmocdnuF ssol/niaghtiwdetcaretniscitsiretcarahclaicnaniF 84.2− 660.0− 13.0− 810.0− 38.2− 420.0− 25.0− 700.0− emocnielbasopsiD 70.0 400.0 91.1 750.0 56.1− 820.0− 91.0 300.0 emocni/aimerpnoisnepetavirP 16.4 941.0 78.1 690.0 90.4 270.0 55.3− 380.0− htlaewlaicnanfigoL 05.0 210.0 27.0− 920.0− 14.0− 700.0− 08.1− 830.0− htlaewetatselaergoL 96.0− 120.0− 03.0− 510.0− 75.2 640.0 21.4− 490.0− ytilibaillatotgoL 91.2 702.0 16.0 101.0 61.0 900.0 38.0− 060.0− ymmudtnemeriteR 30.0 300.0 11.0 610.0 43.0− 020.0− 20.1 960.0 ymmudtnemyolpmenU 82.2 062.0 76.0− 121.0− 02.0 310.0 93.0 030.0 ymmudruenerpertnE 72.1− 491.0− 53.2− 375.0− 15.0 550.0 31.1 841.0 ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "TESSANAGNILLESYLLUFFOYTILIBABORP",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 48,
    "chunk_index": 65,
    "word_count": 143,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "TESSANAGNILLESYLLUFFOYTILIBABORP (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "14.0− 700.0− 08.1− 830.0− htlaewetatselaergoL 96.0− 120.0− 03.0− 510.0− 75.2 640.0 21.4− 490.0− ytilibaillatotgoL 91.2 702.0 16.0 101.0 61.0 900.0 38.0− 060.0− ymmudtnemeriteR 30.0 300.0 11.0 610.0 43.0− 020.0− 20.1 960.0 ymmudtnemyolpmenU 82.2 062.0 76.0− 121.0− 02.0 310.0 93.0 030.0 ymmudruenerpertnE 72.1− 491.0− 53.2− 375.0− 15.0 550.0 31.1 841.0 ymmudtnedutS",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 339",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 66,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 339 (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "sdnuF skcotS sresoL srenniW sresoL srenniW tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE ssol/niaghtiwdetcaretniscitsiretcarahccihpargomeD 53.5 410.0 79.1− 800.0− 16.1 200.0 53.5 010.0 egA 22.2− 540.0− 57.1 450.0 12.0 300.0 23.0 500.0 ezisdlohesuoH 14.2− 161.0− 72.1− 741.0− 49.0 440.0 32.0− 410.0− ymmudloohcshgiH 75.0− 920.0− 41.1− 690.0− 35.1− 840.0− 63.0 610.0 ymmudloohcshgih-tsoP 15.1− 861.0− 34.0− 990.0− 75.1 621.0 93.0 040.0 atadnoitacudeelbaliavanurofymmuD 34.1− 501.0− 83.0 240.0 22.0 010.0 47.1− 611.0− ymmudnoitargimmI lortnocdetcaretninoN 04.75− 748.0− 02.93− 618.0− oiloftropyksirnij tessafoerahS 956,874 326,76 322,582 551,931 snoitavresboforebmuN fi)resol(renniwasaytirucesayfissalcdnasdnufdnaskcotsneewtebhsiugnitsideW.tessanasllesyllufdlohesuohatahtnoissergertiborpdeloopastroperelbatsihT.setoN erahs,jtessafossol/niag,)detropernu(stceffedexfiylraey:selbairavyrotanalpxefotesgniwollofehtsedulcninoissergerhcaE.raeyehtgnirudnruter)evitagen(evitisopasdleiyti ecnamrofreps’tessaehtfoeulavetulosbaehtsij tessafossol/niagehT.scitsiretcarahcdetcaretnidna,)detropernu(scitsiretcarahcdetcaretninon,oiloftropyksirehtnij tessafo owtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.sraeyeerhtsuoiverpehtrevodegarevasiemocnielbasopsiddna,raeyehtgnirud llA.ecnamrofrephtiwdetcaretnitonsitahtrossergerenola-dnatsasioiloftropyksirehtnijtessafoerahsehT.elbaliavasiymmudnoitargimmiehthcihwrofdnasraeyevitucesnoc erascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevahotdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahc .dlohesuohybderetsulcdnatsuborerasrorredradnatS.stinularutanni",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": ")DEUNITNOC(",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 48,
    "chunk_index": 67,
    "word_count": 90,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": ")DEUNITNOC( (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "410.0− ymmudloohcshgiH 75.0− 920.0− 41.1− 690.0− 35.1− 840.0− 63.0 610.0 ymmudloohcshgih-tsoP 15.1− 861.0− 34.0− 990.0− 75.1 621.0 93.0 040.0 atadnoitacudeelbaliavanurofymmuD 34.1− 501.0− 83.0 240.0 22.0 010.0 47.1− 611.0− ymmudnoitargimmI lortnocdetcaretninoN 04.75− 748.0− 02.93− 618.0− oiloftropyksirnij tessafoerahS 956,874 326,76 322,582 551,931 snoitavresboforebmuN fi)resol(renniwasaytirucesayfissalcdnasdnufdnaskcotsneewtebhsiugnitsideW.tessanasllesyllufdlohesuohatahtnoissergertiborpdeloopastroperelbatsihT.setoN erahs,jtessafossol/niag,)detropernu(stceffedexfiylraey:selbairavyrotanalpxefotesgniwollofehtsedulcninoissergerhcaE.raeyehtgnirudnruter)evitagen(evitisopasdleiyti ecnamrofreps’tessaehtfoeulavetulosbaehtsij tessafossol/niagehT.scitsiretcarahcdetcaretnidna,)detropernu(scitsiretcarahcdetcaretninon,oiloftropyksirehtnij tessafo owtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.sraeyeerhtsuoiverpehtrevodegarevasiemocnielbasopsiddna,raeyehtgnirud llA.ecnamrofrephtiwdetcaretnitonsitahtrossergerenola-dnatsasioiloftropyksirehtnijtessafoerahsehT.elbaliavasiymmudnoitargimmiehthcihwrofdnasraeyevitucesnoc erascitsiretcarahcoiloftroP.noitcesssorchcaeninoitaiveddradnatstinuevahotdezilamronerascitsiretcarahclaicnanfisuounitnocdna,raeyybraeydenaemederascitsiretcarahc .dlohesuohybderetsulcdnatsuborerasrorredradnatS.stinularutanni",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "340 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 68,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "340 QUARTERLYJOURNALOFECONOMICS (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "stockholdings. Losing funds are also more likely to be sold by wealthier households, but we otherwise find little significance of characteristicsintheregressionsthatpredictfullsalesofmutual funds. Overall, the table reveals that more sophisticated and ag- gressivehouseholds,withlargerportfoliosofdirectlyheldstocks, appeartobelesspronetothedispositioneffect. Partial Sales, Continued Holdings, and Partial Purchases. Wehaveshowninprevioussectionsthathouseholdsfightidiosyn- cratic passive variations in the risky share. We now investigate whether they also rebalance individual security positions in the riskyportfolio.Theanalysisexcludesfullsales,butconsiderspar- tial sales, continued holdings, and partial purchases. In the Ap- pendix, we check that the evidence of asset-level rebalancing is evenstrongerwhenweincludefullsales. For each household h, we define w∗ as the share of asset h,j,t j in the risky (not the complete) portfolio at the end of period t, r h,t+1 asthenetreturnontheriskyportfoliobetweent andt+1, and r j,t+1 as the net return on asset j. If the household does not trade risky assets in the next period, the asset’s passive share at theendoft+1is w∗p =w∗ 1+r j,t+1. h,j,t+1 h,j,t1+r h,t+1 Let A∗ =w∗ −w∗p and P∗ =w∗p −w∗ de- h,j,t+1 h,j,t+1 h,j,t+1 h,j,t+1 h,j,t+1 h,j,t note the corresponding active and passive changes in levels, and a∗ and p∗ theirequivalentsinlogs. h,j,t+1 h,j,t+1 We estimate a rebalancing model for individual assets. In Table VIII, we report the pooled and yearly regressions of the log active change a∗ on the initial share and the log passive h,j,t+1 change p∗ ,bothforstocks(PanelA)andfunds(PanelB).The h,j,t+1 rebalancing coefficient is only slightly more negative for stocks thanforfunds,andapproximatelyequaltoone-sixth.Thus,when we focus on partial sales, the rebalancing coefficient is roughly constantacrossfundsandstocks.IntheAppendix,wereportthe rebalancing regressions in levels and also find evidence of active rebalancingattheassetlevel.Therebalancingcoefficientsinlev- elsaresomewhatlargerinabsolutevaluebutalsomorevariable acrossregressions. The interpretation of Table VIII is complicated by the ambiguous predictions of financial theory. In a mean-variance",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "340 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 48,
    "chunk_index": 69,
    "word_count": 267,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "340 QUARTERLYJOURNALOFECONOMICS (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "coefficient is only slightly more negative for stocks thanforfunds,andapproximatelyequaltoone-sixth.Thus,when we focus on partial sales, the rebalancing coefficient is roughly constantacrossfundsandstocks.IntheAppendix,wereportthe rebalancing regressions in levels and also find evidence of active rebalancingattheassetlevel.Therebalancingcoefficientsinlev- elsaresomewhatlargerinabsolutevaluebutalsomorevariable acrossregressions. The interpretation of Table VIII is complicated by the ambiguous predictions of financial theory. In a mean-variance",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "340 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "340 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "2002 1002 0002 sraeyllA tats-t etamitsE tats-t etamitsE tats-t etamitsE tats-t etamitsE skcotS.A 07.65− 022.0− 02.23− 261.0− 78.9− 960.0− 01.16− 971.0− sgolnij kcotsfoegnahcevissaP 07.61− 320.0− 04.62− 140.0− 06.43− 850.0− 01.64− 830.0− j kcotsfoerahsyksirlaitinigoL 02.51− 860.0− 07.52− 721.0− 06.44− 172.0− tpecretnI 01.94− 402.0− ymmud0002 06.53− 811.0− ymmud1002 00.63− 711.0− ymmud2002 475,631 967,621 159,09 492,453 snoitavresboforebmuN 60.0 40.0 30.0 50.0 2RdetsujdA sdnuflautuM.B 06.81− 261.0− 05.11− 351.0− 04.01− 981.0− 07.22− 561.0− sgolnij dnuffoegnahcevissaP 01.94− 260.0− 00.17− 401.0− 05.46− 901.0− 09.39− 190.0− j dnuffoerahsyksirlaitinigoL 05.05− 621.0− 08.66− 381.0− 07.28− 862.0− tpecretnI 06.59− 032.0− ymmud0002 04.96− 551.0− ymmud1002 09.38− 191.0− ymmud2002 088,471 296,571 039,741 205,894 snoitavresboforebmuN 40.0 80.0 80.0 70.0 2RdetsujdA rofdna)AlenaP(skcotsrofhtob,oiloftropyksirehtnierahslaitinidnaegnahcevissaps’tessaehtnosgolniegnahcevitcas’jtessafonoissergerehtstroperelbatsihT.setoN gninnigebehttallatadlehtoneratahtseitirucesfosesahcrupdnaselasllufedulcxetub,sesahcruplaitrapdna,sgnidlohdeunitnoc,selaslaitrapedulcnieW.)BlenaP(sdnuflautum .dlohesuohybderetsulcdnatsuborerasrorredradnatS.sraeyevitucesnocowtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.doirepehtfo",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "OILOFTROPYKSIREHTNIEGNAHCEVITCALEVEL-TESSA",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 48,
    "chunk_index": 71,
    "word_count": 109,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "OILOFTROPYKSIREHTNIEGNAHCEVITCALEVEL-TESSA (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "sdnuflautuM.B 06.81− 261.0− 05.11− 351.0− 04.01− 981.0− 07.22− 561.0− sgolnij dnuffoegnahcevissaP 01.94− 260.0− 00.17− 401.0− 05.46− 901.0− 09.39− 190.0− j dnuffoerahsyksirlaitinigoL 05.05− 621.0− 08.66− 381.0− 07.28− 862.0− tpecretnI 06.59− 032.0− ymmud0002 04.96− 551.0− ymmud1002 09.38− 191.0− ymmud2002 088,471 296,571 039,741 205,894 snoitavresboforebmuN 40.0 80.0 80.0 70.0 2RdetsujdA rofdna)AlenaP(skcotsrofhtob,oiloftropyksirehtnierahslaitinidnaegnahcevissaps’tessaehtnosgolniegnahcevitcas’jtessafonoissergerehtstroperelbatsihT.setoN gninnigebehttallatadlehtoneratahtseitirucesfosesahcrupdnaselasllufedulcxetub,sesahcruplaitrapdna,sgnidlohdeunitnoc,selaslaitrapedulcnieW.)BlenaP(sdnuflautum .dlohesuohybderetsulcdnatsuborerasrorredradnatS.sraeyevitucesnocowtfodneehttastekramtessayksirnietapicitraptahtsdlohesuohnodesabsinoitamitseehT.doirepehtfo portfolio choice problem with constant investment opportuni- ties, the optimal weights of individual assets in the risky port- folioaretime-invariant,whichimpliescompleterebalancingwith a∗ =−p∗ ; but partial rebalancing might be justified by h,j,t+1 h,j,t+1 a variety of factors such as changes in risk and return expec- tations,taxes,transactions costs,orBayesianupdatingofbeliefs aboutmutualfundmanagement.IntheAppendix,weaskhowthe propensity to rebalance individual assets varies with household andportfoliocharacteristics,butdonotfindanystrongeffects. Inthissectionwehaveshownthathouseholdsaremuchmore likelytofullysellastockwhenithasperformedwell,andslightly morelikelytosellalosingfund.Thisfindingisconsistentwiththe literatureonthedispositioneffect.Ifahouseholdcontinuestoown astockormutualfund,however,itsbehavioriswelldescribedby a rebalancing model with a rebalancing coefficient of about one- sixth,andtherebalancingpropensityisalmostthesameforstocks andformutualfunds. VI. TRADINGDECISIONSANDRISKYPORTFOLIOREBALANCING We now investigate how rebalancing of the complete portfo- lio, which was documented in Sections III and IV, relates to the dynamics of individual asset holdings discussed in Section V. We focus on the contributions of different asset classes and transac- tiontypestotheoverallactivechangeoftheriskyshare. Theactivechangeoftheriskysharebetweendatestandt+1 canbedecomposedas (cid:4)(cid:2) (cid:3) (7) A h,t+1 = w h,j,t+1 −w h p ,j,t+1 , j wherew h,j,t+1 denotestheshareofasset jinthecompleteportfolio attheendofyeart+1,andwp isthepassiveshareofasset jin h,j,t+1 thecompleteportfolioiftheagentdoesnottradeduringtheyear: wp = w h,j,t (1+r j,t+1 ) . h,j,t+1 w h,t (1+r h,t )+(1−w h,t )(1+r f ) The individual terms on the right-hand side of (7) can be groupedintospecificassetclassesc(fundorstock)andtransaction typesθ (purchaseorsale): (cid:4) A h,t+1 = A h,c,θ,t+1 . c,θ",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "342 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 48,
    "chunk_index": 72,
    "word_count": 231,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "342 QUARTERLYJOURNALOFECONOMICS (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "j wherew h,j,t+1 denotestheshareofasset jinthecompleteportfolio attheendofyeart+1,andwp isthepassiveshareofasset jin h,j,t+1 thecompleteportfolioiftheagentdoesnottradeduringtheyear: wp = w h,j,t (1+r j,t+1 ) . h,j,t+1 w h,t (1+r h,t )+(1−w h,t )(1+r f ) The individual terms on the right-hand side of (7) can be groupedintospecificassetclassesc(fundorstock)andtransaction typesθ (purchaseorsale): (cid:4) A h,t+1 = A h,c,θ,t+1 . c,θ",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 73,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343 (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "-0.045 0.001 Partialpurchases -6.9 Purchases Rebalancing -0.581 STOCKS - - 0 2 . 7 3 . 4 5 9 Sales - 0 3 0 . 2 . 3 1 .2 50 F F P u u a l l r l l ti s p a a u l l r s e c a s h le a s ses - - 0 - - 0 0 . 4 1 3 0 . . . 0 1 2 0 2 4 . . 9 5 3 2 6 1 9 \"D o t/> coefficient -29.6 FUNDS - - 0 1 . 3 2 . 3 1 1 Purchases - - 0 1 . 6 2 .7 54 F P u a l r l ti p a u l r p c u h r a c s h e a s ses - - - - 0 0 0 - 1 . . . 1 8 2 0 0 . . 5 4 3 1 7 0 2 4 > o o 3 Sales 0.023 Partialsales -3.7 1.8 Fullsales 0.055 5.3 Purchases -0.304 Partialpurchases - - 0 4 .1 5. 4 3 3 -0.334 -49.2 Fullpurchases - - 0 3 . 0 1 . 6 0 0 STOCKS -54.4 0.009 w Sales -0.030 Partialsales 3.2 o -5.8 Fullsales -0.039 R c e o b e a f l f a ic n i c e i n n t g - - 0 5 .5 3. 0 1 4 FUNDS - - 0 1 . 9 1 . 7 9 0 Purchases - - 0 1 . 7 1 .2 27 F P u a l r l ti p a u l r p c u h r a c s h e a s ses - - - - - 0 0 0 - 1 1 . . . 8 0 2 0 0 0 . . . 7 5 7 3 9 3 1 6 4 =c > o 3 O 5 Sales -0.043 Partialsales -7.9 -6.7 Fullsales -0.009 -1.9 FIGUREIV ContributionofSalesandPurchasestoPortfolioRebalancing Notes.Thefiguredecomposestheportfoliorebalancingcoefficientintoitsvar- iouscomponents:(partialorfull)purchasesorsalesofstocksandfundsbylucky andunluckyhouseholds.Foreachtransactiontypeandhouseholdgroup,wereport therebalancingcoefficientandt-statisticofthecorrespondingrebalancingregres- sioninlevels,withyearlyfixedeffectsandtheriskyshareincludedascontrols.A householdisdefinedaslucky(unlucky)ifthepassivereturnonitsriskyportfolio duringtheyearishigher(lower)thanthecross-sectionalaverage. We can also distinguish between partial sales, full sales, partial purchases (assets already held by the household), and full pur- chases(newtypesofassets). Each component of the active change A h,c,θ,t+1 can be re- gressed on the passive change of the risky portfolio P h,t+1 , the demeanedinitialriskysharew h,t −w¯ h,t ,andatime-dependentin- tercept. The corresponding rebalancing co(cid:1)efficients γ 1,c,θ,t+1 add up to the overall rebalancing coefficient: c,θ γ 1,c,θ,t+1 =γ 1 . This decompositionallowsustoidentifyhowvariousassetclassesand transactiontypescontributetoportfoliorebalancing. Given our findings in Section V on the disposition effect, it is also useful to distinguish between transactions carried out by lucky and unlucky households. Specifically, a household is classi- fiedasluckyifthereturnonitsriskyportfolioexceedsthepopu- lation average during the same year. In Figure IV, we report the",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 48,
    "chunk_index": 74,
    "word_count": 470,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343 (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "1,c,θ,t+1 =γ 1 . This decompositionallowsustoidentifyhowvariousassetclassesand transactiontypescontributetoportfoliorebalancing. Given our findings in Section V on the disposition effect, it is also useful to distinguish between transactions carried out by lucky and unlucky households. Specifically, a household is classi- fiedasluckyifthereturnonitsriskyportfolioexceedsthepopu- lation average during the same year. In Figure IV, we report the",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 75,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 343 (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "rebalancing coefficients γ 1,c,θ,t+1 and their t-statistics, and refer the reader to the Appendix for the full regression results. Lucky and unlucky households both have a rebalancing coefficient of about −0.5, which is slightly larger in absolute value for lucky households.Stocksandfundsplayanimportantroleinrebalanc- ingforbothgroupsofinvestors.Wehaveverifiedthatourresults are almost identical when themedian return is used as an alter- nativecutoff,orwhenweconsiderhouseholdsinthetopthirdand bottomthirdofriskyportfolioperformance. When we disaggregate sales and purchases, however, we do seeimportantdifferencesbetweenluckyandunluckyhouseholds. Lucky households rebalance primarily by adjusting their stock sales and fund purchases. The rebalancing coefficient of −0.58 is almost entirely explained by the coefficients of full sales (−0.29) and partial purchases (−0.24). That is, lucky households, which needtoreducetheirholdingsofriskyassets,achievethisobjective by fully selling more stocks and buying less mutual funds than theywouldotherwise. Unluckyhouseholds,ontheotherhand,mainlyrebalanceby adjusting their purchases of new assets. The rebalancing coef- ficient (equal to −0.50) is primarily driven by stock purchases (−0.30) and fund purchases (−0.13). The impact of asset sales is marginal. Householdsthusprimarilyrebalancebyincreasingtheir(full) stock sales and reducing their fund purchases when they are lucky, and increasing their purchases of risky assets (primarily stocks) when they are unlucky. These common strategies mini- mize transaction costs. The exception is the full sale of stocks by lucky households, which may be caused by the disposition effect. In the Appendix, we investigate how these common rebal- ancingstrategiesareinfluencedbyhouseholdcharacteristics.We find that wealthier households with more diversified portfolios tendtorebalancemorestronglythroughpurchasesofriskyassets butlessthroughstocksales.Thus,itappearsthatmoresophisti- catedhouseholdsarelesspronetothedispositioneffectandmake greater use of rebalancing strategies that minimize transaction costs. In addition, we find possible substitution effects between purchasing strategies. Households with substantial and diversi- fiedportfoliosoffundsrebalancemorestronglythroughfundpur- chasesandlessthroughstockpurchases.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "344 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 44,
    "page_range": "p.44",
    "total_pages": 48,
    "chunk_index": 76,
    "word_count": 245,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "344 QUARTERLYJOURNALOFECONOMICS (p.44)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "the disposition effect. In the Appendix, we investigate how these common rebal- ancingstrategiesareinfluencedbyhouseholdcharacteristics.We find that wealthier households with more diversified portfolios tendtorebalancemorestronglythroughpurchasesofriskyassets butlessthroughstocksales.Thus,itappearsthatmoresophisti- catedhouseholdsarelesspronetothedispositioneffectandmake greater use of rebalancing strategies that minimize transaction costs. In addition, we find possible substitution effects between purchasing strategies. Households with substantial and diversi- fiedportfoliosoffundsrebalancemorestronglythroughfundpur- chasesandlessthroughstockpurchases.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 345",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 48,
    "chunk_index": 77,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 345 (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "The burgeoning field of household finance asks how house- holds manage their financial affairs, and whether they act in a way that is consistent with the normative literature on portfolio choice.Ourpreviouspaper(CCS2007)studiedhouseholddiversi- ficationatapointintime,whereasthispaperlooksatchangesin householdbehaviorovertime,specificallydecisionstoscaleupor downtheshareofriskyassetsinthetotalportfolio,toenterorexit riskyfinancialmarkets,tofullysellindividualriskyassets,andto scale up or down the share of individual assets in the risky port- folio. These decisions are important in themselves and are also particularly revealing because households rarely delegate these decisionstofinancialintermediaries. Althoughotherpapershavelookedatthedynamicsofhouse- holdrisktaking,ourdatasetgivesustheuniqueabilitytorelate householddecisionstothepropertiesoftheinitialportfolio.When studyingmovementsintheriskyassetshare,wefindthathouse- holds overall have a surprisingly large propensity to rebalance, offsetting about half the passive changes in the risky share with activechanges. Wecanidentifythepropensitytorebalance,distinguishingit frommean-reversionintheriskyshareandaggregateshiftsinthe desiredriskyshare,becausehouseholdshaveheterogeneousport- folioswhichgeneratecross-sectionalvariationinpassivechanges intheriskyshare.Thisimpliesthathouseholdscanrebalanceac- tively even in a closed economy general equilibrium; households withlowerthanaveragereturnscanbuystocksfromhouseholds with higher than average returns. The microeconomic nature of ourresultsmeansthatwehavelittletosayaboutrebalancingby theSwedishhouseholdsectorasawholeinresponsetoaggregate shocks, but such rebalancing appears to be quite limited in our shortdataset. We develop an adjustment model with different target risky sharesacrosshouseholds.Wefindthatmoreeducatedandwealth- ierhouseholds,holdingbetterdiversifiedportfolios,tendtorebal- ancemoreactively.Wealthierhouseholdsalsoreducedtheirtarget riskyshareslessduringthebearmarketoftheearly2000s. Some financial theories imply that as a household becomes richer,itstargetriskyshareshouldincrease.Thiswillbethecase, for example, if households have declining risk aversion, follow portfolio insurance policies, or derive utility from consumption",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "VII. CONCLUSIONS",
    "page_number": 45,
    "page_range": "p.45",
    "total_pages": 48,
    "chunk_index": 78,
    "word_count": 169,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "VII. CONCLUSIONS (p.45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "such rebalancing appears to be quite limited in our shortdataset. We develop an adjustment model with different target risky sharesacrosshouseholds.Wefindthatmoreeducatedandwealth- ierhouseholds,holdingbetterdiversifiedportfolios,tendtorebal- ancemoreactively.Wealthierhouseholdsalsoreducedtheirtarget riskyshareslessduringthebearmarketoftheearly2000s. Some financial theories imply that as a household becomes richer,itstargetriskyshareshouldincrease.Thiswillbethecase, for example, if households have declining risk aversion, follow portfolio insurance policies, or derive utility from consumption that is surplus to a slowly evolving habit level. We find evidence consistent with this view once we control for sluggish portfolio adjustment. Our results on decisions to exit risky financial markets and to fully sell individual risky positions are intriguingly consistent withpreviousresearchonthedispositioneffectamongstockhold- ersandperformancesensitivityamongmutualfundinvestors.We find that high returns on directly held stock portfolios strongly increasetheprobabilitythathouseholdswillexitdirectstockhold- ing,whereasthiseffectisalmostabsentformutualfundportfolios. Atthelevelofindividualassets,ahouseholdisconsiderablymore likelytofullysellastockduringayearifitisa“winner”thathas performed well during the year, but this tendency is again much weaker for mutual funds. One possible explanation for these patternsisthatindividualinvestorsbuystocksthattheyperceive to be undervalued and maintain fixed beliefs about fundamental value in the face of market price movements; but they buy mutual funds that they perceive to be well managed and update their beliefs about manager skill in response to mutual fund performance. Theseasymmetriesbetweenwinnersandlosers,andbetween stocks and mutual funds, disappear when households adjust the shares of individual risky assets within their risky portfolios, withoutfullysellingthem.Rebalancingforassetsthathouseholds continuetoownisclosetosymmetric,anditactivelyoffsetsabout one-sixthofthepassivechangesinindividualassetsharescaused byindividualassetperformance. We ask how households use partial and full sales and pur- chases of stocks and mutual funds to alter their overall risky shares. We find that households primarily rebalance by increas- ing their full sales of stock and reducing their fund purchases when they have higher than average portfolio returns, and by increasing their purchases of risky assets when they have lower thanaveragereturns. Finally,weexaminehowhouseholdcharacteristicsaffectde- cisionstotradeindividualassets.Wefindthatwealthyinvestors with high risky shares and diversified portfolios of individual stocks are less likely to fully sell winning stocks and more likely tofullyselllosingstocks.DharandZhu(2006)havedocumenteda similarpatternforU.S.investorswithhighself-reportedincome. Anymodelofthedispositioneffectmustexplainthisfindingthat itisnotuniformacrossthepopulation.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "346 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 48,
    "chunk_index": 79,
    "word_count": 284,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "346 QUARTERLYJOURNALOFECONOMICS (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "fund purchases when they have higher than average portfolio returns, and by increasing their purchases of risky assets when they have lower thanaveragereturns. Finally,weexaminehowhouseholdcharacteristicsaffectde- cisionstotradeindividualassets.Wefindthatwealthyinvestors with high risky shares and diversified portfolios of individual stocks are less likely to fully sell winning stocks and more likely tofullyselllosingstocks.DharandZhu(2006)havedocumenteda similarpatternforU.S.investorswithhighself-reportedincome. Anymodelofthedispositioneffectmustexplainthisfindingthat itisnotuniformacrossthepopulation.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "346 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 48,
    "chunk_index": 80,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "346 QUARTERLYJOURNALOFECONOMICS (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Many papers in the household finance literature, including Campbell (2006) and CCS 2007, have reported that educated, better-off households conform more closely to the predictions of standard finance theory. Rebalancing behavior and decisions to fully sell stock positions are two more examples of this phe- nomenon. HECPARISANDNATIONALBUREAUOFECONOMICRESEARCH HARVARDUNIVERSITYANDNATIONALBUREAUOFECONOMICRESEARCH STOCKHOLMSCHOOLOFECONOMICS REFERENCES Agnew,J.,P.Balduzzi,andA.Sunden,“PortfolioChoiceandTradinginaLarge 401(k)Plan,”AmericanEconomicReview,93(2003),193–215. Ameriks, John, and Stephen Zeldes, “How Do Household Portfolio Shares Vary withAge?”WorkingPaper,ColumbiaUniversity,2004. Barber,BradM.,andTerranceOdean,“TradingisHazardoustoyourWealth:The CommonStockInvestmentPerformanceofIndividualInvestors,”Journalof Finance,55(2000),773–806. Bilias,Yannis,DimitrisGeorgarakos,andMichaelHaliassos,“PortfolioInertiaand StockMarketFluctuations,”WorkingPaper,AthensUniversityofEconomics andBusinessandGoetheUniversityFrankfurt,2008. Brennan, Michael, and Eduardo Schwartz, “Time Invariant Portfolio Insurance Strategies,”JournalofFinance,43(1988),283–299. Brunnermeier, Markus, and Stefan Nagel, “Do Wealth Fluctuations Generate Time-Varying Risk Aversion? Micro-evidence on Individuals’ Asset Alloca- tion,”AmericanEconomicReview,98(2008),713–736. Calvet,LaurentE.,JohnY.Campbell,andPaoloSodini,“DownorOut:Assessing the Welfare Costs of Household Investment Mistakes,” Journal of Political Economy,115(2007),707–747. Calvet,LaurentE.,Mart´ınGonzalez-Eiras,andPaoloSodini,“FinancialInnova- tion,MarketParticipationandAssetPrices,”JournalofFinancialandQuan- titativeAnalysis,39(2004),431–459. Campbell, John Y., “Household Finance,” Journal of Finance, 61 (2006), 1553– 1604. Campbell,JohnY.,andJohnCochrane,“ByForceofHabit:AConsumptionBased ExplanationofAggregateStockMarketBehavior,”JournalofPoliticalEcon- omy,107(1999),205–251. Carroll,ChristopherD.,“WhyDotheRichSaveSoMuch?”inDoesAtlasShrug? TheEconomicConsequencesofTaxingtheRich,J.B.Slemrod,ed.(Cambridge, MA:HarvardUniversityPress,2000). ——,“PortfoliosoftheRich,”inHouseholdPortfolios,LuigiGuiso,MichaelHalias- sos,andTullioJappelli,eds.(Cambridge,MA:MITPress,2002). Chevalier,Judith,andGlennEllison,“RiskTakingbyMutualFundsasaResponse toIncentives,”JournalofPoliticalEconomy,105(1997),1167–2000. Choi,JamesJ.,DavidLaibson,BrigitteMadrian,andAndrewMetrick,“Defined Contribution Pensions: Plan Rules, Participant Decisions, and the Path of LeastResistance,”inTaxPolicyandtheEconomy16,JamesM.Poterba,ed. (Cambridge,MA:MITPress,2002). ——,“ForBetterorforWorse:DefaultEffectsand401(k)SavingsBehavior,”inPer- spectivesontheEconomicsofAging,DavidWise,ed.(Chicago,IL:University ofChicagoPress,2004). Constantinides,GeorgeM.,“HabitFormation:AResolutionoftheEquityPremium Puzzle,”JournalofPoliticalEconomy,98(1990),519–543.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 347",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 48,
    "chunk_index": 81,
    "word_count": 153,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "PORTFOLIOREBALANCINGBYINDIVIDUALINVESTORS 347 (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  },
  {
    "text": "Household Investment Mistakes,” Journal of Political Economy,115(2007),707–747. Calvet,LaurentE.,Mart´ınGonzalez-Eiras,andPaoloSodini,“FinancialInnova- tion,MarketParticipationandAssetPrices,”JournalofFinancialandQuan- titativeAnalysis,39(2004),431–459. Campbell, John Y., “Household Finance,” Journal of Finance, 61 (2006), 1553– 1604. Campbell,JohnY.,andJohnCochrane,“ByForceofHabit:AConsumptionBased ExplanationofAggregateStockMarketBehavior,”JournalofPoliticalEcon- omy,107(1999),205–251. Carroll,ChristopherD.,“WhyDotheRichSaveSoMuch?”inDoesAtlasShrug? TheEconomicConsequencesofTaxingtheRich,J.B.Slemrod,ed.(Cambridge, MA:HarvardUniversityPress,2000). ——,“PortfoliosoftheRich,”inHouseholdPortfolios,LuigiGuiso,MichaelHalias- sos,andTullioJappelli,eds.(Cambridge,MA:MITPress,2002). Chevalier,Judith,andGlennEllison,“RiskTakingbyMutualFundsasaResponse toIncentives,”JournalofPoliticalEconomy,105(1997),1167–2000. Choi,JamesJ.,DavidLaibson,BrigitteMadrian,andAndrewMetrick,“Defined Contribution Pensions: Plan Rules, Participant Decisions, and the Path of LeastResistance,”inTaxPolicyandtheEconomy16,JamesM.Poterba,ed. (Cambridge,MA:MITPress,2002). ——,“ForBetterorforWorse:DefaultEffectsand401(k)SavingsBehavior,”inPer- spectivesontheEconomicsofAging,DavidWise,ed.(Chicago,IL:University ofChicagoPress,2004). Constantinides,GeorgeM.,“HabitFormation:AResolutionoftheEquityPremium Puzzle,”JournalofPoliticalEconomy,98(1990),519–543. Dhar,Ravi,andNingZhu,“UpCloseandPersonal:InvestorSophisticationand theDispositionEffect,”ManagementScience,52(2006),726–740. Dybvig,PhilipH.,“Duesenberry’sRatchetingofConsumption:OptimalDynamic Consumption and Investment Policies Given Intolerance for any Decline in StandardofLiving,”ReviewofEconomicStudies,62(1995),287–313. Frazzini,Andrea,“TheDispositionEffectandUnderreactiontoNews,”Journalof Finance,61(2006),2017–2046. Frazzini,Andrea,andOwenLamont,“DumbMoney:MutualFundFlowsandthe Cross-SectionofStockReturns,”JournalofFinancialEconomics,88(2008), 299–322. Goetzmann, William N., and Massimo Massa, “Disposition Matters: Volume, Volatility,andPriceImpactofaBehavioralBias,”JournalofPortfolioMan- agement,Winter(2008),103–125. Grinblatt, Mark, and Bing Han, “Prospect Theory, Mental Accounting, and Mo- mentum,”JournalofFinancialEconomics,78(2005),311–339. Gruber,Martin,“AnotherPuzzle:TheGrowthinActivelyManagedMutualFunds,” JournalofFinance,51(1996),783–810. Guiso, Luigi, Michael Haliassos, and Tullio Japelli, Household Portfolios (Cam- bridge,MA:MITPress,2002). Hurst, Erik, Ming Ching Luoh, and Frank Stafford, “The Wealth Dynamics of AmericanFamilies,1984–94,”BrookingsPapersonEconomicActivity,1998 (1998),267–329. Ippolito,Richard,“ConsumerReactiontoMeasuresofPoorQuality:Evidencefrom theMutualFundIndustry,”JournalofLawandEconomics,35(1992),45–70. Ivkovic´, Zoran, and Scott Weisbenner, “‘Old’ Money Matters: The Sensitivity of Mutual Fund Redemption Decisions to Past Performance,” Working Paper, UniversityofIllinois,2007. Madrian,BrigitteandDennisShea,“ThePowerofSuggestion:Inertiain401(k) Participation and Savings Behavior,” Quarterly Journal of Economics, 116 (2001),1149–1188. Odean, Terrance, “Are Investors Reluctant to Realize Their Losses?” Journal of Finance,53(1998),1775–1798. ——, “Do Investors Trade Too Much?” American Economic Review, 89 (1999), 1279–1298. Shefrin,Hersh,andMeirStatman,“TheDispositiontoSellWinnersTooEarlyand RideLosersTooLong:TheoryandEvidence,”JournalofFinance,40(1985), 777–782. Sirri,Erik,andPeterTufano,“CostlySearchandMutualFundFlows,”Journalof Finance,53(1998),1589–1622. Tracy,Joseph,andHenrySchneider,“StocksintheHouseholdPortfolio:ALook Backatthe1990s,”CurrentIssuesinEconomicsandFinance,7(2001):4. Vissing-Jorgensen, Annette, “Towards an Explanation of Household Portfolio Choice Heterogeneity: Nonfinancial Income and Participation Cost Struc- tures,”NBERWorkingPaper8884,2002.",
    "title": "QJEC12401 - Campbell.dvi",
    "source_type": "pdf",
    "document_id": "47ad60541180",
    "source_file": "FIGHT OR FLIGHT PORTFOLIO REBALANCING - Calvet, Campbell.pdf",
    "section": "348 QUARTERLYJOURNALOFECONOMICS",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 48,
    "chunk_index": 82,
    "word_count": 201,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "348 QUARTERLYJOURNALOFECONOMICS (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20090209120716Z",
    "duration": null
  }
]