[
  {
    "text": "University of California, Berkeley Rice University University of California, Berkeley and CEPR University of Lausanne, Swiss Finance Institute, and CEPR ∗ Finfluencers Ali Kakhbod Seyed Kazempour Dmitry Livdan UC Berkeley Rice University UC Berkeley, CEPR Norman Schu¨rhoff University of Lausanne, SFI, CEPR April 25, 2023 ∗ We thank Bloomberg and StockTwits for providing the data. Ali Kakhbod is with the Walter A. Haas School of Business, University of California, Berkeley, Berkeley CA 94720. fax: (510) 643-1412; e-mail: akakhbod@berkeley.edu. Seyed Kazempour is with the Jesse H. Jones School of Business, Rice University, Houston, TX, 77005. e-mail smkazempour@rice.edu. Dmitry Livdan is with the Walter A. Haas School of Business, University of California, Berkeley, Berkeley CA 94720. fax: (510) 643-1412; e-mail: livdan@haas.berkeley.edu. Livdan is also a Research Fellow of the CEPR and has no conflict of interest to disclose. Norman Schu¨rhoff is with the Faculty of Business and Economics and Swiss Finance Institute, University of Lausanne, CH-1015 Lausanne, Switzerland. Tel.: +41 (21) 692-3447; fax: +41 (21) 692-3435; e-mail: norman.schuerhoff@unil.ch. Schu¨rhoff is also a Research Fellow of the CEPR. He gratefully acknowledges research support from the Swiss Finance Institute and the Swiss National Science Foundation under SNF project #100018 192584, “Sustainable Financial Market Infrastructure: Towards Optimal Design and Regulation” and has no conflict of interest to disclose. EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Document",
    "page_number": 1,
    "page_range": "p.1-2",
    "total_pages": 57,
    "chunk_index": 0,
    "word_count": 218,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Document (p.1-2)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "also a Research Fellow of the CEPR. He gratefully acknowledges research support from the Swiss Finance Institute and the Swiss National Science Foundation under SNF project #100018 192584, “Sustainable Financial Market Infrastructure: Towards Optimal Design and Regulation” and has no conflict of interest to disclose. EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Finfluencers",
    "page_number": 3,
    "page_range": "p.3",
    "total_pages": 57,
    "chunk_index": 1,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Finfluencers (p.3)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Tweet-level data from a social media platform reveals low average accuracy and high dispersion in the quality of advice by financial influencers, or “finfluencers”: 28% of finfluencers are skilled generating 2.6% monthly abnormal returns, 16% are unskilled, and 56% have negative skill (“anti- skill”)generating-2.3%monthlyabnormalreturns. Consistentwithhomophilyshapingfinfluencers’ social networks, antiskilled have more followers and more influence on retail trading than skilled finfluencers. The advice by antiskilled finfluencers creates overly optimistic beliefs most times and persistent swings in followers’ belief bias. Consequently, finfluencers cause excessive trading and inefficient prices such that a contrarian strategy yields 1.2% monthly out-of-sample performance. JEL Classification: G12, G14, G41 Key words: Finfluencers, social media, mixture modeling, retail traders, homophily, belief bias EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 3,
    "page_range": "p.3-4",
    "total_pages": 57,
    "chunk_index": 2,
    "word_count": 118,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.3-4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "beliefs most times and persistent swings in followers’ belief bias. Consequently, finfluencers cause excessive trading and inefficient prices such that a contrarian strategy yields 1.2% monthly out-of-sample performance. JEL Classification: G12, G14, G41 Key words: Finfluencers, social media, mixture modeling, retail traders, homophily, belief bias EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Financial influencers, commonly known as finfluencers, are individuals who provide unsolicited investment advice on social media platforms. Many finfluencers have large followings and their rec- ommendations can have a significant impact on the investment decisions made by retail investors. The Securities and Exchange Commission (SEC) has been concerned about finfluencers, particu- larly because most of them provide investment advice or recommendations to the public without being registered as investment advisers or brokers. Under federal securities laws, individuals who provide investment advice for a fee or other compensation must register with the SEC or with a state securities regulator unless they qualify for an exemption. The SEC has taken action against individuals and firms that have violated these registration requirements, including those who have provided investment advice through social media.1 However, despite their growing influence, little is known about the quality of the unsolicited financial advice provided by individual finfluencers, the impact of finfluencers’ advice on their follower base, trading activity, and asset prices.2 This paper assesses the quality of investment advice provided by different finfluencers. Using tweet-level data from StockTwits on over 29,000 finfluencers, we classify each finfluencer into three major groups: Skilled, unskilled, and antiskilled, defined as those with negative skill. We find that 28% of finfluencers provide valuable investment advice that leads to monthly abnormal returns of 2.6% on average, while 16% of them are unskilled. The majority of finfluencers, 56%, are antiskilled and following their investment advice yields monthly abnormal returns of -2.3%. Surprisingly, unskilled and antiskilled finfluencers have more followers, more activity, and more influence on retail trading than skilled finfluencers. To explain the popularity of anti/unskilled finfluencers, we check what strategies the different finfluencer groups pursue, what belief biases their advice induces, and why competition does not drive out anti/unskilled finfluencers. Skill correlates with observable tweeting patterns, suggesting that social media platform users have a preference for anti/unskilled finfluencers. Following the advice by antiskilled finfluencers creates overly optimistic beliefs most times, overly pessimistic beliefs some times, and persistent swings in followers’ belief bias. An investment strategy contrarian to antiskilled finfluencers’ recommendations yields 1.2% monthly out-of-sample performance. These results provide novel evidence on how investors seek financial advice on social media and what role finfluencers play in excessive trading and inefficient prices in financial markets. 1See, e.g., SEC press releases “SEC Obtains Emergency Asset Freeze, Charges California Trader with Posting False Stock Tweets,” March 15, 2021 (sec.gov/news/press-release/2021-46?utm_medium=email&utm_sourc e=govdelivery) and “SEC Charges Eight Social Media Influencers in $100 Million Stock Manipulation Scheme Promoted on Discord and Twitter,” December 14, 2022 (sec.gov/news/press-release/2022-221). 2The SEC (sec.gov/oiea/investor-alerts-and-bulletins/social-media-and-investment-fraud-i nvestor-alert), state regulators (dfpi.ca.gov/2022/10/05/social-media-finfluencers-who-should-you -trust), and industry organizations (nasaa.org/64940/informed-investor-advisory-finfluencers) have issued guidance and warnings to investors about the potential risks of relying on financial advice from finfluencers, particularly when the finfluencers have a financial interest in the products or services they are promoting. The SEC, forinstance,advisesinvestorstobecautiouswhenconsideringinvestmentadvicefromanysourceandtodotheirown researchandduediligencebeforemakinganydecisions. Investorscanalsochecktheregistrationstatusofinvestment advisers and brokers through the SEC’s Investment Adviser Public Disclosure (IAPD) website. 1 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 4,
    "page_range": "p.4",
    "total_pages": 57,
    "chunk_index": 3,
    "word_count": 543,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.4)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "about the potential risks of relying on financial advice from finfluencers, particularly when the finfluencers have a financial interest in the products or services they are promoting. The SEC, forinstance,advisesinvestorstobecautiouswhenconsideringinvestmentadvicefromanysourceandtodotheirown researchandduediligencebeforemakinganydecisions. Investorscanalsochecktheregistrationstatusofinvestment advisers and brokers through the SEC’s Investment Adviser Public Disclosure (IAPD) website. 1 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 57,
    "chunk_index": 4,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "We start our analysis with the assessment of the finfluencers’ quality for which distinguishing between (anti)skill and luck is important. A straightforward approach would be to use user-specific average abnormal returns, α, as a na¨ıve skill measure. The distribution of α (mean signed abnormal (cid:98) (cid:98) returns) shows that a fraction of StockTwits users achieve significant positive alphas, while many others generate significant negative alphas. Therefore, some valuable information appears to be disclosed on StockTwits. However, there is an issue with interpreting these results as influencers being skilled, since the statistical tests have both limited size and power.3 To resolve this issue and be able to distinguish between finfluencer’s true skill and luck, we employ the mixture-modeling approach used by Chen, Cliff, and Zhao (2017), Harvey and Liu (2018), Crane and Crotty (2020), and Dim (2022) with multiple types and non-normal distributions whichallowsustoestimatethedistributionoftrueskills, α, amongallusersonStockTwits. Mixture modeling involves fitting a distribution that is a combination of multiple other distributions, known as components, to a set of data. We allow for three types of StockTwits users: skilled users with positive true skill, α > 0, unskilled users with zero true skill, α = 0, and antiskilled users with negative true skill, α < 0. In our base case, we further assume that the skilled and antiskilled users are distributed according to a mixture of exponential random variables. We use these assumptions to obtain the following distribution for alpha: a combination of a distribution for skilled users with positive true skill, a mass of unskilled users with zero true skill, and a distribution for antiskilled users with negative true skill, all combined with a distribution for capturing luck. Alternative measures of skill can be derived from the mixture-modeling methodology. The first measure is the probability that a user is skilled, Pr(α > 0|α˜ ), which is calculated using the i i convolution of a normal distribution for capturing luck with an exponential distribution and the estimated distribution of true skills, α, for the user. The second measure is the probability that a user is unskilled, Pr(α = 0|α˜ ), and the third measure is the probability that a user is antiskilled, i i Pr(α < 0|α˜ ), which can be calculated in similar ways. The fourth measure is the expected i i value of alpha given its measurement in the data, E[α |α˜ ], which is calculated by integrating out i i the convolution of a normal distribution for capturing luck with an exponential distribution and the estimated distribution of true skills for the user. These skill measures allow us to identify characteristics that predict skill across finfluencers and explore the matching between finfluencers and StockTwits users. Equipped with these measures, we investigate the persistence and determinants of users’ skills. Tostudypersistence, wesplitthesampleintotwohalvesandestimateusers’skillsseparatelyineach half of the data. We find that while the autocorrelation for the estimated alphas is close to zero and insignificant, all four alternative skill measures exhibit significant persistence. For instance, a one 3If we use the t-stat threshold of 1.96, we know that 5% of users will appear with significant α even if the true (cid:98) alpha, α, iszero. Atthesametime, thereareuserswithtrulypositive(negative)alphathatwecannotdetect(t-stat will be less than 1.96). The same problem appears when studying skills in the cross-section of users. While we can measure α for every user and calculate its t-stat, it is unclear how often the null of α=0 is falsely rejected or falsely (cid:98) accepted (type 1 and 2 errors) without accounting for the sample sizes for each user. 2 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 5,
    "page_range": "p.5",
    "total_pages": 57,
    "chunk_index": 5,
    "word_count": 586,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.5)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "of users. While we can measure α for every user and calculate its t-stat, it is unclear how often the null of α=0 is falsely rejected or falsely (cid:98) accepted (type 1 and 2 errors) without accounting for the sample sizes for each user. 2 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 57,
    "chunk_index": 6,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "percent increase in the expected true alpha over the first half of the data predicts a 0.09% increase in the expected true alpha over the second half. We then investigate whether users’ tweeting activity determines their skill. We find that skilled finfluencers are less active than unskilled and antiskilled influencers. Users who tweet more frequently are less skilled in that a ten times increase in the total number of tweets posted by a user is associated with a 3.7% decrease in the probability of being skilled and a 0.08% decline in the monthly expected true alpha. Additionally, the tweet composition correlates with the degree of its informativeness as users posting more negative tweets tend to be more skilled. A one percent increase in the share of negative tweets is associated with a 0.01% increase in the expected true alpha and a 0.06% increase in the probability of being skilled. We then dissect finfluencers’ tweeting strategies, that is when and what they tweet, to check whether they possess unique skills or just follow commonly known investment behaviors including momentum, contrarian, return chasing, and herding.4 We find that skilled finfluencers are return-, social sentiment-, and news-contrarian. They also do not chase returns and do not herd on other users’ tweets.5 Antiskilled finfluencers ride return momentum and social sentiment momentum and are likely to chase returns.6 The existing literature has documented that short-sellers are informed (e.g., Engelberg, Reed, and Ringgenberg, 2012; Boehmer, Jones, and Zhang, 2008). Hence, we might expect users with more negative tweets to be more informed. In addition, asset pricing theory suggests that imposing short-selling constraints leads to overpricing as negative information is not incorporated into prices and, hence, stocks with higher short-selling constraints underperform. We test these hypotheses in our data using Markit’s measure of short-selling constraints for stocks and calculating the average decile of short-selling constraints for the user’s positive and negative tweets separately. The results show that users who tweet negatively about stocks with higher short-selling constraints are indeed more likely to be skilled.7 The observed relation between tweeting activity and our measures of skill suggests social media users can and should use tweeting behavior to identify skilled finfluencers. However, a striking feature of the data is that more skilled finfluencers have fewer followers while less skilled influencers have more followers, with antiskilled finfluencers being the most popular, consistent with skill being effectively ignored (Golub and Jackson, 2012; Berk and Van Binsbergen, 2022; Pedersen, 2022). We uncover that retail investors are influenced differently by different types of StockTwits users. 4We define each user’s return-chasing tendency as the percentage of her tweets that are either positive and about stocks in the highest decile of returns over the prior five trading days, or negative and about stocks in the lowest decile of returns over the prior five trading days. We define each user’s herding tendency as the percentage of her positive tweets that are about stocks in the highest decile of overall positive tweeting volume over the past five days. 5A one percent increase in our measure of return chasing is associated with a 0.08% decrease in the probability of the user being skilled while a one percent increase in our measure of herding tendency is associated with a 0.09% decrease in the probability of being skilled. 6A one percent increase in our measure of return chasing is associated with a 0.16% increase in the probability of the user being antiskilled. 7A one-unit increase in our measure of short-selling constraints among the user’s positive/negative tweets is associatedwitha0.31%decreaseinherexpectedtruealphaanda0.89%decreaseinherprobabilityofbeingskilled. 3 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 6,
    "page_range": "p.6",
    "total_pages": 57,
    "chunk_index": 7,
    "word_count": 594,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.6)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "probability of being skilled. 6A one percent increase in our measure of return chasing is associated with a 0.16% increase in the probability of the user being antiskilled. 7A one-unit increase in our measure of short-selling constraints among the user’s positive/negative tweets is associatedwitha0.31%decreaseinherexpectedtruealphaanda0.89%decreaseinherprobabilityofbeingskilled. 3 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 57,
    "chunk_index": 8,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "The advice by skilled finfluencers has little to no impact on retail order imbalances, computed following the approach in Boehmer, Jones, Zhang, and Zhang (2021). However, the advice by antiskilled finfluencers strongly predicts retail order imbalances, and in a way that they follow the flawed advice leading to negative returns for retail investors. Moreover, in line with retail investors stubbornly following the crowd of antiskilled finfluencers, we find evidence for the “wisdom of the antiskilled crowd” in in-sample and out-of-sample tests. Following the advice by antiskilled finfluencers creates overly optimistic beliefs most of the time sincetheirtweetstendtobebullishaboutmoststocks,andoverlypessimisticbeliefssomeofthetime when their tweets tend to be more pessimistic than the skilled influencers’ tweets. Furthermore, the social media sentiment by antiskilled finfluencers is highly persistent and induces long swings in the magnitude of their followers’ belief bias. More strikingly, one can earn 1.2% monthly out-of-sample buy-and-hold abnormal returns by trading against the antiskilled finfluencers’ advice. When we combine these results with our additional findings that the finfluencers’ skills are persistent but are not sufficient for finfluencers’ survival, we can conclude that on social media platforms “the message is more important than the messenger.” That is as long as there are any antiskilled finfluencers “preaching” their message the investors tend to like their message and are willing to trade on it. Literature review. Our results are important in a number of ways. Berk and Van Binsbergen (2022) provide a theory of the survival of unskilled and antiskilled experts in equilibrium. They show that professionals who provide a service that they do not deliver (charlatans) survive in equilibrium. Our results are consistent with their predictions in that the majority of finfluencers on StockTwits are un/antiskilled, they have even more followers than skilled finfluencers, and retail investors implement their flawed advice. Pedersen (2022) provides a theory showing that in an equilibrium with non-Bayesian updating, stubborn users who do not update their beliefs dominate the market. One way to interpret our results is that they provide the basis for the assumptions in the Pedersen (2022) model which shows what happens in an economy where retail investors are stubborn about the difference between skilled and antiskilled finfluencers. The answer is that in the long run, beliefs will not depend on retail investors. In the short run, however, many dynamics are possible and the model generates a rich set of implications for asset prices. Our paper supports Pedersen (2022) by showing that social media users can identify which source of information is more reliable, but they ignore it. Similar to what Harvey and Liu (2018) find for mutual fund managers, our mixture modeling methodology uncovers informative content on StockTwits despite the average sentiment being neg- atively correlated with future returns. The mixture modeling methodology applied to StockTwits thus uncovers another fact that conventional methods miss: there is information in social media, but one must distinguish the skilled users from others. But unlike mutual fund managers, the money of social media users does not follow the most skilled finfluencers. A large body of literature in both computer science and finance studies the contemporaneous 4 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 7,
    "page_range": "p.7",
    "total_pages": 57,
    "chunk_index": 9,
    "word_count": 517,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.7)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "in social media, but one must distinguish the skilled users from others. But unlike mutual fund managers, the money of social media users does not follow the most skilled finfluencers. A large body of literature in both computer science and finance studies the contemporaneous 4 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 57,
    "chunk_index": 10,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "and predictive content of StockTwits and Twitter sentiment.8 The literature tends to find a con- temporaneous correlation between sentiment and returns but weak predictive power for the average sentiment. For instance, Sprenger et al. (2014) find that Twitter bullishness is associated with same-day returns but do not find any evidence of sentiment predicting returns in the next two days. Groß-Klußmann, Ko¨nig, and Ebner (2019) find that the Twitter sentiment of expert users, defined as those who tweet predominantly about finance, can predict the direction of contempora- neous returns of six US and international index futures (Australia, China, Europe, Japan, and the US) with 66% to 71% average accuracy. However, the predictive power of their sentiment measure drops significantly when looking at future returns. They report that their model rarely beats 51% accuracy for returns over the next two days even though it beats three competitive benchmarks. Ballinari and Behrendt (2021) form equal-weighted long (short) portfolios of stocks in the top (bot- tom) 10% of sentiment score every day and hold the portfolio over the next trading day. They find that both legs show abnormal returns with the correct sign and the difference in their alphas is significant using most algorithms.9 We differ from these studies in that we examine individual users’ ability to predict stock returns and their heterogeneity. Instead of the predictive content of average StockTwits sentiment, we measure prediction skill at the user level and ask how many users can correctly predict stock returns. Consistent with the first group of papers, we find that most users are systematically wrong about future stock returns. However, we find that a sizeable portion of users is skilled at forecasting stock returns, which is consistent with findings in Ballinari and Behrendt (2021). Giannini, Irvine, and Shu (2018) define local users as those located within 100 miles of the company headquarter and show that a one standard deviation increase in the sentiment of nonlocal users’ tweets during a two-week period is associated with an 8.3bps decrease in the cumulative abnormal return in the following week. The higher sentiment of local users is also associated with lower abnormal returns; however, the effect is statistically insignificant and smaller. Given our finding that most StockTwits users are antiskilled, our paper explains why Giannini, Irvine, and Shu (2018) find a negative correlation between average StockTwits sentiment and future stock 8A branch of the literature tests the informativeness of tweets before specific events. Curtis, Richardson, and Schmardebeck (2014) find that the sensitivity of announcement returns to announcement news is higher at times of higher investor attention measured by social media activity, while the post-earnings-announcement drift is only significant for firms with low attention. Azar and Lo (2016) find that a one standard deviation increase in Twitter sentimentisassociatedwith0.62%higherreturnonFOMCmeetingdays. Bartov,Faurel,andMohanram(2018)finds that higher Twitter sentiment in the two-week period before earnings announcements predicts both higher earnings surprises and higher abnormal returns around the announcement. Categorizing tweets into those with original information and those disseminating known information, they find that both have predictive power for earnings surprises and excess returns. Campbell, D’Adduzio, and Moon (2021) find that the sentiment of messages posted on StockTwits after management forward guidance predicts the accuracy and bias of the forecast. When StockTwits usersagreewiththemanagement,theforecasttendstobemoreaccurate. Ontheotherhand,ifStockTwitsusersare more optimistic (pessimistic) than the management, the forecast tends to be downward (upward) biased. Moreover, they find that market reaction to the guidance is larger when StockTwits users agree with the management. 9The discrepancy in results between these studies can be due to differences in their samples (both in time series and the cross-section), their tests (event-time regressions vs. calendar-time portfolio tests), and the holding period. 5 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 8,
    "page_range": "p.8",
    "total_pages": 57,
    "chunk_index": 11,
    "word_count": 610,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.8)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "guidance is larger when StockTwits users agree with the management. 9The discrepancy in results between these studies can be due to differences in their samples (both in time series and the cross-section), their tests (event-time regressions vs. calendar-time portfolio tests), and the holding period. 5 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 57,
    "chunk_index": 12,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "returns. Retail investors have been shown to demonstrate several behavioral biases and traits; examples can be found in Barber and Odean (2007). Cookson, Engelberg, and Mullins (2022) find evidence when separating bulls from bears that social media users follow finfluencers with similar beliefs and, as a result, live in their own bubbles, a phenomenon called information siloing. Social media users then predominantly receive information that confirms their existing beliefs, leading to underper- formance. Consistent with this channel, Cookson, Engelberg, and Mullins (2022) find that more bullish (bearish) StockTwits users earn 1.88% lower (higher) abnormal returns over the week after sentiment observation. By contrast, our methodology measures finfluencers’ skills and differentiates their trading strategies. We show that social media users follow finfluencers with similar behavioral traits. The sociology literature describes this phenomenon as homophily (Lazarsfeld, Merton, et al., 1954; Kandel, 1978; McPherson, Smith-Lovin, and Cook, 2001) which is the tendency of individuals to associate and form relationships with others who are similar to them in characteristics or values. Homophily leads to positive assortative matching and slows down the diffusion of information (Currarini, Jackson, and Pin, 2009; Golub and Jackson, 2012).10 To establish homophily in trading strategies between social media users and finfluencers, we show that social media users can identify skilled finfluencers but that they instead follow the advice of antiskilled finfluencers with similar behavioral traits to their own. Social media users might possess right or wrong beliefs about a stock but still make correct investment decisions so long as they follow skilled finfluencers who tweet correctly about stocks. Our finding of wisdom of the antiskilled crowd and the fact that social media users follow antiskilled finfluencers is thus different from information siloing. The question remains whether they can recognize the skilled finfluencers from the antiskilled ones despite such behavioral biases and decide to follow the right advice. Our findings stand in contrast with some findings for other crowdsourcing platforms for stock prediction. StockTwits and Twitter are not the only platforms where investors share information (Cookson, Lu, et al., 2022). Another literature studies amateur analysts sharing stock tips on the website Seeking Alpha (SA). Chen, De, et al. (2014) find that the sentiment of SA articles positively correlates with future stock returns. Campbell, DeAngelis, and Moon (2019) extend their study by showing that analysts’ disclosure of their positions contributes to the price impact of the article. Farrell et al. (2022) show that when SA articles are published within a trading day, retail trading activity increases relative to immediately before the publication. In contrast to tweets, articles on SA are often long and contain extensive analysis and supporting information. Other papers have 10Incontrasttohomophily, echochambersrefertosituationswhereindividualsareonlyexposedtoinformationor viewpoints that confirm their existing beliefs and opinions and are sheltered from opposing perspectives. This can lead to the reinforcement of existing beliefs and result in limited exposure to diverse ideas and information. While homophily can contribute to the creation of echo chambers, the two concepts are different. Homophily refers to the preference for social connections with individuals with similar traits, while echo chambers refer to the phenomenon of information reinforcement within a particular group or community. 6 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 9,
    "page_range": "p.9",
    "total_pages": 57,
    "chunk_index": 13,
    "word_count": 525,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.9)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "While homophily can contribute to the creation of echo chambers, the two concepts are different. Homophily refers to the preference for social connections with individuals with similar traits, while echo chambers refer to the phenomenon of information reinforcement within a particular group or community. 6 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 57,
    "chunk_index": 14,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "documented similar informativeness of platforms such as ValueInvestorsClub.com, Estimize, and SumZero.com (Crawford, Gray, and Kern, 2017; Crawford, Gray, Johnson, et al., 2018; Jame et al., 2016). Dim (2022) applies a mixture modeling methodology to SA articles. A comparison with our results reveals that whether retail investors benefit from information crowdsourcing depends on the nature of analysis and structure of information on the platform. Dim (2022) finds that approximately56%ofusersonSeekingAlphacanpredictstockreturnscorrectly, whilethisestimate drops to 28% in our sample. Consequently, the sentiment of Seeking Alpha correlates positively with future returns on average, in contrast to StockTwits. On the other hand, if retail investors can identify the skilled finfluencers correctly, they can still benefit from StockTwits despite the prevalence of antiskilled finfluencers. However, we find that retail investors do not privilege good over bad advice and instead follow the flawed advice by antiskilled finfluencers. 1 Data and Estimated Alphas This section describes the data and discusses the measurement of alpha for every StockTwits user. 1.1 Data Data sources. We collect data from several sources. We obtain tweet data from Bloomberg, finfluencer user-level data from StockTwits, stock returns from CRSP, and factor returns from Ken French’s website. In addition, we use Markit data for statistics on short interest and shorting costs, and TAQ to compute retail order imbalances. Our sample period covers July 13, 2013, through January 1, 2017. TheBloombergdatacontainsforeachtweetthetimeofthepost, tweetcontent, stockticker, and user name used to post the tweet. Bloomberg supplies a social sentiment score for each tweet that is based on a proprietary machine learning algorithm, the confidence level of the social sentiment score from 1/3 to 1, a relevance score from 0 to 1, and topic codes. The social sentiment score by user i in stock j for its nth tweet on day t takes discrete values SocSent ∈ {−1,0,1}. Out of i,j,t,n 72 million tweets, 11%/77%/12% are positive/neutral/negative. The Bloomberg data also contains for each news story the time of the release, news headline, stock ticker, and news source. Bloomberg supplies a news sentiment score for each story that is based on a proprietary machine learning algorithm, the confidence level of the news sentiment score from 1/3 to 1, a relevance score from 0 to 1, and topic codes. The news sentiment score in stock j for its nth news on day t takes discrete values NewsSent ∈ {−1,0,1}. Out of 36 million news j,t,n stories, 12%/59%/29% are positive/neutral/negative. We use the StockTwits API to collect user data for each user.11 The StockTwits data contain 11There were a total of 139,401 users as of February 2, 2018, when the data was collected. Since many StockTwits usersareinactive, wepooluserswithtotalactivityonStockTwitsoffewerthan20tweetsorretweets. Sinceauser’s StockTwits history can be longer than our sample period, we have users with fewer than 20 tweets in our sample. 7 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 10,
    "page_range": "p.10",
    "total_pages": 57,
    "chunk_index": 15,
    "word_count": 462,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.10)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "contain 11There were a total of 139,401 users as of February 2, 2018, when the data was collected. Since many StockTwits usersareinactive, wepooluserswithtotalactivityonStockTwitsoffewerthan20tweetsorretweets. Sinceauser’s StockTwits history can be longer than our sample period, we have users with fewer than 20 tweets in our sample. 7 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 57,
    "chunk_index": 16,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "for each user the number of tweets, with a mean of 131.62, a minimum of 1, and a maximum of 615,145, the number of followers, number of other users being followed, number of stocks on the user’s watch list, number of investment ideas, and number of likes by other users as of the time of our download. Matching and cleaning. The user name supplied by Bloomberg is the StockTwits user name displayed on the screen. We match the StockTwits user name supplied by Bloomberg to the corresponding user name in StockTwits. While the user name is unique, the screen name is not. Therefore, the StockTwits screen name coincides in most but not all cases with the StockTwits user name. As a result, some users cannot uniquely be matched from Bloomberg to StockTwits and we pool or, alternatively, eliminate them. The matching of returns and tweets is also important. We apply the following procedure. If a tweet was posted during trading hours, we match it with the same trading day. That is, day t will be the trading day. If a tweet was posted after hours, on holidays, or on weekends, we match it with the next trading day. In other words, day t will be the first trading day after the tweet. That is, we match every tweet with the first trading day closing after it was posted. We aggregate all tweets by user i in stock j on the day t into a single social sentiment score according to:    N (cid:88) i,j,t N (cid:88) i,j,t  SocSent = max −1,min(1, 1(SocSent = 1)− 1(SocSent = −1)) , (1) i,j,t i,j,t,n i,j,t,n   n=1 n=1 where n = 1,...,N is the index of the tweet. The max and min operators are used to normalize i,j,t SocSent to the [−1,1] interval. i,j,t Stock abnormal returns. Abnormalreturnsarecomputedaccordingtothefollowingprocedure. First, we calculate factor exposures β for each stock j on the trading day t by running daily j,t regressions of excess returns on Fama/French factors over the year ending in day t skipping the last month: R −R = α +β′ F +ϵ , for days in [t−252,t−21], (2) j,t f,t j,t j,t t j,t where F is a vector of Fama/French (one, three, or five) factors. Then, equipped with the estimated t factor loadings from the first stage, β(cid:98) , we can calculate future abnormal returns for stock j over j,t horizon H (e.g., 1, 2, 5, 10, or 20 days) using the following equation: AbnRet = R −R −α −β(cid:98) ′ F . (3) j,t+1,t+H j,t+1,t+H f,t+1,t+H (cid:98)j,t j,t t+1,t+H Results are very similar if we estimate (2) and (3) without intercepts α . j,t 8 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 11,
    "page_range": "p.11",
    "total_pages": 57,
    "chunk_index": 17,
    "word_count": 453,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.11)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "H (e.g., 1, 2, 5, 10, or 20 days) using the following equation: AbnRet = R −R −α −β(cid:98) ′ F . (3) j,t+1,t+H j,t+1,t+H f,t+1,t+H (cid:98)j,t j,t t+1,t+H Results are very similar if we estimate (2) and (3) without intercepts α . j,t 8 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 57,
    "chunk_index": 18,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Computing finfluencer-level abnormal returns. We calculate user-specific abnormal returns, α , for each user i over different horizons [t + 1,t + H]. We calculate the mean signed abnormal i return and its standard error for every user in the data by running the univariate regression SocSent ×AbnRet = α +ϵ , (4) i,j,t i,j,t+1,t+H i i,j,t+1,t+H for all N stock-days for which SocSent ̸= 0 and separately for all users i = 1,...,I and multiple i i,j,t values of H.12 Equipped with user-specific abnormal returns α˜ , i = 1,...,I, over horizon H we now i document mean signed returns and their t-stats. 1.2 Estimated alphas across finfluencers Table 1 reports users’ estimated skills (α˜ ) from specification (4) with H = 20 business days. The i average user has a monthly estimated alpha of -0.63% (annualized: -7.56% per year). The median estimated alpha is -0.35% and hence also negative, meaning that most users post systematically anti-informative tweets. These results confirm the findings in previous papers that average social media users are systematically wrong in predicting stock returns (Giannini, Irvine, and Shu, 2018). However, Table 1 shows that the 75th percentile of estimated alpha is 1.86% per month, which is economically large. Table 1 also shows that the standard errors of estimated alphas are large compared to the point estimates. The average (median) standard error is 3.88% (2.61%) monthly. However, despite the relativelylargestandarderrors, someusershavestatisticallysignificantestimatedalphas. Incolumn 3, the 10th percentile of t-statistics is -2.22, while the 90th percentile is 1.66. Panel B shows that the proportion of users for whom the p-value of the estimated alpha is less than 5% (10%) is 19.8% (25.7%). These numbers are larger than what we would expect if all users were uninformed (α = 0). The distribution in Table 1 shows that many StockTwits users achieve significant alphas, with either positive or negative signs. Thus, valuable information appears to be disclosed on StockTwits. However, the issue is that the statistical tests have a size and power. If we use the t-stat threshold of 1.96, we know that 5% of users will appear with significant alpha (mean signed abnormal returns) even if the true alpha is zero. Hence, there are users with truly positive (negative) alpha that we cannot detect when the t-stat is less than 1.96. While we can measure alpha for every user and calculate its t-stat, it is unclear how often the null of α = 0 (i.e., no alpha) is falsely rejected or falsely accepted (type 1 and 2 errors). The next section addresses the type 1 and 2 errors of statistical tests on estimated alphas, α˜ . i 12Alternatively, we have run multivariate regressions for all users i=1,...,I combined and multiple values H: I (cid:88) SocSent ×AbnRet = α ×1(User i=ι)+ϵ . (5) i,j,t i,j,t+1,t+H i i,j,t+1,t+H ι=1 The results for the multivariate regression are very similar to (4). 9 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 12,
    "page_range": "p.12",
    "total_pages": 57,
    "chunk_index": 19,
    "word_count": 485,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.12)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "α˜ . i 12Alternatively, we have run multivariate regressions for all users i=1,...,I combined and multiple values H: I (cid:88) SocSent ×AbnRet = α ×1(User i=ι)+ϵ . (5) i,j,t i,j,t+1,t+H i i,j,t+1,t+H ι=1 The results for the multivariate regression are very similar to (4). 9 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 57,
    "chunk_index": 20,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 1: Summary Statistics of Users’ Estimated Alphas (α˜ ) i This table reports summary statistics of estimated alphas (α˜), their standard errors, and t-statistics. We calculate excess returns over the next 20 trading days using the Fama-French five-factor model. The estimated alpha (α˜) for each user is the average of signed adjusted returns after her tweets. Alphas and their standard errors are in percentage points. Panel A: Distribution of α˜ i α˜ S.E. t-stat i Mean -0.63 3.88 -0.90 S.D. 6.52 4.04 89.88 P10 -7.01 0.84 -2.22 P25 -2.82 1.45 -1.11 P50 -0.35 2.61 -0.16 P75 1.86 4.75 0.72 P90 5.44 8.42 1.66 N 29,477 29,477 29,477 Panel B: Significance of H :α˜ =0 0 i Fraction of significant α˜ i p<0.05 19.8% p<0.10 25.7% 2 Model of Finfluencer Skill 2.1 Mixture modeling of finfluencer skill Since the returns from following finfluencers’ tweets are noisy, our na¨ıve measure of skill, α˜ , is a i noisy measure of users’ true skills, α . The relation between α and α˜ can be written as i i i α˜ = α +ϵ , (6) i i i where ϵ ∼ N(0,σ˜2) and σ˜ is the standard error of user i’s abnormal return in the data. It i i i follows that the distribution of the observed skill can be calculated as a convolution between the distributions of true skill and the error term ϵ . Following the literature on performance evaluation i (Chen, Cliff, and Zhao, 2017; Harvey and Liu, 2018; Crane and Crotty, 2020; Dim, 2022), we employ a mixture modeling methodology to estimate the distribution of α among users. We motivate our model of true skills with the following economic assumptions. We assume there are three types of StockTwits users and they can consist of several subtypes: 1. Skilled users, whose true skill is positive: α > 0. i 2. Unskilled users, whose true skill is zero: α = 0. i 3. Antiskilled users, whose alpha is negative: α < 0. i 10 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 13,
    "page_range": "p.13",
    "total_pages": 57,
    "chunk_index": 21,
    "word_count": 339,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.13)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "StockTwits users and they can consist of several subtypes: 1. Skilled users, whose true skill is positive: α > 0. i 2. Unskilled users, whose true skill is zero: α = 0. i 3. Antiskilled users, whose alpha is negative: α < 0. i 10 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 57,
    "chunk_index": 22,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "For the types of skilled and antiskilled users, respectively, we further assume there can be several subtypes with different levels of (anti)skill. Suppose there are K+ (K−) types of users with positive (negative) skill. Let π+ be the share of skilled finfluencers of type k, π0 the share of unskilled k finfluencers, and π− the share of antiskilled finfluencers of type k. Further, we assume that the k skilled and antiskilled types are exponentially distributed. Then, true skill α is distributed across finfluencers according to the finite mixture distribution K+ K− (cid:88) (cid:88) f(α) = 1{α > 0} π+g(α;µ+)+π01{α = 0}−1{α < 0} π−g(α;µ−), (7) k k k k k=1 k=1 where g(α;µ) ≡ 1 exp(−1α) if µ > 0 (−g(α;µ) if µ < 0) is an exponential distribution with a mean µ µ of µ and K+ K− (cid:88) (cid:88) π++π0 + π− = 1, k k k=1 k=1 (8) µ+ > 0 for 1 ≤ k ≤ K+, k µ− < 0 for 1 ≤ k ≤ K−. k In expression (7), µ+ and µ− are the expected abnormal returns of the positive and negative k k components k = 1,...,K+(K−). π+, π−, and π0 denote the probability of positive, negative, and k k zero components, respectively. Given that α˜ = α + ϵ , the distribution of estimated alphas, α˜ , can be calculated as the i i i i convolution of f and a mean-zero Normal distribution with standard deviation σ˜ , i.e. i G(α˜ ;σ˜ ,Θ) = (f ∗ϕ )(α˜ ), (9) i i σ˜i i where ∗ is the convolution operator, ϕ denotes the Normal distribution function with a mean of σ˜i zero and standard deviation of σ˜ , and Θ = (µ+,...,µ+ ,µ−,...,µ− ,π+,...,π+ ,π−,...,π− ) is the i 1 K+ 1 K− 1 K+ 1 K− vector of parameters.13 Therefore, the likelihood function can be written as I (cid:89) L(α˜ ,...,α˜ ;σ˜ ,...,σ˜ ,Θ) = G(α˜ ;σ˜ ,Θ). (10) 1 I 1 I i i i=1 We use the maximum likelihood method to estimate the vector of parameters Θ. 13LetX beanexponentialvariablewithmeanµandY beamean-zeroNormalvariablewithstandarddeviationσ. Their sum Z =X+Y is distributed as the convolution of a mean-zero Normal distribution with standard deviation σ and an exponential distribution with mean µ. The convolution has the following closed-form solution: 1 σ2 x (cid:18) (cid:18) σ x (cid:19)(cid:19) h(x;µ,σ)= exp( − )× 1−erf √ − √ , 2µ 2µ2 µ 2µ 2σ where erf is the error function. We use this closed-form solution to speed up our maximum likelihood estimation. 11 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 14,
    "page_range": "p.14",
    "total_pages": 57,
    "chunk_index": 23,
    "word_count": 428,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.14)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "the following closed-form solution: 1 σ2 x (cid:18) (cid:18) σ x (cid:19)(cid:19) h(x;µ,σ)= exp( − )× 1−erf √ − √ , 2µ 2µ2 µ 2µ 2σ where erf is the error function. We use this closed-form solution to speed up our maximum likelihood estimation. 11 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 57,
    "chunk_index": 24,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 2: Estimating the Distribution of True Alphas (α ) i This table reports the results of fitting a mixture model with two exponentials on the α > 0, two exponentials on α < 0, and a mass at α = 0. We calculate excess returns over the next 20 trading days using the Fama-French five-factor model. The estimated alpha (α˜) for each user is the average of signed adjusted returns after her tweets. The first column shows the mean of each component (µ’s). The second column shows the weight of the component in the mixture (π’s). The numbers in parentheses are standard errors of each estimate. To calculate the standard errors, we bootstrap the data 100 times with replacement, estimate the model for each bootstrapped sample, and calculate the standard deviation of the estimated parameters. All numbers are in percentages. Mean alpha (%) Fraction of users (%) Skilled type 2 6.76 5.9 (0.49) (0.8) Skilled type 1 1.42 21.6 (0.14) (1.2) Unskilled 0.00 16.0 (0.00) (2.9) Antiskilled type 1 -1.06 45.6 (0.07) (1.8) Antiskilled type 2 -7.53 10.9 (0.29) (0.7) N 29,477 Log Likelihood -86,385 AIC 172,786 BIC 172,806 2.2 The distribution of true alphas We fit several distributions of this exponential family to the StockTwits data and find the results fit better than those of Gaussian mixture models. The best fit comes from a model with two exponential distributions for each of finfluencer types 1 and 3. The next section presents the results forthisdistribution. Forthemainresultsinthispaper, weassumeK+ = K− = 2. IntheAppendix, we show the results of our estimation with alternative specifications. Table 2 reports the results of our MLE estimation for the model with K+ = K− = 2. The first (second) positive exponential component has a mean of 1.42% (6.76%) per month and accounts for 21.6% (5.9%) of the population. The first (second) negative exponential component accounts for 45.6% (10.9%) of the population and has a mean of -1.06% (-7.53%). Overall, 27.5% of the popu- lation have positive true skills while 56.5% have negative skills. We identify 16% of the population with a true skill of zero. Moreover, we calculate the standard errors of all estimated parameters by bootstrapping (with replacement) the sample of estimated alphas 100 times, running our MLE estimation on each bootstrapped sample, and calculating the standard error of estimated parame- ters. Standard errors are relatively tight, which shows that all estimated parameters are statistically significant. The lowest t-statistic among the estimated parameters belongs to the probability of the zero component (t=5.51). 12 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 15,
    "page_range": "p.15",
    "total_pages": 57,
    "chunk_index": 25,
    "word_count": 424,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.15)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "estimation on each bootstrapped sample, and calculating the standard error of estimated parame- ters. Standard errors are relatively tight, which shows that all estimated parameters are statistically significant. The lowest t-statistic among the estimated parameters belongs to the probability of the zero component (t=5.51). 12 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 57,
    "chunk_index": 26,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Goodness of fit. Using the fitted distribution of true alphas, we perform the following steps to generate N = 1,000 samples of simulated α˜’s, each with the same size as the original data (M). 1. Draw M observations from the fitted distribution of true alphas. Denote this vector by a = [a ,a ,...,a ]. 1 2 M 2. Generate a sample of M standard errors by bootstrapping [σ˜ ,σ˜ ,...,σ˜ ] with replacement. 1 2 M Denote this vector by [s ,s ,...,s ]. 1 2 M 3. Generate a vector of estimation errors e = [e ,e ,...,e ] by drawing each e from a Normal 1 2 M i distribution with a mean of zero and standard deviation of s . i 4. Generate [a˜ ,a˜ ,...,a˜ ] by adding a and e as in (6). 1 2 M 5. Calculate the vector of t-statistics [t ,t ,...,t ] through t = a˜ /s . 1 2 M i i i 6. Repeat steps one to five 1,000 times. After applying this procedure, we have N = 1,000 samples of estimated alphas and their standard errors, t-statistics, and corresponding true alphas. Figure 1 reports the results of several approaches to gauge the goodness of fit. First, we calculate the average pdf and cdf of the simulated samples and plot them against the pdf and cdf of the data. Panel A of Figure 1 shows the results. The distribution of simulated alphas is close to the estimated alphas from the data. To quantify the closeness of the distributions, we run Kolmogorov- Smirnov tests between the estimated alphas from the data and the simulated alphas from each of the simulated samples, using the null hypothesis that the two distributions are equal. The KS test rejects the null at 10%/5%/1% significance levels for 19.20%/7.40%/0.70% of simulations. Second, we calculate the average pdf of the simulated t-statistics and plot them against the pdf of t-statistics in the data. Panel B of Figure 1 shows that t-statistics from simulated data are distributed similarly to t-statistics from the data. Another way to visualize the closeness of the two distributions is the Q-Q plot. We calculate percentiles (1%,2%,...,99%) of each simulated sample of alphas. We plot the mean of the n-th percentiles from the simulated samples against the n-th percentile from the data to get a Q-Q plot. We also calculate the 95% confidence intervals for each percentile and plot them around the Q-Q plot line in the right subplot of Panel B in Figure 1. We conclude that the fit with K+ = K− = 2 of the model alphas to the estimated alphas is very good. 2.3 Measures of finfluencer skill One interpretation of the mixture modeling methodology is that it aggregates information to im- prove the signal-to-noise ratio of the data. Using the estimated distribution of true alphas, we can define measures of finfluencer skill, for example, the probability that a user is skilled, in addition to the user’s expected alpha. We can then analyze the distribution and determinants of skill. 13 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 16,
    "page_range": "p.16",
    "total_pages": 57,
    "chunk_index": 27,
    "word_count": 516,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.16)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ratio of the data. Using the estimated distribution of true alphas, we can define measures of finfluencer skill, for example, the probability that a user is skilled, in addition to the user’s expected alpha. We can then analyze the distribution and determinants of skill. 13 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 57,
    "chunk_index": 28,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Panel A: Estimated and simulated alphas 0.200 0.175 0.150 0.125 0.100 0.075 0.050 0.025 0.000 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) ytisneD Simulation 1.0 Data 0.8 0.6 0.4 0.2 0.0 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) FDC Simulation Data Panel B: Estimated and simulated t-stats 0.30 0.25 0.20 0.15 0.10 0.05 0.00 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 t ytisneD 20 Simulation Data 10 0 10 20 20 15 10 5 0 5 10 15 Alpha (%, Data) )noitalumiS ,%( ahplA y=x Q-Q Figure 1: Estimated and Simulated Alphas and Their t-Stats In Panel A, the left plot shows histograms of estimated and simulated alphas. In Panel A, the right plot shows the average cdf of simulated alphas from the fitted model against estimated alphas from the data. In Panel B, the left plot shows histograms of the estimated and simulated t-stats. In Panel B, the right plots show a Q-Q plot of the estimated and simulated alphas. Usingtheestimatesfromthemixturemodelingmethodology, wedefinefouralternativemeasures of skill. For each user i, the probability of being skilled/antiskilled can be calculated as Pr(user i skilled) ≡ Pr(α > 0 | α˜ ) = (cid:80)K k= + 1 π k +η(α˜i;µ+ k ,σ˜i) , i i fi(α˜i) (11) Pr(user i antiskilled) ≡ Pr(α < 0 | α˜ ) = (cid:80)K k= − 1 π k −η(α˜i;µ− k ,σ˜i) , i i fi(α˜i) where η(α˜ ;µ,σ˜ ) is the convolution of a normal with mean zero and standard deviation of σ˜ and an i i i exponential with a mean of µ evaluated at α˜ . In the denominator of (11), f is the distribution of i i α˜ . We define the probability of being unskilled, Pr(α = 0|α˜ ) = 1−Pr(α > 0|α˜ )−Pr(α < 0|α˜ ), i i i i i i i by subtracting the probabilities of being skilled and antiskilled from one. 14 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 17,
    "page_range": "p.17",
    "total_pages": 57,
    "chunk_index": 29,
    "word_count": 327,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.17)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "the distribution of i i α˜ . We define the probability of being unskilled, Pr(α = 0|α˜ ) = 1−Pr(α > 0|α˜ )−Pr(α < 0|α˜ ), i i i i i i i by subtracting the probabilities of being skilled and antiskilled from one. 14 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 57,
    "chunk_index": 30,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 3: Distribution of Finfluencer Skill This table reports descriptive statistics on alternative measures of finfluencer skill. The probability of being skilled, Pr(α > 0 | α˜ ), is defined in (11). The probability of being unskilled, Pr(α = 0 | α˜ ), and the probability of being i i i i antiskilled, Pr(α <0|α˜ ), are defined accordingly. The expected value of true alpha is defined in (12). i i Skilled users Unskilled users Antiskilled users True alpha Pr(α >0|α˜ ) Pr(α =0|α˜ ) Pr(α <0|α˜ ) E[α |α˜ ] i i i i i i i i Panel A: Distribution of Pr(α ≶0|α˜ ) and E[α |α˜ ] i i i i Mean 0.28 0.16 0.56 -0.57 S.D. 0.22 0.07 0.23 3.55 P10 0.04 0.03 0.26 -2.05 P25 0.13 0.14 0.45 -0.89 P50 0.24 0.17 0.57 -0.32 P75 0.34 0.20 0.69 0.15 P90 0.55 0.23 0.88 0.97 Panel B: Alternative classifications into skilled, unskilled, antiskilled finfluencers Classification based on FMM 0.28 0.16 0.56 Classification based on Pr>1/3 0.26 0.01 0.86 Classification based on max. Pr 0.18 0.01 0.81 N 29,477 29,477 29,477 29,477 The expected value of true skill α for any user i conditional on the measured skill α˜ can be written as  (cid:90) 0 (cid:32) K− (cid:33) 1 (cid:88) E[α i | α˜ i ] = f (α˜ )  αϕ(α˜ i ;α,σ˜ i ) − π k −g(α;µ− k ) dα i i k=1 −∞  (cid:90) ∞ (cid:32) K+ (cid:33) (cid:88) + αϕ(α˜ i ;α,σ˜ i ) π k +g(α;µ+ k ) dα, (12) k=1 0 where ϕ(α˜ ;α,σ˜ ) is a normal with a mean of α and standard deviation of σ˜ . i i i Table 3 documents descriptive statistics for the estimated user skill categories. The average probability that a user on StockTwits is skilled/unskilled/antiskilled is 28%/16%/56% with a stan- dard deviation equal to 22%/7%/23%. Figure 2 depicts histograms of the probabilities of users being skilled, unskilled, and antiskilled, respectively. The plot shows that there exists a lot of dispersion in the probability of being a skilled or antiskilled StockTwits user. It is evident from the plot that less than 3% of StockTwits users are unambiguously skilled and the first column of Table 3 shows that the majority of StockTwits users have a probability of less than 1/3 of being skilled. Table 3 indicates that the distribution of Pr(α = 0|α˜ ) is tight, and the middle plot Figure 2 i i confirms this observation. Panel B shows that the majority of StockTwits users have a low probabil- ity of being unskilled as 99% of them have a probability of less than 1/3 of being unskilled. Column 15 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 18,
    "page_range": "p.18",
    "total_pages": 57,
    "chunk_index": 31,
    "word_count": 453,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.18)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "tight, and the middle plot Figure 2 i i confirms this observation. Panel B shows that the majority of StockTwits users have a low probabil- ity of being unskilled as 99% of them have a probability of less than 1/3 of being unskilled. Column 15 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 57,
    "chunk_index": 32,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "noitcarF 52. 2. 51. 1. 50. 0 Skilled Antiskilled Unskilled 0 .2 .4 .6 .8 1 Pr(user i anti/un/skilled) Figure 2: Distribution in Users’ Probability of Being Skilled, Unskilled, and Antiskilled The plots show histograms of the probabilities of users being skilled, unskilled, and antiskilled, respectively. 3 of Table 3 shows that the vast majority of StockTwits users can be classified as antiskilled as 86% of them have a probability of greater than 1/3 of being antiskilled. Correspondingly, the right plot of Figure 2 shows that the majority of users have a probability in excess of 50% of being antiskilled, with almost 5% delivering unambiguously negative returns. Based on the maximum of the probabilities of being skilled, unskilled, or antiskilled, one can classify 18% of finfluencers as being skilled, 1% of finfluencers as being unskilled, and 81% of finfluencers as being antiskilled. Finally, the last column of Table 3 shows that the average monthly true alpha, E[α | α˜ ], across i i finfluencers is equal to -57bps with a standard deviation of 3.55% thus indicating a large dispersion in true alpha among them. This is mostly due to the left tail of the distribution since the bottom 10% of users generate alpha of -2.05% or less per month, while the top 10% of users generate alpha of 0.97% or more per month. Overall, we find that most StockTwits users are antiskilled. This is quite important since the content of the antiskiled users’ tweets is informative in the sense of “do opposite to what I say.” Correspondingly, this finding explains why Giannini, Irvine, and Shu (2018) find a negative correla- tion between average StockTwits sentiment and future stock returns. While Harvey and Liu (2018) find a similar result for mutual fund managers, it is in contrast with findings for other crowdsourcing platforms for predicting stock returns. Chen, De, et al. (2014) find that the sentiment of Seeking Alpha articles positively correlates with future stock returns. Other papers have documented the in- 16 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 19,
    "page_range": "p.19",
    "total_pages": 57,
    "chunk_index": 33,
    "word_count": 337,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.19)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "result for mutual fund managers, it is in contrast with findings for other crowdsourcing platforms for predicting stock returns. Chen, De, et al. (2014) find that the sentiment of Seeking Alpha articles positively correlates with future stock returns. Other papers have documented the in- 16 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 57,
    "chunk_index": 34,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "formativenessofplatformssuchasValueInvestorsClub.com, Estimize, andSumZero.com(Crawford, Gray, and Kern, 2017; Crawford, Gray, Johnson, et al., 2018; Jame et al., 2016). Contrasting our finding that only 28% of StockTwits users are skilled with Dim (2022) who finds that approximately 56% of users on Seeking Alpha can predict stock returns correctly, reveals that platforms with more curated users have more informative content. Consequently, the sentiment of Seeking Alpha correlates positively with future returns on average, in contrast with what the literature has found for StockTwits. In the rest of the paper, we will use these four measures to study which user characteristics explain finfluencers’ behavior and predict finfluencers’ skills. 3 Finfluencer Popularity The finfluencers’ popularity and skill as well as the link between them are all important for assessing the quality of financial advice via social media platforms and the nature of competition among finfluencers. Do social media users follow more skilled finfluencers, or are they more likely to follow finfluencers for non-performance reasons, such as behavioral traits and homophily? Do retail investors adhere to the advice of finfluencers they follow? Are more skilled finfluencers more likely to survive? 3.1 Do more skilled users have larger follower base? Given that finfluencers can be skilled, unskilled, or antiskilled, we ask whether the crowd of Stock- Twits users can identify the skilled users. If so, we would expect skilled users to have more followers than unskilled users. Alternatively, if finfluencers build a reputation by revealing valuable infor- mation and stop doing so once they have acquired a large body of followers, we may expect the opposite: Finfluencers with skill have fewer followers while finfluencers with many followers are unskilled or even antiskilled. Figure 3 documents the univariate relation between users’ followers and our measures of skill. The three binscatter plots show a strong positive relation between users’ followers, as measured by the log of overall follower count, and the probabilities of being unskilled and antiskilled. The right binscatter plot shows, however, that follower count is negatively related to users’ probability of being skilled. We now study the effect of the market performance metric, alpha, on the user’s follower count. To narrow down the channel for why certain finfluencers are more popular than others, we then drill into the alpha determinants by exploiting the same characteristics used in the prior section to predict the users’ follower count. The channels we can try to distinguish are whether social media users match with finfluencers based on their own behavioral traits, or they cannot correctly identify tweeting patterns that correlate with finfluencers’ skills or do not care about finfluencers’ skills at 17 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 20,
    "page_range": "p.20",
    "total_pages": 57,
    "chunk_index": 35,
    "word_count": 436,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.20)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "users’ follower count. The channels we can try to distinguish are whether social media users match with finfluencers based on their own behavioral traits, or they cannot correctly identify tweeting patterns that correlate with finfluencers’ skills or do not care about finfluencers’ skills at 17 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 57,
    "chunk_index": 36,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": ")delliksnU(rP 91 81 71 61 51 0 2 4 6 8 log followers )delliksitnA(rP 95 85 75 65 55 0 2 4 6 8 log followers )dellikS(rP 03 82 62 42 22 0 2 4 6 8 log followers Figure 3: Binscatter Plots Skill versus of Number of Followers The plots show binscatter plots of the probabilities of users being skilled, unskilled, and antiskilled, respectively, versus the natural logarithm of the number of followers. Table 4: The Effect of Finfluencers’ Alpha on Follower Count Thistablereportstheresultsofregressingthenumberoffollowersonusers’tweetingcharacteristics. Thedependent variable is the log of one plus the user’s follower count as of February 2018. In Panel A, the independent variables are: α˜ is the finfluencer’s measured alpha in the data, E[α |α˜ ] is the expected value of alpha given its measurement i i i in the data, Pr(α > 0|α˜ ) is the probability that a user is skilled, Pr(α = 0|α˜ ) is the probability that a user is i i i i unskilled, and Pr(α < 0|α˜ ) is the probability that a user is antiskilled. In Panel B, the independent variables are i i thesameasinTable8. Standarderrorsarerobusttoheteroskedasticity. ∗,∗∗,and∗∗∗ indicatestatisticalsignificance at the 10%, 5%, and 1% levels, respectively. Finfluencers’ follower count (measured out-of-sample) i (1) (2) (3) (4) (5) α˜ 0.00 i (0.00) E[α |α˜ ] 0.00 i i (0.00) Pr(user i skilled) -0.80*** (0.06) Pr(user i unskilled) 3.79*** (0.23) Pr(user i antiskilled) 0.34*** (0.06) Constant 2.53*** 2.70*** 2.92*** 2.09*** 2.50*** (0.01) (0.01) (0.02) (0.04) (0.04) r2 0.000 0.000 0.008 0.020 0.002 N 27,200 22,074 22,074 22,074 22,074 all. In this analysis, our measurement of skill is based on each user’s tweets in the time period 2013-2016. The number of followers is measured in turn after this time frame, as of February 2018. The lag of more than one year between alpha measurement and follower count should reduce any concern about reverse causality. Table 4 reports the results when we regress the number of followers for each finfluencer on the measures of her skill. The explanatory variables are either the finfluencer’s measured alpha in the data, α˜ , the expected value of alpha given its measurement in the data, E[α |α˜ ], the i i i 18 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 21,
    "page_range": "p.21",
    "total_pages": 57,
    "chunk_index": 37,
    "word_count": 371,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.21)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "number of followers for each finfluencer on the measures of her skill. The explanatory variables are either the finfluencer’s measured alpha in the data, α˜ , the expected value of alpha given its measurement in the data, E[α |α˜ ], the i i i 18 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 57,
    "chunk_index": 38,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 5: Persistence of Finfluencer Skill The table reports the persistence of finfluencers’ skill. The regression specification is y =α+β×y +ϵ , i,post-2016 i,pre-2016 i where y is one of the following five variables: the estimated alpha, α˜ , the expected value of true alpha, E[α ], and i i the probability of α being positive, zero, or negative. For each regression, the (in)dependent variable is calculated i with tweets posted in or after 2016 (before 2016). Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. α˜ E[α ] Pr(α >0) Pr(α =0) Pr(α <0) i i i i i Pre-2016 0.00 0.09∗∗∗ 0.03∗∗ 0.09∗∗∗ 0.03∗∗ (0.02) (0.03) (0.01) (0.01) (0.01) Constant -0.29∗∗∗ -0.29∗∗∗ 31.90∗∗∗ 12.38∗∗∗ 51.85∗∗∗ (0.08) (0.03) (0.47) (0.22) (0.80) N 9,382 6,449 6,449 6,449 6,449 probability that a user is skilled, Pr(α > 0|α˜ ), the probability that a user is unskilled, Pr(α = i i i 0|α˜ ), or the probability that a user is antiskilled, Pr(α < 0|α˜ ). The estimates show that neither i i i finfluencers’ measured alpha, α˜ , nor finfluencers’ expected alpha given its measurement, E[α |α˜ ], i i i has a relation with follower count. Instead, skilled finfluencers have fewer followers than either unskilled or antiskilled finfluencers. Next, we want to understand the economic forces behind the negative relation between the number of followers and skill measures. 3.2 Skill persistence and finfluencer survival An important question is whether finfluencers’ skills are persistent.14 If finfluencers’ skills are persistent, then social media users may not prioritize skill over other characteristics when deciding which finfluencers to follow. If they are not persistent, then it would not be unexpected to observe a negative correlation between measures of finfluencers’ skill and their follower count. To answer this question, we divide our sample into pre- and post-2016 periods and calculate each user’s estimated alpha in each sub-sample separately. Moreover, we estimate our MLE model separately on pre- and post-2016 data sub-samples and calculate the expected true alpha and the probability of each user being skilled, unskilled, or antiskilled. As a result, we have five variables describing each user’s skill estimated over pre- and post-2016 data sub-samples. To test the persis- tence of finfluencers’ skills, we regress the estimates obtained using the post-2016 data sample on the estimates obtained using the pre-2016 data sample. A statistically significant AR1 coefficient would imply that users’ skills are persistent. Table 5 reports the results of the persistence regressions. The autoregressive coefficient is small 14The prior literature has studied this question in the context of professional analysts (Crane and Crotty, 2020), but not for non-professional or semi-professional finfluencers. 19 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 22,
    "page_range": "p.22",
    "total_pages": 57,
    "chunk_index": 39,
    "word_count": 456,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.22)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "imply that users’ skills are persistent. Table 5 reports the results of the persistence regressions. The autoregressive coefficient is small 14The prior literature has studied this question in the context of professional analysts (Crane and Crotty, 2020), but not for non-professional or semi-professional finfluencers. 19 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 57,
    "chunk_index": 40,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 6: Finfluencer Survival This table reports the determinants of finfluencers’ survival. The results are obtained from Probit regressions. For each regression, the (in)dependent variable is calculated with tweets posted in or after 2016 (before 2016). The de- pendentvariableequalsoneifthefinfluencerisactiveinorafter2016,andzerootherwise. Theindependentvariables are α˜ is the finfluencer’s measured alpha in the data before 2016, E[α |α˜ ] is the expected value of i,pre-2016 i i,pre-2016 alpha given its measurement in the data before 2016, Pr(α > 0|α˜ ) is the probability that a user is skilled, i i,pre-2016 Pr(α = 0|α˜ ) is the probability that a user is unskilled, and Pr(α < 0|α˜ ) is the probability that a i i,pre-2016 i i,pre-2016 user is antiskilled. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Finfluencer survival i (1) (2) (3) (4) (5) α˜ 0.00 i,pre-2016 (0.00) E[α |α˜ ] 0.02*** i i,pre-2016 (0.00) Skilled: Pr(α >0|α˜ ) -0.08 i i,pre-2016 (0.04) Unskilled: Pr(α =0|α˜ ) 1.47*** i i,pre-2016 (0.13) Antiskilled: Pr(α <0|α˜ ) -0.06 i i,pre-2016 (0.04) Constant -0.24*** -0.18*** -0.17*** -0.40*** -0.16*** (0.01) (0.01) (0.01) (0.02) (0.02) r2 0.000 0.001 0.000 0.005 0.000 N 23,103 18,770 18,770 18,770 18,770 and insignificant when we measure finfluencers’ skill using the estimated alphas, α˜. By contrast, measures of finfluencers’ skill derived from the MLE estimation show significant persistence. A 1% increase in the expected true alpha, E[α ], over the pre-2016 data, is associated with a 9 bps i increase in the expected true alpha over the post-2016 data. Similarly, a one percent increase in the probability of positive/negative alpha over the pre-2016 data is associated with 0.03% increase of the same probability over the post-2016 data. The finding that persistence is absent in measured alphas but is present among expected true alphas is interesting. Not only is the autoregressive coefficient of the estimated alphas insignificant, but it is also much smaller. This observation is consistent with an error-in-variables (EIV) bias. Becausetheestimatedalphaisanoisymeasureofthetruealpha,themagnitudeoftheautoregressive coefficientshrinkstowardzero. TheMLEestimationpartiallyremovestheestimationnoise, thereby decreasing the EIV bias and increasing the magnitude of the autoregressive coefficient. Given that MLE measures of finfluencers’ skill are persistent, we now check if skilled finfluencers are more likely to survive despite the fact that they have fewer followers than unskilled and an- tiskilled finfluencers. We address this question using Probit regressions. For each regression, the (in)dependent variable is calculated with tweets posted in or after 2016 (before 2016). The de- pendent variable is an indicator function Finfluencer survival equal one if the finfluencer is active i 20 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 23,
    "page_range": "p.23",
    "total_pages": 57,
    "chunk_index": 41,
    "word_count": 429,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.23)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "tiskilled finfluencers. We address this question using Probit regressions. For each regression, the (in)dependent variable is calculated with tweets posted in or after 2016 (before 2016). The de- pendent variable is an indicator function Finfluencer survival equal one if the finfluencer is active i 20 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 57,
    "chunk_index": 42,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "in or after 2016, and zero otherwise. The independent variables are α˜ is the finfluencer’s i,pre-2016 measured alpha in the data before 2016, E[α |α˜ ] is the expected value of alpha given its i i,pre-2016 measurement in the data before 2016, Pr(α > 0|α˜ ) is the probability that a user is skilled, i i,pre-2016 Pr(α = 0|α˜ ) is the probability that a user is unskilled, and Pr(α < 0|α˜ ) is the i i,pre-2016 i i,pre-2016 probability that a user is antiskilled. The results in Table 6 show that skill is not a significant determinant of survival. First, the finfluencer’s measured alpha α˜ is an insignificant determinant of survival. The expected i,pre-2016 value of alpha given its measurement in the data before 2016 eliminates some noise and indeed positively correlates with survival. The economic magnitude is small, however. When we split the skill into three types based on their probabilities in columns (3)-(5), only the probability of being unskilled statistically significantly predicts survival and the relation is positive. Column (3) shows that the probability of being skilled has no impact on the probability of survival. Next, we investigate whether skilled finfluencers have a real economic impact by affecting retail trading. 3.3 Which finfluencers affect retail investor behavior? Here we explore the relationship between different types of StockTwits users and the behavior of retailinvestors. Retailinvestorsmaybeinfluenceddifferentlybymoreorlessskilledfinfluencersand the relation with a finfluencer’s follower base is a priori not clear. While it may be that unskilled and antiskilled finfluencers have more followers, social media users may not necessarily invest based on their flawed advice. To address this question, we split the users into antiskilled, unskilled, and skilled by their respective probability given by (11). Our main variables of interest capture the tweet sentiment by different finfluencer types. We split each user’s tweeting activity into the number of positive and, respectively, negative tweets in a given stock on a given day and then compute the average number of tweets weighted by each user’s probability of being of one of the three types: Positive sentiment by anti/un/skilled users = 1 (cid:80) Pr(user i anti/un/skilled)×SocSent+ , j,t I alli i,j,t Negative sentiment by anti/un/skilled users = 1 (cid:80) Pr(user i anti/un/skilled)×SocSent− , j,t I alli i,j,t (13) wherePr(user i anti/un/skilled)aregivenby(11),SocSent+ = (cid:80)Ni,j,t1(SocSent = 1)counts i,j,t n=1 i,j,t,n the positive tweets by finfluencer i in stock j on day t, and SocSent− = (cid:80)Ni,j,t1(SocSent = i,j,t n=1 i,j,t,n −1) counts the negative ones. We estimate the following panel regressions with stock and day fixed effects: 21 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 24,
    "page_range": "p.24",
    "total_pages": 57,
    "chunk_index": 43,
    "word_count": 426,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.24)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "= (cid:80)Ni,j,t1(SocSent = 1)counts i,j,t n=1 i,j,t,n the positive tweets by finfluencer i in stock j on day t, and SocSent− = (cid:80)Ni,j,t1(SocSent = i,j,t n=1 i,j,t,n −1) counts the negative ones. We estimate the following panel regressions with stock and day fixed effects: 21 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 57,
    "chunk_index": 44,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Retail order imbalance = α +α + j,t+1 j t (cid:88) + β+ ×Positive sentiment by anti/un/skilled users + f j,t f∈{a,u,s} (cid:88) + β− ×Negative sentiment by anti/un/skilled users +γ′X +ϵ , (14) f j,t j,t j,t+1 f∈{a,u,s} where the set {a,u,s} refers to anti/un/skilled StockTwits users and controls X include aver- j,t age positive news sentiment in stock j on the day t and corresponding negative news sentiment, trading volume, retail order imbalances, and short-sales constraint index. The dependent variable, Retail order imbalance , is the retail order imbalance equal to a difference between the number of j,t retail buy and sell orders in stock j on day t. Table 7 documents the results from specification (14). The coefficient estimates suggest that some types of StockTwits users impact retail trading while others do not. Positive sentiment by antiskilled StockTwits users strongly predicts an increase in retail order imbalances on the next trading day, controlling for news sentiment, trading volume, past retail order imbalances, and stock- level short-sales constraints. In other words, positive tweeting activity by antiskilled finfluencers leads to an increase in retail buys relative to retail sales on the next trading day. Negative sentiment by antiskilled users strongly predicts a reduction in retail order imbalances on the next trading day. That is negative tweeting activity by antiskilled finfluencers leads to a reduction in retail buys relative to retail sales on the next trading day. In terms of economic magnitudes, the results for positive and negative tweets are roughly symmetric. By contrast, neither positive nor negative tweeting by skilled users has a significant impact on retail order imbalances. When combined with the results from Table 4 on the finfluencer’s “popularity,” these findings show that StockTwits users treat the antiskilled finfluencers as “gurus”, that is they follow them, listen to their investment advice, and then act on it by trading in the advised direction. This behaviour by StockTwits users raises an important question of why they ignore the experts or most skilled finfluencers in favor of gurus or antiskilled finfluencers. Next section address this question. 4 Finfluencer Skill and the Social Network An important question for understanding why social media users do not follow the most skilled finfluencers is whether social media users can use observable characteristics to tell apart value- creating experts (skilled finfluencers) from charlatans (unskilled finfluencers) and gurus (antiskilled finfluencers), and whether they do so? In this section, we show that finfluencers follow commonly known tweeting strategies and these strategies predict users’ skills. Therefore, social media users can use these characteristics to separate good from bad advice. 22 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 25,
    "page_range": "p.25",
    "total_pages": 57,
    "chunk_index": 45,
    "word_count": 437,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.25)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "charlatans (unskilled finfluencers) and gurus (antiskilled finfluencers), and whether they do so? In this section, we show that finfluencers follow commonly known tweeting strategies and these strategies predict users’ skills. Therefore, social media users can use these characteristics to separate good from bad advice. 22 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 57,
    "chunk_index": 46,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 7: Finfluencer Sentiment and Retail Order Imbalances Thistablereportsthedeterminantsofretailorderimbalances. Resultsareobtainedfrompanelregressionswithstock anddayfixedeffects. Theindependentvariablesofinterestcapturethetweetsentimentbydifferentfinfluencertypes in stock j on day t, which we compute by splitting the tweeting activity by each user into the number of positive and, respectively, negative tweets in a given stock on a given day and then compute the average number of tweets weighted by each user’s probability of being of one of the three types. Standard errors are robust to clustering at the stock and day level. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Retail order imbalance j,t+1 (1) (2) (3) (4) (5) (6) Positive sentiment by antiskilled users 8.722*** 6.989*** 8.396*** 6.676*** j,t (1.569) (1.482) (1.552) (1.463) Positive sentiment by unskilled users 7.548 7.449 7.494 7.398 j,t (4.070) (3.807) (4.042) (3.779) Positive sentiment by skilled users 2.540 1.716 2.189 1.408 j,t (1.568) (1.530) (1.582) (1.540) Negative sentiment by antiskilled users -8.490*** -7.315** -7.586** -6.527** j,t (2.502) (2.491) (2.500) (2.481) Negative sentiment by unskilled users -17.023* -18.582* -16.108* -17.741* j,t (7.816) (7.913) (7.832) (7.918) Negative sentiment by skilled users 0.946 1.921 2.468 3.147 j,t (2.555) (2.556) (2.593) (2.586) Positive news sentiment -0.048 -0.041 -0.049 j,t (0.062) (0.061) (0.062) Negative news sentiment -0.363 -0.357 -0.350 j,t (0.207) (0.204) (0.202) Volume 0.000 0.000 0.000 j,t (0.000) (0.000) (0.000) Retail order imbalance 0.066*** 0.066*** 0.066*** j,t (0.004) (0.004) (0.004) Short sale constraint -3.800*** -3.796*** -3.788*** j,t (1.131) (1.131) (1.130) Stock & Day FEs Yes Yes Yes Yes Yes Yes r2 0.017 0.024 0.017 0.024 0.017 0.024 N 875,211 795,956 875,211 795,956 875,211 795,956 4.1 Dissecting Finfluencers’ Tweeting Strategies We start by dissecting finfluencers’ tweeting strategies depending on their skill. Doing this helps to understand the nature of information or skills held by finfluencers and what determines the positive or negative performance of different finfluencers. We use the measures of finfluencer skill from Section 2 to study if finfluencers follow commonly known investment behaviors. The measures of finfluencers’ skills computed in the previous subsection are not directly observ- able in the data by StockTwits users. Directly observable by StockTwits users, and thus potentially more relevant for distinguishing skilled from unskilled finfluencers, are user-level characteristics such as the number of tweets, their tone, and the number of followers. If finfluencers use these observable characteristics to signal their type to other StockTwits users, then these characteristics should be 23 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 26,
    "page_range": "p.26",
    "total_pages": 57,
    "chunk_index": 47,
    "word_count": 398,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.26)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "potentially more relevant for distinguishing skilled from unskilled finfluencers, are user-level characteristics such as the number of tweets, their tone, and the number of followers. If finfluencers use these observable characteristics to signal their type to other StockTwits users, then these characteristics should be 23 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 57,
    "chunk_index": 48,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": ")delliksnU(rP 22 02 81 61 41 2 3 4 5 6 7 log activity )delliksitnA(rP 95 85 75 65 55 2 3 4 5 6 7 log activity )dellikS(rP 03 52 02 2 3 4 5 6 7 log activity Figure 4: Binscatter Plots of User Activity (Log Number of Tweets) versus Skill The plots show binscatter plots of the probabilities of users being skilled, unskilled, and antiskilled, respectively, versus the natural logarithm of the number of tweets (a proxy for account activity). informative about finfluencers’ skills. A StockTwits user can control the first two characteristics and does not have full control over its follower base but can create user attention based on tweeting activity. User attention based on tweeting activity. StockTwitsusersareheterogeneousintheirtweet- ing activity. It is reasonable to expect that this heterogeneity affects the informativeness of their tweets. For example, one may think that users who tweet more often are more likely to be experts and have more valuable information. On the other hand, users who tweet more often are also more likely to be overconfident or charlatans who believe that a large tweeting volume proxies for skill. Thus their tweets might be less informative. Ultimately, how informed frequent tweeters are is an empirical question. Furthermore, the prior literature has documented that short-sellers are in- formed (e.g., Engelberg, Reed, and Ringgenberg, 2012; Boehmer, Jones, and Zhang, 2008). Hence, we might expect users with more negative tweets to be more informed. To test these hypotheses, we relate our measures of skill to the number of tweets and the composition of the tweets, in particular, the fraction of all tweets that have a negative tone. Figure 4 documents the univariate relation between users’ tweet activity and our measures of skill. The left and middle binscatter plots show a strong positive relation between users’ tweeting activity, as measured by the log of overall user account activity, and the probability of being unskilled as well as the probability of being antiskilled. By contrast, tweeting activity is very strongly negatively related to users’ probability of being skilled. This finding indicates that the marginal power of the additional tweet in identifying skill declines with the number of tweets for skilled users or, in other words, that the tweeting activity exhibits decreasing identification power for skilled users. Panel A of Table 8 reports our results on explaining StockTwits users’ skills by observable characteristics using multivariate regressions. In Panel A, an increase in tweeting activity does not have an economic effect on the measured alpha. A 10-times increase in the number of tweets increases the measured alpha by 8 bps per month. The point estimate is also not statistically 24 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 27,
    "page_range": "p.27",
    "total_pages": 57,
    "chunk_index": 49,
    "word_count": 447,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.27)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "multivariate regressions. In Panel A, an increase in tweeting activity does not have an economic effect on the measured alpha. A 10-times increase in the number of tweets increases the measured alpha by 8 bps per month. The point estimate is also not statistically 24 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 57,
    "chunk_index": 50,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "significant. On the other hand, the expected true alpha also increases by 8 bps per month, and the point estimate is statistically significant at 1%. In agreement with the univariate results from Figure4, theprobabilityofbeingskilleddecreasesby3.70%whiletheprobabilityofbeingantiskilled increases by 1.26% when the number of tweets increases tenfold. Put together, users who tweet more frequently are less likely to be skilled, consistent with informed users tweeting less frequently. However, conditional on being skilled or antiskilled, the expected value of the frequent tweeter’s skills is larger, implying that frequent tweeters have more experience in picking stocks. Panel A of Table 8 also includes the fraction of negative tweets as an explanatory variable. Consistent with prior literature, we find that users with more negative tweets are more likely to be informed across all measures of skill. A one percent increase in the share of negative tweets is associated with a 3 bps increase in the monthly estimated alpha. The expected true alpha also increases by 1 bps per month. The probability of being informed increases by 0.06%, while the probability of being antiskilled decreases by 0.09%. All of these estimates are significant at 1% and point to the same conclusion: users with more negative tweets are more likely to post informative tweets. Return chasing vs. contrarian behavior. The prior literature documents return chasing among retail traders (Barber and Odean, 2007). In our setup, we can ask if the tweets by all or some group(s) of users are motivated by return chasing. In particular, if antiskilled finfluencers’ tweets chase returns, return chasing may contribute to these users’ measured negative skill. We measure each user’s return-chasing tendency by the percentage of her tweets that are either positive and about the highest decile of prior week returns or negative and about the lowest decile of prior week returns. To test the return chasing hypothesis, we perform two checks. We first regress measured and expected alphas on return chasing to test if return chasing is associated with better or worse performance. Table 8, Panel B reports the results of the return chasing tests. We find that a one percent increase in return chasing is associated with a 7 bps decrease in the estimated alpha, while the expected true alpha decreases by 4 bps. The probability of being skilled or antiskilled also changes with the tendency to chase returns. A one percent increase in return chasing tendency is associated with an 0.08% decrease in the probability of being skilled and a 0.16% increase in the probability of being antiskilled. Because the skilled, unskilled, and antiskilled components sum up to one, the probability of being unskilled also decreases by 0.08%. Overall, return chasing contributes to users being antiskilled. Do skilled users in turn follow a contrarian approach given that return chasing contributes to negative skill? We measure each user’s contrarian tendency as the percentage of a user’s tweets that are either positive and about the lowest decile of prior week returns or negative and about the highest decile of prior week returns. Table 8, Panel C regresses our measures of skill on the contrarian tendency. The results show 25 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 28,
    "page_range": "p.28",
    "total_pages": 57,
    "chunk_index": 51,
    "word_count": 522,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.28)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "of a user’s tweets that are either positive and about the lowest decile of prior week returns or negative and about the highest decile of prior week returns. Table 8, Panel C regresses our measures of skill on the contrarian tendency. The results show 25 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 57,
    "chunk_index": 52,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 8: Dissecting Finfluencers’ Tweeting Strategies This table reports the results of regressions Skill =α+β×Strategy +ϵ , i i i where Skill represents one of the following variables: (1) the estimated alpha (α˜) (2) the expected value of true i alpha (E[α]) (3) the probability of α being positive (4) the probability of α being negative. The estimated alpha (α˜) for each user is the average of signed adjusted returns after her tweets. The other dependent variables are defined in expressions(11)and(12). Alldependentvariablesareinpercentagepoints. NumberTweets isthelogofoneplusthe total number of positive and negative tweets the user has posted. FractionNegative represents the percentage of a finfluencer’snon-neutraltweetsthathaveanegativesentiment. ReturnChasing isdefinedas thepercentageofuser’s tweetsthatareeither(1)positiveandaboutstocksinthehighestdecileofreturnsoverthepastweek,or(2)negative and about stocks in the lowest decile of returns over the past week. ContrarianTweet is defined as the percentage of user’s tweets that are either (1) positive and about stocks in the lowest decile of returns over the past week, or (2) negative and about stocks in the highest decile of returns over the past week. SSI (Positive Tweets) represents the average decile of short-selling constraints for stocks positively tweeted by the user. Short-selling constraints are measured using the Markit short-selling index for the stock over the past five trading days. SSI (Negative Tweets) is defined in a similar way for negative tweets. PositiveHerding is the percentage of the user’s positive tweets that are about stocks in the top decile of positive tweeting activity over the past five days. NegativeHerding is defined in a similar way for negative tweets. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Skilled Antiskilled Alpha finfluencers finfluencers α˜ E[α ] Pr(α >0) Pr(α <0) i i i i Panel A: Effect of Number and Composition of Tweets on Users’ Skill NumberTweets 0.08 0.08∗∗∗ -3.70∗∗∗ 1.26∗∗∗ i (0.06) (0.03) (0.23) (0.25) FractionNegative 0.03∗∗∗ 0.01∗∗∗ 0.06∗∗∗ -0.09∗∗∗ i (0.00) (0.00) (0.01) (0.01) Panel B: Which Finfluencers Pursue Return Chasing? ReturnChasing -0.07∗∗∗ -0.04∗∗∗ -0.08∗∗∗ 0.16∗∗∗ i (0.01) (0.01) (0.03) (0.03) Panel C: Which Finfluencers Pursue Contrarian Tweeting? ContrarianTweet 0.01 -0.01 0.06 0.01 i (0.01) (0.01) (0.03) (0.04) Panel D: Tweeting about Short-Selling Constrained Stocks SSI (Positive Tweets) -0.52∗∗∗ -0.31∗∗∗ -0.89∗∗∗ 1.63∗∗∗ i (0.04) (0.02) (0.10) (0.11) SSI (Negative Tweets) 0.43∗∗∗ 0.18∗∗∗ 1.76∗∗∗ -1.49∗∗∗ i (0.07) (0.04) (0.18) (0.17) Panel E: Effect of Positive Herding on Users’ Skill PositiveHerding -0.03∗∗∗ -0.02∗∗∗ -0.09∗∗∗ 0.11∗∗∗ i (0.00) (0.00) (0.01) (0.01) Panel F: Effect of Negative Herding on Users’ Skill NegativeHerding 0.04∗∗∗ 0.02∗∗∗ 0.07∗∗∗ -0.13∗∗∗ i (0.00) (0.00) (0.02) (0.02) N 29,475 29,475 29,475 29,475 26 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 29,
    "page_range": "p.29",
    "total_pages": 57,
    "chunk_index": 53,
    "word_count": 428,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.29)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "(0.17) Panel E: Effect of Positive Herding on Users’ Skill PositiveHerding -0.03∗∗∗ -0.02∗∗∗ -0.09∗∗∗ 0.11∗∗∗ i (0.00) (0.00) (0.01) (0.01) Panel F: Effect of Negative Herding on Users’ Skill NegativeHerding 0.04∗∗∗ 0.02∗∗∗ 0.07∗∗∗ -0.13∗∗∗ i (0.00) (0.00) (0.02) (0.02) N 29,475 29,475 29,475 29,475 26 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 57,
    "chunk_index": 54,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "no significant association between contrarian tweeting and skill. In other words, users who post contrarian tweets do not exhibit higher skills. Short-sale constraints and tweet sentiment. Asset pricing theory suggests that risky assets are overpriced in a market with short-selling constraints (Miller, 1977). As a result, stocks with short-sellingconstraintstendtobeoverpriced. Weaskwhetherfinfluencersexploitthisunderpricing in their tweets. Because of this overpricing, we expect skilled users to post more negative tweets aboutstockswithtightershort-sellingconstraints. WeuseMarkitshort-sellingindextomeasurethe short-selling constraints of individual stocks. The Markit index is a number between 1 and 20 with 1 representing no short-selling constraints, and 20 representing maximum short-selling constraint. Every day, we sort stocks into deciles based on the average of their Markit index over the past five days. For each user, we calculate two variables representing the average decile of the Markit index for all stocks that she tweeted positively and negatively. These two variables are our measures of short-selling constraints for positive and negative tweets. We regress our measures of skill on short-selling constraints to test whether skilled social media users can exploit the overpricing of stocks with short-selling constraints. Table8, PanelDreportstheresultsoftheseregressions. Aonedecileincreaseintheshort-selling constraints of positively (negatively) tweeted stocks is associated with a 0.52% (0.43) per month decrease (increase) in the user’s estimated alpha. Using expected true alphas, the same increase in short selling constraints for positively (negatively) tweeted stocks results in a 0.31% (0.18%) decrease (increase) in skill. The probability of being skilled or antiskilled also changes with short- selling constraints. A one decile increase in the short-selling constraints of positively tweeted stocks is associated with a 0.89% (1.63%) decrease (increase) in the user’s probability of being skilled. On the other hand, a one decile increase in the short selling constraints of negatively tweeted stocks is associated with a 1.76% (1.49%) increase (decrease) in the user’s probability of being antiskilled. Overall, these results show that exploiting short-selling constraints correctly contributes to users’ skills both on the negative and positive sides. Herding and tweeting. An interesting question is whether herding affects the informativeness of users’ tweets. To quantify herding, we calculate the percentage of each user’s positive tweets that are about stocks in the highest decile of positive tweeting activity over the past five days. Next, we regress our measures of skills on users’ herding tendencies. Table 8, Panel E reports the results of these regressions. A one percent increase in positive herding tendency is associated with a 3bp (2bp) decrease in estimated alpha (expected true al- pha). Moreover, the probability of being skilled decreases by 0.09% while the probability of being antiskilled increases by 0.11%. Taken together, the results in Table 8 show that positive herding tendency is negatively correlated with users’ skills. Anecdotal evidence shows that herding behavior on social media is associated with positive 27 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 30,
    "page_range": "p.30",
    "total_pages": 57,
    "chunk_index": 55,
    "word_count": 461,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.30)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "skilled decreases by 0.09% while the probability of being antiskilled increases by 0.11%. Taken together, the results in Table 8 show that positive herding tendency is negatively correlated with users’ skills. Anecdotal evidence shows that herding behavior on social media is associated with positive 27 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 57,
    "chunk_index": 56,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 9: Effect of finfluencers’ tweeting patterns on follower count Thistablereportstheresultsofregressingthenumberoffollowersonusers’tweetingcharacteristics. Thedependent variable is the log of one plus the user’s follower count as of February 2018. The independent variables are the same as in Table 8. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Finfluencers’ follower count (measured out-of-sample) i (1) (2) (3) (4) (5) ReturnChasing -0.013∗∗∗ 0.000 i (0.001) (0.001) ContrarianTweet -0.021∗∗∗ -0.004∗∗∗ i (0.001) (0.001) NumberTweets 0.683∗∗∗ 0.828∗∗∗ i (0.010) (0.011) FractionNegative -0.001∗∗∗ -0.002∗∗∗ i (0.000) (0.000) PositiveHerding 0.025∗∗∗ -0.005∗ i (0.004) (0.003) NegativeHerding -0.036∗∗∗ -0.021∗∗∗ i (0.004) (0.003) SSI (Positive Tweets) -0.020∗∗∗ -0.056∗∗∗ i (0.004) (0.004) SSI (Negative Tweets) -0.057∗∗∗ -0.063∗∗∗ i (0.006) (0.007) Constant 1.275∗∗∗ 0.208∗∗∗ 1.290∗∗∗ 1.240∗∗∗ 0.463∗∗∗ (0.007) (0.017) (0.010) (0.010) (0.019) N 22,027 22,027 22,027 22,027 22,027 sentiment. The meme stock episode in 2021 is one such example. However, one could also measure herding around negative tweets. Thus we repeat our regressions using an alternative definition of the independent variable that measures herding on negative tweets. Table 8, Panel F reports the results for the negative herding. Users who tweet more often about stocks in the top decile of negative tweeting activity are more likely to be skilled and less likely to be antiskilled. A one percent increase in the negative herding measure is associated with a 0.07% increase (0.13% decrease) in the probability of being skilled (antiskilled). The estimated alpha and expected true alpha both increase with herding on negative tweets. Which finfluencers’ tweeting strategies are most popular? To answer this question we regress the number of followers for each user on her tweeting characteristics. Table 9, Panel B reports the results when we regress the numberof followers for each finfluencer on the characteristics of tweeting activity, i.e., return chasing, count and composition of tweets, herding, and short-selling constraints. We find that the tendency to chase returns and post contrarian tweets negatively correlates with the user’s follower count. However, the correlation fades away when we control for other finfluencer characteristics. On the other hand, users who tweet more often are more likely 28 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 31,
    "page_range": "p.31",
    "total_pages": 57,
    "chunk_index": 57,
    "word_count": 360,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.31)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "constraints. We find that the tendency to chase returns and post contrarian tweets negatively correlates with the user’s follower count. However, the correlation fades away when we control for other finfluencer characteristics. On the other hand, users who tweet more often are more likely 28 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 57,
    "chunk_index": 58,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "to have larger follower counts. A one percent increase in the total number of tweets is associated with a 0.68% increase in followers. The correlation between the share of negative tweets and the number of followers is negative and significant but small in economic magnitude. Moreover, herding on positive tweets is positively correlated with the follower count, but the sign switches when we control for other user characteristics, and its magnitude shrinks. Herding on negative tweets is negatively correlated with the follower count. Finally, tweeting about stocks with higher short-selling constraints negatively correlates with the number of followers regardless of the tweet sentiment. These results suggest that except for tweeting positively about stocks with high short-selling constraints, tweeting patterns that correlate with users’ skills either do not predict the number of followersorpredictitwiththewrongsign, suggestingthatsocialmediausersmatchwithfinfluencers based on their own behavioral traits. This behavior is consistent with theories of homophily that predict a reduction in the speed of learning and information diffusion (see, e.g., Golub and Jackson, 2012). 4.2 What finfluencer behaviors best predict skill? The previous section has shown that finfluencers follow some commonly known tweeting strategies. We now ask if social media users can in turn exploit finfluencer behavior to learn about skills. We address the question of whether skill can be detected using a multivariate regression analysis of the determinants of finfluencers’ skill. Our dependent variables will again be the probability of being skilled, unskilled, and antiskilled: Pr(α ≶ 0 | α˜ ) = α+β′X +ϵ , (15) i i i i where X are various characteristics of finfluencer i. The Appendix describes the construction of i variables capturing events that trigger finfluencers’ tweeting activity. For each finfluencer i, we calculate the percentage of times that i’s sentiment about stock j on the day t is positive (negative) after stock j has been in the highest (lowest) decile according to a certain criterion over the past time window [t−L−1,t−1]. For the window length, we let L = 1,2,5,10,20. We use stock-specific thresholds to capture factors that trigger tweeting activity as described in the Appendix. Tables A.3, A.4 and A.5 report the results for skilled, antiskilled, and unskilled finfluencers, respectively. Across columns, we vary the construction of the explanatory variables from a 1-day lag (column 1), averaged over the past 2 days (column 2), past 5 days (column 3), past 10 days (column 4), past 20 days (column 5). Standard errors are robust to heteroskedasticity. Identifying skilled finfluencers. Table A.3 reveals that less active finfluencers with fewer fol- lowers are more likely to be skilled. Skilled finfluencers are return contrarian; they make positive tweets after negative returns and negative tweets after positive returns. Skilled finfluencers are also 29 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 32,
    "page_range": "p.32",
    "total_pages": 57,
    "chunk_index": 59,
    "word_count": 452,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.32)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "to heteroskedasticity. Identifying skilled finfluencers. Table A.3 reveals that less active finfluencers with fewer fol- lowers are more likely to be skilled. Skilled finfluencers are return contrarian; they make positive tweets after negative returns and negative tweets after positive returns. Skilled finfluencers are also 29 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 57,
    "chunk_index": 60,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "social sentiment and news contrarian; they make fewer positive tweets when social sentiment is posi- tive and more positive tweets after negative news. Similarly, they make more/fewer negative tweets when social sentiment is positive/negative and fewer negative tweets after negative news. More tweeting after high trading volume and, in particular, negative tweets on short-sale constrained stocks also indicate the presence of skill. Identifying antiskilled finfluencers. Table A.4 demonstrates that finfluencers with more fol- lowers have a higher likelihood to be antiskilled. Antiskilled finfluencers ride return and social sentiment momentum. They make positive tweets after positive returns and negative tweets after negative returns. Antiskilled finfluencers are more/less likely to make positive/negative tweets after positive social sentiment. Antiskilled finfluencers are also less/more likely to make positive/negative tweets after negative news. Positive tweets when volatility or short-sale constraints are high also render antiskilled finfluencers more likely. Identifying unskilled finfluencers. Table A.5 shows that very active finfluencers with few likes are more likely to be uninformed. Finfluencers with more ideas and finfluencers following more other finfluencers are also more likely to be unskilled. The interaction of tweet activity with news sentiment reveals that finfluencers tweeting either positively or negatively about “hot” stocks that are in the news are more likely to be unskilled. Finfluencers that tweet on low trading volume stocks are more likely to be unskilled. Short-sale constraints are also indicative of skill. Unskilled finfluencers tend to tweet on unconstrained stocks while skilled finfluencers tweet negatively about short-sale constrained stocks. By contrast, antiskilled finfluencers tweet positively about short-sale constrained stocks. In summary, social media users tend to follow finfluencers with similar behavioral traits as their own. Retail investors also put their money where their finfluencer mouth is. But this strategy is bound to lose money because the finfluencers that they are more likely to follow are antiskilled. In thenextsection, weexploreifonecanexploitthewisdomoftheskilledfinfluencerstoearnabnormal returns (both in-sample and out-of-sample) or if it is more profitable to exploit the “wisdom” of the antiskilled finfluencers. 5 Belief Biases and the “Wisdom” of the Crowd In view of previous section’s results a natural hypothesis is that information is diffuse and dispersed among all finfluencers and needs to be aggregated to filter out noise. This is the idea behind the widely used term “wisdom of the crowd.” An alternative hypothesis is that not all finfluencers hold valuable information, but only a subset of skilled finfluencers are informed. Yet another hypothesis is that finfluencers catering to retail investors persistently provide flawed investment advice and one can earn abnormal returns doing the opposite to the advise. To distinguish between these 30 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 33,
    "page_range": "p.33",
    "total_pages": 57,
    "chunk_index": 61,
    "word_count": 433,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.33)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "finfluencers hold valuable information, but only a subset of skilled finfluencers are informed. Yet another hypothesis is that finfluencers catering to retail investors persistently provide flawed investment advice and one can earn abnormal returns doing the opposite to the advise. To distinguish between these 30 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 57,
    "chunk_index": 62,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "hypotheses, we next investigate if following the tweets by different groups of finfluencers: (i) leads to systemically biased beliefs across stocks and time, and (ii) generates profitable trading strategies and, if so, by which types of finfluencers. 5.1 Belief biases induced by antiskilled finfluencers We can compute the stock-level and aggregate bias in beliefs resulting from the tweets of antiskilled finfluencers by comparing them to the tweets of unskilled finfluencers. The identifying assumption here is that unskilled finfluencers produce mostly noise and that any stock-specific and time-specific confounding factors are reflected in systematic patterns of their tweeting activity. Confounding factors can hence be filtered out by netting out unskilled finfluencers’ average sentiment. We perform the following steps to run our tests. We first calculate the aggregate measures of beliefsatthestocklevelasinTable7, butinsteadofseparatingthepositiveandnegativesentiments, we net them. To be more specific, we use the following formulas (for finfluencer i, stock j, day t): Sentskilled = 1 (cid:80) Pr(user i skilled)×SocSent , j,t I alli i,j,t (16) Sentantiskilled = 1 (cid:80) Pr(user i antiskilled)×SocSent , j,t I alli i,j,t where Pr(user i skilled) and Pr(user i antiskilled) are given by expressions (11) and SocSent is i,j,t given by expression (1). The sentiment of unskilled finfluencers is define similarly. To capture the belief bias induced by antiskilled users tweeting about stocks about which they are misinformed or faking their tweets, we define the belief bias relative to the sentiment of the unskilled finfluencers. We do this for the skilled and the antiskilled finfluencers in every stock j and every day t: AbnSentskilled = Sentskilled −Sentunskilled, j,t j,t j,t (17) AbnSentantiskilled = Sentantiskilled −Sentunskilled. j,t j,t j,t Figure 5 plots the average abnormal social sentiment of skilled and antiskilled finfluencers by day (Panel A) and stock (Panel B) for the years 2015 and 2016. To construct daily averages we aggregate the abnormal social sentiment either by day or stock: AbnSentanti/skilled = 1 (cid:80) AbnSentanti/skilled, t J allj j,t (18) AbnSentanti/skilled = 1 (cid:80) AbnSentanti/skilled. j T allt j,t The figure illustrates several intriguing patterns. The left subplot of Panel A plots the time series of the daily average abnormal social sentiment, while the right subplot of Panel B shows its distri- bution. Both subplots show that the abnormal social sentiment of skilled finfluencers is centered at zerowithseveralepisodeswhenskilledfinfluencersdisseminatestronglypositivesocialsentimentfor extended periods of time and a few episodes when skilled finfluencers disseminate strongly negative social sentiment. By contrast, antiskilled finfluencers behave very differently. The daily average ab- 31 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 34,
    "page_range": "p.34",
    "total_pages": 57,
    "chunk_index": 63,
    "word_count": 413,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.34)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "distri- bution. Both subplots show that the abnormal social sentiment of skilled finfluencers is centered at zerowithseveralepisodeswhenskilledfinfluencersdisseminatestronglypositivesocialsentimentfor extended periods of time and a few episodes when skilled finfluencers disseminate strongly negative social sentiment. By contrast, antiskilled finfluencers behave very differently. The daily average ab- 31 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Panel A: Abnormal social sentiment by day tnemitneS 3. 2. 1. 0 1.- Skilled Antiskilled 01jan2015 01jul2015 01jan2016 01jul2016 01jan2017 tnemitneS 3. 2. 1. 0 1.- 0 .1 .2 .3 Fraction Panel B: Abnormal social sentiment by stock noitcarF 51. 1. 50. 0 Skilled Antiskilled -.4 -.2 0 .2 .4 Sentiment Figure 5: Abnormal Social Sentiment for Skilled and Antiskilled Finfluencers The plot in Panel A shows the daily average abnormal social sentiment by skilled and antiskilled finfluencers, respectively. The plot in Panel B shows the distribution of the average abnormal social sentiment by skilled and antiskilled finfluencers, respectively, for each stock. normal social sentiment of antiskilled finfluencers is significantly positive almost all the time. This implies antiskilled finfluencers in aggregate tend to tweet more positively than negatively, biasing their followers’ beliefs upward. Antiskilled finfluencers’ sentiment exhibits persistent swings and few spikes, in contrast to skilled finfluencers. Users that follow antiskilled finfluencers thus exhibit 32 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 35,
    "page_range": "p.35-36",
    "total_pages": 57,
    "chunk_index": 64,
    "word_count": 210,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.35-36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "positive almost all the time. This implies antiskilled finfluencers in aggregate tend to tweet more positively than negatively, biasing their followers’ beliefs upward. Antiskilled finfluencers’ sentiment exhibits persistent swings and few spikes, in contrast to skilled finfluencers. Users that follow antiskilled finfluencers thus exhibit 32 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Table10: AbnormalSocialSentimentRevealedbytheTweetsofSkilledandAntiskilledFinfluencers This table reports descriptive statistics about the abnormal social sentiment revealed by the tweets of skilled and antiskilled finfluencers by day or stock. We measure abnormal social sentiment by skilled and antiskilled finfluencers relative to unskilled finfluencers. Standard errors are robust to clustering at the stock and day level. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. N Mean S.D. Skewness Kurtosis p25 p50 p75 Panel A: Abnormal social sentiment revealed by skilled finfluencers Skilled by day 692 0.02 0.06 1.29 5.48 -0.01 0.00 0.04 Skilled by stock 4,580 0.02 0.07 1.15 16.99 -0.01 0.01 0.04 Panel B: Abnormal social sentiment revealed by antiskilled finfluencers Antiskilled by day 692 0.09 0.09 -0.22 7.22 0.05 0.07 0.11 Antiskilled by stock 4,580 0.08 0.07 1.89 23.66 0.04 0.08 0.12 overly optimistic beliefs most of the time, overly pessimistic beliefs some of the time, and persis- tent swings in their belief bias. Panel B of Figure 5 demonstrates that antiskilled finfluencers are significantly positive about most stocks, while the fraction of stocks skilled finfluencers are positive about is almost the same as the fraction they are negative about. Table 10 reports summary statistics for the abnormal social sentiment revealed by the tweets of skilled and antiskilled finfluencers. The statistics in Table 10 are consistent with Figure 5. The abnormal social sentiment revealed by skilled finfluencers in Panel A is close to zero on average with positive skewness and large kurtosis, both across time and stocks. By contrast, the abnormal social sentiment revealed by antiskilled finfluencers in Panel B is positive on average and even at the 25% quantile. Its volatility over time is larger than that of skilled finfluencers. At the 75% quantile, antiskilled finfluencers’ abnormal social sentiment exceeds 11%, both across time and stocks. 5.2 Belief biases and in-sample portfolio tests Next, we investigate whether these belief biases can be exploited in-sample to earn returns. There are several empirical choices to be made in constructing portfolios based on finfluencer tweets and, hence, there are several ways we can run portfolio tests using signals from StockTwits. Our baseline approach proceeds as follows: 1. We identify users in the highest and lowest deciles based on expected alpha, E[α]. Alter- natively, we identify users in the highest deciles based on the probability of being skilled, Pr(α > 0), and probability of being antiskilled, Pr(α < 0). In both cases, we denote the two groups as skilled and antiskilled. 2. Every day t, we get a list of stocks that have been mentioned positively and negatively by each group over the past L days, where we vary L = 1,2,5,10,20. That is, a stock stays in 33 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 36,
    "page_range": "p.36",
    "total_pages": 57,
    "chunk_index": 65,
    "word_count": 505,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.36)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "the two groups as skilled and antiskilled. 2. Every day t, we get a list of stocks that have been mentioned positively and negatively by each group over the past L days, where we vary L = 1,2,5,10,20. That is, a stock stays in 33 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 57,
    "chunk_index": 66,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "the portfolio for L days if tweeted on days t−L+1,...,t. Denote the group of stocks tweeted on the day t by Tweet and over the past L days by Tweet . t t−L+1,t 3. Every day t, we go long a portfolio of stocks that have been either (1) tweeted positively by the skilled group, or (2) tweeted negatively by the unskilled group. Similarly, we short a portfolio of stocks that have been either (3) tweeted negatively by the skilled group, or (4) tweeted positively by the antiskilled group. This approach yields four legs of a composite strategy. 4. We calculate the time series of daily excess returns for each of the four portfolios. We compute buy-hold portfolio returns where we make the initial investment at the close of the day the tweets occur and hold the initial positions for L days. Portfolio returns for trades initiated based on tweets on day t, Tweet , are t L 1 (cid:88) (cid:89) Retbh = (1+AbnRet )−1. t+1,t+L |Tweet | j,t+l t j∈Tweett l=1 5. Alternatively, we dynamically readjust the portfolio every day to account for the varying number of stocks being tweeted by adjusting the initial positions for how many stocks are in each portfolio. We compute dynamic portfolio returns where we rebalance the initial positions for L days. Buy-and-hold portfolio returns on the day t are 1 (cid:88) Retdy = AbnRet . t+1 |Tweet | j,t+1 t−L+1,t j∈Tweett−L+1,t 6. We construct the long-short returns by subtracting the returns of the short portfolio from those of the long portfolio. Tables 11 and 12 summarize the results. Both tables use notations ssp(m) alpha 10(1) where ssp(m) indicates positive(negative) tweeting activity and alpha 10(1) indicates that the tweet’s owner is skilled(antiskilled) according to the procedure of variables construction described above. Table 11 provides in-sample buy-and-hold portfolio returns with the reported numbers being multi- day returns Retbh over the corresponding holding period. Across panels, we vary the holding t+1,t+L period. The portfolio returns show that skilled finfluencers’ positive tweets predict positive returns over 1, 2, 5, 10, and 20-day horizons, reaching 2.3% over 20 days. Similarly, skilled finfluencers’ negative tweets predict significant negative returns over 1, 2, 5, 10, and 20-day horizons, reaching -2.4% over 20 days. The results for antiskilled finfluencers are the exact opposite. The portfolio returns show that antiskilled finfluencers’ positive tweets predict negative returns over 1, 2, 5, 10, and 20-day horizons, reaching -4.6% over 20 days. Antiskilled finfluencers’ negative tweets predict significant positive returns over 10 and 20-day horizons, reaching 1.3% over 20 days. The results 34 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 37,
    "page_range": "p.37",
    "total_pages": 57,
    "chunk_index": 67,
    "word_count": 433,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.37)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "portfolio returns show that antiskilled finfluencers’ positive tweets predict negative returns over 1, 2, 5, 10, and 20-day horizons, reaching -4.6% over 20 days. Antiskilled finfluencers’ negative tweets predict significant positive returns over 10 and 20-day horizons, reaching 1.3% over 20 days. The results 34 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 57,
    "chunk_index": 68,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "for dynamically rebalanced portfolio returns Retdy in Table 12 are similar, with the exception that t+1 antiskilled finfluencers’ negative tweets do not predict significant positive returns. As a robustness check, Table A.1 documents in-sample portfolio returns using the probability of (anti)skill as a sorting variable. In Panel A, the reported numbers are multi-day returns Retbh t+1,t+L over a 20-day holding period. In Panel B, the reported numbers are dynamically rebalanced returns Retdy over a 20-day holding period. The results are broadly in line with Tables 11 and 12. t+1 5.3 Belief biases and out-of-sample portfolio tests Next, we repeat the test from the previous section, except we identify the skilled and antiskilled groups in the first part of the data (pre-2016) and run our portfolio tests in the second part of the data (post-2016). 1. We identify users in the highest and lowest deciles based on E[α], or Pr(α > 0) and Pr(α < 0) calculated in the pre-2016 period. We again denote these two groups as skilled and antiskilled. 2. For every day post-2016, we get a list of stocks that have been mentioned positively and negatively by each group over the past L days. 3. For every day post-2016, we go long a portfolio of stocks that have been either (1) tweeted positively by the skilled group, or (2) tweeted negatively by the unskilled group. Similarly, we short a portfolio of stocks that have been either (3) tweeted negatively by the skilled group, or (4) tweeted positively by the antiskilled group. 4. We calculate the time series of daily excess returns for the four portfolio legs and subtract the returns of the short portfolios from those of the long portfolios. Tables13and14summarizetheresults. BothtablesusenotationsakintheonesusedinTables11 and 12 but for the pre component indicating that the skills have been measured using pre-2016 sample. Table 13 provides out-of-sample buy-and-hold portfolio returns with the reported numbers beingmulti-dayreturnsoverthecorrespondingholdingperiodwithoutdynamicrebalancing. Across panels, we vary the holding period. The out-of-sample results are generally weaker than the in- sample tests in Tables 11 and 12. The out-of-sample portfolio returns show that finfluencers identified as being skilled before 2016 do not significantly predict returns in 2016. By contrast, the performance of antiskilled finfluencers is persistent. Antiskilled finfluencers’ positive tweets predict negative returns over 1, 2, 5, 10, and 20-day horizons, reaching -1.2% over 20 days. Antiskilled finfluencers’ negative tweets also predict significant negative out-of-sample returns over 2, 5, 10, and 20-day horizons, reaching -1% over 20 days. The results for dynamically rebalanced portfolio returns in Table 14 are similar, but only significant ones are antiskilled finfluencers’ positive tweets. 35 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 38,
    "page_range": "p.38",
    "total_pages": 57,
    "chunk_index": 69,
    "word_count": 434,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.38)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "days. Antiskilled finfluencers’ negative tweets also predict significant negative out-of-sample returns over 2, 5, 10, and 20-day horizons, reaching -1% over 20 days. The results for dynamically rebalanced portfolio returns in Table 14 are similar, but only significant ones are antiskilled finfluencers’ positive tweets. 35 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 57,
    "chunk_index": 70,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 11: Buy-and-Hold Portfolio Returns—In Sample The table documents buy-and-hold portfolio returns. The reported numbers are multi-day returns over the corre- sponding holding period without dynamic rebalancing. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: 1-day buy-and-hold returns ssp alpha 10 0.211∗∗∗ 0.169∗∗∗ 0.146∗∗∗ 0.151∗∗∗ (0.057) (0.038) (0.034) (0.033) ssm alpha 10 -0.097 -0.145∗∗ -0.181∗∗∗ -0.181∗∗∗ (0.067) (0.049) (0.047) (0.046) ssp alpha 01 -0.275∗∗∗ -0.320∗∗∗ -0.362∗∗∗ -0.360∗∗∗ (0.058) (0.041) (0.038) (0.038) ssm alpha 01 0.132 0.096 0.066 0.069 (0.083) (0.070) (0.067) (0.068) Panel B: 2-day buy-and-hold returns ssp alpha 10 0.432∗∗∗ 0.342∗∗∗ 0.310∗∗∗ 0.319∗∗∗ (0.085) (0.055) (0.047) (0.047) ssm alpha 10 -0.155 -0.263∗∗∗ -0.329∗∗∗ -0.330∗∗∗ (0.098) (0.071) (0.067) (0.067) ssp alpha 01 -0.443∗∗∗ -0.544∗∗∗ -0.625∗∗∗ -0.623∗∗∗ (0.087) (0.059) (0.054) (0.054) ssm alpha 01 0.249∗ 0.169 0.128 0.125 (0.123) (0.101) (0.097) (0.097) Panel C: 5-day buy-and-hold returns ssp alpha 10 0.998∗∗∗ 0.767∗∗∗ 0.695∗∗∗ 0.725∗∗∗ (0.141) (0.090) (0.074) (0.074) ssm alpha 10 -0.336∗ -0.600∗∗∗ -0.727∗∗∗ -0.726∗∗∗ (0.160) (0.116) (0.110) (0.110) ssp alpha 01 -0.894∗∗∗ -1.158∗∗∗ -1.331∗∗∗ -1.334∗∗∗ (0.127) (0.083) (0.075) (0.075) ssm alpha 01 0.547∗∗ 0.286∗ 0.196 0.193 (0.179) (0.141) (0.128) (0.128) Panel D: 10-day buy-and-hold returns ssp alpha 10 1.999∗∗∗ 1.476∗∗∗ 1.319∗∗∗ 1.359∗∗∗ (0.195) (0.125) (0.102) (0.101) ssm alpha 10 -0.299 -0.875∗∗∗ -1.176∗∗∗ -1.193∗∗∗ (0.221) (0.165) (0.163) (0.160) ssp alpha 01 -1.545∗∗∗ -2.087∗∗∗ -2.359∗∗∗ -2.367∗∗∗ (0.167) (0.108) (0.098) (0.098) ssm alpha 01 1.138∗∗∗ 0.572∗∗ 0.340 0.388∗ (0.257) (0.201) (0.176) (0.175) Panel E: 20-day buy-and-hold returns ssp alpha 10 3.598∗∗∗ 2.553∗∗∗ 2.318∗∗∗ 2.329∗∗∗ (0.248) (0.160) (0.133) (0.134) ssm alpha 10 -0.791∗∗ -1.922∗∗∗ -2.340∗∗∗ -2.423∗∗∗ (0.290) (0.220) (0.219) (0.215) ssp alpha 01 -3.058∗∗∗ -4.128∗∗∗ -4.565∗∗∗ -4.593∗∗∗ (0.228) (0.150) (0.136) (0.134) ssm alpha 01 2.684∗∗∗ 1.574∗∗∗ 1.229∗∗∗ 1.256∗∗∗ (0.364) (0.295) (0.260) (0.248) 36 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 39,
    "page_range": "p.39",
    "total_pages": 57,
    "chunk_index": 71,
    "word_count": 307,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.39)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ssp alpha 10 3.598∗∗∗ 2.553∗∗∗ 2.318∗∗∗ 2.329∗∗∗ (0.248) (0.160) (0.133) (0.134) ssm alpha 10 -0.791∗∗ -1.922∗∗∗ -2.340∗∗∗ -2.423∗∗∗ (0.290) (0.220) (0.219) (0.215) ssp alpha 01 -3.058∗∗∗ -4.128∗∗∗ -4.565∗∗∗ -4.593∗∗∗ (0.228) (0.150) (0.136) (0.134) ssm alpha 01 2.684∗∗∗ 1.574∗∗∗ 1.229∗∗∗ 1.256∗∗∗ (0.364) (0.295) (0.260) (0.248) 36 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 57,
    "chunk_index": 72,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 12: Dynamically Rebalanced Portfolio Returns—In Sample Thetabledocumentsdynamicallyrebalancedportfolioreturns. Thereportednumbersare1-dayreturnsdynamically rebalanced over the corresponding holding-period. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: 1-day returns ssp alpha 10 0.211∗∗∗ 0.169∗∗∗ 0.146∗∗∗ 0.151∗∗∗ (0.057) (0.038) (0.034) (0.033) ssm alpha 10 -0.097 -0.145∗∗ -0.181∗∗∗ -0.181∗∗∗ (0.067) (0.049) (0.047) (0.046) ssp alpha 01 -0.275∗∗∗ -0.320∗∗∗ -0.362∗∗∗ -0.360∗∗∗ (0.058) (0.041) (0.038) (0.038) ssm alpha 01 0.132 0.096 0.066 0.069 (0.083) (0.070) (0.067) (0.068) Panel B: 2-day holding-period dynamically rebalanced returns ssp alpha 10 0.206∗∗∗ 0.160∗∗∗ 0.139∗∗∗ 0.142∗∗∗ (0.054) (0.033) (0.029) (0.029) ssm alpha 10 -0.094 -0.145∗∗∗ -0.175∗∗∗ -0.173∗∗∗ (0.061) (0.042) (0.039) (0.039) ssp alpha 01 -0.223∗∗∗ -0.269∗∗∗ -0.305∗∗∗ -0.304∗∗∗ (0.055) (0.036) (0.033) (0.033) ssm alpha 01 0.112 0.067 0.047 0.050 (0.072) (0.056) (0.053) (0.053) Panel C: 5-day holding-period dynamically rebalanced returns ssp alpha 10 0.206∗∗∗ 0.160∗∗∗ 0.139∗∗∗ 0.142∗∗∗ (0.054) (0.033) (0.029) (0.029) ssm alpha 10 -0.094 -0.145∗∗∗ -0.175∗∗∗ -0.173∗∗∗ (0.061) (0.042) (0.039) (0.039) ssp alpha 01 -0.223∗∗∗ -0.269∗∗∗ -0.305∗∗∗ -0.304∗∗∗ (0.055) (0.036) (0.033) (0.033) ssm alpha 01 0.112 0.067 0.047 0.050 (0.072) (0.056) (0.053) (0.053) Panel D: 10-day holding-period dynamically rebalanced returns ssp alpha 10 0.206∗∗∗ 0.160∗∗∗ 0.139∗∗∗ 0.142∗∗∗ (0.054) (0.033) (0.029) (0.029) ssm alpha 10 -0.094 -0.145∗∗∗ -0.175∗∗∗ -0.173∗∗∗ (0.061) (0.042) (0.039) (0.039) ssp alpha 01 -0.223∗∗∗ -0.269∗∗∗ -0.305∗∗∗ -0.304∗∗∗ (0.055) (0.036) (0.033) (0.033) ssm alpha 01 0.112 0.067 0.047 0.050 (0.072) (0.056) (0.053) (0.053) Panel E: 20-day holding-period dynamically rebalanced returns ssp alpha 10 0.206∗∗∗ 0.160∗∗∗ 0.139∗∗∗ 0.142∗∗∗ (0.054) (0.033) (0.029) (0.029) ssm alpha 10 -0.094 -0.145∗∗∗ -0.175∗∗∗ -0.173∗∗∗ (0.061) (0.042) (0.039) (0.039) ssp alpha 01 -0.223∗∗∗ -0.269∗∗∗ -0.305∗∗∗ -0.304∗∗∗ (0.055) (0.036) (0.033) (0.033) ssm alpha 01 0.112 0.067 0.047 0.050 (0.072) (0.056) (0.053) (0.053) 37 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 40,
    "page_range": "p.40",
    "total_pages": 57,
    "chunk_index": 73,
    "word_count": 301,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.40)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ssp alpha 10 0.206∗∗∗ 0.160∗∗∗ 0.139∗∗∗ 0.142∗∗∗ (0.054) (0.033) (0.029) (0.029) ssm alpha 10 -0.094 -0.145∗∗∗ -0.175∗∗∗ -0.173∗∗∗ (0.061) (0.042) (0.039) (0.039) ssp alpha 01 -0.223∗∗∗ -0.269∗∗∗ -0.305∗∗∗ -0.304∗∗∗ (0.055) (0.036) (0.033) (0.033) ssm alpha 01 0.112 0.067 0.047 0.050 (0.072) (0.056) (0.053) (0.053) 37 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 57,
    "chunk_index": 74,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 13: Buy-and-Hold Portfolio Returns—Out of Sample The table documents buy-and-hold portfolio returns. The reported numbers are multi-day returns over the corre- sponding holding period without dynamic rebalancing. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: 1-day buy-and-hold returns ssp alpha pre 10 0.130 0.062 -0.011 -0.008 (0.098) (0.062) (0.053) (0.053) ssm alpha pre 10 0.051 -0.019 -0.076 -0.074 (0.102) (0.062) (0.057) (0.056) ssp alpha pre 01 -0.045 -0.121 -0.209∗∗ -0.202∗∗ (0.107) (0.075) (0.068) (0.068) ssm alpha pre 01 -0.020 -0.092 -0.136 -0.130 (0.120) (0.090) (0.083) (0.082) Panel B: 2-day buy-and-hold returns ssp alpha pre 10 0.244 0.117 -0.005 -0.002 (0.144) (0.090) (0.075) (0.074) ssm alpha pre 10 0.074 -0.054 -0.132 -0.125 (0.147) (0.089) (0.075) (0.075) ssp alpha pre 01 -0.120 -0.258∗ -0.386∗∗∗ -0.386∗∗∗ (0.165) (0.118) (0.103) (0.102) ssm alpha pre 01 -0.102 -0.239∗ -0.315∗∗ -0.319∗∗ (0.165) (0.120) (0.111) (0.110) Panel C: 5-day buy-and-hold returns ssp alpha pre 10 0.625∗∗ 0.271 -0.011 -0.012 (0.229) (0.140) (0.116) (0.115) ssm alpha pre 10 0.534∗ 0.144 -0.077 -0.079 (0.251) (0.153) (0.125) (0.123) ssp alpha pre 01 0.178 -0.209 -0.462∗∗ -0.460∗∗ (0.259) (0.181) (0.161) (0.160) ssm alpha pre 01 0.187 -0.185 -0.408∗ -0.388∗ (0.284) (0.205) (0.182) (0.181) Panel D: 10-day buy-and-hold returns ssp alpha pre 10 1.457∗∗∗ 0.543∗∗ -0.042 -0.038 (0.314) (0.180) (0.150) (0.150) ssm alpha pre 10 1.424∗∗∗ 0.461∗ -0.139 -0.113 (0.338) (0.198) (0.172) (0.172) ssp alpha pre 01 0.901∗∗ -0.108 -0.741∗∗∗ -0.726∗∗∗ (0.336) (0.215) (0.202) (0.200) ssm alpha pre 01 0.865∗ -0.135 -0.717∗∗ -0.627∗∗ (0.354) (0.238) (0.222) (0.222) Panel E: 20-day buy-and-hold returns ssp alpha pre 10 2.743∗∗∗ 0.771∗∗∗ -0.288 -0.307 (0.393) (0.221) (0.184) (0.183) ssm alpha pre 10 2.745∗∗∗ 0.684∗ -0.393 -0.384 (0.468) (0.297) (0.262) (0.261) ssp alpha pre 01 2.156∗∗∗ -0.032 -1.309∗∗∗ -1.243∗∗∗ (0.466) (0.304) (0.268) (0.265) ssm alpha pre 01 1.995∗∗∗ -0.113 -1.180∗∗∗ -1.045∗∗ (0.458) (0.329) (0.318) (0.314) 38 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 41,
    "page_range": "p.41",
    "total_pages": 57,
    "chunk_index": 75,
    "word_count": 328,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.41)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "2.743∗∗∗ 0.771∗∗∗ -0.288 -0.307 (0.393) (0.221) (0.184) (0.183) ssm alpha pre 10 2.745∗∗∗ 0.684∗ -0.393 -0.384 (0.468) (0.297) (0.262) (0.261) ssp alpha pre 01 2.156∗∗∗ -0.032 -1.309∗∗∗ -1.243∗∗∗ (0.466) (0.304) (0.268) (0.265) ssm alpha pre 01 1.995∗∗∗ -0.113 -1.180∗∗∗ -1.045∗∗ (0.458) (0.329) (0.318) (0.314) 38 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 57,
    "chunk_index": 76,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table 14: Dynamically Rebalanced Portfolio Returns—Out of Sample Thetabledocumentsdynamicallyrebalancedportfolioreturns. Thereportednumbersare1-dayreturnsdynamically rebalanced over the corresponding holding period. Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: 1-day returns ssp alpha pre 10 0.130 0.062 -0.011 -0.008 (0.098) (0.062) (0.053) (0.053) ssm alpha pre 10 0.051 -0.019 -0.076 -0.074 (0.102) (0.062) (0.057) (0.056) ssp alpha pre 01 -0.045 -0.121 -0.209∗∗ -0.202∗∗ (0.107) (0.075) (0.068) (0.068) ssm alpha pre 01 -0.020 -0.092 -0.136 -0.130 (0.120) (0.090) (0.083) (0.082) Panel B: 2-day holding-period dynamically rebalanced returns ssp alpha pre 10 0.116 0.050 -0.010 -0.013 (0.092) (0.055) (0.046) (0.046) ssm alpha pre 10 0.050 -0.020 -0.071 -0.071 (0.100) (0.058) (0.051) (0.050) ssp alpha pre 01 -0.001 -0.075 -0.161∗∗ -0.159∗∗ (0.102) (0.065) (0.058) (0.058) ssm alpha pre 01 0.015 -0.063 -0.115 -0.109 (0.111) (0.078) (0.070) (0.069) Panel C: 5-day holding-period dynamically rebalanced returns ssp alpha pre 10 0.116 0.050 -0.010 -0.013 (0.092) (0.055) (0.046) (0.046) ssm alpha pre 10 0.050 -0.020 -0.071 -0.071 (0.100) (0.058) (0.051) (0.050) ssp alpha pre 01 -0.001 -0.075 -0.161** -0.159** (0.102) (0.065) (0.058) (0.058) ssm alpha pre 01 0.015 -0.063 -0.115 -0.109 (0.111) (0.078) (0.070) (0.069) Panel D: 10-day holding-period dynamically rebalanced returns ssp alpha pre 10 0.116 0.050 -0.010 -0.013 (0.092) (0.055) (0.046) (0.046) ssm alpha pre 10 0.050 -0.020 -0.071 -0.071 (0.100) (0.058) (0.051) (0.050) ssp alpha pre 01 -0.001 -0.075 -0.161** -0.159** (0.102) (0.065) (0.058) (0.058) ssm alpha pre 01 0.015 -0.063 -0.115 -0.109 (0.111) (0.078) (0.070) (0.069) Panel E: 20-day holding-period dynamically rebalanced returns ssp alpha pre 10 0.116 0.050 -0.010 -0.013 (0.092) (0.055) (0.046) (0.046) ssm alpha pre 10 0.050 -0.020 -0.071 -0.071 (0.100) (0.058) (0.051) (0.050) ssp alpha pre 01 -0.001 -0.075 -0.161** -0.159** (0.102) (0.065) (0.058) (0.058) ssm alpha pre 01 0.015 -0.063 -0.115 -0.109 (0.111) (0.078) (0.070) (0.069) 39 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 42,
    "page_range": "p.42",
    "total_pages": 57,
    "chunk_index": 77,
    "word_count": 323,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.42)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "0.116 0.050 -0.010 -0.013 (0.092) (0.055) (0.046) (0.046) ssm alpha pre 10 0.050 -0.020 -0.071 -0.071 (0.100) (0.058) (0.051) (0.050) ssp alpha pre 01 -0.001 -0.075 -0.161** -0.159** (0.102) (0.065) (0.058) (0.058) ssm alpha pre 01 0.015 -0.063 -0.115 -0.109 (0.111) (0.078) (0.070) (0.069) 39 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 57,
    "chunk_index": 78,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Asarobustnesscheck, TableA.2documentsout-of-sampleportfolioreturnsusingtheprobability of (anti)skill as a sorting variable. In Panel A, the reported numbers are multi-day returns over a 20-day holding period without dynamic rebalancing. In Panel B, the reported numbers are 1-day returns dynamically rebalanced over a 20-day holding period. The results are broadly in line with Tables 13 and 14. The out-of-sample portfolio results are quite interesting when combined with the findings from Table 5 that the finfluencers’ skills are persistent but are not sufficient for finfluencers’ survival according to Table 6. They indicate that the message is more important than the messenger. That is as long as there are any antiskilled finfluencers “preaching” their message the investors like their message and are willing to trade on it. 6 Conclusion Social media has gained great importance in recent years for sharing and acquiring information. An important question is whether competition among users of social media platforms is such that followerscaneasilyidentifyskilledfinancialinfluencers,so-calledfinfluencers,anddriveoutunskilled finfluencers from the market for social information. We find that the answer is no. Social media users can use the tweeting behavior of finfluencers to identify their skills. However, instead of following more skilled influencers, social media users follow unskilled and antiskilled finfluencers, which we define as finfluencers whose tweets generate negative alpha. Antiskilled finfluencers ride return and social sentiment momentum, which coincide with the behavioral biases of retail investors who trade on antiskilled finfluencers’ flawed advice. These results are consistent with homophily in behavioral traits between social media users and finfluencers shaping finfluencer’s follower networks and limiting competition among finfluencers, resulting in the survival of un- and antiskilled finfluencers despite the fact that they do not provide valuable investment advice. Investing contrarian to the tweets by antiskilled finfluencers yields abnormal out-of-sample re- turns, whichwetermthe“wisdomoftheantiskilledcrowd.” Thesefindingsshedlightonthequality offinfluencers’unsolicitedfinancialadviceandthecompetitionamongandeconomicincentivesfaced by finfluencers which the SEC has been concerned about. 40 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 43,
    "page_range": "p.43",
    "total_pages": 57,
    "chunk_index": 79,
    "word_count": 304,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.43)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "in the survival of un- and antiskilled finfluencers despite the fact that they do not provide valuable investment advice. Investing contrarian to the tweets by antiskilled finfluencers yields abnormal out-of-sample re- turns, whichwetermthe“wisdomoftheantiskilledcrowd.” Thesefindingsshedlightonthequality offinfluencers’unsolicitedfinancialadviceandthecompetitionamongandeconomicincentivesfaced by finfluencers which the SEC has been concerned about. 40 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Abstract",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 57,
    "chunk_index": 80,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Abstract (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ThisAppendixreportsadditionalempiricalresultsdiscussedinthemainbodyofthemanuscript. Table A.1: In-Sample Portfolio Returns Using Probability of (Anti)Skill as Sorting Variable The table documents in-sample portfolio returns using the probability of (anti)skill as sorting variable. In Panel A, the reported numbers are multi-day returns over a 20-day holding period without dynamic rebalancing. In Panel B, the reported numbers are 1-day returns dynamically rebalanced over a 20-day holding-period. Standard errors are robusttoheteroskedasticity. ∗,∗∗,and∗∗∗ indicatestatisticalsignificanceatthe10%,5%,and1%levels,respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: Buy-and-hold returns ssp Pskl 10 1.600*** 0.691*** 0.512*** 0.519*** (0.163) (0.068) (0.050) (0.050) ssm Pskl 10 0.911*** -0.027 -0.196 -0.171 (0.199) (0.124) (0.117) (0.119) ssp Paskl 10 0.557*** -0.355*** -0.614*** -0.634*** (0.156) (0.056) (0.041) (0.040) ssm Paskl 10 0.998*** 0.046 -0.263*** -0.254*** (0.191) (0.098) (0.074) (0.072) Panel B: Dynamically rebalanced returns ssp Pskl 10 0.089* 0.050** 0.035** 0.035** (0.040) (0.016) (0.012) (0.012) ssm Pskl 10 0.017 -0.026 -0.043* -0.043* (0.045) (0.024) (0.021) (0.021) ssp Paskl 10 0.030 -0.011 -0.028** -0.029** (0.039) (0.013) (0.009) (0.009) ssm Paskl 10 0.050 0.007 -0.010 -0.010 (0.044) (0.022) (0.017) (0.017) 41 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 44,
    "page_range": "p.44-45",
    "total_pages": 57,
    "chunk_index": 81,
    "word_count": 176,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.44-45)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ssp Pskl 10 0.089* 0.050** 0.035** 0.035** (0.040) (0.016) (0.012) (0.012) ssm Pskl 10 0.017 -0.026 -0.043* -0.043* (0.045) (0.024) (0.021) (0.021) ssp Paskl 10 0.030 -0.011 -0.028** -0.029** (0.039) (0.013) (0.009) (0.009) ssm Paskl 10 0.050 0.007 -0.010 -0.010 (0.044) (0.022) (0.017) (0.017) 41 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Table A.2: Out-of-Sample Portfolio Returns Using Probability of (Anti)Skill as Sorting Variable The table documents out-of-sample portfolio returns using the probability of (anti)skill as sorting variable. In Panel A, the reported numbers are multi-day returns over a 20-day holding period without dynamic rebalancing. In Panel B,thereportednumbersare1-dayreturnsdynamicallyrebalancedovera20-dayholding-period. Standarderrorsare robusttoheteroskedasticity. ∗,∗∗,and∗∗∗ indicatestatisticalsignificanceatthe10%,5%,and1%levels,respectively. (1) (2) (3) (4) Raw FF1 FF3 FF5 Panel A: Buy-and-hold returns ssp Pskl pre 10 2.650*** 0.731*** -0.296* -0.277* (0.339) (0.158) (0.126) (0.127) ssm Pskl pre 10 2.608*** 0.683** -0.242 -0.249 (0.388) (0.214) (0.174) (0.173) ssp Paskl pre 10 2.424*** 0.620*** -0.346*** -0.399*** (0.286) (0.106) (0.091) (0.088) ssm Paskl pre 10 2.737*** 0.762*** -0.363* -0.363* (0.340) (0.160) (0.150) (0.147) Panel B: Dynamically rebalanced returns ssp Pskl pre 10 0.104 0.038 -0.016 -0.020 (0.083) (0.041) (0.033) (0.033) ssm Pskl pre 10 0.067 0.002 -0.041 -0.045 (0.087) (0.042) (0.035) (0.035) ssp Paskl pre 10 0.088 0.025 -0.027 -0.029 (0.072) (0.027) (0.020) (0.020) ssm Paskl pre 10 0.080 0.010 -0.040 -0.040 (0.084) (0.041) (0.033) (0.033) 42 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 45,
    "page_range": "p.45-46",
    "total_pages": 57,
    "chunk_index": 82,
    "word_count": 219,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.45-46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "0.104 0.038 -0.016 -0.020 (0.083) (0.041) (0.033) (0.033) ssm Pskl pre 10 0.067 0.002 -0.041 -0.045 (0.087) (0.042) (0.035) (0.035) ssp Paskl pre 10 0.088 0.025 -0.027 -0.029 (0.072) (0.027) (0.020) (0.020) ssm Paskl pre 10 0.080 0.010 -0.040 -0.040 (0.084) (0.041) (0.033) (0.033) 42 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Table A.3: Determinants of Skilled Finfluencers The table documents the determinants of skilled finfluencers using multivariate regression analysis. Across columns, we vary the construction of the explanatory variables from a 1-day lag (column 1), averaged over the past 2 days (column 2), past 5 days (column 3), past 10 days (column 4), past 20 days (column 5). Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Dep. variable: Pr(α >0) (1) (2) (3) (4) (5) i User activity -1.75*** -1.74*** -1.74*** -1.72*** -1.70*** (0.17) (0.17) (0.17) (0.17) (0.17) No. of followers -0.44*** -0.45*** -0.45*** -0.44*** -0.44*** (0.11) (0.11) (0.11) (0.11) (0.11) No. of followed users -0.11 -0.10 -0.12 -0.11 -0.12 (0.11) (0.11) (0.12) (0.12) (0.12) Positive tweets subsequent to the following events: Positive returns -0.41 -0.92*** -0.67** -0.86*** -0.82*** (0.24) (0.25) (0.23) (0.23) (0.23) Positive social sentiment -1.48** -1.17** -1.05** -1.09** -1.50*** (0.56) (0.43) (0.40) (0.37) (0.39) Negative social sentiment -0.02 -0.52 -0.25 0.65 1.48* (0.34) (0.37) (0.43) (0.50) (0.59) Positive news sentiment -0.25 -0.86 -0.36 -0.52 -0.35 (0.44) (0.47) (0.47) (0.47) (0.47) Negative news sentiment 1.70*** 1.83*** 1.69*** 1.68*** 1.17** (0.37) (0.35) (0.39) (0.41) (0.45) Volatility -0.80*** -0.29 -0.42* -0.32 -0.39 (0.22) (0.23) (0.21) (0.21) (0.21) Retail order imbalance -0.76 -0.40 -0.68 -0.53 -0.47 (0.42) (0.42) (0.41) (0.40) (0.39) Trading volume 1.18* 1.41** 0.86 0.09 0.00 (0.52) (0.49) (0.52) (0.50) (0.50) Short sale constraint -0.21 -0.43 -0.35 -0.35 -0.42 (0.23) (0.23) (0.23) (0.22) (0.23) Negative tweets subsequent to the following events: Positive returns 0.79* 0.78* 0.96** 1.48*** 1.66*** (0.35) (0.35) (0.34) (0.33) (0.33) Positive social sentiment 0.91 2.14* 2.69** 2.70*** 2.96*** (0.85) (0.89) (0.84) (0.72) (0.68) Negative social sentiment -0.74 -1.13 -1.92* -2.08* -2.99*** (0.79) (0.86) (0.90) (0.89) (0.90) Positive news sentiment -0.23 -0.06 -1.25 -1.48* -1.60* (0.65) (0.70) (0.74) (0.71) (0.70) Negative news sentiment -2.14*** -1.96*** -1.62** -1.82** -0.75 (0.49) (0.51) (0.61) (0.65) (0.70) Volatility 0.31 0.09 0.02 -0.21 -0.15 (0.29) (0.29) (0.27) (0.27) (0.27) Retail order imbalance -0.17 -0.48 0.46 0.76 0.14 (0.59) (0.61) (0.55) (0.56) (0.55) Trading volume 1.08 0.81 1.14 1.41* 1.63* (0.78) (0.77) (0.73) (0.71) (0.68) Short sale constraint 0.68* 0.86* 0.88** 0.84* 0.95** (0.34) (0.34) (0.33) (0.33) (0.34) r2 0.027 0.026 0.026 0.028 0.029 N 22016 22022 22022 22021 22014 43 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 46,
    "page_range": "p.46",
    "total_pages": 57,
    "chunk_index": 83,
    "word_count": 435,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.46)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "0.76 0.14 (0.59) (0.61) (0.55) (0.56) (0.55) Trading volume 1.08 0.81 1.14 1.41* 1.63* (0.78) (0.77) (0.73) (0.71) (0.68) Short sale constraint 0.68* 0.86* 0.88** 0.84* 0.95** (0.34) (0.34) (0.33) (0.33) (0.34) r2 0.027 0.026 0.026 0.028 0.029 N 22016 22022 22022 22021 22014 43 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 57,
    "chunk_index": 84,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table A.4: Determinants of Antiskilled Finfluencers The table documents the determinants of antiskilled finfluencers using multivariate regression analysis. Across columns, we vary the construction of the explanatory variables from a 1-day lag (column 1), averaged over the past 2 days (column 2), past 5 days (column 3), past 10 days (column 4), past 20 days (column 5). Standard errors are robusttoheteroskedasticity. ∗,∗∗,and∗∗∗ indicatestatisticalsignificanceatthe10%,5%,and1%levels,respectively. Dep. variable: Pr(α <0) (1) (2) (3) (4) (5) i User activity 0.33 0.32 0.34 0.33 0.31 (0.18) (0.18) (0.18) (0.18) (0.18) No. of followed users 0.03 0.02 0.04 0.04 0.05 (0.12) (0.12) (0.12) (0.12) (0.12) Positive tweets subsequent to the following events: Positive returns 0.26 0.77** 0.47 0.65** 0.55* (0.25) (0.26) (0.24) (0.23) (0.23) Positive social sentiment 1.51* 1.18** 1.21** 1.40*** 1.92*** (0.59) (0.45) (0.42) (0.39) (0.41) Negative social sentiment 0.10 0.62 0.32 -0.86 -2.10*** (0.36) (0.39) (0.46) (0.53) (0.61) Positive news sentiment -0.26 0.28 -0.44 -0.21 -0.12 (0.46) (0.49) (0.50) (0.50) (0.49) Negative news sentiment -2.21*** -2.41*** -2.17*** -2.12*** -1.66*** (0.38) (0.37) (0.41) (0.43) (0.47) Volatility 1.06*** 0.58* 0.77*** 0.68** 0.76*** (0.23) (0.23) (0.22) (0.21) (0.21) Retail order imbalance 0.57 0.41 0.56 0.24 0.31 (0.43) (0.44) (0.43) (0.42) (0.41) Trading volume -0.61 -0.87 -0.19 0.77 0.91 (0.56) (0.51) (0.54) (0.53) (0.52) Short sale constraint 0.56* 0.79*** 0.68** 0.68** 0.76** (0.24) (0.24) (0.24) (0.23) (0.24) Negative tweets subsequent to the following events: Positive returns -0.96** -1.10** -1.18*** -1.63*** -1.90*** (0.34) (0.35) (0.33) (0.33) (0.32) Positive social sentiment -2.15* -3.10*** -3.24*** -3.30*** -3.71*** (0.86) (0.90) (0.86) (0.73) (0.69) Negative social sentiment 1.19 1.05 1.12 1.54 2.91** (0.79) (0.88) (0.94) (0.91) (0.91) Positive news sentiment -0.47 -0.60 0.57 0.91 1.16 (0.64) (0.69) (0.73) (0.71) (0.69) Negative news sentiment 1.92*** 1.84*** 1.38* 1.57* 0.29 (0.50) (0.52) (0.60) (0.66) (0.70) Volatility -0.39 -0.04 -0.07 0.15 0.14 (0.29) (0.29) (0.27) (0.27) (0.27) Retail order imbalance -0.30 0.06 -0.60 -0.92 -0.29 (0.58) (0.60) (0.55) (0.56) (0.55) Trading volume 0.27 0.61 0.50 -0.07 -0.44 (0.78) (0.77) (0.75) (0.72) (0.69) Short sale constraint -0.48 -0.56 -0.61 -0.52 -0.69* (0.34) (0.34) (0.34) (0.33) (0.33) r2 0.022 0.022 0.021 0.023 0.024 N 22016 22022 22022 22021 22014 44 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 47,
    "page_range": "p.47",
    "total_pages": 57,
    "chunk_index": 85,
    "word_count": 357,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.47)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "-0.92 -0.29 (0.58) (0.60) (0.55) (0.56) (0.55) Trading volume 0.27 0.61 0.50 -0.07 -0.44 (0.78) (0.77) (0.75) (0.72) (0.69) Short sale constraint -0.48 -0.56 -0.61 -0.52 -0.69* (0.34) (0.34) (0.34) (0.33) (0.33) r2 0.022 0.022 0.021 0.023 0.024 N 22016 22022 22022 22021 22014 44 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 57,
    "chunk_index": 86,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Table A.5: Determinants of Unskilled Finfluencers Thetabledocumentsthedeterminantsofunskilledfinfluencersusingmultivariateregressionanalysis. Acrosscolumns, we vary the construction of the explanatory variables from a 1-day lag (column 1), averaged over the past 2 days (column 2), past 5 days (column 3), past 10 days (column 4), past 20 days (column 5). Standard errors are robust to heteroskedasticity. ∗, ∗∗, and ∗∗∗ indicate statistical significance at the 10%, 5%, and 1% levels, respectively. Dep. variable: Pr(α =0) (1) (2) (3) (4) (5) i User activity 1.42*** 1.41*** 1.40*** 1.39*** 1.39*** (0.07) (0.07) (0.07) (0.07) (0.07) No. of followers 0.03 0.03 0.02 0.03 0.03 (0.04) (0.04) (0.04) (0.04) (0.04) No. of followed users 0.08* 0.08* 0.08* 0.07 0.08 (0.04) (0.04) (0.04) (0.04) (0.04) Positive tweets subsequent to the following events: Positive return 0.15* 0.14 0.21** 0.21** 0.27*** (0.07) (0.07) (0.07) (0.07) (0.07) Positive social sentiment -0.03 -0.01 -0.17 -0.30* -0.42*** (0.18) (0.14) (0.13) (0.12) (0.12) Negative social sentiment -0.08 -0.10 -0.07 0.20 0.62*** (0.11) (0.12) (0.15) (0.16) (0.19) Positive news sentiment 0.51*** 0.58*** 0.80*** 0.73*** 0.47** (0.13) (0.15) (0.15) (0.15) (0.15) Negative news sentiment 0.51*** 0.58*** 0.48*** 0.45*** 0.48*** (0.11) (0.11) (0.12) (0.13) (0.14) Volatility -0.26*** -0.30*** -0.35*** -0.36*** -0.37*** (0.07) (0.07) (0.06) (0.06) (0.06) Retail order imbalance 0.19 -0.01 0.12 0.29* 0.16 (0.13) (0.13) (0.13) (0.12) (0.12) Trading volume -0.57** -0.54*** -0.67*** -0.87*** -0.91*** (0.17) (0.16) (0.16) (0.16) (0.16) Short sale constraint -0.34*** -0.36*** -0.33*** -0.33*** -0.34*** (0.07) (0.07) (0.07) (0.07) (0.07) Negative tweets subsequent to the following events: Positive return 0.17 0.32** 0.22* 0.15 0.23* (0.10) (0.10) (0.10) (0.10) (0.10) Positive social sentiment 1.24*** 0.96*** 0.55* 0.60** 0.75*** (0.26) (0.28) (0.26) (0.23) (0.21) Negative social sentiment -0.45 0.08 0.79** 0.54 0.08 (0.24) (0.27) (0.29) (0.28) (0.27) Positive news sentiment 0.70*** 0.67*** 0.68** 0.57** 0.44* (0.18) (0.19) (0.21) (0.20) (0.20) Negative news sentiment 0.22 0.12 0.24 0.25 0.46* (0.15) (0.15) (0.17) (0.19) (0.20) Volatility 0.07 -0.05 0.04 0.06 0.02 (0.09) (0.09) (0.08) (0.08) (0.08) Retail order imbalance 0.47** 0.41* 0.15 0.16 0.16 (0.17) (0.17) (0.16) (0.16) (0.16) Trading volume -1.35*** -1.41*** -1.65*** -1.35*** -1.20*** (0.24) (0.24) (0.23) (0.22) (0.21) Short sale constraint -0.20* -0.30** -0.26** -0.32*** -0.27** (0.10) (0.10) (0.10) (0.10) (0.09) r2 0.099 0.099 0.100 0.100 0.102 N 22016 22022 22022 22021 22014 45 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 48,
    "page_range": "p.48",
    "total_pages": 57,
    "chunk_index": 87,
    "word_count": 373,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.48)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "0.16 0.16 (0.17) (0.17) (0.16) (0.16) (0.16) Trading volume -1.35*** -1.41*** -1.65*** -1.35*** -1.20*** (0.24) (0.24) (0.23) (0.22) (0.21) Short sale constraint -0.20* -0.30** -0.26** -0.32*** -0.27** (0.10) (0.10) (0.10) (0.10) (0.09) r2 0.099 0.099 0.100 0.100 0.102 N 22016 22022 22022 22021 22014 45 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Appendix",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 57,
    "chunk_index": 88,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Appendix (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Azar, Pablo D and Andrew W Lo (2016). “The wisdom of Twitter crowds: Predicting stock market reactions to FOMC meetings via Twitter feeds”. In: The Journal of Portfolio Management 42.5, pp. 123–134. Ballinari, Daniele and Simon Behrendt (2021). “How to gauge investor behavior? A comparison of online investor sentiment measures”. In: Digital Finance 3.2, pp. 169–204. Barber, Brad M. and Terrance Odean (Dec. 2007). “All That Glitters: The Effect of Attention and News on the Buying Behavior of Individual and Institutional Investors”. In: The Review of Financial Studies 21.2, pp. 785–818. Bartov, Eli, Lucile Faurel, and Partha S Mohanram (2018). “Can Twitter help predict firm-level earnings and stock returns?” In: The Accounting Review 93.3, pp. 25–57. Berk, Jonathan B. and Jules H. Van Binsbergen (2022). “Regulation of Charlatans in High-Skill Professions”. In: The Journal of Finance 77.2, pp. 1219–1258. Boehmer, Ekkehart, Charles M Jones, Xiaoyan Zhang, and Xinran Zhang (2021). “Tracking retail investor activity”. In: The Journal of Finance 76.5, pp. 2249–2305. Boehmer, Ekkehart, Charles M. Jones, and Xiaoyan Zhang (2008). “Which Shorts Are Informed?” In: The Journal of Finance 63.2, pp. 491–527. Campbell, John L, Jenna D’Adduzio, and James Moon (2021). “Everyone Has an Opinion: The Informativeness of Social Media’s Response to Management Guidance”. In: Working Paper. Campbell, John L, Matthew D DeAngelis, and James R Moon (2019). “Skin in the game: Per- sonal stock holdings and investors’ response to stock analysis on social media”. In: Review of Accounting Studies 24.3, pp. 731–779. Chen, Hailiang, Prabuddha De, et al. (2014). “Wisdom of crowds: The value of stock opinions transmitted through social media”. In: The Review of Financial Studies 27.5, pp. 1367–1403. Chen,Yong,MichaelCliff,andHaibeiZhao(2017).“HedgeFunds:TheGood,theBad,andtheLucky”. In: Journal of Financial and Quantitative Analysis 52.3, pp. 1081–1109. Cookson, J Anthony, Joseph E Engelberg, and William Mullins (Aug. 2022). “Echo Chambers”. In: The Review of Financial Studies 36.2, pp. 450–500. Cookson, J. Anthony, Rinjing Lu, et al. (2022). “The Social Signal”. In: Working Paper. Crane, Alan and Kevin Crotty (2020). “How skilled are security analysts?” In: The Journal of Finance 75.3, pp. 1629–1675. Crawford, Steven, Wesley Gray, Bryan R Johnson, et al. (2018). “What motivates buy-side analysts to share recommendations online?” In: Management science 64.6, pp. 2574–2589. Crawford, Steven S, Wesley R Gray, and Andrew E Kern (2017). “Why do fund managers identify and share profitable ideas?” In: Journal of Financial and Quantitative Analysis 52.5, pp. 1903– 1926. 46 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "References",
    "page_number": 49,
    "page_range": "p.49",
    "total_pages": 57,
    "chunk_index": 89,
    "word_count": 399,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.49)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "motivates buy-side analysts to share recommendations online?” In: Management science 64.6, pp. 2574–2589. Crawford, Steven S, Wesley R Gray, and Andrew E Kern (2017). “Why do fund managers identify and share profitable ideas?” In: Journal of Financial and Quantitative Analysis 52.5, pp. 1903– 1926. 46 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 57,
    "chunk_index": 90,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Currarini, Sergio, Matthew O. Jackson, and Paolo Pin (2009). “An Economic Model of Friendship: Homophily, Minorities, and Segregation”. In: Econometrica 77.4, pp. 1003–1045. Curtis, Asher, Vernon J Richardson, and Roy Schmardebeck (2014). “Investor attention and the pricing of earnings news”. In: Handbook of Sentiment Analysis in Finance, Forthcoming. Dim, Chukwuma (2022). “Should retail investors listen to social media analysts? evidence from text-implied beliefs”. In: Working Paper. Engelberg, Joseph E., Adam V. Reed, and Matthew C. Ringgenberg (2012). “How are shorts in- formed?: Short sellers, news, and information processing”. In: Journal of Financial Economics 105.2, pp. 260–278. Farrell, Michael et al. (2022). “The democratization of investment research and the informativeness of retail investor trading”. In: Journal of Financial Economics 145.2, pp. 616–641. Giannini, Robert, Paul Irvine, and Tao Shu (2018). “Nonlocal disadvantage: An examination of social media sentiment”. In: The Review of Asset Pricing Studies 8.2, pp. 293–336. Golub,BenjaminandMatthewO.Jackson(July2012).“HowHomophilyAffectstheSpeedofLearn- ing and Best-Response Dynamics”. In: The Quarterly Journal of Economics 127.3, pp. 1287– 1338. Groß-Klußmann, Axel, Stephan Ko¨nig, and Markus Ebner (2019). “Buzzwords build momentum: Global financial Twitter sentiment and the aggregate stock market”. In: Expert Systems with Applications 136, pp. 171–186. Harvey, Campbell R and Yan Liu (Feb. 2018). “Detecting Repeatable Performance”. In: The Review of Financial Studies 31.7, pp. 2499–2552. Jame, Russell et al. (2016). “The value of crowdsourced earnings forecasts”. In: Journal of Account- ing Research 54.4, pp. 1077–1110. Kandel, Denise B. (1978). “Homophily, Selection, and Socialization in Adolescent Friendships”. In: American Journal of Sociology 84.2, pp. 427–436. (Visited on 01/28/2023). Lazarsfeld, Paul F, Robert K Merton, et al. (1954). “Friendship as a social process: A substantive and methodological analysis”. In: Freedom and control in modern society 18.1, pp. 18–66. McPherson, Miller, Lynn Smith-Lovin, and James M. Cook (2001). “Birds of a Feather: Homophily in Social Networks”. In: Annual Review of Sociology 27, pp. 415–444. (Visited on 01/28/2023). Miller,EdwardM(1977).“Risk,uncertainty,anddivergenceofopinion”.In:The Journal of Finance 32.4, pp. 1151–1168. Pedersen, Lasse Heje (2022). “Game on: Social networks and markets”. In: Journal of Financial Economics 146.3, pp. 1097–1119. Sprenger, Timm O et al. (2014). “Tweets and trades: The information content of stock microblogs”. In: European Financial Management 20.5, pp. 926–957. 47 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "References",
    "page_number": 50,
    "page_range": "p.50",
    "total_pages": 57,
    "chunk_index": 91,
    "word_count": 362,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.50)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "Finance 32.4, pp. 1151–1168. Pedersen, Lasse Heje (2022). “Game on: Social networks and markets”. In: Journal of Financial Economics 146.3, pp. 1097–1119. Sprenger, Timm O et al. (2014). “Tweets and trades: The information content of stock microblogs”. In: European Financial Management 20.5, pp. 926–957. 47 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "References",
    "page_number": 1,
    "page_range": "p.1",
    "total_pages": 57,
    "chunk_index": 92,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "References (p.1)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "A Alternative Specifications for the Distribution of True Alphas Table IA.1 reports the estimated distribution of true alphas assuming one and three components for types1and3. ThelikelihoodvalueandtheAICandBICcriteriaimproveconsiderablymovingfrom one component to two. However, adding the third component does not improve the fit by much. We also repeat our tests of goodness of fit for these alternative models. In KS tests, the model with K+ = K− = 1 is rejected at the 10%/5%/1% level for 100%/100%/98.2% of simulations. For the model with K+ = K− = 3, the KS tests reject the null hypothesis at the 10%/5%/1% level for 6.20%/2.50%/0.30% of simulations. Figures – to – (– to –) show how close the estimated distribution and the data are for K+ = K− = 1(3). 1 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Table IA.1: Robustness: Alternative Specifications of the Mixture Model This table reports the results of fitting mixture models with one, two, and three components for skilled and antiskilled users. Means and probabilities are reported in percentage points. (1) (2) (3) K+ =K− =1 K+ =K− =2 K+ =K− =3 Mean Fraction of Mean Fraction of Mean Fraction of alpha (%) users (%) alpha (%) users (%) alpha (%) users (%) Skilled type 3 7.41 4.4 Skilled type 2 6.76 5.9 2.75 7.2 Skilled type 1 4.16 15.3 1.42 21.7 0.99 18.9 Unskilled 0.00 56.5 0.00 16.0 0.00 1.4 Antiskilled type 1 -4.33 28.3 -1.06 45.6 -0.44 35.5 Antiskilled type 2 -7.53 10.9 -1.82 24.1 Antiskilled type 3 -8.38 8.5 N 29,477 29,477 29,477 Log Likelihood -86,981 -86,385 -86,363 AIC 173,971 172,786 172,750 BIC 173,981 172,806 172,780 2 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 51,
    "page_range": "p.51-52",
    "total_pages": 57,
    "chunk_index": 93,
    "word_count": 271,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.51-52)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "0.00 56.5 0.00 16.0 0.00 1.4 Antiskilled type 1 -4.33 28.3 -1.06 45.6 -0.44 35.5 Antiskilled type 2 -7.53 10.9 -1.82 24.1 Antiskilled type 3 -8.38 8.5 N 29,477 29,477 29,477 Log Likelihood -86,981 -86,385 -86,363 AIC 173,971 172,786 172,750 BIC 173,981 172,806 172,780 2 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Panel A: Estimated and simulated alphas 0.175 0.150 0.125 0.100 0.075 0.050 0.025 0.000 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) ytisneD Simulation 1.0 Data 0.8 0.6 0.4 0.2 0.0 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) FDC Simulation Data Panel B: Estimated and simulated t-stats 0.30 0.25 0.20 0.15 0.10 0.05 0.00 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 t ytisneD Simulation 20 Data 10 0 10 20 20 15 10 5 0 5 10 15 20 Alpha (%, Data) )noitalumiS ,%( ahplA y=x Q-Q FigureIA.1: EstimatedandSimulatedAlphasandTheirt-StatsFromtheModelwithK+ = K− = 1 In Panel A, the left plot shows histograms of estimated and simulated alphas. In Panel A, the right plot shows the average cdf of simulated alphas from the fitted model against estimated alphas from the data. In Panel B, the left plot shows histograms of the estimated and simulated t-stats. In Panel B, the right plots show a Q-Q plot of the estimated and simulated alphas. 3 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 53,
    "page_range": "p.53-54",
    "total_pages": 57,
    "chunk_index": 94,
    "word_count": 224,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.53-54)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "cdf of simulated alphas from the fitted model against estimated alphas from the data. In Panel B, the left plot shows histograms of the estimated and simulated t-stats. In Panel B, the right plots show a Q-Q plot of the estimated and simulated alphas. 3 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 Panel A: Estimated and simulated alphas 0.16 0.14 0.12 0.10 0.08 0.06 0.04 0.02 0.00 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) ytisneD Simulation 1.0 Data 0.8 0.6 0.4 0.2 0.0 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 Alpha (%) FDC Simulation Data Panel B: Estimated and simulated t-stats 0.30 0.25 0.20 0.15 0.10 0.05 0.00 10.0 7.5 5.0 2.5 0.0 2.5 5.0 7.5 10.0 t ytisneD Simulation 20 Data 10 0 10 20 20 15 10 5 0 5 10 15 20 Alpha (%, Data) )noitalumiS ,%( ahplA y=x Q-Q FigureIA.2: EstimatedandSimulatedAlphasandTheirt-StatsFromtheModelwithK+ = K− = 3 In Panel A, the left plot shows histograms of estimated and simulated alphas. In Panel A, the right plot shows the average cdf of simulated alphas from the fitted model against estimated alphas from the data. In Panel B, the left plot shows histograms of the estimated and simulated t-stats. In Panel B, the right plots show a Q-Q plot of the estimated and simulated alphas. 4 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 54,
    "page_range": "p.54-55",
    "total_pages": 57,
    "chunk_index": 95,
    "word_count": 225,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.54-55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "cdf of simulated alphas from the fitted model against estimated alphas from the data. In Panel B, the left plot shows histograms of the estimated and simulated t-stats. In Panel B, the right plots show a Q-Q plot of the estimated and simulated alphas. 4 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 snoziroH tnereffiD ot ssentsuboR :s’α eurT fo noitubirtsiD eht gnitamitsE :2.AI elbaT etaluclac eW .0 = α ta ssam a dna ,0 < α no slaitnenopxe owt ,0 > α eht no slaitnenopxe owt htiw sledom erutxim gnittfi fo stluser eht stroper elbat sihT eht swohs snmuloc eht fo pot eht ta rebmun tsrfi ehT .ledom rotcaf-evfi hcnerF-amaF eht gnisu syad gnidart 02 dna ,01 ,5 ,2 ,1 txen eht revo snruter ssecxe nmuloc tsrfi eht ,noziroh hcae roF .steewt reh retfa snruter detsujda dengis fo egareva eht si resu hcae rof )α˜( ahpla detamitse ehT .snruter erutuf fo noziroh ni era seitilibaborp dna snaeM .)s’π( erutxim eht ni tnenopmoc eht fo thgiew eht swohs nmuloc dnoces eht dna ,)s’µ( tnenopmoc hcae fo naem eht swohs .stniop egatnecrep )5( )4( )3( )2( )1( 02= H 01= H 5= H 2= H 1= H fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla 9.5 67.6 5.4 81.5 2.4 34.3 7.1 12.3 4.2 66.2 1 epyt dellikS 7.12 24.1 4.81 81.1 9.81 86.0 0.61 86.0 6.71 43.0 2 epyt dellikS 0.61 00.0 5.32 00.0 9.52 00.0 6.84 00.0 4.94 00.0 delliksnU 6.54 60.1- 6.24 46.0- 5.24 64.0- 1.92 24.0- 5.62 82.0- 1 epyt delliksitnA 9.01 35.7- 0.11 18.4- 4.8 36.3- 6.4 96.2- 2.4 43.2- 2 epyt delliksitnA 774,92 450,03 571,03 923,03 027,03 N 583,68 202,77 284,66 795,35 484,44 doohilekiL goL 886,271- 223,451- 288,231- 211,701- 688,88- CIB 457,271- 983,451- 949,231- 971,701- 359,88- CIA 5 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 55,
    "page_range": "p.55",
    "total_pages": 57,
    "chunk_index": 96,
    "word_count": 322,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.55)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "24.0- 5.62 82.0- 1 epyt delliksitnA 9.01 35.7- 0.11 18.4- 4.8 36.3- 6.4 96.2- 2.4 43.2- 2 epyt delliksitnA 774,92 450,03 571,03 923,03 027,03 N 583,68 202,77 284,66 795,35 484,44 doohilekiL goL 886,271- 223,451- 288,231- 211,701- 688,88- CIB 457,271- 983,451- 949,231- 971,701- 359,88- CIA 5 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 57,
    "chunk_index": 97,
    "word_count": 50,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "ledoM rotcaF-eerhT hcnerF-amaF gnisU :s’α eurT fo noitubirtsiD eht gnitamitsE :3.AI elbaT etaluclac eW .0 = α ta ssam a dna ,0 < α no slaitnenopxe owt ,0 > α eht no slaitnenopxe owt htiw sledom erutxim gnittfi fo stluser eht stroper elbat sihT eht swohs snmuloc eht fo pot eht ta rebmun tsrfi ehT .ledom rotcaf-eerht hcnerF-amaF eht gnisu syad gnidart 02 dna ,01 ,5 ,2 ,1 txen eht revo snruter ssecxe nmuloc tsrfi eht ,noziroh hcae roF .steewt reh retfa snruter detsujda dengis fo egareva eht si resu hcae rof )α˜( ahpla detamitse ehT .snruter erutuf fo noziroh ni era seitilibaborp dna snaeM .)s’π( erutxim eht ni tnenopmoc eht fo thgiew eht swohs nmuloc dnoces eht dna ,)s’µ( tnenopmoc hcae fo naem eht swohs .stniop egatnecrep )5( )4( )3( )2( )1( 02= H 01= H 5= H 2= H 1= H fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM fo noitcarF naeM )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla )%( sresu )%( ahpla 3.5 53.7 6.4 71.5 4.4 44.3 1.2 39.2 5.2 16.2 1 epyt dellikS 5.12 76.1 4.91 22.1 3.81 17.0 9.71 06.0 8.71 43.0 2 epyt dellikS 6.91 00.0 5.72 00.0 8.72 00.0 3.64 00.0 7.05 00.0 delliksnU 4.24 91.1- 7.83 78.0- 5.14 35.0- 1.92 44.0- 0.52 03.0- 1 epyt delliksitnA 2.11 17.7- 9.9 31.5- 9.7 77.3- 6.4 86.2- 1.4 23.2- 2 epyt delliksitnA 774,92 450,03 571,03 923,03 027,03 N 446,78 841,87 811,76 669,35 477,44 doohilekiL goL 502,571- 412,651- 351,431- 058,701- 664,98- CIB 172,571- 082,651- 912,431- 619,701- 235,98- CIA 6 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 56,
    "page_range": "p.56",
    "total_pages": 57,
    "chunk_index": 98,
    "word_count": 272,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.56)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  },
  {
    "text": "44.0- 0.52 03.0- 1 epyt delliksitnA 2.11 17.7- 9.9 31.5- 9.7 77.3- 6.4 86.2- 1.4 23.2- 2 epyt delliksitnA 774,92 450,03 571,03 923,03 027,03 N 446,78 841,87 811,76 669,35 477,44 doohilekiL goL 502,571- 412,651- 351,431- 058,701- 664,98- CIB 172,571- 082,651- 912,431- 619,701- 235,98- CIA 6 EElleeccttrroonniicc ccooppyy aavvaaiillaabbllee aatt:: hhttttppss::////ssssrrnn..ccoomm//aabbssttrraacctt==44442288223322 : Swiss Finance Institute Swiss Finance Institute (SFI) is the national center for fundamental research, doctoral training, knowledge exchange, and continuing education in the fields of banking and finance. SFI’s mission is to grow knowledge capital for the Swiss financial marketplace. Created in 2006 as a public–private partnership, SFI is a common initiative of the Swiss finance industry, leading Swiss universities, and the Swiss Confederation. c/o University of Geneva, Bd. Du Pont d'Arve 42, CH-1211 Geneva 4 T +41 22 379 84 71, rps@sfi.ch, www.sfi.ch 1",
    "title": "Finfluencers",
    "source_type": "pdf",
    "document_id": "4bf03dee79b4",
    "source_file": "Finfluencers.pdf",
    "section": "Internet Appendix",
    "page_number": 57,
    "page_range": "p.57",
    "total_pages": 57,
    "chunk_index": 99,
    "word_count": 136,
    "author": "",
    "video_id": "",
    "video_url": "",
    "video_url_with_timestamp": "",
    "start_timestamp": "Internet Appendix (p.57)",
    "start_timestamp_seconds": 0,
    "upload_date": "D:20230425015209Z",
    "duration": null
  }
]